{"user_rating": 4.5, "review_count": 987, "name": "Disney's Yacht Club Resort", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I'm dumbfounded by all the positive reviews of this hotel! My husband and I are frequent business travelers and have a lot of domestic and international hotel experience and have never paid so much for so little. I agree the grounds and lobby area of the hotel are beautiful and (seemingly) clean - but the entire experience goes downhill on the journey down the very long room corridors.", "title": "Not at all what we expected", "helpfulness": 3, "user": "kbergmann", "date": "May 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 16038917, "likes": {"liked": "— location", "disliked": "— cockroaches and overall filth"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The hotel - beyond the lobby - is certainly showing wear and tear and corresponding filth. The experience just does not match the price tag - for Ritz-type prices, just know that this aint the Ritz.", "title": "A true Disney experience", "helpfulness": 1, "user": "tripper1988", "date": "May 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15873263}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The first 'upgraded' room we were in was just plain dirty. My first and worst complaint is of cockroaches. Right there in plain view. Beyond that - there's no attention to detail whatsoever (for example, someone had obviously spilled some sort of liquid on the top of the dresser - which had been wiped, but the spill continued all down the front). The TV looked like something from another era. Again, for a premium price, isn't it reasonable to expect a premium experience?", "title": "Three time's a charm", "helpfulness": 2, "user": "spring07", "date": "May 9, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15863768, "likes": {"liked": "— location", "disliked": "— did not honor initial requests"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The second room (not wanting to bunk with the cockroaches) was slightly more clean and had a post- year 2000 TV, but again we had cockroach issues. When addressed with a manager, she seemed shocked that we were the first complaint of cockroaches - for the week. Perhaps a bouquet of flowers would make us feel better?", "title": "Nice Disney-run Resort at WDW", "helpfulness": 4, "user": "Tax_Counsel", "date": "May 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15781519, "likes": {"liked": "— location", "disliked": "— Check-in / room selection process"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "There were numerous other examples of this just not meeting up to what we think of as a Disney-experience. We really were surprised at all the ways they fell down on cleanliness and overall hotel management.", "title": "Beautiful hotel", "helpfulness": 1, "user": "travelmore149362", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15736972, "likes": {"liked": "— Location, decor, room size, service", "disliked": "— Could use more breakfast options."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Family of four (two children 8 & 5) just returned to NY from Yacht Club. Incredible vacation - was upgarded to Concierge Level - service was wonderful - they could not have done more for us. We had a water view on the 5th floor - actually preferred this hotel way more than the Beach Club. Did not have to even leave the resort if we did not want to . Can't wait to go back - Darvin Nunez was an incredible employee who welcomed my children with open arms :) Thank you so much!!", "title": "Wonderful vacation!!", "user": "smile5", "date": "July 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17620593, "likes": {"liked": "— Location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We have just returned from disney and the yacht club...we have stayed there 5 times before. We always stay at beach, yacht or boardwalk. Our room was great and location too. On this visit the hotel was full with corporate people going to conventions and I felt like I was attending one too. The people made a definite effort to make sure you knew they were working. At times it felt uncomfortable to be on the elevator with a bathing suit cover up on...and do not try to get a bite to eat while they are on the lunch break. I know conventions are a money maker for the resort, but does it have to be at the expense of a family looking for the magic?", "title": "too corporate...", "helpfulness": 1, "user": "carol_a_2004", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17206496, "likes": {"liked": "— location", "disliked": "— the corporate tag wearers"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "Just returned from my family's annual visit to Walt Disney World. I've gone about 10 times over the years every year and usually enjoy my stay. After staying at the Grand Floridian for the past few years, my mom and I decided to stay and try something different with The Yacht & Beach Club. Boy was this a mistake. This hotel is completely overrated. Now it was really hot and humid, that's not the resort's fault but the air conditioning in nearly every section of the hotel is turned on far too high. I even tried to make it lower but it was impossible. I got a bad cold from the air conditioning being on too high.", "title": "Overrated beyond belief", "helpfulness": 1, "user": "hinoone", "date": "June 22, 2008", "detail_rating": {"value": 2.0}, "id": 17127759}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The staff is very helpful but housekeeping needs some work. First off, they don't do anything but give you fresh towels every day, toilitries and make the bed. They certainly don't vaccum every day or clean the bathroom sinks, because my mother had to clean it every single day.", "title": "What a wonderful hotel-don't understand the bad reviews!!!!!!!", "helpfulness": 5, "user": "Cheermom4", "date": "May 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16387955}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The Yacht Club Galley to eat breakfast in every day was horrible. The eggs were runny, the bread over-toasted. The service in the restaurant was ridiculous. Charging you 99 cents for cheese in eggs is silly. You're paying good money. Compared to the Grand Floridian this hotel is horrible. It's considered a Deluxe hotel. The same amentities should be provided for all. But it's not. The rooms are not as big as the Grand Floridian.", "title": "Don't stay in Room 4210!!", "user": "NMNativeinDallas", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 16211888, "likes": {"liked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My husband, 3 year old daughter & I just returned from staying at the Yacht Club on the Concierge level. Yes, it's a bit expensive, but worth every penny! We booked our trip 2 weeks before visiting during the peak Easter break time & got fabulous reservations for all the places we wanted to eat with no problems at all. We even got into Cinderella's castle for breakfast (which you normally have to book months in advance). Check in was flawless, the staff was very attentive & we loved getting a quick bite before heading to the parks early. We'd return around 5:00 & have a nice 'snack' before eating a late dinner. They had soup every night, the BEST peanut butter & jelly sandwiches, vegetables, cheese & crackers. It was nice to come back for that afternoon break & then return for another round at the park later in the evening. We found our room very clean & quiet too. Our room overlooked Stormalong Bay (pool area) which closed at 9:00 p.m. and we could watch Epcot's fireworks from our balcony too. The transportation to all of the parks was very efficient & we had no problems at all. I also suggest if you have a young child to book the character breakfast at Cape May restaurant located at the Beach Club (which is attached to the Yacht Club) on your departure day. The breakfast was GREAT. They had really good food & you get to dine with Minnie, Goofy, Chip & Dale. We did several character breakfasts & this was the loudest but not unbearable. We loved the Yacht Club & have already suggested it to several friends. Spend the extra money & book on the concierge level. You won't be dissapointed!", "title": "LOVED the Yacht Club - Go Concierge Level!", "helpfulness": 7, "user": "Disneyfan15", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7347988, "likes": {"liked": "— The pool", "disliked": "— Not on monorail system to Magic Kingdom"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Disney’s Yacht Club is a fun place to stay. The hotel itself is large, decorated in a nautical motif with polished wood floors and large globe in the lobby. There is a Disney ticket desk in the lobby which is convenient. Check in was brief, polite and painless. While not precisely luxury standards (e.g. Mandarin Oriental), the room was nicely decorated, the beds comfortable and there was a balcony that overlooked a courtyard with a pool. The bathroom was sufficiently large. There was a small refrigerator which allowed us to store milk for our toddler. We ate one night at the Yacht Galley which was not terribly overpriced (n.b. this is by New York standards). The food was OK. There was an ice cream parlor also that was overpriced, but fun nonetheless.", "title": "Shipshape with only a couple barnacles", "helpfulness": 5, "user": "ReviewableName", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7301006, "likes": {"liked": "— The pool", "disliked": "— Housekeeping"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The resort location was wonderful. You really can’t get any closer to Epcot. The pools were phenomenal. There was a large sandbottomed wading pool that our three year old absolutely adored. It was heated to bathwater temperatures, which was especially nice as the best that Florida could muster during our trip was a couple of 70 degree days. Our son was actually disappointed when it became too cold to swim and we “had” to go to the theme parks. For older kids, there was also a whirlpool and a large waterslide.", "title": "Lively Location", "helpfulness": 8, "user": "TravelinBuddy", "date": "February 19, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6814467, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "There were two negatives about the hotel. The first was the cost. This is relative minus. I knew the hotel would be somewhat pricey but concluded it wouldn’t be an unreasonable trade off for the full Disney experience. That being said, I thought the bellstaff were a little aggressive in pushing the $10 per day valet parking. While self parking wasn’t exceptionally close, compared to a day trekking through the theme parks, it was a short stroll. The second negative, which prevents me from giving the hotel five stars, was the housekeeping. Throughout our stay, the maid consistently neglected to change a coffee stained coversheet on one of our beds. In light of how meticulous Disney normally is, I expected better.", "title": "For the Price, I expected More... I will go back to renting Homes", "helpfulness": 4, "user": "LLC", "date": "February 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6809567, "likes": {"liked": "— The Staff and the Pools", "disliked": "— The rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Nonetheless, we had a wonderful time and if you are not looking to spend every waking minute at the theme parks and are willing to splurge a little, this might be the place for you.", "title": "Bring your earplugs !", "helpfulness": 8, "user": "snaggletooth", "date": "February 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6781902, "likes": {"liked": "— Magic express service and on-site airline luggage check", "disliked": "— Very thin walls and constant noise"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Our family of 5 (kids ages, 13, 10 & 7) have been planning a Disney World trip for several years. At the time that we booked our vacation, a big decision was where we were going to stay. We read a lot of reviews, and from the reviews and talking to our travel agent (Yacht Club allows 5 to a room), we decided on the Yacht Club! It was one of the best decisions we made about our trip, and will stay again when we go back to Disney World. I don't know what other traveler's EXPECT when they go on vacation, but the hotel and rooms are very nice!!! For 5 people, we felt very comfortable. 2 queen beds and a day bed perfect for our 7 year old. They keep the hotel VERY clean, and are constantly keeping it that way! Our room was more than adequate and the maid service did an excellent job providing towels, and cleaning up the room each day. If you get the chance, take advantage of a day at the hotel. Our children insisted to skip an afternoon at Magic Kingdom to go back to the Yacht Club for a few hours to swim in their awecome beachside pool, and relax at the hotel. We are so glad we did. That was one of the best parts of our trip! Also, we recommend going to the \"Market\" at the Beach Club just next door for snacks and drinks for your room or to take along to the parks! We ate breakfast here almost every morning, and saved $$ because we decided NOT to take the dining plan. Also, the character restaurant at the Beach Club is well worth the money, but book as soon as you arrive as it fills up fast. We also recommend taking an evening to spend around the Boardwalk in the back of the Yacht and Beach Club Resorts. There is always a lot to see and do that is entertaining, and we highly recommend taking a family bike ride on one of the Boardwalks bikes for 4 or 5. We had more laughs with this then we did all week. The staff is very friendly, and we were welcomed \"home\" every day after a full day at the parks. What a nice way to end the day. We would definitely stay here again! It was one of the best parts of our trip! I would say that if you only like the \"Ritz\" to stay, then go someplace else, but you would be missing out on a vacation of a lifetime!!!", "title": "Yacht Club made our stay at Disney World an unforgettable one!", "helpfulness": 2, "user": "Fab5Family", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18394593, "likes": {"liked": "— Location and pool", "disliked": "— Long hallways to get to our room"}}, {"rating": 3.0, "title": "Not What I Expected", "text": "This hotel is average overall and dated. The decor looks like it hasn't been updated since the early 90's. You will certainly see this the moment you step on the elevator if you hadn't noticed it in the lobby. The TV in the room is an old Philips. One might expect an LCD at a \"Deluxe\" resort, but no. Something else that was disappointing is that we could only get luke warm water, never hot, for the shower/tub. The ice machine on our floor didn't work. Vending machines are only on the first floor in a \"Guest Laundry\" area which is way out of the way, and after the trip, none of them would take our money or cards. I would suggest checking out other \"Deluxe\" lodging in the area if that is what you are expecting for the price. This property needs attention.", "helpfulness": 2, "user": "DTNPROMAN", "date": "July 27, 2008", "id": 18323895}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "There are so many unique and one of kind hotels in Disney to stay at and my family prefers two of them = Yacht Club and Animal Kingdom Lodge. The Yacht Club is so nice. The Decor and overall layout are perfect. The pool is to die for - one of the most unique and fun pools at any resort, anywere. The location makes this hotel tops from some of the others. You are a short walking distance from a special back entrance to EPCOT. You are located on the boardwalk which includes an ESPN restaurant and other shops and stuff. You are a boat ride away from MGM Hollywood (I still want to call it MGM, sorry) Studios.", "title": "Fantastic Hotel, Location and Experience", "helpfulness": 6, "user": "G8RED", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18284128, "likes": {"liked": "— Location, Pool and Experience", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "For the life of me I can not believe the 1-2 star reviews of this place. When you glance at the \"top resorts\" as rated by tripadvisor members and see that hotels such as farfield, hampton, etc are rated above places such as this then that makes you wonder about the tastes of some people. Its unfortunate some people like to complain about the smallest thing.....anyone who would seriously rate this hotel would give it a 5 or 4.", "title": "Perfect place, perfect location!", "helpfulness": 3, "user": "MadHatter08", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18018462}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "My husband and I recently spent a week at Disney's Yacht Club Resort. Our experience there was nothing but positive. We absolutely loved it and can't wait to go back! We booked a waterview room with a king sized bed. The hotel room was very large with plenty of walking room, sitting area and balcony. The room didn't feel cramped at all. We had a beautiful view of the marina from our room. We experienced nothing but wonderful service from all the employees. Everyone was friendly and helpful. We found the resort great for couples!", "title": "Ended up her because my dad got the flu", "user": "jameygamer", "date": "July 9, 2008", "detail_rating": {"value": 5.0}, "id": 17697368}, {"rating": 5.0, "title": "absolutely a deluxe property! wonderful..", "text": "First I should mention that I am a travel agent and was traveling to Disney (and Universal) to inspect the properties and gain more info.on this destination. I should also mention that we have either been to or stayed at all of Disneys properties.", "helpfulness": 12, "user": "justplaingoofy", "date": "May 17, 2007", "id": 7636822}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed 4 nights at Yacht Club and 3 nights at Universal Hard Rock (also has a seperate review).", "title": "Awesome!!!!", "helpfulness": 3, "user": "dkmsjones", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7580302, "likes": {"liked": "— Location and Pool"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed in a \"standard\" room. No upgrades or special treatment for those of you wondering.", "title": "Nice hotel with issues...Not worth the extra $$$...", "helpfulness": 4, "user": "Vsgirl8600", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 1.0, "rooms": 3.0}, "id": 7557224, "likes": {"liked": "— Transpotation options to and from amusement parks."}}, {"rating": 4.0, "title": "ok if you like big", "text": "I picked the Yacht Club because of the location. We would have booked Beach Club (next door) but they do not have many full size balconies where Yacht Club offers full balconies. We like the balconies incase one of us wants to sleep in the other can go outside w/ a cup of coffee & book. Also, if you are traveling w/ children its a nice little spot to get away.", "helpfulness": 6, "user": "akupupule", "date": "May 6, 2007", "id": 7553002}, {"rating": 5.0, "stay_parameters": "Stayed May 2004, traveled with family", "text": "Location: Perfect. close proximity to MGM & Epcot.", "title": "The Best", "helpfulness": 5, "user": "jtrain75", "date": "April 18, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 7390737, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "This was our 5th trip to Disney World and we have stayed onsite for all. This was our first stay at the Yacht Club (we have stayed at the Beach Club, Beach Club Villas, Contemporary Resort and Port Orleans Riverside). I have to say that the Yacht Club is our favorite so far.", "title": "Yacht Club is Great!", "helpfulness": 5, "user": "Tuckers", "date": "August 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19557089, "likes": {"liked": "— Location was great! Walk to Epcot, Disney Studios, Boardwalk & more", "disliked": "— Bus service was very slow"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We were upgraded to a water view room, which was in a great location. We were in room 4075. We had a view of not only the lagoon, and wedding gazebo, we could also see Illuminations from our balcony. What a treat.", "title": "Great stay at the Yacht Club", "helpfulness": 6, "user": "need2travel2", "date": "August 19, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 19126359, "likes": {"liked": "— Proximity to Epcot & the Boardwalk", "disliked": "— Room location"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Check in was a breeze. Took less than 5 minutes. The staff at the front desk were courteous and helpful.", "title": "Good and bad", "helpfulness": 1, "user": "BMWLoverNorCal", "date": "August 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 1.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 18793752}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "We used the Magical Express service, which really is convenient. You put the supplied yellow tags on your luggage at your home airport and magically your bags appear in your hotel room a couple hours after you check in. We did not use the transportation part of the service because we needed to have a rental car.", "title": "Wonderful Stay!", "helpfulness": 3, "user": "leeala", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18554150, "likes": {"liked": "— The beds were so comfortable.", "disliked": "— The slow transportation."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The lobby of the Yacht Club is very classy, and not like a typical Disney resort. Its calm, relaxing and we liked it. Our room was spotless upon arrival. We thought it was very pretty, too. The beds were very comfortable, and the crisp sheets were nice. The room had two queen beds, and a chair w/ottoman. There was a nice desk, and a dresser with a tv on it and a nice empty frig for our use. Then there is another dresser by the closet/bathroom, which was nice. The bathroom area is great because there are two sinks, with plenty of counterspace that is separate from the toilet/shower/tub area. So it was easy for more than one person to get ready at once.", "title": "Great location but service has declined...", "user": "Sharonb423", "date": "August 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 18553039, "likes": {"liked": "— Location, proximity to Epcot", "disliked": "— Staff / Service... or lack of service"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Just returned from a stay at Disney's Yacht Club. We feel very neutral about the place--neither hated it nor loved it. It was fine. But it was just that--\"fine\". There was nothing to die for, and nothing we couldn't live without.", "title": "A bit off course...", "helpfulness": 11, "user": "RueStPeter718", "date": "October 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5899599, "likes": {"liked": "— Location.", "disliked": "— Mediocrity."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I grew up in FL and have been going to Disney since about 2 months after the gates first opened at Magic Kingdom (remember E tickets??). During these years, I've been lucky enough to experience many of Disney's various lodging offerings. As a child, we camped every year at Fort Wilderness; I spent my honeymoon at the then Dixie Landings (now Port Orleans Riverside); last Mother's Day was spent at Boardwalk Villas, and so on. I must agree with so many reviewers who have felt a loss of the 'magic'. (If you've not read reviews of the Beach Club, I encourage you to do so. These two properties share quite a few services.)", "title": "Best Vacation Ever!!!!!!", "helpfulness": 22, "user": "georgiagrl", "date": "August 10, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5594551, "likes": {"liked": "— Stunning grounds, fantastic location", "disliked": "— Food/beverage prices"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Check in was fine. The room was fine: the bed was comfy and the room clean (both OH, so important). Yes, the bathroom itself was tiny...but the marble surround lovely, and the seperate vanity area helpful. The fridge was nice, as was the balcony. Speaking of--as a personal preference, we reserved a standard view; we've never had any issues with same. At this resort, however, the parking lot noise (which included a Disney Bus laying on it's horn repeatedly at 8 a.m. when a gate failed to lift) was palpable even with the balcony door closed and drapes drawn. Finally, we could hear clearly at about 2 a.m. one morning that our neighbor \"couldn't care less\". In short, it was a nice-enough, Marriott quality room. It was \"fine\".", "title": "Fabulous Room, Great View, Amazing Pool", "helpfulness": 12, "user": "pvbmom", "date": "July 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5534784}, {"rating": 5.0, "title": "Excellent Resort, Loved it....Pleasantly surprised!", "text": "What IS exceptional about the Yacht Club: its proximity to EPCOT and pool area for younger kids.", "helpfulness": 20, "user": "cliff1788", "date": "July 25, 2006", "id": 5507175}, {"rating": 5.0, "title": "Spoiled Rotten by Disney", "text": "But they say \"it's the little things\", and I suppose that's how we felt. At 300 smackers in the off-season, even some tiny extra touches would seem both appropriate and appreciated. A small basket in your room at check-in with a loofah and sea salts to soak? Perhaps a small box of salt water taffy with a note signed by Mickey or Ariel? Either of these would cost Disney what--two or three bucks? Some small, non-essential something--ANYTHING--which would add to the 'magic' and say, \"Hey, thanks for dropping your dough at a Deluxe\".", "helpfulness": 9, "user": "Linda R", "date": "July 11, 2006", "id": 5451784}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "My family stayed at the Yacht Club in mid January of 2007. The pools are great for kids, however the hours the pools open in the morning could be earlier. It was nice that they provided buckets and shovels for the kids to play in the sand. The boat that provide transportation to the boardwalk, epcot, and MGM are an added bonus. The biggest complaint is the quality of food you receive for the amount you pay. For an example: My son (3) went to the character breakfast which was a buffett style. Cost $20 for myself and $12 for my son. We had scrabble eggs, bacon, and cereal. I never had bad scrabble eggs till I ate their. The food is bearly edible at all locations on the resort including the \"5 star\" steakhouse. By no means is the steakhouse 5 stars dont waste your money eating on the resort including the boardwalk. The only other complaint is that the rooms are small and the service of turn downs and cleaing your room was horrible. Some days they didnt show up till after 12 to clean your room. For example one day we called at 9 am to have someone clean our room why we went to Epcot we came back at noon it still was not done, we called the hotel manager an was told the crew was on lunch break. Having a 3 year old and 1 yr old with you you have to time your events around naps, lunch and to be out of the room so the crew has the space to clean. When I called an complained about the service the hotel manager bascailly said he would address it, no apology, no special threatment. For the price the hotel met my expectations however was expected to leave having them exceeded. I would go back to the hotel its much better then the other resorts I have stayed at through Disney. Also bring allot of singles as ever employee in the resort expect tips for even speaking to you it seemed and they let you know it. For example: My son was sick the first day we got their and my wife was with him in our room while I was out with our daugter. The luggage folks dropped off the luggage while my son was in the middle of being \"sick\" the guy that dropped the luggage off actually waited for my son to satop being sick so that the my wife could address him and give him his $5 tip. That was my biggest issue is that everyone their wanted a tip for ever little thing and let you know it. That needs to be addressed by Disney. You get exactly what you pay for with Disney now, no extra perks it seems no \"special threatment\" your simply another guest that dont make you feel \"special\"", "title": "Jan 2007 family of 4 stay", "helpfulness": 5, "user": "matttristan", "date": "January 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6710334, "likes": {"liked": "— location, trasnportation", "disliked": "— tips, food, price"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We are a UK family who stayed at the Yacht Club over Thanksgiving. We have been to Disney 3 times previously but have always stayed at moderate resorts. This time we thought we would try a deluxe to see what the difference was. Unfortunately this now means we can never go back to moderates. The Yacht Club was great. It feels like a 'real' hotel, unlike the moderate resorts. Lobby area was charming, my son loved the miniature winter scene train set, especially the miniature cable cars ! The pool here is fantastic, great water slide, sandy bottom on the pool, swirly pool with currents. It was cold when we were there but the pool was still warm.", "title": "loved the Yacht Club especially the pool!", "helpfulness": 8, "user": "janeymcp", "date": "January 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6533225}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Only disappointment was the fact that it was so busy and we couldn't get reservations for any of the restaurants so had to have a bar meal, but bar was pleasant and family friendly (except for the prices!) . Will definitely stay again, ...once bank balance has recovered.....", "title": "Loved Yacht Club Concierge!", "helpfulness": 4, "user": "Teece", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6182979, "likes": {"liked": "— Service, quality of room, and pool.", "disliked": "— The price was very high."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Our family of five stayed on the concierge level at the Yacht Club from 11/17/06 through 11/25/06. It was our first stay, so we couldn't compare it to a previous visit, but we were very impressed with this hotel! The staff was very helpful, and several employees approached US to see if we needed help or had questions. We found the concierge lounge to be well-stocked and maintained. The room was also nicely furnished and very comfortable. The beds were incredibly comfortable! Mousekeeping did a good job, and we would come back to our room to discover the stuffed animals arranged in cute ways. We also liked being able to stop at the desk of one of the two employees who were on hand until 10 pm to help us make reservations, check the weather forecast, or answer general questions.", "title": "Yacht Club needs to find true north again", "helpfulness": 10, "user": "TVJ", "date": "October 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5956120, "likes": {"liked": "— location", "disliked": "— service"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The pool, Stormalong Bay, was the best one we've seen at a hotel, even ones in Las Vegas. There is a long, high slide that our kids loved. There was also a lazy river to float down, and a small whirpool that kept us going in circles! At least two employees were on hand to entertain the kids. My 8-year-old daughter raced rubber duckies with some other kids, and when she won was awarded a Magical Moment Certificate signed by Mickey Mouse! She was thrilled. We also saw games of water volleyball and Marco Polo going on.", "title": "A Magical Stay", "helpfulness": 3, "user": "Island_Gen", "date": "October 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5921690, "likes": {"liked": "— Everyone is so professional and helpful", "disliked": "— N/A"}}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 46, "average": 96, "very good": 280, "terrible": 21, "excellent": 544}, "aka": "Disney`s Yacht Club Hotel Orlando", "slim_ranking": 0.19452887538, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Disney's Yacht Club Resort is a lakeside Disney Deluxe Resort featuring lush landscaping and the formal grace of a grand New England yacht club. Designed by architect Robert A.M. Stern—known for his East Coast beach houses—this splendid 5-story Resort transports Guests to the summertime Shingle Style hotels of Martha's Vineyard and Nantucket."}