{"user_rating": 3.5, "review_count": 1993, "name": "Disney's Hotel Cheyenne", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Just spent 3 nights here with my hubby and 3 kids and thought the hotel was very good. The room was clean and comfortable and the cowboy theme was brilliant and carried on throughout. Was very warm and plenty of hot water. Breakfast was a bit manic but not too bad. Tons of food - very fresh, and didn't take too long to find a table. We had dinner there one night too which was excellent. Only complaints I would have were the lumpy pillows and the fact that the fort apache play area was closed when we were there. Would definately consider staying again.", "title": "Very good", "user": "stereomary", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 126646402}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Just spent three nights here with all the family (9 of us) and not one complaint heard from anyone. We were convinced that our rooms had been largely refurbished since our last visit,", "title": "Even better - on return, after 5 years.", "helpfulness": 1, "user": "Tony36", "date": "March 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126601153}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "e.g. the bathroom (never short of hot water), the carpet in the room and corridors all in very good condition. Heater worked very efficiently, when required. Large flat screen tv with a host of channels (NO Sky though!). Housekeeping staff all very jolly. Rooms very well cleaned. Breakfast was not half as big a bun fight as last time. After the first morning you'll get the satnav to all the food counters, as there's plenty of them. With three halls to scour you'll soon find a table. Okay, it's a \"Holiday Camp\" type set up in a way, but a very efficient one in our opinion. If you're about to go, read the good reports and ignore those moaners!", "title": "Great place for kids", "helpfulness": 1, "user": "brucefan2", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126581690}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Were you to become one of them, you must have been very unlucky. GOOD luck!!!", "title": "Okay place to stay", "helpfulness": 2, "user": "Ryan R", "date": "March 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 126485821}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Stayed here for five nights last week. Had a great time! Bunk beds are great for the kids, except for the fights over who is getting the top bunk! Beds very comfy, especially after long days in the park. Rooms cleaned every day, towels changed, beds made etc. Very quiet and heater in room for cold mornings! This was our third time staying in this hotel and we still love it!", "title": "Clean and very good cowboy theme, food not great.", "helpfulness": 1, "user": "S.O'Mara", "date": "March 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 126437255}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Things we found very good during 2 night stay:", "title": "Very good price/quality/athmosphere", "user": "bartnouwen", "date": "March 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126435479}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "- look and feel of this hotel is perfect: you really feel like staying in an old western town (not just a western styled hotel)", "title": "Good themed hotel, clean, warm and comfortable!", "helpfulness": 2, "user": "Justinelittlep", "date": "March 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 126344805}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "- pony rides at the hotel for kids", "title": "recent visit", "user": "tracym324", "date": "March 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 126283034}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "- entertainment and activities at the town square", "title": "Better Than Expected", "user": "Telechubbi", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 126264864}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "- breakfast was 'strange' in a fun way, as you had to collect your food and you could sit outside on the wooden benches to eat", "title": "OK but not the best", "helpfulness": 1, "user": "Lyon06", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126261844}, {"rating": 2.0, "title": "Nice theme but disappointing rooms", "text": "I spent two nights here in March 2012. While the western theme is spot on and helps the magic of the theme parks live on, the rooms are really basic. Nothing wrong with that after all, as it is clearly marketed as a value Disney hotel vs the more luxurious ones. What's wrong is that the rooms do not get cleaned or maintained. Finding plastic wraps and dust on the carpet and in the bathroom did not give us a good first impression, and it's clear that the carpets do not get vacuum cleaned very often. In fact the carpet dates back to 1992 and has never been replaced after that. I used to live near the carpet factory which produced the carpets for all the Disney hotels, including the Cheyenne wit those bull's horns pattern, and this carpet is still there, only much, much darker and worn out. Breakfast was ok, a bit chaotic but it was expected. Reception was fine, the shuttle buses to the parks very frequent. It would be so much better if only they took good care of the rooms.. We've also stayed at Marriotts Village and Elysee Val D Europe which were of course more expensive, but also much more value for money. I'd save a bt more and then go there for the full stay next time.", "user": "DTLondon", "date": "April 1, 2012", "id": 127085441}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This is a great hotel, clean, friendly and comfortable. Being only a 3 star or 2 key rating in Disney's brochure, I did not expect the standards to be any where near as high. Myself and my 2 boys stayed here. The rooms were an ideal size, clean and the beds were really comfortable. The cowboy theme is great and we loved the boot shaped lamp.", "title": "Excellent hotel", "user": "loveholsMorpeth", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127014853}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Breakfasts are varied and the buffet area is kept clean and everything is replenished regularly.", "title": "Lovely hotel", "helpfulness": 1, "user": "camillathechicken", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126733672}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We also tried the evening buffet and this was really good, with a wide choice of dishes that are well prepared.", "title": "Well themed Disney Hotel", "helpfulness": 2, "user": "Victoria6994", "date": "March 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126703139}, {"rating": 1.0, "title": "Never again......", "text": "We were there during Disney's Christmas celebrations and the hotel was lovely with a huge Christmas tree and an inviting seating area in the entrance.", "helpfulness": 3, "user": "sawadee_1", "date": "March 26, 2012", "id": 126675616}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "I stayed here with my husband & 5yr old. The rooms were ok could do with a lick of paint but clean and the beds were comfortable which is what you need after a day at the parks. We had 1 double bed and a set of bunk beds all were made everyday and towels changed daily. We had a kettle in the room but no tea & coffee making facilities, no cups. We stayed on the half board package and I'm so glad we did as it is very expensive to eat in the resorts & hotels. It would have cost around €75 for the 3 of us to eat a standard burger & chip meal with an ice cream and soft drink nothing fancy in the evening. This was at one of the cheaper places to eat. There is a McDonalds in downtown Disney but it gets packed and the prices again are slightly inflated to those back home. We went to the cowboy cookout which we could use with our half board package. You get to meet mickey . Goofy, Pluto and Minnie & woody you was not rushed and could spend as long as you needed and the food was lovely well worth it. Again this would have cost for 3 around €75 for lunch. Some of the rides were shut due to being refurbished but staying in a resort hotel does mean going into the park 2 hours early so you could get on a selection of rides before the park opens. Not all the rides are open at this time. Going this time if year and being a school holiday I thought it would be really busy but it wasn't. The tower of terror ride had a maximum wait if 10 minutes althought some of the kids rides were around 40 mins. All in all I would recommend this holiday and hotel we had a great time .", "title": "Great fun holiday", "user": "Coulsons", "date": "March 17, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 126220046}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Just back after 3 night stay. Positives - much more character than Santa Fe where we stayed last time. Rooms were clean and comfy, kids loved the bunks. Very quiet all night. The only negative was the rush for breakfast but it was the same at the Santa Fe and no doubt all the other Disney Hotels. At breakfast for 8am, we managed to get a table after a few minutes hovering around but had to clear the table ourselves - good idea to take a small Dettol spray and some wipes. There's only 2 toasters which is ridiculous! I took me 15-20 minutes just to get some toast for the kids. If your kids only like certain cereals take some with you. Mine didn't like the frosties, choco flakes, special K, or lage rice crispie type things. For adults there is a selection of different croissants which are really tasty. Take food bags with you. Get into the parks as early as possible - we were late on our last day at around 10:15am and queued for 1hour to get past the security bag check point! It's worth staying in the Disney hotels just to get into the parks early so I would definately stay in the Disney Hotels again.", "title": "Does the job", "helpfulness": 1, "user": "Gaugg", "date": "March 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126215301}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "This is the cheapest place in the resort that we could find at the time. We wanted to stay in the resort due to being able to get in to the park early. We also thought we could get a meal with the characters but this is not guaranteed and would advise trying to book it was soon as you get there. There is a bus to the park but is often packed or you can't get on in the morning. As the cheapest hotel this one is a 20 minute walk to the park.", "title": "Disneys cheapest does not give much for the money", "user": "MixMasterMoll", "date": "March 16, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 126190004}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Breakfast resembles a war zone with 25 meter queues to get in. Ofterings are: bread, cubed cheese, tinned fruit, apple sause, cereals, milk. It was not worth the wait so we were glad we had stocked up with cereal bars, dried fruit etc before going. Most of the people that go for breakfast are there to make some form of awful packed lunch for their family. Dinner looked equally packed, so we always ate out in the village.", "title": "great hotel", "user": "xxheather89xx", "date": "March 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126156302}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The rooms are ok, and you will sleep well as you are tired. The bathrooms are cramped and in our case permenently hot despite attempts to get it fixed. If you have a problem with your room would suggested asking for another one instead of waiting for them to fix it properly.", "title": "What more do you need?", "helpfulness": 3, "user": "MrsJVE", "date": "March 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126094983}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe"}, "stars": 2, "variance": {"poor": 147, "average": 497, "very good": 870, "terrible": 86, "excellent": 393}, "aka": "Disneys Marne La Vallée", "slim_ranking": 0.185185185185, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}