{"user_rating": 3.5, "review_count": 2368, "name": "Disney's Hotel Santa Fe", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Clean, warm, well served by shuttle bus and staff were helpful.", "title": "Worried about reviews, they are over the top. Good value, clean, friendly hotel", "helpfulness": 5, "user": "delyth14", "date": "December 2, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 121328099}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Easy to reach from the airport by bus, taxi or train. We arrived by taxi from CDG for €70. Train from Disney station to CDG cost €16.60 per person, my son age 3 was free.", "title": "you get what you pay for!", "helpfulness": 2, "user": "sje59", "date": "December 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121323832}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Good buffet breakfast. Waited a few mins to get in. Not a problem, found table etc plan of attack was one go for food the other get table. It worked for us.", "title": "Great Value Basic Hotel", "user": "DarrenMel", "date": "December 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121293801}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Room had a kettle, god send for me, tea bags in buffet, milk in shop. Clean and tidy rooms, bathroom nice, soap and shampoo there. Lots of towels etc.", "title": "best 2 star ive ever stayed in", "helpfulness": 1, "user": "amii k", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121259025}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "Shop sells lots of things but petrol station at entrance worth a trip.", "title": "Great stay but room block exteriors looking shabby", "helpfulness": 2, "user": "Trailingpink", "date": "November 29, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 121191889}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Our family of 4 stayed a week at the Santa Fe, and after reading the reviews we wondered what we were in for... however we left feeling so pleased with ourselves and the weeks accomodation we have no hesitation recommending it to anyone. In fact, we would go back again tomorrow! We were made to feel extremely welcome, given we speak only a little French, and nothing was too much trouble for the staff. We booked a double room with an ensuite, but upon arrival we were checked into 2 adjoining double rooms for no extra cost (given our children are 11yo & 14yo staff thought that woiuld be better). Our son was able to adjust the TV so it was in English, the rooms were clean, spacious, with extremely comfortable beds, and a terrific place to sleep after a HUGE day exploring Paris & Disneyland. We saw no mice or rats, and yes, breakfast was very busy, but what do you expect with 5,000 guests?? As you have probably read, breakfast is plentiful and we were able to leave each morning with croissants & rolls for lunch, which truthfully saved us about 400 Euros for the week (as food is very expensive). The walk to Disneyland/the train station was a leisurely 10-15 minutes which we all loved, and the 8-10am early access was brilliant. The bar in the main reception area was lovely at night, and gave us a place to relax & unwind whilst being close to our room. Honestly, if you are looking for an affordable hotel that gives you everything you need, look no further than Santa Fe. Go in with no expectations, and you will come out with memories that will last a lifetime. Thank you for a wonderful stay from our Aussie family of 4 :)", "title": "What a wonderful stay!", "helpfulness": 6, "user": "Denise S", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121845374}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "I stayed at this hotel nearly 10 years ago which was great, then returned recently to find this hotel appears it has never been decorated or updated in the past 10 years. Arrived expecting a comfortable, although basic room (all that's required as not in room much) but I however found a basic, run down, very cold and damp room. You could smell the damp, along with dirt marks up the wall we could not sleep in the room, after speaking with reception who offered no apologies or alternatives. I requested a move either to another room or hotel this was granted we decided to move hotels and to pay the extra 130 euros... We then left the Santa Fe and moved to hotel Cheynne and wow what a difference it was everything and more what we hoped for. Warm, comfortable, great western theme, clean and much much more. So alls well that ends well. I know which hotel I would return to and it certainly would NOT be the Santa fe.", "title": "In desperate need of an revamp", "user": "conroy1911", "date": "December 16, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 121808451}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This was our second time at staying at the Santa Fe. We stayed this time from the 5th till the 10th Dec. I find this hotel to be good for the price you pay. Don't expect a lot and you won't be disappointed. Our room was cleaned everyday to a good standard and we have no complaints with the room we were given on either of our visits. This time we stayed in a corner room which seems to be a little smaller than the room we had before but still okay for the time we spent in them. The carpets looked very tired and drab and out of our 5 days we only ate in the restaurant once for breakfast as it was like a cattle market with children AND adults sneezing and coughing all over the food without thinking to cover their mouths ... Of course this is not the hotels fault but they do sometimes seem to let too many people in at one time and its a real struggle to find a table to sit at. I would strongly advise going to breakfast before 7.30 as when we left just before 8am the que to get in was right up the corridor and most people looked fed up of waiting. The hotel is close enough to the park for you to walk in under 15 minutes. It took us around 20 minutes and we have a 2 and a 6 year old walking with us. Its a nice walk across the lake and much better than the pushing and shoving to get on the bus which runs every 5 or 10 minutes.", "title": "Not bad for what you pay", "helpfulness": 3, "user": "PrincessSarah24", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121799620}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "All in all a good hotel to get some rest on a night after a long day in the parks. I also think it is good value for the money you pay. Next time though we will be trying somewhere else.", "title": "Just a place to sleep", "helpfulness": 1, "user": "luchiben", "date": "December 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121702553}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "If what you want is a place to sleep, with clean beds inside the Park, then this is your hotel. Nothing special, rooms are ok, with clean beds, bad pillows and the toilet was on the dirty side. The continental buffet was ok, we had to wait to get in.", "title": "Basic hotel for bargain breaks", "helpfulness": 3, "user": "pboro1", "date": "December 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121334767}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The hotel was quite basic but good enough for a base. We had an adjoining room for the 5 of us which was very good. It had a fridge and two safes which would have been useful to know before we arrived. We went half board on the cheaper package, we found out when we got there that our vouchers could be used as part payment for other restaurants which we used which is worth knowing. The staff were very helpful and good with the kids. Theres a garage next door for buying wine and beer however they don't sell after 6pm.", "title": "Pretty good", "helpfulness": 1, "user": "LeedsDods", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 121115996}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Breakfast was barmy and very hectic and busy. Ate once at the hotel and there was a fair choice of chilli, chicken fahitas, bolognaise etc. Ate at cafe Micky on the last night which the food was no better than the food we had during our stay at the hotel but much more expensive however the kids loved it with all the characters playing while we waited for our food.", "title": "Disney with young children 1 and 4 yr old staying at Santa Fe hotel", "helpfulness": 2, "user": "Lisa D", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121053965}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Transport from the hotel to the parks is easy every 10 minutes and only 5minute ride. We used ISPrestige transfers to and from the airport which were very good took around 40mins.", "title": "An OK Stay at Santa Fe", "user": "staceylc", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121029877}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Just back from a magical trip to Disney, Thought i would post a review about Santa fe as great. I was worried with all other reviews but have to say it was excellent. The room had two double beds and travel cot in and plenty of room. really clean and maid came each day to make beds up. staff really friendly. it does look drab from outside but with Christmas lights lovely. the evening meal at hotel excellent. loads of choice. Breakfast is very basic but fine . would recommend if bringing a young baby bring your own Weetabix or porridge in a jar. microwave to heat up food and plenty of milk for bottles if needed. The only time it was busy was a Saturday morning, we always had breakfast at 7.30 so no queue for toast either. The buses run every 5 mins to Disney. Plenty of baby places to warm food up. We didn't use the room safe due to other reviews so used the safe at reception free of charge", "title": "Awful, awful and more awful", "helpfulness": 14, "user": "karen h", "date": "November 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 121004121}, {"rating": 2.0, "stay_parameters": "Stayed November 2011", "text": "Only worrying thing was how far we had to go to collect luggage at Paris cdg airport with a pram we had to take about 5 lifts and then a mono rail to collect luggage and exit for the Disney bus. Vea shuttle excellent. Definetly recommend the h/b options with the vouchers for the parks. Magical place with christmas music and lights", "title": "Mixed feelings!!", "user": "small2006", "date": "November 24, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 120989729}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Stayed here in November for two nights in a group of seven. We knew this was the cheapest hotel in the resort but I was quite surprised as to how basic it was. The first thing I noticed was how un-Disney-like the hotel felt. If it hadn't been for the pictures of the 'Cars' characters on the outside of the hotel and on the bed linen then I wouldn't have guessed that this was a Disney property.", "title": "Disney's version of a Travelodge", "user": "kathrynjc", "date": "December 21, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121941988}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The second thing was that check-in was rather lengthy. I assume this may be because we were checking in at a similar time to others who had taken the Disney Express train and then spent a few hours in the park but I did expect better service. The hotel runs a bit of a confusing breakfast system where you have a card for your allocated lot, either close to 7.30am or close to 10.30am. On both occasions we were given cards for the 10.30 slot as there were none left for the earlier time but were then told to just go anytime we wanted. Not entirely sure why there is a card system in existence if we can go anytime. After the confusion we didn't even breakfast on the first morning as the queue was ridiculous. Did breakfast on our second morning though and thoroughly enjoyed it.", "title": "Great hotel for stay in Disneyland Paris", "helpfulness": 4, "user": "RosaleenK", "date": "December 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121929697}, {"rating": 3.0, "stay_parameters": "Stayed December 2011", "text": "The rooms themselves are again quite basic. The fixtures make them feel cosy and there is an abundance of Disney channels on the TV which is good for kids but the bathrooms are small, there are very few power points and no hairdryer. The beds were comfy though and we slept well so can't really complain.", "title": "Ok but just ok", "user": "chriswendyandsam", "date": "December 20, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 121927787}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "However, I would complain about the restaurant. I read in some of the leaflets that tables can be pre-booked at any of the resort restaurants in the park which I did on our first day as we were tired and I wanted to make sure that there would be a table for our party of 7. When we actually went to the restaurant, proof of reservation in hand, we were greeted with a huge queue that didn't move for 30 minutes. The staff weren't telling us anything and the crowd started to get very agitated with several families just pushing their way through to the front. We were then expected to pay for our meals and choose our drinks upfront, of which there was no indication of while we were queuing so this caused further stress. Some simple guidance and communication from the staff would totally solve this problem. Having said that, the food was very good with lots of variety and was frequently replenished so we did enjoy our meal eventually!", "title": "Simply appauling", "helpfulness": 12, "user": "Dazzler2012", "date": "December 18, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 121871974}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "Another thing that would improve this hotel is if there was clear signs as to where to queue for the shuttle bus (you just end up following everyone else as it is not signposted) and if there was information in the reception as to the frequency of the buses. This isn't a huge thing but a small point that would just make staying here easier.", "title": "Disneyland paris has LOST the magic", "helpfulness": 4, "user": "traveller2801", "date": "December 18, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 121845509}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe"}, "stars": 2, "variance": {"poor": 217, "average": 638, "very good": 950, "terrible": 122, "excellent": 441}, "aka": "Disney Santa Fe", "slim_ranking": 0.203703703704, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}