{"user_rating": 4.0, "review_count": 3916, "name": "Disney's Port Orleans Resort - Riverside", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We stayed at this resort from Sept 20-25. We had a nice time but there were some kinks in this trip. The first kink we experienced was using the magic express service with an 8:20p.m. arrival time. Nobody suggested to us that this was a mistake but we soon figured this out. The shuttle to the hotel was excellent with no wait time. However, the bags take 2-3 hours to arrive. This would have worked fine if it had been a daytime arrival but with little tired children this was a disaster. We had no clothes, no toothbrushes, toothpaste(thanks to new airline restrictions), or pajamas. To top it off we were given a room that had dead batteries in the doorlock so we were locked out of our room for over an hour while my husband stayed with crying children and I walked back and forth through the maze of buildings in the dark for each of three different sets of keys, none of which worked. They finally sent a repair man to the room who fixed it very quickly but it was now midnight. We shut the door and 5 minutes later after we had tucked the kids to bed in their clothes the bags arrived. Riverside did give us our first night free because of all the trouble, which I greatly appreciated. The shuttle system was VERY slow. It would take up to 40 minutes at times during the day to get a shuttle to the park, and we went during an off peak time. At the park we would watch bus after bus roll up and have to stop to load disabled scooter bound folks on the bus. This took approximately 20 minutes per scooter and on one day I watched as four scooters piled up in a line waiting for a bus. This caused huge delays. Disney shuttle service has never been this slow and I believe it is due to the increase in the use of these motorized scooters. I hope they will tweak their system to accomodate more disabled people travelling to their parks. Right now it is a disaster for all. If I came again I would stay at a park directly serviced by monorails or I would rent a car. The shuttle service at the end of a busy funfilled day sucks the magic right out of it. I also would not recommend using the Disney express if you have a flight time after 4pm with little children with early bedtimes. We also chose the dining program which is very nice but you have to book all your dinners well in advance because you will find nothing available anywhere when you get there. We found that the dining plan has filled up all the restaurants, even some of the ones that used to be empty like Tony's in Disney. All in all the kids had a fabulous time and the parks itself are as always wonderful.", "title": "shuttle system not what it used to be", "helpfulness": 13, "user": "lauridale", "date": "September 26, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 5880961, "likes": {"liked": "— nice clean room", "disliked": "— layout very spread out, long walk to lobby and bustop"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We just returned from a three-night stay at the Port Orleans Riverside. My family (myself, my husband and our toddler) were in Orlando for my husband's sporting event, and thought a stay at Disney would be good for me and my son -- safe, and easy to get around and do things without a rental car. It was a good choice. The Riverside hotel was fantastic, really a very nice spot with nice amenities for a 3-star hotel. The rooms are nothing special, but they were clean and housekeeping was very responsive to any request we had. All of the staff at the resort were very friendly and helpful, everyone was great to my son and we felt very comfortable there.", "title": "Very Nice for a Three-Star Hotel", "helpfulness": 21, "user": "NHTravelerwKids", "date": "September 25, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5835143, "likes": {"liked": "— Friendly staff, clean, nice pools", "disliked": "— Vegetables for my kid? Please?"}}, {"rating": 5.0, "title": "Better than Disney's Grand Floridian! (and much cheaper too)", "text": "The hotel itself is very pretty and is situated on a large campus -- you will have to walk around a bit to get to the different pools and the restaurant and lobby. But that is one of the nice things about this resort: there are several pools and also one large pool/kiddie pool, so you have your choice if you want to have a little more privacy and quiet , or be with more of a crowd and more kids. Tip: ask housekeeping for extra towels to bring to one of the smaller pools, they don't supply them there.", "helpfulness": 17, "user": "Dniedajr", "date": "September 24, 2006", "id": 5833293}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The food at Disney, at least the status-quo cafeteria food, is nothing to write about. Don't expect much. My only real complaint is that the cafeteria did not offer anything in the way of vegetables for kids besides sliced carrots and celery sticks -- don't most kids eat green beans and broccoli, even if under protest?", "title": "Very Pleased with my stay at Riverside", "helpfulness": 22, "user": "michigan007", "date": "September 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 3.0}, "id": 5830391}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We had originally booked our stay at the Port Orleans French Quarter, based on the reviews on this website. We spent one night there and requested a change -- POFQ is not as nice as Riverside, it's a little more run-down, it only has one pool and the cafeteria is not nearly as nice as Riverside's (the cuisine is the same but the ambience is totally different). I recommend Riverside for people who like a little more quiet and more of an upscale, resort feel. For the money ($111/night with AAA discount), we would definitely stay there again.", "title": "neat but not luxury", "helpfulness": 21, "user": "edwin_f", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5803587, "likes": {"liked": "— convenient, service and quietness", "disliked": "— facilities"}}, {"rating": 5.0, "title": "Awesome!!", "text": "My family stayed at the POR from 7/31/06-8/5/06 and we totally loved it!! This was our very first Disney World Trip. We have children 13, 9, 6, and 3, and they had a blast. We drove from Texas, which took forever and stayed in a two off site hotels for the first 3 nights. And what a awesome change..The off sites were HOJO's, the first of which was totally disgusting(Enchanted), the second was as hotels/motels go, but way better than the first. But I digress. POR was great. From the time we checked in, till the day we checked out. The staff was very helpful with answering questions a first timer had and housekeeping was great. We didn't get any special towel animals or anything, but we always came back from the parks to a very clean room and made beds. Now being a mother of four, when someone else makes your bed, you're just soooo happy!!! The kids collected the little soaps and shampoos, and they were replaced the next day. The pool was eh, a pool to relax at. The kids enjoyed it. As for the food court, well, it wasn't four star dining, but it worked just fine. We ate there twice, once for breakfast and once for dinner. For us it was a bit pricey, but it was Disney. We walked around the premises(when we weren't too tired), took the boat to Downtown Disney, and just took it all in. The bus system worked out greaaaattt!! Since we drove our own car, it saved alot on gas for us. But the wait wasn't long and I think the longest we waited for a bus was coming back from an Extra Magic Hour night which was only about 10 mins. Being a slightly big family, we would let others get on the bus and just wait for the next one. It wasn't a big deal, while waiting the kids would just talk about the parks and rides. My son(3 now), was more excited about riding the bus than anything else(well except for Pluto). We booked the POR thru the military hotel \"overflow\" and got a great deal, we paid about $124 a night. I would recommend this hotel to everyone we know..", "helpfulness": 13, "user": "storckyb", "date": "September 14, 2006", "id": 5799460}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "stayed at the port orleans for 5 nights(Aug 26-31/2006) This hotel was a great deal for the price we paid $97 a night. It was a little slow at check in, As the lady at the counter was a little slow. Got to are room and was impressed with the cleanliness and the layout. Two sinks was a bonus with 3 girls. The grounds of the complex was beautifal and the kids loved the pool. I really enjoyed walking in the morning along the river. We bought the $12 re-fillable mug in the restaurant and that was a good bargin for the 5 days we stayed, you had a good choice of drinks to refill for you whole stay. The beds were comfortable and the staff was very freindly and professional. Over all had a great time at Disney and loved the hotel.", "title": "hotel was awesome", "helpfulness": 9, "user": "carey44", "date": "September 12, 2006", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5795048, "likes": {"liked": "— very clean and comfotable", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This hotel is by far the best hotel I have stayed at in the entire Disney Resort, Including the Deluxe Hotels. It is charming and the rooms and the property is clean. Holding true to its namesake, this is exactly what you would expect in an earlier era visiting new orleans. From the way the staff dressed, to the large water mill and the design and decor of the buildigs. Delicious breakfast in the morning. Definitely try their french toast...it is to die for. If you have a chance, take the relaxing boat ride down the river to down town disney. The only complaint I have about this hotel is that what was supposed to be a waterview room was not. Simply because I had to leave my room and go out on the public corridor/porch to see the water, which was one of the quiet pools. Also I wish they had more kind size beds. What kind of hotel these days have mostly double rooms anyway???? Don't pay more for a waterview room. We rode on the bus with another couple who did not pay for a waterview room, but got one when they checked in. Why would you pay for something you can get for free??? Apart from that, the staff was nice and very accommodating. Marilyn, a waitress at boatrights, got my fiance a cake with a candle in it for his birthday. The bus transportation is great especially that magical express from/to the airport...although the process at the airport could be a little faster checking onto the bus. I am yet to meet a rude person for the 3 days that I was there. From the bus drivers, to the concierge and front desk agents, to the theme park attendants and the security guards...nice.", "title": "Loved Every Experience Here", "helpfulness": 6, "user": "copilotcrj", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5789893, "likes": {"liked": "— Everything except what I disliked-->", "disliked": "— No elevator to room, not enough king size beds"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My family and I just got back from a wonderful stay at Port Orleans Riverside. We checked into the resort after a long plane ride and we were wisked away to the resort by the Magic Express. The bus driver was okay, not the over the top service that I am used to from Disney. However, things took a turn for the better when we arrived at our resort. After waiting in line for about 15-minutes, we were greeted by a smiling cast member named Kevin. He was 'Earning his Ears' and was all smiles the entire checkin time. I was especially impressed by his interaction with our two children telling them that Timon and Pumba had dropped off coloring books for them. This really made the kids feel very special. Then when our room cards were ready, he had both the kids sign the back of their very own key cards. His interaction really made the check in smooth and painless for us parents! Kevin was personable and a true compliment to the Walt Disney World resort. He was truly refreshing to deal with.", "title": "Wonderful Resort, Wonderful Staff", "helpfulness": 8, "user": "MikeNewYork99", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5789579, "likes": {"liked": "— Kevin at the front desk!", "disliked": "— Room cleanliness was not the best."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "The rest of our vacation was wonderful and we encountered some great cast members, none like Kevin though. We will be returning to Port Orleans in December, in part thanks to Kevin. He really made our stay there very special.", "title": "Terrific stay", "helpfulness": 8, "user": "twodaughters", "date": "September 6, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5775023}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed at the Port Orleans Riverside from Oct. 9th through the 12th. This was the last vacation my husband and I were going to take before we have our baby in February. Check in was fine - we arrived around 10:00am and were happy to find our room ready, but the person at the front desk who was \"earning her ears\" was not really helpful. She was very nice but did little more than give us our room keys - there was no explanation about what how to take advantage of property amenities. Our room was in the Arcadian building (I'm not sure what number that is), and it was about a 10 minute walk from check in with our suitcases. The room was a standard hotel room with two full sized beds and a decent sized bathroom with a separate area holding the two pedastal sinks. As mentioned in other reviews, the property is very pretty, and well kept. There are rabbits and frogs and lizards running all over the place, which is fun. Our room was spotless and comfortable, and our mousekeeper did a great job. She didn't leave us any animals, but did create a \"cup\" out of washcloths, and stuck our toothbrushes in it, which was cute.", "title": "Good deal for the money", "helpfulness": 15, "user": "jjax", "date": "October 13, 2006", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 5948829, "likes": {"liked": "— Friendly staff", "disliked": "— Distance to parks, distance between buildings"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We ate in the dining hall for breakfast one day and dinner another evening. The food was surprisingly good, with a nice selection of items, and all of the staff members were very friendly. The other two mornings we ate at the table service restaurant, boatwrights, and we had the banana stuffed french toast - it was FABULOUS!! It is two huge pieces of texas toast, with a banana in the middle, which is then deep fried, coated in cinnamon and sugar, and served with a strawberry banana sauce. So yummy!", "title": "Beautiful accomodations, RESORT IS TOO LARGE!", "helpfulness": 11, "user": "graciediane", "date": "October 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 1.0, "rooms": 4.0}, "id": 5932929, "likes": {"liked": "— Beautiful resort", "disliked": "— The entire resort is too large. Rooms are far away from main building."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We took a horse-drawn carriage ride one night ($35 for 24 minutes) which was relaxing and nice - the driver took us over to the French Quarter property for a different view.", "title": "nice", "helpfulness": 6, "user": "acgurl58", "date": "October 5, 2006", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5920515, "likes": {"liked": "— beautiful grounds/boat to downtown", "disliked": "— too far away from favorite park-epcot"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We also took advantage of the boat service to downtown disney, which was very convenient. The only transportation problem we had was due to some misinformation we were given by the front desk. We had dinner reservations at Boma one night, at the Animal Kingdom Lodge. We called the front desk to find out how to get there and were told to take a bus, which should come by every 15-20 minutes. After waiting literally 1 hour and 15 minutes (well past our reservation time), my husband called the front desk and was told that there are no buses from resort to resort. The concierge we spoke with was kind enough to come pick us up at the bus stop and drive us to dinner, which saved the night. Other days we took the bus to the parks with no incident, and very little wait. It is nice to stay at Riverside, as it is the first pick up stop, with people staying at the French Quarter getting picked up second.", "title": "Another great trip to Disney", "helpfulness": 28, "user": "mamasitta6", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5912080, "likes": {"liked": "— It was very clean", "disliked": "— The airport check in counter"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We used the Disney's magical express back to the airport, which was quick and convenient, and I recommend it.", "title": "Loved Riverside, cannot wait to go back!!", "helpfulness": 9, "user": "asiacat1", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5905620, "likes": {"liked": "— the grounds, atmosphere, and it was disney.", "disliked": "— being too far from the main building."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "I am really surprised at the very negative reviews of this property, but I do understand that is a HUGE hotel and it is possible that some rooms are worse than others. However, our stay was quite pleasant. My wife and I, along with our 4 year old grandson, traveled to Disney World from Sep 1 to Sep 4, 2006. We spent three nights in POR. The young man at the front desk was very pleasant and spent quite a bit of time with us when we checked in to help us select a good room. His advice was spot on, as we ended up in the Magnolia Terrace building, in a ground floor room just steps from the quiet pool there, the laundry room (which we used and it was a nice facility), just around the corner from the ice machine and very close to the bus stop for Disney Transportation.", "title": "We were quite happy here - surprised at negative reviews", "helpfulness": 20, "user": "WillieC", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5771501, "likes": {"liked": "— Great staff and housekeeping, location of room on resort.", "disliked": "— IF you do not have car food on site can be pricey,"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The room was clean and in excellent condition, no stains, no mold, no damaged furniture. Housekeeping was great - the room was always done up when we returned, with fresh soap and shampoo and great towel animals to entertain our grandson. The maid paid so much attention to detail that she even noticed that we did not use the decaf coffee and from that point on she left only regular coffee. She of course earned herself a very nice tip.", "title": "We LOVED Port Orleans Riverside !!!!!!", "helpfulness": 16, "user": "dstratt3", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5768053, "likes": {"liked": "— Everything!", "disliked": "— Laundry was $2 per wash and $2 per dry.... I found that a little expensive."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Our room had two double beds, a fridge in a cabinet (which worked very well and kept things very cold), a table with two chairs, and of course a TV in a cabinet. The bathroom was pretty typical hotel style but did have two sinks which was a nice feature. The only thing we found odd was the room had no closet but just an open rod along one wall of the sink area of the bath room. However, I understand this is typical of all the moderate and less resorts at WDW. The room also had a safe built into the wall.", "title": "Very Disappointed- would not recommend or stay there again", "helpfulness": 3, "user": "Denali72", "date": "August 30, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 5728270, "likes": {"liked": "— Proximity to Disney stuff", "disliked": "— Overall quality quite poor"}}, {"rating": 5.0, "title": "Can't wait to go back!!!", "text": "We only ate one time at the resort, using the food court and taking our food back to the bar to listen to the piano player (he was great and our grandson really got a kick out of him). We were pleasantly surprised by the quality of the food from the food court and the prices, while high, were not outlandish. We also ordered pizza from the resort one night and it was good as well but not great. The pizza was large and the package included a two liter bottle of soft drink with the whole thing costing $25 .... again too much but not outlandish.", "helpfulness": 12, "user": "Pinksue", "date": "August 28, 2006", "id": 5717429}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "The Disney Transportation (bus only from POR to the parks, boats to Downtown Disney) worked well and was timely. We never waited more than 10 minutes for a bus. We also used the Magical Express from the airport and that is a really good service. We rented a car the last two days so we did not use the Express back to the airport.", "title": "I LOVE this beautiful hotel", "helpfulness": 14, "user": "court82801", "date": "August 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5716560, "likes": {"liked": "— Rooms, Pools, Location, Old fashioned feel, Atmosphere, ABsolutely Wonderful", "disliked": "— Just the long bus lines leaving the park in comparsion with other hotels"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 211, "average": 441, "very good": 1426, "terrible": 107, "excellent": 1731}, "aka": "Disneys Port Orleans Resort", "slim_ranking": 0.206686930091, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Disney's Port Orleans Resort – Riverside was inspired by rural Louisiana. You'll feel welcomed back to a time and place where everything seems to move a little slower and simple pleasures flourish like magnolia blossoms in the springtime."}