{"user_rating": 4.5, "review_count": 2715, "name": "Disney's Port Orleans Resort - French Quarter", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Having stayed at the POP, Carribean Beach and Coronado Springs prior, I must say that the small size of the French Quarter made it the most enjoyable out of the bunch.", "title": "Better than expected!", "helpfulness": 4, "user": "ChrisCfromLI", "date": "November 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 21880947}, {"rating": 5.0, "title": "Beautiful resort", "text": "Even for the great price, I did not enjoy the POP (way too big, and made me feel a bit too economical).", "helpfulness": 4, "user": "pam0205", "date": "November 15, 2008", "id": 21880446}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The private hot tub is a real nice touch to the pool scene!!", "title": "A wonderful place to stay!!! I can't wait to go back!!!", "helpfulness": 7, "user": "Beebake", "date": "November 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21814851, "likes": {"liked": "— The relaxing atmosphere.", "disliked": "— We wished that there was more than one hot tub. Everynight was wanted to go in but it was always accupied. We were pretty upset."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Have been to Florida twice previous but never stayed in a Disney hotel.Decided Port Orleans was better for us than Pop Cetury as my children are older.The rooms were lovely basic but very clean and well situated about 3 minutes walk from our rooms to the dining area and gift shop.The pool area was well maintained a decent size with a laundry (very handy). I found the transportation to the parks pretty regular with an added bonus of the boat to Downtown Disney. All the staff were really nice which is what helps a lot towards an enjoyable holiday.Were glad we stayed at the French Quarter as it was a lot smaller(more compact than Riverside).If we ever return to Wdw would definately consider staying at POFQ as although its classed as a moderate hotel in my opinion its slightly higher.", "title": "Louisiana Charmer", "helpfulness": 5, "user": "mega04", "date": "November 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21682348, "likes": {"liked": "— The Rooms", "disliked": "— No internet/computer access"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I recently got back from our honeymoon at Walt Disney World. When planning our trip, we knew we wanted to stay in a moderate resort but we weren't sure which one. After speaking with a Disney associate, we decided on the Port Orleans French Quarter. We wanted to stay in a hotel that was quiet and romantic for our honeymoon and we couldn't have picked a better hotel!!! I absolutely fell in love with the French Quarter the minute we walked in. The atmosphere there is very laid back and it is just beautiful!!!", "title": "Great Value", "helpfulness": 5, "user": "Travelhelper", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 21528486, "likes": {"liked": "— Relaxed atmosphere, clean, convenient", "disliked": "— Harder to find than other properties."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Just returned (7/6/9) from a wonderful trip to Disney. The French Quarter is a delightful place to stay while visiting WDW. I have only previously stayed on-site at the Grand Floridian, and while POFQ is not the Grand Floridian, it is a really nice place to be. I have seen others write that it is a nice, quiet respite after a hectic day at the parks, and they are absolutely right! It was truly refreshing to come \"home\" to POFQ and be able to unwind in general peace and quiet. We chose POFQ because it is considerably smaller than the other moderates, and that is the key to it's charm.", "title": "Lovely vacation", "helpfulness": 7, "user": "kjmcc0729", "date": "July 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34436296}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "My only complaint was with the mousekeeping. I was so looking forward to the towel animals for my daughters to enjoy, but there were none for us in the 10 days we spent there. As disappointing as that was, we were doubly discouraged by the quality of their overall service. Used glasses left on the table and not replaced without a phone call, sinks not cleaned/rinsed out, and vacuuming done at the absolute minimum, if at all. Thankfully, we are not a messy lot, and my wife typically straightens up prior to the maids arrival anyway, so it was not as big an issue as it could have been. But still, a little disheartening considering it is Disney and you expect top notch service.", "title": "Cant Wait to Go Back!", "helpfulness": 6, "user": "DisneyMichigan", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34427418}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Thankfully, the rest of the staff at the hotel provided typical Disney service.", "title": "NO WAY!", "user": "burnak", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 34238495}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I have seen some reviews mention the level of noise you are able to hear while in your room, and I can honestly say that was not the case for us. We even had 2 or 3 rather large teenage tour groups there at the same time, and noise was never an issue.", "title": "great hotel", "helpfulness": 3, "user": "insuranceman2428", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34121877}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The pool is great and a lot of fun for everyone. Again, despite it being Disney in June/July, it was never overcrowded and you were able to enjoy yourself in your own space.", "title": "Second Stay at French Quarter", "helpfulness": 3, "user": "Joannblueeyes", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34075863}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Stayed here for 3 nights on my first trip to Disney World. I had a standard view room for three people. Here's what was good:", "title": "It's alright - clean, convenient. A little pricey for the experience", "user": "gstravellerIndia", "date": "November 29, 2010", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 5.0, "value": 3.0, "rooms": 2.0}, "id": 88597620}, {"rating": 1.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "1. Clean room, fairly close to disney parks. The furthest one was Epcot- that took around minutes by bus (Disney is huge, so that's not too much)", "title": "DONT STAY HERE , DIRT AND MOLD ROOMS SHAME ON DISNEY!", "user": "STEAMBOATWILLY1", "date": "November 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 88474275}, {"rating": 1.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "2. Double sinks cordoned off by curtains- very useful in the mornings!", "title": "Incompetent staff", "user": "belle53", "date": "November 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 88473598}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "3. Friendly staff, quick to address issues", "title": "Magic of disney all day.", "user": "TheGormans", "date": "November 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88195251}, {"rating": 3.0, "stay_parameters": "Stayed November 2010", "text": "4.Charming setting with a very quiet, peaceful ambiance- a nice college feel to the place", "title": "Clueless concierge", "user": "vaguelylost", "date": "November 24, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 88138712}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Check-in was a breeze. The room was clean. We enjoyed our water view room (building 6), great to watch the boats go by. This resort's size is perfect, one of the smallest at Disney! The resort offers decent dining options. The kid corner is a nice touch, our 2 year old enjoyed coloring while we enjoyed our meal. We enjoyed the live entertainment at the Scat Cat's Club. The bus service was decent, although at times some buses did make the 4 additional stops at the Riverside Resort, making the ride extra long. Definitely recommend this resort, we found a decent rate utilizing the passholder discount.", "title": "Nice Stay, We Will Return!", "user": "Mikeucfknights", "date": "November 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 87809621}, {"rating": 1.0, "title": "Incompetent!!!!!", "text": "Although I did not stay at this hotel, I had family that did. It was my God daughter's 5th birthday and I was unable to make the trip to Disney World with them, so to surprise her on her birthday I had a large candy bouquet to be delivered to her room. After speaking with several staff members, management, etc throughout the day making sure my bouquet has arrived to the hotel and being reassured it would be delivered, it was not!!! A miniscule task that could not be achieved! This was not a very 'magical' experience. Actually called again TODAY-on the phone with them right now and still has not been delivered!!!!! WOW COMPLETE INCOMPETENCE!!!!", "user": "jlrichhc", "date": "November 18, 2010", "id": 87486404}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We were able to upgrade our package due to a special and made Port Orleans an affordable vacation.The rooms were nice and the beds were the best-so comfortable.", "title": "Everything was at our fingertips-that made our vacation magical", "helpfulness": 1, "user": "Walta_10", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87329804}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We stayed a week so had a lot of time to enjoy the resort and ate there quite a few times and thought the food was tasty and lots of it. We really liked the atmosphere and the close proximity to everything so the bus rides were not long at all. A place I would stay in again", "title": "Great Vacation", "helpfulness": 2, "user": "justily", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87188948}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "All the staff at this resort were wonderful. DD threw up one night all over the sheets and bedspread and mousekeeping came up and brought us new linens, etc. They were very friendly and helpful. The concierge desk was amazing, everyone was willing to help. The only un Disney like employees that we encountered were a few of the food court workers (although they weren't rude, just not quite as friendly). This resort is a great size and has beautiful grounds. We walked over to Riverside and were glad that our resort wasn't as spread out as Riverside. My daughter loved the pool and the water is heated so you are able to enjoy it in the evening after the sun goes down too. They have closed Building 7 as they are updating the hotel one building at a time. My only complaint would be that they corners of the carpet were pretty dusty (needs edging from a vacuum) which I may not have noticed if I wasn't checking under and behind everything for bedbugs which I am thrilled to report there were NO signs of!. We will definitely stay here again, especially after the remodeling.", "title": "Great Affordable Hotel", "user": "aspeetzen", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 87153833}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Stayed at Port Orleans French Quarter the last week of november, first week of december for 7 nites. Had a great corner room with a view of the pool serpent slide and the river. Our family of 4, two aduts, 6 ys old and 11 yr old fit well into the room. The beds are a bit small, but if you want a bigger bed, you need to move up in price range. Staff were friendly and the grounds were clean. The resort has cute brick streets and quient grounds,,makes you feel like you're in a little city. Everything is very close to your room, that includes laundry, hot tub, pool bar, game room etc. The 1 hotel restaurant was cafteria style, the food selection was good. If you're a coffee/tea drinker get the hotel disney mug right away, free refills during your stay plus it's a great souvenier, (I still use it now), it's well worth the 15 bucks. Plus, if you're doing the dinning plan, note: a small salad is cosidered a dessert or snack. I gained 5lbs on the dinner plan because I didn't realize till my 2nd to last day, that I could sub a salad for a dessert. Bonuses: French Quarter is is a short walk or boat ride to Port Orleans Riverside, you can use the amenities of that resort which looked very nice, but much bigger, Riverside does have both a sit down restaurant, (only open for dinner) as well as a cafteria (a bit bigger than French Quarter). The one pool at Riverside (with life guards, which is what I prefer) seems to be a bit of a walk from the rooms, the boat ride to Downtown disney is a must do, I've read reviews that some of the resorts are too big, French Quarter is the smallest of the Disney resorts, if you have small children or individuals that are disabled this is the resort for you. We had a great time here and would come again, if we could not get French Quarter, Riverside would be our only other Moderate price range choice.", "title": "Good Value, Smaller IS Better", "helpfulness": 2, "user": "NYHalfmoom", "date": "December 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 90589252}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "My boyfriend and I returned on December 5th from a 4-night stay at the French Quarter. The hotel was perfect! I'm glad I did my research and chose this resort. It is much smaller than some of the other Disney resorts and thus you're never too far from the restaurant or main lobby and bus stations! The beds were SUPER comfortable and our bathroom (although a tad dated) was clean. All of the amentities in the room were PERFECT. The only con during our stay was the fact that they were/are renovating some of the rooms in the building we were in and woke to some construction noises early in the morning (about 6 or 7am). But this only means that next time we stay it will be all the more beautiful! :) We also loved that the resort was not a far bus trip from other resorts and parks. You could also take a beautiful 5 or 6 minute walk along the water to the sister resort - Riverside.", "title": "Excellent and convenient choice!", "user": "LazyAbbotts", "date": "December 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90483776}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We thoroughly enjoyed our trip! It's hard to believe that it wasn't a month ago that we were there! Coming home to cold NC weather makes it feel like forever ago! *SIGH*", "title": "Port Orleans hotel - best for a fabulous trip to Disney", "user": "Loriintheburgh", "date": "December 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90177519}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "You won't be disappointed if you choose the French Quarter - it's a beautiful and friendly place! Oh, and one last thing -- speaking of friendly -- the individuals at the front desk were a PLEASURE to work with and exceeded my expectations with service and kindness. THANK YOU!", "title": "Glad we chose French Quarter", "helpfulness": 1, "user": "lisa018", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89175256}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Merry Christmas to everyone! :)", "title": "Renovated Rooms and Nice Quiet Hotel!", "helpfulness": 3, "user": "Traveler2585", "date": "December 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 89163103}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Request a room in Building 7! This building is totally renovated (it’s the first one done in their renovation project… currently they are working on building 6).", "title": "Not what I expected!", "user": "kimmy04", "date": "December 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 89034188}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The room was immaculate. We walked in and it just smelled new… the carpet was spotless, the beds had new comforters, sheets and pillows. The dressers were brand new and we had a LG flat screen TV and a brand new ceiling fan. The bathroom had a new tub and flooring as well. Overall, I have no complaints about the room because it was all new! I was expecting the worst after reading other reviews about mold and dust but this was such a treat. My husband noticed a tag on the mattress that said “July 2010” so we knew the mattress was new as well. The view from the room was lovely, as it overlooked the river. The room was also very quiet. We did hear some construction later in the morning going on at Building 6 but it didn’t bother us as it was about 11am.", "title": "Nice enough room, good location, uncaring staff", "user": "mousefan38", "date": "December 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 89030812}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The food is average, cafeteria style like you find at other Disney resorts. It got a bit crowded in the morning and the seating area would fill up. We ate over in the bar area for breakfast as there was no one sitting in there.", "title": "Ask for building #7", "user": "mickandkeri", "date": "December 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 89007000}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "From Wednesday to Sunday there is a “Scat Man” performing right outside the lobby in the bar area. He’s fun and drew a crowd!", "title": "Disney does it right!", "user": "ndupre", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 88861812}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "This was our 2nd trip to Orlando, and so decided to stay at a Disney resort this time as we stayed on I-Drive the year before. Overall the resort was a good choice and yes I would stay here again.", "title": "A good choice resort", "helpfulness": 2, "user": "ilovejimmychoo", "date": "December 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22969916}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Good Points are,", "title": "Best Experience", "helpfulness": 2, "user": "boots_delicious", "date": "December 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 22927894, "likes": {"liked": "— It was beautiful", "disliked": "— nothing it was GREAT!!!!! :)"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "1. Clean room and resort", "title": "Much Better Than Expected", "helpfulness": 5, "user": "sunfired_", "date": "December 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 22847221, "likes": {"liked": "— boat ride to Downtown Disney", "disliked": "— bus service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "2. Friendly staff who were always willing to help.", "title": "Loved it!", "helpfulness": 1, "user": "Bkmurtha", "date": "December 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22778867}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "3. Beautiful grounds", "title": "Great Week at French Quarter", "helpfulness": 9, "user": "pburland23", "date": "December 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22581300}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My husband and I recently had a bad experience at POFQ and we just want to give a heads up to anyone who may want to stay there or is staying there soon.", "title": "Hair in Bed Fingernails on Floor. Ewww!", "helpfulness": 10, "user": "chickles", "date": "January 1, 2009", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 23170393, "likes": {"liked": "— The fact that we got to leave.", "disliked": "— How dirty the rooms were. Stop laying cleaning staff off Disney!!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008", "text": "I've been and stayed at Disney World on 23 different occasions since 1985 and this was the absolute worst experience I've ever had.", "title": "Everything we hoped for", "helpfulness": 4, "user": "mcpeete", "date": "December 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 23119451, "likes": {"liked": "— Nearness to bus, food court, gift shop", "disliked": "— Some of the people at front desk had accents which made them hard to understand."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We checked in to POFQ 12/23/2008 and were very excited because we've read so many nice things about it online in different places. When we got to the hotel around 10 am and our room wasn't ready and the front desk told us we'd have to wait until 3 pm. That's very normal for Disney hotels, so we were fine.", "title": "Always great", "helpfulness": 7, "user": "Beancounter4", "date": "December 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23090045, "likes": {"liked": "— Compact resort, clean, friendly. Feels like home."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We went to the parks at 11 pm, got our hotel room number, and went up to our room. The room was absolutely filthy. There was hair all over the floor of the sink area, in the bathtub/toilet area, and in the bathtub itself. The floor was all smudged and had dirt marks on it too. Plus, on the carpeted area by the beds, there were six fingernails in different locations on the floor... it was clear the floor of the room had NOT been cleaned.", "title": "What's not to love?", "helpfulness": 2, "user": "schnzr4me", "date": "December 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23043027}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The worst part was when we pulled down the sheets and there was a lot of hair in the sheets in BOTH of the beds. Plus there were some other nasty things in the sheets I'd prefer not to even mention.", "title": "absolutley marvellous holiday", "helpfulness": 5, "user": "philfifilauren", "date": "December 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23031820, "likes": {"liked": "— cleanliness", "disliked": "— choice of food in restaurant all the same day in day out"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Whether it is worth staying at a moderate resort, when you are never in your room, can be discussed. I believe that it is worth it if you stay longer, but not if you just stay for three nights as we did this time.", "title": "Pros and Cons", "helpfulness": 3, "user": "Resmama", "date": "July 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 35651073}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Still, Port Orleans has some good sides to it. First of all it was a lot less crowded than some of the value resorts. And the communications were really working wonderfully well, with the boat to Downtown as a nice addition. The pool was not exactly in my taste, but the grounds were otherwise OK. And, as many have said, it is really great that it is a rather SMALL resort!", "title": "fantastic", "helpfulness": 6, "user": "familyman46", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35236299}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Interior design was however rather awful, and looked very cheap, overdone and plastic. And the food at the food court was TERRIBLE! My teenager could not even finish his hamburger, since it was dripping with fat. But if you just avoid the food court, and do not have too much of a problem with bad interior design, Port Orleans French Quarter is not a bad choice.", "title": "Beautiful Grounds", "helpfulness": 2, "user": "NCASMOM", "date": "July 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35032098}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "As a first time visit to Disney, and with two younger children 10 and 7, this was a superb venue. The quality of the hotel went hand in hand with the service provided. The food was plentiful as was the choice. The transportation to all of the Disney theme parks was very good with the occational wait of more than 15 minutes...but hey.... we were on holiday..... Fantastic!!!!! One tip...Go with one of the dining plans or it could get expensive.", "title": "I can't wait to go back again!", "helpfulness": 5, "user": "MsMathTeacher", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34829453}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Port Orleans French Quarter has beautiful landscaped walkways and parks. Nice benchs to sit on at night. The pool was very lovely and the hot tub made you feel like you were in New Orleans. Room was clean and nice. Nothing great but comfortable. The resort was quit and we never heard a lot of noise. Stayed on the 3rd floor and loved it. Best part of the resort was the boat to Downtown Disney.", "title": "A wonderful Visit", "helpfulness": 2, "user": "alanier", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34786289}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The French Quarter is a gem if you have stayed at Disney Resorts in the past. You can appreciate a smaller resort with the same quality service. The bus lines getting you in and out of the theme parks are shorter than many of the other resort lines and the distance from your room to the bus stop in short. This needs to be taken into consideration when traveling with children and staying at a Disney Resort. The pool is fantastic and perfect for small children with enough space for adults to enjoy themselves as well.", "title": "shh... a gem of a Disney resort", "helpfulness": 1, "user": "gypsygirl1978", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91582407}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The only food option is the food court unless you travel over to Riverside. Although Disney lists both properties as Port Orleans, I suggest you look at them as two different resorts with their own character. Don't expect to use the services at Riverside unless you are and avid outdoors person who appreciates a good hike.", "title": "Great disney hotel", "helpfulness": 3, "user": "oepp", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 91411108}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The French Quarter is perfectly charming!", "title": "Great family-friendly hotel", "helpfulness": 2, "user": "EDMER0515", "date": "December 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91012630}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "If you are looking to stay in a moderately priced Disney hotel then look no further. The rooms were large and spotlessly clean although look like they could do with some updating. The transport system for getting around the Disney resort was excellent. You have the choice of buses which ran every 20 minutes or to get to Downtown Disney you could hop on the boat which ran until late. As a disney guest you get a free parking permit so you had the option of driving to any of the theme parks also.", "title": "Nasty, Filthy Room", "helpfulness": 5, "user": "chancelace", "date": "December 29, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 91002313}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We had breakfast one day on site which was fine, nothing to write home about, but good choice and plenty seating.", "title": "DIRTY ROOM EVEN AFTER WE SPOKE WITH MANAGER", "helpfulness": 1, "user": "KMFHOBART", "date": "December 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 90643510}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed at the Port Orleans French Quarter for a few days while we vacationed at Disney and had a nice stay. The New Orleans style buildings are pretty, the pool is nice, and it is quiet. There's a central area where the pool, lobby, restaurant etc. are then several individual buildings of rooms going off to the sides. It's a little spread out but it's not as bad as some other Disney hotels are. So you might have a short walk to the pool or parking lot but nothing too bad. The rooms are nothing special - your basic hotel room setup. It was a place to sleep after being at the park all day. If we had stayed longer we would have explored the grounds more and maybe had a meal or two, but we mostly just collapsed there each night. I paid extra for a river view, which was nice, but with all the walks back and forth from the car I would rather have had something closer to the parking lot (which is on the opposite side from the river). I wouldn't have a problem staying here again, however with all the options at Disney the next time I return I'll probably try somewhere else. After all the hassle of traveling to the parks I'll probably splurge and try a place on the monorail line.", "title": "Not a bad choice if you're staying at Disney", "helpfulness": 2, "user": "Chunkylover5480", "date": "August 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 36814960}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This was our first stay at French Quarter. Had stayed are Riverside during our last trip in 2007 and wanted to try the French Quarter because our grand-daughters thought the pool area looked like fun. We traveled with our daughter, son-in-law and two 12 yr old grand-daughters; had two rooms. Just a word of caution, if you want connecting rooms, be sure to ask for connecting rooms, not adjoining. Our mistake, but it worked out just fine. Rooms were clean and the staff did a great job keeping them that way. Staff was courteous, especially the door greeter. Room size was OK, but then we were only there to sleep. With 12 yr olds, we were up and out by 8am or or so and not back till midnight or later if we stayed for the Magic Hours.", "title": "Excellent choice and value for the money", "helpfulness": 7, "user": "DisneyNY", "date": "August 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36620756}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Our building was convenient to everything; pool, boat, store and food court.", "title": "Decent hotel, good location, some concerns", "helpfulness": 3, "user": "Cymraes13", "date": "August 3, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 36580365}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "In the morning, French Quarter was the first bus stop, so we always got a seat; and most times the bus did not pick up at Riverside, so the ride to the parks was fairly quick. Since they combine the French Quarter & Riverside at the park pick up stations, bus ride back was always full and standing room only. The boat ride to Downtown Disney was the best-right outside our building and only a few minute wait.", "title": "rude management,flood in bathroom ,horrible stay away", "helpfulness": 1, "user": "doylelucygizmo", "date": "July 27, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 35890153}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I would recommend the French Quarter and look forward to our staying there in the future.", "title": "Now that we've been there we would do things differently.", "helpfulness": 5, "user": "BeachMamaNumberOne", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 35688498}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Checked in at 1:30 am because of delayed flight. Asked at the desk if I could get milk for a bottle for the baby. Was told he could call us a cab, nothing more he could do. Went across the lobby to the hotel's restaurant. Asked them for milk for the baby, was told no, they were closed. Asked if they could just open up the cooler, they said no, we're closed. The man who plays the music in the lobby was able to get someone to get milk from the employee lounge. After that ordeal, got up to our room, and found no sheets on either bed. Just a pile of sheets on the floor. KId friendly? Not at all.", "title": "Never again...", "helpfulness": 1, "user": "Nicole37594", "date": "November 14, 2010", "detail_rating": {"cleanliness": 1.0, "rooms": 1.0, "service": 1.0}, "id": 87083919}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "I absolutely loved this hotel! Our room was right across from the dining hall in building 5, which was great for when we wanted to fill our resort mugs. We were on the first floor next to the main walkway, and never heard other guests walk by. This was a huge concern for me because I'm a light sleeper, but I had no problem with outside noise. One night we did walk to Riverside on the trail next to the river, which was very peaceful and quiet. The room itself had old decor, but it's very very clean. It was spacious for the 2 of us, and I loved having a free fridge there. Only ate breakfast there, and the omlets were very good. Bus service was very good to the parks. The longest we waited was 15 minutes for Animal Kingdom, but we still got to the park before opening time. Overall, I loved the atmosphere here! I would absolutely stay here again.", "title": "Wonderful Disney Resort", "helpfulness": 1, "user": "kkstraveler10", "date": "November 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86889507}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We are huge Disney fans, and stayed at Port Orleans with our 9 month old son during our vacation in May. We loved our time at Disney's Port Orleans resort. Staff was friendly, hotel was clean, and food at the restaurant was great. We would definitely stay there again. Transportation to and from the resort was nice, we loved taking the boat!", "title": "Port Orleans - GREAT Vacation", "user": "vsteger", "date": "November 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 86529502}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "I would recommend this hotel because it is the perfect hotel for a Disney stay. You are not in your hotel room all that much when you go on a Disney vacation, therefore a moderate resort is perfect. Our kids loved the swimming pool. There is a kiddie pool for little ones and a dragon slide for the older kids. My older daughter loved the slide. The food is mediocre. It is like any of the other Disney moderate resorts' food. The room was perfect for the amount of time we spent in it. The other advantage of this hotel, is that it is close to all of the parks.", "title": "Perfect hotel for Disney vacation", "user": "kleiker1978", "date": "November 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 86448063}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Fantastic disney hotel great location very clean spotless grounds everthing well maintained just spot on 1st class.Disney buses ran every ten mins did not have any problems with them. Staff very friendly and could not do enough to help you out with anything you may need or need to know. I would recommend staying here to all families.Pool area lovely and great for kids. Every day mousekeeping left towel animals for my son and when it was his birthday we returned to find a birthday cake waiting FANTASTIC PLACE am returning again next year.", "title": "FANTASTIC HOTEL RESORT", "user": "flossy37", "date": "November 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86375108}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The last time we stayed here, we were not pleased, but I read that the rooms were being upgraded and decided to stay here again.", "title": "Ask for an Upgraded Room", "user": "BackTooSoon", "date": "January 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 92423555}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We had 2 connecting rooms, and they were excellent. The bathrooms have thankfully been retiled and regrouted. The new beds are queen sized. The rooms now have flat screen TVs. Everything is new!!!", "title": "We were so happy we chose POFQ", "helpfulness": 1, "user": "disneygrandmama", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91781278}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "As of today, buildings 6 and 7 have been redone, and they are now working on buildng 4, but by April, all the rooms should be done.", "title": "POFQ is dated, but still had great stay", "user": "dler", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 91636663}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The only complaint I have is that when we moved the clock and phone on the nightstand, there was an inch of dust under them. This is a shame, since the room was redone within the last 2 months.", "title": "Family friendly", "user": "modo66", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91624140}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Our trip to POFQ was from Nov. 28-Dec 10, 2010. We've had nothing but good to say about all of the staff. The check-in process was flawless. My daughter had called the front desk about 5 days before arrival to request a pack-n-play, and told the desk that we would be traveling with an infant and wondered if we could have a quiet-ish room. By the time we checked in and walked to Building 3, our pack-n-play was being set up at the room. We had groceries delivered, and bell services brought them to us within minutes of checking in. My son-in-law needed to get some work done, and asked about getting a cab at the front desk. One was there for him in minutes. Our Mousekeeping was super. We had cute animals made from towels at least 7 of the 10 days. Our Mousekeeper also made the baby's bed up daily with her little pink blanket, and toys on her pillow. It was very clean and comfortable, and from what I'm reading, Building 3 hasn't been renovated yet. We loved the boat ride to Downtown Disney, and used it twice. The bus service was Ok also, however, there were a few days that it seemed we waited more than 20 minutes. Maybe we just missed the bus. We would absolutely stay here again. It is a quaint resort with beautiful grounds and super friendly castmembers.", "title": "Great Christmas stay even in non-renovated rooms", "user": "Nunzio_Rochester_NY", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91601929}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We first stayed in this hotel when it was brand new in 1992, and have been back many times throughout the years. Due to this, I will probably give it a higher rating than it deserves.", "title": "Not what we expected", "helpfulness": 1, "user": "BackTooSoon", "date": "August 17, 2009", "detail_rating": {"cleanliness": 1.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 37918226}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We like this resort, because it is small and manageable. The transportation to the parks is also quite good.....but.....from the moment I stepped into the room, I thought it did not look clean. The first thing I did was remove the bedspreads for the length of our stay. Also, the grout in the bathroom was black with mold. At first, I thought they had regrouted in black, but when I looked up, I realized the grout near the ceiling was white. Gross!!", "title": "Mixed bag", "helpfulness": 5, "user": "1happydisneygirl", "date": "August 11, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 37323641}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I want to add that we had dinner at the Polynesian one night, and I found the common areas old and dirty, so maybe it's time for Disney to do some updating.", "title": "Very nice but nothing over the top grand", "helpfulness": 1, "user": "SnuffleBugg", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37283259}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "After doing a LOT of research and talking to friends who have been to Disney World, we chose to stay at the P.O. French Quarter. Frankly speaking, I am not a big fan of Disney hotels. My family goes to Disneyland (CA) 3 times a year and no longer stays at Disney owned hotels...too many bad experiences over the last 20 years. However, we wanted to be in the middle of the Disney World \"experience\" so we broke our rule. We stayed in Disney World for 14 nights. No... \"14\" was not a typo :)", "title": "The most amazing honeymoon I could have ever asked for.", "helpfulness": 1, "user": "silversangel", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37196465}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "ARRIVAL: We drove our rental car to the complex and arrived around 11:00 p.m. Our greeting and check-in was not \"Disneyish\" is any way. We felt as if we were bothering the front desk clerk, who took no time at all to explain anything to us. She never never smiled once...no exaggeration.", "title": "LOVE This resort!", "helpfulness": 2, "user": "kdpei_8", "date": "August 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37045214}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Close to Epcot this hotel was a great choice for us. The pool was big with a great slide for the kids. I do think the rooms could have been cleaner. The staff was very friendly and the food at the hotel was very good.", "title": "Excellent choice for a moderate....", "helpfulness": 1, "user": "crananon", "date": "December 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22532695, "likes": {"liked": "— Very close to Epcot, Friendly staff, great Disney option", "disliked": "— room could have been a little cleaner..."}}, {"rating": 5.0, "title": "Charming resort", "text": "I loved the well manicured property. It was charming, with several grassy squares with fountains in them. It was not a huge property like many other WDW resorts, you could comfortably walk the property. We stayed in building 4, very convenient to the bus stop, and while technically it overlooked a parking lot on our side, it was buffered by bushes and grass. The other side of the building would have been prettier as it overlooked the grassy square and fountain. The pool was nice sized and interesting, many areas were 3 foot 6 inches deep so my kids could touch down. Fun dragon slide, well life guarded. There was a nice hot tub tucked behind a boxwood hedge with a lions head shower. The theming was great. Laundry room right near the pool open 24 hours. A nice arcade, lounge area with live music some nights. You can book a horse and carriage ride, catch a boat launch to Downtown Disney (very commercial, I hated Planet Hollywood) or a boat to Riverside the adjoining resort. Kids get Mardi Gras style beads and wishing coins on arrival.", "helpfulness": 5, "user": "mg3542", "date": "December 1, 2008", "id": 22359704}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Food court was nice, good breakfasts, and late night bites, no complaints (except the Nescafe, make coffee in your room!). My kids did not like the huge fiberglass heads hanging for decoration, I guess they were a bit scary. We had dinner at Boatwrights at Riverside which was walking distance. Nice service, food was variable (I think that might have been Minute Rice and margarine on the table!)", "title": "Overall good hotel", "helpfulness": 8, "user": "VTMChris", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22331894, "likes": {"liked": "— Magical Express/Early park admission/Purchases sent back to hotel", "disliked": "— Occaisional wait times for buses, too much nickel-and-diming"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The room was also nicely themed, newly decorated. Mousekeeping was sufficient. We tipped a bit each night. Last day our mousekeeper checked in with us as we were leaving, but not prior to this.", "title": "Great Location, Good Value although not perfect", "helpfulness": 4, "user": "Arrondor", "date": "November 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 22103001, "likes": {"liked": "— Location", "disliked": "— Rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Buses were quick and reliable, we never waited more than 10 minutes the whole trip.", "title": "Some Problems, But Good Location.", "helpfulness": 4, "user": "garpts", "date": "November 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 22078784, "likes": {"liked": "— Location", "disliked": "— Cleanliness, noise of 1st room"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 91, "average": 259, "very good": 973, "terrible": 50, "excellent": 1342}, "aka": "Disney Port Orleans", "slim_ranking": 0.12462006079, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Disney's Port Orleans Resort – French Quarter is inspired by the romance and pageantry of the historic French Quarter in New Orleans, and where every day is a celebration. Step through a wrought-iron portal into an alluring world of delicious Cajun food, jazz music and dazzling parades."}