{"user_rating": 4.0, "review_count": 1134, "name": "Disney's Paradise Pier Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "I have just read another review that said this hotel was a dump - Not true! We have just returned from a 5 night stay. Two adults and 3 children, we had a room (709) with 2 queens and a sofa bed; the room was very recently refurbished from what I could tell, very clean, comfortable, empty mini fridge for your drinks etc. The lobby is not the Grand Californian and the pool is nothing special - however you can use the Grand Californian lobby all you want, charge meals, spa service etc to your room. When we were there the pool was closed so we were able to use the pool at the Grand Californian and the Disneyland Hotel which was a real bonus. If your little ones are tired you can watch the fireworks from the pool deck and they pipe you the sounds/music that you would hear in the park - now that's Disney! There is nothing wrong with this hotel!", "title": "Very nice rooms!", "helpfulness": 6, "user": "Banano", "date": "May 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7567507, "likes": {"liked": "— Location and Rooms", "disliked": "— Lobby and Pool"}}, {"rating": 2.0, "title": "Stay elsewhere; enjoy Disneyland", "text": "There are great small places to stay near the gates. Try any of those on tripadvisor first. Paradise Pier is overpriced for a three diamond hotel. Rooms were clean. Maintemance was slow for broken phone; one day to fix. Service was uncaring at front desk and manager. They could not react to any requests or feedback; just that Disney smile. Japanese restaurant was pretty, great service, high priced and poor food. Worst tempura; burnt old oil. I mentioned to hotel staff; just got that vapid smile. I expected more for $1500", "helpfulness": 4, "user": "travelinman_CA", "date": "May 2, 2007", "id": 7540729}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "So stay elsewhere, and check out the great Grand Californa Hotel lobby. great place listen to music and enjoy. Fun time except for this hotel.", "title": "Don't do it!", "helpfulness": 7, "user": "CaliforniaShopper", "date": "April 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 7476709, "likes": {"liked": "— service", "disliked": "— location"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We made a choice to stay in a Paradise Pier concierge level room with a view of Ca Adventure for the same price as we would have paid for a standard rm at the Grand Californian. It wasnt' worth it! The food at the concierge room was scant (fish crackers & soda) The pool felt really cheap and was not half as great as the picture looks. The Grand Californian is the only place to stay if you're going to spend the night at Disneyland. Everything from the pool chairs to the food quality was so much higher at the Grand, and you cant beat the easy access to Downtown Disney and Ca. Adventure. (Think better food and fewer steps) It's easy to think that a $100/night difference in rates would not be worth it, but you realize once you get there, that $100 is \"nothing\" and you're shelling it out all day long.", "title": "Stay away", "helpfulness": 3, "user": "nickjudy2003", "date": "April 19, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 7393574, "likes": {"liked": "— Location", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The Paradise Pier hotel is a dump. The service was equally as horrible. I would not recommend staying there. Pay a little extra and stay at the Grand Californian.", "title": "Great Location", "helpfulness": 10, "user": "bigelowfamily", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7293377, "likes": {"liked": "— Distance from parks", "disliked": "— Had a suite but both beds were in same room. Thought they were in separate areas."}}, {"rating": 4.0, "title": "Which Disney Hotel to choose?", "text": "Is it just me or if your travelling from afar you want to make sure you choose the right Disney hotel to stay at?", "helpfulness": 2, "user": "MissTravelAlot", "date": "May 31, 2007", "id": 7726653}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We found the Paradise Pier to be a little less understated than the other two.", "title": "Disney knows how to make you feel good.", "helpfulness": 12, "user": "Jennt", "date": "May 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7699085, "likes": {"liked": "— Coming back to our room and finding that our kids stuffed animals had been having a party in our absence, with the music turned on and them wearing leis etc."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The pool was fine and it did have a water slide.", "title": "Disney Magic!", "helpfulness": 8, "user": "sunkistpeach99", "date": "May 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7682877}, {"rating": 4.0, "title": "Great Location!!!", "text": "The California Grand was in true American style over the top. But if your going to go Disney why not? It looked like staying in a log cabin and if I went again this is where Id stay. It was massive though so if your not into that sort of thing the pier may be the place for you.", "helpfulness": 6, "user": "TwoSheep", "date": "May 11, 2007", "id": 7589745}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The pier is situated the futherest away but still its not that big a deal to walk to the parks.", "title": "Super!", "helpfulness": 7, "user": "widowtallan", "date": "May 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7584350}, {"rating": 1.0, "title": "Stay Away!", "text": "This place is a dump! From smoke-smelling hallways(smoke free?) - to dirty glasses, bathtub that doesnt drain - ripped wallpapaper - stay-away!", "helpfulness": 4, "user": "CONNIE4", "date": "April 7, 2007", "id": 7290643}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My wife and I stayed at the Paradise Pier on October of 2006 for our Honeymoon for one week. Had a great stay and had an excellent view of California Adventure. Having worked in the hotel/hospitality business for many years, including some at Walt Disney World in Florida, I knew what to look for from both a guest and employee point of view. I have to stress that this hotel wasn't originally built as a Disney hotel, and for those who are used to staying at the heavily themed WDW hotels in Florida, you might be a little disapointed in this one. However, we still enjoyed the stay, and both of us thought the cast members at the hotel were very friendly and helpful! You can hear the noise of the theme park rides outside your room at night, but that didn't bother us. In fact, I thought it was kind of cool to see all the people down there enjoying all the attractions while we were up on the 14th floor taking in the great views. Definitely would recommend staying at this hotel again.", "title": "Great Honeymoon at Paradise Pier!", "helpfulness": 16, "user": "Seandb", "date": "April 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7284198, "likes": {"liked": "— The View", "disliked": "— None"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "I booked 2 nights at Disney's Paradise Pier hotel in March 2007 because I wanted 3 days at “the happiest place on earth”, without ever having to leave the Disney properties.", "title": "Our $300 View of the Parking Lot Was Quiet, At Least!", "helpfulness": 18, "user": "Melissa5", "date": "March 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 7219912, "likes": {"liked": "— Our room was the most quiet room I have slept in at any hotel near Disneyland.", "disliked": "— Doesn't have 24-hour room service; too expensive for quality of room and facilities."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Did the experience live up to our expectations? Was it worth the price? Well, yes and no.", "title": "Sounds better than it is", "helpfulness": 9, "user": "ProudMamma", "date": "March 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 7201921, "likes": {"liked": "— The arcade for the kids", "disliked": "— The rats and the bugs"}}, {"rating": 4.0, "title": "Worth the money - if you have a small child", "text": "We booked a standard room for the cheapest possible price....still a whopping $292 per night in March by the time they add taxes and resort fees. We had a view of the parking lot from the 12th floor, and the pool was a tiny dot far below. However our room on the 12th floor was very quiet...I am a light sleeper and had requested a quiet room. While I knew we wouldn't have a view of the Disney parks, I hadn't realized our view would mostly consist of the parking lot. (Somehow I had imagined a city view with lights.) We closed the curtains and tried not to look out the window.", "helpfulness": 9, "user": "JulieFangKoo", "date": "March 20, 2007", "id": 7195183}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I stayed at the Paradise Pier for three nights in February 2007. We had a concierge room. I would recommend this hotel. Personally I didn't think the room was any better than a standard non-conceirge room, but the added amenities were worth it. We definately saved a lot of money being able to get refreshments from the lounge. It was a good location to be able to go to CA Adventure Park or to ride the monorail to Disneyland.", "title": "Nice hotel, convienant location", "helpfulness": 11, "user": "luvdinaz", "date": "March 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6901286, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "We loved this hotel. We brought our 5 year old twins to Disneyland for the first time and enjoyed being so close to the parks. California Adventure was accessed through the Grand Californian. For Disneyland we went out the back door of the hotel, followed the red brick path to Downtown Disney, and hopped on the monorail to tomorrowland. Probably 6 minutes walk at the most.", "title": "Great hotel", "helpfulness": 27, "user": "cmgering", "date": "February 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6805288, "likes": {"liked": "— Location and room quality", "disliked": "— Maid service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Aside from the convenience of being so close to the park, this hotel was great for other reasons as well. It has a beautiful fitness center. The kids loved the pool and slide. They also made use of the movie room a couple of times. Bell service was just fantastic. Most importantly, our room was just the perfect fit for us.", "title": "Very family friendly", "helpfulness": 12, "user": "MegAZ", "date": "February 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6799187, "likes": {"liked": "— Proximity to Disneyland", "disliked": "— Roomservice menu and food options in the hotel were extremely expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We had booked a standard view room but were placed in a park view. That spoiled us. Now we'd be sad not to have one. It was so neat to look out over the California Adventure park at night and during the day. The beds were very comfortable and there were extra pillows and blankets in the closet. They are there because the couch can be folded out to sleep two more if needed. Having a couch is always nice. The desk had a smaller roll around desk underneath it. We used the \"second\" desk to eat breakfast on. When we were done, we wiped it off and rolled it back into place. It was a really neat feature. Have never seen that before. The in-room safe was also great. It was big enough to fit our 15\" laptop and whatever else we wanted to put in it. The fridge worked well and there was a small single cup coffee maker with supplies to make two cups a day. The heating and cooling system was great too. It was hidden in the wall and had a control switch by the desk. The buttons had their symbols rubbed off but the bellhop was great in explaining what each button did. Make sure to ask.", "title": "Halfway round the world to stay at the Paradise Pier!", "helpfulness": 17, "user": "Mickey-lovingKiwi", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6781000, "likes": {"liked": "— It's all so Disney!", "disliked": "— Having to leave - it was great!"}}, {"rating": 5.0, "title": "Happy at Paradise Pier", "text": "The one complaint that we have is that maid service was a little hit and miss. We were tipping her $4 a day. The first day she forgot to leave us 4 glasses, leaving only two. The first two days there was no fresh bar soap left but shampoo was left for us. The third day our daughter's blanket got picked up off the top of her suitcase and was headed to the laundry. There was one day out of the five where everything was perfect. My wife called housekeeping the next morning and a very polite gentleman said he'd check with laundry and see if they couldn't find the blanket. When we came back later in the day the blanket was nicely folded and laying by the phone. Smiles for everyone there!", "helpfulness": 18, "user": "OregonPlumeria", "date": "January 29, 2007", "id": 6714823}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 66, "average": 168, "very good": 455, "terrible": 33, "excellent": 412}, "aka": "Paradise Pier Hotel", "slim_ranking": 0.18018018018, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Return to the heyday of California beachfront boardwalks at Disney's Paradise Pier Hotel. Loaded with special Disney touches, this seaside-themed hotel will carry you on a wave of relaxation, all the way up to the whimsical waterslide at the scenic rooftop pool. Located in the heart of Downtown Disney District, exceptional dining and entertainment are just steps away. Hotel Guests can also enjoy a special entrance through Disney's Grand Californian Hotel & Spa to Disney California Adventure Park with a valid Park ticket."}