{"user_rating": 4.0, "review_count": 2179, "name": "Disney's Grand Californian Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We have stayed at all three of the Disneyland hotels, the Disneyland Hotel, Paradise Pier and Grand Californian. This trip we upgraded to the Concierge level of the Grand Californian. Being Annual Passholders we got a great price. Was it worth the upgrade? Not for us. But it could be for some. Read more!", "title": "Grand Californian Concierge - Good and Bad", "helpfulness": 17, "user": "Tuckers", "date": "December 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 11697041, "likes": {"liked": "— The location is ideal. Rooms are nice.", "disliked": "— Cost is high, customer service lacking"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "You are suppose to get priority check in when you book a Concierge level room, but we didnt get that. No big deal, there was only one other family in line in front of us.", "title": "Totally worth it", "helpfulness": 2, "user": "SeattleA&B", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11654194}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Concierge Experience: Nothing was even mentioned to us about any of the concierge benefits when we checked in, we had to ask about it. I had no idea where the lounge was, how we'd get access to it, or anything. The Cast Member who checked us in was friendly but not very helpful. So anyhow, we were too early to get a room, so we had them hold our luggage for us while we went to the parks. We were allowed to go to the concierge lounge and have some snacks, which was nice. We had some little snacks, grabbed some small bottles of water and went on our way. Throughout the day they have different snacks available. Morning time there is a continental breakfast with pastries, fruit, cereals, bread, juices & coffee. Then later in the day there are cookies, fruit, little sandwiches. Happy Hour they have free drinks (we didnt attend so I am not sure what they offered) and cheese & crackers, cookies. Then at night there are dessert foods. The lounge itself was nice, but during breakfast it was hard to find a place to sit. They have a patio that you can stand on to watch the Disneyland Fireworks, which is pretty cool. We were not there for that, but heard people talking about it. You get turndown service, but we were in the room when they went by so we didnt use that. They did give us some wrapped chocolates, though. The concierge desk is right outside the lounge, they always had a line of people waiting to see them - they will make reservations for you for meals, tours, etc. We didnt use them. We ended up having breakfast, a couple snacks and grabbing some bottled waters. Was it worth the added $$$ - for us no. If you are the type to hang around the hotel all day, then it might be. We just were not in our room enough to make it worthwhile. We were also told when I made the reservation that you could use the lounge after you check out, but that is not the case. Your key stops working. So we lost out on some snacks/drinks that last day.", "title": "Outstanding", "helpfulness": 17, "user": "HarryfromLA", "date": "December 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11538972, "likes": {"liked": "— Facilities, setting, convenience, service", "disliked": "— Way too spread out"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "General Hotel Experience: The hotel is gorgeous. The rooms are nice! We asked for a super cleaning service before we checked in. They called it a detox. The room was definitely clean. My son has asthma and mold allergies, so I needed to make sure that the bathroom was CLEAN. It was! The beds were very soft, which is not to my taste. The bedding was crisp and clean. We had a room with two queen beds and a daybed. Plenty of room for us. They had an HD tv, dvd player, Bose Stereo, mini frig in teh room. Also an iron & ironing board, fold up portable crib, and nice soft robes for use while in the room. We had a view of the Disneyland Hotel & the city beyond. Very pretty at night! We also overlooked the entrance to the hotel, and the valet parking lot.", "title": "Loved the Grand", "helpfulness": 1, "user": "dland", "date": "December 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11516478}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Speaking of valet: Its $17 per day. Self parking is included resort fee, but valet is extra.", "title": "This is the best hotel and is worth every penny", "helpfulness": 10, "user": "disneylandfan", "date": "December 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11283438, "likes": {"liked": "— Beautiful hotel, friendly service and convenient location to Disneyland", "disliked": "— long walk through hotel to Downtown Disney, but not that bad...."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Our room was booked months in advance. We arrived earlier than anticipated, we checked in our luggage and vehicle and notifed the front desk of our arrival. We were told our room would be ready by 3pm - it was not!", "title": "Lackluster Performance", "helpfulness": 6, "user": "Elroy_Jetson", "date": "December 5, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 11265344, "likes": {"liked": "— reasonably close to Disneyland entrance and monorail", "disliked": "— The sinks didnt drain properly - clogged or very slow"}}, {"rating": 2.0, "title": "Shame On You Disney!", "text": "We encountered one uncaring employee after another who did little if anything to get us into our room. Housekeeping was to blame for the delay.. Perhaps they should hire more staff?", "helpfulness": 8, "user": "LUV2TRAVEL8888", "date": "December 4, 2007", "id": 11247871}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Close to 4:30pm we were in front of our assigned room but could not get in. None of the keycards worked. So back to the lobby we went to meet the unsympathetic employees once again.", "title": "Loved the hotel - some tips & comments", "helpfulness": 7, "user": "katie202", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11234670, "likes": {"liked": "— Proximity to parks, concierge services, beautiful", "disliked": "— Housekeeping service, possible cause of illness"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We were not in but 10 minutes before room service arrived asking if we wanted the beds turned down. Uh. Its only 5pm!", "title": "Beautiful hotel, excellent location", "helpfulness": 4, "user": "FritzieontheGo", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11232026, "likes": {"liked": "— Location, DIsney magic", "disliked": "— Cost (ouch)"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Bottom line, the rates are too pricey, the rooms average, and you're still a good walk away from the entrance to Disneyland.", "title": "A fabulous stay until food poisening or flu not sure..", "helpfulness": 3, "user": "mamacritic", "date": "December 2, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11204288}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "This was our second trip to Disneyland; having previously stayed at Paradise Pier. We decided to go all out for our Thanksgiving trip this year and stay at the Grand Californian - Double room with a view of Downtown Disney.", "title": "Torn...Can't Make up My Mind If It Was Worth The Price", "helpfulness": 9, "user": "FleegeFamily", "date": "November 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 11154622, "likes": {"liked": "— Location, location, location", "disliked": "— Value for price"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Housekeeping was totally erratic, coming at all different times of the day and once not at all. Having a three year old that needs to nap, this was frustrating. Also annoying that several times the housekeeper removed the bedrails to make the bed and did not replace them. We enjoyed the turndown service - one evening the housekeeper arranged/posed our son's stuffed animals that had been strewn aroudn the room, which was cute. A little creepy, but I guess a nice gesture that they take a picture of it for you to keep as a souvenier.", "title": "A Grand Stay.....", "helpfulness": 6, "user": "silvalife", "date": "November 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11121009, "likes": {"liked": "— The view, the beds, and the location....", "disliked": "— We got a discounted rate and still thought it was priced high."}}, {"rating": 3.0, "title": "Very convenient, but too big", "text": "Paying for the 'upgraded' view was a big disappointment. We were on the 5th floor, and our balcony did not have a railing, but a solid wall; you could not sit on the balcony and see Downtown Disney below, you had to stand. So we never really used the balcony (except to watch the Fireworks display a few times, which was convenient, but not worth the additional $60/night). My husband's parents did not pay for a view, but were upgraded at check-in for no additional cost - they got the better deal. We probably should have asked to be moved, but honestly did not want to be bothered to pack back up after just having unpacked a week's worth of stuff.", "helpfulness": 3, "user": "CalifKids", "date": "November 26, 2007", "id": 11079041}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "The rooms were nothing special; I expected more for what we were paying (approximately $360/night on our AAA package) - there were really no special decorations or anything. I was hoping the rooms would be appointed similarly to Animal Kingdom Lodge at DisneyWorld - alas, no. Very plain room.", "title": "Nice....but not worth the money", "helpfulness": 5, "user": "hvinsonhaler", "date": "November 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 11016217}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Loved the location and convenience of being a half a block from the parks and right in the middle of Downtown Disney. This really makes up for some of the other things we felt to be negative. The self-parking was also convenient (and included in the $11/daily resort fee - as is WiFi), as we prefer this over valet parking.", "title": "Great Stay By a Seasoned Traveller", "helpfulness": 7, "user": "GoMaxTraveller", "date": "November 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10972865, "likes": {"liked": "— Quality, Location and Staff", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Stayed here for our teenagers 16th birthday. And I would have to say that the problems started with the check in. There was a delay (until 5 PM) on getting our room. We wanted and paid for the concierge service. When they checked us in we were told that it was an additional charge. It seemed that the entire weekend was like this. The place is beautiful - but doesnt seem that they want children there either. We got rude looks from the staff as our cheer kids were hanging out by the fire with us.", "title": "Way over rated and over priced", "helpfulness": 5, "user": "CheerFamily", "date": "November 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 10964904, "likes": {"liked": "— Direct entry to Down Town Disney and California Adventure", "disliked": "— The price and feeling that we were out of place"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007", "text": "The rooms were nice - but small. We had a suite and it seemed that we were walking around things to get anywhere. Compared to the Disney suites, I would say about 150 sq feet smaller.", "title": "Beginning to lose its charm....", "helpfulness": 6, "user": "tempejim", "date": "November 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 10910087}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Anyway - we will definately go to the Disneyland Hotel next time.", "title": "We've stayed many times, but...", "helpfulness": 12, "user": "TravelingTGS", "date": "November 8, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10695922, "likes": {"liked": "— Location, ambiance", "disliked": "— Check in"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We visit Disneyland once a year and had been staying at Disney's Grand Californian, but no more. Disney has been pushing this as a 4 star hotel, but lately the service has dropped to a 3 star hotel.", "title": "Stay there for sure, but.......", "helpfulness": 11, "user": "fwd9", "date": "October 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 10455492, "likes": {"liked": "— Proximity to theme parks", "disliked": "— Service, especially given the price"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The rooms are beginning to show their age, the flat screen TVs are a nice addition, but the bathrooms are getting old and the furniture is becoming worn. The rooms are noisy due to their location close to Downtown Disney and California Adventure. The HVAC isn't loud enough to drown out even cars driving by.", "title": "Amazing hotel - worth the $$", "helpfulness": 1, "user": "BklynChick317", "date": "October 26, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 10361485, "likes": {"liked": "— The proximity to Disneyland, DCA and Downtown Disney", "disliked": "— Late night options for quick dining"}}, {"rating": 4.0, "title": "Location is best attribute", "text": "We arranged a four night stay at the Grand Californian during the Christmas holiday period, departing Jan 1. The hotel is beautiful and clean and the location is terrific for visiting Downtown Disney, Disneyland and California Adventure. That said, the regular-level rooms are not very large and barely provide adequate space for beds, dresser and small table with two chairs. Room value at Disney resorts is similar to food value - generally overpriced. Dinner at the Napa Rose was well worth it and our group of 20 also enjoyed meals at Naples, House of Blues and a Brennan affiliated restaurant - all in the Downtown Disney area.", "helpfulness": 5, "user": "VisitorBob", "date": "January 2, 2008", "id": 12262487}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We paid waaaaay too much money for our room at the Grand Californian. It's definitely the first time I've ever checked out from a high-end hotel feeling that we were totally ripped off.", "title": "There are more enjoyable ways to waste money", "helpfulness": 20, "user": "Eiregirl", "date": "January 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 12206821, "likes": {"liked": "— The lobby.", "disliked": "— The pervasive feeling that we had just wasted a big chunk of money."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "The high points: The room itself was standard in every sense of the word, but it was clean. The hotel common areas are beautiful and worth a walk through if you're into the Arts & Crafts period. If you are a guest, you have the 'priviledge' of getting in line for California Adventure (though not Disneyland) inside the hotel property instead of negotiating your way to the front of that park. We were also 'upgraded' to a 4th-floor view of the construction site next door...an interesting sales pitch which may have worked if our boys were still in the Bob the Builder stage of life, but since they aren't dazzled by bulldozers anymore, none of us were terriby impressed.", "title": "A fantastic experience!!", "helpfulness": 4, "user": "sammbug", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11993759}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The downer: While you expect to pay an insane amount of money when you visit Disney, there is a point when the prices actually become insulting. One example: we ordered room service one night and picked a quesadilla & chicken nuggets for the kids. They brought up - I kid you not - four teensy chicken nuggets in the middle of a plate and a taco-sized tortilla with a thin layer of cheese cut into four pieces. No veg, no sauce, not even a lousy piece of garnish. $10+ each with the tax & service charge. Again, room service is never dazzling, but each serving could literally fit in the palm of their hands.", "title": "Motel Service @ 5 Star Pricing", "helpfulness": 19, "user": "TustinTraveler", "date": "December 22, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 11899203, "likes": {"liked": "— Great Hall", "disliked": "— Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The room service pretty much sums up the value-for-money at this resort. It's almost as if there is an effort to see how little the hotel can provide for the money...and there certainly isn't anything in the hotel that isn't overpriced by a factor of at least 200%. I'd dare say it is more ridiculous than the parks themselves. Despite the location, there is no way that our room was worth even half the amount we paid for it. (The service is also average and we had the same delayed check-in issue everyone else in this forum seemed to have.)", "title": "Best stay EVER!!", "helpfulness": 10, "user": "amber3fan", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11702835, "likes": {"liked": "— Everything!! Not a thing I disliked at all! Loved the personal attention from the staff!", "disliked": "— Nothing!! This place is the BEST place in and around the Disneyland Resort! worth the $$$"}}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 130, "average": 278, "very good": 687, "terrible": 53, "excellent": 1031}, "aka": "Grand Californian", "slim_ranking": 0.0810810810811, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "This stunning hotel offers premium accommodations and rich dining experiences in American Craftsman style and elegance. With its world-class spa, an impressive array of amenities and impeccable Disney service, Disney's Grand Californian Hotel & Spa defines grandeur in every way. Located in the heart of Downtown Disney District, this hotel is just steps away from exceptional dining and entertainment. And with your park ticket, enjoy an exclusive entrance to Disney California Adventure Park."}