{"user_rating": 4.0, "review_count": 3363, "name": "Disney's Caribbean Beach Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "This was our third stay at the Caribbean Beach Resort, and it continues to be a quiet, relaxing place to stay. The pools at the villages are never crowded. We stayed in Martinique this year, which was closer to the Food Court and main pool then the previous two visits, when we stayed in Aruba. The room is large and comfortable.", "title": "Excellent as always", "helpfulness": 1, "user": "Roseann_F", "date": "December 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186470089}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "This was our 2nd stay at this resort. We enjoyed our first stay 10 years ago. We did not enjoy this stay. We selected a pirate themed room. It is an extra charge due to the special bed and furniture, however, there were so many drawbacks, this should not have cost extra. These rooms are in South Trinidad which is the furthest from the central main buildings. The beds were terrible- a normal set of box springs topped with what can only be described as a half-thickness mattress (slightly thicker than a futon mattress). Not comfortable at all.", "title": "Caribbean Resort doesn't have the Disney Magic", "helpfulness": 1, "user": "IowaGidget", "date": "December 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 186469229}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The dresser had a busted drawer with sand in it. The barrel contained a refrigerator with a sign indicating it was not to be plugged in yet it was plugged in. It was not cold. Advertised as a room with a refrigerator yet one was not available.", "title": "Overall nice resort", "user": "rosebud1234", "date": "December 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 186454484}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "The washcloths in the room were initially great but replacements were stained and worn. My in-laws were also at the resort and had the same issues.", "title": "Location of room very important", "user": "kentucky2008", "date": "December 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 186452288}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We were there during the week of Thanksgiving. The buses were always full before arriving at our stop. When we did get on, it was often standing room only was difficult to do with a 2 year old.", "title": "BETTER THAN EXPECTED", "helpfulness": 1, "user": "keith m", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186424787}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Rooms were not kept clean.", "title": "pick a different resort", "user": "4gottago", "date": "November 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 22247870, "likes": {"liked": "— The bus service", "disliked": "— They were not accomodating at all about anything.Isn't this supposed to be Disney"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Staff not helpful or up to Disney's normal standards that I am used to.", "title": "It was ok.", "user": "terri024", "date": "November 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 22139083, "likes": {"liked": "— Close to the parks", "disliked": "— Dirty Tub and carpet."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "Most off all, that upset me was that the rooms I requested they had on file and when we arrived , they failed to even come close to a small list of places we wanted to be located.Asked for a manager and she put us so far away and then proceeds to tell me that the buildings that I requested were $20 more a night .I would have no problem with that but, Nothing was ever said a the few times I called to check on reservations about the extra $20 .", "title": "Enjoyed my stay", "user": "angel44940", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 22112173, "likes": {"liked": "— the atmosphere", "disliked": "— that they messed up with our luggae"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I tried to fork over the money that I was never informed about.She needed that at the time of reservations.Well, with these specific rooms requested ,it was so dumb that I was not told this. After our 9 hour drive this was not a pleasant check -in.So we had to settle for a room we did not want,to not ruin our trip.", "title": "Amazing time", "helpfulness": 1, "user": "sam2525", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22018247}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The least the manager could have upgrade us or given us a room with a view.When the resort was only 50% full.", "title": "Kids Loved CBR, Magical Express sucks!", "helpfulness": 1, "user": "canadarocks66", "date": "November 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 21972728, "likes": {"liked": "— It was scenic and quiet and had its own pool, as well as a main pool", "disliked": "— The size and how spread out it was - I like things to be handier"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Second time at this resort, it's reasonably priced and has fairly decent rooms. Love the Disney transportation, but if you like to get up and go, the resort is rather large, so it takes a while for the bus to get around, depending on what part of the resort you are at.", "title": "Great, affordable way to do Disney", "user": "Christine H", "date": "December 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 187041070}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "I would stay here again because of the price, beautiful grounds, and relaxed feel.", "title": "Thanksgiving week holiday", "helpfulness": 1, "user": "Sdelray", "date": "December 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 186870794}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The food/shopping area is very nice, especially since you feel isolated from the \"real\" world.", "title": "Average at best - Stay somewhere else", "helpfulness": 1, "user": "CT_Traveler1515", "date": "December 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 186620621}, {"rating": 4.0, "title": "Thanksgiving vacation", "text": "Check in and finalizing of our trip was so easy and the staff are more than willing to assist with whatever requests we had.", "helpfulness": 1, "user": "teribillings", "date": "December 2, 2013", "id": 186591248}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The spa at the pool is not too hot, due to the kids, so that was a disappointment.", "title": "Worn out rooms. Sprawling resort.", "helpfulness": 1, "user": "Tammy-McK", "date": "December 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 186586872}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Stayed in the standard room in Martinique for a week -Martinique was close to the food building which was good. The bathroom was small but didn't bother us. The grounds were kept clean. It just my daughter (who was 14) and I so we never went to the main pool. There's a pool for each building complex so we could swim there and it was nice. We would get back to the hotel at 1 am and would go for a dip. Even though the lake is man made, the grounds we beautiful and felt like you were at a luxurious hotel in the Caribbean. When we arrived at the hotel we had to wait a while for a bus to get us and take us to our room but probably 90% of the time the bus would come frequently for the parks. Overall it was a great stay! Would definitely go back!", "title": "Dream Come True!", "user": "reallysilly3", "date": "November 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186373840}, {"rating": 3.0, "title": "Not worth the price", "text": "I love disney. And I know that Disney loves families. So I thought it would be great to do an all inclusive package to disney world, a Disney resort, and eating disney food. Perhaps they are not all bad packages, but we wouldn't purchase this carribean beach resort package again. First, the walk from your room to ANYTHING (restaurant, gift shop, resort pool) is lengthy at best. A good .25 to .5 to .75 of a mile. Second, we were expecting 3-4 star quality rooms, like a hilton or a nice Laquita. Not so; instead it was like 2 1/2 star quality, like a days inn or red roof inn; but more like a motel with your doors outside. Finally, we will never again rely on disneys shuttles for transportation. Without family group of 6, it was just too difficult and time consuming. Disney world is great, but this resort is overpriced for what you get.", "user": "Dasielady", "date": "November 30, 2013", "id": 186362983}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "This is a moderate disney resort, not motel 6ish but not embassy suites. Request a room in Trinidad north or Martinique to be close to the good pool and all food. Rooms are average with double beds. Beach is nice with campfire each night for the kids followed by a movie outside for the kids. There is no workout room here, but a nice walking path around the lake", "title": "Average hotel, great service", "user": "Autumnc1978", "date": "November 29, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 186262525}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Stayed at Caribbean Beach for 5 nights, and thought it was just ok. Themes and rooms were very nice, but the resort is LARGE. Thankfully, our travel agent requested a room relatively close to bus transport and the main hub. I genuinely felt sorry for everyone else. There are six bus stops within the resort, so after a long day at the parks, you could have an even longer wait on the bus. The bus is always crowded and usually fills up before it hits all the stops. Mousekeeping also seems a bit lax at this resort. We only got towel animals the first night, after that zip. We stayed previously at Port Orleans-French Quarter, and liked that better. I wonder if it being a bigger resort that housekeeping is more strained. Probably won't stay again.", "title": "HUGE resort", "helpfulness": 1, "user": "Becky N", "date": "November 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 186212595}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "We stayed in the Martinique section in a preferred room which I highly recommend. The room is exactly the same as the others. BUT you are right next to the food court and main pool. If you are in one of the other \"villages\" you might have to take the internal Caribbean Beach bus to eat and get coffee!!!!!!!!!!! Also, the buses to the parks were right behind our building. We had building 25. It was quiet and had a nice beach right outside our door. Room was very clean. Ate dinner one night at Shutters which was good. We ate on the meal plan so it wasn't pricey. Breakfast was good there in the morning. Service was fast.", "title": "Couldn't be better", "helpfulness": 3, "user": "douboy386", "date": "November 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186082926}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "My family and I stayed at this hotel during our recent visit to WDW. Our Jamaica room was reasonably-well located and just a short, very pleasant walk to the main restaurant building. The property itself is nice. The problem continues to be the rooms. While everything was in decent repair and exactly what one would expect in a moderate resort room, the room was very humid. My party would complain that housekeeping would leave our air conditioning on full blast when they freshened up the room, and I think this was due to the humidity. This made the room a rather unpleasant place to be. We had to freeze the room to neutralize the humidity. Other than that, and the fact that Disney really needs to invest in queen beds, the room was sufficient.", "title": "Not especially pleased the second time around, either.", "helpfulness": 1, "user": "lanakoala", "date": "December 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 187592225}, {"rating": 1.0, "stay_parameters": "Stayed December 2013", "text": "I'm also concerned about the size of the public areas. The pool and restaurant areas seem to be in need to expansion to accommodate the large crowds. I continue to think that splitting this resort (a la POR) into two would probably be a wise idea.", "title": "So disappointed.", "user": "moomyof3", "date": "December 13, 2013", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 187579363}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Given the other properties available, I wouldn't book this hotel again. There are too many others that are better situated and more comfortable to choose the CBR. If, however, you are looking for a place to crash in between park visits, this will suffice.", "title": "3 Week Vacation", "user": "Perky62", "date": "December 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187512471}, {"rating": 5.0, "title": "Decent hotel. Would go again", "text": "Disneys carribean beach resort VERY disappointing! Booked a family reunion trip a year in advance and asked to be side by side in rooms. Got there to find out we were all moved because pop Warner cheerleaders were there and it was \"state law\" that they all had to be together. Supervisor told me that \"not everyone is as privileged as me to be able to travel with my children\". He went on to tell me that all Disney hotels were booked the same way so there was no point in moving. VERY rude. Took over an hour to check in. My father, a diabetic, barely made it to dinner as everything took so long-\"because of the cheerleaders\" the busdrivers, van drivers, staff and anyone else kept telling us. Very unprofessional. Room smelled awful. My mother had a cockroach in her bathroom. The only good things were the pool and the food. I would NOT recommend this resort to anyone and will not be returning. My travel agent wrote letters and called to discuss problems above only to get NO REDPONSES.", "user": "ramie724", "date": "December 8, 2013", "id": 187081807}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "After much deliberation about where to stay we choose the WDW Caribbean Beach resort. We stayed in November 2010. I've only just started using Trip Advisor. We have also stayed at the Port Orleans Resort in April 2012. Our favourite out of the two resorts was definitely this one.", "title": "Moved from the Polynesian in December", "user": "Liza V", "date": "December 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 187052843}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "This was our 5th trip to Disney and our 3rd stay at Caribbean Beach. This is not a luxury hotel but the rooms are clean, comfortable and convenient. We were there for the parks and not for a luxury resort vacation so the hotel served our needs well. We had one of the recently renovated Nemo rooms and were put in Martinique building 25 so we were very close to the food court at Old Port Royale and relatively close to a bus stop. (Some rooms can be quite a distance from the food court but most everything is relatively close to a bus stop). We were able to see the fireworks at Epcot from our room. The rooms are a little on the small side and I wish there was a way to have a different configuration (other than just 2 double beds). The rooms are very clean and the staff was helpful. Some family arrived a day before us and we were still accommodated with adjoining rooms. One of our kids got sick and we were given information on a pharmacy that delivers and the medication was charged to our room so we didn't have to wait around for the delivery. The buses can have hiccups but overall it is certainly better than parking (folks just need to remember to plan ahead and make time to catch the bus). Magical Express ran well (as it usually does). We will stay here again.", "title": "Good value and choice for Disney", "helpfulness": 2, "user": "vlfair", "date": "December 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22901881, "likes": {"liked": "— Convenient", "disliked": "— Rooms are a little small"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The exterior of the Caribbean Beach Resort was pleasant and appealing. However, step inside and it is another story. Ragged, worn, and smelling badly of mildew - we only tolerated our 3 nights there (part of a land/sea package). I would NOT recommend this \"Resort\" to anyone. The bus service is slow, crowded, and full of children prone to throwing up. Also, if you are travelling with someone in a wheelchair, be prepared for fellow guests to complain under their breath about the time it takes to accommodate those with disabilities. It is a hassle, wish Disney had a bus for wheelchairs only. Everyone would feel better about the experience.", "title": "Don't be fooled by the exterior!", "helpfulness": 1, "user": "GAgalinTXnow", "date": "December 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 1.0}, "id": 22896300, "likes": {"liked": "— exterior facade and landscaping", "disliked": "— interior of room and furnishings"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "If this is your only choice - stay OUTSIDE the park and use an independent shuttle. It will be well worth it.", "title": "Very pleased with Caribbean Beach Resort", "helpfulness": 2, "user": "Daisy55", "date": "December 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22872216, "likes": {"liked": "— The decor and surroundings.", "disliked": "— Housekeeping response time."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My family (4 adults and a 2 1/2 year old) stayed the first week of December and could not have been happier. We had two adjoining rooms as requested with a great view in Jamaica. The rooms appeared to have been recently refurbished and very clean. Loved the tropical feel. Bus stop was just a short walk though we had a vehicle and only used the bus system once. The laundry facilities were also close by but costly. The entire family had a terrific time at the pool/water park. It was a great place to unwnd after the excitement at the parks. Our only complaint was the time it took to get items missing from our room. Don't expect fast service as each request took two or three phone calls with the latter taking several hours to get. We did not view it as a problem that could put a damper on our trip because everything else was so perfect. Would we go back to Caribbean Beach Resort? Absolutely!", "title": "Skip This Resort Completely!", "helpfulness": 1, "user": "babesbarn", "date": "December 20, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 22871143, "likes": {"liked": "— The Views from the hotel", "disliked": "— The filth of the first room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "First of all, this was our first trip to Walt Disney World. We are almost 60 years old and we arranged this trip through the WDW Travel Company. Just remember that all the bells and whistles that are handed you on the telephone via a customer service person means nothing when it comes to actually getting to your stay. I guess the agency assumes what they put down on the notations will hold some weight. Heck it was our honeymoon AND first time at Disney ever! We waited our whole lives to see Disney and did it together.", "title": "IT WAS AWESOME", "helpfulness": 2, "user": "pagarcia", "date": "December 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22810495, "likes": {"liked": "— everything was kept clean and great customer service.", "disliked": "— small bath rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Disney's Caribbean Beach Resort was a nice place for our honeymoon. I know a lot of people complain that it is a large resort, which it is, but my husband and I loved the lush landscaping and quiet little walkways everywhere. We had a king size room in the Jamaica buildings. It was nice, only a 5 minute walk to the foodcourt and a 2 minute walk to the buses. The buses come along pretty frequently. I think the longest we waited was about 15 minutes to catch a bus to downtown disney. The room itself was okay - a little tired. But I think they were in the process of renovating since we saw new mattresses, new carpet and fresh paint going into some of the other rooms in Jamaica when we were on our way to breakfast one morning. The resort also had a beautiful main pool, and two other smaller pools. While it was too cold for us to swim, I can see a family having a great time at one of these. The foodcourt was nice as well, there are lots of choices and even a sit down restaurant in there as well. This would be a great hotel for a family or a couple going on their honeymoon.", "title": "Nice place to stay!", "helpfulness": 2, "user": "neslxcivic", "date": "December 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 22728230, "likes": {"liked": "— The theme of the resort, and the cleanliness.", "disliked": "— Room was a little tired, needed updating."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "I just got back from a week at the Caribeann Beach Resort. I rented two rooms to accomodate my daughter, son in law, and two grandchildren ages 6 and 8. I found the first room unaccpetable in Trinidad North. It had white things floating in the air. Smelled musty! I was moved to a", "title": "Hotel needs some updates!", "helpfulness": 2, "user": "stargazer20", "date": "December 13, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 22709743}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "much more acceptable rooms in the Marinque section. These rooms had been remodeld. YOu want remodeled rooms . The handle was missing from my shower and the lock was broken in my daughter's room even so.These were repaired after a call, however. The rooms were clean and serviceable. The resort is spread out. Try to get a room near the main building.....Martinque is best- cost more but worth it I felt.", "title": "Caribbean Beach just OK, Magical Express a Disaster", "helpfulness": 1, "user": "BeachBum22271", "date": "December 13, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 4.0, "rooms": 2.0, "location": 3.0}, "id": 22697334, "likes": {"liked": "— Refillable mugs and pool", "disliked": "— size of resort and luggage service"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The food in the quick snack area is not great! Like a food court. Nice pool for kids especially! The is a real \"family\" resort with bus services that were actually quite good for us! A bit of a wait at times but then there is always a wait at Disney- get used to it and keep smiling! Magical Express to and from the airport was very efficient. Use that service,", "title": "Sadly Disappointed", "helpfulness": 1, "user": "Scottsdale4111", "date": "December 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 22681645, "likes": {"liked": "— Not one thing - even their food was terrible", "disliked": "— The rude and inconsiderate manner in which the front desk handled our issues"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The staff at the concierge desk in in the Food Court area need to be more Disney LIke. The other staff you meet as you check in were very accomodating but the process did take a while. YOU need patience!", "title": "Big Hotel but Lots of Character!", "helpfulness": 2, "user": "gordon fan", "date": "December 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 22595569, "likes": {"liked": "— The Pool!", "disliked": "— Walk to Old Port Royale after a long day at the Parks!"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008", "text": "We usually go to Disney World every year as one of our vacations, and to be able to afford it, we usually stay at the value resorts to save money. Besides, you really don't spend much time in your room anyway. This last trip in Feb. 08, we decided to try CBR. When we arrived the resort looked quite nice. The theme for the resort was a little more upscale compared to the All-Stars we usually stay at. But as the saying goes, \"beauty is only skin deep\" Once we got into the room, that is when the disapointment set in.", "title": "Nice but worn out", "user": "shmtnmusic", "date": "December 6, 2008", "detail_rating": {"value": 3.0}, "id": 22507313}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The room was about the same size as the All-Stars but very tired. The carpet was dirty and worn out. It may have been vacuumed but the wear on it was way over it's life span. The furniture and bed was beat. The paint was worn off in spots. Overall it was just what you'd expect to find at a cheap motel. The outside was nicely painted though.", "title": "Wonderful Staff", "user": "KimToledoOhio", "date": "December 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 22455398, "likes": {"liked": "— The Staff", "disliked": "— The erratic bus schedule."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I guess that since the value resorts are considerably newer than CBR they don't have as many wear spots on them yet.", "title": "Fantastic stay!", "user": "marisuz28", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 22418910, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We will be back again to DW in Jan. 09 and will be staying at P.O. Riverside. I hope it's not as tired as CBR.", "title": "Not the Visit of a Million Dreams", "helpfulness": 2, "user": "Mickey300", "date": "November 30, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 22329225, "likes": {"liked": "— zero driving - extended park hours", "disliked": "— 40% of staff attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "My husband and I were vacationing with my mother, and my brother and his family. There were a total of 5 adults and 2 children. We all shared 2 adjoining rooms. The space was adequate. The rooms were well kept and the hotel offered plenty of amenities for families with small children. We stayed there the week work was completed on the new pool and the kids absolutely loved the new pirate themed water play area. Our rooms were in Martinique. They were close to both a bus stop and less than a 5 minute walk from Old Port Royal.", "title": "Best Family Trip Ever!", "helpfulness": 1, "user": "niecer99", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22318766, "likes": {"liked": "— the relaxing atmosphere", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Our family of 4 (two adults, two children age 6 & 16) stayed at this resort in early August. I had read several reviews prior to booking, taking in both the good and the bad. I have to say that overall, we were not disappointed in this resort. Our room was clean and ready upon arrival at 11 am. We had taken the Disney Express from the airport, waiting about 15 min for our bus to arrive. Driver was very nice, made one stop at another nearby resort before stopping at the Caribbean.", "title": "Wonderful Stay Very nice resort", "helpfulness": 13, "user": "fanofbuckeyes", "date": "September 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5813495, "likes": {"liked": "— Convenience", "disliked": "— walking distance to and from food court/bus stops"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The reviews I had read warned of a lot of walking, which we found to be very true. But it was nice sometimes to enjoy the walk to and from the food court.", "title": "Loved it all", "helpfulness": 7, "user": "Rob5582", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5812842}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed in Jamaica #41, so there was a bit of a walk to and from the bus stop. I would say this was the only draw back on the hotel end of the resort.", "title": "14 days of hell", "helpfulness": 8, "user": "dove13", "date": "September 16, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5806037, "likes": {"liked": "— pool", "disliked": "— staff"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Buses ran continuously for each park or the internal shuttle. Arriving about every 15 minutes on average.", "title": "Not a Great Hotel", "helpfulness": 6, "user": "kkjbb", "date": "September 13, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 5799404, "likes": {"liked": "— Comfortable Beds", "disliked": "— Too spread out."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Food court was pricey, but again, we expected that. Food was good though. Wish that there was orange juice available for breakfast for use with the refillable cups...after all this is Florida! OJ should be plentiful. For the Pepsi drinkers...you will go through withdraws...its all Coke, at the resorts and parks.", "title": "Very Nice!", "helpfulness": 4, "user": "faithlyn", "date": "September 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5789381, "likes": {"liked": "— Caribbean Theme, colorful buildings, awesome tropical pathways", "disliked": "— Food court could be bigger"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Oct 19-Oct 26, 2006.", "title": "Honest Review", "helpfulness": 11, "user": "jazz1450", "date": "October 26, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 6014172}, {"rating": 5.0, "stay_parameters": "Stayed October 2004, traveled as a couple", "text": "We read most reviews of the CBR before we stayed here and can see both sideds of the coin. You will need to walk a lot, which was fine by us. The daily two or so crossings of the bridge was a nice touch. If you don't enjoy walking, you probably won't enjoy staying here. We enjoy the wide open spaces and the feel it brings. Our room was in our opinion clean, however, if one is the type to expect a spotless 5 star luxury brand new room this is not the place to stay. The carpets need a deep steam cleaning. You will notice deep stains in carpets (but only if you are looking for it), chipped paint in some places, beds that make some noise etc. If the price was 20-25% lower, I would probably give this resort 4 out of 5. Housekeeping could use some work. That department only gets 2 out of 5. Bed sheets were not changed as one would expect for the price. You can tell that the minimum amount of work is done to make room look \"fresh\". Even when we left a tip every day. The rooms are quiet, and well laid out. The pools were good but would be even better if there were a couple of hot tubs.", "title": "The BEST trip EVER", "helpfulness": 14, "user": "emstrainer527", "date": "October 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6011205, "likes": {"liked": "— The hotel property itself - beautiful location", "disliked": "— I can't think of anything, really!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The buses ran irregular, ie 2-3 MGM in a row and 20-25 min for the bus you wanted. I would stay again if I got a deal, the property alone gets 4.5 out of 5. This is a great resort if you like beaches, walking, and that caribbean feel. It always felt nice to come back here after a long day at the parks.", "title": "Can't Miss", "helpfulness": 13, "user": "knsthompson", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6008057, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "This is the best trip EVER. I am now afraid to stay anywhere else on Disney for fear that it won't be as great! The pools are clean and well located. The gift shop is in the food court area. We ate at the food court and the hotel's restaurant and we like the food court best. Mickey Waffles with bacon... my favorite. The soda and coffee is free with the mug that you buy for 10.95, which is well worth the money. Banana daquri at the hotel bar, cost what you would expect (6.50 each) but they are delicious. You can see the epcot fireworks from the hotel bar! This is by far the greatest hotel ever! Busses ran right on time, never really a wait. The bus stops are fairly close to each hotel section. Rooms, standard room, single sink which is seperate from the toilet/shower/tub area. they had just cleaned the carpets so they were slightly wet but not really a problem. Rooms were cleaned and they do leave you a towel origami gift (we have no kids and still loved it). Overall a wonderful experience.", "title": "Good Hotel", "helpfulness": 9, "user": "nzsunlover", "date": "October 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5959263, "likes": {"liked": "— The ease of getting to the Disney parks", "disliked": "— The distance to check-in"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "We stayed at the Caribbean Beach Resort (CBR) the week of September 16th thru the 23rd. Like many other reviewers, we had read reviews prior to our trip and had some reservations. We are well traveled and I can honestly say this may have been our best vacation yet.", "title": "nice resort even though its a bit on the large side", "helpfulness": 23, "user": "LisaTina", "date": "October 13, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5948751, "likes": {"liked": "— peace and quiet", "disliked": "— plan ahead"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My daughter and I went to Caribbean Beach Resort for 6 days the end of August into early September, 2006. Rooms were pleasant, clean, not luxurious, but comfortable enough. There was a small fridge in the room, which was nice. Bring bottled drinks if you can. We stayed in Barbados, it was somewhat of a walk from the main pool and dining, but the walk was pleasant. Individual pools were okay, somewhat small. Main pool was nice, but a little crowded and loud. Food was okay, there was a lot of fattening food, but there were healthy choices if you wanted. We got the food plan, and were a little confused at first because they don't spell out how it works. Talk to your travel agent or a Disney staff member ahead of time to make sure you get the most for your money. I ended up having a lot of meals unused, because no one properly explained how it worked. Everyone that worked there was pleasant - \"Have a magical day!\" We ended up renting a car, because the buses did get crowded and it is hot and humid waiting for them. The car was reasonably priced and it just gave us a lot more flexibility. Magic Kingdom was great at night for fireworks, Tinkerbell flying through the air is a can't miss. We loved Downtown Disney and Epcot. My daughter loved the pin trading, also. All in all, a pretty good trip.", "title": "Overall good experience", "helpfulness": 6, "user": "Ellen E", "date": "October 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 5931709, "likes": {"liked": "— Location", "disliked": "— Bring plenty to drink"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We recently stayed at the Carribean Beach resort for a return visit. As usual, we enjoyed our stay. The room was on the smaller side, but certainly adequate for two adults and two small children. Anyway, we were not in the room that much. A drawback was that we did not get a Preferred room location. This meant that we were a longer distance to the bus stop and to the Food Court, drinks, gift shop and main pool at Old Port Royal. Since we were in Barbados, it was really only one building farther away than the fartheset building in the Preferred section. Since we were there only for a few days, we decided not to spend the extra money. However, it did make it a little more difficult to get around with twin two year olds. The pool for our complex of buildings was very enjoyable. The setting on the lake was lovely. When we returned to our room, there was always a new animal made out of the washcloths waiting for the children.", "title": "Another great visit to the Carribean Beach.", "helpfulness": 14, "user": "QueenMimi", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 5929850, "likes": {"liked": "— The whole Disney experience", "disliked": "— Taking the buses"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Our transportation was good with two exceptions. One time, we waited a very long time for a bus to Epcot. Others around us had waited even longer. The other problem that we had was that the bus would vary its route coming back from the parks. Sometimes, we would be the last destination to be let off the buses. When you have sleepy kids, that ride around that big complex can get awfully long. We learned to listen for the announcement of the first bus stop. If we heard that our stop was not going to be the first stop (Barbados), we knew that we would be the last. So, we got off at the first stop (Martinique) and carried the kids back to the room. Other than that, we felt the transportation was fairly efficient and painless. The food court was adequate in size, but the food was generally pretty good. We have stayed at many of the Disney Resorts. For this price category, this is one of our favorites. I wish that I was going back tomorrow!", "title": "Much Better Than The Reviews", "helpfulness": 14, "user": "THEBOCKS", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5928919, "likes": {"liked": "— GREAT CARIBBEAN FEEL", "disliked": "— NOTHING"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My family and I arrived 9/29 with our lysol and clorox wipes in hand due to the reviews that I had read. We did not need either of them as our room was very clean and maintained well by our mousemaid during our 9 day stay. While the food court and main pool were a short walk from our room in Jamaica, the walk was very relaxing with nice landscaping and caribbean music. The bus service for CBR is great! CBR is one of the few hotels that have their own dedicated buses. We would definitely stay here again!", "title": "Loved it!", "helpfulness": 13, "user": "BermudaObsessed", "date": "October 5, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 5920711, "likes": {"liked": "— two sinks in bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Ok.. I was also nervous after reading the bad reviews, but this hotel was great! It is was it is, a 3 star...The property is beautiful! We stayed in Aruba, and our room was very clean and nice..We loved the double sinks....It was perfect for us considering we were not really there for the room or resort, but for the parks...The bus system was very good..We never waited more then 10 minutres for a bus, and they were never to crowded...I admit, if you have extra money the Grand Floridian and the Boardwalk Inn are amazing...But, we thought it was worth it to spend more of our money on nice dinners ...Victoria and Alberts was fabulous..We also loved the Flying Fish Cafe, Fultons, and the Polynesian dinner show...", "title": "Great Hotel", "helpfulness": 19, "user": "Ninajc", "date": "October 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5908348, "likes": {"liked": "— The conveience of being in the Disney Resort", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "My husband and I went away for a week to getaway from it all. The quiet pools are just that - quiet. The pool with slides and kids was also not crowded, just a little noisier.", "title": "Lover's Paradise", "helpfulness": 8, "user": "Leanpig", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5905977, "likes": {"liked": "— Ambience of outside theming", "disliked": "— Spread out"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "This moderate resort based on Disney levels (Hampton Inn Style is what I would rate it) was moderately themed, moderately priced and had a quaint ambience. Pay for a preferred room ($10 per day) to get a location close to the food court, sit down restaurant and gift shop.", "title": "Great resort", "helpfulness": 12, "user": "meandmadison", "date": "September 27, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5881393, "likes": {"liked": "— large rooms", "disliked": "— only full size beds"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We did not rent a car, but depended upon Disney transport all week. The only time we had any trouble was the night of Mickey's Not So Scary Halloween Party and we waiting about 35 minutes for a bus. Other than that it was magical.", "title": "Great Place to Stay", "helpfulness": 14, "user": "nikki7680", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5835045, "likes": {"liked": "— the theme of the resort", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We slept late almost every day and hit the parks at night utilizing EMH.", "title": "LOVED IT !!!", "helpfulness": 22, "user": "taitey", "date": "September 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5829597, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We just got back 9/25/06 from a 9 day stay at this disney resort. I loved everything about the hotel except the distant to the food court, main pool, gift shop, etc.. The rooms were very clean, well decorated, spacious. The only other complaint I have is the size of the beds. There were two full size beds. Me and my husband have a king bed in our home and found it a little difficult when our daughter decided to climb in this full bed and we all too tired to hope into her bed. Next time we will get a king bed for sure!", "title": "Loved it!! Would definitely go again.", "helpfulness": 20, "user": "Miffypoo", "date": "September 19, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5816624}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 310, "average": 682, "very good": 1219, "terrible": 168, "excellent": 984}, "aka": "Disneys Caribbean Beach Hotel", "slim_ranking": 0.550151975684, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Disney's Caribbean Beach Resort is a tropical lakeside paradise set on beautiful 45-acre Barefoot Bay. Sail away to the inviting Caribbean, where lazy days are devoted to sun and sand, swaying palm trees and island foods."}