{"user_rating": 4.0, "review_count": 1334, "name": "Divi Aruba All Inclusive", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "We are 4 women 2 of whom had visited Aruba at least 5 times before. Since my friend & I had never been to Aruba it was up to the other 2 to review. They had stayed at the \"high rise area\" in the past and found the beach @ the Divi \"far superior\". They were pleasantly surprised that the casino was so close by. Our rooms were oceanview (12 ft to the beach) and adequate. The air conditioning was not that great & ran constantly along with the ceiling fan...we were comfortable but it seems it could be more energy consious! The staff @ the Divi was awesome especially Filo (meeter & greeter). We felt very safe and well cared for. Millie (concierge) had an attitude problem. She acted like making a reservation was an intrusion. She improved with time however. The food @ Divi is OK. Breakfast was very good w/ vegetable omelettes, eggs benedict fruit etc. Lunch buffet was adequate w/ buffet & maybe a pizza and buffet dinner OK. Red Parrot was pretty good on 2 occassions w/ great waiters. Paparrazzi Restaurant @ Tamarjin is terrible...they need a real Italian chef. But I didn't go to Aruba to eat! My friend & I love to explore. We rented a Jeep for a day & loved the landscape of the Nat'l Park. Go to Flying Fishbones Restaurant in Savaneta if you get a chance. All in all a good experience. We met a lot of people who had been to the Divi on multiple occasions. I liked the fact that it was not crowded like the \"high rise \" area.", "title": "Beach Bum vacation", "helpfulness": 11, "user": "SusanKieley", "date": "February 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6732919, "likes": {"liked": "— Beach", "disliked": "— Food"}}, {"rating": 5.0, "title": "Absolutely loved the Divi!", "text": "Hello - just returned from a 6 night stay at the Divi Aruba - I have nothing but great things to say about the trip. My second time in Aruba (last year went and stayed at the Tamarijn - this yr Divi (Divi is nicer with a better beach) but enjoyed both immensely.", "helpfulness": 17, "user": "rebadog", "date": "January 28, 2007", "id": 6710907}, {"rating": 4.0, "title": "Great!", "text": "Went with my husband and two kids ages 22 and 24. We were welcomed immediately by Filo (who continued to befriend and help us throughout the trip - genuine good guy). Thought it was beautifully landscaped with a relaxed, casual feel to the resort. Stayed in Vista II, adjoining rooms 509 and 511 (perfect panoramic ocean views!) - very clean and comfortable - second floor, with a balcony - much more private than first floor. Amazing white, sandy beach - not crowded at all - yes, you do have to reserve huts, oh well! They do open up at different points throughout the day, though. Dinner reservations easily made though the tour people at the front desk or you could call the extension at the restaurants yourself - just make them the day before! Even specific booth request was honored. Red Parrot and Papparazzi - excellent food, great service. Beach bars - wonderful service - great drinks - favorite bartender was Irino (older gentleman - always ready with refills for my family) Buffets were perfectly fine - stay away from the end tables near beach if birds are a problem. We tipped bartenders and waiters at our dinner meals and of course Filo who was there for us with advice, assistance and always a smile. I know it is not a requirement, but we felt it was appreciated and warranted!", "helpfulness": 10, "user": "LT56", "date": "January 14, 2007", "id": 6594927}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Did the helicopter tour (island tour - 30 min.) - highly recommend it! Did De Palm Snuba - wonderful fun, safe experience. Wave runners also were crazy! Went to Madame Janette's - outdoor, casual atmosphere - great music and wonderful food.", "title": "The Divi was divine!", "helpfulness": 12, "user": "Jowa22", "date": "January 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6575376}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "It was our 25th anniversary and I can not think of a better place to have celebrated it than the Divi - we will definetely return! Can't say enough good things about it - no down side at all!!!", "title": "Divi All Inclusive - a Mixed Bag", "helpfulness": 12, "user": "buddy_rotty", "date": "January 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 6572923, "likes": {"liked": "— Access to the beautiful beach", "disliked": "— The Room"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We were very disappointed with the rooms, it had two big beds but not much room to move around them. Cleaned every day but the bathroom was a horror. mold and mildew all around the bath area. Not very good considering how much the holiday cost.", "title": "Very relaxing", "helpfulness": 6, "user": "S.S.S.M.L.A", "date": "November 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 120275344}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Full use of the Tamarjin, we thought the restaurants were better at the Tam, loved the Grill - unusual concept for dining, cook your own on a hot table and loved the Asian restaurant We got a bit fed up with the buffett at breakfast and lunch, everything you want to eat but we found the birds a real problem, they have netted the eating area but the birds still find their way in. Also my other big moan was the bar - staff were ok - not as friendly as they should be but whenever we were poured a drink ALL of the staff insisted on picking up the straws with their fingers and holding them where you drink out off. A good bar person always pick up the straw in the middle - picky I know but when you see dirty dish clothes being used then the same hands pick up a straw YUK!", "title": "had a great time from MA", "helpfulness": 3, "user": "Mark G", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120209586}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The best bit about this holiday was the beach, we walked to the \"High Rise\" on a number of occasions. The walk along the beach generally took about 1 1/2 hours. Very beautiful walk the water was glorious clear and warm.", "title": "Honeymoon", "helpfulness": 1, "user": "Landra310s", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 119949661}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Myself and my wife stayed at the Divi in September with our two adult sons. From check in the staff made us feel welcome. We had two ocean front rooms which were well worth the extra few bucks. The rooms were clean and ready when we checked in. The beach was uncroweded and weather was perfect. We found the the food to be very good, just make sure to make your reservation early. The pizzas at the bar were a great in between snack. The bartenders were attentive and a tip goes a long way. We were lucky enough to meet Juan Trump a bartender at the pool. He took the time to talk with us, telling storys about all of the the things he had been through over the years even bring us in a photo alblum. Little things like that really made us feel welcome and made our trip that much better. We will go back again. Get out and see the island its a wonderful place.", "title": "Perfect honeymooon", "helpfulness": 1, "user": "SGB300911", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119935741}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We spent 9 days here at Divi. There are 4 restuarants you can pick from for a sit down dinner. The Palm Grill was our first dinner at Divi (located in Tamarijn) The staff was wonderful, they checked on you often, however the food was horrible. Plain, tasteless. I ordered a honey terriyaki chicken, the chicken came out plain, not marinated at all, i used as much soy sauce (on the table) as i could, but nothing could help that plain chicken. Also since you are cooking it yourself, we found the lighting the in restaurant to be too dark. It was hard to see if the chicken and fish was cooked enough before we ate it. The 2nd restaurant we ate at was Ginger (at the Tamarijn). It has asian style food. This place was full of problems. First off we had a 6:30 dinner sitting time. We were there 10min early, were seated right away, drink order was taken right away. All seemed well. Then once our food order was given no one came back for 45 minutes. I finally flagged someone down and asked where our food was because people coming for the 7pm sitting were already eating. They lost our order. When the food finally came out 60min later, I ordered the mango chicken. the chicken was tiny bits of boiled chicken placed around some noodles inthe center of the plate. Then it had a mago sauce drizzled over the top. I'd say this place had even worse food than the Palm Grill. No one ever came and checked on us, no one ever got us another drink. It truly was horrible. Paparazzi (at Tamarijn) was delicious. The wait staff always checked on you, refilled your drinks, and was awesome. The food was awesome too. By far the best at Divi. The Red Parot (at Divi) was also very good. We ate here twice during our stay. The staff at this restuarant always checked in on you, refilled your drinks, and all in all were very great. The food was very good here too. The mashed sweetpotatoes were amazing. We never had Buffet for dinner, we escaped 3 times for dinner off the resort. We went to El Gaucho's, and Pincho's. Both were amazing! El Gaucho's had better food and more choices, Pincho's had an amazing few of the sunset. We got some great photos there!", "title": "Visit", "user": "Jude70NorthWales", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119888375}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The Divi divi in Aruba is the most beautiful place on the earth!! LOVE this place!!!! My Hubbs and I are going back in May 2013 to celebrate our 7th anniversary! We got married on the beach at the Divi divi. There is no better way to celebrate our love than going back to where we were married.", "title": "Best place on earth!", "helpfulness": 1, "user": "Hailey A", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 144983026}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The number one best thing at the Divi Tamarijn is that you are steps from the beach once you open your patio doors!", "title": "Great Time at Divi Tamarijn!", "helpfulness": 2, "user": "Brian W", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144950251}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Great sun, great beach, great staff and guests! Our 20 mo. daughter made many friends from far-away places! And none of the kids were annoying.", "title": "Divi Aruba", "helpfulness": 5, "user": "June D", "date": "November 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 144927422}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Restaurants had great food and once you figured out the buffet, you could find good eats. The pool was small (compared too huge) but very enjoyable and not crowded. AC in room worked perfectly and our daughter really enjoyed her Divi-provided crib. Only downside on the room was the shower was open style and water got everywhere-although I was not sure our room was for Wheelchair-accessible or not). That being said, Housekeeping cleaned and provided enough towels to manage the situation.", "title": "Great for rest and relaxation", "helpfulness": 3, "user": "Milliemax64", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144921435}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Drinks were very good and wisely got stronger as the day / night went on. Special orders did not upset drink staff. Good Entertainment / Djs too.(not shows)", "title": "Honeymoon Let Down", "helpfulness": 2, "user": "Cplamo", "date": "November 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 144644445}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I just returned from the Divi all-inclusive resort, where we stayed for 8 nights on our honeymoon (10/16-10/24). I did a ton of research before we booked the Divi through our travel agent and read every (yes, and I mean every) review on this site about the Divi. With this research, I felt that I had plenty of background information to ensure I had realistic expectations. As a means to help others, I will be as specific as possible about every aspect of the resort. I hope this is helpful.", "title": "A great honeymoon spot!", "helpfulness": 36, "user": "gerbies", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 2.0}, "id": 6014818, "likes": {"liked": "— The beautiful beach!", "disliked": "— The outdated room...though this should be done in 2007!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Rooms: We were booked into one of the Lanai rooms. These are oceanview and beachfront (if you are on the first floor you are steps away from the beach; you just open your sliding glass door and there you are). We were on the second floor and had a direct view of the ocean and beach. Overall, the room was disappointing. From what I understand, these are the last rooms to be renovated (the building next to ours...the single story Casitas were being renovated while we were there). So, with that said, the rooms looked old and a bit used. Once I was there for a day or two, however, I got over the plainness of the room, looked at the view from our balcony every day and night and was satisfied. I have heard these rooms will be renovated early 2007. Each room had the basics to meet our needs...an air conditioner which was not loud, a ceiling fan, a t.v., and all working bathroom. The other sections of the resort (the Casitas, the Villas, and the Vista buildings) are all close to the beach, with the Villas (which are the nicest rooms) being the furthest away. Even these rooms, however, are only a 2-minute walk to the beach (you walk out of the building, across a sidewalk, walk by 3-5 single story bungalows, and there you go!). I look forward to staying in the Vista buildings next time, or perhaps the updated Lanai rooms again...you just can't beat the location or the view!", "title": "Divi Aruba was Fantastic", "helpfulness": 18, "user": "SOX-PATS-FAN", "date": "October 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5908810, "likes": {"liked": "— The Beach, the Deck", "disliked": "— Liked everything"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Food: The Divi offers three places to eat and the Tamarijn (which is a 5-minute walk, or 2-minute golf cart ride away) offers three restaurants as well. Here's the breakdown: The Red Parrot at the Divi was our absolute favorite. We ate here probably 6 times an enjoyed it each time (you must have the Churasco a Moda!). This is the nicest restaurant between the two resorts and offers a nice sized menu. Paparazzi at The Tamarijn (which is the italian place) was very disappointing and reminded me of how I try and cook italian food (jar of sauce over pasta). The environment was nice, but the food was subpar. The Palm Grill was also a bit of a disappointment. This place allows you to cook your own food at your table; literally, the stove top is in the center of your table and you cook it with your tablemates. If you are a party of two, they sit you with another couple and then the four of you make your collective dinner. I found this experience a bit creepy and sitting that close to a hot surface somewhat uncomfortable. The buffets at both resorts were good...the breakfast buffet is great! Anything you can imagine as a breakfast food is available...pancakes, french toast, waffles, fruit, juices, eggs, made-to-order omeletters, cereal...everything! We were there for 8 breakfasts and I could have had something each day and not eaten the same thing twice! The lunch and dinner buffets were o.k., but better than your average buffet restaurant (like HomeTown buffet). The Pelican Bar at the Divi makes thick and thin personal pizzas as well as panini sandwiches, which my husband and I enjoyed on several occassions. Overall, I enjoyed the food and really liked the fact that between the Divi and the Tamarijn there were always a ton of choices...and you did not have to carry a wallet around with you. There's something to be said for ordering whatever you want, as much as you want (think appetizers with dinner and dessert), and not worrying about how much the bill will be. And for those who complained about making reservations for dinner, it was an easy process. You could always make a reservation a day ahead, and we did so each morning after breakfast. It became our routine and took very little time. We never had a problem, because we were making them for the following day. The buffets and bar grills did not need reservations.", "title": "Great for honeymooners! Private and Beautiful!!!", "helpfulness": 21, "user": "donnac07", "date": "October 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5906585, "likes": {"liked": "— The beach", "disliked": "— Noisy air conditioner"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Amenities: The resort offer various activities, such as pool volleyball, bingo, snorkeling lessons, etc. All were basic and not elaborate, but fun all the same. Some of the larger amenities are at the Tamarijn and not at the Divi, like the gym, the rock climbing wall, the tennis court (the Divi's courts were down) and the free bike rental. Again, the Tamarijn was only a 2-minute golf cart ride away (the resort takes you back and forth whenever you want). Mostly, my husband and I layed by the pool and layed on the beach. A lot of folks save chairs and tiki huts on the beach each morning. Overall, we found tiki huts or just woke up early to place a towel and a book on a chair. I naturally wake up early and did not find this to be a problem. I recommend getting fresh clean towels from the towel hut each afternoon before it closes at 6:00 p.m. to have early in the morning; this way you can use a fresh towel to save a chair if it's a busy resort day. The resort gives you a towel card to use to \"check out\" towels. You are able to trade in wet or dirty towels all day long. The resorts have very basic nightlife (think d.j. playing music outside, two person acoustic band, karoake night, and dancers), but honestly, after a day in the sun each day, my husband and I were ready for bed by 9:00.", "title": "Great place to honeymoon!!!", "helpfulness": 16, "user": "MrsJones090206", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5835891, "likes": {"liked": "— location", "disliked": "— bar staff - some were rude but others made up for the bad ones"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Outside of the resort: The Alhambra Casino is across the street from the resort (to the side) and has a few shops (nothing too elaborate). They do have a hut which offers internet and phones to contact your loved ones and was fairly reasonable (internet was $1 for 10 minutes). The casino is good-sized for a resort, though nothing close to the size of an Atlantic City or Las Vegas casino. Either way, we had fun gambling. We went to a time share presentation for the Divi Phoenix vacation resort plan (someone will ask you as soon as you get to the resort). Personally, I did not think it was worth it. You got a t-shirt, a tote bag, and a choice of another item. We selected a $100 voucher to use at the casino. The total time for the presentation was almost 2 hours and was more irritating than the \"prizes\" were worth. We went downtown two times and shopped throughout the downtown area. I especially liked the Royal Plaza Mall that had a store, which sold beautiful Dutch linens. Otherwise, I was somewhat unimpressed with the shopping. You do not get great prices on items compared to the U.S. There were many things I would just buy at home, like perfume and clothes. If you saved any money is was maybe a couple of bucks and then you saved on tax. Unless you wanted to buy that bottle of perfume before you came, for example, you weren't saving much by splurging while you were there. The jewelry is moderately priced, but you have to know what you are looking for. There is a lot of poor quality there. Remember that everything is negotiable, but be courteous and respectful. I saw a number of fellow Northeasterners who treated shopowners very, very poorly (like how you would negotiate with an obnoxious used car sales person...).", "title": "Wonderful trip!", "helpfulness": 25, "user": "dkk2103", "date": "September 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5813805}, {"rating": 4.0, "title": "Loved the Divi", "text": "Hello :) My boyfriend and I stayed at the Divi last May. We got a good deal on the all-inclusive rate . We booked a beachside/front room...........stay far away from these rooms. They are def near the beach but so are all the rooms.....they are all on the beach. These beachside rooms/front what ever they call them are so old and omg ewwww I flipped out and I can stand a room thats just old but these were just terrible.....the smell ......and they were just so old and rundown.....and there were two queen size beds..........I need one king....my boyfriend and I are tall.........and we need our space...... so I went to the front desk after I had a drink at the bar.....lol.... (these were so bad i was really shocked when I walked into the room)", "helpfulness": 21, "user": "Beth-NY", "date": "February 25, 2007", "id": 6837467}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "They change my room only further away from where we first were.......next to the garbage........but still the same type of room two beds ..........to make a long story short...........I had alot of drinks that night and my boyfriend and I slept in sep. beds.", "title": "It was awesome!!!!!!", "helpfulness": 12, "user": "jewel6619", "date": "February 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6809680, "likes": {"liked": "— the overall place was awesome", "disliked": "— no swim up bar at the pool...."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Next day they were very nice and moved us to buidling one I think they call them vista one and vista two......they might be the ocean view rooms. Totally different........way bigger ....updated and soooo much nicer.....big bathroom sitting area.......huge", "title": "Just OK", "helpfulness": 5, "user": "zacharoo", "date": "February 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6808165, "likes": {"liked": "— Beach", "disliked": "— Food"}}, {"rating": 4.0, "title": "Great place to visit", "text": "balcony... now I was happy.", "helpfulness": 7, "user": "suzyqdadu", "date": "February 17, 2007", "id": 6805310}, {"rating": 4.0, "title": "The Divi is all about the beahc and the people!", "text": "Other than that we had a great time.. food was pretty good....they had all top shelf liq at the bars.....beer miller lite on tap .....my bf was happy. Stoli vodka..... everything...... If you have a chance def book that party bus.....its called Ku Kunoko something like that.......so so so much fun. Ask for Mamas bus. Takes you to 4 bars..........to a private home for dinner.......ohhh you start at the end of the island for a champaine sunset ....you drink til it s gone and they your off........its crazy.... BOOK IT ...right thru the hotel........", "helpfulness": 15, "user": "Pokey-7", "date": "February 8, 2007", "id": 6765817}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We booked this resort due to a destination wedding we were invited to attend. It was more than we expected.....we didn't even leave the resort, everything was amazing, why leave. Although I have been to Aruba before, however not for at least 20 years prior, and there is so much to see outside any resort, we just wanted to hang out and relax....", "title": "Sensational Resort", "helpfulness": 3, "user": "Pippi31", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144079742}, {"rating": 5.0, "title": "Divi \"Divinitely\" worth the experience", "text": "The water has to be the most beautiful I have ever encountered....you just don't want to come out, matter of fact one day we were in the water all day....couldn't understand why people were at the pool, when they were missing this beautiful water! But, to each their own.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 29, 2012", "id": 143990351}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The restaurants on site were great....The Red Parrot was so delicious....the outside Sandpiper Bar was great....one of the best hamburgers and ham sandwiches I have ever eaten!", "title": "So good We'd go again!", "helpfulness": 4, "user": "ldvrob", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143825629}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We actually are already planning our next trip back......Go Divi Aruba!!! we love you !", "title": "Wonderful!", "helpfulness": 1, "user": "Laurie S", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143759584}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My first time in Aruba as an holiday, although I have visited 4 times previously on day excursions from a cruise.", "title": "Fantastic hotel and perfect holiday location", "helpfulness": 7, "user": "Wendy C", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143556586}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We spent a week at the Divi from Dec 10-18, 2006. We had a great experience, from check-in to check-out. The staff was very friendly and helpful, the food was good (but not great), the drinks were top shelf and made as strong as you like, the rooms were clean, and most of all the beach was wonderful.", "title": "Had a great time at the Divi", "helpfulness": 10, "user": "LWood6", "date": "December 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6491151}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The Divi is in the low-rise area. This means that there are fewer people on the beach, but fewer things outside the resort to walk to. So it depends on what you are looking for in a resort. If you want exciting nightlife and gourmet food, this is probably not for you. If you want to relax at a beautiful beach with good food and drink, this is the place.", "title": "A good stay at the Divi All-Inclusive", "helpfulness": 24, "user": "Shaggy39", "date": "December 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6445375, "likes": {"liked": "— It's right on the best beach I've ever seen - great atmosphere"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Here are a couple of pics, one from our balcony and one of the newly renovated pool.", "title": "Loved the Divi", "helpfulness": 8, "user": "dukemat", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6330615, "likes": {"liked": "— the intimate surroundings......short walk to the pool, ocean, food and drinks.", "disliked": "— there were more flies than usuall this trip...."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This was our first trip to Aruba, and our tenth stay at an All-Inclusive style resort in the Caribbean or Pacific. We stayed eight nights at the \"Divi Divi\" All-Inclusive (December 3rd-11th, 2006.)", "title": "Where do I begin? (very long!!!!!)", "helpfulness": 23, "user": "kd2001", "date": "November 30, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 6307562, "likes": {"liked": "— beach", "disliked": "— bathroom in desperate need of renovations, staff's attitude"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The Best Beach", "title": "Here's the Real Deal about the Divi...", "helpfulness": 42, "user": "LuLoo", "date": "October 31, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6032692, "likes": {"liked": "— The great views from our room, the drinks, the staff, the food.", "disliked": "— Grouchy guests"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "ABSOLUTLY AMAZING! The only thing I could complain about was \"Bekky\" on reception. Horrible horrible person.. extremely rude! Couldn't fault anything else. Rooms clean & comfortable & just off the beach. Best breakfast buffer EVER! They have everything! More than enough choice for other meals/snacks/drink too. Help-yourself icecream cone machines.. activitys/music/dancers/entertainers day & night, hammocks. market stalls in resort a couple of nights with some lovely jewellery & other keepsakes. pool just off the beach & still just beside bar. pool was always clean & never too crowded. plenty of sun loungers, some in shade. THE BEACH..... I cant even find the words to describe it.. thats where i spent most of my time & felt like crying when we had to leave :( It was never crowded (im glad but cant understany why), soft white sand, crystal clear water.. just amazing. I will def be back to Aruba & wouldn't even consider staying anywhere else", "title": "Top notch!", "helpfulness": 2, "user": "Irishlass84", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119872684}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Divi All Inclusive was my first experience for all inclusive vacationing. I was pleased with the resort as a whole. Check-in was a simple and quick process. The room was a simple \"garden view\" king size hotel room. Actually, the view was the side of the hotel next door and the service roads between. Didn't matter to me because the only time we spent in the room was sleeping. Most importantly the room was clean, up-to-date, and in no need of repairs. Bar service was good. Bar tenders kinda \"expect\" tips, but it isn't necessary (ie: if you run out of waterlogged dollar bills in your swimming trunk pockets). Tipping one bartender very well at the beginning of your stay doesn't work because they rotate shifts and bars regularly. (I heard that technique works in Cancun) Restaurants: Red Parrot is great food and service. I could eat there every night. Ginger at the Tamarijin was glorified Panda Express. Don't order the sushi appetizer, 4 pieces rolled (2 vegetable, 1 fake crab, and 1 whitefish). Entrees were large piles of rice and inexpensive cuts of meat with rather tasty sauces. Papparazzi Italian was great service and food. My only gripe was my entree was only warm when served and quickly became cold. Palm Grill is a \"self cook Hibachi\". Mostly the novelty of cooking your own food. But wait, I'm on vacation. I don't want to cook. If you have your kids with you they will love it, just don't let them touch the cooking surface. The buffets were pretty standard resort/cruise ship, just smaller. The pizza ovens were great, especially for late-night snacks. Beach: beautiful sugary white sand groomed every morning. Crystal clear water, relatively calm. Just OK snorkeling. Easy to kayak on. Windsurfing is up to the watersports desk determining if the wind is going away from shore. The rock wall is only available when the guide is there, look on resort schedule. The \"Watersports\" tent on the beach between the two resorts is NOT part of Divi and costs money. We did not leave the resort and absolutely loved lazing on the beach, swimming, snorkeling, kayaking, drinking and eating. Overall nice and relaxing.", "title": "First Timer All-Inclusive", "helpfulness": 2, "user": "bass108", "date": "October 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119831194}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "For the money that we paid for this holiday I was expecting much more. The rooms are tired and in need of renovating. The interconnecting door between our room and next door just resulted in excessive noise, which was however, drowned out when the air conditioning went on, as this was just far too loud.", "title": "Disappointing", "helpfulness": 1, "user": "marienewport", "date": "October 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 119765302}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The staff are not that friendly, I have felt much more welcome in other Caribbean resorts.", "title": "COME HERE FOR THE BEACH", "user": "Mike M", "date": "October 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119718442}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "On the plus side, the food was good and there was plenty of choice.", "title": "We can't wait to go back!", "helpfulness": 1, "user": "Jadyn U", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119688605}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Just returned from the Divi Aruba. Weather was fantastic and the hotel is very close to the beach. Accommodation is tired but refurbishment has started so 12 months from now may be very different.", "title": "Just returned", "user": "sw5993", "date": "October 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 118959642}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We just returned from our honeymoon - Most relaxing hotel! I saw some of the other hotels on the island and noticed their beach was over crowded - not the Divi. Very peaceful and great for people who want to relax. If you're looking for an upbeat nightlife with lots of bars stay by the highrises.", "title": "Great Hotel! Great Honeymooon!", "helpfulness": 5, "user": "Jgmz", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118882099}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Also - if you're going, there is a litter of kittens abandoned that are living in the resort (maybe 4weeks old) they're near the Sandpiper Bar - by the last of the beaside rooms on the left. Please feed them and give them water!", "title": "nowhere near anything i imagined it to be for the price", "helpfulness": 1, "user": "cindy a", "date": "October 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118823742}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "their is no actual real lobby, it has no ceiling and its open air lobby for registration. i remembered paying $2,894.36 for me and my husband all incusive,with very minimal food selection.", "title": "A Truly Honest Opinion!!!", "helpfulness": 11, "user": "uptowngirl1", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118747727}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "the only great thing i loved was my room having instant beach access from my rooms balcony.", "title": "Worth the travelling", "helpfulness": 3, "user": "lynne63_10", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118732969}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "I stayed at the Divi for 3 weeks, from 2nd august 2011. My husband and I have stayed at a number of top hotels around the world but we have enjoyed this one the most.", "title": "Absolutely brilliant - the best holiday ever.", "helpfulness": 4, "user": "Emmsie123", "date": "October 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119681543}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Some people have said on here that some of the staff are unwelcoming and unfriendly and I can honestly say that this is far from the case. The reception staff are friendly and helpful, the bat staff are amazing - a special mention to Randolph who is brilliant bur also the others are excellent too. The cleaners even are so lovely and always said 'hello'.", "title": "Average resort w horrible customer service", "helpfulness": 2, "user": "Charli70", "date": "October 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119626851}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The location of the Divi is fabulous, the beach us the best we have ever been too (including Thailand, Jamaica, Mexico and others). It is simply beautiful. White sand with clear turquoise waters, absolutely amazing. The beach was cleaned daily and kept to a very high standard.", "title": "Best honeymoon, felt like we had the whole place to ourselves!", "helpfulness": 1, "user": "HollynDoug", "date": "October 18, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 119457644}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The rooms were good. We had heard mixed reviews but we were impressed. The bed was very comfortable. The view from our room (room 411 in Vista 2) was lovely - straight in to the beach.", "title": "Perfect honeymoon!", "helpfulness": 8, "user": "Rrjmtt", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119294094}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We loved the wildlife. The lizards and the peli", "title": "caribbean paradise", "helpfulness": 7, "user": "Christine C", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119102374}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Just returned from 7 nights at the Divi All Inclusive, our first trip there, and had a great time, traveled with another couple. I had read lots of Trip Advisor reviews before we went so knew what to expect.", "title": "First trip, won't be our last", "helpfulness": 3, "user": "SuzanneE", "date": "November 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145931012}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We had a garden view room in Vista II, second floor, which had a great view of the beach. The room was pretty basic but clean, and the maids almost always had our room cleaned by the time we got back from breakfast.", "title": "Paradise", "user": "Toni D", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145541494}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We thought the food was actually pretty good. We hadn't planned on going to the Palm Grill because I wasn't sure I wanted to cook on vacation, but we ended up going for dinner the night before coming home and were glad we did - had a lot of fun cooking our own food at our table with its built in hibachi.", "title": "Wonderful location", "helpfulness": 1, "user": "Giozingaro", "date": "November 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145457398}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The staff was very hardworking and mostly very friendly. The beach is gorgeous, just as we expected after reading all the positive reviews, but the ocean was pretty rough for most of the week, although this didn't stop us from bobbing around in the waves.", "title": "Honeymoon in Paradise", "helpfulness": 4, "user": "krissyb76", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145323942}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "It was a fun, very relaxing, week, and we'll definitely return.", "title": "Great value for money beachside all-inclusive with a wildlife bonus", "helpfulness": 2, "user": "Toffeeman66", "date": "November 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145013882}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My husband and I celebrated our honeymoon together at the Divi and it was just perfect. We had an oceanfront room and spent four days swimming in the crystal clear water, drinking Aruba Arribas, and eating dinner at great restaurants. It's a fantastic resort, the staff is incredibly friendly, and the all-inclusive makes it a no brainer. The restaurants are fantastic for dinner - the Red Parrot and Ginger are delicious! The two things we believe could be improved at the resort are (1) the buffet: breakfast is okay, but lunch was very difficult since I'm a vegetarian. There are pizza and sandwich lunch options at the bars. In general, it would be nice for the Divi to update the buffet and improve the quality of the food. (2) the oceanfront room was great for its proximity to and view of the ocean, however, the room is outdated and could definitely use renovation. The bathroom is very outdated. Despite these two things, we had an absolutely incredible time and are already planning a return trip. Best week of our lives!", "title": "Amazing honeymoon", "helpfulness": 2, "user": "Cara C", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 144599941}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "When I first saw our room I was a little disappointed, the paintwork was a bit grubby and the wardrobe doors were hard to open. We also had a leak through the floor in the wardrobe! But as our stay went on I started to love the Divi! The grounds, pool, bars and beach area were lovely and made up for my earlier disappointment. We ate in all the various restaurants and we never had a bad meal. We also ate at Windows (at the golf course over the road) and this was exceptional. We met so many nice staff and fellow holiday makers from all over the world. It is disappointing that First Choice are not flying to Aruba from Manchester in 2013, we're hoping this will change and we will visit the island and this same hotel again in 2014!!", "title": "Really Enjoyed our Stay and will Return!", "helpfulness": 1, "user": "VFWorcs", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 144559867}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had a fabulous week staying @ the Divi end of September. I don't need to re-write previous views as fairly stated. We wouldn't hesitate returning. Yes, would upgrade to a sea view next time as simply stunning. Also have another half-day on a Catamaran, perhaps self book as great offers available at the High Rise beach area. Talking about High Rise areas :( ugly! So grateful to drive back to the stunning Low Rise! Hire car nice for exploring alone but to be honest the island is so tiny taxi rides would probably work out a cheaper option. Hired a car through Thomson's and found it a drag being picked up to collect the car, not far but having to queue :( probably took an hour and half in all. Would suggest walking the short walk to sister hotel Tamarin where they have numerous car hire desks. Oh talking on the lines of Tamarin, do catch the Golf Buggies back and forth between hotels, we had some hilarious speedy returns! Probably induced by alcohol but we still laugh about it now. Disliked the sun lounger hogging but even though we took our early morning walk (towels on beds at 6am) didn't succumb to rather pathetic behaviour! All said you just need shade for midday when the sun's intense! I have never been so grateful for windy bad hair days :) lol. We have looked into booking independently as Thomson's reduced 2013 flights and might fly into Miami or Amsterdam for connecting flights. You bet we are going back x", "title": "The place to stay in Aruba", "user": "Derry05", "date": "November 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 144401916}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "It is very difficult to compose a review that is very different to all the other positive reports. Definitely 'tired' rooms at the expensive end of the hotel (the Lanai - beach front rooms), having paid extra for these rooms a door with more than 4 screws out of 9 on the hinges would have been good. However, sorted very quickly by front desk. Everything else makes up for it!", "title": "Divi - delightful and delicious - a diamond of the Caribbean", "helpfulness": 1, "user": "robinsnesting", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 144255271}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We have now had 4 all inclusive Caribbean holidays since April 2009 plus a cruise where we visited 10 islands and apart from Cuba, Aruba is the best for staff service and friendliness (equal to Cuba). The Island's motto is 'One happy Island' and this certainly applies to the majority of staff. Curtis at the Sandpiper bar, David and Vanessa in the Pelican main buffet restaurant, Christina our room maid and the boys at the pool/beach towel hut all stand out as exemplary people with too many others to mention by name at the concierge desk, reception, Red parrot and garden staff etc. The Divi Pelican restaurant (breakfast plus buffet meals) is the best of all the AI hotels that we have visited anywhere. Breakfast 'eggs benedict' cooked to order being a particular favourite not to mention the 7 freshly prepared fruits every day (3 melons, pineapple, grapefruit, orange and papaya). Choice of breads was excellent plus all the usual American breakfast foods (pancakes, waffles, crisp bacon etc) with a pot of fresh coffee put out as soon as you arrived at a table. There were 6 to 8 different cereals available as well as all the hot food that was regularly topped up right until just before closing. Pelican staff were hard working and mostly always cheerful and sometimes singing through the service!. Yes we did manage to leave breakfast! and then the beach was fantastic, whether flooded or clear of water and cleaned nearly every day and so so white and talcum powder smooth. New sun loungers and more new beach shelters mean that there was always space and shade. On two days out of 14 the loungers, which are tidied up into stacks every night, where padlocked until around 7am ish, which was possibly to allow the beach combing tractor and machine to clean seaweed away from near the beach shades after the flooded beach days. Yes beach life starts early at the Divi, with some of the condo owners/timesharers from the Divi village, across the road being over by 6.30 am to claim some space. We met some lovely East coast American couples both staying at 'the Village' and staying at the hotel who had been visiting the Divi for as long as 17 years, which says something about the place and the facilities. We visited the 'Tam' next door on two occasions to eat at the Italian and Asian restaurants but preferred the Pelican and Red Parrot. We had one visit to 'Windows on Aruba' for a special occasion which I will review separately - but was really excellent. One small criticism - there was never a shuttle passing when we needed one but the exercise probably did us good! We both have some mobility issues but managed the short walks between different venues. As other Brits have reported, Sandra the Thomson rep was superb (if you want to find her from now go to Lanzarotte for the winter and somewhere in Italy next summer because Thomson have moved her away from Aruba - all that lovely local knowledge gone to waste) and the hotel reception staff checking you in on the coach (all 3 of them to about 20 or so guests) was a real treat. A real shame that Thomson can't fly from Manchester next year and don't provide a shuttle link to Gatwick. This will be a real loss to those Brits from up North and will stop us from coming back, which we would have done next June with family. Comments about the high rise Palm beach area are justified, unless you like samey samey concrete jungle don't bother and the beach doesn't compare. Best way to see the Palm beach area is from a distance on Capt Rene's boat 'Rendezvous on Aruba' (see the separate reviews on Snorkeling Aruba) or a De Palm catamaran. Druif beach (the Divi's beach) is miles better than either Palm or Eagle beach (which was voted number 2 beach in the world on Trip Adviser) and along with the Divi food, staff and service makes for an excellent holiday on 'one happy Island'.", "title": "Lovely", "helpfulness": 5, "user": "april2007", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144138903}], "location": {"country": "Caribbean", "city": "Oranjestad"}, "stars": 3.5, "variance": {"poor": 82, "average": 177, "very good": 515, "terrible": 52, "excellent": 508}, "aka": "Divi Aruba All Inclusive Hotel", "slim_ranking": 0.2, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}