{"user_rating": 4.5, "review_count": 813, "name": "Dolphin Motel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I loved this place! They greeted us so kindly on check in, and gave us helpful visitor information. The room was very clean, and the bed was comfortable. The room didn't have a safe unfortunately, so we had to carry around our passports and cash. They had very yummy blueberry muffins for breakfast. I didn't sleep very well because of the paper thin walls, I heard every footstep, and because the airport is so close there were planes flying over all the time. It's excellent value, next time I'll bring earplugs.", "title": "But the noise....", "user": "shawana80", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 132578662}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This place cannot, I repeat, cannot be beat for the price. The location is stellar, especially if you have a car.", "title": "Awesome stay!", "helpfulness": 1, "user": "Brandy262", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132563451}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Let me tell you about my experience at The Dolphin. I went with my husband and 1 year old for Comic Con & we had a room with a queen-sized and twin bed. It was small, undoubtedly, but it was clean and you could tell that they worked hard every day to keep it that way. The room is stark white, except for the carpet, so you can easily tell how clean it is.", "title": "Quaint motel with a good price", "user": "LV_Syl", "date": "June 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 132464227}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "There is a decent-sized closet with a luggage rack, shelves & hangers, which we fully utilized during our stay. The bathroom is small, but again, very clean. It helps that there is a window (at least in ours) that lets lots of light in and makes the space seem larger than it really was. The shower had great water pressure and it didn't take long to get squeaky clean.", "title": "Great stay", "user": "jmso2010", "date": "June 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 132418470}, {"rating": 4.0, "title": "Great place to stay", "text": "We had lots of electronics with us (cameras, cell phones, laptop, etc) and there were plugs to be had for all. A big plus is that there was always a parking spot available, too, because the lots are relatively small. We noticed that most of our neighbors were fishermen, who were there for the fishing charters. There was also a small table and 2 chairs outside our room, which is saying a lot because the balconies aren't that large.", "user": "tada888", "date": "June 19, 2012", "id": 132332139}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Good place to bed down for the night if your an on the go type tourist. Simple place but clean, basic ammenites but working well. Tucked away but great location. Great value and run by a good team. Keep up the good work guys!", "title": "Cheap and cheerful", "user": "Sidji", "date": "June 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132302068}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We had chanced upon Dolphin Motel while searching for suitable accommodation in San Diego.", "title": "The most hospitable and homely stay in San Diego found here", "user": "lauwxt86", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132295394}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The price was the best out of all the hotels we looked at, and judging by the rave reviews on Tripadvisor, we knew we couldn't go wrong. Rooms were small, but were cosy enough for standard adults. The room fitted us perfectly since we were petite in size. Sheets were fresh and clean as promised, and the bathroom was neat, tidy and dry.", "title": "Good value, great service, clean but a little cramped", "user": "Grency2010", "date": "June 18, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "location": 4.0, "service": 5.0}, "id": 132230907}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We love the location of the motel too. Away from the bustle of Gaslamp Quarter, Dolphin Motel is located about 10 to 15 minutes' drive away from the airport terminal and most car rental shops, and a short walk away from the Sports Fishing Village. It is also in good proximity to most attractions, such as Sea World, Balboa Park and San Diego Zoo.", "title": "Great time", "helpfulness": 1, "user": "T-Hil847", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131992342}, {"rating": 4.0, "title": "Felt like more of a Hotel than motel!", "text": "We love the staff; their kindness and generosity made us feel right at home the moment we landed jetlagged in San Diego, which was our first stop in the States. Jeb and Steve had set such a high standard, that my friends planning for the other cities told us not to have too high expectations of the other hotels in Los Angelos, Las Vegas and San Francisco.", "helpfulness": 2, "user": "angeliz172", "date": "June 11, 2012", "id": 131768938}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "By all means, if we have to get back to San diego one day, we surely will stay again to the Dolphin motel.", "title": "Cheap, clean and conveniently located", "helpfulness": 4, "user": "Loicbilliau", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131705979}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Yes, the rooms are kinda small for Us standards but it was perfect for us as we just needed somewhere to sleep and relax. We had a patio, (room 28) wich was great on the morning to enjoy the pier just across the street and the fresh breeze of the sea.", "title": "Nice motel in quiet surroundings", "helpfulness": 3, "user": "Raging_Hamster", "date": "June 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 131254109}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "Chocolate muffins and bananas were the perfect start for a long day of walking and sightseeing.", "title": "There are still old time bargains!", "user": "ctbeachbum131", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130983274}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The rooms were super cleans, and the front desks employees were a treat, even giving us coupons for the San Diego zoo.", "title": "Clean, Friendly, Value for Money", "helpfulness": 2, "user": "Nicola B", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130968750}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "If there is one hotel i'm not disappointed with on the trip I had, it's Dolphin motel.", "title": "Very friendly and helpful staff. Cosy rooms!", "helpfulness": 1, "user": "Huiyang87", "date": "May 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130921667}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here twice during May at the beginning and end of our holiday. The staff and owners could not have been more helpful and friendly. The rooms were compact but very clean, plenty of parking. Other reviewers commented on the noise but we found it very quiet and it was graduation week on our first stay no problems, we will be returning.", "title": "Good clean value", "user": "kilroyred", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130896651}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "If you want a comfy, clean, safe, no frills place to rest your head in the Pt. Loma/Shelter Island area look no further. The reviews here describe it well - a no frills motel with friendly staff and a comfortable bed...firm, but good mattress, nice sheets, SUPER comfy pillows (no need to bring your own!). We were looking for an inexpensive place to stay after a concert at Humphrey's and this worked out well. We like the ease of a motel (vs Hotel) and also like no parking fees! Bring your own shampoo, etc. Although not in the room, a sign indicates that on request you can get a hairdryer, iron/ironing-board. We had room #36 which is a small room on the 2nd story over the office. You can sit outside your room on the balcony and look towards the marina. Walk across the street to Point Loma Seafoods or Mitchs Seafood. Stroll around the marina. Bike to Shelter Island. This place gets 5 stars for ticking all the boxes on what we were looking for.", "title": "Comfy, Clean, Safe - Budget Friendly", "user": "CC_Cali", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 130885029}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Read the reviews and decided to stay here. It's a GREAT location on the seafront at Point Loma, just across the street from Mitch's Seafood, which is also in the great value for money category.", "title": "Exactly as expected", "user": "Sicinius_111", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130870096}, {"rating": 3.0, "title": "Clean, friendly, noisy", "text": "The Motel is small but spotless. We had a 1st floor room in the corner of the courtyard and the two chairs outside the room were a great place to scan the iPad and watch the sun go down. The owner is has that extravagant southern politeness which is always a delight and is keen to help and make suggestions.", "helpfulness": 1, "user": "hope61", "date": "May 27, 2012", "id": 130704557}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "You cannot go wrong here, there's even a decent free breakfast and it looks a great deal better than its surrounding competition when you get up close, which is no doubt how it has come to amass SO many good Trip Advisor reviews.", "title": "Consistent Excellence", "helpfulness": 3, "user": "pedalcrazy", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130581218}], "location": {"country": "United States"}, "variance": {"poor": 12, "average": 57, "very good": 251, "terrible": 8, "excellent": 485}, "aka": "Dolphin Hotel", "slim_ranking": 0.0518518518519, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Highly Rated - Very Reasonably Priced - American Owned and Operated Economy Motel since 1977. Basic very clean rooms with top rated beds, refrigerators and great showers! Great location - one block from San Diego Harbor and minutes from the Airport - Seaword - Downtown - Zoo - Beaches and more! Friendly - professional staff ready to help with directions - boarding passes, etc. Every morning say hello to the owners Holly and Alan over continental breakfast. - Please see over reviews. Thanks"}