{"user_rating": 3.0, "review_count": 372, "name": "Dolphin Beach Resort", "reviews": [{"rating": 4.0, "title": "Fantastic holiday at st petes", "text": "We have just came back from the dolphin beach hotel at st petes, after reading some of the reports we was a bit weary, about going there. No reason it was spot less in the rooms and not one cockroach in site. It has had a lick of paint and the pool was cleaned everyday, we was there on the 4 july with all the americas, what a friendly lot they was. The staff at the hotel was very helpful. the bar men was helpful and gave good local advice on the area. Loads of good shopping if you had a car to get to the malls and outlets..the food in the hotel was good and there is a bennigans across the road which is very friendly and has good food there. The weather was very hot and humid, we was there when the hurricane denise was 150 miles off our coast, we had rain like I never seen before and bad winds, but nothing dangerous. when it had passed it left a fantastic sunset with reds and yellows and blues, it was beatiful. My advice is not to be worried if you are going there, You will be comfortable and looked aftered. have a great time I am jealous. Hire a car if I was you.", "helpfulness": 18, "user": "simonh7", "date": "July 15, 2005", "id": 3670726}, {"rating": 1.0, "title": "Don't stay at the Dolphin Beach Resort", "text": "My wife and our 3 small children were staying at the Dolphin Beach Resort for 2 nights for a family reunion. I had made the reservation 8 previous to our stay and had guaranteed two beach front rooms with a credit card. I had requested connecting rooms. When we arrived at the hotel, we were told there were no available connecting rooms. When I complained, the response I got was \"what part of 'there is nothing we can do' don't you understand?\" When we looked at our two non-connecting rooms, we realized both rooms had connecting doors to other rooms. But the hotel staff had given these rooms to guests who did not need connecting rooms. So the hotel staff had not even attempted to keep connecting rooms available for guests who had requested them. When I asked the hotel staff (Billy, the night supervisor) if they would ask the guests in one of the other rooms to change with us and I would compensate the other guests for their trouble, I was greeted with an abrupt \"no\". When I indicated that I would ask the other guests myself, I was told that if I knocked on any guest's doors and made this request to change rooms that Billy would call the sheriff and have me removed from the hotel. I ended up asking a very nice couple in one of the rooms that connected to one of our rooms and they happily agreed to change rooms with us. Bottom line, the staff in this hotel do not care about the guests at all and have no customer service skills. Do yourself a favor and stay somewhere else. Maybe if this terrible customer service attitude starts hitting the hotel in the wallet then they will change their attitude (and staff)", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 8, 2005", "id": 3649190}, {"rating": 4.0, "title": "Dolphin Beach was great", "text": "Having read recent reports about the Dolphin Beach, I was very worried about spending two week there, but my worries were totally unfounded. I stayed with my parents, husband and two children and we all had a brilliant time. The hotel rooms were clean and larger than average and bedding and towels changed every day. We saw NO cockroaches or rats. The staff were friendly and helpful. The pool area was spotless and the pool cleaned every day.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 5, 2005", "id": 3636656}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "The location of the hotel was excellent. Right on the beach. There was a shopping mall opposite and a few restaurant/diners very near.", "title": "I Stayed during the Tropical Storm", "helpfulness": 3, "user": "digit90", "date": "June 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3547810}, {"rating": 1.0, "title": "Traveler BEWARE!", "text": "Don't believe the hype about Crabby Bills, terrible service with an attitude to match. The Silas Steakhouse was also bad having waited 1 1/2 hours for our main meals.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 3, 2005", "id": 3527619}, {"rating": 1.0, "title": "Dont Do It !!!!", "text": "I arrived back from 3 weeks in the USA,of which 3 nights were at the Dolphin and felt I must let other readers Knowstraight away to NEVER GO HERE.", "helpfulness": 5, "user": "Ferris5632", "date": "August 7, 2005", "id": 3743692}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "The first room we were given (121 left block as you look at hotel from the front) stunk so much of damp and filth it made me heave.", "title": "The Good, Bad & Ugly of Dolphin Beach", "helpfulness": 18, "user": "ckparrotheads", "date": "August 3, 2005", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3733546}, {"rating": 3.0, "title": "good base for holiday", "text": "We then got the keys for room 159 in the right block,this room was very tatty, run down and dirty, but no smell.But the worse bit was on the second morning it was alive with cockroaches !!!!.(I have bottled one and will be sending it to a certain bearded buisnessman with whom we booked)", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 19, 2005", "id": 3681693}, {"rating": 2.0, "title": "DISGUSTING", "text": "The food in the bar and buffet was tastless.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 18, 2005", "id": 3677547}, {"rating": 4.0, "title": "Great Family Place", "text": "The only good thing I can say is it is in a great position on the beach.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 17, 2005", "id": 3676010}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "I stayed at the Dolphin Beach Hotel in Nov 2005 because I was invited to a wedding held at the hotel so I got a room at the same location. I had read all the reviews on this website and was very hesitant to stay at this hotel, but knew it would be alot more convenient to stay here than at others on the beach.", "title": "Smelly, run down and dirty hotel", "helpfulness": 5, "user": "jbritton78", "date": "November 21, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 4129851}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "This hotel is just as filthy, and run down as stated in previous reviews. I checked in and was given room 317, on the top floor. I took the elevator up (the elevator barely worked) and when i got off the elevator I was overwhelmed by a smell of dirty socks and maple syrup. The hallway was just filthy and run down and musty. When I got to my room, I have to say it was even worse. I guess the smell in the room was terrible must and mold but it was worse than I've ever smelled before at a beach hotel. In addition, the linens had women's hair in them, the blankets had holes in them, the sheets were stained and there was just dirt all over the walls and doors of the room. There was no alarm clock, a microwave that looked like a bowl of chili exploded in it and a moldy bathtub.", "title": "Pleasant week", "helpfulness": 6, "user": "dereham", "date": "October 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4066016}, {"rating": 1.0, "title": "Worst 2 days of my stay", "text": "I was barely in the room at all and had my suitcase with me over half the time but when i returned home, I had to keep my suitcase outside to let it air out for 2 days before I could even bring it, or it's contents inside. Another couple that was at the wedding with us, had to go to 3 rooms before they found one they could tolerate, and then left the hotel a night early. It was just filthy and I cannot believe they are able to stay open for business.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 5, 2005", "id": 3993741}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "If you are planning a trip to St. Pete Beach (which overall I wouldn't recommend in the first place) I would NOT stay at the Dolphin Inn. The Don Cesar Hotel and the Tradewinds looked clean and well maintained, but you would be better off just driving south to Sarasota or north to Clearwater. The entire beach strip in St. Petersburgh, is just old, run down, and completely unattractive. Your vacation would be ruined if you stayed at the Dolphin Beach Hotel.", "title": "Have they got the right Dolphin Beach?", "helpfulness": 5, "user": "annefiona", "date": "September 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3944652}, {"rating": 3.0, "title": "Sept 2005", "text": "My husband and I have just spent a week at this hotel and had a very pleasant week. After reading some reviews I was nervous on our arrival but what a great room we had, Room 352, it overlooked the pool and gulf with our own balcony. The room itself was very spacious and looked as it had been recently renovated, the pool and surrounding areas were", "helpfulness": 3, "user": "Nicola29", "date": "September 27, 2005", "id": 3943381}, {"rating": 1.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "I stayed at this resort for five days, The only good about it was the pool and the beach, the actual hotel is a dump! Our toilet overflowed and when notifying the front desk it took them 45 minutes to get to our room, you can imagine the mess. Their excuse was that they only had one plunger and there was five rooms ahead of ours.......yuck. So they sent one poor old man to clean it up, and he didn't do a very good job so much water had come out of the toilet that it soaked half the carpet... which they didn't clean or dry.....so you can imagine the stench .... musty old carpet.... THEY WOULDNT COME CLEAN IT UP FOR THREE DAYS , THE STENCH WAS UNBEARABLE! The only reason they did come was because i was so disgusted by the smell that i bought a bottle of baby powder at the drugstore and dumped the whole thing on it to cover the stench. It was awful. not to mention when i got home they had overcharged my visa by 500 dollars, and i had to wait two months for them to take the charge off. DO NOT GO THERE, save yourself the misery", "title": "so disgusting", "helpfulness": 4, "user": "mistymay", "date": "September 12, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 3897825}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "If you are looking for a beach holiday, this hotel will suit you down to the ground.", "title": "Great for a beach holiday", "helpfulness": 9, "user": "taffma2", "date": "September 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3892097}, {"rating": 1.0, "title": "A Health Risk - smelly, damp and tatty!!!", "text": "The rooms that have a veiw onto the pool/beach are standard hotel rooms, with a fridge, microwave, and TV. There is plenty of storage space for your clothes, hanging space too.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 21, 2005", "id": 3793952}, {"rating": 4.0, "title": "Great Stay", "text": "The staff are friendly and and helpfull. you might have to wait till later in the day to have your room cleaned (we stayed there over Labor Weekend, when the hotel was full), but the housekeeping staff were appologetic about the delay.", "helpfulness": 7, "user": "Paul5289", "date": "August 13, 2005", "id": 3759566}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "Outside the pool area is clean, with plenty of shade for when it is very hot.", "title": "Disgusting hotel", "helpfulness": 11, "user": "scottishminnie", "date": "August 12, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3757801}], "location": {"country": "United States", "city": "Saint Pete Beach"}, "stars": 2.5, "variance": {"poor": 44, "average": 75, "very good": 132, "terrible": 76, "excellent": 45}, "aka": "Dolphin Beach Hotel Saint Pete Beach", "slim_ranking": 0.866666666667}