{"user_rating": 4.0, "review_count": 479, "name": "Dom Hotel Koeln", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed here for five days in December 2009, visiting Cologne and the surrounding area. Quite simply, the Dom Hotel provides one of the very best experiences I've had in a large city centre hotel. The staff here are perhaps the most efficient, helpful and friendly I've ever met. The rooms are large, comfortable and well equipped. There's a great selection of hot and cold food for breakfast.", "title": "Outstandingly good hotel in a great location", "user": "Prof_Yaffel", "date": "December 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51100504}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "If you can, get a room which overlooks the Cathedral and the square outside.", "title": "Excellent Hotel", "user": "hillbillyexpat", "date": "December 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50541354}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "I don't have anything negative to say about the hotel itself, but visitors might want to think about the following. If you're planning a stay here during Advent, be aware that there are road closures on Friday, Saturday and Sunday near the hotel, which can make driving there difficult. The roads are used for coaches. The hotel offers a valet parking service, which I didn't need on this occasion, but I'd certainly inquire about it if I intended to arrive by car on a Friday or Saturday. If you're going to drive here, park at the Dom carpark, and there's a staircase which leads directly into the hotel. As of December 2009 it cost 18 Euros for 24 hours.", "title": "Perfect location; Stunning rooms!", "user": "RobbertS", "date": "November 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48977182}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "There's no gym here, but they have an arrangement with a nearby fitness club. The advantage is that you get a better gym than you normally get in a hotel; the disadvantage is that it's not on site, although it's not that far away.", "title": "Over and above the call of duty", "user": "BathYorkers", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 48744413}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Don't let the view of the market put you off if noise bothers you. The market shuts by 10 pm and the square is quiet after that.", "title": "Can't Beat the View or location", "user": "seery1", "date": "November 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48237963}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Stay elsewhere….seriously! This is the worst hotel I have stayed at in Germany and is in desperate need of renovation and maintenance. The halls on the upper floors were filled with cigarette smoke from the bar which filtered into our room (3 floors up from the bar). The bath towels were worn and shredded, carpets in our room were literally pulled away from the walls, the furniture was badly marked the drapes had obvious stains. The valet parked my car and didn’t bother to tell me he had damaged on of the rims on the curb (although management did take care of it and I am waiting for their insurance provider to contact me).", "title": "Yikes!!!!!", "helpfulness": 2, "user": "susanj1310", "date": "January 25, 2010", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 54334460}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "The only good thing about this hotel is the location but honestly there are far better lower star rated hotels to stay at.", "title": "Enjoyable Stay at Dom Hotel", "user": "Travel_Critic999", "date": "January 18, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53765017}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "My wife and I, along with another couple, stayed at the Dom Hotel for one night and I must say that the hotel was very pleasant. The hotel's staff are indeed top notch from the bellboy to the concierge to the front desk managers.", "title": "We enjoyed every minute", "user": "Family4Cologne", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53083098}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We paid about 145 euros per night which was a very decent price for a hotel of this caliber. We did not take breakfast in the hotel, nor did we dine at Le Merou restaurant but the menu posted in the elevator did seem quite appetizing and for a reasonable price as well.", "title": "Superb location, excellent rooms", "user": "Panda1974", "date": "January 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52728052}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I must also say that the men's bathroom, just below the lobby is out of this world due to one particular feature. You must see it to find out!", "title": "The Dom Hotel thoroughly deserves its five star rating", "helpfulness": 2, "user": "luckystrike", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52071249}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The hotel rooms were clean and fairly spacious. We had a room with a small balcony overlooking the square and the Fruh beer house, which was a lovely view. The location was also fabulous, just steps away from the cathedral. The staff knew us by name and went out of their way to be helpful and friendly. They were more than happy to give directions to the local attractions and even supplied umbrellas on the day it rained. I would highly recommend this hotel to anyone traveling to Cologne.", "title": "Fantastic hotel and incredibly friendly staff", "user": "Nsquared35", "date": "March 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59108319}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Lovely place, right on Dom square. The Staff are totally first class, all of them, they bend over backwards to help, from the reception, bell boys, room service, housekeeping they are fantastic!", "title": "Superb Hotel, great location", "user": "BrandonTraveller", "date": "March 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58324673}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The bar was great, nice to be able to smoke. Smoking is allowed in the bar and lobby area, but not in the rooms, (we reserved a smoking room, but were told the hotel is all non smoking rooms)", "title": "Nice location, disappointing experience", "helpfulness": 3, "user": "aniaolek", "date": "March 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 57448191}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Seems a bit strange the smoking rule, as its usually the other way round with Hotels in the UK. In the UK Hotels, you can book smokers rooms, but are not allowed to smoke in public areas. Here , its dont smoke in the rooms, but smoke in public areas. The rooms were fine, bathroom rather small but fine as well.", "title": "Can't Beat the Location!", "user": "BCtraveler44", "date": "February 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55609640}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Complimentary mini bar, excellent! Room TVs get all the British TV channels.", "title": "Perfect choice in Koln", "user": "cheese-arific", "date": "February 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55185477}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "There are hotels with very good service then there are others with great service. The Dom Hotel provide the most exceptional service of any hotel I have stayed at in Europe. Starting from their welcome to the room it is all exceptional first class. First off the location is within direct sight of the Cologne Cathedral, just across the square. The train station is a three to four minute walk from the hotel. Paricularly great during the frequent rains in Cologne during the spring. The room they gave us on the first floor had a large balcony with picture access to the cathedral. Very clean with the best of toiletries. The room which I paid for with Starwood Points and cash was exceptionally large and first rate. Nice new furnishings in a large classy room. However what sets this hotel apart from others is the exceptional concierge service and general manager. The three concierges went out of their way to help us with every reservation and piece of information about how to get to different places in Cologne and the Rhine Valley. They printed out the schedules and gave detailed directions, pointed out what to see, and how to get back at night. They were all first rate. I wish i would have kept the names of the three different males that provided assistance to us during the two days we stayed there to give them adequate credit. In addition, there is nothing too small to ask the general manager to do. My only fear is that as good as he is he will leave the hotel for one of the larger facilites in Europe. He trains his staff well and it shows! There is also free internet service at the hotel and three computers available for desks. I never had any problems using the internet and staying on as long as I like. The only negative about the hotel is there is not an on-site gym or fitness center at the facility and the price of food and drinks in the hotel is very expensive. However the concierges were more than happy to point out places that catered to any budget. Please check out this hotel if you like a great location and exceptional service. Definitely the best of the Le Meridien chain I have stayed in during trips to Europe. Bravo.", "title": "Best Le Meridien Service in Europe and Great Location", "helpfulness": 1, "user": "DCSacramento", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65772675}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Located directly in the shadow of the Dom. Our room had a stunning view of the plaza and the Dom (we got upgraded). The room had a big bed, desk, two closets, flat panel TV, and small sitting area. The bathroom had tub and sink. The hotel has a business center with free internet and photocopier, and underground parking is available in a large and modern garage. The hotel staff were very helpful, friendly, and classy. While situated in the dramatic location next to the Dom, the hotel in its own right has a unique history. Make sure you ask about the staircase and Japan salon, which are the only surviving vestiges of the original Dom Hotel.", "title": "A Grand Hotel with Unique History in a Stunning Location - Highly Recommended", "user": "WereFromTheBronx", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65734050}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Other hotels stayed at on this trip: Le Meridien Munich, Cloister Inn Prague, NH Klosterele Nordlingen, ArabellaSheraton Hotel Seehof Davos, Hotel am Tiergarten Nurburg, Sheraton Airport Frankfurt.", "title": "Excellent Location!", "user": "Spanglor-Still", "date": "May 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63499250}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "Hotel itself is lovely - grand fixtures and fittings. We had a very spacious room , overlookign the Cathedral,with a sitting area, however the bathroom could have used more space.", "title": "Excellent", "helpfulness": 1, "user": "Jonycold", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60171072}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I have to single the pillows out for partciular criticism - they were terrible - no substance and I made the mistake of looking under the pillow case to find the pillows badly stained - which was more than a little off putting.", "title": "An umbelievably wonderful hotel!", "user": "Jennie1907", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59444113}], "location": {"country": "Germany", "continent": "Europe", "city": "Cologne"}, "stars": 5, "variance": {"poor": 26, "average": 48, "very good": 137, "terrible": 18, "excellent": 250}, "aka": "Meridien Dom Hotel", "slim_ranking": 0.0782918149466, "description": "Stay right at the heart of Cologne andenjoy our new rooms and suites with the marvellous view to the Dom, only 50 meters beeline."}