{"user_rating": 4.0, "review_count": 410, "name": "Domina Coral Bay Sicilia Zagarella", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel is about 50 kilometres from Palermo airport and about a 45 minute drive. We arrived mid afternoon after making the mistake of driving into Palermo for lunch which was a nightmare.", "title": "nice hotel away from frantic Palermo", "user": "Dunedain", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158565563}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Staff at reception were very courteous and helpful. We were allocated a room with a view overlooking the pool and the sea and it was a good start to a great holiday. We had a couple of queries about the air-conditioning which were promptly resolved by the ever-helpful Monica. Our package included dinner on the first night which was good but not cheap. We did not use any of the facilities like the pool and the gym but walked around the resort to the sea front which was pleasant.", "title": "Great modern hotel", "helpfulness": 7, "user": "muff77", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148527680}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We spent the next 5 days driving around visiting Agrigento, Trapani, Siracusa, Catania and Mondello and enjoying the local cuisine. A good though slightly pricey place to eat in Trapani is Ai Lumi which served good pasta with sardines.", "title": "Wonderful place to stay!", "helpfulness": 12, "user": "Dougie S", "date": "November 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 146076538}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "In Catania, we ate at La Paglia near the fishmarket whose speciality was seafood. We had the lovely fish soup as the main course.", "title": "Wow !! just idyllic", "helpfulness": 10, "user": "ColinBallymena", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143049205}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "In Bagheria near the hotel, we ate twice at Don Ciccio (recommended on Trip Advisor).", "title": "Very nice to stay", "helpfulness": 1, "user": "Sue J", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142647851}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The hotel has an amazing beach the only thing that its stony.Spectacular pool.Good rooms.Fantastic animation.Located in a quiet surrounding not far away from the main touristic locations. 4+", "title": "Good value for money", "helpfulness": 2, "user": "lyu g", "date": "June 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132132447}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The venue for this Hotel is spectacular, pearched on the edge of the coast, you can sunbathe on the loungers and dip straight into the ocean. The Hotel was much bigger than we expected and as such the pool areas felt very overcrowded and noisy. We only had one meal at the hotel which was very disappointing as we were told it was al a carte, but when we arrived at the restaurant it was a buffet.", "title": "Fantastic venue, a little disappointed with Hotel", "helpfulness": 2, "user": "annie t", "date": "June 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132008143}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Maybe the fact that there seemed to be a conference in the hotel that weekend, made it not live up to expectations, however it's definately worth checking this, if you are looking for a peaceful relaxing stay (as you wont get one!)", "title": "Amazing - a wonderful experience", "helpfulness": 1, "user": "DMT_12", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 130562538}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We were left wwithout towels on one day and had to go to reception to pick up spares, and the wi-fi only lasted 1 day!", "title": "The hotel is fantastic, the restaurant is sometimes poor.", "helpfulness": 3, "user": "goldflute", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120023940}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Overall the location made up for the downsides, but not sure whether we would return.", "title": "Beautiful hotel/terrible restaurant", "helpfulness": 3, "user": "tigger-5177", "date": "October 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 2.0}, "id": 119786605}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "We will finish our stay in hotel in couple of days, but all I can say about hotel is that whoever commes will really enjoy. Although it does't look so big hotel is quite big. We booked one of the villas in the hotel, it is not really villa, but it is separated room, quite spacious, looking like small house, but with amazing view. It worths every penny :). Parking is very convinient and reasonably priced.", "title": "One step more to be excellent!", "helpfulness": 2, "user": "Sinisa D", "date": "July 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 135781047}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The only thing missing is better variety and service when it commes to food. If they make one more small step and make service (waiters) go arround beach and pool area, i would give excellent to this hotel.", "title": "Really enjoyed our stay. A car is a must! Bring an eye mask.", "helpfulness": 1, "user": "amyknows", "date": "July 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 135686506}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "Breakfast can be a bit more adopted to italian food, more cheese and local hams.", "title": "Loved the decor, Staff could be more helpful", "helpfulness": 2, "user": "JPSoshea", "date": "July 18, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 134695489}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Aside of this small remarks hotels is excellent and I would definetelly come back again.", "title": "Lovely hotel in a beautiful spot next to the med", "helpfulness": 3, "user": "Matthew W", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 133613183}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "After thorough research we decided on this hotel. The hotel is very nicely decorated. The only downfall to the decor is the glass door for the bathroom. If someone needs to use the bathroom in the middle of the night the light is bright enough to wake the others in the room. An eye mask could solve that problem. The buffet \"special dinner\" was not that great. The worst for me is that we had a late check in - after 9 p.m. and the front desk told us about the dinner. We arrived because the front desk told us that it was still available - we didn't even ask about it -and the waitstaff had to scramble to pull out a table for us and then the food was not replenished and we were left unsatisfied and still hungry. The breakfast was great and sufficient. I would stay here again and not participate in the special dinner especially because there is a restaurant right near the hotel that is reasonably priced and quiet good. The pools are great as are the bathrooms outside. The staff will want you to put all purchases on your room which was annoying one time because I didn't want to. We traveled by car to Palermo, Mt. Etna and Corleone. I recommend a rental car if you stay here as there isn't much to do near the hotel.", "title": "Resort that is better for travellers with cars", "helpfulness": 4, "user": "Eleanor H", "date": "June 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 2.0}, "id": 133016711}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Spent a week in this hotel. Arrived to find that there were no taxis to take us from rail station to hotel. We phoned hotel and one was sent out (an old man in a very old/unsafe bus but we didn't really care, we just wanted to get to hotel.)", "title": "Doesn't live up to its potential", "helpfulness": 20, "user": "DublinUnhappyGuest", "date": "August 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 138300676}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "First thing we noticed was the area that it was in. It was not nice, lots of rubbish to be seen if you go walking. There really is not much to see outside of the hotel so I would reccommend that you definitely need a car if you stay here, otherwise stay somewhere else.", "title": "Room with a view", "helpfulness": 6, "user": "SarahBridget87", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 137810562}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "When we arrived, the staff were very nice. We were checked in and went to our room. It was lovely. Clean, air conditioned, modern and had a lovely view. Very impressed so far.", "title": "Great hotel", "user": "KathrinHelena", "date": "August 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137650743}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Unfortunately it went down hill from there.", "title": "Holiday but not as you know it!", "helpfulness": 4, "user": "Penny S", "date": "August 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 137107364}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "On the first night we ate at the buffet which was not an enjoyable experience. 26 euros each not including wine. Having to queue with the other guests (some quite rude and plenty of pushing and not waiting your turn) was not what we thought we would be getting in a 4 star hotel. Plus the food was not too tasty.", "title": "Totally in line with the upfront promisses :)", "helpfulness": 4, "user": "Hans D", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136711995}], "location": {"country": "Italy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 33, "average": 86, "very good": 138, "terrible": 18, "excellent": 135}, "aka": "Domina Home Zagarella Hotel", "slim_ranking": 0.4, "description": "Domina is proud to present a four-star superior hotel Domina Coral Bay Sicilia Zagarella. The marvelous natural environment of the Porticello Gulf Coast makes this hotel fantastic holiday destination. The hotel is right on the sea front and it’s just a few kilometres away from Palermo. Most of the hotel services and the greater part of the rooms are situated in the hotel main building. There are two restaurants, the Wine Club, the Bar N°5, a fitness room and outdoor swimming-pools on the premises.The decorative bridge over the central swimming-pool leads to the terrace, from which You can enjoy a fascinating view of the Mediterranean Sea.Furthermore, the hotel offers indipendent sea view mini-villas, which look like a real fishing village surrounded by an ages-old park, an ideal place for a romantic coastal walk. Ready to meet the needs of the most demanding clients, the hotel offers a complete range of four-star superior hotel services, including a watersports center, a scuba diving school, multipurpose sports fields and sunbathing terraces.Moreover, the Domina Coral Bay Sicilia Zagarella is the perfect choice as the venue for your event, meeting or conference, able to accommodate up to 900 guests, thanks to its spacious exhibition areas and a new conference centre divisible into several meeting rooms equipped with the most up-to-date technology."}