{"user_rating": 4.0, "review_count": 477, "name": "Donovan House - A Kimpton Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Fantastic hotel in a great location and for a great price. From arrival to departure the staff were professional and courteous and couldn't do enough for us. Room was bright and airy, clean and comfortable, The rooftop pool and bar area are spectacular. Didn't use the restaurant so can't comment but will definitely be back!", "title": "great hotel!", "user": "mrssnips66", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176979962}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Our stay at the Donovan House in Washington DC was absolutely enjoyable. I loved the multicultural multiethnic influences reflected in the appetizers, the restaurant menu and the friendly, highly professional staff.", "title": "James Bond Style", "user": "VaporK8", "date": "September 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176719201}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "When entering the lobby, check out the James Bond action film clips being projected on the upper wall. Hotel staff sported imaginative code names on their work badges. When we arrived in our mod-style room, we even found leopard and tiger skin color cloth bathrobes in the closet! Great fun!", "title": "Another amazing stay at Donovan House", "user": "Khughes79", "date": "September 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176547385}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Our room was simply beautiful with a panoramic window view overlooking Thomas Circle. The interior was clean, modern and toiletries were restocked, and refreshed regularly. The lighting was unusual and interesting. Our king bed mattress was very comfortable. Added thoughtful, extras include a large umbrella (found in the closet) that allowed us to walk this pedestrian-friendly city during the occasional rain shower.", "title": "Could do better", "helpfulness": 1, "user": "Sharon L", "date": "September 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 176415493}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We took advantage of the complementary wine hour with appetizers in the hotel lobby. We did not use the roof top bar, however it looked very well done and active.", "title": "Classic Kimpton but some issues", "helpfulness": 1, "user": "GCC14173", "date": "September 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 176247283}, {"rating": 4.0, "title": "Ok", "text": "The room , the employees, the extra touch are all outstanding feature in this hotel. However this \" modern style hotel\" is more industrial modern hotel.you have to create a worm feeling, a soul to make it a great place.i will bring some examples. The wine tasting is nice event and suppose to create a friendly atmosphere , however, no one from management was present to introduce him/her self, you missed an opprtunity to get to know how you can become even a better friendlier hotel. The bar on the 14th floor is a great location, however when you serve wine, please remember that a napkin is maybe helpful, and while I understand that the informality is the message, you have to remember that it can not be on account of the service.", "user": "MidnightinParis8", "date": "September 7, 2013", "id": 176242156}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It also would be nice that when a staff member regardless of his/her position would acknowledge a guest, simple hello/ good morning/ good night would be greatly appreciated.", "title": "Labour Day Wkend Stay", "user": "Jon H", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175735976}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "This are only some points that can make a very nice hotel, wven a better place to stay.", "title": "Good location, interesting decor", "helpfulness": 1, "user": "ronger5", "date": "September 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175671878}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Just returned from another excellent stay over the weekend at Donovan House with our guests. Service as ever was excellent throughout and all the extra touches much appreciated. A particular thank you must go to Joon who was extremely helpful along with all the other staff.", "title": "Non-Standard Bed Sizes", "user": "Michael L", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 175452461}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Thanks again and we'll see you soon,", "title": "Another great stay with Kimpton", "user": "Robert H", "date": "September 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 175312726}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Stayed 7 nights as we wanted to see as much of Washington as we could. Good location, within easy walking distance to White House etc. Longer walk to museums and bars around 7th Street but once we worked out how to take short cuts this was fine. Complimentary breakfast included which was a pleasant surprise and a good way to start the day. Room on 12th floor was great and provided us with stunning views and also helped us get our bearings on arrival. Bathroom and accessories good and replenished regularly, also loads of towels! Staff lovely and really helpful (Rosa checked us in & out and nothing too much to ask), hubby also enjoyed football banter with the porter (sorry I cannot recall name). Plenty around hotel (Maddy,s Tap Room, Lincoln, cafés & CVS) so not stuck if you want to stay local. All in all a great stay - and the lifts worked fine! Thank you for a great stay.", "title": "Great place to stay in D.C", "user": "Kerzy", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178594260}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "So me and my girlfriend decided to stay here on our trip to see the Washington Redskins play in Maryland, being that the hotel is about 20 minutes away from FedEx Field we thought it was perfect. As we arrived, being our first trip to Washington we noticed traffic was awful, of course you can't blame the hotel for that, but it made finding the place a little stressful. When we got to the Donovan House the valet was no place to be found, which was good with me because I planned to self park anyway, I drive a Roush Mustang which is seriously my baby and I wouldn't leave it in the hands of valet, once we parked valet was bringing someone else's car in and driving completely wreckless nearly hit my girlfriend and I as we walked up the parking garage due to the elevators being out of order. I would not reccomend allowing valet to park your car! Once we checked in we were very pleased with our room, it was very clean and comfortable. The morning after we ordered in room dining which took quite a while to arrive, it was 70 bucks for her and I to get French Toast and an Omlette which I thought was steep, especially considering my omelette had two black hairs in it, note that neither of us have black hair so I know it was from the cook. Otherwise everything went pretty well, the front desk was friendly and helpful. Although I wouldn't recommend this hotel, I would say it wasn't completely awful. Don't use valet, and don't order from in room dining.", "title": "The Good, The Bad, The Ugly.", "user": "CodyFord86", "date": "September 24, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 178462145}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "I would highly recommend this place for anyone wanting to visit the tourist sights in D.C. as it was within walking distance to the National Mall and White House (and great restaurants), the room size was spacious and the staff were great in their attitude. This was my first time in the city and was highly impressed with it. That was largely due to this hotel.", "title": "Lovely hotel, great location and great customer service", "helpfulness": 1, "user": "DorsetgirlLondon", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178443168}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Summary: This is a nice hotel. The staff did a great job to make me feel welcome, the actual inside of the hotel and room were very comfortable, and the hotel had a great location.", "title": "Nice hotel and great location", "user": "chi_54", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178357097}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Location: While some might want to be closer to Dupont circle, I loved the location of the hotel. There are a ton of great bars and restaurants and hotels up 14th street and I was able to visit a few of them. For those that want to go to Dupont or the more touristy parts of DC, this is all within walking distance.", "title": "Great Customer Service", "user": "travelinJong", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178352164}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "This hotel is in a wonderful location in the city. It has great style and the customer service is exceptional. The restaurant food was pretty good, wine great. I will definitely stay here again whenever I'm in DC again.", "title": "Great hotel", "user": "Lisa W", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178308438}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I stayed 5 days at the Donovan house, DC for a series of meetings. My room was on the 7th floor, overlooking 14th street (no noise at all, great soundproof, wonderful sleeping quality). The hotel is conveniently located and walking distance to Capitol Hill and the White House area as well as to most DC attractions and shopping.It is across the street from a 24 hs CVS, which is convenient to grab some snacks and beverages. As well, it is a 15 min walk to Georgetown, beautiful part of the city to walk around!.", "title": "Modern hotel, convenient location!", "user": "werty09", "date": "September 22, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 178183135}, {"rating": 2.0, "title": "Watch out for the \"free\" complimentary services -- Paid 17$ for a 'free' glass of wine", "text": "The room is very nicely decorated and comfortable. The only criticisms would be to the lighting distribution, which is weird and not very effective, and the fridge (frigobar) which is small and full. You have to ask for the key and only a small bottle fits in.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 18, 2013", "id": 177683387}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "There is complimentary coffee in the morning and complimentary wine and snacks from 5 to 6 in the afternoon. If you take breakfast, bear in mind it is not a great thing! Mostly some fruit (sliced melon, pineapple) and a couple of bakery options (toasts and croissants), fresh fruit juice (orange and grapefruit), coffee and tea.", "title": "Suprisingly nice and a little different", "user": "croaker2", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177164529}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "The Zentan restaurant (downstairs and room service) is Asian cuisine. It is good, though do not expect abundant dishes.", "title": "Mod style, mixed results", "user": "nwilkins", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 177141966}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 4, "variance": {"poor": 19, "average": 64, "very good": 135, "terrible": 11, "excellent": 248}, "aka": "Donovan Hotel a Thompson", "slim_ranking": 0.317829457364}