{"user_rating": 4.0, "review_count": 340, "name": "Doral Arrowwood", "reviews": [{"rating": 3.0, "title": "Tired looking", "text": "Lovely location in Westchester. Pool and leisure facilities very good.", "helpfulness": 9, "user": "TMW13", "date": "February 12, 2004", "id": 1647416}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Doral Arrowwood is a Great Hotel.!!! I have been there to that hotel 7 times and I really like the hotel.!!! We go there once or twice a year or even a few times a year and it is really great.!!! I go to Westchester Mall near there and go to Build-A-Bear and Hallmark. I even go to Outback Steakhouse in White Plains, New York and I also see my cousin Chris Kollarus.!!! I even went to Nueberger Museum of Art which is a nice art museum and you can see lots of paintings there. At Doral Arrowwood I love the pool, Free Breakfast Buffet with Eggs, Pancakes and Waffles and The Pub which is the restaurant for lunch and dinner and I like the person who works there named Josue. The concierge Ron is nice and friendly too. I love the atrium and the indoor pool tunnel that you can swim under then you are in the outdoor pool. I do lots of laps in the Pool. Josue the person who works in the Pub is nice. My seventh time there was for a family reunion.", "title": "Doral Arrowwood is a Great Hotel.! I have been there to Doral Arrowood 7 times.!!!", "user": "18SAMNOAH", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131704138}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Doral Arrowood is fabulous facility with it's location, good service and cleanliness. We have stayed here many times and continue to find it a lovely facility with very reasonable rates for this area. It is a good value.", "title": "Treasure in Rye Brook", "user": "CWGoldman", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130036320}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I have been at this hotel three times, always for business. The hotel is in a very quiet, isolated area, with nice areas surrounding it and, although I am not a golf fan, it seems the course is very nice. The gym ys good, the swimming pools look very attractive and the rooms are comfortable. Buffets are in general average/good. It is a very nice place to be relaxed and focused on your business meetings.", "title": "A shame not to have time to enjoy the facilities", "user": "Cholupo", "date": "May 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130014156}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Stayed one night for business at this large resort. Beautiful sculpted grounds and golf course, large indoor and outdoor pools, tons of meeting space. The Atrium restaurant puts out enormous buffets with lots of variety and an attentive staff. I'd say many of the associates that work here have been here for years. There are modernized guest rooms - I got lucky with one of the most comfortable and luxurious beds I've ever slept in. Bathrooms lined with travertine marble, flat screen TV's and an overstuffed chair. The hotel sits on a hillside so the lobby is at ground level on one side of the building but the 5th floor on the other side. Surface parking is a moderate walk from the lobby but it is free. This resort is located north of NYC in Rye Brook - a beautiful area. This is a great area for long walks and relaxing drives. You'd never guess you're near New York city.", "title": "Great New York Resort", "user": "LoveCarmel42", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128943626}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "This is a beautiful hotel located in a secluded area in Rye NY (right next to the golf course). Beautiful grounds. Hotel has a nice restaurant and pub and is unique because it is built into the side of a hill so you check in at ground level and all rooms are below grade with a wonderful view. Rooms were clean and appeared to be recently renovated (couple of years ago maybe). Wonderful stay and recommended!", "title": "Beautiful Hotel", "user": "John G", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128882814}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed at this hotel on Business in June and the hotel we very good. It has a nice bar and we were particularly impressed by the good quality food and choice we had. We needed a taxi and decieded to use the taxi service from the company in the lobby. He charged us per person for the taxi ride and it ended up being about $120 for 8 people to go into the town. We decided to catch a meter taxi on the way back and the same journey cost us $40 for two taxi for the 8 people. Avoid the taxi company in the hotel at all costs as he is a complete rip off. Other than that the hotel is good with good service and decent rooms.", "title": "Good hotel. Rip of Taxi Service in hotel!", "helpfulness": 1, "user": "cedejah", "date": "March 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 125989396}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "We're from nearby, but made a quick getaway for a night, mostly so we could take advantage of the pool. Sure, the place is a bit outdated but hey, it's reasonably priced and there's an indoor/outdoor pool open year-round. That's right, you can SWIM OUTSIDE, even in a blizzard, or a monsoon, or an Armageddon. Pretty awesome. I guess there's a place to play golf somewhere, and a place where a bunch of boring iPod men in suits can get together to talk about strategery and \"shareholder values.\" I didn't experience any of that crap, I was too busy swimming OUTSIDE in the dead of winter. Worth it.", "title": "Excellent Place for a Quick Getaway, Especially if you Don't Have Your Own Indoor Pool", "helpfulness": 1, "user": "WhenPigsFry", "date": "February 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 125319658}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The property is great, but do not expect to go anywhere without a car. The taxis have some sort of mafia mentality and charge as much as the rental rate of a car for a week just to run you around the corner, or to the train station as an example. The staff was excellent, very attentive, and actually concerned about your experience. The other guests...well some of them were not so nice to the staff. It amazed us how well the staff tolerated some guests, all with professional courtesy and genuine interest. The property is great, the staff is even better.", "title": "Nice to see Doral again", "user": "Steven_West", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 125098056}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Excellent food at the buffet, loved the exercise facilities including swimmming pool where you can do laps. Meeting room was great for the meeting.", "title": "Super location and facilities for a meeting", "user": "elaine3Southport", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125024107}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Really liked the food that was available for the meeting esp. the ice cream bars.", "title": "Love the easy comfort", "helpfulness": 1, "user": "Lynne003", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124984167}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Family trip to be near a convalescing relative. Loved the weekdays as it was mostly business folks on retreats. The weekends get a little crazy with families and kids running amok. Fantastic breakfast buffet and very friendly staff all around. Especially the valets. The lifeguards could use a some retraining on how to treat guests. While they have to deal with obnoxious kids all day, they need to take a chill pill.", "title": "Weekday vs Weekend - Still great", "helpfulness": 1, "user": "BeachChair", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133214262}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Lots of surprise activities, like Friday movie night in the pool, or the Saturday afternoon cocktail party. All gratis. Two minutes from the jaw-dropping Pepisco Sculpture Garden (free). Bring a picnic, but plan ahead since there are no nearby eateries.", "title": "Wedding at Doral Arrowwood", "user": "Tom881", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132647624}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Great gym. Lunch at Mulligan's did the trick, tho a tad pricy.", "title": "Amazing underrated getaway", "helpfulness": 1, "user": "Willa S", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132448684}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "While Maintenance was responsive, they did not solve either mechanical noise problem. Both recurred after their service call.", "title": "Great hotel a little over priced.", "user": "Shoutinguncle", "date": "June 17, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132176156}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed as parents of the Groom! Everything was well done. Rosaria Costa and Gerry De La Rosa were experienced, confident and accomodating making sure every detail was covered. Reception, venue, food service.....spectacular! Extremely open and spacious venue. Great golf course, pool and quiet rooms. Lots of areas to sit and chat. All of the staff from the valet to the front desk and room service were exceptional. Location convenient to highways and airports. Nice place to turn any event into a \"staycation\" as some of our friends did.", "title": "weekend at the Doral Arrowwood", "user": "Amy K", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131839753}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "There seems to be a common theme among larger hotels in the Westchester County Area. They all look as if they need renovations, and dont quite have the service needed for the amount of guests. This place is no exception. I think its because there are so few quality hotels in the White Plains area that many of them just dont feel the competition to go the extra mile.", "title": "Decent, but could be alot better.", "helpfulness": 6, "user": "icem2829", "date": "January 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6565879, "likes": {"liked": "— Size of rooms and views.", "disliked": "— Need renovations and staff did not seem to care much."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006", "text": "The hotel itself is huge and sprawls over many acres of gorgeous real estate. Outside of the fact that the hotel lies on final approach for Westchester Airport, the location is perfect. There are many dining and drinking options on the premises and from what I tried the food was quite good - although overpriced. We went there on a warm early srping day and the outdoor bar area was open , which was a nice touch. The rooms were quite big , but very average in terms of quality. They look as if they if a nice renovation would really help them out. The indoor/outdoor pool and fitness center areas all looked nice, but we did not get to try them. The Breakfast buffet was very extensive, but the quality was simply average. It was not bad by any means, but not of the quality of a 4*or 5 * hotel.", "title": "Not at all what it appears...", "helpfulness": 5, "user": "kmbnyc", "date": "September 3, 2006", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 5766029}, {"rating": 4.0, "title": "Nice place but not too much to do.", "text": "With a few renovations I think this could be a top of the line hotel, but it is not quite there yet. That being said, I think most people will be ok for one or two nights here.", "helpfulness": 7, "user": "rcr115", "date": "January 5, 2006", "id": 4327199}, {"rating": 3.0, "title": "Nice but not great", "text": "Booked reservations for a \"quiet and relaxing\" weekend through the properties in-house reservations, I was clear in telling them what I was hoping to experience at the hotel, \"quiet and relaxing\". Well, this was not what greeted us at the Doral Arrowwood. A planned property wide carpet install was underway with work starting early in the morning and going on until past 10PM. The hotel was a mess. O.K., try and overlook this - head to the Pub for a quick dinner - now, it's hard to do pub food bad but the Doral exceeded in this. Sub-par food and ridiculously bad service. O.K. keep trying for the \"relaxing\" bit, pull down sheets to find hair in the bed - and lovely \"personal\" body hairs awaiting us throughout the bathroom. Very 80's style hotel designed in a way to let all voices and noises echo throughout. Such a disappointment - our \"quiet and relaxing\" weekend was cut short as we happily departed early and non-showered. Would not recommend this property to anyone, carpet install or not!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 22, 2005", "id": 4044492}, {"rating": 4.0, "title": "WONDERFUL STAY !", "text": "Oh yea, we had a patio room with a \"golf view\" this consisted of some manicured, cut grass and a broken screen that invited all bugs and pests right inside.", "helpfulness": 8, "user": "DTHBNY", "date": "February 19, 2004", "id": 1661781}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Just stayed at the Doral Arrowood for an overnight getaway with golf. The golf package that they offer is a pretty good deal. Would not have any other reason to stay there though. The rooms are very plain and not what are shown on the website. Those rooms are an additional charge and not worth it given the fact that the rest of the hotel is very out dated. I will say that the food is very good though and considering that lunch and breakfast buffet is included in the golf package made are trip worthwhile. The golf course is also fairly nice although only nine holes. They seemed a little unorgainized at the course but once we were out playing we enjoyed our game.", "title": "A bit outdated", "user": "LesandD", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 127973679}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "as I mentioned above...all was excellent there...with the exception of that VERY LOUD sound from above bathroom in room 119...lasted for one hour...8-9 P.M. maybe a garbage compactor..not sure....we should have been told about this before hand...and should have given a different room!!", "title": "mostly satisfied", "user": "jerry b", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127594627}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The location is excellent for driving from Boston and for getting into NY City.", "title": "Arrowwood resort", "user": "Shellee R", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127540416}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The staff is generally excellent.", "title": "I would expect more for the price and attitude", "helpfulness": 1, "user": "queenbeeIndiana", "date": "April 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127304812}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The exercise room is worth visiting with a full range of training equipment.", "title": "Close to home", "user": "Elsie R", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126565690}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 19, "average": 54, "very good": 93, "terrible": 12, "excellent": 162}, "aka": "Doral Arrowwood Hotel Rye Brook", "slim_ranking": 0.5, "description": "Doral Arrowwood is a 373 room hotel located in Westchester County, NY. The property offers conference and banquet facilities, award-winning dining and a range of activities including golf and tennis and racket sports. Indoor-outdoor pool and state-of-the-art sports center with spa services available."}