{"user_rating": 3.5, "review_count": 251, "name": "Dorsett Grand Subang Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Staying in a newer room makes all the difference. Brave a stay in the old wing and risk being trapped in a time warp, like it's 1984, with mold and old school fixtures giving you that authentic feel. This ex Sheraton property is in subang jaya and works well if you need to be in that area. Staff are well meaning but too oft slow to respond. But warm and friendly, nevertheless. Check out the lobby bar, a real retro treasure, totally enjoyed the girl-trio rework of Rihanna. They stop by your-table to introduce themselves after each set. The rooms in the new wing area clean, contemporary, connected - a nice find. And theckub floor is. Nice little sanctuary from the tour bus madness that happens downstairs most mornings. Overall, I recommend this if you need to stay in the area. Nice!", "title": "Refurbished, please!", "user": "Tris10", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 115975751}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed there last year and then again on July 2, 2011. The renovated rooms are great. We had a room on the fifteenth floor. The view was great, while a modest sized room, it was very cost with an intimate glass divide between the shower and the bed. Very romantic for that short getaway :) They are contemporary and well appointed rooms. Breakfast, like in most quality Asian hotels serves a nice spread of local and western fare. Highly recommended.", "title": "Huge difference", "helpfulness": 2, "user": "JNaresh", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115141955}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "though part of the hotel is still under renovation, that why the price is a great deal for a 5 star hotel. room is new n clean. furnitures n fittings r all new! n latest model! the breakfast is also great. it is a short drive tp sunway lagoon n shopping but on wkends, long jam.", "title": "still under renovation, new n clean rm at great price!", "helpfulness": 1, "user": "Janet069", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 114924577}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Excellent customer service. I did not have a bad day from my arrival up until the very last day. I was able to check in within 15 mins, and had been to my room and logged on to the internet within 30. At first I didn't know if the internet connection was wireless or thru cable, and I was supposed to have free Internet connection with my room but the website told me to select a payment option. However a quick call to Guest Services had it resolved and there were no unwanted charges when I checked out. As this trip was for business, I really appreciated that. It was fast, but it would have been better if the service was offered outright, at least for Superior rooms and the like.", "title": "Excellent!", "user": "lilytaiga", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114302583}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Rooms were very clean and made up everyday, the linens replaced by request. A TV offered Malay channels, CNN, Star World and Star Movies. There was a complimentary \"The Straits\" newspaper under the door every morning, which I could then take down to breakfast with me.", "title": "an absolute value for money experience", "user": "jayhira", "date": "June 3, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 111241896}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "The hotel room + the toilet totally néed a major upgrade. It looks old and find like in the year 90's.", "title": "Nothing remarkable special", "user": "ChesterTan", "date": "April 29, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 106040693}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Nothing special about it. The wifi is totally overcharge. Most hotel nowdays come with FREE wifi.", "title": "Excellent if you get a renovated room; location outside the city", "user": "msandman", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 105561072}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "The buffet I will said good one if you want to try the malaysia food. But need more variety. Limited choice.", "title": "The only hotel I visit when in Malaysia", "helpfulness": 3, "user": "rrodrigues53", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104759081}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I stayed here for a business conference and some of the reviews of the hotel made me a bit concerned. But I asked for a got a newly renovated room, which was very well appointed. It was furnished in handsome Malaysian variant on International Style, with clean lines, good lighting and workspace, and a sparkling clean, good-sized bathroom. The rooms are serviced in the morning and refreshed in the evening. WiFi worked well everywhere I went and cost about $20 a day. The public areas of the hotel are decorated in a fairly elaborate style. There are several restaurants with a wide range of cuisines, and the food in the restaurants (and for the conference breaks) was very good. At breakfast one could choose from buffets with Western, Japanese, Malaysian and Japanese foods, all of it fresh and nicely presented. The staff was helpful and competent. There's a nice outside terrace if you don't mind the heat.", "title": "Nice place to chill out and unwind", "helpfulness": 1, "user": "rajeshnaik21", "date": "January 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91795379}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "This is a former Sheraton property in the suburb of Subang Jaya, which was once the location of KL’s main airport. A new international airport was built about 30 miles south a few years ago, and while Subang Jaya has a business park and is still a busy place, the location is now a bit of a non-mans’ land between Kuala Lumpur and the airport. It’s a 20 minute, $7.50 taxi ride to Sentral Station, where you can get good public transportation via light rail/subway into the center of KL, thereby avoiding the city’s heavy traffic. If you don’t mind the location being outside the city, it’s a good property that will be even better once 100% of the rooms are renovated.", "title": "Very dated and not a 5 star by any standards", "user": "scan100", "date": "December 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 90794182}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "I'm sure tha tthe Grand Dorsett was a great property back in the day. It has nice marble tile, beautiful wood, fancy elevators, a nice pool area, good workout facility with modern machines, etc. The buffet breakfast was very nice with service that was cordial, but unattentive. The bed was actually comfortable for sleeping. That said, the property overall seems to have been neglected over the years and is currently in bad disrepair. It is clean, but worn. I tried two different suites - the second being somewhat better than the first - and found the carpets buckeled in both rooms, wallpaper sloughing off the walls, toilets that barely flush, shower heads that leak, drain covers that are not screwed into the floor of the shower, stains on the couch, no remote controls for the two televisions in the second room, paint splashes and overpaint around anything that has been repainted, and a light switch that didn't work in the first room. The second suite that I stayed in had a foul sewer stench in it one morning - it wasn't coming from the bathroom.", "title": "Grand Dorsett Needs Major Renovations", "helpfulness": 1, "user": "cobrandy", "date": "December 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 3.0}, "id": 89614605}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Room service was friendly, but the food was not very good in terms of presentation or flavor. I had the sea bass the first night and found the vegetables and the fish both to be overcooked - the vegetalbes mushy, the fish dry. The second night I had the shrimp egg rolls - they were bland and oily.", "title": "Nice hotel", "user": "MarianaMM", "date": "December 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 89589377}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The concierge desk was mostly useless and was unable to help with my simple request for a recommendation about where to go shopping.", "title": "Grand but dated Hotel", "user": "UncleHooi", "date": "October 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 84590535}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "They have free internet access - wireless and wired. However, I couldn't get the wired high-speed to work so I just used the wireless, which was pretty slow.", "title": "Service par Excellence!!", "helpfulness": 1, "user": "glitzygal", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 81558576}, {"rating": 1.0, "title": "5 stars? what a joke. This place is a dump!", "text": "I've recommended to my host that they not use this facility again until it has been renovated and I understand that the rooms on the top two floors are currently undergoing renovation so perhaps in 2011 there will be some better rooms to enjoy at this property.", "helpfulness": 1, "user": "CanadianVicitor", "date": "September 29, 2010", "id": 81547551}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "A close friend held his daughter's wedding at the Grand Selangor Ballroom, Grand Dorsett Subang on 19th September 2010. We were roped in to help in the final preparations for the big night and the whole troop checked in the morning of the 19th. All were swiftly and correctly assigned to their respective rooms. Between 9am to 5pm the bare Ballroom was swiftly transformed to a beautiful fairyland awaiting the arrival of the Prince and Princess in the evening. The Dorsett staff were quick and cheerful to attend to the minor details changes all throughout the day. All the anguish of anticipation evaporated when the final guest left smiling. The beautiful setting, sumptuous meal and disciplined service must have taken effect. Thank you, Datin Jasmine and her team for making it a wonderful occassion.", "title": "It was the right hotel to hold the Wedding Function.", "user": "alfiah", "date": "September 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81039282}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My family and I stayed a night at this hotel recently. We were part of a wedding group who had booked 20 or so rooms. When we checked in however we were informed that there would be a power cut from 2am to 7am the next day!! Also, we were given wrong and misleading information about the reasons and scope for the power cut, until we pressed the hotel repeatedly and learned the truth. After kicking up a ruckus for 3 hours, the hotel reversed their decision and informed us that there would be no power cut after all. Also, the hotel checked us into a Superior Room even though we had booked a Deluxe Room. We found this out when we noticed the small room size. Again, we had to kick up a fuss before the room was changed. All in all, the experience was a bad one and ruined the start of what was meant to be a joyous occasion. I certainly will never stay here again.", "title": "A Disaster!!", "user": "dbasha", "date": "August 29, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 77303939}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We went on a trip to Malaysia in June 2010 and stayed in this hotel for 3 days. The rooms were very good and comfortable. It was maintained properly on all the 3 days. The staffs were nice and friendly.", "title": "Comfortable hotel with friendly staffs.", "user": "alagesh_kumar", "date": "July 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 72516515}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "The buffet breakfast was good with a varity of dishes. We realy loved our stay at this place.", "title": "Good Hotel with VERY friendly staff, with cozy rooms.", "user": "JimmyToronto", "date": "June 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 68640182}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "It is a good hotel to be at away from downtown KL. It has excellent buffet breakfast and very comfortable rooms. The staff is very cooperative and extremely friendly.", "title": "It was excellent hotel with good ambience", "helpfulness": 1, "user": "TouristAhmedabad", "date": "June 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 68417739}], "location": {"country": "Malaysia", "continent": "Asia"}, "stars": 4, "variance": {"poor": 30, "average": 50, "very good": 107, "terrible": 12, "excellent": 52}, "aka": "Sheraton Subang Jaya", "slim_ranking": 0.125, "description": "Nestled in the heart of Subang Jaya, Grand Dorsett Subang offers opulence hotel guest rooms and suites in the city's most upscale entertainment hub, shopping district and tourist attraction. Located just 35 minutes from Kuala Lumpur International Airport, Low Cost Carrier Terminal and Sepang International Circuit, the hotel is just a 15-minute drive from Kuala Lumpur City Centre. Dining at Grand Dorsett Subang is an endless pleasurable affair with the vast international and local specialities available. For meeting planners and business travellers, the hotel is well-equipped with a full range of facilities and services to cater to every need."}