{"user_rating": 4.5, "review_count": 141, "name": "Dorset Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I brought my mom and two sisters to the Dorset Inn for lunch. It was so pleasant sitting outside the Inn. We received a warm welcome and excellent service. Each of our lunches were presented beautifully and had top quality meat and produce. Very impressed! I proud to call Dorset home. Thank you Dorset Inn staff. L.M.", "title": "Lunch", "user": "Lindial", "date": "July 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 134033590}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Lovely king size room with a room air conditioner that we were most grateful for as we were there during an unusual hot spell. A full breakfast served in the \"breakfast room\" is included in the room rate. Staff is most accomodating. We used a social network travel voucher that included a $50 dinner credit and were very pleased with the gourmet food, service and atmosphere. There are two rooms with comfortable seating near the lobby where you can sit and enjoy the afternoon lemonade or iced tea and cookies. Good selection of magazines, books and board games. Unfortunately, it was too hot to enjoy the hammock in the backyard. Easy drive to Manchester, VT where there is plenty of shopping and restaurants. No Verizon cell service so we learned to live without our phones for 2 nights - and found that we survived.", "title": "Enjoyable time at the charming Dorset Inn", "user": "iristraveler", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133396114}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed for 2 days using a living Social Voucher for a standard room. Staff is tremendously helpful, decor in the room was lovely and inviting.. Same with the bathroom. Loved the Subway tiles. Would suggest, due to space available in bath, that a couple shelves be put up to allow for storage of cosmetics, shave kit etc. We used the large baseboard to store these items. We ate in the Restaurant on our first night as we had tickets for the Dorset Theater. We were delighted with our dinner. Scrumptious!Great production at the theater. Something to add if you stay in the summer.", "title": "Lovely stay at the Dorset Inn", "helpfulness": 1, "user": "MoTroy", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133250830}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We sat outside in the Adirondack chairs before and after dinner on our second night. It was so relaxing. We would certainly return. Wonderful experience!", "title": "Delightful!", "helpfulness": 1, "user": "Kathi C", "date": "June 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 132852037}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "One of the finer dining locations in Southern Vermont, the Dorset Inn Restaurant boasts a sophistocated menu with a quiet, tasteful decor and superb flavors. My dining experiences at this delightful Inn have been consistently delicious and well presented; a treat for the eyes, as well as the palate. The wine list is extensive and the assorted desserts are heavenly. My favorite experience there was the Kentucky Derby gala, complete with Mint Juleps with proceeds donated to local charities.", "title": "exceeding my expectations", "user": "david k", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132740854}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We just returned from a delightful stay at the Inn. We were using discount coupon and didn't know what to expect( small room in back?) NO,we had a beautiful room up front with a beautiful window seat and windows the length of room. THankfully the rooms have air conditioners as it was record breaking heat, 97. The breakfasts, included, were delicious. Cookies and beverages in afternoon. We had dinner one night , swordfish cod, and it was very good. Everyone was very friendly, except ,maybe the bartender , but as far as an Inn experience goes it was great. Yes there is a difference with caliber of services and staff from high end N.Y or European hotels but charm and personal touch are what you find at these kinds of properties.A true New England experience!", "title": "Charming Inn", "helpfulness": 2, "user": "SuzanneWoodbridge-ct", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132592093}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The Inn is charming, but absolutely no modern conveniences, My issues more than theirs. No way to get ice for a relaxing drink in the room; no drinks unless the dining room is open, a Kuerig coffee pot in the downstairs sitting room, but no regular coffee; only fancy flavored ones. Being an early riser, difficult to wait until 8am before being able to dine for breakfast. Just wasn't comfortable for the working folks. Window air conditioners very noisy.", "title": "Quaint", "user": "USArmyMom22846", "date": "June 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 132186294}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I just spent our anniversary week-end at The Dorset Inn. It was pouring rain most of the week-end and we still had a great time. There is so much to see and do in southern Vermont, including a quick trip to The Vermont Country Store. The Inn itself is lovely, clean, and reminiscent of days long gone. The breakfast that comes with the price of a room or suite is fabulous. The restaurant in the inn is very, very good. An added plus is that in such a high end inn you can bring your dog! Had it not been pouring rain, we would have gone swimming in the nearby quarry, hiked some trails rather than shop at the Manchester outlet stores! Oh well, next time.", "title": "Wonderful Inn in a beautiful Vermont town", "user": "mw180", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131230000}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "All in all, The Dorset Inn is great and I recommend it highly.", "title": "positively delightful", "user": "David S", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131008772}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "we recently spent a positively delightful evening at the Dorset Inn. Suite was equipped with extremely comfortable bed, phenominal soaking/jacuzzi tub and nicely appointed sitting room.Dinner was excellent, bar convivial (bartendress knew her stuff). Breakfast on the front porch --delightful.Cathy and Lauren provide the finishing touches", "title": "Absolutely Wonderful!!!", "user": "Jessica S", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130181199}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The Dorset Inn is a well run establishment. Our room was top of the line with king sized bed, large HD TV, and jacuzzi tub. We arrived late, but were not rushed at dinner. Our service was professional. There were plenty of options, contrary to a prior review, and everything was excellent, including dessert. The wine list is extensive and VERY fairly priced. Breakfast in the morning (included in the price of the room) was very good as well.", "title": "Dorset Inn Gets Top Marks", "helpfulness": 1, "user": "royle", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136931498}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Dorset is a much better base than Manchester as it is laid back and what we like about Vermont.", "title": "Abominable service in restaurant", "helpfulness": 1, "user": "natasha g", "date": "August 8, 2012", "detail_rating": {"value": 2.0, "service": 1.0}, "id": 136563812}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Give this inn a try and you will be back again.", "title": "Very nice stay at the Dorset Inn", "helpfulness": 2, "user": "Ed_Kal99", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 136335244}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We are longtime residents of the area and have visited the restaurant many times. This past Sunday after a play we stopped in for a glass of wine with friends and wound up staying for dinner. Although the restaurant was very accommodating with respect to providing a table for an enlarged party (6 total), the lack of professionalism of the service staff was a huge disappointment considering the high prices. The bartender was gruff and unfriendly. The waitress got our food orders wrong, brought extra drinks not ordered, charged us for her mistakes and added gratuity for writing separate checks for different couples (3) in our party without advising us in advance. The food is average and the prices high so we won't be going back. There are better options a few miles down the road in Manchester.", "title": "Pretty place to stay.", "user": "Zisahmom", "date": "July 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134858738}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Just returned from a mid-week stay that we found on Groupon - two nights for the price of one.", "title": "Relaxing", "user": "LakeGeorge_NYHappy1", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134615023}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The Dorset Inn is amazing. So warm and cozy and the people are wonderful. We love the Tavern at Dorset Inn. Like the fact that you can split a meal. Most meals are too big for us and splitting works out great. The food is superb. Can't wait to go back. Thanks Dorset Inn.", "title": "FANTASTIC", "helpfulness": 1, "user": "Patricia C", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127800483}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I cannot say enough nice things about the Dorset Inn. Everything from the service, the food, the rooms, the atmosphere, the setting...just wonderful. I highly recommend this for couples and for families. This is a perfect getaway.", "title": "AMAZING!", "helpfulness": 1, "user": "pemora522", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127121058}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Charming inn located within a beautiful mountain setting. It was nice to relax by the fire in the den and read a book. The included breakfast was fantastic, and served in the sunny breakfast room. We ate at the inn's restaurant both nights and it was delicious! My only hesitation in not giving 5 stars is that our bed, a king, was actually 2 twin beds together. The slight gap between them was uncomfortable. The bed itself was also uncomfortable to me.", "title": "Relaxing escape", "user": "snochou", "date": "March 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 126088132}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We stayed in a beautifully-appointed two-bedroom suite. The living room with fireplace was wonderfully cosy, and the bathroom was enormous and very tastefully decorated, with both a shower and jacuzzi. The breakfast was memorable, with so many delicious, freshly prepared options that you could get exactly what you wanted. Many were locally sourced so we really felt like we were getting a taste of the best of Vermont. The staff was all very friendly, especially the bartender in the quaint tavern downstairs. We also had dinner, which was also freshly prepared and very tasty, finished off with the best apple crisp we've ever had. An incredibly romantic spot. You will not be disappointed!", "title": "Charming B&B earns its title as best in New England", "user": "cherie r", "date": "March 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126037480}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Love the Dorset Inn. Very cozy and comfortable. What you expect of an Inn in New England. Staff was very friendly. Highly recommend.", "title": "True Bed and Breakfast", "user": "irishyank721", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125718689}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 6, "very good": 25, "terrible": 5, "excellent": 102}, "aka": "Dorset Hotel", "slim_ranking": 0.428571428571, "description": "Gracious lodging, gourmet dining, fine wines & great spirits - all trademarks of Vermont's oldest continually operating inn. Nestled on the green in a picturesque Vermont village,The Dorset Inn has offered traditional New England Hospitality for more than 200 years. 25 uniquely appointed guest rooms & two room luxury suites featuring fireplaces & whirlpool bathrooms. The Wine Spectator awarded restaurant serves dinner nightly. A long time favorite with locals, the Tavern offers microbrew & unique beers, extensive single malt scotch & Irish whiskey list & wide array of cocktails & aperitifs. From the quiet getaway to the outdoor adventure vacation...skiing at Bromley & Stratton, shopping Manchester's designer outlets, hiking & biking on local trails, golfing, kayaking & canoeing, antiquing, perusing museums...all these activities and more are located within minutes of The Dorset Inn."}