{"user_rating": 4.0, "review_count": 989, "name": "Dorsett Mongkok Hong Kong", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed in the Cosmo Hotel for just one night. It was clean and comfortable with pleasant staff. Floor space was minimal but that is quite common in Hong Kong. The immediate neighbourhood was quite busy and most restaurants did not have English menus in the windows. If you are going to Hong Kong for the first time then I would recommend looking for a hotel on Hong Kong Island. But if you know your way around a little, this is a great choice.", "title": "Nice hotel", "user": "jiminorange", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 160551088}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Almost midnight check-in and the staff were ready to help us with whatever we needed. I found the staff nothing short of brilliant. Extremely friendly and heplful. I got rather ill the second day and had to go to hospital. The staff organised the taxi and which hospital to go. The breakfast buffet was huge. There was a wide variety of food to suit all cultures.", "title": "Cosmo, Mongkok. Value Plus.", "user": "Guy W", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160524541}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "If you are going to book a room I'd suggest paying a little extra and going for the Suite Air. Great sized room with an ensuite bathroom and a seperate sitting room. Large wardrobe and two TV's.", "title": "No complaint! Keep it up!", "helpfulness": 1, "user": "JinnieNg", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160517141}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "The hotel location is fantastic. A five minute walk to the Olympic MTR station and a ten to fifteen minute stroll to Nathan Rd and the ladies market. Lots of sidewalk style eateries and McDonalds directly across the road. By the far the best place for Western style food is just down Ivy St towards the Olympic station. Smarty Corner Pizza. They sell the best steaks and burgers I've ever had and the pizza was amazing. In fact we ate there the entire 10 days.", "title": "Nice boutique hotel in Mongkok", "helpfulness": 1, "user": "revuu_js", "date": "May 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 160442027}, {"rating": 4.0, "title": "Nice hotel with a great staff", "text": "Again, I can't thank the team at Cosmo enough for enhancing our stay in Hong Kong. To Eddy, Andrew and the rest of the guys and gals, Thank You.", "user": "pilotmikedds", "date": "May 11, 2013", "id": 160410104}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Have stayed at this hotel once before. Not much has changed, it is still a comfortable, friendly place. It is slightly out of the tourist area, but a free shuttle runs once and hour and will take you into the tourist area free of charge. You can check their web site for times and details. Check-in was fast and the staff friendly and helpful. The room is small, has a flat screen TV with some English channels. Wifi is also offered, don't know if it is included in all rates, mine was complimentary. There is tile and carpeting in the room, the carpet in my room was stained and could certainly use a good cleaning or replacement. There is also a Thai restaurant in the hotel. Air conditioning works great. There are 27 floors to this hotel, nice view from the higher floors. McDonalds across the street plus various food and markets in the area.", "title": "Nice hotel", "user": "yvr1", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 161131157}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed at the Cosmo twice in a 2 weeks period in April. The hotel is located in a semi-residential/local business area which made exploring the neighborhood a delight. We found many wonderful, cheap restaurants and bakeries in easy walking distance. Several small parks were close by. Across from the hotel was a large building that was an indoor market.", "title": "The gem of Kowloon", "user": "honuo64", "date": "May 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160913286}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The hotel itself supplied an hourly shuttle that had several drop off points for rapid transit and markets.", "title": "Great hospitality!", "user": "AMeow", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160694559}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The rooms, as other reviewers have noted are small but very well designed and clean. On our second stop there we opted for the suite and it was very comfortable. Check out the Cosmo website for pictures of the rooms. They don't exaggerate.", "title": "Clean and convenient", "user": "LeahKS06", "date": "May 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160570259}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "The hotel provides a full Chinese or American style breakfast in their Thai restaurant that is included with most rooms.", "title": "New hotel with nicely designed rooms.", "user": "rmnl", "date": "May 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 160563305}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Though located in Mongkok, the location isn't the prime as it's between 12-15 min walk away from the core Nathan road and Mongkok MTR station. However, the friendly and helpful staff made our stay very comfortable. The room is not big but efficiently design, well clean up and have the freshly feel probably because of the strictly implemented NO Smoking policy. We can often see some hotel guests standing in front of a ash stray bin located beside the hotel entrance. A big kowtow to the hotel's green policy.", "title": "Reasonable good location with very helpful and friendly staff", "helpfulness": 2, "user": "TravelcrazePat", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 160220297}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hourly shuttle provided by the hotel is an added points. The drivers are very polite and helpful when we asked for direction and info.", "title": "Good Experience", "helpfulness": 3, "user": "JRP298466", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160175921}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The surrounding are full of eateries, restaurants and convenient stores. Just directly opposite the hotel is a 24hrs Macdonald with Mccafe in it. Many small traditional eateries and convenient stores including two 7 Eleven stores around it. There are also a few Japanese food restaurants.", "title": "Fantastic staff and location", "helpfulness": 2, "user": "Jude B", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160142723}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Just turn left and a two minutes walk from the hotel entrance is a shopping mall call \"Kowloon Plaza\". In it are more stores, pasty shops, and an impressive Japanese restaurant. More Chinese restaurants and a supermarket on the second floor.", "title": "Well Done, Cosmo! You deserved it!", "user": "Ken Sheng W", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 160027097}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This hotel is definitely in a convenient location to stay. This is our first time here and we definitely be back again.", "title": "Convenient location and overall a pretty good stay", "user": "Livia W", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 160022048}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Although the hotel was fairly new and in a good location, the beds were way too small! My husband and I had our feet dangling off the queen size bed and we had to upgrade our room as we were in a shoebox but despite the room being bigger, the bed was still the same size. And I am about 172cm tall (so not overly tall). The girls at the desk were not helpful at all. When I asked about doing something for my husband's birthday, she told me to google it. The concierge on the other hand were fantastic - so helpful and friendly and gave us a good tip to eat at the Golden Sands which was fantastic. There is mcdonalds across the road which was good and a few bakeries, 7/11 stores and chemists which is handy. Would I stay at this hotel again? Probably not. But the area was really good as it gave us true Hong Kong culture and was close to the ladies market and dundas street and nathan road.", "title": "Good location but terrible reception service", "user": "Sophia P", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 160020267}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Interesting location on the edge of Mongkok. There is a shuttle bus but we took taxis which cost 2-3 dollars. The room was small but quite modern. Breakfast was ok but a bit expensive but there is a Macdonalds close by.", "title": "Friendly staff", "user": "AJM012", "date": "May 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 159961175}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The wifii was a bit slow. Had read some complaints about the elevator but there was only one time we had to wait.", "title": "Okay for a couple of nights", "user": "Palmc", "date": "May 7, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 159872775}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The staff work very hard to make sure that your stay was a success.", "title": "Good Location & Nice Stay!", "user": "tangotan7", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159790776}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The location may not be for everyone. If you are looking for Prada and Hermes stores this was not the place but you are within walking distance of The Ladies Market and a 3 dollar taxi ride gets you to a Prada store.", "title": "great service, helpful staff", "helpfulness": 1, "user": "Andrew B", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 159751422}], "location": {"country": "China", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 28, "average": 111, "very good": 490, "terrible": 10, "excellent": 350}, "aka": "Dorsett Mongkok Hong Kong ", "slim_ranking": 0.0994575045208, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Booking this hotel online to enjoy 100M Free WiFi in-room, flexible 24-hour check-in time and a full 24-hour stay! (for hotel official site booking only.This Mong Kok boutique hotel is 100% smoke-free with Ladies Market and Temple Street night market just 10-15 minutes’ walk away for an local shopping experience. Free daily shuttle to Mong Kok, Tsim Sha Tsui and West Kowloon available. 24-hr open fitness studio available. Cosmo Mongkok is a Green City Hotel award winner and a certified Green Globe Hotel."}