{"user_rating": 3.5, "review_count": 147, "name": "Doubletree Hotel Hartford - Bradley Airport", "reviews": [{"rating": 1.0, "title": "Have valuables in your car? Like feeling safe? Then don't bother.", "text": "I came here to relax with my girlfriend and to take in The Big E festival 20 minutes away. My car was broken into in the unsecured parking lot and my GPS unit and car stereo were stolen and they smashed my window. After calling the police who said that thefts happen in this parking lot all the time and he wasn't sure why they wouldn't install security cameras but was very helpful, I went to talk to the front desk, who simply brushed my issue to the side. After asking what could be done, the unfriendly and unhelpful general manager simply stated \"there is nothing we can do, having your valuables stolen is not an issue of ours or our customer service.\" We paid over $200 for two nights at their hotel only to have over $500 worth of electronics stolen and an attitude from the front desk. Needless to say I do not recommend this hotel...well unless you don't have a car or any valuables or like dealing with terrible customer service.", "user": "JohnBernardMartin", "date": "October 4, 2010", "id": 82120260}, {"rating": 4.0, "title": "Great Hotel to be bumped to!", "text": "Due to bad weather we were distressed to learn that we would have to stay overnight in Hartford. What a nice surprise to be brought over to the Doubletree. The staff at the front desk could not have been more accommodating and friendly. The warm Doubletree Cookie was just the beginning of a delightful evening. We at dinner and relaxed in their restaurant. Our meals were just like home cooking. I recommend the scallop dish and the steak. If we come back to the area we will definately stay here.", "user": "zickangel", "date": "July 15, 2010", "id": 71060979}, {"rating": 4.0, "title": "Great location Next to Bradley airport + I-91!", "text": "I found this hotel via priceline ($69) and found it to be a gem typical of Doubletree hotels. We flew into LaGuardia airport in NYC and drove up here on the way to NH. When we arrived really late, the front desk (who was a bit sleepy himself at 2:30 a.m.) had a warm cookie + our room key + reservation all set once we arrived to the front desk.", "user": "meh2", "date": "April 29, 2010", "id": 62761622}, {"rating": 3.0, "title": "An Okay Stay", "text": "The next morning @ 9:00 a.m. we were awoken by the cleaning staff in the hall talking loudly (walls were rather thin as other guests have indicated) and a car alarm going off outside. Keep this in mind that if you are looking for total silence at all hours, you might want to be aware of this when you choose your hotel. Even though we did not fly out of Bradley, it is very close and we did not hear a single jet engine go by all evening...", "user": "andpetros", "date": "April 21, 2010", "id": 62115480}, {"rating": 1.0, "title": "Only stay here if you don't need to park a car!", "text": "The hotel was nice and mostly clean. The room was an average hotel room. The food at a banquet for the large group was horrible. Would recommend eating in the restaurant rather than the food provided by DoubleTree.", "user": "travelingyalie", "date": "January 26, 2010", "id": 54438826}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "This property has had a revovation since the last time I stayed there. The room I was in was spacious, clean and comfortable. The restaurant food was very good, Breakfast was SUPER good. The rate was very fair. My children enjoyed the fact that the pool did not close early. Brand new gym equipment has been moved up by the restaurant (kind of an odd spot where people going to eat can see you working out), they invested in good equipment and free weights too. It was a very nice stay!", "title": "Nice Stay", "user": "daisy20071960", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91701082}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Old, Old, Old hotel - but !! - with a new lobby .", "title": "The best of a limited choice - bring ear plugs", "user": "PBRD", "date": "December 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 4.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 90636818}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "Staff are friendly (however due to franchise cuts are few to be found) = long waits for check in.", "title": "You Can Do Better", "user": "Matombo", "date": "December 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 90507684}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Rooms are OK, HOWEVER, the walls are paper thin - I could hear the guy coughing and snoring in the adjacent room.", "title": "a tad disappointed", "helpfulness": 1, "user": "santaferosie", "date": "November 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 88306989}, {"rating": 5.0, "title": "The \"Phoenix\" has risen from the ashes...", "text": "If you want free or discounted parking for BDL, then stay here, otherwise, there is not much else to recommend it. Either way, this is pretty much the only option.", "user": "A TripAdvisor user", "date": "October 17, 2010", "id": 83868956}, {"rating": 4.0, "title": "Excellent Service, Good Hotel", "text": "We had great service from the desk, maid service, housekeeping, and restaurant.", "user": "reggienewjersey", "date": "January 4, 2010", "id": 52604736}, {"rating": 3.0, "title": "If you like eavesdropping, you'll LOVE this hotel", "text": "Hotel was very friendly and provided good service at a decent price.", "user": "howden", "date": "May 19, 2009", "id": 30337236}, {"rating": 1.0, "title": "Just awful - Never again", "text": "I would stay there again with my family.", "user": "aspex", "date": "February 21, 2009", "id": 24889661}, {"rating": 1.0, "title": "Never again", "text": "Well, I am not looking to put down the staff, because they were all pleasant and helpful, but I don't think I've ever been in a hotel with thinner walls. Every conversation, phone call, TV,or..umm..body function was not hard to hear at all. Very distracting, although sometimes amusing, just not what I expected from a \"premium\" brand. Rooms are dated and although clean, not overly comfortable. The bathroom smelled like smoke at times ( coming from a different room since I dont think they seperate the floors or wings by smoking / non smoking) and water seeped onto the bathroom floor when my neighbor took a shower. Small fitness center, four people fill it.", "user": "MeriBeth", "date": "February 15, 2009", "id": 24600665}, {"rating": 1.0, "title": "Not good", "text": "Well, there is a Hampton Inn right nearby. Probably a better value.", "user": "FAMRAU", "date": "December 28, 2008", "id": 23049721}, {"rating": 4.0, "title": "Almost the best airport hotel", "text": "I liked the reviews on this hotel and so I booked it. It is close to BDL airport has a free shuttle and didnt charge extra for 2 weeks of parking. The cookies were awsome. It was every easy to get to, I slept well the bedding was awsome, pillows perfect. Staff was friendly and even gave me cookies for breakfast when checking out! Its on a main strip so you have fast food joints and chain resturants There is a resturant in the hotel along with a bar but we did not use them. I only have 2 complaints about this hotel 1) they are very \"green\" which is great but the water pressure in the shower was sooooo weak I could of showered faster with a glass of water!! I will not go back if this is not fixed. I spent more time in the shower trying to get clean then if I had normal water pressure. I DID NOT report this to house keeping because It was 5 am and I was leaving for my flight, what would they really do at that hour? 2) Also when I got home and checked my credit card they over charged me by $100+. My express check out recipt the morning of the flight was $132.99. I am waiting to get that resolved. I will stay at another double tree but the shower water has to work well. If you dont mind a trickle of a shower go for this hotel every thing else is great here!", "user": "vaderbarb", "date": "December 14, 2008", "id": 22731605}, {"rating": 5.0, "title": "Doubletree", "text": "The Doubletree has an airport shuttle to Bradley Intl. airport, and is also very close to both the airport and the nearest exit. It is obvious that this hotel has undergone major renovations as the hotel appears virtually brand new. The hotel is very well kept and clean. The staff went out of their way to make me feel comfortable and were very polite. I recieved the famous Doubletree cookie at checkin and was not disappointed. The \"Sweet Dreams\" bedding was of high quality and provided me an excellent nights sleep. One of the pillows on the bed was badly soiled. I called the front desk to tell them and a new pillow was delivered to my room in less than 5 minutes. The front desk and the houskeeper were both very apologetic. There are obvious upgrades throughout the hotel, for example the Wolfgang Puck in-room coffee and the Neutrogena bath amenities. The hotel has a restaurant in the lobby, it looked very attractive and decently priced, but I decided to eat at the Ruby Tuesdays that was located about a minute down the street. The indoor pool area was very nice with upgraded towels and chairs. The cleaness of the pool was satisfactory, nothing great. A small gym was located next to the pool and had brand new machines.", "user": "MHSW6", "date": "October 9, 2008", "id": 20760310}, {"rating": 3.0, "title": "Decent Stay, conviniently off highway/Airport", "text": "For approximately 100 dollars this hotel was a great find and I would return.", "user": "mcmug2002", "date": "February 5, 2008", "id": 13272987}, {"rating": 4.0, "title": "Liked it Lots", "text": "This Double Tree is conviniently located a few miles away from the Bradley Airport. Stayed there for 2 nights while on business trip in CT. Paid $130 a night + tax. Clean, nice facility with sufficient amenities. Met expectation of the Hilton/Double Tree chain.", "user": "ShowHorseFan", "date": "December 7, 2007", "id": 11296998}, {"rating": 3.0, "title": "Average hotel", "text": "Bed was very comfortable...bathroom was clean and relatively new. The hotel is conviniently located off the highway - however, there aren't too many restaurants (or even fast-food joints) near by, so dinning options are limited.", "user": "travelpatty", "date": "November 15, 2007", "id": 10841617}], "location": {}, "stars": 3.5, "variance": {"poor": 14, "average": 43, "very good": 46, "terrible": 16, "excellent": 28}, "aka": "Doubletree Bradley International Airport", "slim_ranking": 0.642857142857, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Doubletree Hotel Bradley International Airport is situated in the North Central region of Connecticut, approximately a mile from Bradley International Airport. Local attractions include the Big E, Hartford Civic Center, Mark Twain House, New England Air Museum, Six Flags New England, and the Springfield Civic Center. Hotel amenities include multilingual staff, laundry/valet service, baggage storage, gift shop, luggage hold, safe deposit box, room service, business center, fax/photocopy service, fitness room, and pool. Onsite dining is available in the Windsor Park Restaurant, while drinks can be had at Brewster's Pub. Guest rooms feature irons, ironing boards, coffeemakers, hairdryers, cable TVs, in-room movies, web mail, Nintendo video games, dual-line telephones, voicemail, and high-speed Internet access."}