{"user_rating": 4.0, "review_count": 314, "name": "DoubleTree by Hilton Golf Resort San Diego", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We enjoyed our stay. The staff was great and helpful. We received complimentary parking. Our room was clean and we were pleasantly surprised to receive complimentary water bottles and a snack box was waiting for us in our room when we arrived. My husband loved the cookies and when he asked for more the staff was glad to offer him more and he even got some some cookies when we checked out. Overall we were very satisfied with every aspect of this hotel.", "title": "We enjoyed our stay", "user": "Martha R", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157103114}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The room was large and spacious, clean and smelled great. The front desk attendant was very professional and helpful with the surrounding area. Parking was nice it was very close to our room. The Queen size bed was so comfortable that I got one of the best nights sleep in quite a while. Thanks to all of the staff there, you guys are great.", "title": "best hotel Ive stayed at in years. Ill be back for some golf.", "user": "wheelz762", "date": "March 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156048008}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I always stay here and I'm never disappointed! You don't need to be a golfer to enjoy the convenience of this resort. It's proximity to Downtown, the beaches, Little Italy, etc. give you the best bang for the buck & the staff are always friendly, welcoming & accommodating!", "title": "This Place Rocks!", "user": "William M", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155938900}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I love this place and will definitely be staying there again! Excellent fitness center including a sauna. Two pools, one for swimming laps which was great too. Tennis courts, golf course. It can't be beat. The only complaint is the internet connection sucks. Hopefully they will get rid of their current provider and offer true high speed internet to guests. Other than that, I would definitely recommend this place!", "title": "Great hotel, great staff!", "user": "Pliskin1999", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155530421}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Ok, so I didn't actually stay at this hotel; but a co-worker who works as a consultant for our company stays at this hotel when he is in town. He brings in the COOKIES for those of us who sit near him and I have fallen in love with the cookies! I found out that they give you a large, warm cookie in a cute little paper baggie for free when you check in.", "title": "Anthony @ the Front Desk is the BEST.. not to mention The COOKIE...", "user": "Christiane_L_09", "date": "March 21, 2013", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0}, "id": 155280329}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "On Saturday, April 20th, 2013 my family checked into this hotel with about 15 other families for a soccer tournament for a State Cup girls playoff. Upon arrival, Shaun was very helpful and courteous. The hotel was clean and the room was spacious and impressive. The girls (all teenagers), had to be on the fields but 7AM so the exit Sunday morning was brisk. My daughter sat on the bed to put her soccer gear on. We left and after the first game realized that she had left her iPhone on the bed. The phone even had her school ID card inside the cover of the phone.", "title": "BEWARE!!! THIEVES AMONG CLEANING STAFF", "helpfulness": 1, "user": "DashingRabbitPicture", "date": "April 26, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158859372}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We called and spoke to Shaun, who was very helpful and understanding. We asked them not to clean the room if possible until we could drive back down to the hotel. Upon arrival, the room had already been cleaned. It took 30 minutes to locate the cleaning staff supervisor, but they claimed the phone was not found. Later that day we found out that another girl left her iPad behind and they had the same experience.", "title": "wedding trip", "user": "Daniel G", "date": "April 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 158860017}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I called the General Manager, Anthony Shaffer who called back late in the day. He had a demeanor of \"well, that's hard to prove and tuff, but thanks for letting me know\" attitude. Upon calling Doubletree Hilton Corporate, they informed me that an incident report should have been offered with security investigating and a follow-up call within three days. No one from the actual hotel ever offered that, they simply wrote our name down on a piece of paper. I am a previous owner of a 30 room Inn. I understand the difficulties dealing with cleaning staff, but they should have offered an investigation at least.", "title": "Old style but comfortable", "user": "Leanne D", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158794109}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We brought a lot of business to the hotel from our group. It is a sad end to a great stay, when two players have 2 very expensive items stolen by cleaning staff. Evidently, our two players are not alone from this Trip Adviser Review: http://www.tripadvisor.com/ShowUserReviews-g60750-d217273-r5358219-DoubleTree_by_Hilton_Golf_Resort_San_Diego-San_Diego_California.html#CHECK_RATES_CONT", "title": "Can't think of one complaint", "user": "rltalley", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156926578}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I was pleased with my stay; staff very courtious and helpfull, I felt the \"Queen Size\" bed was small but ok. I only wish I had time to Take advantage of the Beautiful golf course on site. If in the immedoiate area i would probably stay again.", "title": "Ask to not be on bottom floor", "user": "Maureen R", "date": "April 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 157103108}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We found a perfect place to stay: The Doubletree San Diego Golf Resort!", "title": "Very good and nearly perfect!", "user": "Assan87", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161081467}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The architecure is beautiful! We felt good in a beautiful and quiet surrounding.", "title": "Great weekend getaway", "user": "superpal", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159961314}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Our Room was very nice, comfortable, large and clean...and very quiet.", "title": "Business Hotel that Welcomes Families on Weekends", "helpfulness": 1, "user": "Barry N", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160669598}, {"rating": 4.0, "title": "Good Alternative to Core San Diego Hotels", "text": "The staff was very friendly and helpful,so we decided to come back again at the end of our holidays.", "user": "A TripAdvisor user", "date": "May 7, 2013", "id": 160668841}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The hotel was one of the best places we stayed in California!", "title": "Excellent!", "user": "Venkat R", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160667807}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Room was very dirty and dated. Bathroom had hairs on floor, dirt on floor at entry. Outside walks and stairways were not clean. Tree trimming was going on all weekend on the grounds. There was considerable noise coming from the event center. Parking was difficult.", "title": "Hotel room", "user": "Robert H", "date": "May 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 160663858}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Choose the hotel based on price, every affordable. Thought I would have another typical business week, with not much to do after work, and missing being away from home. Surprise, surprise, room had a view of the golf course, simply amazing! Swam in the lap pool 3 afternoons, great facility, staff treated me like a top tier member of a prestigious country club. On a whim I decided to get a message, the staff did a great job coordinating the message, and the experience was utterly amazing, not only was the message wonderful, but I also got good tips for restaurants to try, and place to visit. I didn’t get a chance to play golf, but it’s on the list after my message on the next visit!! See you in San Diego!!!", "title": "Treasure found!", "user": "Keith H", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159253970}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We only where their one night and we don't golf ........but it was a great place........and the price was very good.........we went to the animal park and this place was very close.......the room was huge........must have been made as something other than a hotel/motel (out side access) most rooms did not have a golf view...........we would stay again, no question. and the golf restaurant was very good also.............", "title": "Nice stay", "user": "FLATLINE13", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158987781}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Yes, getting greeted with a cookie was nice, but to have to pay for PARKING !!! The resort could use a little updating, the rooms were large and did have flat screen TV's but the tile and tub were OLD. Beds were very comfy and loved all the pillows. Didn't like that you had to pay for Wi-FI either, most upscale hotels include both parking and internet in their room prices. Didn't eat at the restaurants but did golf there. The golfing was OK, some bare spots in the fairways but the staff in the pro shop were just rude. Not sure we would go back....", "title": "Don't Like to be Nickeled and Dimed !!", "user": "lanzie99", "date": "April 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158893958}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "I just flew in early in the morning from the Pacific NW and started playing golf at the Doubletree at 11 am and was finished at 7:30 pm. This was a last minute trip and I did not reserved a hotel room for the night. I went to the desk and asked attendant (Sean) for the best rate and he provided me a decent rate and I said thank you and walked away. I came back after dropping off my clubs and asked to use business center and Sean was very accomodating. I found a less expensive rate at the Doubletree in Del Mar and asked Sean for directions. He asked what rate I saw on line and then he matched it. Sean assigned me a great room that was quiet and clean. This is a good Hotel and has a decent golf course. Thanks Sean", "title": "Last minute booking", "user": "LuckyTiger", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158862817}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 18, "average": 68, "very good": 95, "terrible": 15, "excellent": 118}, "aka": "Doubletree By Hilton Golf Resort San Diego Hotel", "slim_ranking": 0.362962962963, "description": "Just north of downtown San Diego and the International Airport, our resort sits on 130 acres lined with beautiful trees and flowers. Enjoy a day of golf on our lush green course managed by Troon Golf Management. We are within walking distance to over 100 restaurants and shops and are close to The San Diego Zoo's Wild Animal Park and popular North County Fair Shopping Center. Experience our welcoming staff and signature Doubletree Chocolate Chip Cookies."}