{"user_rating": 4.0, "review_count": 1562, "name": "DoubleTree by Hilton Hotel Grand Key Resort - Key West", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This is an OK Doubletree--not as nice as most that I have stayed at, but would stay here again. We chose this hotel because they had complimentary pick up from the airport & we didn't want to spend the extra $$ to rent a car. Plus parking at the hotels it cost an extra $10 to $15 per day and finding a park downtown is not an easy thing to do and will cost you $$. Once you are downtown, rent a bike or glorified golfcart! On the hour from 8am to 11pm this hotel offers shuttle service to 3 different stops in Key West, which was a PLUS! We walked everywhere once we were dropped off at the Conch Republic Seafood Restaurant. I don't advise going in JULY, I live in the south I am used to hot and humid conditions----HOWEVER, not used to Hotter than 4 Hells! Just Kidding! Just be sure to take a towel with you for wiping sweat!!", "title": "DON'T GO TO KEY WEST IN JULY!", "helpfulness": 2, "user": "NAUTICL1", "date": "July 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 71370090}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Gateway to hotel very impressive, as was reception. The room was lovely and spacious with a huge balcony with a table and four chairs. This overlooked the Tikki Bar immediatly beneath it and therefore we couldn't see the pool at all.", "title": "Sounds more 'Grand' than it is.", "user": "CAROLE3", "date": "July 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71205971}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Although located quite a way out from Key West there is a free shuttle bus which runs on the hour to and from Key West. This is very useful but we found that Key West was quite 'driveable' and so only used the shuttle bus once.", "title": "GREAT RESORT", "user": "UPENN_CLASSof1999", "date": "July 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 70919053}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had room service at dinner time and the service and food was very good.", "title": "Great stay", "user": "A_vacationer_10", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 70342544}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Angel at reception was particularly helpful.", "title": "Above and Beyond", "user": "DrFran05", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70031641}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Everything from arrival to departure was great at this Doubletree. Don't be turned off by the distance from the Duval St. action because the shuttle was amazingly well done. It departs every hour for the other end of the island and will drop you off close to anywhere you might want to go that isn\"t one of the two regular dropoff/pickup points.", "title": "Wonderful time in Paradise", "helpfulness": 1, "user": "CSturgeo", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151488848}, {"rating": 1.0, "stay_parameters": "Stayed February 2013", "text": "Our room was ready when we arrived at 12:15 and we hopped on the 1:00PM shuttle to start our 5 night/6day stay.", "title": "Old & Dirty! I do not recommend!", "helpfulness": 1, "user": "L1ljo", "date": "February 5, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 151437810}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "One our first night we wanted to make popcorn and asked if there was a microwave we could use the concierge said. \"You don't have one in the room. We'll get you one right away and we had barely gotten in the room when it arrived to join our little fridge and coffee maker. She also arranged for our bike rental on another day that was nearly as prompt!", "title": "Good stay", "helpfulness": 1, "user": "doshivk", "date": "February 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 151431766}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The bathroom was loaded with lots of great fluffly towels and they have special ones for you at the beautiful pool.", "title": "friendly atmosphere - good vodoo drinks", "user": "JOSEFINA051", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151403354}, {"rating": 4.0, "title": "Stay u will enjoy and be surprised", "text": "We had the buffet breakfast on all but one morning and liked the variety of offerings.We also had a small supper on the pool deck one night that was very nice. They let us split a meal since we knew we could not eat a large dinner. On our departure day we also ate there for a very late lunch since we knew there would be no time for dinner on our flight back home.", "helpfulness": 1, "user": "Rosemary L", "date": "February 2, 2013", "id": 151255580}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Our room was lovely. The balcony overlooked the back parking lot.... nice and quiet.... just how we like it. Bed was comfortable. We decided last minute to stay an extra day in order to spend more time with our daughter and they were able to accomodate us. We had the breakfast buffet a couple times and it was good. The location was perfect for us as our daughter's apartment was next door and we prefer to staying on the quieter end of the island ..... away from Duval St.", "title": "Very nice.", "user": "KarenSMichigan", "date": "August 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77731228}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband and I drove to Key West from the Tampa area for a 3 day romantic getaway for my 28th birthday. I had no idea where to stay so of course I read several reviews on various hotels and bed & breakfasts before choosing the Doubletree. To be honest, we wanted something nice but not super expensive and close to everything but not right on Duval. When I saw that the Doubletree offered free shuttle service, that was one of the main deciding factors for me. Not to mention the pictures of the awesome pool with cabanas too. Everything about this hotel was great....we actually arrived around 12:30pm and was able to check into our room early. We got a balcony room that overlooked the amazing pool and of course the chocolate chip cookie was to die for LOL. The shuttle service runs every hour on the hour and is definitely a $$ saver. We purchased the hotel through Expedia and it included a buffet breakfast which was good, not great but good.", "title": "Will be back!!", "helpfulness": 2, "user": "Jessicavcortes", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77585990}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The price of the food and drinks that we ordered by the pool were a little pricey, but that's to be expected at most hotels. Parking was free, which was a plus. The only negative, if you want to call it that, would be for the shuttle to run more often that once every hour. There were a couple of times where if we weren't our rude NY selves, we wouldn't have gotten on the shuttle the first time around :-) Overall, our experience at the Doubletree couldn't have been better and I would definitely recommend this hotel to anyone who is going to Key West!!!", "title": "Beautiful hotel, great cool, awesome pool, but...", "helpfulness": 1, "user": "ripcurled1", "date": "August 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76809414}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My fiance and I stayed here for 8 days back in June and we loved it. The room was spectacular, the pool scene (we loved Mike) was beautiful, and the bus service to downtown Key West was very convenient.", "title": "Expensive but worth it!", "user": "rwj25", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 73516131}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The \"...but\" in the title has to do with the fact that my fiance bought an engraved $5.00 seashell, for her niece, from a vendor downtown and the name had to be specially engraved and delivered to the hotel. When we checked out, the shell had not arrived yet, so the hotel offered to send the shell to us once it arrived at the hotel. Amazingly, we received the shell a few weeks later from the hotel with an almost $21.00 shipping charge on my fiance's credit card. Nothing like offering to send something to you, then charging an insane amount for shipping a $5.00 item.", "title": "starting to show some signs of wanting something better", "helpfulness": 1, "user": "NjFuzzy", "date": "July 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 71798202}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "I have stayed here for two years in a row and plan on returning again this year. The hotel os beautiful and very accomadating. The bartenders, Billy and Eric are service with a smile and informative of things to do. Mike, the pool man, was very attentive with ice water and towels and on the weekends they have a pool waitress. There was a mix up with my room both years but I was taken care of in a timely manner. The only thing that bothers me is they charge $10 a night for guest having a vehicle. I would understand if they have very limited parking but they have a good size lot. They never asked me when checking in if I had a car and never mentioned an extra charge but on my exiting bill they included a chatge for every day I was there. I did not have a car for my whole stay. Spies in parking lot!! And they allow the condos next door to use their facillty. They use the pool and some parents don't mind their kids very well. I think they charge enough for staying there without charging the extra $10 a day, afterall the condo pool guest do not pay and get full service of towels and bathrooms!", "title": "My choice for last two years...", "user": "neicbomb", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 99810238}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The Doubletree is a very pretty hotel, all pale yellows and blues, a nice aquarium, and a lovely pool area. Our room was very nice. The Neutrogena SPF 45 facial moisturizer came in handy. All of the staff members were very nice. I've read some not great reviews about the restaurant...but really, dinner there was good, especially the grilled mahi mahi. I didn't like the conch chowder, but I am an East Coast chowder girl. The fresh fruit was good, and the waitstaff was friendly. Breakfast was just ok....go to Blue Heaven instead.", "title": "Great place to stay...but for the waiting", "user": "kjcd34", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 99724408}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The elevator was SUPER SLOW. I would have taken the stairs, but the stairs next to the elevator didn't go up. And the hotel is far from town, so the hotel provides a shuttle. That is nice, but the shuttle does not exactly stick to a schedule, and I spent a lot of time standing around waiting. It's better in the evening, since taxis arrive at the hotel regularly. I can't imagine renting a car in Key West, as there is nowhere to park.", "title": "Cant wait to return!", "user": "DDSUN", "date": "March 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99434793}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Though I really liked the hotel, I wouldn't stay there again.", "title": "Highly recommended!", "user": "anmbroden", "date": "March 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99065638}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "It took us 4 trips to Key West to finally find the perfect place to stay but we found it at the Doubletree Grand Key Resort during our visit Feb 25 to March 1 2011. So many places just check you in and then forget about you, not so here where the term Resort has been well earned. Joseph at the front desk checked us in smoothly, Billy at the pool bar diligently kept us happy and Mike at the pool was very attentive to all. The shuttle drivers were always friendly and very accommodating. Upon our shuttle return the shuttle the front door was always opened for us and accompanied by a warm greeting. No effort was spared to make us feel welcome and provide a conducive environment for relaxation – exactly what we came to Key West for. The grounds are very well maintained, the pool and outside dining area in particular. The pool was warm and the Hot Tub was indeed hot. Our room (242) had a great view overlooking the pool area and it was quiet, we never heard any noise from other rooms and this place was booked full on our weekend. I have never written a Hotel review before but I felt compelled to write this one because it was our best Hotel experience ever. Thank you very much Doubletree Grand Key Resort and we cannot wait to return next year.", "title": "Far from town but shuttle makes it doable", "user": "KEDBoston", "date": "March 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 98952905}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Resort style, so great pool area, nice lobby, easy parking. Confortable room, even staying in a double queen room as I was only with my wife. Constructions around the pool to protect from the sun are very charming and perfect to take a nap.", "title": "Nice experience, great location", "user": "brazfm", "date": "February 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 151238711}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Breakfast is not included, but you can choose an american or continental buffet, for a fair charge.", "title": "Great location, Very nice grounds, Close to the beach", "helpfulness": 1, "user": "BrianMinneapolis_MN", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151179083}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We paid extra and got the junior suite which includes a large balcony that has a table, two rocking chairs and a chaise lounge over looking the pool area. The room itself was larger than average, and included a separate bath area and also has a refrigerator. The staff were all fantastic and friendly. There is a complimentary shuttle that brings you to Duval St and runs all day untl 11pm. We will definately be back soon!", "title": "Nice Place", "user": "Jim M", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151105697}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed here on a business trip. Got to my room and heard a buzzing noise from the A/C. Not just noise but it actually vibrated the room. Went back to check in and told James (who also checked me in) about the problem. He said he would call maintenance so I am thinking great just drove 5 hours after a day of work and now I have to wait till some guy fixes the A/C. But, too my surprise after James called maintenance he truned back to me and said here is another room if you want to see if it is better for you. I tried to give him my other room key and he said \"no just keep them in case you want to try it after maintenance is done.\" Well I checked out the second room and it was great so returned the other keys to James.", "title": "Good Experience", "helpfulness": 1, "user": "RoadTrip60", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 151055855}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Later that evening I ran into James and not only did he recognize me, he asked if everything was still ok. Shuttle service to downtown was great.", "title": "Excellent Stay", "user": "MsMagMan", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150978891}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I am a Hilton Honors Diamond member, and I am writing this review WHILE STILL AT THIS HOTEL. That's how bad this place is.", "title": "Terrible management = terrible experience", "helpfulness": 3, "user": "TVSpy", "date": "March 27, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 101813056}, {"rating": 2.0, "stay_parameters": "Stayed March 2011", "text": "I cashed 160,000 HH points for a four-day stay. I should have just donated those points to charity.", "title": "Worst Hilton product", "user": "julesnync", "date": "March 22, 2011", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 101183019}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Having stayed here before, this hotel is simply in need of some real management. There's an overall lack of attention to detail -- to say nothing of the overall apathy of the staff -- COMPLETELY unworthy of the Doubletree brand.", "title": "Nothing special", "helpfulness": 2, "user": "springbanktraveller", "date": "March 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 100399634}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "In short, here are the problems I have. A flippant young male registration associate tells me my room isn't ready when we arrive. Granted, we are early. But I stand at the counter while the power flicker on and off. Another associate -- a female, the most professional of the bunch -- gets her computer up and running in no time. My unfortunate associate has no such luck.", "title": "Not Very Good", "helpfulness": 1, "user": "kawidd", "date": "March 14, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 100142985}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I leave the property, come back a couple of hours later, and am given keys to a cityview room, though I requested a poolview room -- an upgrade for which I'd agreed to pay. In all my years as a HH Diamond member, never once has a property failed to grant my request when utilizing points. Until now.", "title": "Great Hotel!!!!", "user": "seh1985", "date": "March 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 100076379}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Below is a letter I wrote to the hotel's general manager:", "title": "Customer Service is Top Notch!", "user": "akuntrygirl", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68436421}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Dear Mr. Knowles:", "title": "Horrible Experience - The", "helpfulness": 1, "user": "ushirl", "date": "June 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 66881650}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "I recently had the pleasure of staying at the Doubletree Grand Key Resort to attend a friend's wedding. Admittedly, I am a tough nut to crack because I began my professional career in hospitality, working in five-star properties. Consequently, my customer service standards are extremely high; however, I have to say that the hospitality and kindness displayed by your Guest Services Manager Kevin Hill deserves nothing less than the highest praise possible.", "title": "Great Vacation thanks to Doubletree!", "user": "uptownnyc", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66653176}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "During an impromptu bridal shower, our gathering became a little noisy. Mr. Hill very respectfully explained the situation to us and offered to move us to another location so that the celebration of the bride could continue without bothering other guests. Obviously, Mr. Hill could have approached the situation with a strong-arm but in his wisdom, kindness and patience he fostered a spirit of cooperation that produced a result conducive to all involved – not an easy feat when dealing with dueling priorities.", "title": "Very nice hotel- other side of islane", "user": "reichspot", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 66637690}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Again, I don’t even feel that my words adequately express our gratitude. Mr. Hill is a warm, generous, kind, gracious and patient man. What special experiences we had thanks to Mr. Hill’s hospitality. You can rest assured that I will spread the good news that customer service is indeed alive in Key West Florida - all you have to do is visit the Doubletree Grand Key West Resort!", "title": "Excellent hotel/value", "user": "sharron24", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 66436666}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "stayed here\\2 nights while travelling round florida. The hotel is quite a way out of the centre but worth the travel. Hotel itself is beautifull, hot cookies given on arrival. Rooms are everything you expect from a top class hotel. pool area and bar are also excellent. The hotel runs a a free bus to key west centre use this as parking is a nightmare. make sure you go to mallory square to watch the sunset its a must do.", "title": "its a beauty", "user": "harty_11", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98947493}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Service and accommodations were wonderful. Staff was friendly and very helpful. Shuttle bus to the shopping areas and beaches available. Can't wait to go back!", "title": "Wonderful, relaxed atmosphere", "user": "luv2flyNy", "date": "March 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 98831110}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We were very happy with this hotel. It is by the aiport so it is not that close to the Duval Street activities. But they had a complimentary shuttle that came every hour (like clock work) to take you to various spots in Key West. Staff was great and hotel was very accommodating. Also, had a complimentary shuttle that takes you to the airport whenever you needed it. Would definitely go back to this hotel the next time we stay in KW.", "title": "Great place to stay", "user": "TBEAR10", "date": "March 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 98792445}, {"rating": 5.0, "title": "Great hotel~~very impressed!", "text": "My husband, daughter and I stayed at this hotel for one night. We wish we could have stayed longer. The room was lovely with a balcony overlooking the pool. The breakfast buffet was delicious with very good service for coffee and juice. It was a quick 10 minute ride to the hot spots in town. Forgot my camera battery in the room when we left. When I discovered this, I called the hotel and they immediately retrieved it and had it waiting at the front desk just minutes after I called. We would definately stay at this hotel again.", "user": "pattycake5353", "date": "February 24, 2011", "id": 97874187}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Loved the room, the grounds and lobby but since the Hotel is not on the beaten track with very little dining out there, the restaurant needs an overhaul. Good food but not enough healthy choices, terrible service, especially the hostesses. Never felt welcome and slow wait staff and kitchen. We ate there twice and not impressed.", "title": "Nice but need a better restaurant manager", "user": "SunsetMotelPA", "date": "February 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 97222853}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My wife and I stayed here almost six years ago when we got engaged. At the time we thought it was a pretty nice place. This was our first time back since then and we were expecting the same quality place. It was not what we had hoped for. This time around we both felt strongly that the hotel and grounds were fairly dirty. In fact, in six years the rooms looked exactly the same. I don't expect hotels to update their properties every year but everything looked the same right down to the comforters. Overall we just felt that it was a bit worn and dated. We also felt the first time when we stayed there that the property was a 4 star hotel but now it's somewhere between a 2 and 3 star property. On the bright side, most of the staff were very friendly and helpful. There was one guy at lunch that waited on us and it was excruciatingly slow. He also looked at us like he was a deer in headlights. Perhaps it was the language barrier, I don't know. One of the biggest turnoffs for us was a guy, who seemed liked a local, that would show up at the pool area bar every day and would undress into a thong. But it wasn't just a thong, it looked like a woman's thong. It was rather disgusting. I even heard other guests talking about him. It made me want to avoid the pool and pool bar altogether. Our other issue with the pool was the fact that locals would show up to use the pool. I understand that some hotels may charge locals a fee for a swim pass. However, in my opinion, hotel pools are for guests only. If locals want to swim, they should join a public pool. I pay to stay at the hotel. But it wasn't just that they were locals, some of the clientele at the hotel/pool just seemed dirty and ill-mannered. Sleeping wise, it got even worse. not only were there a couple power outages in the middle of the night which woke us up because the room felt like an oven but at 5 a.m. one morning there was a fire drill. We were NOT happy. I'm all for safety but 5 a.m.??? Ridiculous. I think the hotel is great for older folks that want to stay far away from Duval St. and only occasionally go there for a dinner before retiring to the hotel to go to bed at 9 p.m. But for a couple like us that likes to spend hours walking around town, shopping, having drinks/dinner, and taking in the culture, it's way too far. We rented bikes and it took us almost 30 minutes to ride the 4.6 miles into town from the Doubletree. The shuttle is fine but because the hotel is so far, we literally had to plan when we were coming/going and couldn't just head into town for a while and stop back. It was all or nothing. We rented a house one year near Duval with its own pool and we decided that it's the best option. We can swim for an hour, go out to lunch, stop back and swim again, and then shower and go out to dinner. At the Doubletree, we had to plan to be out for the day/night. There are other things like the elevator that seemed to have its own mind, but I think that covers it. We won't stay here again. We realize that for a little bit more money, renting a small 1-2 bedroom house in Old Town is the best option for our interests.", "title": "No Resort, 3 Star At Best", "user": "ardmoreflyer", "date": "April 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 102448678}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This hotel is very close to the Key West airport; not close to the downtown bars and Sunset celebration, but they have a hotel shuttle that takes guests to Mallory Square and another drop off every hour on the hour. Beats trying to find parking. The cost of parking in the Mallory Square area is expensive in the hotel garages. Hilton Honor members get free parking at the hotel as well as free buffet breakfast every morning. We had free Wi-Fi in the room. Room was very nice with fridge and small balcony.", "title": "Nice Hotel - beautiful facility - kid friendly", "helpfulness": 1, "user": "Gator91", "date": "March 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 102096264}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "We had a very relaxing stay at the resort the staff was very friendly would diffently stay here again love the cookies too !", "title": "Awesome place to stay great staff", "user": "Hoosiergirl51", "date": "March 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 102085582}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I just came back last week from staying here, and had the most AMAZING time! Every single person that worked there, that I came in contact with, was so friendly, helpful, and personable! Anything we needed, they helped us with immediately! Not to mention, anytime you even walked by the counter, they offered you many hot chocolate chip cookies! :-) I wanted to sign up for a massage, and wasn't comfortable with a man doing it, so I told them. They didn't have a woman working that day, but they said that they would take care of it for me, and ended up finding a woman to come in just for me! The food was amazing also! It was wonderful to be sitting by the pool and have a friendly woman asking if you wanted anything, and be able to order it, and have it brought right to you. They had nice \"tropical\" like live music playing by the pool, which made it so relaxing! Everything in the rooms were very clean, and the beds were comfortable! Nice big flat screen tv too! I seriously have nothing bad to say...the staff was WONDERFUL, the free shuttle service was great, pool/hot tub was clean and perfect temperature, overall, I had a perfect 4 night stay there! I would LOVE to go back again someday!!!!", "title": "WONDERFUL Experience!!", "user": "jessjenkayben", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102056003}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "My family and I visit Key West often, and everytime we go we stay at the double tree. We love going there. The staff is always friendly and professional. We love going in the pool and having a few drinks and enjoying the stay. I always recommend this hotel to my friends and family.", "title": "Great hotel cant wait to return!", "user": "Eriknleah25", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102035744}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I usually stay in Boutique Hotels or B & B's when I visit Key West, but this resort was great. A shuttle is available every hour on the hour. Great, accommodating staff from the pool bartender \"Vivianne, to the sweet housekeeper. The hotel was very clean and had all the up to date luxuries. I will definitely stay there again.", "title": "Perfect place to stay!!", "user": "Amy C", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150699052}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I have been here a few times and although not a Hide away in full resort, the Facility is outsanding. Service is good and friendly, and there is a Shuttle to the Duval Street area ( Main area of Key West) once an hour from 08:00 till 23:00. It is prompt and if full another shuttle is right behind it during busy times. I would advice that you avoid rooms 161-157 on every floor, The laundry room is on the first floor Directly under 257, and the vibration of the dryers and washers is loud and VERY annoying. Your view is a Roof of the service building. The Pool is amazing and the Beach that you can see the Best sunrise anywhere right across the street. Airport is nearby and plenty of Parking", "title": "Great Property and Service", "user": "WolfTravler", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150677458}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We checked in and the shuttle was just getitng ready to head downtown at 7 pm. The staff held the shuttle and took our bags to our room, allowing us to leave the car in short term parking up front until we got back. The pool is nice, but the real attraction is the lovely beach just a lovely walk down the road.", "title": "Great staff, quiet location, lovely shuttle driver", "user": "sipesowoman", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 150633916}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We recently needed to spend a weekend in Key West while attending the half marathon. The hotel was away from the beaten downtown path, but the hourly free shuttle is great to avoid the parking woes downtown. The check in was fast and efficient. The desk staff both knowledgable and courteous and yes those warm delicious cookies. The restaurant was ok, with a limited evening menu. We stayed in one evening and went out the other. The pool,area is clean and well laid out, open early and late. The elevators were slow so we used the stairs often. Don't stay on the first floor near the housekeeping, it is noisy and lots of talking. We were on the 3rd floor and it was both quiet and easy to get too. One pleasant note. We never opened the front door, once, the door/bellman were always there and with a smile. Little touches like fresh coffee in the lobby in the morning was pleasing as was the lemon water in the afternoon. Will stay again.", "title": "Beautiful, Quiet Resort", "helpfulness": 1, "user": "FloridaBC", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150608571}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "I recently stayed there over the long holiday weekend. I thought their prices were a little high, but now feel it was all worth it. The property was beautiful and near the path to walk to town. The staff was welcoming and helpful. They all appeared very well trained. The shuttle was very convenient to get to and from town. My 7am flight got changed till the evening. I called the hotel and they welcomed me back. The shuttle came and picked me up. The front desk gave me a new set of keys. After check out they held my bags and I was able to use the pool. The airlines offered me to stay an extra day, but it would have to be at the hotel of their choice. At that point Doubletree felt like home and I didn't want to have to stay anywhere else. If I ever come back I will be staying there again.", "title": "Felt Like Home", "user": "Megan C", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150548792}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at the double tree for 5 nights and we loved it.This is a very clean place to stay.when i saw that they excepted pets i was worried that it wouldn't be clean,our room was spotless!!The beds and pillows are very comfortable.we ate the breakfast buffet almost every day it was just ok for \"the price\", we had dinner there as well \"good burger\"!They include a shuttle service down to duval st every hour that was great,very friendly staff! I would not hesitate to stay here again.", "title": "great place to stay.", "user": "John661", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150977725}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Everyone who works there is very helpful. Special thanks to Angel for hecking us in. Our room wasn't ready, but he went and looked for us when it was.", "title": "Nice place to stay", "user": "Amy F", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150936878}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Our room overlooked the pool, it had a nice size balcony to hang out on. The only thing was the bathroom could be updated.", "title": "We will return", "helpfulness": 1, "user": "beckaroo8", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150894091}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The breakfast buffet had plenty of choices.", "title": "GOOD COMEBACK", "helpfulness": 1, "user": "Arnold1936", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150871874}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "The shuttle into town was very handy, one of the drivers informed us about Key West with trivia questions.", "title": "Very impressive hotel, great dining value on site, below average location, uncomfortable bed.", "helpfulness": 2, "user": "Arne L", "date": "January 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 150800384}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "My mother and I traveled here for a girl's weekend away. The front desk could have used a little more warmth upon our arrival, we felt as though we were an inconvenience to the deskwoman as we checked in. The room we were given also needed additional housekeeping. We noticed trash still in wastebaskets, int he fridge, and under the bed, as well as mildew in the shower and a dirty fridge/kitchen area. When we called down, the night manager, Keith, was very helpful, taking pictures and addressing our concerns. We were relocated a few doors down and found the same mildew in the shower, but the room was in better condition. My mother is a Hilton diamond member, and we were getting an upgrade the following day, so we decided the room was acceptable for the evening. The following day, our brunch server, Ansanbek, made our morning! Even though it was a buffet breakfast, he went out of his way to get us everything we needed. He was courteous and polite, and always there when a plate needed to be removed or a glass refilled. We also received wonderful service from our bellman Fausto when we relocated to the upgraded room. He was patient as we finished packing and cheerfully loaded each piece of luggage with care. Our new room was fabulous! Very well cleaned and with a wonderful view of the pool. In all, a little hospitality goes a long way. Keith, Ansanbek, and Fausto turned some negative situations into wonderful ones.", "title": "Wonderful with a few exceptions", "user": "mariesgrdn", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 69580364}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "wow! the review b4 this says alot and so right. we live in nc and after a long drive to southern FL we took a rest from driving and went down to key west as a day &1/2 trip a couple days later. we figured we would check to see if we could at least get some info on the area, because after all it was only 1150am, and not all their guests from the night b4 had checked out. to our surprise, not only were they incredibly helpful on the area, but allowed us to go ahead and check in, not to mention we were handed wonderful warm cookies.", "title": "WOW!", "helpfulness": 1, "user": "creekbrat", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69401691}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "the next day, we had a great breakfast(and service) and we had to check out, but our service did not end there. we were allowed to leave our vehicle in the parking lot, while we went down to take a snorkeling/dolphin activity, we were also still allowed to use their shuttle and to top it off when we came back from snorkeling to get our car, we were allowed to use their \"changing\"room which also had a shower and supplies in it.......that was WONDERFUL! it was great not to have to find somewhere fast food to eat dinner or to drive 4 hours in wet suits. the place was awesome......only thing that could possibly make it better is if our room had a view of the water, but who cares, all the rest way surpassed what i was expecting.", "title": "would stay again without a doubt!!!!", "user": "BillPortCarbonPa_", "date": "June 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69222306}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "My wife and I celebrated 20 yrs together at this hotel/resort and we couldn't have been any happier! First of all, the staff, from the shuttle drivers to the front desk manager to the caretaker out at the pool were 2nd to none. The breakfast served in the lobby/resturaunt area was fantastic, a little advice( when you book your trip ask for the bed and breakfast deal, we saved 90 bucks) great way to start your day!! Great drinks at the Gumbo Limbo Tiki bar, a little pricy but you are on vacation, what the hell!! Room was very clean and spacious, slept great . Shuttle service saved us about 250 to 300 in cab fare and was always on time, drivers were informative about best places to eat. Overall I would like to say that if your coming to Key West stay here,you'll enjoy you stay!!!", "title": "A great hotel!", "user": "ShannonST", "date": "June 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68822493}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This is a great hotel. Even before we got there, the concierge Debbie emailed me with suggestions of different things to do. The staff was amazing. We took our puppy and I worried the room we stayed in might be dirty since it was a \"pet\" room, but it was wonderfully clean. The pool was also awesome. I would highly recommend this hotel. We will be staying there the next time we go to Key West. There is a pet fee and parking fee, but they offer discounts to Florida residents which include free parking.", "title": "The staff resents the Gringos", "user": "travelsmyth", "date": "June 26, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 68776936}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 76, "average": 183, "very good": 528, "terrible": 49, "excellent": 726}, "aka": "Doubletree Grand Key Hotel Key West", "slim_ranking": 0.425, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 3.5}}