{"user_rating": 3.5, "review_count": 251, "name": "DoubleTree by Hilton Hotel Norwalk", "reviews": [{"rating": 5.0, "title": "awesome newly renovated hotel", "text": "Before I entered the building I was greeted by a friendly face eager to help me. From there the Front Desk staff went above and beyond their call of duty. Although the restaurant needs some work overall service was great and food was excellent. The new decor compliments the newly renovated hotel. Under new management they all go out of their way to show they take great pride in their hotel. I recommend this hotel to anyone looking for a full service amenities and treatment beyond expected.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 20, 2005", "id": 3927267}, {"rating": 4.0, "stay_parameters": "Stayed September 2004, traveled on business", "text": "This newly renovated hotel recently reopened for business. The renovation was extensive as almost everything is new. Rooms contain the new Hilton \"Sweet Dreams\" beds which are very comfortable. Free wireless internet is available in all rooms. The hotel is located in a nice area with lots of restaurants within walking distance and a Costco nextdoor. The facility is very nice and gets high marks. Where improvement is needed is the front desk staff. Upon check in the scene was highly disorganizd on the verge of chaos. More attention should be given to the customer rather than the internal squabble between the front desk staff and managers. Overall a good option in Norwalk.", "title": "New Norwalk Option With Lots of Potential", "helpfulness": 4, "user": "winstoda", "date": "September 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 2.0}, "id": 3925013}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "...and there's not a lot to choose from. I grew up in this town and stay here when visiting family. Based on that - it's a great refuge - although I'm a little bummed they tore down the classic '50 Carvel stand across the street and replaced it with a bank.", "title": "Hey, It's Norwalk...", "helpfulness": 6, "user": "BeachChair", "date": "July 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5467642}, {"rating": 4.0, "title": "Like a 4-star hotel but cheaper", "text": "They honored our request in every way - quiet adjoining rooms on the North side, upper floor, crib, fridge. Check-in was smooth & friendly at 9PM.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 19, 2006", "id": 5360864}, {"rating": 2.0, "title": "Beautiful hotel, horrible service", "text": "Some tips when staying here. Request a room on the Post Road side, as it's quieter than the side facing I-95. Park in the structure on the 2nd level and walk right into the lobby. It's closer than parking in the lot.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 12, 2006", "id": 5335850}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "They did a very nice job with the renovation. All but the shower tiles were new - too bad - cuz now the shower tiles really stick out as needing replacing. There's only so much age almond colored caulk can mask. Nice amenities though: clock radio you can plug your iPod into, one of those bowed shower rods, flat screen TV, wireless, etc.", "title": "Good deal, needs work", "helpfulness": 7, "user": "Lorraine777", "date": "February 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 4445621}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "Never used the resturant - we shopped locally and had a fridge delivered to the room for $15/week. Kids liked the daily breakfast picnic. We thought the pool was just fine - not luxurous - but this isn't a resort.", "title": "awesome hotel", "helpfulness": 6, "user": "TravelingFUNMT", "date": "December 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4229700}], "location": {"country": "United States", "city": "Norwalk"}, "stars": 3.5, "variance": {"poor": 29, "average": 44, "very good": 85, "terrible": 18, "excellent": 75}, "aka": "Doubletree - Norwalk Hotel Norwalk", "slim_ranking": 0.428571428571}