{"user_rating": 4.0, "review_count": 213, "name": "Doubletree Hotel Boston/Westborough", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is a very nice hotel. Upon checking in, the man was extremely friendly, and made a point to say hello each day we were there. I got a very good price on priceline, which made it even better. The only complaints I have are that housekeeping did not do a very good job, the bartender was very rude to me, and the 2nd floor hallway was sweltering hot. Our room was clearly not vacuumed very well the 5 days that we were there. They did not replace tissues or toilet paper on one day, and they didn't clean the bathroom floor the entire time we were there. The coffee and condiments were not replaced, nor were the drinking glasses. There were 4 of us in the room, and everyday we had to ask for an extra towel because we were only provided with 3. The housekeeper couldn't understand what we were saying, and it was fairly frustrating. I don't know if the A/C was broken in the hallway on the 2nd floor, but it was really hot. One evening I went down to the bar to get a glass of wine. The bartender was busy talking with 2 other employees, and seemed irritated that I was \"bothering\" him. I ordered a $10 glass of cheap zinfandel; no thank you, no have a nice evening, nothing. I should have pulled that tip out of the glass, but I didn't. The pool here was very nice, and the lifeguard was friendly.", "title": "Nice hotel, but they do need to review housekeeping and staff ...", "user": "Ercokat", "date": "July 15, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 5.0, "service": 2.0}, "id": 115397430}, {"rating": 2.0, "title": "$10 for wireless internet... unbelievable", "text": "This hotel charges for wireless internet. Beware. At most other hotels I've stayed, it's free, and it's free to the hotel, but they tack on $10 to an already expensive room. It is insulting.", "user": "Travel4587", "date": "July 1, 2011", "id": 114948441}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "This is the best hotel I have stayed in so far (in my quest to find the perfect business hotel). I have been staying in other locaitons/hotels because the only thing I do not like about this hotel is the location (industrial park setting with nothing around it). If you don't have time to \"tour\" the area/eat out, this is your place. The hotel is very clean and every room I have stayed in has been very quiet (can't hear neighbors next door).", "title": "Best business hotel (for what's available in area)", "user": "CStewy", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113613352}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Even if I had not snagged this hotel on Priceline for an incredibly good rate, I would still give this Doubletree the highest of ratings. I walked into a sparkling lobby, was checked in efficiently (and presented with the warm signature chocolate chip cookie) and spent the night in a comfortable room. Shower was great and top of the line toiletries were provided. The location off a major highway makes it also convenient to Boston or Worcester. Highly recommended!", "title": "One of the Best Experiences in a Chain Hotel I've Ever Had!", "user": "We'reReady!!", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110301116}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "I spent this past weekend at the Double Tree. My son played in a hockey tournament in Marlboro. It is my second time in two years at this location. The staff is great. The front desk staff was very welcoming. Having a life guard on duty was a bonus. She was great with the kids and tried to connect with all patrons. She did a nice job. The kids enjoyed the activities arranged by the hotel staff. (Movies, knee hockey room, street hockey and basketball in the parking lot.) Another big hit was the all you can eat breakfast. This is one of the best I have had.", "title": "A great deal for a group.", "user": "jtjtc", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103582296}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "the hotel was ok...nothing special but clean and friendly. This was our first time staying at a Hilton property (usually Marriot people). We booked here because there was no there availability in the area. While the room was acceptable, we felt nickled and dimed about ammenites-$9.95 per day PER COMPUTER for internet-Really?? no microwave or room fridge. Def. won't be looking at Hilton's next time.", "title": "Nickled and dimed at every turn", "helpfulness": 1, "user": "byrdbrain33", "date": "March 13, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 99985427}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I have over 2 Million Doubletree points (Hilton). This is by far the best staff. Front desk is on the ball, they have a greeter in the lobby and they are happy to be at the Doubletree. Iike it when they come out from behind the desk. They have great smiles from the shuttle driver to the checkin folks.", "title": "Easy to find, quiet rooms fab staff!", "user": "Kevin2Mil", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98766385}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Stayed two nights on Mon and Tues Dec 27-28 for two Phish concerts in nearby Worcester. Great staff and housekeeping!! Very easy to get to downtown Worcester and back, figure 15-20 minutes each way. Overall an excellent stay and location!! Nice bed, tv, and pillows. Small room and small bathroom is my only complaint. Considering the price I paid on Priceline.com I really can't complain. In other words thanks Doubletree!! We'll be back if we ever visit Worcester again!!", "title": "Very Nice hotel and stay!! ****", "user": "IH8BOSTON", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91764016}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "What a property. Traveling as much as I have, this hotel is outstanding.....in every sense of the word. From the front desk staff to the cleanliness of the rooms and public areas. Very well done! Gotta love the cookies!!", "title": "Wow - Spectacular!", "user": "LtKendrick", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91050721}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "All of the staff at the Doubletree were beyond pleasant, greeting you with a smile and asking how your day was. I had the opportunity to eat in the lounge each evening and was made to feel like family. Thank you to Rick and the rest of the crew there for making me feel at home.", "title": "The people here really Get It!", "user": "sagan16", "date": "November 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86160204}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stopped here on our way north since it's convenient to 495, and we chose this hotel since we got a great rate on Hotwire. I am a Hilton Honors member, but since we booked through a third party we didn't get any of the usual perks. No problem with that since we knew that going in, but wifi was $10/day for each device--we thought all of them would be covered with the one rate. Kind of a pain. My husband ended up using his laptop in the lobby, where wifi is free. We had a long drive and were looking forward to using the indoor pool when we arrived at 9:30, but it was closed for maintenance. We asked if we could at least use the hot tub, and we were given special permission to do that. Management should follow the posted hours (pool was supposed to be open until 10 PM). The desk staff were very courteous. Rooms were large and beds were comfortable. The AC was noisy and kept going on and off through the night-luckily I used earplugs, but my husband didn't and woke up a lot. Bathroom was small. Breakfast was not included and we thought it was pretty pricey, so we ended up eating elsewhere. If we are in the area again, I would probably choose to go to the Hampton Inn in Marlborough. The Hampton includes free wifi (for every device!) and breakfast, and the rooms are just as nice, so the money we saved through the Hotwire rate at the Doubletree was spent on internet and breakfast, making it a wash.", "title": "Nice hotel, but a few problems", "helpfulness": 1, "user": "StJohnFan", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 118264796}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "During a business visit to the area, we were put up in the Doubletree Westborough. Doubletree, being a Hilton property, is known as being a nice hotel. This Doubletree, while not bad, just wasn't quite as fancy as some others I've stayed in previously. A little on the runned-down side (and I've stayed in a lot of Hilton hotels), we felt it could use some sprucing up.", "title": "Average for Doubletree - but not bad for rural area.", "user": "gjscraftygirl", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 118262035}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The area of Westborough seemed to be pretty rural, and there is no restaurants that we could see within walking distance. The Doubletree though, does great on providing a nice restaurant with good food. In fact, the food was VERY good! The breakfast buffet provided everything from your usual eggs, sausage and hashbrowns to oatmeal, fruit, and even lox, bagels and cream cheese! You can even have your own omelet made to order! The restaurant for lunch and dinner provides you a varying menu for reasonable prices.", "title": "Great breakfast buffet", "helpfulness": 1, "user": "Hockeydad35", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 118031135}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Business may bring us back to this location - and we would stay again. Just be aware that you're a good 45 minutes from Boston itself. (Our business had us in Westborough, but we did require a trip into Boston as well.) A rental car would be the most economical so that you're not depending on shuttles as we did. If you need a good shuttle, from Boston/Logan airport, we recommend Knight's Limousine/Van service.", "title": "Nice, but overpriced", "helpfulness": 2, "user": "albgardis", "date": "September 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 117912673}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Not sure how it happened, maybe because we were part of 3 hockey teams from the same organization staying there, but we only paid $109 a night and were given complimentary breakfasts. The breakfast buffet truly was spectacular with an omelet station, lots of cut up fresh fruit, smoked salmon, and all of the other usual breakfast items.", "title": "Clean and Comfortable", "user": "nannya", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117904618}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Beautiful, clean and chic. The staff was amazing and took care of our special needs quickly and cheerfully. I didn't want to leave. I do believe this is the BEST breakfast buffet of any restaurant I have been to (and that's saying a lot). There was a wide selection of high quality food with a cook on board to do eggs, fresh, any style. Plus, unlike so many hotels there is plenty of room to mill around. You must understand...this was a complimentary breakfast for us. I actually WANTED to come down...usually I avoid them like the plague and often take food up to the room.", "title": "Beautiful, clean and chic. Outstanding buffet breakfast.", "user": "basketcaz", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117154766}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed there December 3 to December 5. Hotels complimentary cookies are very good.", "title": "Nice Hotel", "user": "biswadeb", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116966741}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Hotel staffs are vey helpful. Meeting rooms are up to the mark. Rooma are cleaned. We had awonderful stay.", "title": "Excellent Restaurant", "user": "Shagadelic", "date": "August 17, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116870726}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I stayed here for one night on business and was impressed with the hotel restaurant. For convenience I eat at a lot of hotel restaurants while traveling and really do not expect anything other than airplane food quality. The Doubletree was an exception. I had the seafood special and it was exceptional. I will definitely eat here again upon my return.", "title": "Pleasant business hotel with attentive service", "user": "usuallyhappytravels", "date": "August 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116449319}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My only complaints are that the guest room I stayed in “339” needs to have its carpet shampooed. After taking off my socks at the end of the night they were solid black from walking on the carpet in this hotel room. My other complaint is that the guestroom soap bars smell like roasted garlic. Change them to something like fruit or lavender. The positive room experience is the shower with great water pressure and no cheap water-saving head you see in a lot of hotels now.", "title": "nice but some problems", "user": "tazsarak", "date": "August 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 116385003}], "location": {"country": "United States", "city": "Westborough"}, "stars": 3.5, "variance": {"poor": 11, "average": 36, "very good": 85, "terrible": 5, "excellent": 76}, "aka": "Doubletree Hotel Boston Westborough", "slim_ranking": 0.25}