{"user_rating": 4.0, "review_count": 1030, "name": "DoubleTree by Hilton London - West End", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Our Guest Double Room was terrible. Very small with double bed crammed up against a wall in an alcove, the only way in and out of bed was to clamber over each other. Furnishings were awful, it was like staying in an office, no curtains just a venetian blind and drawers that looked like filing cabinets. It was a special occasion for us and the room was a big disappointment. Don't stay there, the hotel also misrepresents itself with its photos on its website, because the Guest Double Room is nothing like what we were given.", "title": "Worst double room I have ever come across", "helpfulness": 2, "user": "mvane", "date": "February 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 125247127}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Excellent location with friendly service. Room was small but very comfortable nonetheless and the location, service and breakfast more than make up for it. Warm cookies on arrival - luxury!", "title": "Weekend Break - theatre trip", "user": "BigSigh56", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125233369}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Checked out yesterday after a two-week business trip. Overall an excellent experience - room was lovely, clean and though it was small, excellent use was made of the space. (I had a bar, small table for dining, desk and large closet in one room, and it still felt comfortable!) Fabulous location, easy commutes from Holborn Station (your nearest tube stop). Breakfast was included in our room rate, so each morning started with selections from a lovely little buffet downstairs (have the orange juice, avoid the coffee!). If you have a day off, i suggest wandering over to the British Museum (5 minutes away on foot).", "title": "A Comfy Home Away From Home", "helpfulness": 1, "user": "freshmonkey", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 125219885}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Downsides: The beds aren't terrible, but I certainly can't say I loved them after a two week stay. They charge for Internet use, which can be purchased in 1, 2 or 24 hour blocks, but the sign-in process is lengthy and involves ever-changing codes.", "title": "Disappointing", "user": "Psy2k", "date": "February 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 125084895}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Expensive hotel for what you get (£160+VAT).", "title": "Poor plumbing and small rooms", "user": "stapleford", "date": "February 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 125048588}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We checked in at 6am after a 22 hour flight and were given a room straight away ! It was great to have a nap and a shower before starting our day otherwise we would have had to wait until 2pm check in ! Standard rooms are really small and a bit of a challenge for two people to move about together , but the executive rooms are very spacious so if you can splash out to get one of these . They are also at the back of the building so are very quiet as they are not on the main road . This hotel is very close to Covent garden and the west end is within walking distance and Holborn tube station being a 5 min walk away the whole of London is at your door step . There is even a self serve launrdry in the street behind the hotel .Having stayed in 12 hotels in London I can say that this is by far the best for location and price . There are lots of dinner choices within walking distance especially a great Lebanese opposite Holborn tube station . The hotel also offers a great breakfast . All together a great experience .", "title": "Great location", "user": "floss44", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139429351}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed here about two weeks ago. The room itself was small but adequate for two people. The beds were very comfortable though and bathroom was a decent size compared to the rest of the room. It was a quiet hotel, the staff was very nice and their conceirge was always ready with an answer. The hotel also has a great location. A tesco right next door for any late night needs, Costa for morning coffee and the British Museum right down the road. The holborn underground is about a five minute walk away and it took us about fifteen minutes to get to the theater. I would have to complain about their charge for wi-fi. With what we spent on the room, I would think the wi-fi would be free. But since it wasn't, I'd just go to Costa, enjoy the coffee and catch up on e-mails with their free wi-fi.", "title": "Not what you'd expect when you see the word Hilton", "helpfulness": 2, "user": "Lauren C", "date": "September 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 139123217}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Stayed in this hotel a couple of times on business during 2012. For a London hotel it is well equipped, rooms are nice, food okay, executive lounge okay. Can be a bit hit or miss depending on who you are dealing with some staff are v good some a tad vacant!", "title": "Not too shabby!", "helpfulness": 9, "user": "Gurnip", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139092359}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "It is close to a tube station, and is well located if you need to be close to e.g. certain theatres, covent garden - there are worse hotels in London to stay in!", "title": "A Family sight seeing trip to London with our Daughter and our disabled son", "helpfulness": 5, "user": "Beccy I", "date": "September 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 139078252}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "A Hilton Honours Diamond Customer on a familty sight seeing trip with a 1yr old and a disabled child, so we opted for a 2 bed apartment We checked in on the 28th August we got there at 1.30 which was early to check in, but was told they were servicing the room and would be ready for check in at 3pm. Room still wasn't ready at 3 pm so we went to find somewhere to eat as our children would need to be fed soon.", "title": "Perfect for us !", "helpfulness": 1, "user": "thehappycouple2012", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138819652}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I stayed on business for 3 nights. The hotel has had a recent referb and it looks good. I particuarly liked the bar area in the evening. - decor , lighting, etc I had the bar food all 3 nights as this was both excellent and convenient. Very friendly staff - from the welcome cookie to the bar. The rooms are not huge but very nicely set out with fittings and design touches you expect from this Hotel brand. Location is great for the under ground and actually on a nice day, if you enjoy a walk, you can stroll down to the Thames. I found it convenient for a quick visit to the British Museum. A nice place and I will be back.", "title": "Good London base", "user": "186332Phil", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139907054}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Booked it via a cheap and cheerful website for a discount price. Was not expecting the hotel to then accomodate my request for an early check in! However, even though the hotel was maxed out with tourist and paralympic visitors they could not have been more helpful. warm cookies whilst we waited for a room to be sorted early for us.", "title": "Quality chain hotel with the personal touch", "helpfulness": 2, "user": "DoodahLoodah", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139835232}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Beds are super comfy, bathroom facilities excellent and even though its London the rooms are spacious. Very grateful for the gentle air conditioning as it was a hot night!", "title": "Standard and location very good", "helpfulness": 1, "user": "holsforall", "date": "September 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139717526}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Breakfast was varied and very fresh and the serving staff excellent.", "title": "Excellent hotel made special by the staff with lots of personal touches.", "helpfulness": 3, "user": "Dodge84", "date": "September 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 139705479}, {"rating": 4.0, "title": "high chairs in the \"executive\" lounge", "text": "Nice London hotels are never chep but this one was definately worth the price.", "user": "A TripAdvisor user", "date": "September 5, 2012", "id": 139448254}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Always enjoy going to any Hilton - this one was no different apart from one thing of which there will before later.", "title": "Lovely hotel - poor bar staff", "user": "stockportsaint1985", "date": "February 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124825190}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "As a Hilton Gold member we were upgraded to an executive room which also gave us use of the executive lounge. This was excellent as was the warm cookies on check-in. The staff on reception was great and the room was excellent.", "title": "Excellent quality hotel at a very reasonable rate", "user": "Alex S", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124774509}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "The down-side to all this was the bar. It appeared to be poorly stocked and the bar tender was not great. We wern't able to get any food although admittedly it was just after 11 pm, and when I asked for some peanuts it took them 25 mins. As for the bar-tender, he did not know that a Kir Royale was a cocktail, he didn't know it was on their menu and he didn't.have any cassis. The bar also did not have and Jack Daniels or Amaretto. I find this very strange for a central London hotel. I also did not appreciate the barman gesturing with his thumb at me to go to someone else as he was on his mobile phone.", "title": "Poor", "user": "Peanutbut", "date": "February 17, 2012", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 124733303}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Having said all that everything else about the hotel was lovely. I just wish they could sort the bar out.", "title": "Good Price for A Central Locaton", "user": "TurkeyBurger", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124651708}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The Doubletree did very well from the moment I arrived to the moment I left. Comfortable, friendly, everything worked as it should and the rate was fantastic. Highly recommended for central London.", "title": "Perfect location", "user": "EUTraveller", "date": "February 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124586100}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We booked an \"apartment\" (one bedroom suite). The bedroom isn't actually a bedroom, but a loft - so there was no privacy for the adults away from the offspring, which was the whole point of paying for a one bedroom suite. That was disappointment #1 of many.", "title": "Not sure I'd stay again unless I got an amazing deal", "user": "TracieKnits", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 138801103}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We had thought we booked a king bed through the Hilton website. What we got was a double bed. The upstairs bedroom was very hot, and when we went to turn on the air conditioner, we found the controls were broken. we turned on the fan and tried the downstairs thermostat -- also broken. There were no sheets or pillows for the sofabed for our son. There were only two towels for three guests. Tried reporting all of this to the front desk, but after telling the woman about the sofabed and pillows, she pretty much hung up on me and I didn't get a chance to tell her about the thermostats. I figured since it was cool temps outside, we'd be fine, and we had theatre tickets so we had to run. Boy was I wrong. It was a freakin' sauna in that bedroom when we got back. I opened the windows and got a little relief, but between the tiny bed and heat, I did not get much sleep. I tried going downstairs to sleep on the sofabed with my 11 year old, but it was an extremely uncomfortable sofabed and I couldn't fall asleep. To compound matters, there are no blinds on the huge ceiling windows of the bedroom, so at 6:30am, I was wide away in an extremely brightly lit bedroom. The apartment was in really bad shape all around, with broken knobs and handles, and scraped up cabinets.", "title": "Great hotel in Bloomsbury", "helpfulness": 1, "user": "4nniebago", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138764951}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I went to the front desk to complain, and they kindly upgraded us to the two bedroom apartment - I think it was all they had available. There was a lot more space in the two bedroom apartment, which was nice, and it was in generally better condition. We had enough towels for the three of us this time. The thermostat in the smaller (single) bedroom as broken, just like the other apartment. In the upstairs bathroom, I opened a door that had no lock on it, thinking it was a closet -- but it was a door that seemed to lead to the bathroom of the apartment next door. I was a bit disconcerted that there was no lock on this door. That could present a threat to personal safety.", "title": "Couldn't Fault It!", "user": "Holiday-Lover81", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138760758}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The in-room coffee provided was instant. Really? that's a huge step down from the Nespresso machine at the other London hotel we stayed at. The Executive Lounge was okay. The eggs and coffee were terrible, but the pastries, bread and cereal were good, and our son loved the little 5oz cans of pepsi. Upon checkin, we got vouchers for free wifi because we had booked an apartment in the executive portion of the hotel.", "title": "Excellent location - Very new and modern", "helpfulness": 1, "user": "tamacita", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138715858}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel was very conveniently located to the tube, St Pancras, the British Museum, two Starbucks, a pret-a-manger and great souvenir shops.", "title": "Fees on everything", "helpfulness": 2, "user": "Mark T", "date": "August 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 138517767}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Just like the Doubletrees we've stayed in all over the US, but with London sized rooms. Very friendly staff, very good breakfasts, and just a few minutes walk from Holborn tube station. The rooms are very nicely finished, clean bathrooms (with good shower pressure - not always a given in London!), and really comfortable beds! But it is London, so expect a room where the double bed is up against the wall. It's not as small as some we've stayed in though!", "title": "Excellent service, friendly staff", "user": "GHJr", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 124560087}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "And good \"little things\", like a light in the closet, an ironing board and iron, a room safe, big fluffy towels, and the room's \"little secret\"...the tea/coffee maker and biscuits are in the top drawer of the bureau! (found it as we were checking out!)", "title": "Typical business hotel", "user": "Cop_This", "date": "February 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124497977}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The hotel doesn't have that \"well-used\" finish that several of the other London hotels we've stayed in have (chipped paint in hallways from the service carts, worn carpets, a genteel faded glory...) Everything looks new and well finished.", "title": "Nice room, good service", "user": "Emma-183", "date": "February 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124478466}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Would we stay there again? Absolutely!", "title": "Poor for a major city hotel", "user": "Gems-Dad", "date": "February 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 124465690}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Nothing special. Pretty arrogant staff. Little annoyances like having to pay £15 for a bit of wifi in your room. Breakfast average. Very small room. In fact so small bedside tables to put a drink of water on were not even fitted.", "title": "Convenient location and comfortable rooms", "user": "nsl115", "date": "February 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124432158}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I stayed here some months ago and had a much better room than the one this week. And it isn't exactly cheap!", "title": "Hit & Miss", "helpfulness": 1, "user": "KCS", "date": "September 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 140577479}, {"rating": 4.0, "title": "Saved by the reception staff", "text": "The room this time has furniture which looks like it is 30 years old (though functional it seems out of place in an expensive hotel).", "helpfulness": 2, "user": "Jenny H", "date": "September 17, 2012", "id": 140531590}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We are on the 1st floor at the back and there are cheap blinds that are not properly set up so you can't open them. I rolled them up and stuck them in the handles of the windows so I can see daylight. As I am spending time working in the room I didn't want to be devoid of daylight all day. Also, the blinds only keep some daylight out so it is quite light in the room early in the morning when I still wanted darkness.", "title": "Below average", "helpfulness": 2, "user": "apb_1982", "date": "September 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 140480027}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Small room", "title": "Spending the night with bugs", "helpfulness": 2, "user": "HansM1959", "date": "September 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 140315371}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Paid 15GBP for wifi - more and more hotels are giving it for free and that is what I expect. Take the TV away and give me wifi instead!", "title": "Great Location...Pretentious Staff & Tiny Rooms. Stay Away!", "helpfulness": 2, "user": "FLworldtraveler2012", "date": "September 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 140154625}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "There has been a renovation in recent years I think and the room we had was nice enough. A separate entrance area then a cosy bedroom.", "title": "Good quality central hotel", "helpfulness": 2, "user": "KCS", "date": "March 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125541643}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Lots of space to put stuff away and settle in so were not tripping up over things.", "title": "Excellent for us!", "helpfulness": 2, "user": "Shellymb", "date": "March 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 125477361}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The toiletries in the bathroom were from Crabtree and Evelyn which is so much better than the horrible cheap stuff most hotels leave for use. I'd be happy with Dove or Nivea products in hotels then you know what you are getting.", "title": "Great Find", "helpfulness": 1, "user": "AnthonyPit", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125385354}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "Wifi was available in the room.", "title": "Good location, very average everything else", "helpfulness": 1, "user": "boston65", "date": "February 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 125328573}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We were towards the back of the hotel and it was very quiet despite being a busy road", "title": "A good buisness hotel", "helpfulness": 1, "user": "IckenhamChris", "date": "February 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 125309186}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 85, "average": 205, "very good": 430, "terrible": 42, "excellent": 268}, "aka": "Doubletree By Hilton London - West End Hotel", "slim_ranking": 0.35687732342, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The DoubleTree by Hilton London – West End (WC1) formerly the Park Inn London Russell Square, is a newly-renovated four-star hotel in Bloomsbury near Russell Square. The hotel is a stone's throw from the British Museum and walking distance to top attractions such as Covent Garden, the West End and the shops on Oxford Street. The hotel features 215 fresh and modern guest rooms, recently refurbished to a superior four-star standard (including Standard, Deluxe and Executive rooms as well as Apartments). Wireless high-speed Internet access is available at the hotel."}