{"user_rating": 4.0, "review_count": 1046, "name": "Doubletree by Hilton Philadelphia Center City", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "This hotel needs a complete overhaul. The lobby is dreary, tired, and dingy in appearance, even with a high ceiling, glass atrium, and large windows onto Broad Street. The room was adequate in size but had an old air conditioning unit that made a tremendous amount of noise whenever the thermostat turned it on and it remained in operation. This awakened us repeatedly during the night. The parking garage is a monstrosity. It has very narrow passageways (unsafe for 2-way traffic) and has a poorly-marked exit on the 3rd floor, which we didn't even see until we had returned to the 1-way entrance on the first floor. On a positive note, a very nice buffet breakfast (with made-to-order omelettes and waffles) was included with our Hilton Honors membership and the dining room staff was extremely friendly and courteous. We would not stay here again until there is a complete renovation.", "title": "Tired and Dingy", "user": "DCRE", "date": "August 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 19076677, "likes": {"liked": "— Room size was decent", "disliked": "— Noisy and antiquated HVAC unit"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Nice enough hotel. I really liked the location, the parking was overpriced but you really have no choice. Our room was not ready till after 4pm which was slightly annoying. My kids loved the cookies at check in although I really dont see the point of giving out cookies.", "title": "Nice Hotel", "user": "gingersmomnj", "date": "August 14, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 18967340, "likes": {"liked": "— location", "disliked": "— overpriced parking, room not ready till after 4pm"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Stayed here on business. Very beautiful, modern hotel right on south broad street. Staff was exceedingly friendly and had warm cookies upon arrival.. Rooms were quiet, clean, large. Internet was 10.95 a day, but honors members can get free. I have zero clue of the cost of saying at this hotel, but it was exceedingly excellent. I had breakfast at the restaruant on the second floor, the buffet for 15 bucks kind of pricey, but the food was halfway decent.", "title": "Excellent Hotel", "user": "musicmerchkid", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18697868, "likes": {"liked": "— very modern and beautiful", "disliked": "— it's probably exspensive."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008", "text": "For the life of me, I don't understand why this isn't a better hotel, except for classic apathy. It's not bad. But from the strong smell of mildew coming from the shower curtain, to the one of four elevator banks working during morning rush hour, to the gift shop not giving me change so I could tip a bellman, this is just the classic example of the non-customer focused hotel.", "title": "Such an average hotel", "user": "wiseconsumer", "date": "August 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 18684312}, {"rating": 2.0, "title": "what a headache", "text": "If it were customer focused, it could be great and make a lot more money. It's location in the arts district is supreme and views out of my room anyway can be superb.", "helpfulness": 1, "user": "tripgirlNYC", "date": "July 8, 2008", "id": 17675805}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Had a great one night stay at the Doubletree on 3/4. Decent rate, easy check-in, a room on the penthouse floor. A couple negative things were instantly remedied and after seeing a show and going to dinner, came back to the room to find a note of apology for the inconveniences with an invitation to free brunch. Great location and employees were always friendly - would stay again.", "title": "a nice hotel", "helpfulness": 8, "user": "LadyMonkeyC", "date": "March 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4591294}, {"rating": 3.0, "title": "OK hotel, employees could be much better", "text": "Pulled into the driveway of the parking lot, where a uniformed employee was standing behind three cars, all without drivers. We assumed they were waiting for the valet to park them, but were told valet parking was full, and we should pull through & park ourselves. The doorman seemed rather frustrated & spoke curtly to us. When checking in, we were told the parking garage was not part of the hotel, and the desk employee argued with my partner as to whether she represented the garage also (note the hotel valet service parks cars in this garage, the doorman stands in the entrance of it, and the garage fees can be charged to the room.) The \"romance package\" came with a bottle of wine (never delivered) and a buffet breakfast (unremarkable except for the bad decaf and good orange juice.) The bed was very comfortable, and there were 6 pillows on the bed, plenty for those who like to hug one when sleeping. Although there was a card on a hangar indicating a robe was included with the room, there was no robe. The view was nice from the 26th floor room, there were two very large windows facing the east and south, showing off some of the downtown murals and row houses.", "helpfulness": 10, "user": "Worldtraveler2005", "date": "February 27, 2006", "id": 4524363}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "Initially, I was quite happy with the Doubletree. The beds were the most comfy hotel beds I've ever slept in, the service was pretty good and it had all the amenities I needed.", "title": "Nothing like a cold shower!", "helpfulness": 6, "user": "plushkanyc", "date": "February 21, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 4476342}, {"rating": 4.0, "title": "Quite the pleasant experience!", "text": "Then I woke up and wanted a shower. The first morning, the water was lukewarm, so I managed to get by. The second morning, it was too cold to contemplate trying. And it was in the 20's outside. Is it really too much to ask to have a hot shower? After various explanations and a visit from the hotel engineer, the reason for this is? They don't know. The customer service staff was okay - professional, but completely unsympathetic, bordering on sarcastic. The general manager returned my phone call after I arrived home and decided to give me a partial refund. I will never stay there again. At least not if I want a shower!", "helpfulness": 7, "user": "mccarthys5", "date": "February 19, 2006", "id": 4471284}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "I booked this hotel via Hotwire for $68/night for a girlfriend getaway night for 2/18/06. What a steal. Check-in (2 hours early without issue) was fine and we got some excellent warm cookies that Doubletree is famous for, which is always a bonus!", "title": "Great location; Above average hotel", "helpfulness": 7, "user": "Sunday-traveler", "date": "January 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4397978}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "After reading some of the reviews on here, i was scared upon arrival. To my surprise, I found the staff to be very, very helpful. They placed us on the 25th floor with a nice view.", "title": "Great Location, Wonderful view, pleasant hotel", "user": "melissamccrink", "date": "November 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 21499733, "likes": {"liked": "— Location", "disliked": "— Needs some general maintenance and cleaning"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We did have a problem with the heat--We called the desk and they immediately sent up an attendant. They were not able to repair, so they switched us to a room down the hall--This room had an amazing view. We were satisfied.", "title": "No problems at all", "user": "lsabjazz", "date": "November 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 21465036}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Now, this is not a brand new hotel and it does need a little \"help\". I noticed little things such as the grout in the shower could be a bit whiter...But, i did expect it to be alot worse based on the previous reviews.", "title": "Staff made up for everything that was lacking...", "user": "Hello_Kelly", "date": "October 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21146139, "likes": {"liked": "— The Staff", "disliked": "— Philladelphia"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "In closing, the location was great, the service was great and the hotel itself is acceptable.", "title": "A very nice stay", "user": "fitqueen15", "date": "October 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 21034732, "likes": {"liked": "— Location", "disliked": "— No free continental breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "I stayed at the Doubletree in Philadelphia for 4 nights and had no problems at all. On the third night the Phillies won the World Series, and it became pretty wild outside. Still...the noise level really wasn't noticeable from inside our room and the hotel staff did a great job at keeping \"non-guests\" out of the hotel that night. Parking was OK, although a bit tight, and the 2nd floor restaurant was good for breakfast. One word of caution: if you are a non-smoker DO NOT allow yourself to be placed in a smoking room. Yes, this hotel still has a smoking floor, and it absolutely reeks! When I booked on-line, the only room available was a smoker, but at check-in, I requested, and was granted, a non-smoking room that had opened up--am I ever glad about that.", "title": "Can’t wait to visit the Philadelphia Double Tree Hotel again!", "user": "kelroon3", "date": "October 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20961822}, {"rating": 5.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "My husband and I live in the suburbs and we got married at City Hall in March 2005, then spent the night at the Doubletree in a Junior Suite. He used points from his Hilton membership, which could explain the excellent service we received. Unfortunately, I believe the reviews that cite unhelpful/rude service staff, only because there seems to be a lot of that in the Philadelphia area. The majority are sincerely helpful though. We received excellent service, from the champagne and strawberries that were waiting in our room to the fantastic breakfast buffet. We love the view of Broad Street - and yes, you will hear some street noise, but we are city folk and don't mind. We swam in the pool and the jaccuzzi, although the children that were there made it less than romantic.", "title": "Romantic weekend getaway", "user": "GMS40", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17255782, "likes": {"liked": "— The location and the view.", "disliked": "— The children in the jacuzzi area."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We have celebrated our anniversary there as well. The beds are sooooo comfortable! You just sink into them. We will go again as often as we can afford the Junior Suite.", "title": "Not the greatest...", "user": "RobinB2006", "date": "June 8, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 16768766, "likes": {"liked": "— The bedding", "disliked": "— Service and noise level"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "We stayed here from 5/31 to 6/7 and it was our first time in Philadelphia (we are from California) and our first visit to a Doubletree Hotel. We checked in around 10:30pm and the front desk clerk was not very friendly or informative. He did not give us any information on the Executive Club Level amenties or even bother to offer any information on the hotel, the area, etc...", "title": "Excellent room, no free internet, pass on hotel breakfast", "helpfulness": 1, "user": "bchotpotato", "date": "May 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 15853453, "likes": {"liked": "— Location", "disliked": "— Internet not free and breakfast not good"}}, {"rating": 1.0, "title": "Not Business Traveler Friendly", "text": "We got into the room (2617) and there was a VERY strong smell of urine in the bathroom. I could not figure out where it was coming from and we were so tired after flying all day, we decided to wait until the morning to deal with it. The room was fine, nothing over the top, pretty basic and a litle \"worn\". We slept pretty well that night, the bedding was incredibly comfortable!", "user": "toughbroadfrombklyn", "date": "May 8, 2008", "id": 15816413}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The next morning I figured out the smell of urine was coming from the shower curtain. It's a very small bathroom and the toilet is right next to the bath/shower with a cloth shower curtain. I called the Careline to report it and also filled out a form that was in the room. We left for the day and when we got back it had been taken care of.", "title": "Just OK-", "user": "ad1868", "date": "May 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 15626902, "likes": {"liked": "— Location", "disliked": "— Room Furnishings and carpet"}}, {"rating": 5.0, "title": "best hotel in the city !", "text": "Room was fine, 2 queen sized beds, VERY comfortable beds, some of the best I have ever slept in at a hotel (second, actually, only to the Ritz.) Room was very clean as well. Our view wasn't great, but for $68/night, I wasn't complaining one bit. Bathroom was average-sized, very clean as well. Neutrogena toiletries.", "user": "irishb", "date": "January 3, 2006", "id": 4320274}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Stayed at the Doubletree for a professional conference. It was the only choice. I would concur with the strong points above that bed was excellent, and the omelette bar in the restaurant was a real treat, but beyond that, I found myself feeling overcharged for a stay at, what seemed to me, an overpriced and lackluster property.", "title": "THIS is a luxury, business hotel?!", "user": "PDCE-85", "date": "October 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 20791244, "likes": {"liked": "— Location and omelette bar", "disliked": "— Front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "I had reserved a King room, but even as a Hilton Honors guest, they only had rooms with two doubles available at check-in. I also mentioned that I might have to leave a day or two early, (though this was still two days in advance) and I was informed there would be a $50.00 fee for this! Might as well be flying United! (In the last place, I did have to leave early, but they did NOT charge me the fee. Go figure!)", "title": "Comfortable beds, great service from sales team!", "user": "tdtoronto", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20707287, "likes": {"liked": "— Beds, central location", "disliked": "— Can't think of anything."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I also concur that the parking situation is a mess. It's a terrible garage that requires you to drag your bags down several steps just to get to the elevator, no matter where you park.. And I, also, missed the carefully placed exit sign, and inadveratantly drove down the up ramp in a place that left little allowance for turning around.", "title": "One of the best hotels ever!!", "user": "ajb0400", "date": "October 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20535204, "likes": {"liked": "— Everything.......great location for everything in the city!", "disliked": "— Nothing.......loved it!"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "It's not a terrible property, and indeed, the location is superb, but for the price and the brand name, I expected a few more bells and whistles than they were willing to provide. Having stayed at the Philadelphia Marriott a few months prior, I would go there on a return trip instead were I given the choice.", "title": "When you don't care, it shows.", "helpfulness": 1, "user": "TravelBeard", "date": "September 22, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 20291392, "likes": {"liked": "— Great location, good bed, curved shower rod, free fitness center, in room coffee maker with real half and half", "disliked": "— Dated decor, surly staff, double (rather than queen) bed, unkempt fitness center, selection on breakfast buffet"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Stayed here for a few days. It's a good property. The pool and workout area is nice. The equipment in the workout facility was more up to date than I normally see in most hotels. The floor with the pool has a nice outside deck area with chairs/tables. The room was nice, clean and a little cramped for me and my family. We got a corner room (windows on two sides of the building) that provided a great view of the city but was difficult to get around in with our two children. The staff was exceptional from the time we got there (unloading the car) to check-in (pampered the kids). Overall, a very good place to stay. I would recommend it to most traveling to the area. The location was fairly close to many of the tourist attractions, although you'll do some walking to get there. A major bonus is being across the street from a theatre. There is also a lot of places to eat close by including a Ruth's Chris (my favorite). The hotel food was OK. We only had breakfast and found it to be adequate at the price we paid (no charge due to Hilton Honors Gold status). Be prepared to pay $18 a day for self parking if you have a car.", "title": "Great staff!!!", "helpfulness": 1, "user": "Travelinto25Cities", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5712466}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "I am lucky enough to have a job that sends me to Philly regularly and in the last 18 months i have stayed at Garden Inn, The Marriott, and the Doubletree. As it is not the works preferred hotel i have to get written approval to use it but it is worth the hassle when you travel alone. Out of those it is the Doubletree that i always return too. As much as the Marriottt was nice it was very imposing whereas the doubletree is very friendly. This was my 4th stay there and yet again the hotel was excellent. i suffer with a wheat allergy and they were very accomidating with food for me at other hotels i have been told they have low carb options. At checkin I had friendly staff and as i am VIP status with hilton i got free breakfast daily as tower rooms were full.", "title": "excellent hotel", "helpfulness": 4, "user": "stevenage_saint", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5577888}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "As i was here for 2 weeks the staff made me feel extremly welcome and it did feel like a home from homw. The beds are wonderfully comfortable and if you get a view over looking broad street you get to see some nice views.", "title": "What a comfortable stay!", "helpfulness": 2, "user": "cassissoda", "date": "July 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5465916}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "THe pool is small but that is a minor thing. You are in good position to walk to independence about 10 minutes and Retinghouse again about 10 minutes away,", "title": "Great room, service & bad food", "helpfulness": 2, "user": "mijohn", "date": "July 9, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5444015}, {"rating": 4.0, "title": "Decent Location", "text": "Yes this is not the 4 seasons but it is a really reasonable friendly hotel. When I had problems with room service i got it for free!", "helpfulness": 2, "user": "Terry9", "date": "July 4, 2006", "id": 5423793}, {"rating": 1.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The \"welcome cookies\" we were given at checkin really are a nice touch and were delicious. Our room and beds were very comfortable.", "title": "Worst service ever.", "helpfulness": 4, "user": "Thomas M", "date": "June 30, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5412396}, {"rating": 5.0, "title": "Great Location just for Starters", "text": "Unfortunately, the pool was closed for painting, so our children were disappointed. We got this hotel for a great rate through Hotwire, and were very happy with the value.", "helpfulness": 6, "user": "jtbroderick", "date": "June 17, 2006", "id": 5356188}, {"rating": 4.0, "title": "Service with a Smile", "text": "I had the worst time I ever had staying in a hotel at this Doubletree. The food was horrible, from the room service (food wasn't hot and arrived later than requested times), to the buffet breakfast (powdered eggs, bad fruit). I had reserved a King Size bed 2 months prior to my stay. However, when I arrived they said they could only give me a room with 2 double beds. Next, I was finally able to change the room to a king bed the following night. But they put me on a floor directly above a smoking floor. The smoke came up from the lower floor right into my room, although the people at the front desk didn't believe me at all. They said there was no way they could switch my room since they were booked solid. However I met the one nice guy who works at this place and he talked to front desk and they immediately switched my room. So basically the front desk lied about the hotel being booked. There was one lady working there who was very mean and condescending about everything.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5231445}, {"rating": 4.0, "title": "Good--But Hotel Shows Wear and Tear", "text": "In the final room I was able to get, the walls were all dented, the bathroom tub leaked into the bathroom floor, and there were gummy bears under the air conditioner.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 11, 2006", "id": 4599941}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "This is not a bad hotel, just a mediocre one. First the positives: The room was nicely furnished and perhaps a tad more spacious than most. The bellman and concierge were friendly and helpful. The breakfast was nice enough, but not remarkable.", "title": "Just So-So", "helpfulness": 4, "user": "rwoody", "date": "October 20, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5975076}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Now the not so positives: Upon arrival I was told that my room was vacant but not clean (I arrived before check-in time) but that housekeeping was being alerted so that they could give my room priority. I was asked to come back in two hours, which I did, only to be told the room wasn't ready and had not been vacant when I arrived earlier. When I complained that I was being given conflicting stories and that the promise to give my room priority was not being kept, the clerk got a bit snippy as if I had done something wrong. In the end, I got into the room only a few minutes before an appointment I had, so had only a few minutes to freshen up. So all in all, service was not so great.", "title": "Great location, needs some sprucing up", "helpfulness": 8, "user": "Linyo", "date": "October 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 5948193, "likes": {"liked": "— Location, cookie", "disliked": "— mold/mildew in and around AC/heating unit - hopefully a limited problem"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The hotel is in a very good central location, especially if you are going to the Kimmel Center which is just up the street. But for the price I would have expected better service.", "title": "Good- but there is some room to improve", "helpfulness": 1, "user": "javisq", "date": "September 25, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "business": 4.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5837010, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Location was great, staff was helpful and friendly, and as always, the cookie was great.", "title": "nice place", "helpfulness": 1, "user": "mssha44", "date": "September 20, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5824086, "likes": {"liked": "— location and view", "disliked": "— room size"}}, {"rating": 5.0, "title": "This hotel was wonderful!!!", "text": "The room was clean and spacious (14th floor in the corner) but there was a large area (about 3 feet square) of the ceiling, right over the window (and the AC/Heating unit) that clearly had water damage, was sort of repaired but looked like it was ready to let loose at any time. The walls had lots of big dings.", "user": "tayloralexasmom", "date": "September 15, 2006", "id": 5804333}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "My husband, 6 year old son and I booked a room about a week in advance of our three-day stay. Because of the late date and the timing of the Obama/Clinton primary, rooms were at a premium - so we didn't get a great rate. However, we were not disappointed in any way with our stay at this hotel, and we loved our time in Philadelphia. The parking for this hotel is either valet or self-park, and is located adjacent to the hotel. We did self-park for $20 a day, and did not have any difficulties at all getting our bags from the garage to the hotel (as a previous reviewer had experienced). The city is very walk-able, or if you choose, the hotel is right next to the subway line. There are also lots and lots of cabs. We parked the car and didn't take it out until we left. Check-in was uneventful. We got there a bit early and the room wasn't quite ready, but we waited under 15 minutes in the lobby until it was. The lobby is spacious, sunny, and wecoming. The room itself was very nice. We were on the 23rd floor and were very close to the elevators but we did NOT hear any elevator noise the entire time. In fact we barely heard any noise from others at all. The restaurant served a breakfast buffet and two of the three days, we were not charged for our son's breakfast, which we liked, but I guess that's left to the discretion of the waitstaff. The service was always prompt and accommodating. We didn't eat any other meals there, though, as there are a multitude of restaurant choices all over the city. The hotel has a heated pool, fitness center, and a sunning area on the roof. From the inside of the hotel, you have to walk through the fitness center to get to the pool, which I didn't care for. Also, the very small bathroom/shower/locker/sauna area were located across the atrium from the pool and fitness area. To me, it would have made more sense to put it in-between. This is about the only thing I didn't like about the hotel. The location is very good; close to Market and Walnut Street, and not a far walk to the Independence Hall/Liberty Bell area. On a side note, we highly recommend doing the Trolley/Bus tour right away to get an idea of what the city offers. This hotel is one of the stops on the tour, and the bus will also pick up there in the AM if you want to be brought to the tour starting point early in the day to continue your tour (within 24 hours). Housekeeping service was very good and they always made sure to replenish towels, shampoo. We would definitely return to this hotel.", "title": "Perfect for our getaway", "user": "PDDNOSMom", "date": "May 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 15596914, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The hotel was fine. Conveniently situated, clean rooms. Not sure about the friendliness and eagerness of the front desk staff that other reviewers have mentioned - the woman who checked us in was on the phone with her friend the entire time she was helping us. However --- I left a ring of great sentimental value in the room and didn't realize until about 20 minutes after I had left. I rushed back and the maid who was making up the room answered the door - I barely got the word \"ring\" out before she held up a little baggie containing the ring and a hairclip I didn't even know I had forgotten. Amazing!", "title": "Thank you, housekeeping staff!", "user": "Jessup", "date": "April 30, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15518957, "likes": {"liked": "— Location", "disliked": "— Nothing special."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "From the moment we arrived for a five night stay, the staff exhibited a cheerfulness and helpful attitude that we continued to experience throughout our stay. The warm chocolate chip cookies given to us at the front desk represented a nice touch. As usual, I asked about any complimentary upgrades. While none were available, because of high occupancy, we were given, at our request, a quiet room away from the elevators and ice machine, and it was just that, despite the hotel's location on a very busy corner.", "title": "Gret location; great attitude", "user": "Love2getaround", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15301573, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "We found comfortable beds, numerous pillows, efficient and responsive housekeeping. The room was attended to every day before noon.", "title": "Great Location!", "helpfulness": 1, "user": "tameka94", "date": "March 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14258063, "likes": {"liked": "— Location", "disliked": "— Internet Fee"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "A problem with the door lock was taken care of within 15 minutes, and we noticed a maintenance problem next door was attended to very quickly.", "title": "They give you warm chocolate-chip cookies when you check in!!", "user": "lishi8983", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13973054, "likes": {"liked": "— The location! And the cookies!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "We live in NJ but wanted to get a room for the weekend in Philly as we were going to a show and would be out late. We are a young couple in our late 20's, and we didn't want to spend too much money. After looking around, the DT seemed to be our best choice. It was relatively inexpensive ($167 internet rate @ hilton.com) and the location was excellent.", "title": "Great Location and Price", "helpfulness": 4, "user": "breaze345", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 13661867, "likes": {"liked": "— Inexpensive for area, friendly staff, location", "disliked": "— Not very luxurious"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We self-parked at the next door garage and we left our car there over night and the next day even after we checked out. It cost us $20, which is average. We avoided the valet.", "title": "Great Hotel!", "user": "pilotguy3", "date": "February 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 13507465, "likes": {"liked": "— Alot", "disliked": "— parking was hard to get"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "All of the hotel staff were kind and friendly. The concierge (sp?) was very helpful, and after asking us where we wanted to eat, he directed us to a number of fun, nearby pubs withion walking distance. After the crowd at Monk's was too much, we went to Fado, an Irish pub located only 1 block from the hotel. We ate an awesome Irish breakfast there the next day as well. There were many restaurants that were fancier near by too, but we opted for a pub.", "title": "Great Hotel...NIghtmare Valet!", "user": "strtofdrms", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13262727, "likes": {"liked": "— The hotel", "disliked": "— The cracked rim from the valet drivers"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The hotel was nice, and the bedding was soft and comfy. Every single staff member was nice, from the check in staff, to housekeeping, to the doorman who flagged us a cab. It wasn't a super luxurious stay, but it was comfortable and clean.", "title": "Much better than earlier reviews", "user": "TK6022", "date": "January 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12952058}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We would definitely stay there again!", "title": "Nice Hotel, Nice Location", "user": "mollysnapple", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12732235, "likes": {"liked": "— Nice comfy bed, great location", "disliked": "— Expensive internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "Arrived 12/30 for a two night stay . The desk staff promptly checked us in even though we arrived early.", "title": "Good priced hotel for location", "helpfulness": 6, "user": "youngsterdave76", "date": "January 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4319220}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "the room was extermely clean and comfortable with a beautiful view.", "title": "Wonderful - most comfortable beds anywhere!", "helpfulness": 3, "user": "Carolyn K", "date": "December 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4164946}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "Breakfast was great as well as lite fare that is sreved in the Standing O bistro.", "title": "Great Hotel, Great Location", "helpfulness": 1, "user": "jcre", "date": "October 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4053954}, {"rating": 4.0, "title": "Extremely Comfortable", "text": "TheHotel was fully booked,hosting a wedding and a huge New Years eve party. In spite of the number of guests the hotel staff was the BEST !! The desk staff, the bellmen, housekeeping ,waiters....EVERYONE was so friendly and pleasant!!! That really made my stay GREAT !", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4013173}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 3.5, "variance": {"poor": 81, "average": 173, "very good": 421, "terrible": 42, "excellent": 329}, "aka": "Doubletree By Hilton Philadelphia Center City Hotel Philadelphia", "slim_ranking": 0.440476190476, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}