{"user_rating": 4.0, "review_count": 268, "name": "DoubleTree by Hilton Hotel Deerfield Beach - Boca Raton", "reviews": [{"rating": 4.0, "title": "Three separate stays at this hotel", "text": "Between Jan and Sept 2004, I made four separate visits to the Deerfield Beach / Palm Beach area, spending time in six different hotels. I stayed at this particular HILTON on three separate occassions during this period. I have found the quality of the room, relative to the room rate, to be a excellent value. I cannot comment on any other service the facility might offer (I go off site for food and beverage). It is not set up as a tourist hotel (close drive to, but not on the beach; no concierge). But if you want a comfortable, well appointed room to lounge in after a tough days work and which is freeway adjacent, you might try this facility. This facility has a 3-1/2 star rating. I feel this is fair--especially after seeing what gets a 3-1/2 star rating in NYC.", "helpfulness": 7, "user": "pchnmain", "date": "September 7, 2004", "id": 2517334}, {"rating": 2.0, "title": "Better off at a discount chain", "text": "Sorely dissappointed at this property. MobilTravel guide, Orbitz and Expedia are all overrating this property. Hotel is worn and in need of updating. It appears less than clean and if your hoping for a nice hot shower get up early early early.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 22, 2004", "id": 2316148}, {"rating": 2.0, "title": "Not a great pick", "text": "I dont know how the rating of 3 and 1/2 half stars was given by expedia for this Hotel. I would rate it at 2 @ best. The rooms were very small. The hotel was noisy, doors slamming all the time. Location is not great at all very far from the beach and hard to get parking at the beach. Far from Ft. Lauderdale Airport. Bathrooms need renovation desperately. Ate breakfast once in the hotel in the 'coffee shop if you can call it that. The food was terrible. staff was very slow and not always that nice. Pool was nice. This is not a resort hotel and would advise families on vacation not to stay at this hotel... I dont think this hotel serves the Hilton franchise well at all. The Hilton near Miami Airport much much better.", "helpfulness": 5, "user": "livlds", "date": "April 27, 2004", "id": 1840822}], "location": {"country": "United States", "city": "Deerfield Beach"}, "stars": 3.5, "variance": {"poor": 30, "average": 40, "very good": 74, "terrible": 22, "excellent": 102}, "aka": "Hilton Deerfield Beach/Boca Raton Hotel Deerfield Beach", "slim_ranking": 0.285714285714, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}