{"user_rating": 4.0, "review_count": 644, "name": "DoubleTree by Hilton Hotel Cocoa Beach Oceanfront", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "This was the second time I stayed at this hotel. This time I stayed on the \"executive\" floor which is the 6th floor. Even though our room was the furthest from the beach the view was still great. Nice balcony to sit outside. Free drinks and breakfast were a bonus. I booked a suite which has a living area and king size bed and was quite spacious. Don't get me wrong, this is not an upscale hotel but the rooms were clean and quiet and the location write on the beach was excellent. Friendly staff and reasonable prices. I have been to Cocoa beach multiple times and this is probably the best hotel overall on the beach .", "title": "Good location", "helpfulness": 6, "user": "spyderwoman", "date": "September 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8670540, "likes": {"liked": "— Location on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My boyfriend and I stayed at this hotel for the first time on August 12-15, 2007. I was a little aprehensive due to some of the negative reviews. Let me just say that our stay here was PERFECT!!! We stayed in a partial ocean view room (see pics above). Positives? Room was kept very clean everyday. Very friendly and helpful staff. I've stayed in quite a few 3 star hotels throughout my life and my boyfriend and I agree that this hotel has the most comfortable bed of any we've stayed in! We always had plenty of towels, and other supplies. Very good location! We only ate breakfast at the onsite restuarant but it was delicious . Another great restuarant close by that we highly recommend is \"Coconuts on the Beach\". We ate there twice during our 3 night stay. Best burgers ever. We will definitely be staying at this hotel again.", "title": "PERFECT!!!", "helpfulness": 6, "user": "skittlebear", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8459859, "likes": {"liked": "— Comfort of room and close to beach and other attractions", "disliked": "— Can't think of anything"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "While this hotel is not the newest or the largest it was great for our stay in Cocoa Beach April 8-13. Location was perfect.", "title": "Great Location", "helpfulness": 5, "user": "alidiffin", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7351728, "likes": {"liked": "— the location and private beach", "disliked": "— pool area"}}, {"rating": 2.0, "title": "Its Alright", "text": "The property was well maintained and very clean as Doubletrees always are. We stayed in a \"partial ocean view suite\" where we could see the ocean perfectly without being over the loud air conditioning units everyone talkes about. All the rooms have balconies.The suite was good size although the bathroom was kind of small. The bed was very comfy with down pillows and comforter. The pullout couch worked perfectly for our 5 year old and the fridge and microwave were brand new.", "helpfulness": 2, "user": "skandeluz", "date": "April 9, 2007", "id": 7302053}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The pool area is very small, but we prefer the beach which had perfect surf for boogie boarding. We also saw 8 MANTA RAYS every day!!! The workout room was sufficient and the business center has 2 computers and a printer available for anyone to use. We has wireless internet access in the room of course.", "title": "Avoid this hotel", "helpfulness": 3, "user": "HamptonRoadsVA", "date": "March 25, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 7219341}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This is a decent hotel. In a couple of years it will need a renovation or at least a redecorating. You can tell that the carpets have seen better days. Tthe bathrooms are tiny, there was a crack in the tub and the lights did not light up the bathroom enough.", "title": "Decent Hotel", "helpfulness": 2, "user": "ARBUFL", "date": "March 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7163350}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "A major bright spot is the staff. They are very kind and they try to make sure you have a good stay.", "title": "Clean, comfortable, immediate beach access", "helpfulness": 5, "user": "theflyingmonkey", "date": "November 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6058288, "likes": {"liked": "— Location", "disliked": "— noise from central AC units on roof"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed here for 3 days for a friend's beach wedding and thoroughly enjoyed our stay. It was nothing fancy inside or outside, but the rooms and bathrooms were clean and comfortable with all the basic amenities, there was at least a partial ocean view even from rooms not facing the ocean (we were on the third floor), the staff was very helpful with last-minute wedding needs, and the beach access was unbeatable. Our room faced the north side on the third floor and the central AC unit on the roof next to us a floor below was loud all night. However, apart from that one minus, our experience here was very positive and we would come back.", "title": "Very comfortable. Better than Expected.", "helpfulness": 3, "user": "thdugger", "date": "September 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5801945, "likes": {"liked": "— very comfortable", "disliked": "— some eyesores around property"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We did a lot of research before booking (and we checked loads of feedback like this), so we had certain expectations going in. But the staff and overall quality of the stay exceeded those expectations. Very helpful and cheerful staff at the front desk and especially in the restaurant. The room was fine -- for the market and the money. Great beds!...plus a microwave and fridge which are great for longer stays. The food in the restaurant was very good but kind of pricey. Pool was fine, and access to the beach could not have been closer.", "title": "Not Bad", "helpfulness": 3, "user": "Rockman64", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 5614913, "likes": {"liked": "— Clean Room, friendly and helpful staff, good beach access", "disliked": "— Ocean Front Room was disappointing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "A few side notes:", "title": "Wonderful Hotel", "helpfulness": 5, "user": "tigerfamily99", "date": "July 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5531916, "likes": {"liked": "— the BED!", "disliked": "— the roof you can see from your oceanview room"}}], "location": {"country": "United States", "city": "Cocoa Beach"}, "stars": 3, "variance": {"poor": 35, "average": 110, "very good": 219, "terrible": 23, "excellent": 257}, "aka": "Doubletree Cocoa Beach", "slim_ranking": 0.212121212121, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Conveniently located along the Atlantic Ocean in the heart of Florida's Space Coast, the Doubletree by Hilton™ Cocoa Beach Oceanfront hotel provides guests with upgraded guest rooms, modern amenities and a close proximity to the area's leading attractions. The property now showcases multi-million-dollar renovations to its lobby, front desk, fitness center, elevators and guest rooms, including all-new granite and marble bathrooms, carpet and furnishings. Featuring private balconies with ocean views, refrigerators and microwaves in every room, complimentary Wi-Fi, heated pool, on-site oceanfront dining at 3 Wishes Oceanfront Restaurant and Lounge, a 24-hour business center and private beach access, this affordable hotel offers an opportunity to experience both convenience and quality while lodging in Cocoa Beach. Guests can also take advantage of 10,000 square feet of meeting space ideal for weddings, conferences, meetings and other social events, large or small. With its close proximity to Kennedy Space Center, Patrick Air Force Base, Cocoa Beach Pier, Ron Jon's Surf Shop and more, the Doubletree by Hilton™ Cocoa Beach Oceanfront hotel provides a convenient location to a variety of attractions and popular things to do."}