{"user_rating": 4.5, "review_count": 310, "name": "DoubleTree Club by Hilton Hotel Buffalo Downtown", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We went for the 4th of July long weekend. The location is pretty scary and the whole area looks like a ghost town. It is good for people going to the hospital or the cancer institute. Food options are limited. Directions are confusing. We would have never reached if not for the GPS system. The printed maps we had were a total failure. Parking is costly and far off. Also since the neighbourhood is very dicey you need to walk thru the hospital to get to the hotel after parking (about 3 blocks).", "title": "Not upto Hilton Standards", "user": "FiestaFlower", "date": "July 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 17622727}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "For the hotel, first the keys did not work. Then we got that exchanged and found out that the tv had no remote control. asked for one and got a non-working remote. The bath room was not restocked. Not a good experience. We normally stay at Hampton Inn or Hilton Garden inn and have had excellent times but I would not stay in a Double tree in future.", "title": "Best Staff Ever!!", "user": "RincenaTravel", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 16833983, "likes": {"liked": "— Staff", "disliked": "— That it is in Buffalo"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I stay at this location every time I am in Buffalo. I travel there a great deal for work. The Staff is fantastic, food is limited but great, and the rooms are safe and clean.", "title": "Would Not Stay Here Again!", "user": "houstonguy2010", "date": "May 29, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 16499459, "likes": {"liked": "— Staff", "disliked": "— The Awful Attitude Of The Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007", "text": "I stayed here using HHonors Points. It is located next to Roswell Cancer Center and across from Buffalo General Hospital. First of all we asked for an early check in and they took our number and told us they would call. They never did. We arrived back at the hotel at 2:40pm and were told that check in was at 3. OK, so you have no clean rooms and it is 20 minutes until everyone can check in? I do not think so. The front desk clerk was not friendly at all. We valet parked our car and had to give the keys to the desk clerk. No bellman in sight anywhere. We called for our car 20 minutes before needing it and it was still not there when we came downstairs. We ordered room service and it took 1 hour and 15 minutes. The worst tasting room service food I have ever had bar none! The area around the hotel is not a good place to be outside at night especially if you are a woman. No bellman available for check out either. We were put into a room on the 2nd floor after asking for an upper floor. The hotel is worn and in need of renovation. The only bright point of this stay is the chocloate chip cookies at check in. Also they have the old 19 inch tv's in the room.", "title": "Room Fine, Other Caveats...", "user": "spends2much", "date": "May 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 16421441, "likes": {"liked": "— Room clean, free internet access", "disliked": "— Restaurant"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Spent one night here so my boyfriend could run the Buffalo Marathon. Room was clean and large, if a little dated. Hallways were clean as well. For the money, the room was perfectly fine.", "title": "not a good choice for business stay", "user": "edh255", "date": "April 17, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 15099320}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I come to Buffalo a lot for business, and usually stay downtown. The reason I booked this hotel was because of the courtesy shuttle. Well, don't believe the hype, as the shuttle is frequently late and unreliable. It's a shame because the hotel itself is not that bad, with most of the staff being very friendly.", "title": "The manager hung up on me!", "helpfulness": 2, "user": "evilcc", "date": "June 27, 2009", "detail_rating": {"cleanliness": 3.0, "location": 1.0, "value": 2.0, "rooms": 2.0}, "id": 33329625}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "At 3:30pm Saturday 27 June, I called for the shuttle to pick me up at Delaware Park, on Lincoln parkway, next to the statue at the rose garden. I was informed by Gary at the front desk that the shuttle was busy and would be 45 minutes away. I said that was fine, and proceeded to wait inside the park.", "title": "Just Plain Mediocre & Worn", "helpfulness": 1, "user": "CamoFlash", "date": "May 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 29479408}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "At 4:15pm, I went to stand next to the statue. After 10 minutes, I called the hotel again, informing them I still had not seen the shuttle. The person who answered the phone was Donna Rizzo, the manager on duty at the time. I told her that I was expecting the shuttle, only to be told that the shuttle was here 20 minutes ago and had now left for the airport. I then told her that I was asked to wait for 45 minutes and asked why the shuttle had come and gone, and she did not answer. She said the shuttle was now going to the airport and I would just have to wait. I tried to find out how that could have happened as I had now waited 55 minutes for the shuttle. She then HUNG UP ON ME.", "title": "Average stay", "user": "Jaybird6676", "date": "April 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 27907411}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "I called back again, as I needed to find out the time that the shuttle was going to pick me up. She informed me that the shuttle would come as soon as it finished the run at the airport, but said she didn’t know the time and I would just have to wait there. I then asked to speak to the manager in charge because she was being so rude, only to be told that she was the one in charge.", "title": "Incredible service and truly warm hospitality", "helpfulness": 1, "user": "imipolex", "date": "April 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 27723832}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "The fact that I was a lone female travelling by myself, when I was stuck at Delaware Park for such a long time, made me feel very uncomfortable. The shuttle finally came at 5pm to pick me up. The driver, Ben, was apologetic, and told me that the front desk sometimes got busy and mixes up messages. He then showed me the very brief message he was given for my pick up, which said “Lincoln Delaware, <my phone number>”. Ben was courteous and said that the shuttle would be at my service for anything else I needed.", "title": "Hotel exceeded all expectations!", "helpfulness": 1, "user": "James6288", "date": "February 7, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24347940, "likes": {"liked": "— Staff, Convenience, and Ammenities", "disliked": "— Breakfast not complimentary (although it is delicious and cooked to order)"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "This hotel was friendly, clean, and easy to find. The parking is $10, but I did it instead of driving around bad neighborhoods in Buffalo.", "title": "Large rooms, great workout area, expensive/mediocre restaurant", "helpfulness": 1, "user": "Leaudemiel", "date": "October 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 47899600}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The room was huge. Most people stay there for long periods of time while family members are at the hospital. Kitchenette in my room was great.", "title": "Just what we needed", "helpfulness": 1, "user": "bjyokums", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 44283134}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The workout area was clean, and had two treadmills, two elliptical machines, a rower, and a bunch of weights and balance balls. And tvs set up with the machines, and another for someone using the free weights. I was quite pleased with that!", "title": "I would alway choose this hotel", "helpfulness": 1, "user": "leeandflora", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 44082662}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "The only negative was the restaurant. Online it seemed like there would be an Au Bon Pain and a bar attached to the hotel. its one place, a cold dining room and waitstaff that were really into talking loudly about needing a cigarette. The food was quite expensive and mediocre. Egg and cheese on a bagel? $8. Wow.", "title": "OK Stay, OK Neighborhood", "user": "Triplewin", "date": "July 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 34884298}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "We are currently going to Roswell Park Memorial Cancer Center for treatment so this hotel is ideally located and in fact has a tunnel to RPMCC. We don't usually stay in swanky places anyway so this place was fine for us, average room style. I must say the beds were extremely comfortable! The room we had had white, puffy quilt-like covers instead of the standard blanket. The 4 pillows each bed were nicely propped up with a little pillow with \"Sweet Dreams\" printed on it. This felt very welcoming and is a nice touch.", "title": "Great customer service, middle of the road rooms", "helpfulness": 1, "user": "Mark H", "date": "July 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 34212365}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "The Doubletree is one of the newer hotels in Buffalo. I was there for one night on a short business trip. I stayed at the Doubletree because I could not get a room at the government rate at the Hyatt or Hampton Inn. The hotel is very nice, but the location is not great unless you are going to Buffalo General Hospital or the Cancer Center.", "title": "Nice hotel, bad location", "user": "Su2116", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 14862944, "likes": {"liked": "— The fact that it was fairly new.", "disliked": "— The location."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "On a positive note, the hotel has a free shuttle that will take you anywhere within 5 miles of the hotel. I took advantage of the shuttle to get to my client's office. And you have to love the warm cookie they give you at check in!", "title": "Nice hotel", "user": "traveler129", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12928466, "likes": {"liked": "— Friendly staff", "disliked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Stayed at the Doubletree while my husband was in Buffalo for a class. We had a nice stay there. Very clean rooms, helpful staff. Valet servie was a nice convenience (although one morning they almost gave our car to another guest!). Not the best neighborhood, but good central location to get to the popular spots in Buffalo. Just a few blocks from Elmwood Village and a short walk to Chipewa and downtown area.", "title": "It served the purpose...", "user": "Southern_girl012", "date": "November 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 10841258}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "I stayed at the Doubletree for a certification review course and exam, so my trip was business related and very quick. The hotel is a great option for family/friends of patients at Buffalo General Hospital or any of its facilities since it is practically attached to the hospital. The rooms were very clean, the food was \"okay\", but the location is not the best choice for those that want to venture out (by walking) in Buffalo. I would recommend renting a car during your stay.", "title": "Room is good and big", "user": "Jchen0", "date": "August 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 8408451, "likes": {"liked": "— New remodel room", "disliked": "— parking"}}, {"rating": 3.0, "title": "Great one night stay", "text": "I was there for a business meeting when a summer vacation season, so all hotel is full or high price. Then my travel agency found this for me at $139/night.", "helpfulness": 1, "user": "On_my_way", "date": "July 7, 2007", "id": 8072219}], "location": {"country": "United States", "city": "Buffalo"}, "stars": 3, "variance": {"poor": 12, "average": 37, "very good": 89, "terrible": 8, "excellent": 164}, "aka": "Doubletree Hotel Buffalo Downtown", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "DoubleTree Club by Hilton Buffalo Downtown, located on the Buffalo Niagara Medical Campus recently completed a major guestroom and corridor renovation! Now 100% non-smoking; the DoubleTree offers all of the comforts of home! Complimentary WiFi in all of our tranquil rooms. Experience the all new \"HD residential experience\" on our brand new flat screen televisions."}