{"user_rating": 4.0, "review_count": 319, "name": "DoubleTree by Hilton Hotel and Executive Meeting Center Palm Beach Gardens", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "While the staff was great, the hotel is severely outdated vs its peers. The rooms are small and need a refresh, the room AC worked poorly (had to crank it down to 60 to keep compressor going), Wifi internet was spotty at best and room service bungled my breakfast order.", "title": "Very disappointing - needs a serious refresh", "user": "rsp1", "date": "August 23, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 2.0, "service": 4.0}, "id": 117153476}, {"rating": 3.0, "title": "OK, but not great", "text": "On the positive side, fitness center was slightly above average.", "user": "KAF32082", "date": "August 23, 2011", "id": 117144502}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I stayed here for 6 nights on business. The bed was very comfortable and the staff was generally friendly, but the hotel is right by the interstate and you hear all the cars that go by. The housekeeping leaves something to be desired- I could not help but notice how greasy the door was where people had been putting their hands on to open/close. It looked like it had never been cleaned- this obviously made me wonder what else had never been cleaned. I am a govt employee and despite the fact that I gave them my tax exemption certificate in advance, they still charged me taxes, which I had to go back later and have them fix. This shows a lack of organization or attention to details.", "title": "Top of the line hotel", "user": "lili22902003", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116678381}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My trip was scheduled for the beginning of June. The purpose of the trip was to help my brother who lives in Palm Beach Gardens with some personal problems he was having. He had been in the hospital prior to flying to NJ to recover for a couple of weeks. During his stay in NJ, our mother passed away and we had to reschedule our flights and my hotel reservations for a week later so we could be present for our mother's wake/services. After arriving in Palm Beach Gardens I checked in at a hotel which was horrifying. I was desperate to find a different place to stay. I stopped in at the Doubletree to inquire if they had any availability. Thank goodness for the Doubletree! They had a room available for the entire length of my stay (4 days) and the service I received there was absolutely wonderful.", "title": "HORRIBLE!!!!!!", "helpfulness": 1, "user": "beaner1229", "date": "July 24, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 2.0, "service": 4.0}, "id": 115725059}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The room was spacious and immaculate.", "title": "Clean, comfortable, great service!", "user": "Lizlimon", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115458811}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband and I were visiting my dad in the area over the holidays. We got a great deal online for the room (about $70 a night) which includes wireless internet and parking. For us, we have special needs as we were traveling with our dog. There was an extra fee for the dog, $15 a night, but it was mostly worth it as the rooms we had, normally given to guests with dogs, were spotlessly clean. We travel often, and take our dog with us whenever possible. This was one of the nicest hotels we have ever been able to stay at with our furriest child!", "title": "Excellent place - and dog friendly too!", "user": "flotsam66", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124438212}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Overall, the hotel was very clean, beautiful lobby, with a very friendly and helpful front desk staff. We were placed in a double queen room the first night, even though we had reserved a king, and when we asked to switch the next day the staff was completely apologetic and placed us in a king room. The beds are really comfortable, with lots of pillows and great linens. One evening, our fire alarm started to do a low battery beep, and within 5 minutes of a call placed to the front desk a maintenance man was there replacing the battery. The housekeeping staff were friendly and prompt each day, and we had a great experience here.", "title": "I enjoyed my stay at this Doubletree Hotel.", "user": "I_wanna_go_places", "date": "February 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 124030642}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We will definitely stay here in the future.", "title": "Nice hotel, friendly staff, and great management!", "user": "jgerund", "date": "January 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123814119}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The room was well spaced and I never felt crapped in my room. The room was clean, while the patio area was small it was nice to sit outside for some fresh late night air. I was there on business and found the business center to be very adequate for my needs. The front desk staff was kind and very helpful. The location to any other Florida attractions was not close. They do have restaurants and a grocery store in walking distance as well as a CVS drugstore. You will most likely need a vehicle to get around.", "title": "Beautiful room, friendly staff", "user": "grrrlynda", "date": "January 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123653748}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The property and rooms were immaculate. The service was outstanding. Every one of the staff there that I interacted with had a smile and went out of their way to be helpful. Thank you for a memorable stay!", "title": "look carefully before you leap into this one...", "user": "jbmoreau", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 123363524}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I recently stayed at this Doubletree Hotel. I am a frequent traveler and stay at Doubletree and other Hilton properties almost every week. The rooms are large, comfortable and well maintained. However, the check-in and guest services is lacking. Several of the team members I came in contact with during my week long stay were not friendly or knowledgeable. This was my second stay at this hotel and both times I felt that the team needs training.", "title": "Nice hotel but lacking in customer service", "user": "LucindaR_11", "date": "July 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 2.0}, "id": 115449447}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Great location for me since it is 3 minutes from my work, and 15 - 20 minutes to Palm Beach Airport. Gas station nearby if you have a rental car, banks and grocery stores are close as well. Gardens Mall is five minutes away if you want to shop. Service is good, rooms are clean, beds are comfortable...", "title": "Good Location - Good Service and Stay", "user": "fj74582", "date": "June 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 113760815}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Only bad part is that room service ends at 11 PM, which is typical for doubletree hotels. Other than that it's a good place to stay. I didn't use the business center, gym or pool so I cannot comment on them.", "title": "Extremely friendly and very accomadating", "user": "etallia", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112275881}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "was on a short vacation and needed a hotel who accomadate your little dog as well. They do and couldn't be any nicer then they were. The hotel it self was very clean and their restaurant served good breakfasts and dinners. As a result of this stay I will look fot Doubletree Hotels wherever I go. Also the price is very reasonable.", "title": "Commitment to excellence...congeniality...and great cookies!!", "user": "sandijeannemac", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108133370}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "I recently chaired a charity ball and selected the DoubleTree Hotel for our venue. Their planner and liason, MeMe Bengochea, was a joy with whom to work! Warm, friendly and helpful in all ways, she made my job so much easier than I had experienced in years past. This hotel gave us everything they promised, and then some! All of their staff with whom myself and my committee worked were polite, willing and ready to help in whatever ways they could. Everyone, from the manager, Mr. McMahon, to the check-in desk personnel, the ballroom staff and all others are a credit to this facility and the DoubleTree chain. It was a beautiful evening, the Ballroom was elegant, the food was delicious and our guests experienced an amazing time. I have heard nothing but positive reviews. Personally, I stayed the night there after the ball and found my room clean, the bed most comfortable, and everything supplied that I could have needed. Don't miss this experience and these wonderful people who work there!!! Sandi M", "title": "Nice business hotel", "user": "VyVy60", "date": "April 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 105087870}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We stayed just one night but found the hotel to be very nice. The desk staff were friendly and efficient, the room was very clean and the bed confortable. We were given the type of room we requested, and had no problems. The hotel is very centrally located. We would stay at this property again.", "title": "Very nice", "user": "kyamin", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125052355}, {"rating": 2.0, "stay_parameters": "Stayed February 2012", "text": "The lobby is nice ,but that's where it ends. I travel a lot and this one of the worst rooms I've stayed. Actually had broken and cracked furniture,broken door lock, peeling paint in bathroom, stained carpeting and furniture, old beds and rough sheets. I moved after one night to a Hampton Inn-not the Taj Mahal, but clean and pleasant-that's all I ask for. I asked for a different room and was told by an honest desk clerk-they're all like that.", "title": "Don't be fooled. This is not a typical Doubletree.", "user": "fairbankssheila", "date": "February 20, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 124941369}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Last weekend our organization, the Florida Association for Child Care Management, held our annual meeting at this hotel. I am on the Board, but I had nothing to do with the arrangements, nor had I ever visited the property. Our last couple of annual meetings had approached disaster status because of the hotels we used, and I was somewhat apprehensive about this one.", "title": "Outstanding Business Conference Experience", "user": "Villager5970", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124867171}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "There was no need. This is a first-rate facility in all respects. First, and most important, ever single staff member with whom I came in contact was friendly, courteous, and professional. It is obvious that the staff has been extensively trained.", "title": "Great Meeting Place", "user": "BrandonNCo", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124676324}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Second, the conference center is just excellent. All the tech worked perfectly. I had to give two presentations, and each time I simply walked into the room, plugged my MacBook into the cable, and everything just worked. No muss, no fuss. In addition, there was always someone in the room ready to help if I had any problem.", "title": "BEST WEDDING EVER!!!", "user": "Jo T", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124570746}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "We stayed at the Doubletree in March 2011. The hotel was very nice and in a good spot. It had a lot of potential of being a great hotel but lacked the service to do it. First, there used to be a Starbucks in the lobby which has been turned into a leftover coffee station. They serve Starbucks coffee but that is the extent of it. The Starbucks shelves were filled with fruit and bottled drinks. The size names were even changed. For example instead of the Venti size drink they called it Supremo. There was a cute lounge/bar that also had a lot of potential but there was no bartender during the day if you wanted a frozen drink by the pool. A member of the staff told us that there used to be a tiki hut outside for drinks but it was closed. They even keep the gift store locked and if you want to go in a member from the desk will give you a key. There are places within walking distance like a CVS, shops & restaurants like Outback & Irish Pub. There is complimentary transportation within 2 miles. The pool area was nice except our first day there was some type of sporting event booked there and there were a thousand kids playing soccer around the pool. After that it was very relaxing including the great cabanas to lounge in. Overall we had a good experience but wish they would realize they could be so much better.", "title": "A lot of Potential", "user": "jursygirl", "date": "April 22, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105041662}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at this hotel for 3 nights. We arrived at noon, but check-in was at 3 and no rooms were available at that time. The lady at the front desk was very rude about it, handed me back my reservation and just told us \"check-in is at 3\". I was not impressed with that initial interaction, but I put it down as her having a bad day.", "title": "Terrible Service", "user": "Crandee", "date": "April 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 103064056}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "We came back at 3 and someone else helped us; she wasn't rude, but check-in took a very long time. She was unable to locate my partner's Hilton Honors Rewards on the system (we went back later and the person at the front desk was able to locate it with no issues). At this point my partner and I were getting very frustrated and just wanted to get to our room.", "title": "Loved our time here!", "user": "Showagapelove", "date": "March 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 102106807}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Once we finally got checked in we tried to find our room based on the directions that were given to us, but she failed to mention that there are a couple of different buildings and that we were located in building B. After walking around and getting lost we finally located our building and room. We got one of the older rooms and it showed; the shower head was cemented to the wall on an angle and could not be moved, so that you had to lean to the side in order to shower. We called and complained about it and were placed in a renovated room the next day, which was a definite improvement.", "title": "We enjoyed our 20 days at the hotel\"", "user": "LosSmiths_11", "date": "March 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 100673016}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "On the day we checked out we wanted to print our boarding passes at the business centre, but their printers didn't work. We had to have someone at the front desk print it for us from their end.", "title": "I've stayed in worse..!", "user": "georgiebest7", "date": "March 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 100622869}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Everything about this place was fabulous!They really spoil you.warm cookies at check in.beautiful rooms,comfortable beds.gym,and pool.the restaurant food was great.coffee bar nice touch.business or pleasure,I will always stay here in the future.underrated,it deserves 4stars.", "title": "What a treat", "helpfulness": 1, "user": "mattata1", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122743532}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband and I just spent two lovely weeks at the Doubletree Hotel in Palm Beach Gardens, FL. Included in our extremely reasonable rate (well under $100 a night) was a daily buffet breakfast. The wait staff was phenomenal, in particular, one waiter named Fitzroy who absolutely lit up the room! He was so gracious and helpful and a delight to talk to. All staff members are deserving of commendation. The hotel itself is attractive and well-maintained. The pool area is wonderful: there are pillow-strewn, draped \"lounge beds\" as well as comfortable lounge chairs. And drinks and food can served poolside. Our room was roomy and attractive and comfortable with a firm couch and a balcony with a pool view. The location is perfect for beach, shopping, restaurants, cultural venues, etc. We highly recommend this hotel. We will stay there on our next trip to FL.", "title": "excellent value, excellent staff", "helpfulness": 3, "user": "Linda H", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122575859}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Everything about my stay was great. The people were very friendly. I left my cell phone in the room and realized it when I was at the airport. They quickly sprung into action and brought it to me with their shuttle driver. Awesome job.", "title": "Excellent service, they get it", "helpfulness": 1, "user": "Djrrossi", "date": "December 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122219102}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Hotel staff is courteous if you approach them but some are neutral and could be because of age or may be they treat accordingly skin color. Rooms are OK, nice decent and big enough but not modern one since this property seems quite old. Restaurant is pathetic based on the choice for breakfast and the same get repeated for every day. Garden and swimming pool area is nice though i never got time to go even once and see them from balcony only. Room service is ok and english is issue with some folks as they dont understand at all. Love the cookie they give and thats the only free thing here.", "title": "Same breakfast for all 365 days...", "user": "akaushal", "date": "December 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121786649}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "suggestion - please do something about breakfast and provide more options", "title": "Second Time A Charm!", "user": "Groucho0259", "date": "November 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 121021632}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We arrived late in the evening and were pleased to be able to have a late munch at the bar and a cozy bed in a nicely sized room. The hotel was close to the airport and the van service was prompt. The back room had a nice view of the property so we're likely to return if we come around the area again.", "title": "I love the warm cookies !", "helpfulness": 2, "user": "petalos1217", "date": "November 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120723090}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My sisters and I stayed here for 2 nights and were quite pleased with the accommodations, staff and location. We had a very nice room overlooking the gardens and were lucky enough to see a wedding during our stay. The rooms were very clean and modern, very comfortable beds, and nice sized bathroom. I'm not sure why others didn't enjoy their stay, but we had a wonderful stay. The staff at the front desk was very helpful and prompt when we had any requests for restaurant menus, shopping, etc. We came in late one night and were offered hot chocolate chip cookies and had a few laughs with staff. It was very convenient to many shops and restaurants and having a Starbucks there was a plus. Will definitely stay here again and recommend to others.", "title": "Wonderful, Wonderful, Wonderful", "user": "tootles1", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120565855}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I am a commercial airline pilot. Sandy, the front desk manager, picked us up at the airport. The van was right there as we walked out of the terminal. She had cookies and room keys in hand. Thank you very much! Flight crews really appreciate that kind of service!", "title": "Van service excellent", "user": "Reallyfreqflyer", "date": "October 31, 2011", "detail_rating": {"service": 5.0}, "id": 119943159}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I would guess this facility is about 30 years old, but it looks to have been totally renovated in the past few years. I'm guessing they replaced just about everything in the rooms except the tubs. The baths have low ceilings and the wall texture dates the place a little, but overall everything is very nice. The beds are Temper-pedic. I found them to be firm at first but i adjusted quickly and liked them. One of the other dads on our team said that his back was killing him after sleeping on these beds. Mattresses are a definitely a personal preference type of thing.", "title": "Older hotel but in good condition", "user": "William A", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119680000}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The pool area is very nice with small covered couch size cabanas available. I found the service to be very friendly and helpful. Would definitely stay there again.", "title": "Just OK!", "helpfulness": 1, "user": "JAmerican2", "date": "October 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119362997}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Friendly and courteous staff, perfectly clean and pleasant environment plus nice and spacious rooms. Added advantages were reasonable price, free internet, free parking and excellent buffet breakfast all included in price. The minor maintenance problems were promptly taken care of. We had two rooms for six nights each and everything went as expected. Hotel is centrally located to all sight seeing points of interest of the region. The number of business meetings held there during our stay confirms that the management looks after their clients. I won’t hesitate to recommend this hotel to others going to Palm Beach area.", "title": "The hotel was recommended to us by a friend and we were pleased to follow her suggestion", "user": "WandererBo", "date": "February 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97253502}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "My friend and I stayed at this Double Tree over a long weekend early in February. We were greeted with smiles and conversation at the front desk. The hotel has beautiful decor, grounds and atmosphere. Service was outstanding from the free cookies, free shuttle service within a 2 mile radius, helpful suggestions for resaturants and shopping, and responsiveness to our needs as customers. I have traveled to many places and this hotel made my top 5 for their excellent service. Our toilet kept running one night and they had it fixed quickly along with a voucher for another free cookie. Breakfast was exceptional with healthy options and made to order omlets. Wi-Fi is available and free along with comfy beds. We will be back!", "title": "Friendly, Excellent Service, Beautiful Grounds", "user": "Macks7477", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97149342}, {"rating": 1.0, "title": "Not Worthy of the Hilton Brand", "text": "We are Hilton Honors Members and very faithful to Hilton branded hotels, but this one is simply not worthy. We were travelling with our pet cockerpoo and needed a pet friendly hotel. Checking in late on a Saturday, we were assigned to a room with 2 queens on the 3rd floor, not the king room requested, where we registered to stay for 6 nights. We also had requested a connecting room starting the 4th night for our son and his toddler, and were told that that would be available on his arrival. On my son's arrival, we were told that because we had a dog, we could not be given a connecting room, except two handicapped rooms on the first floor, which when checked, not only smelled badly (not of dog or cat), but were noisy, etc. The carpeting in this facility is old and stained and badly in need of replacement. Our beds were made, but housekeeping was poor (lamp table and desk had food residue left unwiped) shower leaked all over floor (curtain would not close completely.) While staff was courteous, they just didnt seem interested in helping us, but simply yess, I apologize for thatted us to death. We eventually arranged for housing for our dog with a friend for the final 3 days of our stay and moved to a new Hilton Garden Inn opposite the Gardens Mall, which was one of the best Hilton Poperties I have stayed in. I recommend that anyone give up the cookies at the Doubletree and move to the Hilton Garden Inn instead. Close to the Gardens Mall and the Downtown Center, its within walking distance to both.", "helpfulness": 1, "user": "debtlaw", "date": "January 12, 2011", "id": 92699735}, {"rating": 3.0, "stay_parameters": "Stayed January 2011", "text": "I was looking forward to my stay, I only wish they felt the same. My room didn't have a coffee maker, alarm clock, or TV remote. I called the front desk and they had everything sent up within 30 minutes. It was unnerving; what happened to the room before our arrival? The hotel is right off the highway and it is very loud in the room. There were only two full size towels in the bath. I am used to having 4 at other hotels. Perhaps it's because my last stay was at The Omni in Indianapolis which is ranked highest in customer satisfaction that caused such a disappointing stay!", "title": "Good for business, not for pleasure.", "user": "Roos22", "date": "January 12, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 92615661}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "Even though there were some problems, the staff was helpful and kindly took care of the missing things in the room. The pool was the highlight of the hotel, and one of the warmest, too. There is a hot tub, however, it's located in an awkward place. The pool is surrounded by gardens, but the hot tub is in the middle of maintenance rooms and bathroom.", "title": "Singles, watch that you don't get stuck with a room by the highways", "user": "maryoFlorida", "date": "January 10, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 92423032}], "location": {"country": "United States", "city": "Palm Beach Gardens"}, "stars": 3.5, "variance": {"poor": 26, "average": 49, "very good": 89, "terrible": 14, "excellent": 141}, "aka": "Doubletree Palm Beach Gardens", "slim_ranking": 0.636363636364, "description": "Located just 8 miles from Palm Beach International Airport:(PBI), and just west of the beaches. The Doubletree offers a Zen like atmosphere that slows you down from the hectic pace of the work day. It starts from the moment you enter the lobby with its' reflective black marble floors and three tranquil waterwalls. This combined with leather seating, rich wood surfaces, tea light candles, and soothing music provides for a relaxing start to your visit with us. A resort style swimming pool complete with 5 cabanas, a Grotto pool bar, and lush tropical landscaping will afford your attendees the feeling of being in a true resort environment. All 279 of our guestrooms afford full balconies, complimentary wireless Internet connectivity, Samsung flat screen televisions, Wolfgang Puck coffee makers, ergonomic desk chairs, and Tempur-Pedic beds. Upgrade to a PURE room that provides a 99% allergen-free environment through the technology of this air filtration device that purifies the air with the use of tea tree oil.Dining within the OZ (oh zee) restaurant offers a refreshing change of pace from your typical hotel dining room. Offering a Steak & Fusion menu, the Oz has your health and your wealth in mind with its new calorie counting menu by the oz."}