{"user_rating": 4.5, "review_count": 600, "name": "DoubleTree by Hilton Durango", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Durango has several older \"atmospheric\" hotels, but our favorite after 20 years is still the newer, beautiful Doubletree (formerly the Red Lion Inn). The rooms are large, quiet, very nicely furnished, clean with very comfy beds and great views of the Animas River or the town of Durango. We always request a balcony room on the top floor. Try to request a room closer to the middle of the hotel if you can, as the rooms at the very end are a bit noisier, getting noise from the converging roads on both sides. The bathrooms are large and very clean. The closets are nice-sized and come with more than the usual 6-8 hangers for your convenience. The large-ish balcony has two chairs and a small table.", "title": "A Beautiful SIte", "helpfulness": 10, "user": "LynninNM", "date": "September 27, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5882238, "likes": {"liked": "— Large, well-furnished rooms + location+views", "disliked": "— Great (and easy) hook-ups at desk in each room. Request river view room on top floor, preferrably towards the middle of the hotel."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The hotel boasts a large, convenient restaurant just off the lobby with good and a great riverview. With so many wonderful restaurants in Durango (try Sweeneys) , we tend to just eat our breakfasts at the hotel. In summer there is also a lovely outdoor patio bar/grill on the river.", "title": "you could starve to death here", "helpfulness": 4, "user": "Corvos", "date": "September 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 5833280, "likes": {"liked": "— The location was convenient to the train station", "disliked": "— Impossible to get food in the hotel, price for food and room way high, jammed with bus tour people"}}, {"rating": 5.0, "title": "The Doubletree was great as always!", "text": "Don't miss their great gift shop. The ladies who run it are friendly and great Durango ambassadors. We are constantly amazed at the quality, selection and reasonable prices of the items they stock. Personally, I love their great selection of women's clothing and always seem to find a great jacket, skirt or top that I can't live without ; - ) They also carry great food items to take back home as gifts, as well as the usual toiletries, soft drinks, snacks, etc.", "helpfulness": 3, "user": "svann", "date": "September 16, 2006", "id": 5807387}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The exercise room is on the small side, but the equiptment is top notch. One window-wall overlooks the river and one looks out into their indoor pool room. The pool is very user-friendly, as they keep the water cool but not enough to startle you. It's also very kid-friendly, although on our last visit, my daughter and I were the only ones using it each afternoon. This area also has great views of the river. There is an adjacent hot tub. Large, fluffy towels are stacked for your convenience to one side, as well as tables and chairs to just sit and relax.", "title": "Awesome sights and sounds on the Animas River", "helpfulness": 6, "user": "Travel_Reviewer20", "date": "August 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5725915, "likes": {"liked": "— Location", "disliked": "— Indoor Pool"}}, {"rating": 4.0, "title": "Not much to do", "text": "My wife and I stayed here this February for two nights because we wanted to go to Chaco Canyon and we felt that Durango was probably the nearest place with quality accomodation. The hotel is well decorated and the rooms are pleasant. The reception staff are efficient and friendly. The restaurant is poor ! Do not eat there go to Applebees a few hundred yards up the street. There is not much to do in Durango except catch the train to Silverton. When you get to Silverton it is an imitation Western Town and there is even less to do (except look in tourist shops or eat and drink ) and you are trapped and have to wait to take the train back", "helpfulness": 2, "user": "DavidBLancs", "date": "March 17, 2007", "id": 7179031}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Beautiful hotel in the heart of Durango, across the street from the best dog park we've seen! It was fantastic! Very nice room, nice bed, nice service, and dog friendly - perfect for a road trip!", "title": "Great place, dog friendly", "user": "MindyKBoulder", "date": "December 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6501822, "likes": {"liked": "— nice bed and close to dog park"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "My wife, 2 kids, and I stayed here four 4 nights. We rode the train to Silverton, shopped, and floated down the Animas River while our Expedition was at the Ford dealership being repaired. We had planned to stay only 3 nights but due to car trouble stayed an extra night. The hotel staff helped us get the extra room eventhough they were booked. We had a Great time and a lot of the experience was due to staying here. Get a room with a river view. It's a pretty view. No need to drive a car to shop if you stay here - it's very walkable to all the downtown shops. Also, if you are planning to ride the train this is a good place to stay because you simply just walk across the street ( a very busy street). Get up early and eat at McDonalds before you get on the train. The pool is also nice - my kids liked it. Helpful staff too.", "title": "Great Location!", "helpfulness": 5, "user": "loggerOH", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6088588}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This hotel is about as good as it gets for location and luxury for families in Durango - only drawback is it is kind of $$. But what is'nt $$ these days!!", "title": "Comfort and convenience at the Doubletree", "helpfulness": 6, "user": "benaround", "date": "October 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5924733, "likes": {"liked": "— Riverside location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "We selected the Doubletree from Trip Advisor. It is 2 blocks from Main Avenue, so convenient to all the restaurants, bars, and shops. A bonus for the Doubletree is it is located on the Animas River: our riverside room (thanks, Heidi!) was quiet and the view was tranquil and beautiful. The hotel is modern with Western-themed architecture and decor. The dining room overlooks the river and we enjoyed breakfast there. Our room was large and clean. Internet was free. We used the jacuzzi, pool, and small fitness room. Service personnel were attentive. I've stayed at the Strater before: it is a different type of experience, like stepping back in history. The Doubletree is 2 blocks away and has more amenties.", "title": "A good headquarters for outdoor activities", "helpfulness": 3, "user": "Capital Culture", "date": "October 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5921372, "likes": {"liked": "— Ease to downtown; helpful staff", "disliked": "— Best bargain (free) for long trip from the airport. Call in advance."}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 19, "average": 54, "very good": 219, "terrible": 9, "excellent": 299}, "aka": "Doubletree Durango", "slim_ranking": 0.1, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Low-rise Hotel set on the banks of Animas River at Highways 160 & 550; convenient to Fort Lewis College & tourist attractions."}