{"user_rating": 4.5, "review_count": 152, "name": "Doubletree Suites Bentonville", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I visited Bentonville, AR recently to tour the new Crystal Bridges Museum. After a long day of walking the museum and its adjacent trails I looked forward to going to the hotel to check in and get cleaned up for dinner.", "title": "The Epitome of Perfection", "helpfulness": 2, "user": "THarrington", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130864391}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "The lobby is uniquely designed. Gone is the long check in desk. It has been replaced with several check in kiosks. The agent at the kiosk greeted me promptly, recognized me as a Hilton Honors member and placed me on the HHonors floor.", "title": "Bentonville Doubletree Suites", "helpfulness": 1, "user": "fourhundred", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130510445}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The room was spacious, smelled and looked clean, and was beautifully decorated. The suite contained a large High Def TV in the living area and a smaller High Def television in the bedroom.", "title": "Beautiful hotel - very clean", "helpfulness": 2, "user": "lesleyc64", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128413948}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "The soaps and shampoo collection the hotel uses smelled great. The product is Citron by Crabtree and Evelyn and I liked it so much that I am contemplating buying some from the C and E website.", "title": "Beautiful", "user": "Jojovolleyball", "date": "March 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127030018}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The hotel has an indoor swimming pool, a fitness center and an onsite restaurant that contains a lounge where you can get some delicious adult beverages.", "title": "Very Comfortable Hotel", "helpfulness": 1, "user": "nvtravel31", "date": "March 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126949777}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "My husband and I stayed one night in this Doubletree Hotel because he had a business meeting in the hotel. We had a suite with a large bathroom. The only complaint was that to have 2 rooms both were very small. The living room had a couch and flat screened TV. It also had a desk and chair. We had a refrigerator and micro wave. It would be good for a long business trip. Everything was very clean and the hotel appeared to be new. We would stay there again.", "title": "Friendly staff and very clean", "user": "leslieh33", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 137785511}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Very clean and well appointed. Always great service from all departments. Restaurant has a very good breakfast. My company has individuals that have specific dietary needs that require them to bring thier own food. The hotel is very accomodating and heats it for them. The list is long of things we have requested and they have happily obliged.", "title": "One of the nicest in Bentonville", "user": "Arkybob75", "date": "August 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136566259}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I recently stayed in Bentonville during a business trip. The hotel is clean and the service is great. The rooms are spacious and the beds are comfortable. There are plenty of excellent restaurants in the area for business travellers. You will need a car to get to them however.", "title": "Relaxing Stay", "helpfulness": 1, "user": "FlightRisk107", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136176309}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Recently, my bro-in-law invited me to stay with him while he attended a conference. This place is excellent. I usually stay at Marriotts, so this was new for me. The employee at the desk gave us each a cookie upon arrival. The lobby was beautifully decorated and well-lit during the day. Free coffee or hot drinks all day! The room was outstanding. Updated well. We had brought a Blu-ray player but we could not connect the HDMI chord because it was blocked by the mount on the wall. The employee at the desk came up immediately to try and remedy the situation. When our attempts were fruitless, he ran down and provided us AV chord for the time we were there.", "title": "This Place is High Class All Around.", "user": "JackalopeSighting", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 135470828}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I could not believe how comfortable the beds were. They were luxurious! The next day we had another issue was again addressed immediately. It is rare to find a staff who addresses issues this quickly.", "title": "Hospitality and Convenience", "user": "campbellkar", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 135465004}, {"rating": 3.0, "title": "It's a shame", "text": "Greeting was excellent - room was comfortable - breakfast was fair - but, air conditioning was a disaster. When it cycles on - what a noise. When it cycles off, it stays off too long. You are covered in perspiration. It felt as though the entire system was shut down around 2:30 am and did not come back until 4:00 am. We stayed two nights and it was the same both nights. Lowering the temperature settings did not alter the results. This is a new hotel where you expect the cooling system to operate in the background, not to dominate your stay.", "user": "Minotlight", "date": "July 20, 2012", "id": 134906337}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "It's a shame.", "title": "Delightful Hotel", "user": "Typhoon925", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134658265}, {"rating": 5.0, "title": "Incredible hotel!", "text": "My husband and I spent two nights at this hotel while visiting relatives. Very clean, staff was friendly and helpful, our room was great and we look forward to staying again during our next visit. And, the chocolate chip cookies are delicious!! Our daughter-in-law is pregnant and chocolate chip cookies are a craving for her so the front desk staff was more than willing to \"indulge\" her in this (and me too!)", "user": "BethBoyd", "date": "July 9, 2012", "id": 133951718}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Had a great stay at this beautiful hotel! It was so convenient to everything. Easy to find. Beautiful decor, clean as a whistle, very comfy beds. I highly recommend and will sure return. Thx!", "title": "Customer service mishaps", "user": "brandi147", "date": "July 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133747895}, {"rating": 5.0, "title": "Art Lover \"Crystal Bridges Comfort\"", "text": "We stay at Doubletrees all the time, but this was by far the worst experience. When we were checking in the front desk personnel did not even look at us and she forgot the cookies, which isn't a big deal, but when we got to our room there was no water bottles. My husband called down to the front desk and they apologized and brought up everything. She also gave us 2 comp cards for appetizers. I went down to the bar and ordered chips and salsa. The bartender said it would be a few minutes. 10 minutes later she said that they were out of salsa! I would have been just fine if she had just told me up front. Then this morning we had room service and I had ordered cereal. When I looked closer, there was no bowl or milk. My husband did not have butter or jelly for his toast. 3 trips later by room service, we were able to eat. Food was ok.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 7, 2012", "id": 133691928}, {"rating": 3.0, "title": "Beware of the \"sometimes\" smoking rooms", "text": "A room is either smoking or non-smoking. It cannot be both.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 13, 2012", "id": 140200924}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I arrived late in the evening and noticed a stench in the room, but let it slide. The next night upon arriving back to the room, I noticed the same stench. And when I sat on the sofa, I saw a cigarette burn!", "title": "Rare switch for a Marriott member", "user": "amylister", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 140200051}, {"rating": 4.0, "title": "Best in the area", "text": "I called the front desk and they confirmed that this room was \"sometimes\" used as a smoking room. Sometimes? Apparently they crack a door and run a fan and call it good. They said they had no rooms to move me around.", "user": "atima", "date": "September 7, 2012", "id": 139693437}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Staff said they would note this on my account. Umm... it is on the profile from when the room was booked.", "title": "Love this place", "user": "Stormygirl71", "date": "September 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 139246668}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "What if I was asthmatic? What if I had brought my kids? For $170/night I would like to have a room that doesn't smell like a late night at a bar.", "title": "Great Stay", "user": "carmel57", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138680631}], "location": {"country": "United States", "city": "Bentonville"}, "stars": 3.5, "variance": {"poor": 3, "average": 7, "very good": 31, "terrible": 4, "excellent": 107}, "slim_ranking": 0.2, "description": "The DoubleTree Suites by Hilton Bentonville is Arkansas' premier facility in Bentonville. Our hotel offers convenient and easy access to I-540.Our facility offers easy access to Walmart Headquarters, just 2 miles away! Other corporate offices nearby include Tyson Chicken and J.B. Hunt! If you are here for leisure, attractions such as the Crystal Bridges Museum, Pea Ridge National Military Park, Beaver Lake, and Walton's 5&10 are nearby!Our hotel offers two-room suites with separate bedroom and living areas, downtime in our indoor pool and whirlpool, dining and beverage options at Bistro 301 and 3ZERO1 Lounge, and a warm signature DoubleTree cookie anytime your heart desires. Come stay with us at the DoubleTree Bentonville."}