{"user_rating": 4.5, "review_count": 138, "name": "DoubleTree by Hilton Des Moines Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This hotel is a definite keeper on our list. Beautifully appointed in every way, from the spacious and elegant lobby to our large and comfortable room. Also included are tickets for evening drinks as well as breakfast in the adjoining restaurant. A great find at a surprising rate! Keep up the great job, Radisson!", "title": "Beautiful hotel!", "user": "bessiedear", "date": "June 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68036710}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We had a great experience at this hotel. I stayed here with extended family for a graduation. We thought the rooms were comfortable, although I'm not a big fan of the sleep number beds. The hot breakfast buffet was good, and the drink tickets at the hotel bar were a lovely extra. Didn't try the pool/hot tub, but it looked well maintained. Although \"airport\" is in the hotel's name, we never even heard a plane overhead.", "title": "Great little extras", "helpfulness": 1, "user": "SushiFoodie", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64391261}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Stayed here for a family wedding! Great value for the $99 rate. We were given free hot complimentary breakfast (it was really good!), 4 drink tickets for the bar (that in itself would have been $40) and free shuttle to the wedding reception. What more could you ask for?! The pool was even open longer than it said it would be... we were in there at midnight but I think closed right when we left. :)", "title": "Great Hotel & Value", "helpfulness": 1, "user": "Cubsdiva", "date": "December 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 50960926}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Overall it was very nice.. the room is a little outdated w/decor/color and the bathrooms could be bigger & upgraded as well, but it's not a deal breaker. They had a sleep comfort bed, which did really WOW me but it was nice to see what the hype on those is about.", "title": "Nice Anniversary Package", "user": "nahdogg", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 48315764}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Would stay at again hands down esp for the extras (breakfast/drinks)", "title": "Great Stay", "user": "Allison399", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 44306942}, {"rating": 4.0, "title": "Great Stay", "text": "Family of four spent 4 nights along with 9 other families and had a great stay. Excellent front desk help accomodated our every need. The free breakfast is a full buffet in their restaurant, including scramble, potatoes, bacon, french toast, cereals, bagels, fruit, and all beverages. Rooms are nice and clean, although the beds were a little undersized in rooms with two beds. Would also liked to have had a refridgerator in the room. Indoor pool and hot tub were great along with the fitness room and outdoor patio. Received two complimentary drink coupons upon check in which was a nice welcome. Johnny's Italian Restaraunt may be the best food in Des Moines. Everyone in our group loved it.", "helpfulness": 3, "user": "ChiefBT", "date": "August 1, 2004", "id": 2350306}, {"rating": 5.0, "title": "The reviews are accurate, a great hotel", "text": "I read the comments and decided to stay here, never staying at a Radisson before. This place exceeded my expectations and would recommend this hotel to anyone staying here. The only caviat is that it is a litlle out of the way being near the airport, but Des Moines is pretty small and easy to get around in.", "helpfulness": 2, "user": "ratherbrunning", "date": "June 2, 2007", "id": 7733397}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We have family in Des Moines, so we've stayed at a few other hotels in the area. The Radisson beats every other hotel we've tried. The room was quiet, clean, comfortable and spacious. The free Internet access was great. The staff were friendly and helpful. The airport is right down the street. This hotel will be our first choice in the future!", "title": "Great Quality and Value", "helpfulness": 2, "user": "CCRR", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5772747, "likes": {"liked": "— Location", "disliked": "— No complaints"}}, {"rating": 5.0, "title": "Love this place!!", "text": "This is a wonderful place to stay. The staff does everything in their power to help you out and make your stay pleasant. It is spotless, with wonderful rooms.", "helpfulness": 3, "user": "gbearsis", "date": "August 1, 2006", "id": 5535972}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "This is the second year in a row that we have visited this hotel in October. The hotel just keeps getting better! They now have Sleep Number beds where you can adjust the bed on each side to your own firmness. They are FABULOUS. The rooms are extremely clean and ever so quiet. It's almost like you are staying in the hotel all by yourself, even though there are many other cars in the parking lot. The location can't be beat, it's right beside the airport and several of the major roads and highways. We enjoyed the free breakfast buffet at Johnny's Steakhouse and their service has improved this time around. Marsha at the front desk was so friendly and Elva in housekeeping kept our room beautiful everyday. I e-mailed Jeff the manager a week before our visit to let him know that it was our ten year anniversary and he was so nice and friendly. He sent me an e-mail back stating that he would make sure we had a wonderful stay and he was right on the money. Don't even waste your time looking for another hotel because this one can't be beat. We will be returning next Oct. for another incredible stay.", "title": "Pefection For A Second Time!", "helpfulness": 3, "user": "Travelwannabe2", "date": "October 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4011690}, {"rating": 5.0, "title": "Life Saver", "text": "This was our first trip to Des Moines, Iowa and we had originally booked a B&B (on Grand St.) which turned out to be infested with lady beetles (something the government brought in to help with the soy crops, but has taken over Des Moines). We were really thrown off guard and were searching for a place to stay since our other accomodations did not work out. We lucked out when we found Robin at the front desk, originally they were booked solid, but a floor of troops had just received orders that they had to ship out that morning. The room was really clean and for the most part the bed was comfortable. Being on the fourth floor allows you to have very little noise interuption. Housekeeping did a wonderful job at taking care of all of our requests. As far as Johnny's Italian Steakhouse, I have never had more awful service in all of my life. We gave them the benefit of the doubt and tried to eat there three times. The first attempt we had lunch and we were one of two tables seated at 2 p.m. it took over 30 minutes to get two sandwiches and we had to track down our waiter in the kitchen to get our bill. The hotel is great, but the restaurant definitely leaves something to be desired.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 15, 2004", "id": 2825286}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "Was here during this past weekend. The staff was extremely friendly and helpful. Hotel is very well maintained and very clean. There's a Johnny's Italian Steakhouse right in front of the hotel. I thought the beds were very comfortable, and I would highly recommend this place for future travel.", "title": "Great Place to Stay and Staff is Wonderful", "user": "OmahaJoy", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33181818}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Stayed here recently for two nights. Price is a bit high given amentities. I did not perceive any additional perks for it being a Radisson versus the neighboring Fairfield Inn, nor other area hotels. Customer service was top tier. I could hear airplanes, but my room was on the airport side of the building. No managers reception but a coupon was provided for one courtesy drink (for two nights!) in the adjacent restaurant/lounge.", "title": "Average property- Beware of Mattresses", "helpfulness": 1, "user": "readittoday", "date": "February 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 24320944, "likes": {"liked": "— Great staff", "disliked": "— The beds- mattresses not so good."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The hotel promotes Select Comfort beds. Having never experienced a SC bed, I was intrigued. I quickly learned I did not like them. On the second night I was ready to sleep in the tub. I could not get my comfort level selected. I found the HVAC to be noisier than should be in a hotel of this price, too. Room size and bathroom size was average, no more. Parking was somewhat limited, too.", "title": "Great hotel, but noisy", "user": "Kevin18", "date": "April 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 15086700}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The hotel itself was fabulous, very clean, sleep number beds, and helpful staff. Be warned however, if the wind is from the southwest, planes will start departing over this hotel at around 5am (DSM is a UPS air sorting hub). It is loud enough to rattle the windows and the building, even at the bottom floor.", "title": "blocked video ports on TV", "helpfulness": 3, "user": "livesinhotels1027", "date": "December 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 11701695, "likes": {"liked": "— beds", "disliked": "— blocked TV inputs, dated furniture, dark bathroom, ackward sink"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Let me start with what I like about this hotel: free water bottles in room and sleep number bed.", "title": "comfortable and quiet with an excellent swimming pool", "helpfulness": 3, "user": "redlands", "date": "July 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8139970, "likes": {"liked": "— beds"}}], "location": {"country": "United States", "city": "Des Moines"}, "stars": 3.5, "variance": {"poor": 5, "average": 12, "very good": 40, "terrible": 1, "excellent": 80}, "aka": "Radisson Des Moines", "slim_ranking": 0.0222222222222}