{"user_rating": 3.5, "review_count": 2632, "name": "Doubletree Hotel Metropolitan - New York City", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "The rooms at the Doubletree Metro are very petite in size. The decor of the room was plain and simple, lacking charisma. The lobby was also small and many left guests where left standing where chairs were lacking. The bar right next to the lobby, does provide additional seating and has good aesthetics.", "title": "Satisfactory", "helpfulness": 2, "user": "NuTTeRz911", "date": "March 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7013230}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "The hotel was able to accommodate an early check-in around noon; however, don't expect it, as it is rare. The staff members of the Doubletee Metropolitan were friendly and knowledgeable.", "title": "Exactly Right!", "helpfulness": 6, "user": "Wandering_Around11", "date": "March 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6936134, "likes": {"liked": "— cleanliness, spaciousness, location", "disliked": "— price"}}, {"rating": 2.0, "title": "Great Location", "text": "The room was suitable for two adults. It would be a little cramped if you planned on bringing a third guest or a child along. The storage space was minimal, and only four hangers are provided for your convenience.", "user": "pigeonpants", "date": "March 7, 2007", "id": 6928470}, {"rating": 2.0, "title": "Mildew", "text": "If you plan on spending most of your time outside of the hotel seeing the city, then you'll be fine. However, I think the hotel is a little on the pricey side for what you pay.", "user": "Easygoing100", "date": "March 6, 2007", "id": 6922733}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "There are plenty of late-night snacking and dining options around the hotel, as well as a subway stop is less than 20 feet away from the entrance.", "title": "great location", "helpfulness": 1, "user": "keith2", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6919978}, {"rating": 4.0, "title": "Good Stuff", "text": "Location ideal, 5 mins to Grand Central, 10 mins to Times Square. Directly by a Subway station. Surrounded by other glamorous hotels also, making you feel your really n the top area.", "helpfulness": 3, "user": "beauxl2002", "date": "February 6, 2007", "id": 6751179}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "No problems with the staff, and the rooms, though smaller than most US rooms, not bad for NYC. Bed was cracking, very comfortable. The cookie`s a nice touch also.", "title": "High recommended", "helpfulness": 3, "user": "Glenda B", "date": "January 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6634842, "likes": {"liked": "— The location and the high standard of the rooms and service", "disliked": "— ??"}}, {"rating": 4.0, "title": "Great Location", "text": "No problems at all, and close to it all.", "helpfulness": 1, "user": "Froggggie", "date": "January 19, 2007", "id": 6622272}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "I stayed here for 5 nights in November 2006 and couldn't fault the hotel. Staff were friendly and helpful and the room and spacious, nicely decorated, quiet and very clean.", "title": "doubletree great", "helpfulness": 5, "user": "bearody", "date": "January 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6574248, "likes": {"liked": "— location and value", "disliked": "— bar prices"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We didn't eat here but I did order room service which was delicious and beautifully served. There is also a good hotel bar.", "title": "Definitely Recommend!!", "helpfulness": 6, "user": "Sailguy", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6557315, "likes": {"liked": "— Great Location", "disliked": "— nothing comes to mind"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Two night at Doubletree was pretty OK, location great, friendly front-office staff, comfy beds... Not so great: security, anyone could walk-in to the floors, in the middle of Manhattan this is not safe! The carpet was filthy, dusty and the room was small (but that's understandable for NY).", "title": "Okay stay", "helpfulness": 1, "user": "Tany_Jo", "date": "March 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6908738, "likes": {"liked": "— location", "disliked": "— safety"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "I would go again, but I really wish they would do something about the security.", "title": "Excellent location, great hotel", "helpfulness": 2, "user": "DLMCC", "date": "March 1, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 6894173}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "A friend and I went for a girlie weekend and stayed in the Doubletree for 4 nights. We were upgraded on check in (great staff at the desk) and the room was big (by NY standards, small by European standards) and clean. The bathroom was very small but well designed and functional. The location is fantastic, it's a stroll from 5th Avenue shopping and there is a subway station literally outside the door. I'd certainly go back.", "title": "Where's the coffee???", "user": "Penfoldio", "date": "February 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6836598}, {"rating": 2.0, "title": "Ok but security is a worry", "text": "I stayed at the Doubletree Metropolitan for one night on business in Feb 2007. Great location in Manhattan and was upgraded to a king sized room on check-in, which was nice! Room size was OK but the room was a little rough around the edges. Service was excellent as usual for the US. However, the stay was let down by a lack of coffee making facilities in the room. As a brit only in the US for 3 days it was pretty much guaranteed I would be awake at some dreadful time in the morning. Unfortunately room service seemed to stop between 10pm and 6am meaning I had to go 2h without coffee after I woke up, not a good thing. For the price you pay for a room in this hotel this seems a little crazy.", "helpfulness": 2, "user": "Couchiedemon", "date": "February 23, 2007", "id": 6831279}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Location-wise this place was pretty good, but the hotel was long overdue an upgrade. The public areas away formthe lobby were in dire need of a makeover. Our room was small be perfectly adequate, beds were comfortable and the shower was great - albeit a bit on the cold side.", "title": "So-so hotel, worth it if you get a good deal.", "helpfulness": 2, "user": "lightup", "date": "February 22, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 6823921, "likes": {"liked": "— Location", "disliked": "— The staff"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "Wasted about an hour at check in trying to find an acceptable room:maybe it was the\" Priceline NYOP curse\" that sent me to the dungeon but first shown a steamy dingy room with malfunctioing air cond; the next room ac was a bit better but phonewas not working; the 3 rd room bad ac again!", "title": "Lovely lobby but dated rooms\"", "user": "biggerduck", "date": "October 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 83179895}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "Back to the front desk for the fourth time and fortunately this time it was staffed by a lady named Sylvia who listened to my complaints and located a decent functioning room -thank you Sylvia you saved the day and I had a comfortable stay.", "title": "Best value in Manhattan?", "user": "kirker", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 82788285}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "While I heard that rooms on the 2nd floor and some on the 3rd have been updated none of the rooms I saw appeared to be- with the possibloe exception of the beds .", "title": "Will not get the full NYC experience staying here.....", "user": "kythomas", "date": "October 9, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 82698986}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Time for more renovation.", "title": "Mold (fixed) and billing dispute (also fixed)", "user": "donmontalvo", "date": "October 2, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 81839153}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "What I DID appreciate at the hotel was no nickel diming as local phone calls were free and there is abusiness center with 4 high speed PCs also free for guests' use .", "title": "Guest Relations Manager was Excellent", "user": "AdamNovotny", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81332306}, {"rating": 2.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "We did have a few problems however. We had booked directly through the hotel's website so we could make specific requests (twin beds, connecting rooms) which travel agents could not guarantee. It was a little more expensive, but we thought worth it to be sure of what we would be getting. Upon arrival at 4 p.m. we were told if we wanted these requests filled we would have to wait for our rooms, which we agreed to do. After 45 minutes I returned and was told 1 room was ready. We went up to the room to find it was a double with no connecting door! We returned to reception to be told they had no record of our requests (despite the previous aknowledgement). We ended up stuck with non connecting double rooms for the duration.", "title": "Too small, too expensive", "user": "schutie", "date": "February 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 6819616, "likes": {"liked": "— tiny rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "Overall I found the staff (reception, bar staff and concierge) to be rude and unhelpful. I complained twice and asked a manger to contact me but I never heard from them. Disappointing.", "title": "Excellent Location", "helpfulness": 1, "user": "mmmouka", "date": "February 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6788445}, {"rating": 3.0, "title": "Convenient, comfortable - and cramped", "text": "This hotel is vastly overpriced for what it delivers, even by New York standards. The room was so small that I felt claustrophobic. The internet didn't work but I got charged for it anyway.", "helpfulness": 1, "user": "FrogNYC", "date": "February 14, 2007", "id": 6788072}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The three most important features of this hotel are: location, location, location.", "title": "not impressed", "helpfulness": 2, "user": "lisainglasgow", "date": "February 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 6764692, "likes": {"liked": "— the apple martini", "disliked": "— no tea or coffee in the room"}}, {"rating": 3.0, "title": "Stayed every month for 6 months", "text": "I've stayed in this hotel every month out of the last 6, not because it has anything special about it, but it's fairly close to our NY office. I first stayed here in 2003 before it went through the much publicised \"extensive refurb\" and to be honest it hasn't made a huge difference. The lobby and bar area have certainly been improved, but as far as I can make out the only difference in the rooms are a basic flat screen TV, better beds and window blinds that may be more modern but are already showing signs of wear. They also put new shower curtains in. WOW!!!!! My biggest complaint is the the bathrooms are ridiculously small and claustrophobic.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 20, 2006", "id": 5183330}, {"rating": 3.0, "title": "Being Gay at the DoubleTree Metropolitan", "text": "This month they gave me room 1402 which at least has a good view up Lex, but mostly the rooms have poor views (most look out over air conditioning units and the back of office blocks). Basically, if I weren't on tight corporate expenses, and I were paying with my own money I'd look for somewhere else with more character and better value. The gym facilities are not bad and it's worth dropping in for an hour after work. The doormen also have a nice little scam going with private cabs and will charge you $70 to JFK no doubt skimming $10 for themselves in the process. They're more interested in booking you a cab than they are in anything else. When you arrive at checkin they make a big deal of handing over one of their \"legendary Doubletree chocolate chip cookies\". I've never eaten one of them (mostly because I arrive after midnight!!) but to be honest it's a hollow gesture that doesn't even come close to making up for shortcomings elsewhere.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "May 16, 2006", "id": 5079053}, {"rating": 1.0, "title": "Unworthy of the Doubletree name", "text": "If you're paying with your own cash, go elsewhere. If on expenses and you like midtown, it's worth considering only if you can book a King room at least and demand one with a decent view (not at the back).", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 4, 2006", "id": 5034435}, {"rating": 2.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "My partner and I stayed at the Doubletree Metropolitan over this past weekend. Some things to note if you're gay/lesbian and staying here.", "title": "not worth it", "helpfulness": 2, "user": "pineappleguy", "date": "May 2, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 5029644}, {"rating": 5.0, "title": "Great Hotel - Fantastic Location", "text": "1. The concierge didn't give us a room with a King Bed, like we'd reserved on Expedia. This was my partner's 30th birthday and I wanted to provide a romantic weekend for her. I mentioned that the Standard King is what we booked, but she wouldn't budge, leaving us with two double beds. It wasn't a bad room, but just neither what we'd reserved nor expected. I felt that if we were a straight couple, this wouldn't have been an issue that needed explaining.", "helpfulness": 2, "user": "Levi22", "date": "May 1, 2006", "id": 5025684}, {"rating": 3.0, "title": "Customers From Mars", "text": "Caveat emptor: the reviews warned me to expect to be over-charged and housed in a noisy, dirty room located on an un-renovated floor. But Doubletree is a Hilton, right? So it could not possibly be as bad as all that.", "user": "wme79736", "date": "October 22, 2010", "id": 84397482}, {"rating": 5.0, "title": "Perfect Location", "text": "Well, it wasn’t. Quite. The hotel is in a superb, central location. If you like the Upper East Side and the huge range of tempting distractions that will draw you without end along the apparently infinite length of Lexington Avenue, it is just right for you. It’s next door to some of the most expensive hotels in the USA and it is impossible not to experience a frisson of delight at the realization that you are getting the same, or a similar, deal for a fraction of the price.", "user": "fredalyons", "date": "October 20, 2010", "id": 84236611}, {"rating": 5.0, "title": "Fantabulous! - perfect for our anniversary.", "text": "Yet, I found it ironic that everything I had been warned about came to pass. When I checked in I was informed that for my website discounted rate I had booked a room “on a renovation floor.” This meant that the corridors were stripped to bare concrete with the plumbing and wiring exposed and the stimulating scent of wet cement in the air. It hardly mattered. The room was perfectly furnished and finished and you don’t spend much time in a hotel corridor, but they might have said so when I booked. Am I the only person who would not only be undeterred but would leap at a “renovation discount”? To compensate, I was given a free breakfast during each day of my stay, which was very generous, except that it wasn’t free. I was billed for the service fee, which was pretty harmless, but very rude.", "user": "deryckp", "date": "October 19, 2010", "id": 84080737}, {"rating": 3.0, "title": "Excellent location and customer service but lacking in usual amenities expected at a hilton.", "text": "When I checked out, some intuition, probably planted by the reviews I had hitherto regarded as gratuitously negative, made me check my bill. It just didn’t add up. There was something wrong. By my calculations I could not get within $100 of the total. What with the service fee for breakfast and the various State and City taxes I realised that I might be calculating things incorrectly. I drew up a spreadsheet on my laptop and spent twenty minutes trying to work out where my figures erred. It turned out I had been billed a daily rate considerably in excess of the agreed tariff. This was instantly corrected by the accounts department (well, as instantly as one can be when there is a check-out line of fifteen or sixteen people with the same complaint), without the slightest hesitation, explanation or apology. Could it be that this is a common occurrence, that maybe this hotel rather prefers to wait for customers to complain rather than ensure the accounts are correct before they are handed to the nocturnal visitor who shoves them beneath the crack in the door at 4.45 am?", "user": "callisto11", "date": "October 18, 2010", "id": 83946687}, {"rating": 4.0, "title": "Friendly and attentive service in a very convenient location.", "text": "I had had a narrow escape as I do not incur “additional room expenses” and am inclined to pay hotel bills without thinking that they might have overcharged me by almost 100%.", "user": "reneCincinnati", "date": "October 13, 2010", "id": 83312099}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This was my first trip to New York City and it was awesome largely because of this hotel. The hotel itself was clean and inviting. The beds were great and the pillows were so nice I wanted to take them home. The rooms are small, as is common in this particular City, but well maintained. The staff was helpful but do not eat breakfast there it was expensive and awful. The food at the hotel bar however was fairly good. But, the best feature about this hotel is its location. The metro/subway is right there so you are only two stops from Central Park and you are a 10-15 minute walk from all the main attractions (Empire State Building, Time Square, Madison Ave, Park Ave etc.). Plus, you have great places close by to dine at and bars/clubs to go to without having to leave this very safe and popular area of the City.", "title": "Location and Comfort", "user": "Loves-Vacation09", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 80990221}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Stayed Sept.8th on the 8th floor in a Queen room. Clean, simple hotel with a small bar with food/room service. Knowledgeable doormen and so close to subway makes getting around the city easy. Only paid $209, so felt I got good value for midtown.", "title": "Good Value in midtown for $200", "user": "OakvillePaul", "date": "September 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 80819348}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Great hotel, great service!", "title": "Great Location - Would Recommend!", "user": "Salsa81", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 80593049}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Big king size bed all to myself, room was very clean and comfortable, would have been plenty big enough for 2 people! Great location for exploring the city.", "title": "Ask if you are in the SMALL or LARGE rooms upon booking.......", "user": "Vegasluver1", "date": "September 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 80229589}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "My Mom, daughter and I stayed here for one week in September, and we booked it on Expedia.", "title": "Does the Job", "user": "CGeorgeMassachusetts", "date": "September 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 79577060}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "we have just returned from a weekend break in the doubletree and though it was OK it was not great. Hotel is in a great location couple of blocks from 5th ave most places within walking distance. We stayed in a room on the 16th floor, rooms where a good size but not very clean, when we arrived there were hairs in the bath, the bathroom overall was not very clean could have been a lot better and apart from making the bed I dont know what the housekeeper done!!. The bed was very comfortable, but the air condition was quite noisey and could not be altered or turned off it didnt seem to do anything but make a noise, the staff on the front desk were not very helpful/friendly but I found the staff in the restaurant very polite and helpful. I have stayed in many 5 star hotels in the US and never come across the system the Doubletree had in place for the mini bar if you picked something up from the tray to see if you might want it but you decided not to so put it back if it had been out of the tray for more then 20 seconds you where charged for it also which I have done in the past and not been told I cant is put other stuff in the mini bar fridge this again caused a charge which when mentioned at the front desk I was told \"well its not a fridge its a mini bar\" in quite an unfriendly manner, you are notified of the charge on a small note placed in the tray which at first just looks like a price list stuck between the goods on the tray.", "title": "ok for a short stay", "helpfulness": 2, "user": "kaiser01", "date": "March 29, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 7244508, "likes": {"liked": "— location,cookies,comfortable bed", "disliked": "— staff attitude,cleanliness"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Stayed here for three nights and overall the stay was good. The bed was very comfortable and the room was nice. I found the restaurant to be a bit lacking. The first night I visited it, everything I asked for from the menu I couldn't get for some reason, I ended up settling for something I didn't really want because I was hungry but didn't each much of it because it wasn't great. The waiting staff were very friendly but seemed to be in a constant state of confusion and flurry even when the place was near empty!!! I had breakfast one morning and would never do it again - it was awful and over-priced.", "title": "Nice Hotel", "helpfulness": 3, "user": "TCall07", "date": "March 28, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 7237023, "likes": {"liked": "— The bed! Very comfy", "disliked": "— The disorganised staff and the restaurant"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The bar was nice, unusual for a hotel bar and I really enjoyed the atmosphere. The cocktails were tasty but I order the same one three times and got a different version of it three times. The cocktail waitress could've been a bit friendlier - or friendly at all might have helped!", "title": "Below Par", "helpfulness": 1, "user": "christian30", "date": "March 26, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 7225981, "likes": {"liked": "— concierge", "disliked": "— property condition (poor)"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The hotel itself and the room were nice and most of the staff were too just not very organised- although check in was a breeze and the receptionist very nice.", "title": "Loved It !", "helpfulness": 1, "user": "taprennoc", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7195414, "likes": {"liked": "— The Room", "disliked": "— The Bathroom was a little bit small, but the overall size of the room made up for it."}}, {"rating": 4.0, "title": "great", "text": "The day we were leaving we checked out and left our bags with the concierge and asked to get a taxi booked for our flight for later that day, he was very friendly and took the details professionally. We arrived back at the hotel later, retrieved our bags, tipped him and sat awaiting our taxi as we were half an hour early. 40 minutes later, stil no taxi. A different conceirge came over and asked us what we were waiting on and so ensued a process where we realised that the previous guy had obviously forgotten to book the taxi and was ringing to get one now. He told us 7 minutes. 15 minutes later and no taxi - with bad traffic we knew we were pushing it for the flight and asked him if he could just flag one - something he probably should have done from the beginning. We ended up paying more for the taxi and although we made our flight I would suggest if staying here do not leave your airport transportation in the hands of this hotel!!", "helpfulness": 2, "user": "rajdc", "date": "March 15, 2007", "id": 7165749}, {"rating": 4.0, "title": "Stop giving it such a hard time!!", "text": "I recently stayed at this hotel for 5 days for my 30th birthday, and having booked it before finding Trip Advisor I was a little worried about staying there. Well for those of you going there fear not. We checked in, and everything was ready and waiting for us including our warm cookies which were yum by the way. Must say they had not managed my request of a smoking room, but they never guarantee it anyway. There were three of us stsyong in our room in two double beds which were so comfy. The linen was pristine, and was changed after two days, I then spilt a bit of drink on there and they were changed again. The towels are not changed daily as a matter of course but there is a sign saying to put them in the bath if you want new ones which was done without fail. Did not eat in the restaurant so can't comment, but the bar was great and the little shop carried all the essentials although it did look like just a gift shop from the outside. I found the concierge's that I spoke to very busy but very helpful and knowledgable and not unhelpful as mentioned in some previous reviews. All in all the Doubletree was just what I was looking for. It was very clean, right by a subway station, a five minute walk from Bloomingdales and ten minutes from Times Square. Must mention the Cafe Metro which is next door breakfast for less than $5 and not bad, lovely cakes and fab sandwiches. Come on everyone give this hotel a break!!", "helpfulness": 7, "user": "Boola", "date": "April 11, 2006", "id": 4964104}, {"rating": 2.0, "title": "Expected More...", "text": "My boyfriend and I had waited a long time to get to see the sights of New York, so when we found the Doubletree we were very excited!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 30, 2006", "id": 4775301}, {"rating": 3.0, "title": "Location was great for our stay", "text": "The location is excellent as are the cookies however, that's about it! On arrival the staff were too busy to take much notice of us, we didn't even get a smile with the Hello, and to us British that is very important!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 30, 2006", "id": 4774960}, {"rating": 2.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "The room was very small with no view. The rooms, I guess, are supposed to be 'Retro' however, I would say that they haven't been decorated since the 70's but just had a flat screen TV and some new lamps added. When it came to bedtime, we tried to turn off the heating in the room as it was very noisy however although we switched it off, it carried on. We called the Engineer who was very helpful but he had to totally switch off the heating at the mains which meant no heating whilst we stayed there at all...hmmmm...March is a little cold for no heating! We also had to put a towel against the door to stop the light from the hallway shining through.", "title": "Expected a lot better from DoubleTree!", "helpfulness": 12, "user": "Javelina", "date": "March 26, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4735892}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "We called the Engineer out on a second occasion as the TV / Internet service screen froze and we couldn't check anything, not even our bill!!", "title": "great cookies, lousy service", "helpfulness": 6, "user": "keely027", "date": "March 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 4592400}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Stayed here in November 2006, on our third visit to New York. Wins hands down over the other places we've stayed, and both of them have been pretty good. Maid service daily, clean towels etc.", "title": "Fantastic", "helpfulness": 1, "user": "glasgow1-TRIP", "date": "January 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6548981, "likes": {"liked": "— Location", "disliked": "— Restaurant"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "10 minute walk to Central Park and Times Square. Chrysler building around 10 blocks down Lexington.", "title": "Possibly average, but watch the details", "user": "LondonPoddy", "date": "January 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6533934, "likes": {"liked": "— location", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "One thing I would say, give the restaurant in the hotel a miss, not the best by any means!", "title": "Good value hotel in a very convenient location", "user": "GarDc", "date": "December 28, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 6510550, "likes": {"liked": "— Location", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006", "text": "Stayed for 9 nights over Christmas 2006. 2 adults and 2 teenagers in one room (room 250). Tried to charge us $50 for the childrens breakfasts as max for room package was 2. Manager sorted this out but lots of problems every day re: missing vouchers etc. Breakfast very mediocre and actually unnecessary as the hotel is surrounded by lots of sandwich bars which are very cheap and excellent quality. Toilet blocked (room 250) on 2 nd day, bath outflow (room 736) very slow. Noisy lovers in next door room on 3 rd day necessitated us all moving to another room at 3 am. New room was bigger but had sink in bedroom as bathroom was too small (room 736). Internet was free in lobby - just as well as cable in room was broken - they fixed it with cable across room!! Bathroom ceiling in 250 was peeling (as in your photos) and also mould at bath edge. Also bar cost $22.40 for two gin and tonics!!!!!! Finally the concierges were really only interested in selling trips and restaurants for their fee. Example: Q: Where can we eat on Christmas Day? A: \"very hit and miss, mostly closed, can get reservation at $150 each\"! Theatre tickets offers had 100% markup. Actually, virtually everything was open. We ate in Planet Hollywood (excellent and cheap) and went to Radio City Show (10 min in line, excellent seats) both on Christmas Day. Hot Tip: Must get New York City Pass - saved hundreds of dollars for the four of us.", "title": "Good accommodation, great location", "helpfulness": 3, "user": "Francesca S", "date": "December 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6436835, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The good news: the management addressed all our problems quickly and even returned our passports which I left in the lobby as we were leaving!! The location of the hotel is excellent and across the road to the Waldorf where President Bush stays.", "title": "Fantastic hotel in a great location", "helpfulness": 2, "user": "Cattman", "date": "December 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6366834, "likes": {"liked": "— The comfiest bed we have stayed in for ages!", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I travel to New York on business several times each year and always stay at the Doubletree. In NY, most hotel rooms are small and well worn, but the Doubletree has more space and is recently remodeled. Very comfortable beds! The location is great, making it convenient to get to meetings anywhere in the city. The restaurant is good for meetings (they let you stay as long as you need), although a bit overpriced for the quality. The Metro Cafe next door is perfect for quick meals. I have found the concierge and front desk staff to be adequate, but when traveling on business I don't need my hand held.", "title": "Great NY hotel for the price", "helpfulness": 2, "user": "VMCM", "date": "December 11, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6364226, "likes": {"liked": "— Location, value", "disliked": "— Check-in, restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Well for starters I showed up at the wrong time to check in it was right at 4pm and I think everyone was checking in at that time. Even had lines for the self check in computers. No big deal was not in a big hurry. Very nice lobby which is always a good thing when you walk in to somewhere in NY. When I got to my room I did not know whether I checked into a match box or a hotel room. But come to find out I got stuck in a smaller room (could have been because of the stairs right beside my room). Other then that it was ok. Internet in the room was $11/per day. Bed was soft pillows were ok. Crappy view of the condos right next to the hotel. I do not recommend buying a drink down in the hotel bar/lounge unless you are ready to pay for it (beer $8 / mixed drink $12) maybe I just got the wrong bartender. Of course it is Manhattan. But in all the hotel is nice!", "title": "Great Location", "helpfulness": 2, "user": "gregair", "date": "December 8, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6348255, "likes": {"liked": "— Good Location", "disliked": "— SMALL ROOM"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I booked this hotel through Hilton web site. Looking by the past reviews in which if I had a had chance to read before going I surely would have cancelled this reservation.", "title": "one moldy and rude hotel", "helpfulness": 1, "user": "nailchick", "date": "November 26, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 6178619, "likes": {"liked": "— nothing", "disliked": "— rude front desk personal and moldy conditions"}}, {"rating": 4.0, "title": "New York Shopping Trip", "text": "Front desk personal awful, Charged total stay two times to my card andwas told I would have to take it up with my bank. They would not tak care of it. I had to wait for the holiday to have the bank cancel one of there transactions. Moron at front desk when I was asked for a cookie states you already got one at check in. Now this is true but every Double Tree I have stayed at, which have been many gives out cookies upon requests. When you pay $300.00 a night I don't think asking for a extra cookie is a request that should not be honored. The bathroom had mold on ceiling. Walls are paper thin. We could he our neighbors show they were watching. Problem with toilet in which we reported to housekeeping but they never fixed it. So we took it upon ourselves to fix.", "helpfulness": 3, "user": "Lynnes", "date": "November 26, 2006", "id": 6177692}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Paid 50.00 per person for dinner at the restr. Ha gourmet food is was not. Took us two hours to have dinner. Stayed thirsty the whole time because servers never came around to find out how your food was or if you need any refills. Had to go hunt someone down to even get our bill to pay. Then the bill was incorrect.", "title": "Getting Better, Still a Ways to Go", "helpfulness": 1, "user": "JusticeSalmon", "date": "November 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0}, "id": 6168861}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "Just returned from a four day stay at the Doubletree Metropolitan. Both myself and my friend booked a few months in advance and got a king size non-smoking deluxe room. We also asked for the rooms to be near each other (though not connecting). We were very happy to receive rooms next to each other. I was a bit apprehensive when I read all the other negative reviews, but perhaps you get what you pay for. Our rooms weren't the cheapest, but they were very big for New York standards. The bathroom, however, was tiny but everything was there that you needed including nice Neutrogena products. The bed was very comfortable (perfect after walking all over New York). The air conditioning in my room did work well but was noisy - I was at the end of a corridor so I think that was why. My friend's was not as noisy. The room was well laid out and there was plenty of room for all our stuff. It did not have a minibar or fridge in the room, which we missed especially since it was so hot in New York. The hotel itself is in a good spot - walking distance to Moma, Central Park, shops on Fifth avenue, etc. The concierge was very helpful though the front office staff were a bit snobby. We ended up paying about US$240 per night direct from the hotel's website - this included a full buffet breakfast, so I felt that it was good value for the location, the size of the room and the breakfast. Would I stay again? If I was in New York, probably, but I have decided I am more of a European girl - absolutely adore Paris and just got back from London which I preferred to New York!", "title": "You get what you pay for???", "helpfulness": 8, "user": "jmlparis", "date": "June 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5383581}, {"rating": 2.0, "title": "Lower your expectations", "text": "I've stayed at this doubleTree three times, twice because my company booked it and once because I ended up with it on Priceline. I will never stay there again, but for some it might be an OK choice. First, except for the person who checked us in this last time (who was charming), the staff are either overworked, or totally indifferent, or just rude. I'm not sure which, but either way, no one really cares how your stay is. For instance I asked for more hangers three days in a row. Service is basically crappy, generally no one will answer the phone when you call reception. Location is very good, you can walk a lot of places. It's NY so plan ahead if you want to extend your stay, I've seen rates go from under $200 to over $600 in the course of one week.", "helpfulness": 7, "user": "beachloungerUsa", "date": "June 21, 2006", "id": 5372017}, {"rating": 2.0, "title": "Disappointed", "text": "Housekeeping is very good, and the rooms I've stayed in are clean, and the beds are very comfortable, decent decor. AC is good (although I guess it was broken in some rooms last week). Beware that there are some VERY small rooms, but the ones I've stayed in are OK for NY. Ask at the desk not to be put in the extra tiny rooms -- I'm not sure what the numbers are but you can see from the fire safety maps on the wall -- go back and ask for a bigger room. Unless you hate NY traffic noise, get a room that is not on the back/inside side. I have stayed in both, and the big fans make a droning noise that to me is worse than traffic - zero view. The windows have heavy soundproof glass so you should be OK. try to get a room that is higher than the 10th floor or so -- there are only 18 floors in the hotel, so higher is better for less sound.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5352556}, {"rating": 5.0, "title": "Great place to stay - clean, comfortable and near to everything!", "text": "My biggest complaint - we had a laptop and a hard drive stolen out of our suitcase from the luggage storage last year. Stupid me I actually said 'please put this somewhere safe, there is a laptop inside'. We discovered the loss the moment we got to the airport, but of course the hotel would take absolutely no responsibility and blamed us instead. I suppose they were so worried about liability that they could not be professional and instead were complete jerks - seriously, dealing with them about the theft was a terrible experience. No apologies, no callbacks, total runaround....nothing but hostiility. I recommend locks on your luggage, and check your luggage before you leave the luggage area. I'm sure this was a random event, or one bad apple or whatever, but I've never been so disrespected as I was when I was trying to deal with the stolen laptop.", "helpfulness": 16, "user": "JSRPAR", "date": "June 4, 2006", "id": 5297549}, {"rating": 4.0, "title": "what a value for new york!", "text": "When I got the hotel again on priceline I thought it was a cosmic joke, cause i swore i'd never set foot there again.. My travel service (corporate) told me they got lots of complaints about the hotel.", "helpfulness": 7, "user": "buddhafly", "date": "June 1, 2006", "id": 5289552}, {"rating": 5.0, "title": "No problems, no hassles -- great location, recommended!", "text": "We stayed four nights at the Doubletree Metropolitan, part business, part leisure. It was an all-around good experience; no problems at all. Initially we were registered for a room on the third floor, but all we had to do was ask, and we received an upgrade to the 16th -- important in NY and especially here because the police/fire precinct is next door. All the basics you want -- good water pressure, new mattress, good linens, nice decor, good amenities, never-crowded lobby, business center printers that work, good unobtrusive housekeeping, internet service (not free, but it works well). Very clean, room safe works, no evidence of bedbugs. Nice bar in the hotel, and right next door is a cafe with coffee, pastry, breakfast stuff, much less expensive than any hotel's. NYC isn't cheap -- this was around $300/night -- but here you know what to expect and you get it. To me a hotel should be a place you don't have to think or worry about and this one excelled at that. Also, the subway is right on the corner, and the location is wonderful.", "user": "badpatti", "date": "November 7, 2010", "id": 86313867}, {"rating": 5.0, "title": "Great Hotel and Excellent Location", "text": "This hotel is in a great location right next to a subway station and just a few blocks from the main shopping of Maddison and Park Avenues it was also just a 15 minute walk to some attractions like the Rockerfeller Centre and lots of other nearby attractions.", "user": "YvonneRouski", "date": "November 7, 2010", "id": 86236400}, {"rating": 4.0, "title": "Good location, friendly staff, needs a few tweaks", "text": "Our room was a bit too small for a large family and we needed a roll down bead so I asked if they had a larger room so we could accomodate the extra bed. This was sorted for us and we were gave a much bigger room and the child roll down bed provided at no extra charge. We requested a fridge in each room because we was staying for a week this was sorted no problem again without any charge. The staff was very helpful and friendly especially the ones in the restaurant at breakfast. The buffet breakfast was exellent. We particularly liked the warm cookies on arrival and we was really pleased to be handed a large tin of cookies by the restaurant waiter on our last day for taking home we thought this was a really nice gesture. We would definately stay there again.", "user": "sparkyandlou", "date": "November 3, 2010", "id": 85869979}, {"rating": 5.0, "title": "Excellent location, friendly and helpful staff", "text": "Friendly staff upon arrival, room was very adequate. One thing that I noticed that made no difference in the quality of the location was the poor workmanship in the installation of the towel racks (crooked), sloppy installation of wallpaper (many loose edges/crooked ). I know these items seem and sound petty, but those minor attentions to detail can shape an impression.", "user": "Masons_10", "date": "October 29, 2010", "id": 85293832}, {"rating": 4.0, "title": "Location, Comfortable, Clean & what more can you ask for?", "text": "My husband and I stayed there at the start of our holiday, it's costs but it is worth it. We are going back there for thanksgiving and they helped us with booking a nice restaurant with perfect views. Walking distant to all sights. There is an excellent diner for the best breakfast in town and the most friendly and efficient staff - family owned business I think.", "user": "Fritzandlacy", "date": "October 26, 2010", "id": 84970116}, {"rating": 3.0, "title": "Great Location, adequate accomm. would stay there again", "text": "Stayed in the Doubletree for 3 nights at the end of March 2006. Myself and my mother were on a shopping trip in New York and were looking for a cheap but cheerful place to stay. I had been to New York several times before and knew that location is far more important than room size or luxury. The Doubletree is situated on the corner of 51st and Lexington and is perfect for walking to the obvious touristy things and 5th avenue shopping. As with all hotels the foyer looked very promising and it was only when you exited the lift at your floor that the 1970's carpet came into view. We had a twin room on the 17th floor and barr the carpet in the hallways really couldn't fault it. There were 6-8 lifts which brought you up 17 floors in seconds. Our room was big enough for 2 double beds and we had a lovely clean recently refurb bathroom with powerful shower. The movie channel had all the up to date movies. Check in took no time at all and we got the yummiest choc chip cookie which was novel. We opted for express check out so had no delays there either the only thing I did find unusual was that we had to pay $2 per piece of luggage to be stored after we had checked out as we were not leaving New York City untill later that day. All in all would def recommend the hotel for basic clean rooms in great location. Will def stay there again.", "helpfulness": 4, "user": "suks", "date": "May 1, 2006", "id": 5025086}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed from march the 5 to 12 at the doubletree metropolitan. The check-in was very easy and fast. By the way the cookie was a very nice touch. The room was clean and the bed comfy. We stayed on the 11th flooron the side where the firestation is, it was qiuet. Only the AC was lil bit loud. thats y only 4 points.", "title": "Perfect location nice hotel, good value", "helpfulness": 4, "user": "mathas", "date": "April 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5017825}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "The bathroom was small but clean. Towels changed every 2 days, throw it to the bathtub and u get some new one.", "title": "Just fine", "helpfulness": 2, "user": "ExDirectory", "date": "April 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5008269}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The location was perfect, located right next a metro station.", "title": "Perfect in Every Way!", "helpfulness": 2, "user": "nevadanancy", "date": "April 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4993793}, {"rating": 2.0, "title": "Got Overcharged $2,600 by Mistake!", "text": "Many attractions in walking distance. Rockefeller , Chrysler Building, Central Park in only few minutes away (about 10 minutes). We def. stay here again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 19, 2006", "id": 4988760}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 274, "average": 576, "very good": 1027, "terrible": 187, "excellent": 568}, "aka": "Doubletree New York City", "slim_ranking": 0.618510158014, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "DoubleTree by Hilton Metropolitan New York City is a modern, landmark hotel conveniently located on Lexington Avenue at 51st Street, in the heart of Midtown’s luxurious East Side. The contemporary hotel recently completed a $25 million dollar revitalization project which included all-new guestrooms, suites and meeting space. With it’s ideal Midtown location, the hotel is steps from fashionable Park Avenue, Fifth Avenue shopping, Bloomingdales, the United Nations and many upscale boutiques. Times Square, Broadway theaters, Rockefeller Center, Radio City Music Hall, Central Park, St. Patrick’s Cathedral and The Museum of Modern Art are all within walking distance. Grand Central Terminal and all major subway lines are just a few blocks from the hotel. Penn Station/Madison Square Garden and Port Authority Bus Terminal are accessible via quick taxi ride and the hotel is convenient to all (3) area airports.Each of the hotel’s 764 brand-new guestrooms (including 22 suites) features all-new carpeting, furniture and wall treatments plus brand-new bathrooms. Modern in-room amenities include high-speed Internet access, Sweet Dreams by Doubletree Sleep Experience, 37-inch flat-screen television, MP3 connectivity and brand-new work desk with ergonomic chair. Onsite hotel amenities include a newly renovated lobby with spacious seating area, trendy Met Bar lobby lounge, Met Grill (open for breakfast), room service, complimentary 24-hour Fitness Center, complimentary 24-hour business center, Concierge/Theater Ticket Desk, gift shop, salon and barber shop – all onsite. The hotel has 14,000 square feet of brand-new event space. The hotel is 100% non-smoking. Self & valet parking is available. The hotel allows pets, with a $50 pet surcharge per stay (under 60 lbs). 24-hour Security onsite."}