{"user_rating": 4.0, "review_count": 616, "name": "Doubletree by Hilton Anaheim - Orange County", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I recently stayed five nights at the doubletree. I was in one of the unrenovated rooms. It was clean but not spotless. The service was good but not great. There was no in room safe so I had to use the lockbox at the front desk which was a proceedure and not that convenient. Each time I wanted to use it, someone at the front desk would have to help me. Sometimes they made me fill out a slip, sometimes they didn't. They offered free internet on my rate but it was only good for two hours. Bascially coming back into the room from meetings meant I had to log on again. Not a huge deal but if you offer free internet, why not make it continuous. There was also no fridge in the room and one day I returned at 4:30 and housekeeping still hadn't been in to clean. The breakfast is ok and the people in the restuarant are nice enough. This is also the first hotel I have visited with bouncers in the lobby. They aren't there to get the door, they aren't really there to tell you where to go. If you stand too long in the lobby though, they will ask you your business. Rather strange. Good if you have meetings in Anaheim or south. I would not use this hotel as a base for any business in LA as you will spend lots of time in traffic.", "title": "Probably better for vacation than business", "user": "badwaiter", "date": "October 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 143568858}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "My husband and I stayed a couple of nights here for a quick trip to Disneyland. Several of the hotels walking distance to the park were sold out or very expensive, so we decided to give the Doubletree a try. We stayed in an executive level suite on the 16th floor. We did not have much of a view, but you could see the A from the Angel's stadium from the window in the hallway. The rooms are spacious and clean. The bathroom was small considering the size of the room, but it was fine for the both of us. The hotel offers a free shuttle to Disney every hour - it is a large comfortable bus. We took the first bus out to the park and it was completely full. They did have a smaller back up bus so I think everyone was able to get to the park during that trip. Our room came with free breakfast and it was very good. The restaurant opens at 6:30 am and it is a decent buffet - they also give you the option of ordering eggs from the kitchen so that was a nice surprise. The waitress also gave us cups to take our coffee to go. I thought this was a nice touch. For those without the free breakfast, there is a starbucks in the lobby. I had doubts about this hotel because it is a bit far from the park, but now I would not hesitate to book this again.", "title": "Very good option for a Disney Stay", "helpfulness": 1, "user": "cmoody94585", "date": "October 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143495074}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed in 4 different hotels during our recent vacation in Anaheim and this Doubletree still rises above the rest. The number one reason is the wonderful staff that is more friendly and accommodating than any other hotel we've stayed in. They greet you with a friendly smile every time you enter the hotel and are always striving to make your stay the best possible. The shuttle drivers are especially helpful.", "title": "Our Favorite Hotel when Visiting Disneyland", "helpfulness": 2, "user": "Andrea007", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 143468570}, {"rating": 4.0, "title": "Great overall experience!", "text": "Aside from the staff there are several other things that we really enjoy about this hotel. We like that it is in a very convenient location. It is close to a variety of fast food restaurants, grocery stores, Best Buy, Starbucks, and a shopping mall. We like the free shuttle service that you don't have to share with other hotels and is just a short drive to and from Disneyland. We also like that the beds are very comfortable and the rooms are fairly modern. Although, we did notice that the rooms are starting to show a little wear. The baseboard under the window was starting to pull away from the wall for instance and the carpet is starting to show wear. They may need to do some renovations in the near future to keep their rooms nice.", "user": "Elwaysway", "date": "October 17, 2012", "id": 143007143}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We are always happy to stay here and recommend this hotel to anyone looking for a great place to stay while visiting Disneyland.", "title": "Warm friendly staff", "helpfulness": 2, "user": "Chin71", "date": "October 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142957607}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "The rooms are old and the keys dont work, every tIme we leave the room we have too get a new key.  it was annoying to walk all the way to our rooms and come back agaIn because the key just won't work. Not cool!", "title": "Not what I expected from DoubleTree!", "helpfulness": 3, "user": "Maximus1l", "date": "September 17, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 140493419}, {"rating": 4.0, "title": "Front desk staff very courteous and helpful.", "text": "We stayed one night for our anniversary and when we checked in the front desk Don and William were very cordial in greeting us. After we checked in she upgraded our room to a nicer room for our anniversary. The room however smelled very strong of cigarettes and so We had to up the AC to clean the air. The staff sent up a platter of crackers and cheese and grapes with a bottle of wine, courtesy of the Double Tree for our anniversary. This was such a sweet thing to do. You do not get that kind of service from a hotel often anymore. We had a pleasant visit, the room was clean, NO bed bugs, nice lounge and restaurant with nice wait service and of course your the best Don and William for thinking of us two on our anniversary. We shall see you again next year!", "helpfulness": 1, "user": "cajewels805", "date": "September 16, 2012", "id": 140371736}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "Pro", "title": "Decent, nothing special", "helpfulness": 1, "user": "CloverIsSweet", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 139035981}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Parking is only $16 --> better than most other places in the area with in/out privilege and plenty of spaces.", "title": "I Love This Hotel!", "helpfulness": 1, "user": "Karen E", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138734204}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Free internet (good connection)", "title": "Yummy cookies", "helpfulness": 1, "user": "dreamon418", "date": "August 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 138305942}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "This is one fantastic hotel! The employees are quite friendly and helpful, the rooms are clean and spacious, and the grounds are pleasant. The free shuttle to Disneyland is also a great feature. The only negatives are the lack of: free Wifi, refrigerators and microwaves as standard features of all guest rooms. It is close to an outlet mall which is chock full of great restaurants. I would definitely return!", "title": "Fantastic oasis!", "user": "MrBob0117", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 141770708}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "This hotel is very pleasant with bright and cheerful decor, very spacious rooms, comfortable beds and an on-site restaurant and bar. The restaurant has a good breakfast buffet featuring your choice of continental breakfast or full, hot breakfast (not free, unfortunately, but at average cost for a hotel buffet) and the bar has a very pleasant patio adjoining. Even though the hotel is quite accessible to the freeway it is not particularly noisy. There is no airport shuttle but the hotel has shuttle service to the Anaheim Convention Center and Disneyland, both within about a mile or so. Regular airport shuttle service is $10 and a cab about $30 to the John Wayne airport. Beyond all other positives are the friendly and helpful staff. Everywhere I went in the hotel, staff were friendly and went out of their way to provide any assistance needed. I would definitely stay here again.", "title": "Bright and cheerful hotel with super friendly staff", "user": "normajBoise_Idaho", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141372919}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I booked this hotel through Priceline, my first time every using that website. I was a bit nervous about using it, but was very happily surprised. This hotel was booked for a birthday trip for myself and my fiance to the Disneyland Resort.", "title": "Great Stay!", "user": "DesertWorshipGuy", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141362563}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The Good:", "title": "Doubletree is Doubledelight", "user": "abstractdaddy", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141270810}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The hotel is only about 3 miles from Disneyland. Driving time was about 10 minutes, but very easy access to/from the freeway. The rooms were very nice, towels in the bathroom were comfortable, bed and sheets were comfortable. LOVED the fact that you can control the temperature of your room and not just select hot or cold like a lot of hotels. And housekeeping didn't mess with the temperature while we were out of the room for the day. The room had free coffee and tea, which was nice. There was no microwave or refrigerator, but that was completely fine for us because we had an ice chest with us. It had a nice desk with a comfortable chair that was good because after coming back from the park each night I had a designated space that I could look at our finances for the day and the next. The curtains are black out meaning that they are going to black out virtually any daylight when the sun starts shining. Woke up about 7 one morning and thought it was probably only like 5. Parking was easy and right in front of the hotel. Even with 2 conferences going on at the hotel, there was still plenty of parking available.", "title": "Great place for a Orange County & Disneyland Vist", "user": "TravelingHippo808", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140954696}, {"rating": 4.0, "title": "Hotel for visiting Disney's California Adventure", "text": "First, I am a Hilton Honors gold member. Checked in and received our delicious cookies! Our room was on the 18th floor and I appreciated that you had to use your room key to access the top floors. We received a free continental breakfast and you could also use the voucher for Starbuck's coffee and a muffin. We took the free shuttle to Disney. They ran from 7:30 am until 12:15 am. We also received a voucher for a free appetizer from the bar. The chicken wings were delicious and very tasty! Our room had a great view and we could see the Tower of Terror from our room. We had a safe, but would have liked to have a refrigerator and microwave. Overall a great stay!", "helpfulness": 1, "user": "hellokittyluver", "date": "October 16, 2012", "id": 142927519}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Nice reasonably priced hotel. Good for business travel or personal. Restaruants near by within walking distance. I was there on business but I saw lots of people there returning on the hotel shuttle from Disneyland vacation looking very happy.", "title": "Good Value", "user": "Emerald_City_Gal", "date": "October 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142926707}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Recommend: Yes", "title": "USA - Excellent Stay for Disneyland", "helpfulness": 3, "user": "Midi82", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142275244}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Room:", "title": "Deceptive name, good value", "user": "eddotcom", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 142248041}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed in a standard room but with 2 queen beds; room was large, clean and the beds and pillows were amazingly comfortable! Perhaps a little out dated but don’t get put off by that as the room size and the bed more than make up for it.", "title": "Our Brigadoon", "helpfulness": 2, "user": "pauljaz1", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142147202}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "I stayed at the Doubletree in Orange from Oct 23-26 for a business trip. I had stayed here 3 years ago and the lobby and restaurant seemed renovated since my last trip. My room was clean however the furnishings were a bit outdated and there was a strange unclean smell in the beds. The bathroom was also clean but also seemed a bit outdated. The breakfast buffet was nice (complimentary with my room rate) but on my last day I thought it was funny that they charged me $1.00 for a coffee to go as I headed out for the airport. I think complimentary coffee would have been a nice touch. Again, this hotel was clean but the rooms seem to need updating. They are working on renovating the exterior of the building right now and warned that workers could be outside your window from 8:30AM-5PM daily.", "title": "Not the best", "helpfulness": 2, "user": "BornToTravel", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6023191}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Meets my three important criteria: quiet, comfortable, and clean. The beds were fantastic, the rooms nice and comfortable (nothing special) and the hotel staff efficient and friendly. The lobby is spacious, simple, and elegent. The workout room is only okay with only two treadmills and two other machines and somewhat limited hours of operation (I am usually up very early when on the west coast - the room doesn't open until 6AM.)", "title": "Very Nice", "helpfulness": 5, "user": "Hereandtheretraveler", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6014906, "likes": {"liked": "— Comfortable beds", "disliked": "— Restaurant service just okay, not great"}}, {"rating": 3.0, "title": "hotel okay...spa visited grrrrrrrreat!", "text": "BTW, there is a fantastic, fun shopping mall (City Block) right next to the hotel and overall, a super convenient location.", "helpfulness": 2, "user": "Spagoer", "date": "October 11, 2006", "id": 5937247}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "The hotel was okay..def nothing fancy. But had relatives stay here and they found themselves at The Skin Spa at Orange Hills 3626 East Chapman Ave, Orange Ca 92869 small and comfortable, prices were VERY reasonable so was able to indulge in several services. I thought I should write becuase thats all they talked about was the spa. So if you find yourself staying here and need to unwind from traveling or spent the whole day at mickey mouses house..kick your feet up and recharge your batteries at The Skin Spa at Orange Hills!", "title": "Great Place to Stay", "helpfulness": 1, "user": "abhetrck", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5932501, "likes": {"liked": "— Staff and Cleanness", "disliked": "— Paying for internet service"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This was the 2nd Doubletree Hotel we stayed in during this trip,the 1st. one was in San Francisco,then this one. An excellent hotel. The staff was great,the rooms big and clean.I can't say enough about this hotel other then it's a great place to stay. There were 6 of us.2of us were over65,then our daughter and son in law plus our 2 grandsons,ages 17 and 14.", "title": "Great hotel and staff", "helpfulness": 1, "user": "Retired2001", "date": "October 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5895768, "likes": {"liked": "— The beds were the most comfortable we've ever used.", "disliked": "— The $8 fee for parking on the last night. We were in the overflow lot which was unsecured"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled with family", "text": "Got the cookies at check in. Though no greeting by any of the staff as we walked through the door. Room was very clean. Very quiet at night. Hourly shuttle to Disneyland. Would stay here again.", "title": "Convenient to Disney Attractions", "helpfulness": 2, "user": "WillieMillbrae", "date": "September 1, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5731850}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "Let me start off by saying that I am a Hilton Honors Gold VIP member, and a Starwood Preferred Guest Gold Member. I usually spend about 15-20 nights a year in hotels. I also do not provide room numbers in reviews for privacy reasons, if you would like the room number, please email me.", "title": "Excellent Property!", "helpfulness": 13, "user": "Dan S", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5714997}, {"rating": 3.0, "title": "Great place to stay for Disneyland visits", "text": "I stayed at this hotel in August of 2006 and choose it because of it's proxmity to Angel Stadium.", "helpfulness": 4, "user": "Neelee", "date": "August 22, 2006", "id": 5700135}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 28, "average": 94, "very good": 247, "terrible": 22, "excellent": 225}, "aka": "Doubletree By Hilton Anaheim - Orange County Hotel", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}