{"user_rating": 4.0, "review_count": 358, "name": "DoubleTree Suites by Hilton Hotel Seattle Airport - Southcenter", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I have stayed here several times and found the experience nice. We only stayed two days this trip through and it was as expected. Room was clean and very comfortable. This hotel caters to the business sector and therefor is not marketed towards the tourist.We got a good rate by dropping in late one night but when we tried to extend our stay the price jumped beyond what I was willing to pay. That is too bad since they lost revenue when they had lots of rooms available. The business center is great and we used it a couple times. I am Hilton Honors and did not receive any extras. The internet was pricey but did work well and fast. Would stay here again, if the price was right.", "title": "Very comfortable", "user": "AKfun", "date": "March 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7252339, "likes": {"liked": "— location", "disliked": "— price variance"}}], "location": {"country": "United States", "city": "Tukwila"}, "stars": 3, "variance": {"poor": 17, "average": 53, "very good": 133, "terrible": 9, "excellent": 146}, "aka": "Doubletree Hotel Seattle Southcenter", "slim_ranking": 0.176470588235, "description": "Enjoy your stay at the Doubletree Suites by Hilton Hotel Seattle Airport – Southcenter, located only three miles from Seattle Tacoma International Airport (SEA), just south of the I-5 and I-405 intersection. Use the complimentary hotel airport shuttle bus service and ample parking facilities. You’ll receive a warm welcome to this Seattle airport hotel with a signature chocolate chip cookie and enjoy a wide range of amenities like high-speed internet access. The Doubletree Suites by Hilton Hotel Seattle Airport – Southcenter is conveniently situated for access to Seattle, Tacoma, Bellevue and the Port of Seattle. If you’re a business traveler, you’ll enjoy the proximity to major Pacific Northwest industries and corporations like Boeing facilities, Alteon, Microsoft, Weyerhaeuser and Starbucks."}