{"user_rating": 4.0, "review_count": 1039, "name": "Doubletree by Hilton Chicago Magnificent Mile", "reviews": [{"rating": 3.0, "title": "I was a little Disappointed with the...", "text": "I was a little Disappointed with the doubletree after staying there on August 10th. The room lacked a coffee maker, but had the coffee accessories, there were large black hairs in the tub and the TV was very dated. However we did order room service since we got to the hotel late and the food was suprisingly good. We order a Mac and cheese for my son and when they viewed the order they sent up a beverage free of charge for my son since we hadn't ordered one. The next morning we went to the bfast buffet which was included in our room rate and was surprised by the selection. There was hot food as well as fresh fruit, cereals, yogurt with various toppings and decent coffee. Parking was outrageous of course, but it is at all downtown hotels. Overall the room was a bit dissapointing, but the staff/ service was great.", "user": "trippinmama", "date": "August 21, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 76220635}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We had a great stay at the Doubletree. The location was perfect... close to Magnificent Mile, close to Navy Pier, not too far from Millenium Park either. We were on the 6th floor, and had no problems with waiting long for elevators at all. Rooms are spacious, plenty of room for our family. Pool was fun... a little cold... but felt great given the hot weather! It was a good size pool. We enjoyed watching the Navy Pier fireworks from the pool deck Wednesday eveningn. We felt we got a great price for our 4 nights there. Although everyone was friendly the bellhops were by far the friendliest people there... all of them were so friendly and helpful. We saw them throughout our stay and they alway greeted us and asked the kids how their days were - such great service. One noticed my son's socce shirt and had a nice conversation with him about soccer and the World Cup. My son thought that was so cool that a \"grown up\" would want to talk to him about that!!! We'd definately stay there again when we come back to Chicago. Thank you!!!!", "title": "Great hotel, definately recommend!", "user": "lorose", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75842100}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Excellent location, clean & spacious rooms, friendly staff...my only complaint was that the elevators often took an unreasonably long time to arrive, but I'm hoping that was a temporary issue. Otherwise, I absolutely recommend this hotel. We stayed there while attending a wedding and got a great rate as part of the wedding party. Oh, and the fresh baked cookies we were treated to upon arrival were delicious and a welcome treat!", "title": "Absolutely perfect except for slow elevators", "user": "JetsettingFoodie", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75780080}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Conveniently located near Michigan Ave/restaurants and just 1-2 blocks away from a grocery store and drug store.", "title": "We'll stay here again next visit to Chicago!", "helpfulness": 1, "user": "ohio_planner", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74067428}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Just returned from a 5-day family vacation to Chicago, and we were impressed with the Doubletree Hotel. All the staff were friendly and helpful throughout our stay. Concierge helped us navigate our way on bus routes, and helped my husband figure out a problem with his Stubhub tickets for the Cubs game.", "title": "Great Location - Close to attractions", "helpfulness": 1, "user": "TravelAddict082", "date": "August 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73954675}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Beautiful, clean rooms. Close to everything, within walking distance. Will come back again.", "title": "Great hotel, will come back again", "user": "Kaia1000", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73919616}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We recently had a nice stay at this hotel. The location can't be beat if you're looking to be near the magnificent mile or Navy Pier. We were traveling in a group with family and young kids, and got a great price on our two rooms, although parking fees are very pricey (as is typical in a big city) which kind of cancels out that good feeling. :) The hotel lobby is very trendy and nice looking, and everyone at the front desk and concierge desks were very friendly. Our kids had a blast swimming in the fifth floor rooftop pool... and sitting on the window seat overlooking the city and all the action happening twenty floors below! Overall, we had a good experience. There were some quirks that are worth mentioning/knowing, which prevented me from giving this hotel a higher rating. First, the hotel does not pre-block rooms, so when we checked in, even though both rooms were reserved under the same name and credit card, we were not able to get rooms next to one another or even on the same floor without giving up our \"view\" of the lake and settling for one handicapped room next to the elevator and ice machine. Kind of a bummer considering it was a special birthday trip. Second, the elevators are very busy and it takes a while to catch one... so we felt the higher up you are staying in the hotel, the better. I felt really bad for the people on the lower floors who were trying to make it to the Lobby. People on floors five, six, and seven almost always had to wait for another car because the elevator was already full. Third, housekeeping knocked on our door at 8:45 AM to see if we \"needed anything.\" It just so happened that we were traveling with children and were awake... and housekeeping had not left any coffee packets in the room (the other room we rented had no coffee maker at all) so we took them up on it, but if we had been on a trip where I'd wanted to sleep in, I'd have been pretty upset. I double checked with the housekeeper to make sure she hadn't mistaken our room for some other room that had actually called them, and she said \"no.\" I've worked in a hotel before, and honestly, my impression was that she was just fishing for extra tips. We also never got the extra towels we requested with our reservation, but I'm betting that was due to the last minute room change assignment made at the front desk.", "title": "Great Location, Nice Hotel, but a few quirks...", "helpfulness": 1, "user": "CentralCoastTravelr", "date": "August 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73913710}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Attended a conference here and was pleased with the location. The rooms were tidy and the housekeeping staff pleasant and helpful. The snacks during the conference were wonderful. Who doesn't love their cookies! It was really easy to walk to Michigan Ave. and I felt safe being here. The fitness facility was also very nice.", "title": "Nice location, SLOW elevators", "user": "GingelaOK", "date": "July 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72734734}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The down-side is that the elevators are SO SLOW. And stairs between the main lobby and the second floor are not easily found. The elevator also doesn't go all the way down to the basement for the conference either. Weird layout.", "title": "Good with a few exceptions", "helpfulness": 1, "user": "George16", "date": "July 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 72720262}, {"rating": 4.0, "title": "Good Price, Great Location", "text": "The bar is mostly closed from what I can tell. It didn't encourage me to sit and have a drink with my colleagues.", "user": "Mr-MrsB-MN", "date": "July 23, 2010", "id": 72020866}, {"rating": 5.0, "title": "Can't fault it!", "text": "Lovely hotel, stayed one night at the start of my trip before I met up with friends. Short walk from small beach, great if it's hot (which it was). Very close to Navy Pier. Was lucky enough to be in town for the Blackhawks parade which finished a couple of blocks away. Bed big and comfortable. Free wifi in hotel lounge - actually it would have been good to have wifi in the room, but that's a tiny gripe. Staff very friendly and helpful, nothing seemed too much (as is usual in this city). Nice cookie! Get on the red line to wrigleyville for an interesting evening out.", "helpfulness": 1, "user": "chiefy9", "date": "July 8, 2010", "id": 70111871}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I would definitely stay here again. This hotel has an outdoor pool on the fifth floor which makes it really nice to stay here during the summer. They have a server walking around offering drinks (about $7 for a mixed drink). Although I brought a thermos with my own iced tea and that was fine. Only problem I had with the hotel was the parking is $41 for only 24 hours. I parked for 26 hours and was charged $67. Make sure you read the fine print. Also, twice my bedroom key did not work, so I had to go down to the front desk and have it reactivated. Otherwise it was a pleasant stay. We arrived really early and they allowed us to swim for a few hours while they got our room ready, (we left our bags at the desk). Although check in is 3 pm they had our room ready at 1:30 pm.", "title": "Great location plus rooftop pool is a plus", "helpfulness": 1, "user": "Liz0595", "date": "July 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69975292}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The hotel is in a great location, very close to Michigan Ave and many other sites. We went to a spa called Renew spa located on Michigan Ave, they had a great deal $99 for 1 hour massage, manicure, pedicure if you visit during the week.", "title": "ELEVATORS WERE A NIGHTMARE", "helpfulness": 1, "user": "SaraGood", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 69959755}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I read some other reviews that said the elevators were bad. They were worse than bad. It was July 4th weekend and I am know at least one of the elevators broke. But, it was a nightmare. Large families with huge bags, baby strollers, car seats, etc. were filling the elevators. Because the elevator system is prroly designed, people were waiting 20 minutes, and then taking the stairs. Doubletree rally needs to do something. Luckily, we found the service elevator. Also, breakfast was overrated. Go across the street to the west egg cafe. delicious :) The doorman was great and the flight check console was great.", "title": "great location...incredible bed...sloooooooow elevators", "helpfulness": 1, "user": "boalex207", "date": "July 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69701946}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Recently enjoyed a fine night's stay at the Doubletree Magnificent Mile. We were able to check in about an hour and a half early which was a great start. Ron, at the front desk, wasn't exactly rude, but he won't be winning any Chamber of Commerce awards either.", "title": "Typical major city downtown hotel.", "user": "Ralphmtsu", "date": "July 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 69610127}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "I stayed here for one night during the busy summer tourist season in Chicago. As many others have mentioned the location is great. I was in a room on the 25th floor that was clean, quiet, and had a great view of the John Hancock building and Lake Michigan. The people at the front desk and the maid were friendly. Though I wasn’t happy that the maid knocked on my door at 8 am in the morning (but this is becoming a more common problem at hotels in general). There is a coffee maker in the room with Wolfgang Puck coffee. There is also an Einstein’s Bagels connected to the lobby.", "title": "Nice location, clean and quiet,", "user": "azogal", "date": "July 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71802192}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I did not experience the slow elevators. Perhaps they have fixed them or I used them at un-busy times of the day.", "title": "Ok hotel. Not perfect but convienient.", "user": "TrelaTwo", "date": "July 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 71566888}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "There is a self-park garage behind the Doubletree that might charge less than the $41 that Doubletree charges.", "title": "This hotel does not give you nothing for free", "helpfulness": 1, "user": "thekidwonagain", "date": "July 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 71350719}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I did not use the pool, but it did look nice.", "title": "priceline hotel", "user": "lscott933", "date": "July 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71256817}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The snack bags (pretzels, peanuts, party mix) are on a sensor pad and as soon as you pick one up you are charged…even if you don’t eat it. This is a very, very bad system and would be a nightmare if you had children with you. I even think you would be charged if you accidentally knocked a bag off the sensors. And, yes, the sign warning you about being charged immediately is tucked behind the bags at the back of the sensor tray.", "title": "Great location, not much else", "helpfulness": 1, "user": "Hogaddict", "date": "July 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 70319941}], "location": {"country": "United States", "city": "Chicago"}, "stars": 3.5, "variance": {"poor": 60, "average": 197, "very good": 454, "terrible": 26, "excellent": 302}, "aka": "Doubletree Hotel Chicago", "slim_ranking": 0.542168674699, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "A magnificent Chicago location, The Doubletree Chicago Magnificent Mile offers modern accommodations in a superb location between the famed Magnificent Mile shopping and the excitement of Navy Pier on Lake Michigan. Walk to dozens of historic Chicago attractions, shopping and countless restaurants. O'Hare International (ORD) and Midway (MDW) airports are 45 minutes by train, taxi, shuttle or limo. $21 million rejuvenation offers a dynamic, urban retreat. Doubletree Chicago Magnificent Mile features vibrant new contemporary guest rooms in charcoal, white and fushcia. Residential-style amenities include ultra-comfortable Sweet Dreams® beds; MP3 compatible stereo clock radios; Wolfgang Puck® gourmet in-room coffee service; luxury bath and body products; showers and bath tubs, and a spacious work desk complete with wireless, high-speed internet access and ergonomic desk chairs. Room Service served daily from 3pm-11pm.Markethouse is now closed for lunch and dinner.Dinner is served in the Lobby Lounge from 4pm until 10:30pm. Breakfast is served inside Markethouse Monday - Friday 6am-10am Saturday/ Sunday 7am-11am."}