{"user_rating": 4.5, "review_count": 2015, "name": "DoubleTree by Hilton Hotel London -Tower of London", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We were met by the friendliest service, which continued for the entire 8 days of our stay. Our room was a nice size, very modern, not a great view (6th floor) but still very bright. It was cleaned to sparkling every day. Loved the iMac and the wireless. Great breakfast and no waits for us. Extremely friendly service from everyone in the hotel. Very conveniently located for the tube, and even on the weekends when Tower Hill station was closed, it was easy to walk to another station within 15-20 minutes. We would not hesitate to recommend this hotel to others, and would be happy to return there on another trip.", "title": "Excellent hotel!", "user": "nodata", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118155661}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Thanks to everyone at the Mint Hotel for a great stay!", "title": "Service, comfort, top hotel", "user": "tvh12", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 118069332}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "Very nice new hotel. All comfort present in rooms. I especially appreciated the imac in the room. The bathroom of a standardvdouble room is just large enough, but practically designed. I will certainly consider returning. Rates are as good as you can get in London. If you can find a good deal, do not hesitate to choose this hotel.", "title": "Fantastic hotel", "user": "magz62", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118054782}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Two cons:", "title": "Fantastic!", "user": "reine_dahlman", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118001486}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "There is not much to do in the direct vicinity (financial district)", "title": "There are more charming or designed hotels elsewhere", "helpfulness": 2, "user": "Dalaroe", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 117993943}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "A frequent business traveller, I find the Mint Tower Hill to be a good option. Rooms are clean and have a very modern design: light woods, white walls, black and white photo on the wall. The rooms can seem a bit soul-less/pale, so if you want a place with a rustic, cosy feel, the Mint will not suit you as well. Standard rooms are compact in size, and baths feature a shower cubicle (no tub). A good room amenity is the Apple IMac with free internet. Beds are comfortable, and there are a few different pillow options available upon request. Location is 5 minutes from Fenchurch St station, and less than 5 minutes to Tower Hill tube station. There are a lot of good restaurant options nearby, including those at St. Catherines' Dock at the foot of Tower Bridge. The rooftop cocktail bar has lovely views over London. Tea/coffee facility plus minibar available in room.", "title": "Good location, modern style", "user": "SW10UK", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118260336}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed two nights here on business and found the hotel to be truly average - I've stayed at nicer places in better locations across London for the same cost.", "title": "An average hotel", "user": "anchmer", "date": "September 17, 2011", "detail_rating": {"value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118240201}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel is located about 2 blocks from Tower Hill tube station. Its easy enough to walk to the tube, but for business travel it isn't as close to Liverpool Street or other areas of the city as it could be. If you are able to take taxis to/from the airport and the office, than the location won't be a problem.", "title": "Fantastic hotel!", "user": "MelDee", "date": "September 17, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118223995}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The room was indeed very clean and modern, but aside from the iMac (would have perferred to have a proper TV), it was all very basic - no bath, small space, twin beds, cotton comforter.", "title": "Excellent option for London", "user": "RG0482", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 118194311}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "From the moment we arrived at the Mint hotel we were really impressed with the fantastic staff! The room wasn't ready but the hotel kept our luggage so we could explore! The room was a junior suite on the 10th floor, it was immaculate with an IMAC which made exploring, booking tickets etc so much easier! The breakfast offered a great selection, it's a £4 upgrade from continental to full english however continental provides plenty selection. We never had any problems with breakfast being too busy & hectic as they split the guests between the 2 groundfloor restaurants!", "title": "Impressed by the Mint team and the hotel", "user": "Panna", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 118167460}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Just staying one night it's difficult to review everything, but in my mind this is a modern new hotel with a high standard (Apple equipment in the rooms). Nice, not to small rooms with a comfortable bed and a good bathroom (well functioining shower!). A nice cange from all \"old hotels\" in London.", "title": "Modern buisness hotel in the city, as usual expensive breakfast", "user": "LGMA", "date": "September 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117894448}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The breakfast was (of course) not included and expensive but of high quality, We had a busines meeting in the conference area, but cannot recommend the catering - unorganised, unexplained, too little food and bland.", "title": "Clean, modern and comfortable", "helpfulness": 1, "user": "LAKECOMO09", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117878814}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "The location is close to the Tube and the DLR, but as it is in the City the nigh life is limited. There are quite many similar hotels in the area so it pays to shop around for the best price.", "title": "Absolutely wonderful!", "user": "Evie D D", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117650110}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "My Husband and I stayed here for our Anniversary treat whilst shopping in London. I have stayed in the Mint Hotel Manchester before and loved it. After dragging our tired legs and heavy trolley bag into reception after a hot and tiring shopping day we were greeted at the door with a smile and directed to an available checking in desk. This was flawless and trouble free, where all the amenties and breakfast times were pointed out.", "title": "Excellent service", "user": "RedWineee", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117629711}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The reception area was cool, modern and spacious", "title": "Exellent hotel hope to stay here when travelling to London again", "user": "b b", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117619899}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I stayed at this hotel on our honeymoon as a part of a package that Railbookers put together for us. We had plans to travel from London to Paris, also visiting Brussels, Bruges and Amsterdam. The Mint was by far our favorite (although the Amsterdam hotel was also awesome).", "title": "Can't say enough GOOD things about this hotel!!", "user": "KKlein830", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117983239}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "They were told it was our honeymoon and left us a bottle of champagne for our first night there! We were upgraded to a suite, which was impeccable and had 3 mac computers for us to use/watch tv/play music. Everything was extremely comfortable and the staff of the hotel was exceptionally accomodating.They arranged cars for us, gave us tips on local eatieries and provided maps for us to get to and from the train.", "title": "Absoloutly Fantastic!!!", "user": "NickM21", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117966483}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We also stayed here for a night at the end of our trip. We had issues with a train breaking down, and arrived at the hotel 5 hours late. No matter for the Mint! They got us into the same room as soon as we arrived and even left us chocolates!", "title": "Well done Mint Hotel Tower of London", "user": "carol p", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117936432}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I was extremely impressed by everything at the Mint and will DEFINITELY be back if I visit London again. It felt like a home away from home :)", "title": "Just a few hours and not impressed so far!", "helpfulness": 3, "user": "Toronto21", "date": "September 10, 2011", "detail_rating": {"cleanliness": 4.0}, "id": 117919751}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Stayed here for one night on the 10-11th of September.", "title": "Highly Recommended, Great Location For Sights, Will Use Again", "user": "TheDrippingTap", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117894491}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 45, "average": 161, "very good": 664, "terrible": 28, "excellent": 1117}, "aka": "DoubleTree By Hilton Hotel London -Tower Of London England", "slim_ranking": 0.10687732342, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}