{"user_rating": 4.5, "review_count": 353, "name": "Doubletree Hotel Boston/Bedford Glen", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This place is great! Luxury at an affordable price. Staff is extremely friendly and accommodating. Easiest check in and check out I've ever experienced! It was very clean and beds are super comfortable with down comforters. Flat screen tvs and HBO. A diamond in the rough!", "title": "Stay Here", "user": "Lovestotravel1011", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37531263}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I was in the area for a wedding recently at this hotel and stayed for 2 nights. I really didn't know what to expect from this hotel because I had never stayed at a Doubletree hotel even though I travel quite often.", "title": "Surprised by the whole package", "user": "kabecker", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 35943498}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "I found the rooms to be on the smaller side, comparative to other hotels I've stayed in Boston. However, they were decorated nicely and the beds were comfortable. The grounds of the hotel in the Summer are quite beautiful and the hotel feels more like a resort than a hotel. Rooms had free internet, although I couldn't pick up a strong wireless signal so I had to plug in into the ethernet jack. The hotel is a bit far from Boston and tucked away in a fairly remote location. They do offer a reliable van service that will take you within 5 miles of the hotel. While I had some downtime, I went to the great mall nearby and called the hotel to pick me up when I was ready.", "title": "Beautiful hotel", "user": "cardtraveler", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 30702535}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "As an FYI, if you don't like to walk, this hotel is not for you. Depends on where you stay, or perhaps anywhere in the hotel is a LONG walk from the front door. I probably walked Miles over the course of 2 days, going from the car, to the lobby, to the room, back to the car... I did enjoy my stay and would stay here again, under the condition that I was in a room closest to the front door!", "title": "Location the only negative, and a minor one at that", "user": "VermontTx", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 28410043}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had a room with 2 double beds. Although it was beautifully furnished it really was a bit small. However, it was very very clean---but we were still surprised to find some old socks behind a chair and a partially used tube of toothpaste under the counter in the bathroom. I guess someone had an off day. Nevertheless, the access to roads north and south of Boston were convenient and we found lots of dining choices with the nearby Burlington Mall and the local Whole Foods Market. We didn't try it but there is an upscale looking Naked Fish restaurant right across the road. Coffee maker in the room was state of the art with Wolfgang Puck coffee. We also loved the large, luxurious indoor pool with still another complimentary Keurig coffee maker for the adults and lots of pool paraphernalia for the kids. Stay here.", "title": "A winner near Bahston", "helpfulness": 1, "user": "BronxMiddleMan", "date": "October 20, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 21038570}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "A 3 night stay last week was close to perfect. I could not wait to get back and write this review. This, from someone who spends 50 - 75 nights a year in hotels.", "title": "Not been so impressed with a hotel in a LONG time...", "user": "reviewguy", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 48021212}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The hotel is easily a 3.5 to 4 star. It is spacious, clean, comfortable. Large rooms. Large baths. Starbucks in the lobby. Free business center with computers, printers to use 24 hours a day. Free wireless internet in the hotel, wired option also available in rooms. Ice and drink machine available in the hallway. CHEAP dry cleaning, comparable to local rates, delivered back the same day. Free and plentiful parking.", "title": "Clean rooms, free hotel shuttle, free internet access, good restaurant", "helpfulness": 1, "user": "Curious-Monkey", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 46660398}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Most of all excellent staff. Ana and Becky were two of the cheerful faces at the lobby. Always happy to help.", "title": "Excellent place to have your meeting with out of town guests!", "user": "MysterySt_LouisMO", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46376218}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Opposite the hotel was the Naked Fish restaurant. Did not eat here this time, but I have done so plenty of times and its excellent. Not far away is a Dunkin Donuts (0.6 miles), Lemon Tree Thai cuisine (1 mile or less), the Burlington Mall (1.5 miles) with its excellent food court (you HAVE to try Gourmet India - probably the best Indian food ever!).", "title": "Stay at this Hotel!", "user": "DebsyD56", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44176330}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Hotel was less than a 30 minute drive from Boston Logan airport. I would be delighted to stay here again. I got lucky, got this hotel via Priceline for a good deal (three night stay was under $200 all inclusive) but would not hesitate to stay here at twice this price, the next time around.", "title": "Awesome hotel near Boston", "user": "frenchcdric", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39966446}, {"rating": 4.0, "title": "This is such a good deal!", "text": "This is such a good deal! The hotel is clean, staff is nice, safe area. We have kids, so we did not want to eat at the restaurant. We ordered room service and picked it up, avoiding the 18% gratuity. Lots of nice nooks with comfy couches and tables, we played board games and brought soda and snacks to our little nook. We didn't go for Easter but they had a big crowd for their annual Easter Brunch with a free petting zoo. The pool/jacuzzil was great AND there is a complimentary shuttle to the nearby Burlington Mall. A very nice mall indeed. It's little things like this ~ the soda in the vending machine was $1.25, the same price you pay at a convenince store, usually the hotels rob you on that sort of thing.", "helpfulness": 8, "user": "dmvbythesea", "date": "April 8, 2005", "id": 3345002}, {"rating": 5.0, "title": "Great stay at the Renaissance", "text": "We stayed here last weekend because we had a wedding in a neighboring town, but all of the hotels there were full. I got the room at the Renaissance dirt cheap on Expedia ($89 a night for a non-smoking double). SInce the rrom was so inexpensive, I was a little nervous, but as we pulled up-- I felt relieved!! The hotel is beautifully maintained, the staff was extremely courteous and the rooms were spotless. The bathroom was very big, and the toiletries were from Bath and Body Works, which was nice. Although I didnt eat there, there was a restaurant/bar that looked very nice. I would recommend this hotel to anyone!!! It is an excellent bargin for the service you get!!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "October 27, 2004", "id": 2789148}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "We had my son's Bar Mitzvah here last May. All of our out of town guests raved about the service and accomadations. The guest rooms were clean and well maintained, as was the indoor pool and sauna. The function rooms are tastefully decorated and the food was delicious.", "title": "Great place for social or business function", "helpfulness": 4, "user": "maxinella", "date": "September 28, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2606138}, {"rating": 5.0, "title": "Awesome Property", "text": "This is such a NICE hotel. If it were downtown Boston, it would be a 300.00 plus per night rate. WELL worth the drive to the ALEWIFE T station. The rooms are beautiful, the staff great and the food in the restaurant superb. Life is good at the Doubletree Bedford!", "user": "daisy20071960", "date": "June 30, 2010", "id": 69203822}, {"rating": 4.0, "title": "Great Place", "text": "We stayed here for a wedding in town. The pictures on line were really nice and the rating was impressive. Pulling up to the building I have to say the outside does not have a lot of curb appeal but the inside is really nice. It is clean, modern, and very attractive. Our room was a good size and overlooked a courtyard. It is a large, spreadout hotel but there are signs at every corner to help you. The amenities were plentiful and the cost of the room service and on site restaurant were fairly reasonable. Bed was confortable and the sheets were crisp and clean. Nice to have a flat panel on the wall.", "user": "Mrsoakie", "date": "June 28, 2010", "id": 68922607}, {"rating": 5.0, "title": "Fantastic place to have a wedding", "text": "The things that we did not like were minor but should be noted. The coffee shop was not open on the weekends, the bathtub had rust stains on the bottom, and we had requested foam pillows but were left with only feather (but 5 of them). Otherwise it is a place we would recommend for the area.", "user": "Q-bert137", "date": "April 15, 2010", "id": 61604351}, {"rating": 4.0, "title": "Hilton standards for a good price", "text": "I was planning my wedding in the Boston area and had a huge problem finding a place that matched mu budget. When I visited the Bedford Glen hotel, I immediately had a great feeling about the place. The package that was offered included a lot more things than most hotels I spoke with - even the centerpieces were included! But the real gem about this place is the staff. The wedding coordinator they have, Jocelyn, was amazing. She always listened to me and had everything done the way I wanted it, and never once told me how I should have my wedding. They even let us meet our photographer there to go over photo options and while we were there, a different staff member got us drinks and gave us a private tour of the place. On our wedding day, everything went flawlessly thanks to Jocelyn and her attention to detail. The room was beautifully decorated and a lot of people commented on how great the food was. It was definitely a step up from most wedding cuisine. A lot of our guests ended up staying over as well, since the rooms were reasonably priced. Everyone commented on how great the hotel was to them as well. The rooms were all newly rennovated and a great value for the price. What I really appreciated most about this place was that even though we didn't spend a ton of money compared to most other weddings, we were still treated like royalty through the whole process. I've never been to a hotel that was more accomodating. If you go with this place for your wedding, you will not be sorry.", "user": "GuidoOswald", "date": "April 9, 2010", "id": 60842689}, {"rating": 5.0, "title": "Crazy value/luxury hotel at discounted price", "text": "The rooms are very confortable and the hotel has a nice big pool (small gym, though)", "user": "leafpeeper98", "date": "April 9, 2010", "id": 60832094}, {"rating": 5.0, "title": "Meets or exceeds my list of \"C's\"", "text": "I stayed at the Doubletree in Bedford, MA on business for the last few days and it is the best hotel experience I've ever had. Here is why:", "user": "therealmaz", "date": "April 8, 2010", "id": 60776209}, {"rating": 4.0, "title": "Excellent Value", "text": "* Comfortable: I want to take the mattress home. It is very comfortable and is made with a stock of five nice pillows with varying firmness. I was not afraid to pull the comforter up to my face in fear of catching some nasty disease either. The desk chair was a Herman Miller Celle (http://www.hermanmiller.com/Products/Celle-Chairs) - very comfortable and a pleasure to sit in while doing work for a few hours.", "user": "ct490", "date": "January 4, 2010", "id": 52553594}, {"rating": 2.0, "title": "Be forwarned: the walls are paper thin", "text": "* Clean: I didn't find a single speck of mold, hair, cobweb, dirt, or stain.", "user": "HappyFeetBelow", "date": "January 2, 2010", "id": 52356693}, {"rating": 4.0, "title": "Love their breakfast and courtyard views", "text": "* Courteous: From check-in to check-out and every call I made to the front desk, even the networking tech support guy was pleasant, professional and treated me like I mattered.", "user": "atlhotelcritic", "date": "December 21, 2009", "id": 51631583}, {"rating": 5.0, "title": "Superb, if not one of the best places I've ever stayed at", "text": "* Convenient: My work was with a company across the parking lot. You can't get closer than that. Also, the areas restaurants are very tasty (I recommend Flatbread).", "user": "WaywardOn", "date": "November 17, 2009", "id": 49435697}], "location": {"country": "United States", "city": "Bedford"}, "stars": 3.5, "variance": {"poor": 13, "average": 33, "very good": 135, "terrible": 6, "excellent": 166}, "aka": "Doubletree Hotel Boston", "slim_ranking": 0.333333333333, "description": "Just a half-hour outside Boston, the hotel's rates and amenities make it a great family choice."}