{"user_rating": 4.0, "review_count": 463, "name": "DoubleTree Hotel Washington DC", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "there was a mouse in our room...keep coming at nite to eat our cookies", "title": "medium", "helpfulness": 11, "user": "georgelucaz", "date": "November 18, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6148821, "likes": {"liked": "— room service", "disliked": "— room privacy...lot of noise coming from next door"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "service was nice in general", "title": "Nice place to stay", "helpfulness": 2, "user": "blakkcatt", "date": "July 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5524043, "likes": {"liked": "— Bed", "disliked": "— Small bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "After reading some of the reviews about this hotel, we were a little hesitant about our stay. The only thing we found was true from the reviews was the size of the room and the bathroom (smaller than most). But, that did not detract from the fact that it was a nice hotel with one of the most comfortable beds I have ever slept in. The front desk staff was friendly and helpful and other staff members were also friendly and accommodating. Breakfast in the hotel was reasonable for Washington and it was very good. We would not hesitate to stay in this hotel again. There are several good places to eat within walking distance (Dakota Cowgirl and Thai Tanic) which were very reasonably priced. We had a late night snack at the bar (kabobs and fries) which were were very good although a bit pricey. Overall we had a great experience and would love to stay here again.", "title": "At least act like you care......", "helpfulness": 6, "user": "Haylee25", "date": "June 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 5338938}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "As a business traveller I do not have high expectations for hotels but for this trip I definitely had to lower my expectations of this hotel. The biggest gripe is the hotel staff- unfriendly, unhelpful, and unwilling to go the extra mile. I was put on the VIP floor and given the tiniest room I have ever seen. Boutique must mean tiny room. Forget the free, warm cookies at check in. Give me a smile, please.", "title": "Above Expectations, Based on the Rate", "helpfulness": 3, "user": "enjayflyer", "date": "May 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5193182}, {"rating": 4.0, "title": "Good location; Clean and classy", "text": "It is the small things that count and they simply were not there. No internet service....you must pay. Most travellers have come to expect this when staying at a hotel. It does not matter if it is the Knights Inn or Hilton Garden Inn. Give your travellers internet access please.", "helpfulness": 8, "user": "BeachnGolf123", "date": "May 5, 2006", "id": 5037414}, {"rating": 5.0, "title": "Great hotel, very clean, super location!!", "text": "I have to admit the \"mice\" reviews below, made me a little scared. But if there were any, that's a thing from the past, I guess management is now very focused on cleaning and on every detail being top notch. The decor of this doubletree is kind of a \"W look-a-like\" specially in the lobby, so they're trying to make themselves different.", "user": "GRojas", "date": "July 4, 2007", "id": 8055601}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The rooms are nice, mattresses are excellent, good size shower, I liked the empty little fridge, where I was able to put all my fruits and other supplies I bougth from the Whole Foods supermarket 2 blocks away from the hotel.", "title": "Great Stay!", "user": "wolffpack14", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8000770}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "DuPont circle is 5 minutes away (4 blocks?), the neighborhood is home to other hotels (Holiday Inn next door, Marriot Residences, across the street), and I saw at least 3 embassies as I walked to the Metro stop at Dupont ... so it is a nice neighborhood.", "title": "Don't be scared about this hotel", "user": "oncourse82", "date": "June 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7935835, "likes": {"liked": "— Comfortable and Clean room", "disliked": "— Front desk service was below par, but not a complete show stopper"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "A gay area/street with many diverse cool restaurants is north on 17th street.", "title": "Mice still a problem.....", "helpfulness": 3, "user": "SCLorri", "date": "April 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7286416, "likes": {"liked": "— The towels, the cookie at check in", "disliked": "— The mouse in our room, the unhelpful concierge when asking about sighseeing in DC area."}}, {"rating": 4.0, "title": "Not your typical Doubletree", "text": "Parking sucks, but that is a DC problem I guess.", "helpfulness": 1, "user": "jonick3", "date": "March 10, 2007", "id": 7010524}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "I just read the others comments and wanted to say when I stayed at the hotel last fall, I too saw mice. I was sitting in the lobby using the wifi (which is annoying that I have to sit in the lobby to get free wifi and pay for it upstairs) and saw several mice run past. They were in the bar area snacking on some popcorn and peanuts which had been dropped on the floor.", "title": "I saw mice too!", "helpfulness": 5, "user": "chelseacat", "date": "March 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7009076, "likes": {"liked": "— Rodents"}}, {"rating": 5.0, "title": "terrific stay!", "text": "I told the hostess and she screamed and ran like she had never see a mouse before. I thought it was just a big city and figured it was an isolated incident. Apparently not. 6 months later and they've moved upstairs into the rooms.", "helpfulness": 11, "user": "MamaSusan", "date": "February 24, 2007", "id": 6835023}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "My daughter and I stayed at the Doubletree for three days while we visited colleges in the DC area. Given our purpose for traveling, we weren't looking for luxury, but we found it! The lobby was very nice and comfortable and my daughter spent lots of time there using the free wireless service available there. The room was the size expected for a hotel room, and was very tastefully decorated. The bathroom was not too small with a granite countertop and an ample supply of shampoo, conditioner, lotions and creams. Best were the towels which were oversize and thick. We ate one dinner and two breakfasts at 15 Ria, and the food was very good and not unreasonably priced for a hotel in an upscale neighborhood in a major city. Contrary to some reviewers here, we found the employees both friendly and helpful. The front desk person helped my daughter get on line on her own laptop - literally sitting with her on the couch till it worked! Every employee we encountered, including housekeepers we passed in the hall said hello and were friendly.", "title": "Mice in the room - eeek!", "helpfulness": 33, "user": "Jujujive", "date": "February 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 6833799, "likes": {"liked": "— Staff, bedding & linens, room service", "disliked": "— The mice in the room - that pretty much ruined things!"}}, {"rating": 2.0, "title": "Marginal for the price", "text": "I was on a business trip for a conference. The hotel screwed up my reservation so I did not get the group rate that had been negotiated and had to pay $40 more per night. Should you make a telephonic reservation, make sure you get the confirmation number. I was careless with mine and it cost me almost $200.", "helpfulness": 19, "user": "travelerinva", "date": "November 20, 2006", "id": 6158028}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Check in was fast and friendly. The room was small but nicely appointed - I liked the linens and the \"memory\" mattress. The amenities in the bathroom were good. The lighting in the room could have been better, but all in all, it would have been a nice experience ... but ... I awoke one night in the middle of the night and saw something moving on the floor - a mouse. I called the front desk and they tried to get me to wait until morning but I was having none of that, so finally they sent someone up who caught it with a sticky paper trap. On my urging he left a few traps in the room. and the next night I awoke to hear some squeaking and there was another mouse stuck on one of the traps, gross, gross, gross! Call me persnickety, but I have trouble shrugging off the presence of rodents. Let's just say I did not sleep well at all.", "title": "Great location, lovely room", "helpfulness": 10, "user": "elh76", "date": "November 20, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6157940, "likes": {"liked": "— Location & decor are primo", "disliked": "— parking can be tricky"}}, {"rating": 1.0, "title": "Not a CLEAN hotel", "text": "This was my first trip to Washington DC for a family conference. I had my husband and two children along. The hotel did not have the correct room based on my resveration available when we checked in so they agreed to upgrade us to a nice suite at no additional charge. Great, I thought.", "helpfulness": 6, "user": "coolstone", "date": "April 2, 2006", "id": 4829468}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "My biggest complaint about this hotel was the FILTHY dirty carpets. My daughter walked around in her socks the first evening for only a few hours and the bottom of her socks were black. Yuck! The walls are paper thin. We could hear the man next door using profanity, very clearly. Not good for the children and then that night we could hear him snoring. We also heard very loud animal noises right outside our window in the middle of the night. We were on the sixth floor. We think it was birds but I never saw anything. I would hate to think it was rodents.", "title": "Enjoyed my stay!", "helpfulness": 2, "user": "maddiejane", "date": "February 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4469705}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "The first night it got cold and the heater would never come on in the room. The next morning I called for them to check the heater and no one ever came. That night when we returned to the room I found that still no one had checked on the heater. They finally sent maintenance up at 11:00pm after my children were asleep and the man said he could fix one unit for the bedroom but the other unit for the living area was broken.", "title": "Good Location; Reasonably Priced", "helpfulness": 2, "user": "IslandGirl2U", "date": "January 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 4333606}, {"rating": 2.0, "title": "No Service Here", "text": "The next morning it took forever for room service and then the order was wrong. The common areas, elevators and halls are very worn and our room had a hole in the wall by the door.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 14, 2005", "id": 4241332}, {"rating": 3.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "Overall, the hotel was awful and we would not return. I couldn't wait to check out!", "title": "A Mixed Bag", "helpfulness": 2, "user": "kolowalu", "date": "December 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 4218124}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3.5, "variance": {"poor": 42, "average": 92, "very good": 186, "terrible": 17, "excellent": 126}, "aka": "Doubletree Washington Dc", "slim_ranking": 0.62015503876, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}