{"user_rating": 4.0, "review_count": 486, "name": "DoubleTree by Hilton Berkeley Marina", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed at this location for our son's graduation and were not disappointed. We had a long stay of 10 days, so had lots of time to experience this hotel.", "title": "Good location, Helpful Staff", "helpfulness": 1, "user": "charles a", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134003375}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The location was lovely and still convenient to the campus and downtown Berkeley, although not walking distance. The hotel provides a shuttle service, which was perfect for trips to BART, campus, downtown and even to Target. On a few occasions, a wait was involved on the return to the hotel, but it was not an inconvenience.", "title": "Great Location in the Berkeley Marina", "user": "NMZs", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 133804312}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The room was comfortable, located on the 2nd floor, in a wing adjacent to the public spaces (reception, lobby, restaurant, etc.) This room had been remodeled recently. We were originally disappointed that no microwave or mini-fridge were in the room. However, when we inquired, both were provided for the duration of our stay. Very helpful!", "title": "Great Location, Great Hotel", "user": "sclhou", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133658931}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The restaurant was only used on 2 occasions, one being for room service (dinner). It was great to have the meal delivered in a timely manner, at the proper temperature and portioned well. The steak and blue cheese mash potatoes were great! Our other meal was one weekend buffet breakfast. Great selection and a nice view added to the enjoyment.", "title": "Nice and Convenient", "user": "Arnold07014", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133594294}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The \"cafe\" shop was helpful for a quick bite or coffee to take away or eat at the cafe tables or in the lobby/public areas. Starbucks coffee is available here.", "title": "Location makes it great", "user": "Lola L", "date": "July 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 133362145}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I had the opportunity to stay at the DoubleTree in mid July 2012 for business the next day in Berkeley. Being on a company expense account and being a Hilton Honors member I chose to stay at the DoubleTree (it was the only thing that was priced right). Upon checking in with the front desk clerk I was greeted warmly by Autumn. She was very pleasant and asked if I had a room preference. I chose a higher room as I hate to be on the first floor. No problems there as everything went fine and I got my excellent cookie (have you ever looked at the calorie content of those? one is enough).", "title": "Only a few bright spots.", "helpfulness": 1, "user": "PaulC1978", "date": "July 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 134667454}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "My room was in building 2 which wasn't a problem. The problems started with the overwhelming smell of chlorine when you got anywhere near the pool area, which you had to pass by on the way to the elevator. I took the elevator up to the third floor and immediately noticed the absolute dirtiness of the carpets in the halls. I'm pretty sure the carpets haven't been cleaned in years. Grease stains were prevalent as well as what could be gum in spots. The next thing I noticed was the absolute lack of any pictures, plants, anything really that would brighten the place up and feel welcoming. That was compounded on the fact that the lights in the halls are few and far between making it seem quite dark. At one point I actually looked to see if there were some bulbs missing because it seemed so dark.", "title": "A lot of noise to keep you up at night", "helpfulness": 1, "user": "MiniSpartan", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 134568746}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I then got to my room and it smelled of cleaning supplies you only get to experience when visiting a nursing facility. I did smell it less throughout the evening but it wasn't pleasant. The bathroom also had a pungency to it that told me that the shower curtain either wasn't clean or the entire shower wasn't clean. It just felt grimy along with the low power of the light fixture in the bathroom and no fan. It was also very tiny and the door actually felt like the width was about 2/3 of what a normal door should be. And the room itself seemed cramped for the size of furniture in it.", "title": "Great Marina Location, Hotel Needs help", "user": "thigrig", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 134542979}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "There were some bright spots to the room. The bed was comfortable and the A/C worked. Other than that I got out of there pretty quickly in the morning and wanted to get outside to cheer up some.", "title": "Still a big Fan of the place, but needs help in some areas", "user": "KoloheSanJose", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134534157}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "All-in-all I wouldn't recommend this facility and don't understand how Hilton allows this franchisee to use their name. Most Hilton properties I've been to have been comparable while others have gone above and beyond (I'm looking at you HGI- Salt Lake City). The DoubleTree in Berkeley is well below any of those places.", "title": "Simply wonderful stay!!!!!!!!!!!!!!!! five stars", "user": "photomama17", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134462110}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I booked this property when everything decent and available in downtown San Francisco was too expensive. Not cheap at $189 plus many taxes/fees (free parking) but a whole lot less than what was available in SF proper (where parking is generally not free, either) Not difficult to find using MapQuest instructions...but requires a surface-street U-turn if coming from SF/points south and a final leg bumping down what feels like a poorly kept road into a state park. Probably a challenge to find confidently after dark for first-timers. Note: there's a $6 fee every time you want to cross back over the bay bridge and into the city (and a delay in toll-booth traffic; must have cash).", "title": "Such Potential...But Just O.K.", "helpfulness": 1, "user": "GetnOutaHere", "date": "July 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 134366666}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Online write-up said the room had a 180 degree view of the marina and beyond that, SF and the Golden Gate bridge. I even paid an upgrade fee offered after booking to get a room on a higher floor to help improve my view. The room was spacious and nicely appointed...on par with other 3+ star hotels. Only view I had from the room was of the marina (peak of SF if I hung out over the tiny balcony and craned my neck to the right). Bed very comfortable. Sheets crisp and white. Noiseless HVAC. But cramped, low-ceilinged bathroom with really poor, fluorescent lighting and no mirror in the main room for better lighting during make-up application (I think all 3+ star hotel rooms should have magnifying make-up mirrors hung on/extending out from the wall). Bathroom door wouldn't stay open, so had to put the trash can in front of it to keep the door from hitting my backside while I was standing at the sink...but further taking up what tiny floor space there was. No cell service in the room (Sprint kept telling me I was roaming).", "title": "Needs work, location questionable, great breakfast", "user": "MSLAMT", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 134243950}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Free parking is nice, but depending on your room's location, it might be a bit of a hike.", "title": "Just a little disappointed...", "user": "prettynpink0119", "date": "July 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134215332}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Very nice, efficient front-desk staff for check-in. Later removed the updgrade fee when I advised I didn't pay extra to get a higher up view of the boats in the marina.", "title": "Nice location", "helpfulness": 1, "user": "Goobstress", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134044861}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Easy check-out.", "title": "If you are looking for a boring, quiet, unfriendly hotel...this is it!", "helpfulness": 2, "user": "Heather H", "date": "July 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 134020758}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This hotel is located on a corner of the marina and opposite is the lauching off point for several dinner cruise boats. The hotel has a small front desk / lobby area in the main building which also houses the restaurant, conference rooms and an indoor pool. There is a nice patio and lawn facing the marina where the hotel holds barbecues or puts on events. The guest rooms are located in several adjoining buildings which are a bit of a walk from the frond desk. Better to check in and then drive to a parking spot closer to your room. The rooms either face the Marina/Bay or the parking lots.", "title": "Nice hotel with friendly service", "helpfulness": 1, "user": "joylama", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135144503}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We had a first floor marina room. There were great breezes from the bay with the door open. There is a fair amount of foot traffic on the pathway that led past our room, but it did not cause any issues. The room was a good size and appeared to be renovated. Bathroom was small but functional. The staff was friendly and helpful. There is a gym and another pool located in a building that is between the guest room buidlings and appears to be for adults only. The hallways in the guest room buildings were sparse and appeared a little worn out, but were clean with ice and soda machines located around the property.", "title": "Very nice, worth staying in again.", "user": "Sean M", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135072309}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Property is just a few minutes off of the highway and minutes from downtown Berkeley. All in all, it was a nice place to stay.", "title": "Spread out, inconvenient for large conference, but great service", "user": "BLB36", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134833351}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This hotel was very nice. The only negative thing was the balcony door wasn't very secure however there were no problems. I would stay here again because the staff were so welcoming to my family and I. For breakfast there was a lot to choose from and there is something for everyone.", "title": "Nice location, quiet room", "user": "needavacation02", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134811218}, {"rating": 5.0, "title": "Nice enough place", "text": "There were about 500 people attending the conference, and plenty of conference rooms and chairs...unfortunately, the majority of the rooms ran off a single hallway outside of the restaurant, and the hallway was WAY too small to accomodate the crowd. To make matters worse, they put the coffee, water and buffet lunch for conference attendees in the hallway! It was difficult for us to get by, and practically impossible for non-conference people who wanted to get to the restaurant. Very bad design/logistics.", "user": "fire_chief92", "date": "July 18, 2012", "id": 134676708}], "location": {"country": "United States", "city": "Berkeley"}, "stars": 3.5, "variance": {"poor": 33, "average": 97, "very good": 202, "terrible": 15, "excellent": 139}, "aka": "Doubletree By Hilton Berkeley Marina Hotel", "slim_ranking": 0.238095238095, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Breathtaking views of the Bay Area, San Francisco skyline and Golden Gate Bridge usher guests into our elegant lobby. Our beautifully appointed guestrooms and suites include private balconies or patios, and are available with Berkeley Hills, Courtyard, or Marina views. Our 378 guest rooms include all the comforts of home, including high-speed Internet access and luxurious Sweet Dreams beds. Guests are also offered fine hotel amenities, which include an indoor family pool and spa, indoor lap pool, well-equipped Fitness Center, and sauna. Enjoy the finest in California cuisine at our waterfront restaurant, Bay Grille, or relax with your favorite beverage at sunset in the Bay Lounge."}