{"user_rating": 3.5, "review_count": 275, "name": "DoubleTree by Hilton Hotel Fort Lee - George Washington Bridge", "reviews": [{"rating": 4.0, "title": "Dont need expensive cabs", "text": "If you are staying here at the Hilton in Fort Lee, there are a number of buses that go down route 4 and over the bridge into NYC where you can catch a train. These buses run 24 hours, and from the NY side at the bridge plaza you can get a car to the hotel for around 25 bucks!", "helpfulness": 6, "user": "muzebiz", "date": "June 22, 2005", "id": 3604451}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "Getting to this hotel is kind of tricky. It's $16 worth of tolls + fare from Laguardia. From JFK, it's $88. It's sort of off in the sticks, which your cab drive may have a hard time finding.", "title": "OK for business", "helpfulness": 4, "user": "hnewburn", "date": "June 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3545191}, {"rating": 5.0, "title": "Excellent service, amenities, comfort at Fort Lee Hilton", "text": "Check-in went fine, the room was small but workable. Free high speed internet access was great. Lots of television channels, though TV reception was lousy that night. Bed was very comfortable though.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 1, 2005", "id": 3516971}, {"rating": 4.0, "title": "Not the Hilton Standards but very aceptable", "text": "Room service went until 11:15 PM, which I needed. The lady was a bit surly because I called at 11:05, but the burger was good and not out of line with what other hotels charge.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3281123}, {"rating": 3.0, "title": "A Passable Hiliton", "text": "They offer a shuttle bus into Manhattan which is $20, runs 4 times a day. I ended up having to use a taxi service instead, which was $56.", "helpfulness": 10, "user": "onerpm", "date": "March 30, 2004", "id": 1756613}], "location": {"country": "United States", "city": "Fort Lee"}, "stars": 3.5, "variance": {"poor": 31, "average": 60, "very good": 88, "terrible": 17, "excellent": 79}, "aka": "Doubletree By Hilton Fort Lee Hotel", "slim_ranking": 0.333333333333, "description": "The DoubleTree by Hilton Hotel Fort Lee - George Washington Bridge is just minutes from the George Washington Bridge, Midtown Manhattan, and MetLife Stadium in Fort Lee, New Jersey. Visit our hotel and enjoy a meal at Café Milano or Sugi, complimentary Wi-Fi, & shuttle service to/from Manhattan. Whatever the reason for your visit, relax and keep in shape at our fitness center, heated indoor pool, and whirlpool. Explore many Fort Lee area attractions just steps from our centrally located hotel."}