{"user_rating": 3.5, "review_count": 531, "name": "DoubleTree by Hilton Alana Waikiki Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We spent three nights at the Doubletree Alana in April, and due to a friend who works for The Hilton Family, we were able to get a special Friends & Family rate of $99 a night. As with a lot of hotels in Waikiki, there is only valet parking available, which is $19 a day. It's about a 5 to 10 minute walk to Waikiki Beach via the Hilton Hawaiian Village, which wasn't really an issue for us because that was not the reason for our trip to Honolulu. The front desk staff were quite nice, and we were given a room that is the closest to having an ocean view. The room (1219) its self was adequate, nothing spectacular and one of the smallest rooms on the floor, with a lanai, comfortable king bed, and desk, but oddly no other table or chairs. The room was behind the elevator shaft which was quite audible, but the real problem was the bathroom.", "title": "A so-so hotel....beware of the bathroom.", "helpfulness": 2, "user": "Kosmonaute", "date": "May 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7544440, "likes": {"liked": "— The staff.", "disliked": "— The bathroom."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "On the hotel's website, and in guidebook reviews, they make a strong note of the Furo style soaking tubs which we were looking forward to. In our room at least, it was a square with no light where there wasn't much room to stand in, much less soak. Perhaps they confused \"soaking\" with deep, for it was extremely difficult to get in and out of, and we're limber 20-somethings. The shower curtain was completely useless.....it wasn't wide enough to cover both ends of the tub, so water would seep out everywhere onto the floor. The taps for the sink were located under a shelf that ran the length of the wall and were very difficult to turn on and off. The spout was under the shelf as well which made it challenging for face washing, teeth brushing, etc. There was also a clear acrylic shelf hung low that was nearly invisible, so invisible that my fiancé cut his head on it.", "title": "Nice Hotel, Great location", "user": "Pocahoney", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7295273, "likes": {"liked": "— Convinience", "disliked": "— Renovations being made"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "We didn't eat at the hotel, rather we walked to Ala Moana Center's food court or further into Waikiki. We didn't use the pool or fitness center either, but we did use the business center a few times for internet access, which costs $1 for 5 minutes.", "title": "Decent location away from the crowds", "user": "amilu", "date": "March 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7202499, "likes": {"liked": "— clean, easy access, less crowds", "disliked": "— lack of a good bar/restaurant"}}, {"rating": 4.0, "title": "Very nice hotel", "text": "We were told that the most discounted general rate (the Friends & Family rate can only be booked by a Hilton Family employee) for the time we were there was $169. If you come to Honolulu specifically for Waikiki, stay elsewhere. If you do stay at the Doubletree Alana, do it only because you know someone who works for the Hilton Family....$99 is worth it, $169 is definitely not.", "helpfulness": 2, "user": "KSSuziq", "date": "March 15, 2007", "id": 7165624}, {"rating": 3.0, "stay_parameters": "Stayed December 2006", "text": "My fiance and I stayed at this hotel the first weekend of April. It exceeded my expectations. I though this would just be like any other average hotel but is not as bad as it seems. The room was large and the bed was very comfortable. It is within walking distance to the beach, major bus stops, shops and malls. It is one block from the Hilton Village Hotel. You can use their facilities at no cost and walk to the beach from there. The Doubletree offers a nice buffet breakfast and not as expensive as other hotels. It offers all kinds of breads, cereals, fruits, omelettes and a variety of hot items. Unfortunately, we were not able to use the pool since it was being renovated. But that's ok since the beach is not far. We will definitely stay at this hotel again.", "title": "Good... but wouldn't stay again", "helpfulness": 3, "user": "Nickstr", "date": "March 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 7154087}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Stayed at this hotel on Sept 2nd and had just an average stay. I am somewhat disillusioned with the Doubletree's I have stayed at in past couple of months. This one was better than the others but only for the location, which was nearby the Hilton Hawaiian Village area. Rooms were small but clean and the upgrade they teased me with online was non existent (not available per the front desk). No free WiFi in the room only the lobby area. The front desk staff was helpful with dinner recommendations (ask for the printed list). Overall for the price it was just OK.", "title": "Honolulu quick stay", "user": "madhungarian_41", "date": "September 12, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118038190}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Stayed for a couple of days of fun after going to a convention.", "title": "Waikiki's best kept secret", "user": "CortinaAirlines", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117745868}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Location is great, walking distance to the Ala Moana jumbo mall and of course waikiki beach. Staff was super pleasant, and loves to treat customers with their delicious cookies. They also were helpful to organize a tour to Pearl Harbor in a concierge manner. I was upgraded to a suite which was great.", "title": "4th of July Waikiki weekend", "user": "Mauka_Ohana", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 117594750}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I'm not putting excellent to Breakfast because it could use a few more items like scrambled eggs and a larger choice of fresh fruits. Also, a breakfast room with windows would be appreciated.", "title": "WE LOVED IMMEDIATE CHECKIN", "user": "Jimbo05_11", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117570095}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Apart from those micro draw back, it's one of Waikiki's best value.", "title": "Bed Bugs Galore", "helpfulness": 4, "user": "Sofio Z", "date": "August 30, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 3.0, "service": 3.0}, "id": 117474986}, {"rating": 3.0, "title": "it was ok.........", "text": "the hotel was ok....but not good enough for a relaxing and luxurious vacation, so if you have some money, get a better place.", "helpfulness": 4, "user": "kamehameha-eyx", "date": "February 18, 2007", "id": 6807754}, {"rating": 4.0, "title": "Great service, nice room, comfortable stay", "text": "We were referred to this hotel when the other place we wanted to stay was sold out. \\ I was a little nervous after reading the other reviews but must admit that our experience was wonderful. The customer service was excellent, our room was clean and spacious (and there was absolutely no mold in the bathroom). The room had a balcony big enough for two chairs, and a small refrigerator. The room was quiet. The food at the hotel was a little overpriced (but c'mon, when is hotel food not overpriced?). There are a couple of close options for dining. The hotel is just a few blocks from beach access and high-end shopping. I would definitely stay at this hotel again (but next time, I would probably pay the extra and stay directly on the beach).", "helpfulness": 5, "user": "TexasTraveler24", "date": "January 5, 2007", "id": 6556747, "likes": {"liked": "— Quiet rooms", "disliked": "— it isn't right on the beach"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I was SO SCARED that my company had put me in this hotel after I read some of the reviews posted here! HOWEVER, I am completely comfortable here. (Literally - I'm in the restaurant right now using the free wireless internet!)", "title": "Give it a shot!", "helpfulness": 9, "user": "lydiag23", "date": "October 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5921137, "likes": {"liked": "— Balcony! Location", "disliked": "— Restaurant's speed of service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The room is just fine. My room does not reek of mold (as I was afraid of!) It was a touch musty, but I opened the door to the balcony and it aired out quickly. It is pretty clean - bathroom corners could use a good scrub, but I'm not frightened by any means.", "title": "Hilton Diamond members....stay here! We were treated like royalty!", "helpfulness": 6, "user": "jlefief", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5540466, "likes": {"liked": "— The Penthouse, room 1911!!! We were upgraded to this from a city view room for free!!!", "disliked": "— A couple blocks from the beach."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "The shower is strange - to agree with a prior review. It has a pretty high \"wall\" around it - at least 24\" (It is above my knees) with a square corner, so slipping would be a disaster! The towels are sort of old & not very soft, but they are clean.", "title": "Moldy, Smelly, Gross", "helpfulness": 22, "user": "TBEE_9", "date": "July 9, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 4.0}, "id": 5443422}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "The room was nice but their idea of an ocean view room for $200+ is a joke, we could hardly even see the ocean from our room. All we could see were a bunch of buildings & off to the corner a bit of the ocean. The cookies that were promised at check in were not hot & they contain nuts, what about those who are allergic to nuts?! We requested a late check out & were told we would be notified by 7am whether or not this was possible and no one bothered to contact us. Staff seemed like they didn't care about providing good service.", "title": "Not worth the money for an ocean view room", "helpfulness": 22, "user": "mindi", "date": "June 22, 2006", "detail_rating": {"value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 5375455}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "After \"winning\" a bid on Priceline for $95 per night, I was advised I would be in the Doubletree Alana. I was very upset to see the negative reviews, but there are no refunds with Priceline. I called the hotel directly to ask for a QUIET non-smoking room (I told them I didn't care about the view, as long as it was quiet). The person I spoke to was somewhat rude, once she heard I had purchased thorugh Priceline, and told me they could make a note of the no smoking request, but couldn't guarantee any other requests. As I hoping to to relax, and celebrate my birthday, this was not how I wanted my trip to start out. I decided to see what happened and deal with it.", "title": "Better than expected", "helpfulness": 6, "user": "brushman333", "date": "April 18, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4984908}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "I arrived around 9PM in the 40-day downpour that covered Hawaii. I checked into my room, which was clean, a good size and had a lanai, and faced the city/mountain view. The distance from the street was adequate, and traffic noise was not an issue as long as the lanai door was closed. I went to eat in the hotel restaraunt, wich was very small, with a very limited menu. I ended up ordering a small salad, which cost $13. It was not good. I asked how late the hotel bar was open. 10Pm closing. I returned to my room. However, it soon became evident that there were \"Spring-Breakers\" in the rooms around mine (room 406), as they darted in and out of rooms, made lots of noise, and were obviously having parties going on simultaniously. After an 11 hour flight, I needed my sleep. I went to the front desk to complain. To my surpirse, they immedialtely moved me up to the 16th floor, room 1602.", "title": "Musty Smelling and Mold", "helpfulness": 24, "user": "ebower00", "date": "March 2, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4568996}, {"rating": 2.0, "title": "You can do better than this place", "text": "This had the same view, but was at the end of the building. The room was clean and quiet, and I was quite satisfied. I stayed a total of 4 nights, one more than I had originally planned, due to the rain. My final night, booked with the front desk, cost $159.", "helpfulness": 28, "user": "A TripAdvisor user", "date": "February 7, 2006", "id": 4443539}, {"rating": 3.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "In review, I have to say that the Alana exceeded my expectations, and I had a pleasant stay. The bad raps listed here are not justified, based on my experience. The room was clean and well kept. The free WiFi access in the lobby was very useful, and I eventually made use of the in-room wired connection, which was $10 per 24 hours. The staff were friendly and accomodating.", "title": "Ho-Hum", "helpfulness": 24, "user": "JacksonPA", "date": "January 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4391449}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "The overall feeling that I got from the hotel was that it was just average. On the plus side, it was relatively inexpensive, but these people who posted that it was an \"easy walk to the beach\" are being generous, in my opinion. The beach is at least 3 blocks away. There are some restaurants nearby, and better ones within about half a mile. The outrageous charge for valet parking ($28 a night) deterred me from renting a car, so I was relegated to the city bus for the duration of my stay. As a gold member in HHonors, I was upgraded to a suite, but the \"suite\" was nothing special. I was stuck with a view of numerous other surrounding buildings. The pool is fine, again, nothing special. Perhaps the best part of the stay was the housekeeper, who, upon seeing me leave my room in swim trunks literally RAN to me to offer me towels -- now THAT is service. I guess you get what you pay for; an inexpensive hotel, but overall just okay. Next time, I think I'll pay a bit more to stay somewhere better.", "title": "Average hotel", "helpfulness": 1, "user": "Fzedlach", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 118394938}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed one night to make an early work related appointment more manageable. The online directions from the airport are easy to follow. It was easy to pull-up and hand my keys over to the valet ($29/day with NO other options...not too atypical for the area). My greeting at the front desk was fantastic and my HHgold got me upgraded from a king room to a penthouse suite. It was FANTASTIC in this instance to have the dining/conference table in my room to spread out and do last minute work. The bed was VERY comfortable and decor was fresh and modern. I had a light meal at the restaurant that night which was perfectly tasty and well priced.", "title": "Easy walk to beach, great value", "user": "arobin", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 118185145}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "To address the negatives written by previous reviewers- the bath: yes, its slightly small and NOT meant for more than one person BUT I am an average height woman and found there to be no issues with sitting comfortably in the tub. In fact, I really appreciated how deep the tub was and enjoyed having a jacuzzi bath in my room. The shower is also very nice and the shower head is on an aesthetically pleasing sliding rod to fit even the tallest people. The tile scheme was very pleasant and everything was CLEAN CLEAN CLEAN!", "title": "Great value in a beautiful, stylish hotel.", "user": "plaidbeagle", "date": "September 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118122047}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Location- its about a 5 minute walk to the start of all the big shopping in Waikiki, a 5 minute walk to the beach, and I felt completely safe walking as a single woman.", "title": "It's a typical doubletree hotel, walking distance to the beach", "helpfulness": 2, "user": "inowreview", "date": "September 14, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118108966}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Although I enjoyed my upgraded room, I did use a standard room as part of their hospitality suite (so if you have a later flight you can still wash up before heading off) and it was also clean, well decorated and relatively spacious.", "title": "Do not visit this hotel, please!", "helpfulness": 1, "user": "Il_Quadrifoglio", "date": "September 14, 2011", "detail_rating": {"value": 1.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 118099598}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I've stayed here four times since the hotel's total room renovation earlier this year. It has become my default place to stay in Waikiki for value, location, and service.", "title": "NEW FAVORITE IN WAIKIKI", "helpfulness": 2, "user": "PDXBigGuy", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120688014}, {"rating": 3.0, "stay_parameters": "Stayed November 2011", "text": "PROS:", "title": "Terrible wifi and false fire alarms killed a hotel that could have been better.", "helpfulness": 1, "user": "chuckaw", "date": "November 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 120566016}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "-location: on the western edge of Waikiki, away from the tourist congestion on Kalakaua Ave. 4 blocks from the beach.", "title": "Great hotel if you plan spend your time sighseeing", "user": "stan8880", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120554984}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "-price: the best rates of the Hilton chain (Hilton Waikiki, Embassy Suites, HHV)", "title": "A nice hotel stay", "helpfulness": 1, "user": "Vdoman", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120135522}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "-great renovated rooms with large flat-screen TV and excellent beds.", "title": "A little overpriced for what is included", "user": "selph", "date": "November 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 120096790}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "the staff is friendly, service is good, and the rooms are very clean. i've stayed here twice, pick the mountain view over the partial ocean as partial means miniscule.", "title": "good hotel for the price", "helpfulness": 8, "user": "FKS", "date": "January 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4332848}, {"rating": 2.0, "title": "Try your hardest to find something else first-Wholeheartedly agree", "text": "the bathroom is on the small side and the japanese-style tub takes some getting used to because of the high edge. i got used to it, but my friends didn't like it. breakfast at padiovani's (onsite restaurant) is limited to sausage, eggs and bacon, or a croisant and fruit.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4316902}, {"rating": 4.0, "title": "Good, clean, family friendly hotel.", "text": "my one complaint is the lack of self-parking. you're forced to valet park, and if you do a lot of in and out parking, it adds up quickly.", "helpfulness": 10, "user": "Murrieta1", "date": "December 28, 2005", "id": 4308643}, {"rating": 2.0, "stay_parameters": "Stayed May 2003", "text": "overall, i'd stay here again.", "title": "mediocre", "helpfulness": 55, "user": "nwf", "date": "December 23, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4280612}, {"rating": 4.0, "title": "Clean, but is on a chiller-not air-conditioned", "text": "This is my last resort when staying in Waikiki. The price is reasonable and rooms are usually available, but the quality is way below Doubletree standards. Be careful if you book a room here. I found that they will charge you for any day that you reserve, but do not stay; not just the first day, but any day.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "September 23, 2005", "id": 3935204}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I recently stayed at this hotel for 10 days and there were good and not so good aspects to it.", "title": "Potential", "helpfulness": 1, "user": "Joe M", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119736720}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I travel to Honolulu yearly for work and have stayed in a variety of hotels.", "title": "Easy walk to beach", "user": "Beth_sage", "date": "October 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119196705}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The staff were very pleasant and accommodating. They were in the top 3% of hotel staffs that I have encountered in Waikiki. When I had to move rooms due to excessive noise from roadwork below my room at 10pm at night, the night manager Alan was exceptionally courteous. Grade = A++.", "title": "Easy location to use as a base to explore", "helpfulness": 1, "user": "Ace_Coco", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119118369}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "The bed was very comfortable and the pillows soft. I had to switch out my pillows after the first night because they smelled moldy. Grade = B+", "title": "Affordable alternative to Hilton Hawaiian Village", "helpfulness": 1, "user": "Dr_Drew2", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118982841}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Proximity to major roads in/out of Waikiki (Ala Moana and Kalakula) was good. It was nice not having to drive down from east Waikiki through the troves of tourists on Kuhio. Grade = B+", "title": "Great location", "helpfulness": 1, "user": "ItsTimetoRelaxNow", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118540316}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 42, "average": 118, "very good": 215, "terrible": 27, "excellent": 129}, "aka": "Doubletree Honolulu", "slim_ranking": 0.530120481928, "description": "Doubletree by Hilton Alana Waikiki is a newly renovated chic boutique hotel located at the entrance to Waikiki in Honolulu, HI. The hotel is within a short walk of the beach, shopping and dining and one of the closest hotels to Hawaii Convention Center and Ala Moana Shopping Center. After a multi-million dollar redesign rooms now feature the Sweet Dreams by Doubletree sleep experience, bathrooms offering walk-in glass showers with oversized \"rain\" showerheads, large state-of-the-art high definition flat screen televisions with side panels for easy laptop connectivity, comfortable ergonomic workstations for our business travelers, and multiple outlets for electronic devices. Both wired and wireless high speed internet is available in all rooms for a charge and complimentary wireless high speed internet is available in the lobby area. During your stay you can also enjoy complimentary in-room coffee makers with coffee service, complimentary safe and movies on demand. Bedding offered is either one king bed or two queen-sized beds and all rooms have a lanai (balcony) and either city/mountain or ocean views."}