{"user_rating": 5.0, "review_count": 22, "name": "Doune House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I agree with all reviews here so far - this B&B was excellent. Sharon could not have been more helpful. Highly recommended.", "title": "Really good, very freindly.", "user": "very_light_blue", "date": "June 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113684140}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed at Doune House for two nights late in May 2011. It is easily the best B&B we have ever stayed at. The service was excellent, with nothing too much for the proprietors, David and Sharon, to attend to. Our double room was spotlessly clean, as was the whole house, with the toilet more than adequate. The shower was very simple to operate - a big plus for that! The B&B is situated on the main street of Edzell, a delightful village in Angus, but the traffic outside is very light and there are no heavy lorries to spoil one's sleep. The bed was incredibly comfortable and we both slept like logs.", "title": "A Real Home From Home", "user": "GlasgowEric", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 110773920}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The highlight was breakfast, which was prepared and served by Sharon. The fresh fruit was outstanding - mostly local and the freshest we have ever had.", "title": "not a B & B but a home from home", "user": "WilmaB24", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108120604}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "No downsides to this B&B at all. We will certainly return to Doune House if we need a B&B in this area.", "title": "Coziest, cutest and friendliest B&B in Scotland", "user": "Chellownc", "date": "March 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99437765}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "From the moment we arrivied to the moment we left we were one of the family, Sharon is the perfect host and her home is your home. The bedrooms were well equiped and clean the bathroom had little extras to make you feel at home with plent of hot water when required. The breakfast suberb and nothing is to much trouble extra toast extra bread everything locally sourced.", "title": "Great friendly welcome in a lovely village", "user": "Scottish_Traveler_10", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80749661}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "My wife and I stayed at this B&B for a wedding in nearby Brechin. Sharon the owner and her husband were welcoming and extremely helpful. They pointed us the direction of local flora and fauna as well as landmarks such as the Edzell castle. The produce served at breakfast was all locally sourced - fruit, meat, eggs, preserves... The location of the high street is a misnomer - it's one of the quietest streets I have ever come across.", "title": "Beautiful village, lovely owners and great breakfast!", "helpfulness": 1, "user": "Mr_Mesh", "date": "September 29, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 20475078, "likes": {"liked": "— The helpfulness of the owners", "disliked": "— not having an en suite"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My wife and I were in Edzell for a wedding and picked Doune House at random from the list given by our friends in their invitation, what a great find! As mentioned in other reviews Sharon was so welcoming and friendly it was shame that we were only there for one night. The breakfast was fantastic, all fresh and local produce. The bed was comfy and was great.", "title": "Very Friendly", "user": "OutdoorGuy76", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75415645}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "Having used Doune House as my base for my annual holiday ever since Sharon and Dave took over in 2005, the obvious question is why do I keep returning? The answer to that is to be fond in the friendly and welcoming manner of the owners as well as the excellent standard of the food and accomodation. They offer what must be the best value in Scotland, they are: SIMPLY THE BEST. Anyone who visits is sure to want to return to lovely accomodation in a charming village.", "title": "SIMPLY THE BEST", "user": "TobyTwirl1941", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72875050}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Clean, comfortable and friendly owners. The breakfast was excellent as well. I would highly recommend this B&B to anyone.", "title": "Friendlist Guest House Owners in Scotland", "user": "tallent_megan30", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68335696}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I don't normally write reveiws but I have to give credit where credit is due. After a rash of unfriendly,untidey B&B's this was heaven sent. Sharon and Dave are the freindliest B&B owners I have ever met. They are so helpful but also give you plenty of personal space and always seem to be there at just the right time. They were extremely accomadating including letting us put away some of our outdoor kit. The rooms where very spacious for a B&B each having a sink inside the room, and though the bathrooms are outside the rooms, they still seem private as there was a bathroom for each room on the floor we stayed on. The bath and bedrooms were well kept and very clean. The bottled water and biscuits were a great touch and much needed after a long day in the hills. I had a great nights sleep which is usually difficult when I'm not in my own bed but the bedding was very comfortable. Breakfast was fantastic, cooked perfectly and the fresh eggs from their hens was an added bonus. You can tell that they love having a B&B and that they are not just doing it to have a business. I would recommend Doune House for anyone staying in Edzell.", "title": "Friendliest B&B in Scotland", "user": "happyoutdoors25", "date": "June 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66985953}, {"rating": 5.0, "title": "Doune House - Best B & B we've stayed in", "text": "July 2009", "user": "DevonMaryB", "date": "July 26, 2009", "id": 35805944}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 20}, "aka": "Doune House Edzell, Scotland", "slim_ranking": 0.5, "description": "Doune House is well situated for walking, cycling, golfing, fishing, shooting or just relaxing. We pride ourselves on using local produce. With have a downstairs double room with en-suite, we have two other rooms with private bathrooms, we also offer a guest sitting room, though all rooms have TV, tea making tray, hairdryers etc, there is a drying room & can always find room in the shed or garage for bikes."}