{"user_rating": 4.5, "review_count": 113, "name": "Dower House Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "We stopped in a standard room in the lodge, this is obviously a new addition to the hotel and I must say the quality of the bedroom throughout was outstanding ( bed a bit to hard for my liking)", "title": "Ask to stay in the lodge", "helpfulness": 1, "user": "Don B", "date": "July 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 169322250}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Reception was ok, but it would have been nice to have been shown the way to the lodge instead of being pointed in the right direction and being told the room was on the 1st floor.", "title": "Our Dreams Came True!!", "helpfulness": 2, "user": "Katy P", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168778126}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Drinks in the bar was a bit of a chore for the receptionist, who seemed to be doubling up in jobs. I was told that she would be there as soon as she had finished some work on her computer, which isn't good enough for a premium hotel.", "title": "Lovely relaxing hotel", "helpfulness": 2, "user": "SimonKim2011", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168432451}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "We didn't have an evening meal but stopped for breakfast which was ok. A coffee pot on the table would be nice instead of trying to attract the attention of the waitress each time you want a top up (she seemed to suffer from tunnel vision). Fresh fruit juice is a must, but was obviously powdered or worse, the mushrooms seemed very watery and thought they may be from a tin. For a hotel wanting to charge in excess of a £150 per room,I just cannot understand why they try to save a couple of quid and ruin the whole experience.", "title": "Great stay, beautiful hotel", "helpfulness": 1, "user": "TADAKG", "date": "July 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 167920895}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Even after my moan I would highly recommend that you stop in this hotel if you require accommodation in this area as it is a gorgeous setting", "title": "Very good Hotel", "helpfulness": 2, "user": "TimmyTot", "date": "July 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167489491}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "My daughter was married here on the 24th October 2013. We couldn't have asked for a more excellent venue. Ann Dobbs organisation for the planning and execution of the event was without question faultless. All the staff throughout were professional, friendly, helpful and above all happy, the two barman were dancing at times which made everyone feel great. The Food was excellent in every way. The rooms were again, without fault and some guests not staying were disappointed that they hadn't booked rooms. We would strongly recommend anyone considering a wedding venue to look at what the Dower House has to offer. Having said all that the Dower House would be an excellent Hotel whilst staying in the area. Thoroughly thouroughly recommend this Hotel.", "title": "Excellent Hotel without question", "user": "RobSu", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182916812}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "A great find – an attractive hotel in a lovely setting, offering a high quality experience at a very realistic price. We stayed just one night, but would have loved to stay for more. All the staff we encountered were friendly, polite and helpful. Our double-aspect room in the annexe was absolutely beautiful, furnished to a high quality, and with a very well-fitted bathroom. The bar in the main hotel is nicely appointed and friendly. The breakfast was of a very high standard, offering copious choice. We would definitely stay again. This gives the impression of being a highly professional operation, combining high standards, friendliness and style – all at very reasonable prices. So it can be done. Plenty of other places could learn a lot from the Dower House.", "title": "highly professional operation, combining high standards, friendliness and style", "user": "2travelersLondonUK", "date": "October 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182720924}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "My second stay in several years and still the best in the area (believe me I have tried them all).", "title": "Like staying at your favourite (well off) Aunties", "user": "DerekTT", "date": "October 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182322868}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Large clean and comfortable room, warm friendly staff, good beer and great food. Proper English breakfast. Free WiFi, modern TV's, quite despite the golfers. Shame they are so well booked up in advance.", "title": "Excellent hotel!", "user": "Ben632", "date": "October 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181687794}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Spent a romantic weekend away with my fiancée and it was fantastic. The room, staff and general ambience of the hotel was to a very high standard. We ate there for breakfast lunch and dinner and found the food excellent and extremely tasty.", "title": "Lovely,lovely,lovely!!!", "user": "Elec_rep", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 179912483}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "We first stayed here over 20 years ago when it was small, intimate & wonderful. The grounds are still lovely & the setting still excellent. There is no doubt that the rooms in the new wing are a vast improvement - spacious & very comfortable with large bedrooms & high quality bathrooms. However, since it has grown in size, what it has gained in quality it has lost in character. The décor of the main dining room & the meals are OK - just not anything spectacular anymore although the Bar & Sitting Room still maintain an air of charm. Meals are perfectly acceptable although the menu seems somewhat stuck in the 1970's. Staff are very friendly & it is obviously very popular with golfers & as a wedding venue but for us it has lost some of the magic that once made it the very best hotel in the area. It definitely deserves a better rating than average but cannot really put it in the 'very good' range either but a good all rounder for sure.", "title": "Good", "helpfulness": 1, "user": "TravellerAbuDhabi", "date": "September 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179061035}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Stayed here for the night with family. The rooms are stunning and very comfortable. Atmosphere is warm and friendly and the food and service is amazing. Would recommend this is a beautiful place to stay.", "title": "Beautiful", "user": "Wolf5pirit", "date": "September 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178971464}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Despite booking 14 rooms at the beginning of the year for a family party, we were told last month that we couldn't eat there in the evening because they had a wedding on. Rooms were variable quality, the good ones in the lodge were very nice but some in the main building were cramped and noisy. In the end, glad we couldn't eat there because breakfast was awful - tinned juice and Sunblest toast. Overall, we were not made to feel at all welcome (except for Emma the brilliant receptionist). Disappointing.", "title": "Nice room, poor service and food", "user": "Rob D", "date": "September 27, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 178874043}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We did not stay in the hotel, which looks great, but had a birthday dinner in a private room for 10 of us. We would have eaten in the main restaurant but they were busy with a private party.", "title": "Shame about the main courses, the barman is so good", "user": "jenni08_13", "date": "September 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0}, "id": 178291952}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Drinks in the bar were great with good service from the barman and prompt service on taking our orders. We were then shown to the private dining room which was lovely but although we asked for the 2 doors to be closed, the waiting staff insisted on leaving them open for ease of service. This meant a chilly through draught for most of the evening and sometimes people queuing for the disabled loo along the corridor, looking into our \"private dining room\" while they queued. The choice on the menu was varied and one of our party with a restricted diet was well supplied with alternative choices. The starters were good, but the main courses let many of us down. There was a chump of lamb which was inedible to due fat and gristle and the duck, though good to look at, was cold, tasteless and had an insipid \"orange marmalade sauce\" which was more like packet gravy. The puddings were good as was the coffee. Given that the mains were all about £15 - £18 we thought the quality and the cooking did not warrant the costs. To be fair, the chump of lamb was not charged for after a complaint was made.", "title": "great place to stay", "user": "MikeCuthbert", "date": "September 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 176713187}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Had a very nice stay at the Dower House. Our room had decorating stuff in it and so we had to be moved. To be fair we were then allocated an upgraded room which was lovely. No complaints, a very relaxing stay, Thanks", "title": "Very Good", "user": "LincolnHairyBear", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175763813}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I stay here on business approximately once a month and wouldn't want to stay anywere else in the area. All rooms are well appointed and comfortable whether in the main hotel or in the lodge. I've not had a bad meal, and portion sizes are definitely on the hearty side together with an extensive beer, wine and whisky collection. Breakfast is always excellent and the staff go out of their way to be of service.", "title": "Very comfortable stay", "helpfulness": 1, "user": "Andy C", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174382303}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The Dower House Hotel is a fantastic venue to retreat to for a break of relaxation without being too far away from amenities and attractions. The hotel has a warm and welcoming feel, with the interior decor very tastefully represented throughout the building. The grounds are mature and peaceful with areas of natural beauty a few strides away.", "title": "Excellent Relaxing Retreat", "helpfulness": 1, "user": "Dan W", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174255146}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "If you’re planning on an event, golfing or shooting trip then you will find it an excellent base too. The management are all very friendly with the food to a very high standard (Sunday lunch not to missed!)", "title": "Beautiful Wedding Venue", "helpfulness": 1, "user": "FrostyFam", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173354202}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Kinema is a short walk from the hotel and provides a good evening of entertainment if the weather is against you, failing this there are many areas of the hotel to relax in, with some great views from the rooms and the lodge is available for even more privacy on your get away.", "title": "Brilliant", "helpfulness": 1, "user": "richkathy", "date": "August 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173022384}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 1, "average": 7, "very good": 18, "terrible": 3, "excellent": 84}, "aka": "Dower House Hotel Woodhall Spa, Lincolnshire", "slim_ranking": 0.5, "description": "The perfect central village location, situated overlooking the Golf Course with the club house just two minutes walk. Recently completed extensive £1.5m refurbishment and the addition of \"The Lodge\", the Designer has retained all the original features of this beautiful Country House Hotel, including wonderful open fires in the Lounge & Bar. Seasons Restaurant offers a Full A La Carte Menu using locally sourced produce, with a selection of lighter meals that can be taken in Harrys Bar. Rooms have double aspect or bay windows with Twin or Super King Beds, en-suites with bath and power shower over- Suites have separate bath and \"walk in\" showers or book Room 16 for the freestanding double ended claw foot bath that you can really relax in. Even the complimentary in room \"Butlers Trays\" contain a jar of Shortbread which is freshly baked daily. Well positioned for visits to the Kinema in the Woods (2 mins), Memorial Flight (RAF Conningsby), local Antique centres, Lincolnshire Wolds, and historic Lincoln Cathedral. Hotel Car service to and from Airports & Newark, Grantham, Lincoln railway stations(charge applies). For Business, The Orangery, Oak Room and Garden Room provide the perfect solution for meetings / conferences or private Dining and the 24 hour reception allows for late arrivals or early starts."}