{"user_rating": 4.0, "review_count": 3537, "name": "Dreams Cancun Resort & Spa", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "WOW Very dissappointed with the Dreams Cancun and ResortWebdeals.com were we booked. This is not a 5 star Hotel, not even close. Its a two star hotel at best. Two pieces of Carido equipment in the workout room and 1 of the units worked. The food was not very good. Seafood night was okay , but the rest was not tasty at all. I am always amazed at some of the reviews that people write on some of these resorts. I know you cant please everyone. But this was a plain old joke. Would never stay here or recommend this Hotel to anyone at anyprice. Bad very bad, Maid service was good beach side service was good, restaraunt service was horribble most night would get drinks half way through meal. We stayed a beaches Turks and Caicos last year although the accomodations were not 5 star quality and the service was. We made the best of our Cancun vacation but feel a little cheated about the dreams Hotel. So now when I deal with some of these travel agencies, this will be the first test. I will ask them to tell me about the Dreams cancun. And then wait for the (--) to fly. Then I will know instantly weather they have credibilty or not.", "title": "Wow very very dissappointed Advertise as 5 star but its a 2 sta", "helpfulness": 3, "user": "swoff1", "date": "April 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 7365166, "likes": {"liked": "— CLOSE TO DOWN TOWN", "disliked": "— OLD NASTY SAME FOOD OVER AND OVER"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "I've just returned from my vacation (April 9-13, 2007). Since I valued the recommendations and reviews I read on Expedia and TripAdvisor, I thought I would share my experiences as well (to help others in setting their expectations). It's a great place for families and couples, but singles (even those like me who just want to go and relax away from the mayhem of Cancun) will enjoy their stay (so long as the singles don't mind being surrounded by families, kids, and strollers). I will start by staying that overall, I really enjoyed my stay @ Dreams. Below is a breakdown of the good and bad (maybe not \"bad\" but disappointing) I experienced:", "title": "The good and the bad", "helpfulness": 20, "user": "AMS7042", "date": "April 14, 2007", "detail_rating": {"front_desk": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7350264, "likes": {"liked": "— Restaurants and service", "disliked": "— Reservation/reception issues"}}, {"rating": 5.0, "title": "Love the Entertainment", "text": "* Reservation/Check-in: I reserved through Expedia a Deluxe Ocean View room with double beds (since I am a single gal traveling with one of my good friends--also another single gal). When we arrived (after a long flight) and proceeded to check-in, we were told that the hotel was \"overbooked\" and did not have any rooms with double beds left. Only a king size bed .After expressing our disappointment, the young man @ the reception suggested that WE come back to the reception the following morning where he ASSURED us we could switch rooms since there were many check-outs the following day, to which we did only to be told that we were never put on the \"list\" and could not switch rooms that day since the rooms were \"preassigned\" !!??!!. WE were asked to return the next day to try the switch (again), to which we did to only find out the room they wanted to switch us to was not in the same category as we'd requested. Since we had already been sharing a king sized bed for the last 2 nights, we decided to stop wasting our time. This was by far the worst part of our experience and there were no attempts by the hotel's management to right their wrong. At least the room was very clean and the view was nice (though the ocean view on the other side of the pyramid is better). The morale of the story: families and groups are given priority for the rooms with double beds...singles have to deal...though there is NO mention of prioritizing or \"subject to availability\" anywhere when making the reservation.", "helpfulness": 7, "user": "hillaryq", "date": "April 11, 2007", "id": 7335794}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "** Food and Service: The food, at any of the 4 restaurants on the property, was EXCELLENT. For a hotel that was \"overbooked\", I must say we never had to wait for a table. The service was also FANTASTIC-- the staff really makes you feel welcomed and are very friendly. With the exception of the World Cafe, the other 3 restaurants are located on beach-front with views of the ocean (with great breezes in the evening/night hours).", "title": "No resort staff tries harder than the staff at Dreams", "helpfulness": 12, "user": "401kid", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7331887, "likes": {"liked": "— The location", "disliked": "— Size of the room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "**Beach- very clean and lovely. Towels are available in abundance and staff come by frequently with bottled water and ready to take drink/food orders.", "title": "I Want To Go Back!!!!", "helpfulness": 9, "user": "ObTo", "date": "April 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7289620, "likes": {"liked": "— The beach", "disliked": "— The lock on my door"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband and I, along with another couple stayed Oct. 25-30.", "title": "All So Wonderful", "helpfulness": 9, "user": "candzz", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10603467, "likes": {"liked": "— All Inclusive Good location"}}, {"rating": 5.0, "title": "Wonderful food, fun group wedding", "text": "All I can say is \"it was all so wonderful !", "helpfulness": 10, "user": "el_cap", "date": "November 4, 2007", "id": 10589818}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "When we arrived, the first thing we heard was music coming from the lobby area. What a warm welcome we received from everyone. They had over booked the Deluxe Dolphin rooms but where very happy to set us up in a suite for two nights with no extra charge in the tower. It was a suite with the jacuzzi on the deck, a king size bed and large living room and bathroom. Very clean and modern. Loved it!", "title": "Awesome!!!!", "helpfulness": 8, "user": "antonie345", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10589873, "likes": {"liked": "— The ocean", "disliked": "— Small pool"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We could have stayed there for an extra charge for the remainder of our stay, but chose to be moved to over look the dolphins.", "title": "An awfully nice time", "helpfulness": 13, "user": "TScholtes", "date": "October 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 10475998}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "What a wonderful thing, to be able to relax on our balcony and watch the dolphins swim , jump, and entertain us. Be far warned, they are all none smoking rooms by the dolphins.", "title": "Dream Wedding", "helpfulness": 8, "user": "howdyall18", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10424192, "likes": {"liked": "— The views of the ocean", "disliked": "— More children than expected"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "We traveled with our 7 year old son the week of April16-21. It took me over a week to post this review because there were so many things that we loved about this resort that I couldn't possibly list them all. I will try to narrow it down to the highlights.", "title": "Resort: yes, yes, yes! Pools: no no no...", "helpfulness": 8, "user": "rileycando", "date": "April 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7475037, "likes": {"liked": "— Service, food, Tower section", "disliked": "— Pools"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Property/Arrival: Awesome location, surrounded by turquoise water, only 35 minutes from airport. We prepaid a private taxi company, Cancun Transfers, online. Most people complain about the airport porters who like to carry your luggage, however without a porter we would never have connected with our taxi, as there were nearly 100 taxi representatives crowded into a small roped off area outside baggage claim (pandemonium). The dollar a bag tip was well worth it.", "title": "BEAUTIFUL", "helpfulness": 6, "user": "jrzjenni", "date": "April 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7435188, "likes": {"liked": "— location & beach", "disliked": "— spread out property"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "The person checking us in at Dreams graciously offered to get us drinks from the lobby bar, then proceeded to take us to our room in the Club Tower. Gracious is a word worth repeating, as the service we recieved throughout the week was just wonderful, especially in the Tower section.", "title": "Lovely, Relaxing Vacation", "helpfulness": 7, "user": "SunshineOakville", "date": "April 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7432693, "likes": {"liked": "— The service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Room: We booked early and were lucky enough to get a corner jacuzzi suite. I won't spend too much time raving, but it was spectacular and huge. Pictures on the internet don't do it justice, Honeymooners take note...this may be the room you want. I also looked at standard rooms here and there. Yes, there are robes, slippers, full bottles of 8 or 15 sunscreen, incense (no fans), etc. Email with any specifics about rooms, I would be happy to give more details.", "title": "relaxing stay", "helpfulness": 5, "user": "beach07", "date": "April 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7429876, "likes": {"liked": "— The location and views", "disliked": "— more beach snack variety"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Tower Building/Perks: Impeccable service, never anyone in elevators, its own lobby with bar, dining tables, couches and full buffet breakfast each morning from 7:00-11:00. Also an outdoor seating area with tables. The tower also is somewhat removed from the main resort by a short walk, many people never ventured over, so it was always quiet and there was a feeling of privacy. Each evening at around 5:00 or 6:00 a wedding took place in the gazebo directly in front of the tower out on a point. When a wedding was not planned, appetizers were served early evening. Movies available to borrow with $35.00 deposit, 30 inch plasma tv/dvd. Direct ocean views.", "title": "Great Resort", "helpfulness": 4, "user": "chris92", "date": "April 24, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 7428450, "likes": {"liked": "— Service, food, location", "disliked": "— Weddings every night, not that big of a deal"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "First, PLEASE take all reviews, especially those negative, with a grain of salt. Complaints about musty rooms (it's the tropics, its damp people), lines at the airport, the taxi ride, the vendors on the beach, or from people uninformed enough to participate in a time-share sales pitch in exchange for \"free\" goods or tours (nothing in life is free folks), are irrelevant to this and any other resort.", "title": "Great food, great service, great location. The 4Seasons, it's not.", "helpfulness": 14, "user": "emdchicago", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10323973}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "If you want a smaller resort with excellent service and great food with three of the four restaurants being sea-side and open to air, then this is the place to go. Unlike the moon palace and other gargantuan all-inclusives, you do not have to get in line hours before the restaurants open to get a table or get up at the crack of dawn to make a reservation.", "title": "GREAT time at Dreams!", "helpfulness": 12, "user": "godanid", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10280280, "likes": {"liked": "— Location and the larger size of the property, two seperate beaches", "disliked": "— The small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "It is an older hotel taken over by Dreams, so the rooms and physical structure look a bit tired but if you're going to spend all your time in the room or studying the building, then this is not the place for you. The fridge in the room is filled with water, beer, and soda daily and the rooms have tv's with dvd players. Free wifi is available at the bar and lobby area.", "title": "Dreams Cancun was a perfect Dream!", "helpfulness": 13, "user": "sunflowerz", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10259841, "likes": {"liked": "— The location, staff, explorers club, ocean, pool, food, drinks, hotel grounds, views, activities.", "disliked": "— They don't have a disco bar at the resort."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Location is the other key to this place... it is walking distance to much of the night-life scene in Cancun as well as to shopping, not to mention a short bus ride to central Cancun. The hotel has beach on two sides as well as a salt-water lagoon in the middle of the property. The one fresh water pool is relatively small and simple, so if you are a pool-person and need a large pool with waterfalls and slides, again, this is not the place for you.", "title": "View Was Amazing, Food okay", "helpfulness": 3, "user": "soccergal_34", "date": "October 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10257394, "likes": {"liked": "— all-inclusive, the view", "disliked": "— smell from the"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The activities staff go out of their way to keep kids of all ages (including adults) entertained, if they desire. While they don't put on cheesy amateur shows, they do organize nights out on the town, karaoke contests, game nights, dance lessons, and many other activities. We were there during the college football national championship game, and the activities crew set up a projection screen to watch the game on the beach as well as provided snacks and drinks while we watched the game sitting in lounge chairs!", "title": "extremely over rated...", "user": "ntaylor093", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 10218988, "likes": {"liked": "— Location", "disliked": "— The cleanliness of the resort."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My wife and I and another couple stayed at Dreams and loved it.The staff and hotel were great and the beach and ocean were the best .A little windy on the point, but it kept you cool.If you are a beer drinker, ask for ice in the glass. Take the bus downtown and enjoy a unique experience. Hold on tight- the drivers are all maniacs! We only saw one obvious drunk the entire time and she was greatly assisted by the hotel security people. Warning-DO NOT talk to anyone at the airport offering discount tour tickets, tours of other hotels for future trips, etc. They are total scam artists and are trying to sell time shares. We had four hours of our vacation time ruined by these jerks. I would recommend this hotel to anyone and plan to go back. The all inclusive is a great deal.", "title": "sunchasers in heaven", "helpfulness": 8, "user": "SunchasersinHeaven", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10419975, "likes": {"liked": "— Everything", "disliked": "— not a thing wrong with this place"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We stayed at Dreams October 21st to 26th. We were traveling with 4 children ages 14, 11, 9 and 6. We all had a great time! Upon arrival we upgraded to two rooms in the tower for an extra 50.00 a day per room, for us this was great! We loved the privacy and beautiful ocean", "title": "great family vacation!", "helpfulness": 11, "user": "Kristen8", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10424263, "likes": {"liked": "— beautifl views", "disliked": "— small main pool"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "views! There are only 5 rooms per floor here and we were in two so it was quiet. They had breakfast in the tower lobby which I appreciated when we wanted coffee in the morning while the kids were still sleeping.", "title": "Peaceful family vacation", "helpfulness": 12, "user": "pompoco", "date": "October 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10402551, "likes": {"liked": "— Ocean front room #4229", "disliked": "— Building noise of the room #4131"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The kids swam with the dolphins and thought this was the best part of the trip! They were in the water for a good 45 minutes and really were able to interact and play with the dolphins. cost was 149.00 each. The photographer took some great photos. We bought the cd with all of the photos and 3 dvds for 350.00 (split between 3 families)", "title": "Great all-inclusive resort for couples or families", "helpfulness": 12, "user": "Tulsan", "date": "October 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10363882, "likes": {"liked": "— Location, views and service", "disliked": "— Lack of Mexican food"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The beaches are great for kids and adults. The water is shallow for quite a ways out so it is easy for even the 6 year old to play in the", "title": "Fantastic beach and water- But, not much else", "helpfulness": 4, "user": "kid327", "date": "October 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 10335184, "likes": {"liked": "— leaving", "disliked": "— poor staff"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Room: Stayed 5 days in the junior jacuzzi suite. It was kept clean and had a beautiful, amazing, perfect view of the ocean. At night we opened the doors to the patio and listened to the ocean crashing on the rocks. Bliss!", "title": "Relaxing paradise", "helpfulness": 9, "user": "tickie2", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7391360}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We were a little disappointed with the bathroom: the tub did not drain properly so we ended up standing in 5 inches of dirty water when showering. There is no ventilation in the bathroom, and by the end of the trip it did start to get kindof a humid, musty smell.", "title": "Absolutely loved Dreams!", "helpfulness": 11, "user": "Marg_and_Mary", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7390746, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Mu husband was disappointed that there was no wireless available in the room; you are required to go to the lobby to use the internet.", "title": "We Loved Dreams!", "helpfulness": 8, "user": "bigs4", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7381937, "likes": {"liked": "— Incredible Staff", "disliked": "— Maritur= Rip off!"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Staff: Staff were attentive and helpful. Service on the beach and at the bar was great; we got new drinks before having to ask. If you tip a couple bucks once in a while, they'll be sure to keep your drink glass full.", "title": "Eh, it was alright!", "user": "MDperuta", "date": "April 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7380439, "likes": {"liked": "— The Spa was great.. Very relaxing. The service was great. The facility was clean and above all tranquil.", "disliked": "— The overall ambience left alot to be desired."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Beach: There were two beach areas to choose from, on 2 different sides of the hotel. It pretty much worked out that if one beach was having some rough seas, the other one would be very calm. There was lots of seaweed; the staff tried to keep up with raking it up but had little success.", "title": "Hotel Great, but POLICY SUCKS", "helpfulness": 8, "user": "skyprincess1004", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7380154, "likes": {"liked": "— Great Location and Food variety", "disliked": "— Hotel Policy and Pool"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "This place was absolutely amazing!! When I checked in, I was upgraded from a “Deluxe Ocean Front Room” to the Tower where I was told I'd have more privacy. Didn't ask for it but wasn't about to turn it down. They placed me on the 9th floor where there were only 4 or 5 other rooms. Talk about private – I never saw anyone on my floor.", "title": "Holy lap of luxury, Batman!!", "helpfulness": 9, "user": "shel3364", "date": "November 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10859764, "likes": {"liked": "— Location - ocean on three sides of resord", "disliked": "— Can't think of anything"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The view from the balcony was spectacular: ocean to the left, ocean in front, the Riviera to the right, the wedding gazebo and beach below (never bothered to look up, sorry). I fell asleep every night with the air off and the balcony door open listening to the sound of the ocean. The rooms were gorgeous and very clean. As with any other large resort, sometimes the clean up and turndown service was later than some might prefer, but since I don't get these services at home I really couldn't complain about the timing. The beaches were immaculate and the pools looked beautiful, although I never actually jumped in one. You can almost blow a whole day just gawking at the dolphins.", "title": "Not all-inclusive & way too small", "helpfulness": 4, "user": "Jpjb621", "date": "November 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 10816828, "likes": {"liked": "— The dolphin area & breakfast at World Cafe", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The food was delicious. Don't be afraid to tear yourself away from the buffet and try the smaller portioned Oceana (seafood) or Himitsu (Asian). If you go early in the evening they may be full, but go to a bar, get a drink, relax and go back later. You’ll find that it was worth the wait. Oceana even cooked up the Grouper and Mahi-Mahi that we caught on a deep-sea fishing expedition. (I won’t go into that – if any of you have done it, you'll know what happened over the edge of the boat.)", "title": "Wow! What an awesome trip!", "helpfulness": 12, "user": "EMHFamily", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10780379, "likes": {"liked": "— Dolphin View room", "disliked": "— They were doing construction at the time of our stay - it was a little loud"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "My only complaint had less to do with the resort and more to do with Orbitz & GrayLine. I heard rumors of an on-site Orbitz rep, but I think he was a phantom – always having “just left” and scheduled to return four hours later. The concierge bailed me out more than once by calling the main office.", "title": "Awesome time at Dreams!", "helpfulness": 12, "user": "Mommmy", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10774984}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "If you go to Cancun, don’t waste all your time getting smashed – you can do that at home for a lot less money:", "title": "Not that dreamy", "helpfulness": 11, "user": "sunny_person1", "date": "November 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10636135, "likes": {"liked": "— Food", "disliked": "— Need more hot tubs, better pools, widen the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "My husband and I just returned from a five night stay at Dreams, and had a wonderful time! (We are late 20's and early 30's) The nightlife is not wild and crazy, but we had a blast. It is just a short walk to several fun bars and shopping.", "title": "Paradise!!!!!", "helpfulness": 6, "user": "vann", "date": "May 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7540566, "likes": {"liked": "— The resort itself is beautiful and the great friendly service!!", "disliked": "— The beaches were a little small"}}, {"rating": 4.0, "title": "Lots of fun!", "text": "The Hotel itself is absolutely beautiful and very well kept. Our room was very clean and always stocked well. They even had dolphins in the lagoon! The restaurants were all great and had great service.", "helpfulness": 8, "user": "Dreamsin", "date": "May 1, 2007", "id": 7490177}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "The staff at the resort are amazing, and work very hard. The bartenders at the Baracuda and the swim up bar were so much fun and charming. They can make some great drinks and they keep them coming, and they serve Bud Light!! Thumbs up to Miguel, Lino and Roger you guys were great fun!!", "title": "SECOND TIME and can't wait for the THIRD", "helpfulness": 14, "user": "carkahlua", "date": "May 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7489392, "likes": {"liked": "— Surrounded by Water", "disliked": "— Liked it all"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I cannot say enough good things about are stay! It was truly an awesome vacation. If you choose Dreams you will not be disappointed!", "title": "A Good Choice for Relaxation and Indulgence", "helpfulness": 16, "user": "Prof9000", "date": "April 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7480477, "likes": {"liked": "— Location", "disliked": "— White concrete is ugly. They should paint the hotel Aztc style"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My wife and I stayed at the Dreams resort with two other couples for a week. We're all in our mid-thirties. Below is a summary of the good and not so good.", "title": "Not bad for Cancun", "helpfulness": 7, "user": "Luv_Labradors", "date": "April 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7477225, "likes": {"liked": "— The sun; the view of the Caribbean"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 196, "average": 406, "very good": 990, "terrible": 180, "excellent": 1765}, "aka": "Dreams Cancun", "slim_ranking": 0.260115606936, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The sophisticated readers of Condé Nast Traveler magazine named Dreams Cancun one of the Top Ten Resorts in Mexico. Travel industry publication TravelAge West also honored Dreams Cancun with its prestigious Wave Award, naming it Best All-Inclusive Resort, Mexico. Rave reviews plus Unlimited-Luxury® — both excellent indications that things are very special here.Cancun is a friendly and bustling city voted as the #9 Best Destination in the Caribbean and Mexico for the TripAdvisor Traveler's Choice Awards. Yet within our lush 7.1 oceanfront acres, you will be serenely tucked away. One reason is our one-of-a-kind location. Here at the most eastern tip of Mexico, you are surrounded on three sides by the beauty of the azure Caribbean Sea — the only resort in Cancun with this remarkable location."}