{"user_rating": 3.5, "review_count": 1010, "name": "Dream New York", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Spent the last 3 days at the Dream in NYC. The rooms were fairly small in size but housekeeping kept them clean. The staff were good but not really engaged in their jobs, I found them to be a little negative so not sure what that is all about. The location of this hotel is very good and you have access to everything within walking distance. One of the nicest parts of the hotel is the bar at the top of the hotel - here the atmosphere was wonderful and the waiters and waitresses were fabulous. They worked very hard to ensure you were happy.", "title": "Good location - needs a make over!", "user": "tpal", "date": "October 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 179612783}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I found the hotel to be a little tired and in need of some updates especially the elevator - I think it was possessed...never seemed to work properly and some waits were very long.", "title": "You pay for the location but it's worth it", "user": "happytraveler1979", "date": "October 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 179532008}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Overall, I would be good to go back but no longer then a few days.", "title": "Great hotel in NYC - a little bit noise", "user": "Gilad2013", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 179399011}, {"rating": 1.0, "stay_parameters": "Stayed September 2013", "text": "You can't beat the location in New York. We arrived way late thanks to a delayed flight and the only room they had left were the 'upgraded' rooms. The night clerk was really nice about it and told us that if we wanted to move the next day that we could. The room was under their night club. They sent us some ear plugs but honestly, after walking all day, we slept pretty well. We ate at their restaurant the day we left for brunch and it was fine.Seriously, it's the location that you have to have.", "title": "Worst Hotel you can stay in NY", "helpfulness": 1, "user": "MichelMan", "date": "September 29, 2013", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 179024500}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "we spent our last 4 days in NYC in dream hotel which was recommended to us by another couple. we loved the hotel location 55th street and Broadway avenue. the hotel rooms are very nice and everything is like it should be. king size bed, large screen TV, a/c , bath. the Wi-Fi costs a little extra if you want. or you can go down stairs to the lobby and have it for free.", "title": "Better properties available at this price point", "user": "SethE56", "date": "September 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 178998722}, {"rating": 3.0, "title": "I did sleep good, but pretentious as heck (and without the right to be)", "text": "So yeah, as others have commented, this place is pretentious as all get out. And really without warrant. Bad art + tacky, cheap minimalist furniture does not make a hotel edgy.", "user": "Gemutlichkeit", "date": "October 8, 2013", "id": 180277100}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "Pros:", "title": "Nice but pretentious", "user": "truetravelbug", "date": "October 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 180177563}, {"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "* Bed was quite comfortable", "title": "Hotel Want to Be Cool but Doesn't cut it.", "helpfulness": 1, "user": "OutToLunchAgain", "date": "October 7, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 180120921}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "* Bathroom was shockingly spacious (almost 2/3 the size of the sleeping area)", "title": "3 star hotel, book for location not for the room", "user": "Lmr05006", "date": "October 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 180087225}, {"rating": 3.0, "title": "Too busy", "text": "* Windows open, which is good for de-fogging the bathroom, since there isn't a fan", "user": "Donnelbr313", "date": "October 4, 2013", "id": 179755369}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I guess that's all you can really expect from Manhattan hotels very very small. I did enjoy the lobby area with the big fish tank in the center. I also loved the location how centralized it is to everything.", "title": "Nice Lobby Small Rooms", "user": "Frank B", "date": "September 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 176277101}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I stayed there twice this year and really like the hotel - great location, walk to Letterman, Times Square and tons of attractions. Once I stayed in a regular room and once a suite. The suite had 2 bathrooms, although one quite small and a big sectional couch, great space to have a drink before going out, etc. Great rooftop bar, nice restaurant on the lobby level. Surprisingly quiet although in NY you always hear the honking horns, can't really avoid it! The concierge was awesome and all the staff was class without the stuffiness of some nice hotels in the city. The bistro across the street (Cognac I think it is called ) is awesome for breakfast or lunch.", "title": "get a suite if you can", "user": "travellingcanucks12", "date": "September 7, 2013", "detail_rating": {"location": 5.0}, "id": 176197574}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The other Dream NYC is good too, very hip!", "title": "Great location and great staff!!!", "user": "epace95", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 175982325}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Perfect for long weekend getaway. Great location and very short walk from both central park and Columbus circle. The staff is very helpful and friendly. Room was small and in need of a refresh but bed was very comfortable. Hotel is currently covered is scaffolding and construction noise in early morning. Rooftop Ava lounge was fantastic!!", "title": "Not as Dream-y as I expected", "user": "Brooklyn_SS", "date": "September 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 175813090}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I booked this hotel for one night as I needed to extend my stay in New York at the very last minute. Via a \"reduced\" deal on the Hotel Tonight app I chose Dream because of proximity to the hotel I was currently stayed at (which was booked up and hence the need for a hotel switch). The lobby is pretty impressive and the front desk support friendly.", "title": "My favourite hotel in NYC", "helpfulness": 1, "user": "Shruggy", "date": "September 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175725584}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "This hotel from the outside has art deco appeal. However, it is not what is expected on the inside. First, it is not for the business traveler. It has no business center and no space for a business person to work, meet or conduct business. It is strictly leisure. The rooms are contemporary with a tasteful flair. The bathroom has no air fan or proper ventilation so it will have the mildew smell. The restaurant was directly when you check in, open, where a lobby lounging area would be. The breakfast was very good and the nightlife on the top floor was the best of the hotel. It was very good. So I give this hotel good but could have been better with a few changes, but I really did have high expectations when I got there.", "title": "Convenient Location", "user": "mjoytravel", "date": "September 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178933091}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Terrific! Fun... go see the sunset... The tomato basil martini is amazing... Enjoy... Great for guests!....................................................................................................................................", "title": "Ava Lounge on Dream roof top", "user": "nealhurwitz", "date": "September 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 177964275}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I stay here when I am traveling for business, the stay is always short, but it is nice and comfortable. I like the bedding and it is always clean there. The service is always nice at the front desk. The hotel is in mid-town and is a few blocks away from Penn station, you can either cab or take the subway and it is near Columbus Circle. It's a not bad of an area, but if you wanted to go to Time Square if you want to walk its about 11 blocks.", "title": "Short stay, but nice", "helpfulness": 2, "user": "SunWils", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 177522817}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The location of the hotel was great! Unfortunately that was the only thing about the hotel that was. The lifts in the hotel were the slowest lifts I've ever been on. Having to wait at least five minutes each time we wanted to get up to our room. They also did not have a separate lift for cleaners and hotel staff so you would often have to wait for another lift. We requested a quite room away from the lifts as we read they were very noisy at night. We didn't heard the lifts but we we did hear doors slamming all night. The bed wasn't great - in fact the sheets didn't fit and you'd wake up sleeping on the mattress. The blue LED light made the room look cheap. The hotel also has a roof top club which on many of the nights we were there they closed one of the two lifts they had just for people to get up to the roof top and hotel guest weren't given any priority. The service we received from staff at the hotel was poor excluding the concierge. WIFI is $9.99 for 24 hours but would often drop out and ask you to pay again. The room was not worth what we paid per night.", "title": "Great Location - Poor Hotel", "user": "Joel R", "date": "September 15, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 177208496}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Stayed here for 3 nights. Ignore the bad reviews. Hotel is lovely rooms are not small (have stayed in smaller in manhattan).", "title": "Great location, lovely staff, nice hotel", "user": "MrsD1981", "date": "September 9, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 176513672}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 109, "average": 203, "very good": 399, "terrible": 98, "excellent": 201}, "aka": "Dream New York Hotel", "slim_ranking": 0.722347629797, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "A haute couture hotel created via the vision of hotel entrepreneur Vikram Chatwal. Dream's luxuriously appointed guest rooms are whimsically modern and adorned with the latest in technological delights."}