{"user_rating": 4.5, "review_count": 43, "name": "Druimnacroish", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I stayed in the self-catering apartment very shortly after it was refurbished, in fact, the owners told me and my family that we were only the second party to have stayed there. And what a stay it was! When we decided that we would, for the first time, spend our summer holiday in the Isle of Mull, we feared that the suspiciously inexpensive 'small hotel' we had chosen would be just that: small, not to mention dingy, especially as it was literally the last remaining unbooked accommadation on the island!", "title": "What all small country hotels should be like", "user": "KangarooRoute", "date": "February 3, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24171994, "likes": {"liked": "— The homely feel of the place", "disliked": "— I can't think of anything, though the front desk could have been better, I suppose"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "What a pleasent surprise we were in for when we stepped into a wonderful flat, complete with wi-fi, comfortable new beds and furniture and sky TV. It was so nice, that I felt amazed that people were prepared to pay twice as much for a stay in a Holiday Inn in London, when Druimnacroish's self-catering flat was arguably better than some of the high-end flats in South London, where I live.", "title": "Druimnacroish is lovely!", "user": "SGormley", "date": "February 2, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 24098987, "likes": {"liked": "— location, food, good hosts", "disliked": "— nothing I didn't like"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "To conclude, I would recommend Druimnacroish to anyone visiting the Isle of Mull, and the amazing views of the surrounding glen, and the place's true country feeling made this stay more than worthwhile, even if it was seemingly in the middle of nowhere on an incredibly beautiful island.", "title": "A Warm and welcoming house", "user": "Norarua", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12582040, "likes": {"liked": "— Comfort of house, food, welcoming attitude of hosts.", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We visited Druimnacroish last April and it was lovely. We biked from the ferry in the rain but were given a warm welcome from Neil. The setting is absolutely stunning - a beautiful valley that has a little town about 2 miles away. We stayed in the large room upstairs and were very comfortable. Marvellous breakfast and we are returning this year to try out the evening meals. Very relaxing place - it is a great place to unwind! I would highly recommend this place.", "title": "Wonderfull, warm and welcoming", "helpfulness": 2, "user": "familywholikehotels", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10037050, "likes": {"liked": "— Everything", "disliked": "— We only stayed for a weekend, would like more time !"}}, {"rating": 5.0, "title": "Fantastic value", "text": "Having come from a very cold and unsatisfactory hotel elsewhere in the Highlands, we just loved Druimnacroish. We felt welcomed from the word go, as we were offered tea and shortbread on arrival. All food was excellent and home made and we loved the atmosphere - all those books around the place and the blazing wood fire every evening in the large sittingroom-just the place to chill out and read. The conservatory with all its plants and wonderful views would be just the place to sit on a summer evening, so we will have to go back some day. Our bedroom was large and comfortable too. Our hosts took the time to tell us about some of the history of the area. We had a really nice and relaxing few days.", "helpfulness": 2, "user": "ek0k", "date": "September 14, 2007", "id": 8711818}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We loved Druimnacroish and will certainly go back next time we make it to Mull. I've read the two reviews and I think the person who was scared of spiderwebs and limited menus really should stick to Holiday Inns in cities. This is a country house (hence the name) and if you don't like remote, well, what are doing on Mull anyway? It's a beautiful but intoxicatingly dizzy drive (at least late in the day with the sun low) from Tobermory on a winding island road. This corner of Mull is gorgeous hilly moorland. Druimnacroish itself is clean and bright, with a great conservatory dining room, a well-stocked library AND a lounge with well-stocked mini-bar (both proofs to me of a civilized and welcoming inn!); our room was large, comfortable, and very nicely furnished. We are only sorry that we didn't stay longer; next time we visit it will be for a few nights at least.", "title": "remote, restful, romantic", "helpfulness": 1, "user": "riach", "date": "August 22, 2007", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8473070, "likes": {"liked": "— peace and quiet, country location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Druimnacroish is a very pleasant, small and friendly hotel. It caters mainly to adults but they did their best to make my 6 year old daughter feel comfortable. It is situated along a quiet road, up a valley from the West coast of the island. The surroundings are quiet and restful, rolling hills upon which innumerable, and sometimes suicidal, sheep run free. The rooms are large and bright, almost Scandinavian in feel. As far as dining is concerned, the food is excellent. While the evening dinner menu is not extensive it is of a high order, focusing on quality local produce. In short, Druimnacroish is a lovely base for exploring Mull.", "title": "Very Pleasant", "user": "Busby09", "date": "January 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6686918}, {"rating": 1.0, "title": "Dissapointed", "text": "The exterior and gardens can only be described as looking like a run down farmhouse. Cobwebs around the front door. The rooms were dark and dingy and furnished with mis-matched second-hand furniture. The public rooms didn't provide comfortable seating nor did the conservatory.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5465367}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 12, "terrible": 1, "excellent": 30}, "aka": "Druimnacroish Dervaig, Isle Of Mull, Scotland", "slim_ranking": 0.2, "description": "Laid back, friendly, spacious, family-run holiday accommodation in a peaceful rural location and with great views from every guest room."}