{"user_rating": 4.5, "review_count": 136, "name": "Duchamp Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I spent two nights at Duchamp this past August and thoroughly enjoyed the hotel. I stayed in cottage no. 3, which was outfitted starkly in modern furniture with a lot of white, gray and stainless steel. The room itself was very spacious and all of the appointments were very nice: king-sized bed, flat-screen tv, high-quality linens. The best part of the room was the bathroom, which was enormous, including a large (open) walk-in shower with multiple shower heads.", "title": "The most wonderful little hotel in Healdsburg", "helpfulness": 2, "user": "ChiTown06", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8615144, "likes": {"liked": "— Unique, modern comfort; privacy and comfort."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The overall property is along the same theme: modern, spare, but lovely. The landscaping is well-maintained, and everything was very clean.", "title": "Fabulous 'hip' and modern hotel in Napa", "helpfulness": 2, "user": "travelproPasadena_CA", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8375658, "likes": {"liked": "— great concept and very pleasurable experience"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Breakfast, set up in the common area of the hotel, was very good: juice, coffee, fresh fruit and very good pastries. (I think that the pastries were from one of the more famous local bakeries, but at any rate they were delicious!)", "title": "\"Great Spot for Relaxation and Romance\"", "helpfulness": 1, "user": "astravels", "date": "July 29, 2007", "detail_rating": {"business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8254158}, {"rating": 5.0, "title": "Best Choice in Northern Sonoma", "text": "The hotel is designed to provide a good amount of privacy and quiet to the visitors, and this was a welcome change from the other little hotels and B&B's in the area. The staff was welcoming and helpful without hovering. They showed a great attention to detail. For example, one couple relaxing at the pool one afternoon was on their honeymoon. Sid, the manager, poured champagne for them and the rest of us who were enjoying the sun. It should be noted that there are certain times of day when there is no one present in the front office, but this is was no problem.", "user": "GeorgiaVinoPhile", "date": "July 9, 2007", "id": 8085612}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I have only very minor complaints about Duchamp. One is that the gates in front of the individual cottages are linked on one fence, and all rattle loudly when any gate is opened or closed. This startled me when I was in the shower, made me think that someone was coming in my room, but once I figured out what it was, it was fine. Another minor quibble involved the temperature in the room - the AC was slightly ineffectual - and the in-room fridge, which barely kept wine and beer cool.", "title": "Pure Relaxation", "user": "pvbtpc", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8056314, "likes": {"liked": "— Location and room quality"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My wife and I stayed at this hotel for a romantic weekend. There are only six bungalow suites, free standing, which makes for a very private getaway. The design is simple, modern, and artistic with unique sculptures carefully placed around the grounds. The hotel is private, yet downtown and very close to Cyrus, one of our favorite restaurants in the wine country. We are already looking forward to booking a weekend in early spring.", "title": "A very special place", "user": "Wine-Guy-5", "date": "November 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10736425, "likes": {"liked": "— The Detached Rooms", "disliked": "— Limited Services"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "It’s unfortunate that the service at the Duchamp Hotel ruined what otherwise could have been a pleasant stay. After my experience today, I would never recommend this hotel to anyone—I’ve never been treated so rudely by any hotel I’ve ever stayed at, ever.", "title": "Rude service is a blemish on an otherwise nice hotel", "helpfulness": 10, "user": "globalmusings", "date": "November 4, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 10601212, "likes": {"liked": "— Location", "disliked": "— Rude Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "During our two-night stay we were never greeted, welcomed, smiled at, or thanked by any hotel staff member (like other reviewers mentioned, staff leaves at 7pm so if you arrive later they left your key outside). We felt more like a bother than ($400/night) paying hotel guests, but initially shrugged off the attitude as the hotel’s attempt to maintain privacy. Our first negative experience was we received a phone call at 10:30am this morning where an abrupt staff member told us we needed to leave the room because it was past checkout time. We pointed out that we still had 30 minutes until the 11am checkout, to which the person replied, “oh” and then hung up without any apology or explanation.", "title": "Girls Getaway", "helpfulness": 2, "user": "ChicagoDawn", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10424407, "likes": {"liked": "— Cozy"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "But here’s the kicker: on checkout, the bill was higher than expected. I politely asked if the higher charge could be explained, since my confirmation letter contained a lower amount, and was flatly", "title": "Perfect birthday", "helpfulness": 2, "user": "alippa", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10007893, "likes": {"liked": "— Sid's thoughtfulness and attention to our needs, and of course the wine tour"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "told by Keith (who I can only describe as incredibly cold and horribly rude) that I was wrong. I furnished my confirmation letter with the lower amount, which he would not even glance at, and again was told that the system could not be wrong, and that that I would have to pay the extra amount and work it out with management later. At that point I asked to speak to the manager myself. Keith called the manager, and preceded to tell him (Peter Selz) in front of me,", "title": "Perfect for relaxation - loved the Duchamp!", "helpfulness": 2, "user": "KnitWit325", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8662349, "likes": {"liked": "— The service!", "disliked": "— Internet connection sketchy (but I didn't want him to work anyway)."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "As someone who has traveled a lot on business and pleasure, it is rare to run into a hotel that truly welcomes you and makes you feel at home. We have never stayed in a more, relaxing, comfortable place Here, the simplicity of the hotel (its modern design, in particular), the surroundings and the service, only contribute to the sense of serenity you achiever shortly after arriving. Since each \"room\" is a standalone bungalow, you are assured of a quiet, noise free evening. Because there are only six bungalows, you never feel crowded or uncomfortable. The open air garden and pool are perfect, with towels already laid out each day at each lounge chair. The simple, included breakfast offering, which you can eat in the lobby or bring a tray back to your room, includes fresh pastries, fruit, yogurt, juices, coffee, tea and newspapers. The ambiance encourages you to relax, s we spent several hours by the pool and in it on each of our three afternoons. The hotel is only one block off the main square, right behind the $750 per night Le Mars hotel (give me a break), so it is easy to walk all around the main area of Healdsburg. Definitely going back.", "title": "Worth every penny!", "helpfulness": 3, "user": "sccarlin", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18273951, "likes": {"liked": "— simplicity, quiet, size, comfort", "disliked": "— location in alley behind other hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Marcel Duchamp saw beauty in things that needed no further embellishment, and created the \"minimalist\" art form. That certainly was the inspiration for the Duchamp Hotel, and they pay him homage with six sparely decorated but somehow warm and comforting rooms. We thoroughly enjoyed our four night stay in this Healdsburg hideaway (but just steps from the Michelin 2-star rated Cyrus restaurant). The rotating front desk staff (Michael, Dottie, and Sid) were all extremely helpful in making advance restarant reservations, and recommending local and nearby attractions. Breakfast (cereal with great selection of fresh fruit, pastries, yogurt, juice and coffee) by the pool is a great start to the day. Savoring a glass of your daily \"find\" is the appropriate way to end your day in wine country. I highly recommend Duchamp as a private hideaway in Healdsburg.", "title": "Hip Hotel in Healdsburg", "helpfulness": 2, "user": "navygoat", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17648902, "likes": {"liked": "— A feeling we were in a friends private guest house"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "We found the duchamp to be a perfect spot, a block from the centre of healdsburg but when you are in the grounds by the pool you feel you could be a long way away, granted there are no vine views but it really was a secluded and quiet spot. The staff were wonderfully helpful especially as we were travelling with our 2 mth old daugher - they reserved for us the most distant of the bungalows so we have privacy - and many places in town are not so welcoming to children. Indeed officially the duchamp is adults only but they make exceptions for tiny ones who wont be running around the pool etc. The breakfasts were great and the flexibility of having them on your patio was perfect. This is not a high service place, its a laid back little community and we enjoyed it for that.", "title": "Great lowkey hideaway spot", "user": "hoteljunky", "date": "June 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 17054750, "likes": {"liked": "— Huge rooms and lovely pool", "disliked": "— No bath tub!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Duchamp is great, we stayed there for 4 nights, the first night we were the only guests, and then it filled up a bit over the weekend. The staff is only around for a few hours a day, but they were extremely helpful with directions and any other questions we had. It is such a small property, we did not miss a full time desk person in the slightest since they are around when you need them. The rooms are great, spacious with huge bathrooms. Everything was perfectly clean. Breakfast was good, the pool is a good size and the hot tub was always nice and steamy. The last time I was in town I stayed at the Hotel Healdsburg, and although I liked that property, I much prefer the smaller size and more intimate feel of the Duchamp. Even when it is full of other guests it is easy to feel like you are the only people there. I would absolutely stay here again.", "title": "Great wine country spot", "user": "jgodic", "date": "May 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15751352}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We had a wonderful time at Duchamp hotel. Actually, we were looking for very special place to stay cause our 1-day stay was a part of our honeymoon trip. We arrived there around 5 o'clock, however Mr. Sid kindly called us to tell how to get to the duchamp hotel in detail before we arrived. Also, he shared a long time with us to give tips and informations about gourmet restaurants and excellent wineries around Healdsburg very kindly. Try Duchamp's jacuzzi if you have a chance to stay there on early spring. It's amazing experience ever - My wife loves it so much. The breakfast is very delicious and the dining room is modern, simple and clean. We love Duchamp hotel.", "title": "nice place with warm invitation", "user": "fiestajun", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14858511, "likes": {"liked": "— jaccuzi, fireplace", "disliked": "— none"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The Hotel Duchamp is a perfect destination hotel for those seeking relaxation with a more European feel. The hotel is extremely comfortable and SUPER CHIC!", "title": "Perfection", "helpfulness": 1, "user": "seabisc", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7714191, "likes": {"liked": "— Hotel Design", "disliked": "— It was perfect"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "From the moment we arrived we were greeted by the property manager and escorted to our room and later given a special tour of the Duchamp winery by Peter Lenz.", "title": "Nice stay at Duchap", "helpfulness": 5, "user": "jmfangio", "date": "April 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7301795}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I would highly recommend this hotel to anyone looking to see/ experience Dry Creek Valley/ Russian River Valley in a different light.", "title": "A wonderful stay at the Duchamp", "helpfulness": 1, "user": "J_Steven", "date": "March 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7148751, "likes": {"liked": "— Wonderful service, uncluttered contemporary design"}}, {"rating": 5.0, "title": "Delicious Duchamp", "text": "We recently returned from a stay at Duchamp.", "helpfulness": 4, "user": "mcav", "date": "February 18, 2007", "id": 6809147}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Overall we had an excellent experience.", "title": "Nicely Done", "helpfulness": 1, "user": "Caring_Bear", "date": "November 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6270088, "likes": {"liked": "— Great locale", "disliked": "— Have the staff plan winery visits for you in advance"}}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 3, "very good": 21, "terrible": 4, "excellent": 105}, "slim_ranking": 0.25, "description": "Boutique hotel in Healdsburg, separate cottages, pool, Free WiFi, Free Parking, near plaza."}