{"user_rating": 3.5, "review_count": 244, "name": "Dunchurch Park", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We had our wedding at the Dunchurch Park in OCtober 2005 at it was the best day of my life. The venue is fantastic we had our civil ceremony, wedding breakfast and evening do/disco all in the Great Hall, which is a beautiful room with windows overlooking the gardens and huge ceilings. We were impressed with the speed and ease with which the hotel staff turned the room around, and there are plenty of nice places near the room for our guests to mingle, as well as gorgeous, well kept grounds overlooking a large pond. Lots of nice photo spots and the old building is wonderful. The staff were fantastic on the day especially the Master of ceremonies Tony, who was there from start to finish and the wedding co-ordinator Denise. The food was really nice and they were fine about catering for vegetarians and other dietary requirements. The rooms were very clean - everything was spot on. The staff made sure we did not need to worry about a thing on the day- I would recommend this hotel to anyone looking for a wedding venue, but book early because we had to book a year and advance. I would also recommend it for anyone wanting a nice meal in lovely surroundings. We will be going back for our anniversay!!", "title": "Fantastic wedding at the Dunchurch Park", "helpfulness": 9, "user": "sparkleyloo", "date": "January 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4385013}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Arrived at the Dunchurch Park and very impressed with the main reception building. Was a bit concerned at the outside of the building that we were directed to for our accommodation as it looked like a hospital building! Room was lovely - newly decortated and had everything you needed. Bathroom was also clean with powerful shower.", "title": "Very Comfortable", "helpfulness": 4, "user": "Malts", "date": "May 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3451751}, {"rating": 4.0, "title": "Very Good Value", "text": "Breakfast was good - a lot of variety.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 11, 2005", "id": 3350915}, {"rating": 5.0, "title": "Function Rooms", "text": "Appears a lot of coach companies use this hotel and the breakfast room was full of large parties so we were moved into a smaller room and had to walk from room to room to collect our breakfast.", "helpfulness": 1, "user": "MartonJayne", "date": "December 7, 2004", "id": 2867112}, {"rating": 5.0, "title": "Nice place!", "text": "Staff were friendly and polite.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 26, 2004", "id": 2847967}, {"rating": 2.0, "title": "Mediocre hotel in a great setting", "text": "The setting might lead you to believe that you have found a true country-house gem. You haven't. Its gardens are lovely, but the hotel itself is slightly shabby and stale. Never stay here at the weekend. The hotel is used for weddings and you will not get a good night's sleep. We were woken repeatedly by shrieking children chasing down the corridors, doors slamming and guests who seemed to have no notion that anyone might be trying to sleep at 2 am.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 13, 2004", "id": 2526486}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Stayed here 2 nights for a family wedding. Unfortunately it was during the July Monsoon floods we experienced and has, I'm sure, tainted my views!", "title": "Just ok", "user": "caitni2000", "date": "August 24, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 8492111}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "Firstly the venue is like a converted big old mansion with reception stuck on in the 1980's. Its is quite a walk from the reception and entrance down to the bars, restaurant and function room - very easy to get lost in a maze of corridoors. The reception room itself is amazing for a wedding. Very grand with high ceilings and windows. Big down side is, there is no bar, so guests have a lot of trekking to do to go out for drinks and the wedding party soon got totally split with drinkers and dancers.", "title": "Fantastic Wedding", "user": "gorleyhobbit", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7871913}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Before dinner we had drinks in a grand hallway which was very nice, and i'm sure had it not been teaming down outside we would have enjoyed them in the beautiful grounds.", "title": "Fantastic wedding venue", "user": "sjj69", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7832516, "likes": {"liked": "— The Price", "disliked": "— n/a"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Hotel rooms were in a completly seperate buliding - very small and simple, but a torture to get to and a maze to find your room. Very badly organised.", "title": "nice setting, shame about the rooms!", "user": "AngelaJJJ", "date": "July 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5473437}, {"rating": 2.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "The compare as such for the wedding was a fun and lovely little man. The rest of the staff had very little English, were rude, slow and overall incompetant.", "title": "Not sure what the main focus of this place is...", "helpfulness": 3, "user": "Riflerangeblues", "date": "May 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 5185606}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 30, "average": 55, "very good": 44, "terrible": 21, "excellent": 94}, "aka": "Dunchurch Park Hotel Dunchurch", "slim_ranking": 0.5, "description": "Dunchurch Park Hotel is a 19th-century Grade ll listed manor house, set in 72 acres of beautiful grounds and landscaped gardens. We are the ideal venue for conferences, meetings, weddings and special events. The hotel comprises 89 en-suite bedrooms in a custom-built wing and boasts 32 conference rooms. Situated in the heart of Warwickshire, the hotel is conveniently situated close to the M1, M6 and M45 motorways. Bar 1823 is our contemporary bar with plasma screen and Sky TV. Housed in the main manor house it serves an excellent selection of hot and cold drinks plus a wide range of beers and wines. Also in Bar 1823 you will find a range of meals with a variety of specials and great deals. Dunchurch Park is now offering golf at the renowned Rugby Golf Club!!!!"}