{"user_rating": 4.0, "review_count": 325, "name": "Dundrum House Hotel, Golf and Leisure Resort", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "We booked an apartment for the August bank holiday weekend for an event we were attending.", "title": "Tries to be something its not!", "helpfulness": 1, "user": "RoryMc", "date": "September 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20376059, "likes": {"liked": "— The apartments are lovely", "disliked": "— Hotel is a little run down and tries to be pretentious"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The best thing about the hotel was the apartments, which were clean, modern and very spacious,with lovely bathroom and living area.", "title": "Great Wedding Spot", "user": "Millzner", "date": "September 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20149285, "likes": {"liked": "— Lots to do- Golf, nearby attractions, several bars, pool, and gym", "disliked": "— Tiny towels"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "My overall feeling about the hotel is that it tries to be pretentious, but fails to be so. It isnt very well run...we had problems with our reservation and had originally booked a 3 bed apartment, which turned out not to exist!. We were, however, given two 2 bed apartments and 3 bottles of wine as goodwill!.", "title": "One of the worst hotels I have ever stayed in", "helpfulness": 1, "user": "DGMGalway", "date": "September 2, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 19635978, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The hotel is quite run-down and could do with a good over haul, which would make it 4 star, as the location is very pretty.", "title": "Wonderful", "helpfulness": 1, "user": "ryleeEngland", "date": "August 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 19290667, "likes": {"liked": "— Modern, clean, spacious"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Stayed here two nights for a wedding. Setting is beautiful. Rooms have just been redone and are very attractive. The reception was perfect. The food was delicious and the staff were friendly and accomadating. Definately book thru the hotels website to get the best price.", "title": "Poor Rooms, Poor Service, Poor Hotel.", "user": "TheWexican", "date": "August 23, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 19273759, "likes": {"liked": "— The Grounds, Location", "disliked": "— How problems were dealt with, room decor"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "We stayed here recently when attending a wedding. I was very disappointed as I felt the place didn't live up to what was shown on the website. The food at the wedding reception was good and the grounds and the golf course were well maintained but the rooms were very disappointing. We had the special wedding rate of €140 for the room including breakfast. The bed was tiny the pillows lumpy and there was a lot of noise from the rooms overhead & from the corridor during the night. The breakfast room was a disaster with the food being served right inside the door which meant that you could hardly get in the door to find a table and the breakfast was only average. Some of our friends stayed at a nearby b&b which cost around €80 for the room and it was probably better value than what we paid for.", "title": "Overpriced", "user": "Limericklass", "date": "November 24, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 3.0, "value": 2.0, "rooms": 2.0}, "id": 6171927, "likes": {"liked": "— The grounds", "disliked": "— The bedroom"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I would not recommend Dundrum House unless the place gets a major refurbishment - it felt like the whole place had not been decorated since the 1980's.", "title": "What a dump - Fawlty Tower's sister hotel", "helpfulness": 2, "user": "Nodser", "date": "September 25, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5834367, "likes": {"liked": "— The way out", "disliked": "— It was dirty"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "We recently stayed at Dundrum House as part of a family holiday - 6 adults and 5 children.", "title": "One word Dirty", "helpfulness": 1, "user": "11811", "date": "September 17, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5810492}, {"rating": 1.0, "title": "Not impressed either time I stayed here", "text": "It was booked originally for a week but we only lasted two nights. 2 Adults had booked into the Hotel and on their first trip to the toilet the room nearly flooded. They then moved to another room in the Hotel which was best described as adequate. Myself and my wife and our two children along with the other couple and their 3 children stayed in the self-catering apartments. Very spacious and very dirty. (Lots of telly's though!!)", "helpfulness": 1, "user": "robbie1876", "date": "August 29, 2006", "id": 5718824}, {"rating": 2.0, "title": "Poor & expensive", "text": "We had booked the restarant for a meal on the 1st night made our way to the Bar for pre dinner drinks. The Bar was empty with broken glass over the floor. The bar was unattended and after about 5 mins we went looking for a member of staff. Once we found a member of staff she eventually made her way to the Bar to serve us. We ordered our drinks the ones they had in stock and mentioned the glass on the floor - which was swept up by the same girl after she had poured our drinks. We then went to the restaurant for our meal. We were greeted by the same member of staff who led us to our table and took our order. To cut a long story short the meal was crap the only member of staff (as above) disagreed and even tried the main course on the plate before trying to hand it back. All she was interested in was that we paid the bill. We left the restaurant and only went back to see how much money it would take to get us out of there. The golf course and leisure centre were great!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 12, 2006", "id": 5333149}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Just came back from a wedding at the Dundrum House. The wedding was great but the hotel needs major updating.", "title": "dont do it dont stay here", "helpfulness": 1, "user": "APower", "date": "May 27, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7704371, "likes": {"liked": "— nothing", "disliked": "— absolutely everything"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Where to start. Parking was a good walk from the reception. (thank God it wasnt raining) There were no signs for reception so had to drive around in circles to find which door it was. The receptionist was very rude. As if she couldnt be bothered with guests.", "title": "The bedrooms are horrific!", "user": "Irlande", "date": "May 21, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 7665043, "likes": {"liked": "— Very little!", "disliked": "— The bedrooms...."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Booked a double room which turned out to be two single beds pushed together with two single bed covers over each other. First time in ages i have been handed an actual key for the door of the room which took us ages to open. The furniture was grotty and used as for the bathroom well 1980s decor. It was also tiny.", "title": "I enjoyed my stay.", "user": "OzzieBen", "date": "May 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7644939}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I really dont kow how this place is staying open. In the morning we were woken to two young chamber maids banging on the door and walking in and saying \"oh your not gone yet\". This was at 10am i might add. Never again. Dont bother with breakfast, awful and cold. just dont stay there.", "title": "absolutely awful!!!", "helpfulness": 1, "user": "mimitastic", "date": "May 14, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 7615458, "likes": {"liked": "— nothing", "disliked": "— the dirt"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "i nearly forgot no bar in the main hotel . only in the golf bar which is like a barn!!", "title": "Very disappointed", "user": "nightaway", "date": "November 28, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 6185010, "likes": {"liked": "— Room size", "disliked": "— poor decor, facilities and unfriendly staff"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Think twice about booking here. The property is seriously run down. The rooms look like they were last redone in the 80's. Bed was saggy and bathroom shabby. Shower curtain was moldy. That is as long as we stayed. We checked in and checked out! We were told we got one of the best rooms!!!!Some decent bed and breakfasts in the area are worth a look. Food was awful as well. Be warned, this was rated as 4 star by Irish tourist board. Not so.... 1 at best.", "title": "Don't Bother!", "helpfulness": 1, "user": "betty98", "date": "June 4, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 16657174, "likes": {"liked": "— Could be a nice place if it was updated and cleaned", "disliked": "— Condition of accomodations"}}, {"rating": 5.0, "title": "Irish Charm Great Golf Course", "text": "I had read mixed reviews on Trip Advisor - However, the setting is beautiful, the golf course outstanding, the food was very good, staff were very friendly and the atmosphere in the bars was very enjoyable. We played 2 rounds of Golf and my friend who is a scratch golfer said it was one of the nicest courses he had ever played !! The Hotel is making improvements all the time to the facilities so some of the comments appear dated ! If you cant find the reception then that is being picky.....With all Rural Heritage hotels, go along be friendly and relax the staff will look after you, bring you a cup of tea or organise a sandwich, don't moan about no kettle in your room, enjoy a proper cup with real milk, Play some golf, have a swim and enjoy a few pints !! I would recommend the hotel to anyone and the ones who have been all loved the whole package of hotel, good food, Golf and Craic as the Irish would say....", "helpfulness": 1, "user": "Ieuan9", "date": "August 21, 2007", "id": 8464909}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Having recently stayed in this hotel at a wedding I felt I had to warn people about the rooms here as it is not cheap and the standards do not live up to the price expectations. I was very disappointed to find NO facilities to make tea in the rooms, a service which I have previously found in the smallest of b&bs in Ireland. I also felt the rooms and their furnishings could badly do with renovating and updating, some products other than the wall hung shower gel would not go amiss in the very dated bathroom. For anyone contemplating treating a partner to a romantic treat in Tipperary I could not say to come here ,however another local hotel Raheen House in Clonmel more than ticks all the boxes.Please check out my review for them.", "title": "disappointed", "user": "manningTipp", "date": "August 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 8380273, "likes": {"liked": "— meal served at the wedding was very good", "disliked": "— rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We had our wedding reception at Dundrum House Hotel in May this year. We found the whole experience to be excellent. From the beginning the staff were very helpful and friendly. Many of our guests stayed either in the hotel itself or in the new 4 star apartments on the hotel grounds. We heard very positive reports back from our guests about both. My husband and his family stayed in one of the new 2 bedroom apartments for a few days prior to the wedding. It proved to be a perfect place for their friends to call around to the days before the wedding and for a drinks party the night before the wedding. The food for the reception was fantastic, the room the reception was held in has been recently refurbished. The swimming pool and leisure facilities went down a treat. We really couldn't fault the hotel or any of the staff. We would definitely recommend Dundrum house to other couples planning a wedding and looking for a hotel in quiet, peaceful surroundings with lots of character and modern facilities.", "title": "Perfect", "helpfulness": 1, "user": "MaryRLondon", "date": "July 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8251858, "likes": {"liked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Superb weekend at Dundrum - my sixth visit here and I love the hotel!", "title": "Excellent!", "helpfulness": 1, "user": "HolidayStuart", "date": "June 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7827613, "likes": {"liked": "— Olde worlde Goergain as well as new in the coach house"}}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 1, "variance": {"poor": 37, "average": 34, "very good": 87, "terrible": 23, "excellent": 144}, "aka": "Dundrum House Hotel, Golf And Leisure Hotel Dundrum", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "This Georgian Manor House was built in 1730 for the bride of Lord Hawarden, the Earl of Montalt where ancient Irish chieftains, the O'Dwyers of Kilnamanagh once held the land. At the beginning of the century a religious order bought the property and in 1978, the Crowe family bought the house and adjoining lands that lay along the Multeen River.Located in the 'Golden Vale' this resort is located in the heart of Co Tipperary, 8 miles (13K) from Cashel Town, steeped in heritage, in one of the most picturesque settings. As you can imagine, this luxury country house hotel Tipperary is a wonderful country retreat, with old world charm and atmosphere. The Manor House was restored to it's former glory and the resort's ongoing property development provide, modern day comforts in a setting that retains the finest of the old. Absorb the history and beautiful antiques that adorn the manor bedrooms, drawing room, lounge and restaurant. This hotel seamlessly blends modern day living with modern bedrooms, health and leisure centre, wedding venue and spacious holiday homes, with old world charm."}