{"user_rating": 4.0, "review_count": 110, "name": "Dunham's Bay Resort", "reviews": [{"rating": 3.0, "title": "Fantastic View, but dumpy rooms.", "text": "When my wife and I arrived at the Dunham's bay my first thought was what a dump. We had a Lakeview cabin, but the room smelled and it needed to be totally gutted.", "user": "nycrunner5", "date": "September 1, 2008", "id": 19621076}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "There is an ok beach which is good for small children, but they do not own the beach, and you must cross a road, although that was not a problem.", "title": "Wanted to love it, but couldn't", "user": "rustymonkey2", "date": "August 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 19186240}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Breakfast was ok, but the dinners were pretty bad. To be fair, there does not seem like there are many places that are really nice with beach access in the entire Lake George Area.", "title": "Spectacular Wedding", "user": "Cricket0505", "date": "August 20, 2008", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 19179351}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "However, the location is convenient and the area of the hotel is very beautiful.", "title": "Loved everything about Dunham's Bay", "user": "bride808", "date": "August 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19058294, "likes": {"liked": "— The bed!!! It was extremely comfortable.", "disliked": "— how small the bathroom was."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The resort does have potential, and apparently the new owners are putting money into it.", "title": "Loved This Place!", "user": "hdr83", "date": "August 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19015708, "likes": {"liked": "— Location to Lake George; helpful and courteous; CLEAN"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "My wife and I spent a long weekend at Dunham's Bay in mid July. We had a wonderful time and the staff was amazingly friendly. The resort is on a quiet cove, and it's only a 5 minute drive from the downtown area. Great if you want access to the \"touristy\" parts of Lake George without having to deal with it 24/7. Prior to arriving, I called and asked if there was a spa at or near the resort. The manager (her name escapes me) said that they did not have a spa, but would look into our options. Sure enough, when we arrived they had researched spas in the area and provided us with prices and info on 3 options. The staff also meet every other request with a smile. We stayed in a hotel room, not in a cabin. The room was clean and the decor was up-to-date. There is a nice patio and pool area where we they'll bring you lunch, drinks, or anything off their menu. The restaurant menu is vast and they'll make anything on the menu from early in the morning til late at night. The beach, (which is literally across the street) is small, but clean and uncrowded. Overall, it's a great place to stay if you're looking for a quiet retreat with friendly, accommodating service.", "title": "Great Place to Stay", "user": "TJS78", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18606989, "likes": {"liked": "— Location and Staff", "disliked": "— Ummm...nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed at this resort for our family vacation at the end of July, 2008- I read the reviews on this site before booking and I have no idea where the other reviewers stayed! We rented a porch suite cabin & arrived VERY late at night. I checked in and walked into the cabin & noticed a weird smell. We went in anyway & I was shocked because all of the 'renovations' I had read about were NOT in our cabin (except a newer TV in the living room space)! The bathrooms are in DESPERATE need of renovation. The sheets on one of the beds were stained and were tucked into the wall to hide the stains! Anyhow, we stayed for 2 nights until I could not bear anymore- the restaurant was understocked- every time we tried to order something they were out of the item- (even, vanilla ice cream one night!) The day we checked out (two nights early and demanded a refund- which they obliged with no problem and were very polite about), we went to the \"beach\"- across the street- which was DISGUSTING! There was duck poop everywhere and we were swarmed by yellowjackets! I made my children leave the beach and we went to swim in the indoor 'heated' pool which was FREEZING! In fact, I had complained about the pool temperature two days earlier and nothing had been done (they claimed no one had informed them). Also, while changing, housekeeping BARGED in without knocking (although they claim they did knock- they definitely did NOT)! Overall- a bad experience- causing us to pack up & switch to another hotel!", "title": "Horrible! Would never stay here again!", "user": "NewYorkMomoffour", "date": "July 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 18443707, "likes": {"liked": "— Not much", "disliked": "— Having to pack up and switch hotels!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "We just returned from our family reunion July 18-20, 2008 at the Dunham's Bay Lodge. We had 41 people from California, Boston, North Carolina and the Capital District. The ages ranged from 2 to 76. We booked our reunion weekend in the winter and took a ride up to make sure they could accommodate us. Mark and Lynn did everything to make our reunion such a great weekend. Every family had their own cabin. Mom and Dad had a hotel room booked and were surprised that they upgraded them to a one-bedroom cabin when they arrived. The cabins were very roomy and comfortable. They also were very clean and updated. We had 2 dinners catered by Dunham's Bay and they did a wonderful job. Friday night we had pizza and wings set up in the yard and Saturday night we had a chicken barbeque set up on the patio. Both meals were great, food was hot and fresh. The entire staff was very helpful and courteous. I can't say enough about how nice the staff is at Dunham's Bay. Kids and adults had a great time in the pool and using all the outdoor facilities. We used the fire pit each night and the kids loved using the swing set and ping pong table. We were lucky enough to have great weather so we were outside the entire weekend. We would definitely recommend the Dunham's Bay Lodge for a reunion or just a weekend away. Our family had a wonderful experience at the Dunham's Bay Lodge! Special thanks to Kristin Goldstein for the recommendation. The Nero Family", "title": "Nero Family Reunion at Dunham's Bay Lodge", "user": "ne41", "date": "July 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18152759, "likes": {"liked": "— Good for all ages", "disliked": "— beach access"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "My husband and I, along with 24 other family members, went to Dunham's Bay for the July 4th weekend. We had an absolutely wonderful time. Every staff member at Dunham's Bay was so accommodating and they were always there to help us with any request we had. The rooms were newly renovated and very clean, the grounds were great and there was something to do for every age group. Our only complaint was some ants in our room, but as soon as we let the staff know, within 5 minutes someone was in our room spraying. It was hardly a problem and after all, we were in the mountains. We would definitely go back, and hopefully can do so again next year! We would highly recommend Dunham's Bay to anyone.", "title": "Loved Dunham's Bay", "user": "Patden", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17658703, "likes": {"liked": "— It accommodated activities for all different age groups.", "disliked": "— A little drive to the town, but did not cause a problem."}}], "location": {"country": "United States"}, "variance": {"poor": 9, "average": 4, "very good": 26, "terrible": 7, "excellent": 64}, "aka": "Dunham`s Bay Hotel Lake George", "slim_ranking": 0.166666666667, "description": "A family resort on the southeast side of Lake George. Formerly known as Dunham's Bay Lodge. Renovated in 2007 with new carpeting, flat screen TVs, new mattresses and the new View Restaurant. We are open year round!"}