{"user_rating": 4.5, "review_count": 83, "name": "Dunvalanree", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "My father and I spent a wonderful evening here last week and I can't wait to go back. In a way, it was a shame it only was for one night because the surrounding scenery is spectacular and the food is excellently prepared and amazingly delicious!", "title": "Excellent food and very warm welcome", "user": "JamboAl", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15500727, "likes": {"liked": "— Food, food, food (and scenery)"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The rooms were well maintained although being a city boy, the lack of a television was a bit of a letdown (but I also realize that I wasn't there to watch the telly so in a way, that's a good thing).", "title": "Hidden gem with out-of-this-world food!", "helpfulness": 1, "user": "Andy3004", "date": "April 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15180587, "likes": {"liked": "— the food!!", "disliked": "— it is a little remote, but if you are looking for peace, wonderful views and a relaxing time perfect"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I would highly recommend it to folks wanting to get away from it all.", "title": "An excellent base for a man and his dog", "helpfulness": 7, "user": "forresjohn", "date": "November 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10902454, "likes": {"liked": "— Great food"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "What a fantastic place to stay! My wife and i have just returned after spending a night at Dunvalanree. It is a superb place to stay if you are looking for a wonderful location by the beach, exceptionally friendly and welcoming hosts,and a place where you can truly unwind. However,the main reason for me would have to be for the food.It is quite simply outstanding. The hotel is run by a husband and wife, who clearly work very hard at running their hotel and indeed seem eager to look for any ways they can improve even more. But getting back to the food...we can honestly say it was one of the finest meals we have ever had.They source all the finest of ingredients locally and they are prepared beautifully by Alison. As for the hotel itself,it is exceptionally clean, full of character and the service by all members of staff is very friendly. I would strongly recommend you get there as soon as you can!", "title": "Dunvalanree still quite magical", "helpfulness": 2, "user": "Tearlaich", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10144039, "likes": {"liked": "— Vey claen and well laid out"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I booked a dog friendly single room for 5 days at the Dunvalanree because it accepted small dogs. My wife and daughter were having a week's holiday in Boston so I looked for a quiet golf/wildlife/walking/dog friendly base. On arrival, I was offered the attached cottage as another couple would have liked the dog friendly room. The cottage was absolutely excellent - open fire, comfortable bed, kitchenette, lounge area - perfect for the dog. If I stay again, I'll definitely book the cottage - it was perfect for my needs. Located at the back of the Hotel - a simple 30 second stroll to the Hotel.", "title": "Carradale is the best part of Kintyre and Dunvalanree is a lovely place to stay", "helpfulness": 4, "user": "Chip_SSS", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8361341, "likes": {"liked": "— Food, views, proximity to walks, service, peacefulness, location", "disliked": "— Leaving it all behind"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My Wife and I stayed at Dunvalanree for a week at the end of May. A superb location at the small secluded Port Righ bay on the East of Kintyre, made this hotel a perfect vacation venue. The Hotel is part of the Scottish Seafood trail and is rightly in receipt of many awards. The food was magnificent. Everything cooked to order, a good choice and delicious. Alan, the proprietor, was most attentive and the perfect host at all times.", "title": "Wondeful Food, Service and Location", "user": "lecturemusic", "date": "June 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 31464460}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "The hotel is a good centre for touring Kintyre, being quite central. However, the road north is somewhat degraded compared to the west coast route.", "title": "puddings to die for", "user": "susanhill", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30274787}, {"rating": 5.0, "title": "Exceptional food", "text": "There is plenty of walking available and for Bird Watchers a trip to the Machrihanish Seabird Observatory is a must. Don't expect a luxury Hide - but Eddie Maguire is a mine of information and could keep you fascinated all day. The bay near the hide is also superb for just watching wild life pass by - and then there is the golf course too!", "user": "EdinburghRuby", "date": "April 27, 2009", "id": 28854715}, {"rating": 5.0, "title": "Delightful Dunvalanree", "text": "The south of the peninsula is well worth a visit and tended to be more sunny than the north during our visit. We even got to see a Golden Eagle adn Dolphins plus many other firsts for our list.", "user": "sam_nicolson", "date": "August 23, 2008", "id": 19256577}, {"rating": 5.0, "title": "Fantastic value", "text": "We had room 6 at Dunvalanree which had a Bay view. It was perhaps a little cramped for a week, but facilities were good, including a miniature whiskey on the tea tray.", "user": "Marydun", "date": "August 20, 2008", "id": 19154398}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I stayed at the Dumvalanree in June 2007 whilst on a business trip to both Campbeltown and Lochgilphead.", "title": "Superb Dinner and Peaceful Surroundings", "helpfulness": 5, "user": "Applemac64", "date": "June 19, 2007", "detail_rating": {"business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7938607, "likes": {"liked": "— The food"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel was a revelation. Being more used to business class hotels it was very refreshing to stay at somewhere with such friendly service. There was a small problem with my first room and when this couldn't be fixed Alysson immediately gave me another with a view of the bay!", "title": "Location, Location, Location", "helpfulness": 7, "user": "postcard13", "date": "April 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7344568, "likes": {"liked": "— Quality of fresh food and cooking and use of local produce", "disliked": "— Bedroom a bit small"}}, {"rating": 1.0, "title": "Have to agree with the previous poor report.", "text": "Alysson is also responsible for the varied menu. Although if you enjoy seafood you will be well catered for.", "helpfulness": 7, "user": "glendoe", "date": "September 13, 2006", "id": 5797467}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Other correspondents have complained about the procedure at dinner. It should be remembered that this is a small hotel. Booking ahead for dinner is essential. Dinner orders are taken in the lounge at around 7:00PM and this means that the dinner is freshly prepared, cooked and ready for serving by 8:00PM. This gives you a chance for a drink and conversation with your fellow guests (if you feel like doing so!).", "title": "Below average........", "helpfulness": 8, "user": "Bluesnowdrops", "date": "August 31, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "business": 1.0, "cleanliness": 3.0, "rooms": 2.0, "location": 4.0}, "id": 5729561, "likes": {"liked": "— leaving.", "disliked": "— Having no-where elso to go that night."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The location overlooking the bay is very peaceful. All in all an enjoyable stay", "title": "What a great spot for a getaway!", "helpfulness": 6, "user": "DJ14", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5607964, "likes": {"liked": "— Hospitality and location, truly amazing!", "disliked": "— Could not stay here longer."}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 1, "very good": 12, "terrible": 3, "excellent": 66}, "aka": "Dunvalanree Carradale, Scotland", "slim_ranking": 0.333333333333, "description": "Dunvalanree Hotel and Restaurant offers excellent value high, quality accommodation in a tranquil and beautiful setting, with private garden overlooking the bay below. The mile long beach at Carradale Bay is behind the hotel.Chef-Proprietor Alyson Milstead’s menus feature local seafood and farm produce. Dunvalanree is licensed and has an AA Rosette for food.Dunvalanree is a superb location to explore Kintyre, the birthplace of the nation."}