{"user_rating": 4.5, "review_count": 101, "name": "East Beijing", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Adjacent to a newly opened and as yet sparsely occupied shopping mall with a range of restaurants and 7 screen cineplex, on the eastern side of Beijing this new hotel is part of the Swire Group's expanding chain. We spent a weekend there after staying for 2 nights at the more central Grand Millennium, in order to visit the nearby 798 Art District and the Great Wall. East is modern, edgy, slightly scandinavian cool feel, with lots of young helpful and enthusiastic staff dressed more like Steve Jobs than your typical cross keyed concierge. We had a very comfortable and spacious corner suite, almost as large as an apartment, full of modern touches and hi-techery, not all of which we could get to work, even had a supply of HDMI cables to plug in the ipad, a room directory and music collection on an ipod which could be blue-toothed to the portable Bose speakers and automatic lighting which came on as you entered the room but which occasionally went off equally automatically leaving us in darkness. Unfortunately though they didn't seem to have any videos for the DVD player but it did have a great open bathroom with large tub, separate shower and WC and twin basins, separated by a glass screen from the living/sleeping area. Bed was large and v comfortable and automatic blinds ensured we had a good nights sleep.", "title": "Scandinavian Edginess on the Edge of Beijing", "user": "Intrepidtoo", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 145450298}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We had breakfast in the casual dining 'Feast' restaurant and also ate there one evening when it was too wet to venture further afield. The food at both meals was good in terms of quality, value and selection, with helpful friendly staff. Snacks in the Xian bar with its complementary cocktails and live band were also excellent and good value, particularly the small pizzas.", "title": "Great service and food, but a bit out of the way...", "user": "jpheitz", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 144690086}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Although the pool wasn't yet open it wasn't anything we missed on a snowy weekend. However the casual lounge/cafe/workspace on level 2 with collection of quirky books, magazines was a pleasant relaxed gathering place but perhaps a little bland", "title": "Good business hotel with a contemporary design", "user": "ThreeinBeijing", "date": "October 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143518409}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The main draw back of this hotel is the peripheral location and its newness means it can be hard to get a taxi. Although it bills itself as being very convenient for the airport, the concierge told us it would be difficult to get a cab and said that it wasn't possible to pre-arrange one. He conceded that the hotel car to the airport 20mins away was ridiculously expensive at 10 times the taxi fare. As a business hotel the ability to be able to get a cab reasonably readily would seem to be an essential pre-requisite as nothing is within easy walking distance.", "title": "Good Start", "user": "TeaSpray", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 141632096}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The best part of this hotel (for international travelers) is the way the staff almost always speaks very good English, often better than even in the fanciest 5-star hotels in town.", "title": "Amazing trendy hotel", "user": "aziz_hamdan", "date": "September 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 141000166}], "location": {"country": "China", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 1, "average": 12, "very good": 26, "terrible": 0, "excellent": 62}, "slim_ranking": 0.00613747954173, "description": "EAST, Beijing is a business hotel with a life. Located in INDIGO in the Jiangtai area and very close to Wangjing Business Park; Beijing Capital International Airport and the Central Business District are just 15 minutes away. With 2 restaurants, a bold new bar, pool and gym facilities, 17 hectares of landscaped parkland and the 798 Art Zone on its doorstep, EAST, Beijing lets you balance your work and your life."}