{"user_rating": 4.5, "review_count": 301, "name": "East Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Overall this was a great hotel with great location. One block from the Reeperbahn and less than a 10 minute walk to the main Harbour area. Here you can catch all the boat and bus tours. Hotel has a nice restaraunt and bar area. Only negative was that my room faced the bars courtyard and it was a bit noisy until about 02:00 am (unless you close the windows). Would definetly stay here again. Payed 150 euro per night. Onsite parking garage, 12 euro per day if you pay at front desk (20 euro per day if you pay in the garage).", "title": "Perfect Location!", "helpfulness": 15, "user": "am79211", "date": "May 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5223659}, {"rating": 4.0, "title": "Superb design hotel, bad service", "text": "East is the best place to stay in Hamburg. Centrally located beautifully designed a great bar and restaurant. The place to be in the weekend also for very hip locals. I stayed there for three nights and did not regret one moment.... until i came home and found out that the charged my credit card for a \"no show\". That is no problem if it was solved with one phonecall. But that did not work.... Something about wrong name on the reservation, bla, bla, bla. It cos me a lot of energy to get the silly € 100,- back but in the end I succeeded. Book the hotel! But do not give them your credit card!!", "helpfulness": 17, "user": "A TripAdvisor user", "date": "May 1, 2006", "id": 5022956}, {"rating": 5.0, "title": "Loved The East", "text": "This is a great hotel for business or pleasure. The room itself was impressive in every detail from comfort, function, and decor. In addition, the bar near the entrance was perfect for entertaining guests, in that guests were made to feel special both in service and the unique decor of the bar.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "March 16, 2006", "id": 4626788}, {"rating": 4.0, "stay_parameters": "Stayed November 2004, traveled on business", "text": "Even i stayed there long time, seeing that only one people write down about the hotel, i wanted to write couple of words about this good hotel.", "title": "Very big rooms, good located", "helpfulness": 12, "user": "yasi", "date": "December 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4309346}, {"rating": 4.0, "title": "Great Hotel, Good location", "text": "The rooms are very spacious, even i stayed in the middle one it was big. ı made a tour of the other rooms as well, and i saw the jacuzzi in the large room i was suprsied. Its kind of small hot tub in the room. And they told me that i should have seen the jacuzzi in the X Large room. They told that it takes half an hour to fill up :) So basically you will hvae your own private mini swimminpool inside your room :)", "helpfulness": 11, "user": "A TripAdvisor user", "date": "December 19, 2004", "id": 2900064}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "This is a very stylish, modern hotel in an old building in central Hamburg. The best points are the bar and restaurant which are extremely well designed and the food is pretty good too (although it helps if you like very undercooked food). In fact on a second visit to", "title": "Stylish, design-led hotel", "user": "Blackstone", "date": "November 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 11167163, "likes": {"liked": "— the bar", "disliked": "— the slightly overpowering darkness"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Hamburg in the same month we returned to eat at the restaurant. But I am glad we didn't sleep in the hotel again as well. I found my bedroom", "title": "Funky and functional", "user": "Lucy1974", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11079152, "likes": {"liked": "— Style"}}, {"rating": 2.0, "title": "Has form but no function", "text": "too dark, even when I managed to work out how to use the high-tech remote control dimmer switch. Indeed, the whole hotel is badly lit, intentionally I presume. Some of the bedroom fittings were also impractical and the basin is in the main room which isn't to my taste.", "user": "Suffolk3000", "date": "November 21, 2007", "id": 10954516}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "The water bed was a novelty, but no more than that. If you want to try", "title": "Good design in great building", "helpfulness": 2, "user": "gemsstock", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8219387, "likes": {"liked": "— Overall design fo the hotel", "disliked": "— Lighting in room"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "somwehere different and create a talking point I would recommend this place. I was on a busines trip and this place is perhaps more suited to a romantic break. And if you look better in the dark after a heavy night out then East could be just right for you!", "title": "Good hotel, great design", "helpfulness": 5, "user": "ThomasM1956", "date": "June 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7873016, "likes": {"liked": "— Spacious rooms, free wlan internet access, restaurant", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The East Hotel Hamburg is fabulous. It is modern, funky, unusual and the rooms are a good size, the shower offers a \"rain\" option which is nice and they feature Acqua Di Gio Giorgio Armani bathroom products...devine. The WiFi internet was not that great (typical in most hotels), the staff spoke German and English and were helpful. The bar is very popular in the evening, the weekend brunch and daily breakfast is delicious. We also utilised the conference facilities which were also excellent. The Day Spa was excellent value and my massage was also fabulous, 5 out of 5 for me!", "title": "Loved the East", "helpfulness": 11, "user": "jjaaus", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7259710, "likes": {"liked": "— Funky Style", "disliked": "— WiFi internet access"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "I booked this hotel after leaving the Adlon in Berlin, I was looking for some contrast and found it here. I loved so many things about this place that I will get the one negative off my chest first.", "title": "Glass and Stainless meets Brick and Cool", "helpfulness": 11, "user": "sailorboy4real", "date": "March 26, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7224533, "likes": {"liked": "— location", "disliked": "— light switches are confusing."}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 12, "average": 36, "very good": 81, "terrible": 7, "excellent": 165}, "aka": "East Hotel Hamburg", "slim_ranking": 0.121875, "description": "In the centre of Hamburg’s entertainment district, east bears Chicago-based architect Jordan Mozer’s extravagant signature style with futuristic, curving forms and light, bright tones. Situated in a former iron foundry, the hotel’s 127 rooms, lofts and suites are each furnished with bespoke furniture by Mozer; public spaces are dramatic, high-ceilinged odes to the fusion of East and West. The result is a winning combination for any style-savvy urbanite."}