{"user_rating": 5.0, "review_count": 87, "name": "Echoes of the Glen Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This was our first trip to Watkins Glen. We were spending the weekend with friends from Toronto and the finger lakes area was the perfect halfway point. We decided on Watkins Glen and picked Echoes based on location and reviews.", "title": "Hospitality at it's best", "user": "jamaicaluver", "date": "May 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110292036}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We could not have picked a more perfect place to stay. The owners Barb and Tom were very friendly and extremely knowledgable about the entire area. Their home was so comfortable and we spent evenings playing games or sitting around talking.", "title": "Great B&B for weekend getaway!", "user": "TheJunks", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82627987}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We were in the Rose room. The room was on the first floor but we rarely heard any noise, except from the street one night with the window open. The room was very clean, extremly comfortable.Big fluffy towels in the bathroom. The bed was one of the most comfortable we have ever slept in. Shampoo and soap are provided as well as a hair dryer. We had two chest of drawers to put our clothes in and a small closet.", "title": "Wonderful B&B!", "user": "Lovely_Lady50", "date": "September 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79169128}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Breakfast is served from 7:30 to 9am. Barb asked that we let her know the night before what time we planned to eat. Breakfast each day was home cooked, with delicous breads or muffins, fruit, juice and a main entree. There was always plenty of food and the taste and quality was outstanding.", "title": "Perfect location to walk around Watkins Glen", "user": "kcjones", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75802214}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "There is a lot to do in the area, from waterfalls, wine tasting,wandering the main street, visiting museums, etc. Barb and Tom were very helpful with restaurant recommendations, attractions to see and general getting around.", "title": "Lovely B&B", "user": "jsickles", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72720584}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "I stayed at this B&B with my fiance for two nights in July/August 2009. We were doing a wine tour with four other couples. We were spread out amongst a few Watkins Glen B&Bs as each are small and we booked only a month in advanced. After getting shut out of a few others we tried, the two of us and one other couple booked at Echoes. From the website we were less than enthused but figured we would be spending minimal time in the room. However, we were pleasantly surprised by the Inn and can now conclude that the website does it no justice. The Inn was extremely clean (my fiance is allergic to cats but had no problems whatsoever) and although the rooms were small, they were quaint and had no complaints. We were on the first floor (by the kitchen) and were concerned with noise, but there was no problems from the kitchen or the street. The bathrooms were always spotless as well. The breakfasts were tasty and the location great (walking distance to the downtown area, the harbor and the state park). Barbara and Tom were great as well. They have very interesting stories and very good advice about the local area. Thanks for a great stay and we look forward to staying there again in the near future.", "title": "Exceeded Expectations", "helpfulness": 1, "user": "thesleen", "date": "December 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 50817212}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "My husband and I, along with another couple, stayed at Echoes of the Glen this December while attending a holiday wine event. We have stayed at this bed and breakfast many times over the past few years and continue to return often. We have never considered staying elsewhere when we visit the area because we know we are guaranteed a great experience. The house is always spotless and the breakfasts are great! Barb and Tom, the owners, are very friendly, accomodating, and knowledgeable about the local attractions. The house is very comfortable and beats staying in a hotel anyday!!", "title": "Great place to stay!", "user": "k693433", "date": "December 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50765860}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The owner’s of Echoes of The Glen, Barb and Tom, are such a wonderful couple to open their home for others to stay. The home is comfortable and warm and decorated just so quaintly. Their cozy brick home is larger than it looks. Barb and Tom have the nicest dog and two cats to enjoy while you are missing your own furry friends. If you have never stayed in a Bed and Breakfast before, this is the one to be in for your first time. The owners, Barb and Tom, are fans of the Watkins Glen International Speedway which cannot be refused by many during the Vintage Grand Prix with all its glory and culture. While your significant other might want to enjoy the race the other can shop in town or visit the local 20+ some winery’s around Seneca Lake. If you are not sure of the area Barb and Tom will certainly help you fill your day with enjoyable fun. No one can refuse the wonderful and elegant home cooking from Barb and there’s always enough to go around. The breakfast muffins are homemade the evening or even the morning prior to your feast. Barb will even make breads that you never would have dreamed of making but they are a royal treat with her homemade jams. The plum jam is my all time favorite with her lemon zucchini bread. You will enjoy the local organic food from her garden and other locals. As long as you let the chef know when you want to eat the evening before you will have a hot, hearty meal waiting for you after you enjoy a hot coffee with the fresh grown flowers from around the home at the table. My ultimate favorite is the stuffed peach or apple French toast, no wait it’s the Sunset View Creamery omelet, or is the egg bake with potatoes…… They are all amazing and so is the hospitality!", "title": "BETTER THAN HOME AWAY FROM HOME!", "user": "jennifeeny", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42242952}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "An ideal place to explore the Finger Lakes. Barb and Tom are outstanding and informative hosts that provided lots of ideas and suggestions for exploring the Lake Region.", "title": "Charming and Comfortable, Great Service and Breakfast", "user": "MGTPhiladelphia", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37996847}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I just got back from two nights in the Chardonnay Room. The room was lovely, and we loved the dvd player and choices of some dvds. Barb was a great host and cooked us some delicious breakfast. She was very helpful with suggesting things to do in the area. Echoes of the glen is very centrally located- one block to the state park and just a few blocks to town. Only thing is that also means it's on the main road- so a tiny bit noisy, but definitely fine with the air conditioner on. We thoroughly enjoyed our stay and really felt at home!", "title": "Cozy spot from which to explore Watkins Glen", "helpfulness": 1, "user": "bcitter", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37191293}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My preference is normally to stay in a larger chain hotel that offers anonymity and comfort. However, my brother in law booked this hotel for us and him as a resting point on the way back from Niagara to Albany. He had visited the town previously to see the magnificent Watkins Glen waterfalls. This little bed and breakfast is very conveniently placed for viewing the Glen and its surroundings.", "title": "Cozy retreat to rest weary feet in Watkins Glen.", "user": "rainbowsue0", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70112480}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The friendly owners, Barbara and Tom, run the establishment. It has 5 bedrooms, all individually themed and reflecting the name- eg the rose room has a rose theme. They are tastefully decorated, if on the small side. Everything is scrupulously clean. If you are expecting tea and coffee in your room, hard luck. They make fresh coffee and tea for guests to help themselves to in the dining room, from 7am and you can take it back to your room.... The ensuite bathroom was perfectly adequate and had all that you would expect. There was no television in our room but that did not matter to us. The bed, a king size, was a \"sleigh\" design and high up off the floor. Fine for us but not for anyone with even slight mobility problems- you have to virtually climb up to bed! Very comfortable once you were in it, though.", "title": "It's home away from home.", "user": "bandbreview", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60197845}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Our room, the rose room, was on the ground floor, just along a short corridor from the kitchen. A disadvantage in my opinion. It affords little privacy and the cooking smells intrude.", "title": "Great return trip", "user": "farmersdaughter723", "date": "March 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59692770}, {"rating": 5.0, "title": "Wonderful B&B", "text": "Barbara and Tom were happy to direct us to one of the several eating places in Watkins Glen and we can thoroughly recommend the fish restaurant that overlooks the lake. Good fish, a great view and good value for money if you sit inside behind glass. The screens over the verandah obscure the view somewhat so don't sit out there!", "user": "guttooth71", "date": "February 19, 2010", "id": 56477109}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Breakfast was \"interesting\". There are 5 bedrooms and one big dining table and two small tables. I do not like to share my table with strangers and was glad when we didn't have to but it might have been uncomfortable had I not had a choice. Fresh coffee, fresh fruit juice (choice of 3 flavours) and a plate of fresh fruit to share on the table. So far so good. Also a plate of peach cake to share. Not to my taste. Then for the main part of the breakfast there was no choice- French toast and sausages.", "title": "Class, charm, and wine", "helpfulness": 1, "user": "heath_w12", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56075883}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We stayed at Echoes of the Glen B&B in December when we traveled to the area for a wine weekend getaway. We had researched a few places to stay and finally decided on this one mainly because of its location in town. We saw links on their site to various local attractions and thought this would be the best place to go in regards to proximity to those places and the wineries we wanted to visit. We definitely made the right choice! We felt very at home and welcome. They were able to accommodate our later-than-normal arrival. The entire place was very clean and comfortable, especially our room! I particularly liked that it wasn't over-run with the quilts and country-type things that so many B&B's seem to have. The food was absolutely remarkable (mmm...my mouth is still watering thinking about that french toast!)! And the Roosterfish Pub, which is just a short distance from Echoes of the Glen, was awesome--both for the food and for their beer, which is all brewed there! It was definitely a weekend for wine lovers and beer lovers alike! I would go back to Echoes of the Glen in a heartbeat!", "title": "All around wonderful!", "user": "ktbwolf", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33167829}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "My daughter and I had the pleasure of staying at this B&B for 2 nights. Barb made us feel welcomed and very comfortable. She was very knowledgeable about the area giving us great tips. If you want a great Kuken don't miss this spot.", "title": "Cozy And Comfortable", "user": "dtannen470Suffern_NY", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32631045}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Dtannen470@hotmail.com", "title": "This was a great quilt retreat weekend.", "user": "quilterny", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30332078}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "A group of women arrived Friday evening and set up our machines and sewed, relaxed and laughed until Sunday afternoon. The rooms were comfortable and the breakfasts were delicious and plentiful. Our hosts were friendly and let us take over their dining room and living room to sew. What fun!", "title": "Just what we needed....stay here when in the Finger Lakes", "helpfulness": 1, "user": "flyers48", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27949688}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My husband and I stayed at Echoes for a brief weekend getaway to enjoy some of the wineries along Seneca Lake as well as do some hiking at Watkins Glen Park. Echoes was just what we needed, the room was tastefully decorated and Barbara and Tom were first class:) Two highlights were the gourmet breakfasts and their pets, two cats, Teddy and Rita and dog, Smokey. We would recommend Echoes to anyone planning a trip to the Finger Lakes Region; we certainly plan on returning.", "title": "Friendly and Fun!", "user": "CourtneyFasolino", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27130937}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 2, "very good": 5, "terrible": 1, "excellent": 78}, "aka": "Echoes Of The Glen Hotel Watkins Glen", "slim_ranking": 0.157894736842, "description": "Lovely English Tudor style home in downtown Watkins Glen. One block walk to Main Entrance of Watkins Glen State Park, four miles to Watkins Glen International race track, two blocks to International Motor Racing Museum and within walking distance to Seneca Lake, restaurants, theater and shopping. Queen bedrooms, private bathrooms, homemade breakfasts with fresh homemade pastries each morning. Enjoy the homey, small town atmosphere."}