{"user_rating": 4.0, "review_count": 69, "name": "Econo Lodge Cherokee", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We were staying in Cherokee for 3 nights for a Bluegrass Festival & chose the Econo Lodge based on reviews I read on Tripadvisor. This motel was a good choice.. When I booked the room on their website, I asked for a room on the ground level & a room with a frig. We did not get a room on the ground level, but did get a room with a mid-sized frig. The front desk staff was very friendly; in fact one of the nicest I have ever had at a motel. Said there was always someone there at the front desk. The room was on the second floor (no elevator, although there was a handicap ramp to the 2nd level). The rooms are not connected to the motel office. You have to go outside to get coffee or brreakfast. The room had a small round table with 2 chairs, low dresser which the tv was on & a mirror over the dresser. Bathroom had sink, toilet & good shower. The room was one of the cleanest we have been in. Small shampoo & conditioner provided, hair dryer & in-room coffee pot, clock & mid size refrigerator. We had a room with 2 double beds. Wall A/C, which was a bit noisy, but I didn't mind the noise. There was an information rack in the motel lobby. There were also large containers of flavored coffees available all the time. That was a nice plus in the morning, as I like vanilla flavored coffee. The breakfast was nothing special - donuts, microwave oatmeal & cold cereals. The 1st morning we went for breakfast across the street to Grandma's Pancake & Steak House. Do not go there unless you are really desperate. The food was terrible. There is also a KFC across the street. The next morning we went to Peter's Pancakes & Waffles. You have to drive there, but worth the drive. Go straight through the light in front of the motel on 441N about 1 1/2 miles up the road on the right. Delicious breakfast. Nothing fancy, but it was good. The motel is within walking distance to downtown . Not much there but souvenir shops. I do remember a Pizza Hut & a Subway. We did not go to the casino, but did pass it. Also near Museum of the Cherkee Indian & the Oconaluftee Indian Village. We enjoyed our stay here & will return next year.", "title": "Will Stay Here Again", "user": "loves NC", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17167929, "likes": {"liked": "— Friendly front desk staff; clean room", "disliked": "— We had a room on the second floor"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Love the location of this Lodge.", "title": "Location, Location, and location", "user": "chalo_7", "date": "October 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10070714, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Felt like we couldn't get any closer to the heart of Cherokee, NC.", "title": "As good as anything in Cherokee", "helpfulness": 2, "user": "brainman73", "date": "September 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8671033}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The two rooms we booked were nice and clean, the night clerk was readily available when we arrived (late around 11:00 PM) , just an all around good experience. Will definitely stay there again.", "title": "Excellent value for a good motel", "helpfulness": 2, "user": "NZ_4", "date": "July 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8084558}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "We originally had plans to visit Mexico for Labor Day, but the incoming hurricane forced us to make other plans. At the very last minute, we decided to visit Cherokee instead. Almost every hotel, motel, and inn was completely booked for the weekend; this Econo Lodge was almost the only place left with rooms. The rates for the Labor Day weekend ($117/night after AAA discount) were apparently much higher than the normal rate. The hotel, it turns out, was centrally located--at the intersections of the two main roads running through Cherokee. About one mile down one road was Harrah's Casino, and one mile down the other road were most of the significant Native American historical sites. Moreover, it was within walking distance of almost all of the smaller shops, souvenir places, etc.", "title": "Last minute, good price, nice room!", "helpfulness": 2, "user": "jbn8", "date": "July 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5472678}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "it a quiete econolodge, very clean and with helpfull staff. the breakfast was very basic nut the place is ok . - free wifi-", "title": "i recommend", "user": "marco.to", "date": "September 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 40089731}, {"rating": 1.0, "title": "Hartless management", "text": "Will never stay in any of “Econo Lodge” hotels ever again!!", "helpfulness": 1, "user": "msivyi", "date": "January 23, 2009", "id": 23829171}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Our trip was scheduled for Dec. 24/2008, also my wife’s Birth Day. Due to unexpected financial changes we had to forget about our trip to “Econo Lodge” Cherokee, NC. And because it was creasy time around Christmas holidays I forgot to cancel our reservation with “Econo Lodge” in Cherokee, NC.", "title": "Nice and Quiet", "helpfulness": 4, "user": "linda28457", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21486252, "likes": {"liked": "— Qiet and clean ,great location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "Was not surprised to see that my credit card was billed for the service I didn’t use but what really upsets and angers me is the hotels management un-wiliness to do the right thing for the customers. Even after several phone calls to the hotel and conversation with hotel’s manager Susan, explaining that my wife lost her job and we had to cancel our trip, I was unable to get any money back or a hotel credit.", "title": "OK for the price", "user": "Jurnee", "date": "August 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 19400812}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Instead I received a letter from hotel manager Susan saying that they cannot find my cancelation number and can’t help me. How lame is that! I have never said I canceled it. Just was hoping they would be human and understand why I failed to cancel and give me a refund. But who was I kidding.", "title": "Second experience was not so nice", "helpfulness": 1, "user": "lily0411", "date": "July 2, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 2.0, "location": 5.0, "value": 2.0, "rooms": 3.0}, "id": 17472798, "likes": {"liked": "— the location", "disliked": "— the bugs in my room"}}, {"rating": 4.0, "title": "Ecno Lodge", "text": "Good clean rooms for a great price. Will stay there again.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 7, 2005", "id": 3168807}], "location": {"country": "United States", "city": "Cherokee"}, "stars": 2, "variance": {"poor": 3, "average": 10, "very good": 20, "terrible": 3, "excellent": 33}, "aka": "Cherokee Econo Lodge", "slim_ranking": 0.111111111111, "description": "The Econo Lodge nestled in the heart of the Great Smoky Mountains is a conveniently located hotel in the downtown area on the Cherokee Indian Reservation adjacent to the Oconaluftee River and is minutes from most of the areas popular attractions like Harrahs Casino, Paula Deen's resturant, The Cherokee Indian Museum, Oconaluftee Indian Village, Unto These Hills a powerful outdoor drama that brings to life the tragic history of the Cherokee people, Oconaluftee Island Park and the Blue Ridge Parkway. Other points of interest include: Santa's Land. Cherokee Bear Zoo. Cherokee Fun Park Tubing on the River. Fontana Dam, Deals Gap (Tail of the Dragon), Cataloochee Ski Area, Gatlinburg/Pigeon Forge, Great Smoky Mountain Railway. Come stay with us and enjoy being in walking distance to restaurants and many shops with a theater complex just across the street from the Econo Lodge. Activities include tubing, world class trout fishing, bonfires and picnicking on the river. The Econo Lodge is also just 30 minutes away from Western Carolina University. Guests of this Cherokee, NC hotel are invited to enjoy many great amenities like free fresh coffee, free wifi, free local calls and a free deluxe continental breakfast. Business travelers will appreciate the access to copy/fax services and free wifi. Traveling families will enjoy our larger family suites. All of our spacious guest rooms come equipped with coffee makers, hair dryers, cable television with free Showtime and refrigerators. Handicapped accessible, smoking and non smoking rooms are available. Whether traveling for business or pleasure the Econo Lodge hotel offers a convenient location, relaxing accommodations and affordable rates to everyone visiting the Cherokee area. Our friendly staff looks forward to seeing you soon."}