{"user_rating": 3.5, "review_count": 22, "name": "Econo Lodge Marshall", "reviews": [{"rating": 4.0, "title": "Just Fine", "text": "It's a budget hotel. There's a microwave and fridge which we used. It's older--our room clearly had some water and other assorted damage from the past, but oh well. It was relatively clean. The heating and AC worked--we used both due to time of year. There's some breakfast food--cereal, bagels, pastries. We drove around the I-20/59 area and checked with three hotels. This had the best price and looked pretty okay from the outside. It served our purposes well: as a jumping off point for visiting Caddo Lake and Jefferson. We didn't leave our valuables/important stuff--just in case. People who worked there were nice.", "helpfulness": 1, "user": "MaggieP6789", "date": "November 1, 2010", "id": 85644435}, {"rating": 4.0, "title": "Good place to stay......but", "text": "Nice place to stay. Always had towels, but housekeeping needs help in making beds. Room was cleaned daily. The only problem, someone took a valuable necklace. Someone else other than us who had entry to our room took it.?? Housekeeping????? It was hidden to where the individual had to literally go through our stuff to find it. Keep your valuables locked up if you go there.!!!!!", "helpfulness": 2, "user": "MelnMel", "date": "July 11, 2008", "id": 17784913}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "Stayed at this hotel last weekend and it was much as I expected it to be - very basic.", "title": "Reasonable value", "helpfulness": 1, "user": "CatTraveller", "date": "March 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 14194316, "likes": {"liked": "— Price and convenient location", "disliked": "— Inconsiderate guests"}}, {"rating": 1.0, "title": "Don't Stay Here!!!!", "text": "I had no problems concerning the cleanliness of this facility - I even walked across the carpet wearing white socks and had no dirt transfer to the socks. The bath, sink and toilet were all clean with no stains. The heating and air conditioning both worked well (this being Texas in March, both were needed over the 2 nights I was there).", "helpfulness": 1, "user": "fun2me", "date": "February 19, 2008", "id": 13672959}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My only negative comment is in regards to the other guests. There appeared to be a party going on the first night, with the resulting loud music with heavy bass and the debris of beer cans in the parking lot the next morning. The 3 low-rider cars parked in the parking lot apparently generated much admiration, as their car alarms went off numerous times.", "title": "Avoid this one", "helpfulness": 1, "user": "arkansawtraveler", "date": "January 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 12962327, "likes": {"liked": "— Convenience, firm beds, heating worked well", "disliked": "— Faint smell of cigar, trickle from shower head"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We have stayed at other Econolodges and fully understand the level to expect. Noting that these are cheaper hotels I wasn't expecting too much.", "title": "Not up to other Econolodge Standards", "user": "NZ_4", "date": "March 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 7199422}], "location": {"country": "United States", "city": "Marshall"}, "stars": 2, "variance": {"poor": 3, "average": 2, "very good": 6, "terrible": 3, "excellent": 8}, "aka": "Marshall Econo Lodge", "slim_ranking": 0.357142857143}