{"user_rating": 3.0, "review_count": 74, "name": "Econo Lodge", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2013", "text": "Hotel rooms were limited the weekend of my stay. I chose this hotel because the ratings looked okay. BIG MISTAKE!! The room APPEARED clean as we walked in, but later that night when it was time for a shower, clumps of hair were everywhere in the shower!!! It was so nasty and the manager only offered a ten percent credit. I watched the hotel staff go through rooms and \"clean\" each room in 5 minutes.Warning, don't stay here!", "title": "Nasty room,don't stay", "user": "kxk", "date": "November 12, 2013", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 184483866}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This Econolodge is so clean and well-tended ! I was so pleased to see the attention to detail given to everything there. Our room was very comfortable and quiet and the bed provided a good night's sleep for both of us. It was a memorable experience and, if I am looking for a room in the area I won't hesitate to stop here again. Thank you to the owners for providing such a lovely, well-maintained place for our stay!", "title": "Santee Gem", "user": "Jackie S", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182014641}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Stopped over on our way between family in Maryland and home in Florida. Room was recently renovated, clean, bright and very pleasant. Frances on front desk was helpful and efficient. Room was an excellent value for the cost, well above what you might expect from an economy motel. We had paid over 50% more for a room from another major chain on outgoing leg of this trip and were severely disappointed, so finding this room on our way back was very pleasant. We didn't sample the breakfast the next morning, so can't make any direct comment on it, other than that the dining room appeared clean, neat, and looked to have a good offering for continental breakfast with fresh waffles. This will become our designated stopping point on the trip in the future. We certainly recommend it.", "title": "Preferred stopover location", "user": "MrKWnspouse", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 175273811}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "...if you're traveling with a dog (which they allow for $10), you're going to stay at the back of the building. The first room I was assigned had smoker stench (the clerk claimed it was a non-smoking room, but it wasn't marked as such). When I asked for another room, I asked to be moved closer to the front of the building (since I was traveling by myself & the poodle is not exactly a killer). The room was clean, but it was still 4th from the back. Oh well, as I said, it was clean.", "title": "Clean... but safe?", "user": "dccha", "date": "August 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 174364889}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Make no mistake, these are average BUDGET accommodations. The surrounding neighborhood (east of I-95) seemed a bit dicey. The west side of the I-95 interchange, where I went to dinner, definitely seemed like a safer alternative. For that reason alone, I won't stay at any hotel in Santee that is east of 95 again.", "title": "Personalized Service Plus Clean, Affordable Accommodations", "user": "D N", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 170567752}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Don't believe the photos and 2 prior glowing ratings as we did. The landscaping in photos is no longer there. The Patel family who runs this place were very nice, but the motel is in very dilapidated condition: The bright blue doors shown in photos are actually faded and oxidized. When entering our room we immediately noticed shabby old furniture with torn bedspread, partially vacuumed carpeting, dirty air conditioning vents loaded with dust and grime. The WORST was bathroom: chipped-out old tub/shower with MILDEWED plastic shower curtain. The beds were advertised as \"furnished with fine linens\" - that is false because the blanket was cheap polyester and the \"linens\" were thin, well-used cheap sheets. Did I mention the large tear in the old, thin bedspread?? Door to room is flimsy at best - this old motel is in disrepair and has seen better days.", "title": "Dilapidated Motel run by Patel family", "helpfulness": 5, "user": "LoveTheOldWest", "date": "June 2, 2012", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 131146681}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The owner tried giving us another room, but after we investigated, we found that room in same, raunchy condition. We ended up staying at the Hampton Inn directly behind this motel.", "title": "GREAT STAY...clean and AFFORDABLE", "helpfulness": 4, "user": "CloggieUsa2001", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 119304018}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I booked this hotel last minute, as we decided to go to Big E, The place is run down, needs some updates, the bathroom was very small, not much water pressure in the shower, the blow dryer didnt work, My husband went to front desk and ask to borrow one they said didnt have any. When I checked out again notified them that couldnt use the blow dryer as it was broken and front desk clerk said oh yeah some one mentioned that. He said he had to write that down. I said that would be good idea, I would not return.", "title": "didnt meet expectations", "helpfulness": 1, "user": "nooccaraa", "date": "October 2, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 118862130}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My wife and I were staying for one night and we chose the \"nicer\" $120 non-smoking room. When I checked in, the girl behind the counter was chatting with the people in front of me. They had finished checking in and were just chatting. Even though I was obviously waiting, she just kept talking to them about nothing important for at least 5 more minutes.", "title": "Accomodations like this shouldn't be allowed to have rooms over $100", "helpfulness": 2, "user": "AaronJ123", "date": "May 19, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 108996223}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Half the rooms on our hall were smoking and half were non-smoking. Some of the smoking rooms were right across from or next to non-smoking. The carpet was very old and dirty and the hall stank of stale smoke. One of the steps up to the second floor was visibly crumbling. The seal around the tub was dirty and moldy. The tv was very old and small and the picture was very poor. The window looked out on a wall 5 feet away.", "title": "Cheap, No Frills, Bug free", "helpfulness": 1, "user": "cindela", "date": "May 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 108507366}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "None of the rooms in the motel have a refrigerator nor was there an ice machine. I asked at the front desk if they had any plastic spoons or knives-- they did not. We had brought sodas and had to drink them warm and had to throw our food out the next day.", "title": "cheap clean lodge", "user": "solistonasolotrip", "date": "January 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 91958812}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Other than all that, the room itself was fine. Seemed pretty clean, the bed was comfortable enough, and the free wi-fi worked well.", "title": "the worst place I have ever stayed in my life", "user": "kathymart", "date": "July 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 70546896}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We were traveling up north Canada and I had made reservation online because of the cheap price. Room was quit old looking with no extra. Following morning, we went for breakfast, juice machine not working. I am sure they could have find some gallons of juice but it shows how much they care. If you are looking for smiling faces at the front desk, this is not the place! It's cheap and you get what you pay for ... I would stay again for price. Don't take a family or a date!", "title": "For one night!", "user": "BrigitteAlabama", "date": "September 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 43976247}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "In the online pictures the hotel looked lovely. Reality proved quite the opposite.", "title": "Lodger beware do not stay here!", "user": "Smubby", "date": "July 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 35491230}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The bathroom particularly was a shock. The paint was worn right through on the toilet seat and the enamel on the tub was worn right through to the fiberglass reenforcement. The tiles on the floor were cracked and broken and rose underfoot.", "title": "Cheap place to stay", "user": "zippy72345", "date": "June 26, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 33239235}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "In the bedroom, the spread was threadbare in places. The seats on the chairs and the carpet were stained. The wallpaper was peeling off in places...and there was a black spider on the bedlinens probably having dropped from the web above the bed.", "title": "No Frills, but good value", "user": "cc126", "date": "May 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 29300298}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "There was no back to the tv remote control, thus the batteries kept falling out.", "title": "good value for the money", "user": "kalpu1", "date": "May 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 29298450}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Booked a room for 1 night over the Ramada website because they advertised 54.00 a night including free shuttle to airport. When we got there they stated that the cost was 89.00 because we were parking our car there. When we returned to the airport and called for the shuttle, we stood outside in the freezing cold waiting for 45 minutes, after being told it would be 15-20 minutes. EVERY other hotel shuttle was there within 10-15 minutes. The hotel is in horrible shape, and believe me I am not demanding when it comes to a hotel room. The tub was filthy and stained. The hallways were horrible- cracked walls and disgusting carpet. Positive: Beds are VERY firm, which was fine with me. Continental Breakfast ia cereal, waffles, pastries,juice, coffee. It was fine. People at the front desk were pleasant. I will never recommend this place to anyone. Nicer places advertise Park and Fly for 10.00 more a night near the airport. Check those out. I emailed the Ramada website on 1/10 and I still have gotten no response.", "title": "Very Dissappointed- Find another hotel", "helpfulness": 5, "user": "shell43", "date": "January 15, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 5.0, "value": 1.0, "rooms": 1.0}, "id": 6599675, "likes": {"liked": "— convenience", "disliked": "— price,filthy tub, horrible shuttle service"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Would not choose to stay here again. Felt dirty. Staff were ok but not overly friendly. Airport van driver very nice but vehicle was in very poor shape.", "title": "Not Impressed", "helpfulness": 3, "user": "scrappinginontario", "date": "December 29, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 6517226, "likes": {"liked": "— location to airport", "disliked": "— did not feel clean"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "I read a lot of bad reviews about this hotel, but really folks is it that bad for the money? Let's keep that in perspective when you know you booked the cheapest park and fly hotel in the area.", "title": "Wasn't that bad", "helpfulness": 1, "user": "jim1011", "date": "December 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 6358360, "likes": {"liked": "— service", "disliked": "— needs renos"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "I stayed on Dec 01/2006 for an early morning flight. Yes the hotel has seen better days but they are renovating. The lobby is nice, the room was OK and the continental breakfast was nice. The room was tired but it served its purpose, and I would probably stay there again, mainly because of the friendly service and the quick shuttle service to the airport.", "title": "Stayed at the Ramada Limited during the OCT snow storm", "helpfulness": 8, "user": "brnidgrl4u2", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5966541, "likes": {"liked": "— the staff and the convenient location", "disliked": "— fyi: watch toes around wall heater/ac unit! my friend stubbed her toe on it! :)"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I recently was attending a Basketball Tourny with my son and we had to stay at the Econo Lodge in West Springfield. The front desk was very helpful with local surroundings. We also needed a room with a fridge and they found one for us. The room was pretty clean. The toilet seat wobbled a bit but all and all for the price it wasnt bad. The breakfast in the morning was pretty OK as well.", "title": "Very Helpful Staff", "user": "RNR508", "date": "April 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 28971094}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The foldaway bed that the young desk clerk brought for my granddaughter was bent and had no top sheet, no pillow, and no blanket. She found a ratty blanket I wouldn't have used on a dog. Our sheets had cigarette holes and there was no internet connection as advertised. Stay away. Only good thing was taking the dog.", "title": "What a dump", "user": "TravelingCVT", "date": "March 23, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 26661608}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "I generally stay at the Quality Inn in West Springfield. I stay there 6-8 times a year. And because I stay so often, I have a Choice Hotels Rewards card. This entitles me to free nights after I build up enough points. Since I was staying 6 nights for Christmas with my family who lives nearby, I was looking for something economical but clean and quiet. I had saved enough points to get 4 free nights at the Econolodge or only 3 nights at Quality Inn. Since Quality Inn's points were higher, I decided to stay at this Econolodge and get one extra free night because their free night points were lower. I booked four free nights on the Choice Hotels website.", "title": "Terrible experience. What a shame.", "user": "bythesea2232", "date": "December 29, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 23066094, "likes": {"liked": "— They refunded all my points.", "disliked": "— Everything, from check-in to check-out."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Everyone always uses the saying \"you get what you pay for\". Wow, is that ever true with this hotel. I should have known and kick myself now.", "title": "Don't even think about staying here", "user": "lllamaman", "date": "October 2, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 20547149, "likes": {"liked": "— I only had to stay 1 night", "disliked": "— Radio noise from outside all night long"}}, {"rating": 1.0, "title": "Dont Leave Your Belongings Behind", "text": "Now comes the review and trust me, I couldn't make this up. I arrived at this Econolodge around 6:30pm to check-in. The front desk clerk was very friendly. The hotel itself seemed a little sketchy and I didn't feel all that safe in the parking area. Anyway, I carry my two bags of luggage up to my room. Open the door to find the room had not been cleaned from previous guests. So I'm a little annoyed, but maybe it was an honest mistake. I head back to the car and I see the front desk clerk running through the parking lot yelling \"I gave you the wrong room.\" No she didn't, she realized the room was dirty after I left the lobby. So she goes with me to the new room and opens the door, checks the bathroom (why I wondered?), turns on the heat, checks for a TV remote and leaves. After less than 5 minutes in the room, I realize the smoke detector is chirping because the batteries must be dead. I left to get some take-out dinner. When I came back to the hotel, I stopped at the front desk and told the clerk about the detector. She said all she could do was move me to a different room because their was no maintenance man until the morning and she was alone. I agreed but really had no choice. I go to my old room to collect my luggage and go to the new room (my 3rd). After I open the door I hear a big german shepard-type dog at the door of the room next to me barking. I leave the room to get my take-out bag out of my car, the dog in the room next door barks again. I arrive back at my room and the dog barks a third time. OK, back to the front desk. I tell her I can't stay in that room for 4 nights with that barking dog. Why would the hotel put people with dogs on the 2nd floor anyway? Shouldn't they be on the first floor in case the dog needs to be walked? And why would she put me in a room with a dog next door? Now I am really angry and I tell the clerk she has one more chance to find me a room or she finds me another hotel and pays for it. She is patient and upgrades me to a larger room with two beds. That didn't matter to me because I'm by myself. The new room (my 4th) is located at the far end of the hotel and doesn't have the same outdoor corridors. Keep in mind that I've had to carry my luggage back and forth to my car. This time I was smart and went to check the room first before bringing my luggage up. I go to the room and swipe the key card and it won't open the door. I tried several times. Back to the office. I tell her it won't open the door and a guy in the office (I assume her boyfriend or husband) says sometimes to the afftect that the cold weather affects the electronics on the doors. I remind him that it's an inside corridor room and the hall is not cold. She doesn't believe the key won't work and follows me back to the room. As we enter the corridor, she comments how warm it is. Hmm, but still too cold for the door electronics to work? She tries and sure enough the key doesn't work. She uses her master key to open the door and we both notice some white substance all over the carpet and that it hadn't been vacuumed. I can't believe this. She goes to the room directly across the hall. Swipes her card, opens the door and the door falls off the hinge. Goes to the room next door to that, opens the door and the room is clean but someone used the toilet and didn't flush it (I also notice no towels). Goes to the next room, swipes her card and opens the room and this one looks fine. SEVEN ROOMS LATER!! The clerk leaves to go get me a new key card and I bring my luggage up and check out the room. The remote didn't work. When she returned, I had her get me a new remote. Keep in mind, I haven't eaten dinner and it's now cold. I eat and call Choice Hotels directly. I thought I was doomed because when you book using rewards points they are non-refundable. The CSR at Choice said if I checked out they would refund my points. It was late and I didn't want to move to a different hotel, so I stayed there anyway. The room was quiet and clean, so I was OK with staying the other three nights. I didn't check out their breakfast as the lobby where it was served didn't look clean or sanitary.", "helpfulness": 1, "user": "Tweetygirl55", "date": "March 13, 2008", "id": 14267276}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The staff were very accomodating, however, the room was not clean. The carpet was not vacuumed and the furniture was very old and stained. The bathroom needs to be updated as the tub was flaking. You get what you pay for. I would not stay here again.", "title": "Not very clean", "user": "coacheswife2", "date": "February 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 13688902}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "This hotel is a dump!! We stayed in room 117 and the wallpaper was peeling off of the wall. When we woke up the next morning it was just hanging there and behind the wallpaper was MOLD!! There was gum on the carpet, stains on the bedspread and the curtains looked like they were 10 years old. The girl who checked me in was so rude, she spent more time on the phone then helping me out, and she barely spoke any english. All in all this place is a dump, do not stay here.....", "title": "Worst Hotel I Have Ever Stayed At!!!!", "user": "horse02", "date": "June 11, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7836319, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Shortly after we arrived in our room, the fire alarm started beeping and when we called the front desk, we were told just to take battery out, or we could come down to get a new battery. The next morning, I woke up to iron my shirt and there was no iron there, so I had to go to the front desk and pick one up. After I got out of the shower, I discovered that it was actually a bathmat that had been placed on the towel rack instead of a full-length towel, so my husband had to go get a normal-sized towel for me. When I got that towel, it had long curly hairs on it. We went to breakfast 1/2 hour before it ended but all that was left were a few muffins and bagels. if you literally just want a place to crash and don't care about anything, this place is fine, but otherwise, I would go elsewhere. The best part about this place was the free internet.", "title": "pretty bad", "user": "brizetraveler", "date": "October 25, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 6012541, "likes": {"liked": "— wireless internet", "disliked": "— inattention to the room"}}, {"rating": 2.0, "title": "Not too nice", "text": "I stayed at this hotel in May 2006 with my girlfriend for 3 nights. While the room itself was satisfactory, it was far from clean which is why I would not recommend it. When we first checked in, we found prior guests snack foods on the floor (i.e. cheese puffs & gummy bears). It was quite obvious to us they never vacuumed the floor after the prior guests departed. They also never cleaned the tub; there were hairs on it from the prior guests. Taking a bath would have been out of the question! On our second day, they never even bothered to empty the garbage! I also went to go to sleep one night and when I pulled up the comforter, it had some sticky substance on it. That was not too pleasing an experience. On the plus side, check-in was easy and the staff was friendly. The rooms are for the most part up to date but could use some remodeling. Our room was without the coffee maker. When my girlfriend alerted the front desk, they stated allot of the rooms are missing them. I guess some people like to steal $5 coffee makers. :) I can't recommend this hotel though overall due to the fact it is not too clean.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 17, 2006", "id": 5146857}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I booked this hotel online having never been to the Springfield area. My boyfriend and I spent the day at Six flags and checked in around 10:30pm. We were relieved as soon as we opened the door. Our room was clean, and stocked with towels, coffee, and soap. Our king size bed was very comfortable, though our pillows were kinda flat. The man at the front desk was very helpful and check in/out took less than 5 minutes. I would reccomend this motel to the budget minded and no-frills kind of people.", "title": "Very nice for 50 bucks!", "helpfulness": 1, "user": "elizsa", "date": "September 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3924343}], "location": {"country": "United States", "city": "Santee"}, "stars": 2, "variance": {"poor": 11, "average": 6, "very good": 14, "terrible": 18, "excellent": 25}, "aka": "Howard Johnson Express Inn Santee Sc Hotel Santee", "slim_ranking": 0.461538461538}