{"user_rating": 4.0, "review_count": 564, "name": "Econo Lodge Times Square", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "It's so hard to think of anything that was positive about this experience. We were charged upon check in even though the room was prepaid, so had to spend a lot of time correcting the error. There was no hot water for shower. Room really small and tight. Across street from fire and EMT station. Constant noise from emergency vehicles all night. Elevator was very slow. Breakfast that they use as a selling feature served on a counter in the check in area (very very small) where you sit on the ledge in the front window and hold food in your lap. People actually came in off the street to grab food. Neighborhood very shakey. Businesses and people we would not normally associate with. Oh, yes, and the bed was bottom of the line and very uncomfortable. Might have saved $20 but definitely not worth it. Good feature was that it was very close to Broadway shows.", "title": "Big Mistake", "helpfulness": 2, "user": "HappyTraveler1006", "date": "January 27, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 54519254}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "I have stayed at many places in NYC and this is a nice find. After reading reviews for many hours I picked Econo Lodge. The location is great, the rooms are clean and the price couldn't be beat. I usually travel with friends or children and look for safety, cleanliness, comfy bed and decent location. Sure the room/bathroom is small, but how much are you really in the room and I have seen just as small of rooms in NYC for a lot more money. We sleep in it and get ready in it, so it was just what we were looking for. I have stayed in four star hotels in NYC, but wouldn't hesitate to stay in this two star again. The staff was wonderful and very helpful. We only took advantage of the breakfast once, it was small (grab and go), but a nice jump start to the day, and besides there aren't many hotels in NYC that have anything set out for breakfast. I was pleasantly surprised by our entire experience at Econo Lodge. We are big walkers and we walked all over from this location at all hours and felt safe, and I was with my teenage daughter. I don't make a point of nit picking small things at the places I have stayed at, I find the same problems in high or low end hotels; I think it's all in what you are looking for. Thanks for making our trip safe, comfortable and enjoyable:>)", "title": "Don't look any further, this is the place to stay!!", "helpfulness": 1, "user": "jamnv", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 54511243}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Nice hotel!It has a yummy breakfast with croissants, jelly, chocolate, milk and all that good stuff!!The rooms were clean, had a very good bathroom (good conditions) and most of all is really well located.", "title": "Wonderful experience!!", "user": "MacaronniMastroiani", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 53236355}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel is in a perfect location for theatres etc. The rooms are extremely small, but very clean. The staff is helpful. Call direct and ask for the Manager's Specials.", "title": "small,clean rooms", "user": "san18", "date": "December 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 52206370}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Breakfast..bagel,cake & coffee free in the lobby until 9:30. For a cheap clean room and a place to sleep in a perfect location for all sights etc. Shops and restaurants all around the block. Walking to all sights.", "title": "Great Location, Tiny Room, Clean, Good Value.", "helpfulness": 1, "user": "TexasGramps", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 48656006}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "We stayed at the Econolodge hotel NY if you call it that,we were tired a friendly face would have been nice ,no such luck, the staff at reception were unhelpful and useless.Got our key after about half hour went to the room we were given ,it was a double not a twin so off we go back into the lift i knew it was going to be fun when we got downstairs we explained it wasnt the room we had booked the receptionest said did you book in yesterday ,no half a hour ago through gritted teeth .We ended up paying another $139 .To be fare the young man at reception was very helpful.Starving hungry next day came down for breakfast which takes place in the reception area only one word inedible,the room was cold and very small but clean .The cleaners were brilliant i think they should get the reception job.!", "title": "If you can call it that", "user": "scatty3", "date": "October 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 47271120}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We banked on the reviews here and stayed 2 nights while seeing shows in NYC. The review were right. This is somewhat of a hidden gem. The value ($169.99) was very good. The locaiton is fantastic - within 1-2 blocks of most theaters, short walk to Times Square, and 1 \"long block\" to 9th Avenue where there are tons of restaurants (and more on 8th Avenue too). The room we had was exceptionally small -- really little more than a bed, desk and bathroom. There was literally one foot on one side of the bed and one foot space at the foot of the bed. Other than that, there was very little room to maneuver around. Yet the room was very clean and fresh. The place has clearly been renovated from top to bottom. There is a small chest/wardrobe, and I mean small. It has a safe in it and it's not much wider than the safe. The safe was nice to have but too small for my laptop. There is a small desk which is good but if the chair is used you can't walk past it. The bathroom is clean and small but usable. Essentially it's like being on a cruise ship where there is no a spare square foot around. But since we went sightseeing all day, came back to get changed, went to theater and then late dinner and did not get back until midnight, we basically only used it for the bathroom, changing and sleeping. A good find and good value in an otherwise expensive part of town.", "title": "Agreed - clean, good value, great location", "helpfulness": 3, "user": "MNtravel01", "date": "October 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 47119339}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I've read reviews on this hotel before I booked but when I stay in a hotel I only use it for sleeping in. So the size of the rooms does not matter.", "title": "Small room but who sleeeps in New York!!!", "user": "SirRogue58", "date": "October 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 46847888}, {"rating": 2.0, "title": "Definitely just a place to sleep", "text": "The location was great a few yards from Times Square so close enough but far enough to be away from the bustle.", "helpfulness": 1, "user": "silverpurplstar", "date": "October 13, 2009", "id": 46759694}, {"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "The lift did make a bit of a racket when we 1st arrived but it was soon fixed. The room was very small for example, there was a flat screen TV on the wall and I still had to lean back as I passed between it and the bed. But that's the only complaint I could make if I wanted to.", "title": "You may think this is a bad review...but it's not! Keep Reading...", "helpfulness": 3, "user": "trvlingtrvlagnt", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 46506795}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The only reasons to stay here are the location and the price. Just a few minutes walk to Times Square. The room is actually the smallest I have ever been in and I am a traveler of age 65. But if you want just a bed, a rather ratty look room and lobby and a breakfast of semi stale food then stay. We paid $150 a night plus another 20% in taxes.", "title": "Great Location - Ho Hum Hotel", "user": "ojdidit", "date": "April 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 62300873}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "Loved this hotel. Yes the rooms are small but they are perfect for one or two persons. Hotel was quiet (even with some traffic noise from the outside --- but I enjoyed hearing it), the staff was excellent, the room was very clean and the bath was perfect. After staying at the YMCA for years and years and seeing it get less and less nice, this place was a perfect alternative. I would stay at Econo Lodge Times Square in a minute. I really enjoyed my stay there.", "title": "Loved this hotel", "helpfulness": 1, "user": "AshtonNewOrleans", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 61260137}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "If you're looking for clean, reasonably priced accommodation in NYC, this is it. The location was really good (5 mins walk from times square) and the rooms although TINY were really clean and modern. Bad points are that you cannot control the heating temperatures in your room as they are centrally controlled, the free wifi is pretty bad but there are lots of neighbours to sponge off! Also, it's across the road from a fire station, so your sleep will be disturbed until you get used to the loudness of the city! Good points, very clean, modern, good free breakfast in the morning and free tea and coffee 24/7 Feels pretty safe and secure too.", "title": "Small, but clean, modern and safe", "helpfulness": 1, "user": "rachandfil", "date": "April 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 60664903}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "You do not get what you book. The air condition did not work. It would not turn down below 76 degrees. A remote was supplied to us after they could not find out why the controls would not work. The hair dryer broke. When we called the front desk one was at our door in about 15 minents. The only problem is that it was wall mounted and I had to uninstall the old one and install the new one. The breakfest is a joke. Every night around midnight a gallone of milk was put out on the counter. That same gallon of mile stayed out each night (WE STAYED 5 NIGHTS) untill 6 in the moring when they poured it into another container. The staff is very rude. Do not try to save a few bucks by staying here. You will be disapointed!", "title": "STAY AWAY!!!!! GENERAL MANAGER NON RESPONSIVE!!!", "helpfulness": 1, "user": "opticalstorm", "date": "April 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 60482337}, {"rating": 3.0, "stay_parameters": "Stayed March 2010", "text": "Stayed here at the end of March, '10. The place is OK, but a little shabby, and the room was pretty small. But, hey, this is NYC where shabby and small are the norm! Trust me, I've seen worse! I got a Queen bed, but the room was made for a double (at most), which is what I would order if I stayed there again. There was less than a foot of space between the wall and the end of the bed (the same applies to the space at the far/window side of the bed).", "title": "Not Great, But Not Too Bad", "helpfulness": 2, "user": "ircorva", "date": "March 30, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 59950888}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "This is an Econo Lodge, not the Four Seasons, but it does have the backing of a national chain. It is located not even 2 blocks from Times Square, on the north end near Central Park. The rooms are small, but from my experience, most rooms are in Midtown Manhattan. But when you're in NYC, you're not spending much time in the room anyway. I've seen the reviews on similarly priced hotels, and if you even get a private bathroom, you may see rodents. But at the Econo Lodge, the rooms were fairly clean and you get your own decent-sized bathroom. I actually stay at this hotel every time I go to NYC, because working for a non-profit, you can't beat the price for a decent hotel in that location. During my last stay, I came back from a day out working and almost cried with joy when I saw how much care the maid service took with my belongings when cleaning the room. It was immaculate and organized. The accommodations are nothing fancy by any means, but you're not going to find a better location with nicer staff for under $150 a night in Midtown.", "title": "Great location, reasonable accommodations for a great price", "helpfulness": 2, "user": "westseattlered", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46266197}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed in this hotel because it was close to Times Square and was about $120 a night. A good price for the area. We were not disappointed. The rooms are small, but they were clean and the location was great!", "title": "Nice hotel for the price", "user": "mrboog", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 46222649}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This place is miserable! It took us two hrs just to get checked in after spending a 6 hr ride to get here. There was some internet issues... We went out for dinner hoping the issues would be resolved by then...they were not! We were not offered anything for our inconvenience, not even a water and just said \" there is nothing we can do\" even though their motto is \" where great customer service doesn't cost extra\", but this place has no customer service at all. When we got back the elevator was broken and there was nobody in the lobby for any help at all. So what are you paying for...please spend the extra 200 bucks for a much better place, this place is an insult. The next night we tried to get back into our hotel room and had to go back down to the lobby with the most unfriendly employee ever because nieiher of our keys would let us into our room, it was then that she informed us that you had to get new keys every freaking day! Imagine that. No reason what so ever for another inconvience, not to mention they dont even have vending machines!", "title": "Dont stay here!", "user": "bradboston44", "date": "September 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 44569079}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "We booked 2 rooms to stay at the Econo Lodge over the September long weekend. We were greated by a please lady that was working the front desk and we thought we were off to having a great stay. We could not have been so wrong...", "title": "Hot water should be a basic in North America... no contractors on the weekend???", "helpfulness": 1, "user": "Cattamaran", "date": "September 25, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 44449546}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The next morning we go to have a shower and we find out there is no hot water... I phoned the front desk and they said the hot water was not working in the entire area. We did not get frustrated as maybe that was the case and that was out of the control of the hotel. We check later on that night and they say the hot water is now working but when we get back to our room we discover that it is not working yet again. We phone down to the front desk to discover they know it is still a problem and don't know when it will be fixed.", "title": "Value Location Service, everything FREE", "user": "SavvyTraveler411", "date": "September 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 42493137}], "location": {"country": "United States", "city": "New York City"}, "stars": 2, "variance": {"poor": 30, "average": 98, "very good": 255, "terrible": 31, "excellent": 150}, "aka": "Econo Lodge Times Square Hotel", "slim_ranking": 0.47855530474, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 5.0}, "description": "Econo Lodge Times Square Hotel in New York CityThe Econo Lodge® Times Square hotel is ideally located at 47th Street and 8th Avenue in the heart of New York City's Times Square. Imagine staying close to everything you want to do and see when visiting NYC! As our guest, you will have easy access to the city's most famous attractions, including the Broadway Theater District, Radio City Music Hall, Empire State Building, Central Park and esteemed Restaurant Row. You will be within walking distance of Rockefeller Center, Madison Square Garden, Jacob K. Javits Convention Center (Javits Center), Fifth Avenue shopping and more. Our location is unbeatable! Hotel features include free wireless high-speed Internet access and free continental breakfast. All of our guest rooms include flat-screen televisions with satellite programming including premium channels, safes, hair dryers and iPod docks. Take a look at our room types and choose the one that best suits your needs. Whether traveling for business or pleasure, the Econo Lodge Times Square hotel in New York City provides superior accommodations and affordable rates to everyone visiting the area. Our friendly staff looks forward to seeing you soon."}