{"user_rating": 4.5, "review_count": 240, "name": "Eden Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "For us it was perfect! Stayed here for a week, B and B. Friendly helpful staff, fabulous service, cool modern decor, big comfy beds, decent wardrobes with loads of hangers, great bathroom, ( with a bidet too) air conditioning that really worked, fabulous view from balcony over the stunning lake. Breakfast on the terrace, (huge choice from the buffet) and everywhere is immaculately kept. Its right in the middle of Sirmione by the ferry terminal and main square. Noise at night ? Not a problem, with the balcony door open we heard people in the cafes enjoying themselves, but not in a rowdy way, close the door and use the air con and we never heard a sound, slept like a log. There is no pool and no real garden so perhaps not ideal for children, but a fabulous hotel and we would definitely go back.", "title": "Absolutely loved it !!", "helpfulness": 3, "user": "sandyCornwall", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130101718}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I spent 4 nights here as part of my honeymoon and I cannot say enough about the place. The service was fantastic every time you asked a question the staff had an answer or else found an answer for you. The rooms although not huge are comfortable, we opted for the Lake View room and it was lovely to sit on the balcony watching the world go by.", "title": "Fantastic Service, Great Location", "helpfulness": 3, "user": "corcors", "date": "May 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129675437}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "This hotel is located right in the heart of Sirmione surrounded by fabulous restaurants and perfect for sightseeing, we could literally see the ferry stop from our window, despite the central location there are no noise issues.", "title": "Superb hotel and superb staff", "helpfulness": 4, "user": "LondonSLR", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129594922}, {"rating": 5.0, "title": "A dream to stay in !", "text": "We travelled on to Venice after Lake Garda and stayed in a well known 5 Star hotel, paid twice the price we did here and it was not a patch on Hotel Eden.", "helpfulness": 2, "user": "Rebecca H", "date": "May 2, 2012", "id": 129224367}, {"rating": 5.0, "title": "Relaxing location", "text": "Would recommend to anyone", "helpfulness": 5, "user": "Global_Picturetaker", "date": "April 25, 2012", "id": 128593700}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We've just returned from a holiday in Sirmione having stayed three nights at the Eden Hotel. Having just undergone a refurbishment it is in pristine condition. Our room was extremely comfortable with plenty of room and an immaculate bathroom with a brilliant power shower. The breakfast was delightful and the staff very friendly and helpful.A beautiful and tasteful boutique hotel. The hotel is located in the old town and very easy to find on arrival. It sits beside the port and the main piazza and is not in the least bit intrusive. Sitting on our balcony overlooking the square and the lake, reading, relaxing and watching the world go by with a beautiful sunset at the end of the day. Superb!", "title": "First Class Hotel", "helpfulness": 4, "user": "Delighted39", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127576190}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Both Sirmione and the Hotel Eden were unexpected highlights of our holiday. I will be honest - we were basically just looking for a place to stop between Lucerne and Venice. However, Sirmione was more than we expected. From driving through the historic gates into the \"old town\" to the beautiful Hotel Eden perched right on the lakes edge. On top of the location and view the staff were some of the nicest we came across - very accommodating. If they had a pool I would have found the perfect holiday spot.", "title": "Highlight of our holiday", "helpfulness": 7, "user": "David O", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125172244}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed in this hotel in June after friends recommended us. The hotel had just undergone a complete refurb which was all very tastefully done. The rooms were clean and comfortable with lovely views of the lake. All very romantic. The weather was a little off colour and mostly rained. However the hotel staff thought of everything and provided brollies with plastic carrier bags.", "title": "Ticks all the boxes", "helpfulness": 2, "user": "Woolfords", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121896175}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The restaurant was well organised and breakfast on the terrace overlooking the lake was very pleasant - just sit and watch the world go by.Nothing was too much trouble for the staff to make our stay a good one.", "title": "Gem of a hotel, right on the lake", "helpfulness": 2, "user": "Treborvfr", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121588839}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The location was ideal right by the main square and facing the ferry pick up.", "title": "Great Hotel in Exceptional Location", "user": "hmhlondon", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121025994}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Newly refurbished hotel offering a good breakfast and helpful staff. Noisy cleaners early in the morning.", "title": "Waterfront gem", "user": "Richard187257", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120190083}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Well, what a difference 18 months makes… We already loved this hotel when we stayed in May 2010 and now it’s even better following a total refurbishment – we got a very pleasant surprise when we arrived in September this year.", "title": "Refurbished - now even better!", "helpfulness": 2, "user": "maudsters", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119565277}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Same wonderful staff, location, lake view, breakfast and afternoon tea as before – but now with lovely fresh new décor!", "title": "Great Hotel!!!", "helpfulness": 2, "user": "lee c", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119364162}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We were in room 111 on the first floor, which overlooked the main piazza and ferry point. No balcony in this room but there’s a lovely lakeside terrace and sunbathing deck to relax on. Our room was quite spacious and had two nice comfy chairs, a large wardrobe with plenty of hangers, drawers, a safe and a mini-bar. The prices of the drinks in the mini-bar were reasonable: €2 for water, €3 for coke, orange juice and tonic water, €9 for half bottle Prosecco and €2 for the snacks (there was also beer in the fridge but no price on the list).", "title": "Hotel Eden, Sirmione", "helpfulness": 1, "user": "dotg1947", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118951364}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The bathroom was not particularly roomy but you could fit an average family in the super large shower. Toiletries provided: body wash, shampoo and soap. There was also a shower cap and 2 pairs of slippers. The shower was fantastic with excellent pressure.", "title": "Very nice hotel with perfect view over Garda Lake", "user": "Olga_from_Denmark", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118657029}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed 2 nights in May '12. Excellent hotel in all respects.", "title": "Excellent Hotel", "helpfulness": 2, "user": "carlstef", "date": "June 10, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131679709}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Getting in and out of Sirminone in tourist season can be a challenge. Call ahead to the hotel to make sure there are no restrictions. If I had it to do again, I would have stayed there on weekdays, not weekends. The only way into and out of the town are via a 1 small lane portal. Every street extremely narrow and is thronging with tourists. It is like driving thru a sea of people. But it is clearly do-able.", "title": "Beautiful Outlook", "helpfulness": 2, "user": "Elizabeth_David_12", "date": "May 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130658987}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "You clearly don't need a car once you are there. Hotel has 3 parking spaces, or pay 10 Euro to park in a garage, or park for free at their sister hotel (15 min walk).", "title": "Just right for a stop over", "helpfulness": 1, "user": "wajago", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130617243}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We booked a Junior Suite, which was clean with basic ,minimalist style furnishings. The view over the water from the small balcony was lovely. We appreciated the placement of the hotel on the waterfront and at the doorstep of the many restaurants, cafes and specialty shops within the castle walls. What we didn't appreciate was the inconsistency in attitude and level of service from the staff. The gentleman on reception when we arrived was helpful and personable, booking a table at the sister hotel's restaurant, where his brother works, for dinner. Each encounter with him held the same friendly level. Returning to the hotel one evening we were met with hostile glares from receptionist, an older man, and his talking companion, the waiter, when we asked for our key and a hot chocolate. The hot chocolate was delicious but we never asked for it again! The same waiter was surly at breakfast each morning. The young man who served us cocktails one evening was a delight.", "title": "Look no further!", "helpfulness": 2, "user": "stevesmith10", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130504881}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed at Eden enroute to Venice and was a pleasent surprise once we found this little gem!! The Hotel is actually beyond the wall of the castle on the penisular(you need to drive over the draw bridge) and across the first square ojn the edge of the water. The staff were polite and helpful, and the Hotel itself is just right for a quiet stay. You have a choice of either 10€ a day parking or a small drive through the old town to a free parking area, this was our choice and you got to see the shops and restaraunts on your walk back to the Hotel, The breakfast was generous with plenty of choices in buffet style, and the outdoor dining was a delight on the waters edge.It was really worth the detour off the Motorway to visit Sirmione and it´s old tow features", "title": "Wonder hotel, friendly staff, great location", "helpfulness": 4, "user": "Hau C", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 130330480}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 8, "very good": 72, "terrible": 5, "excellent": 152}, "aka": "Eden Hotel Sirmione", "slim_ranking": 0.0597014925373, "description": "Welcome to Hotel Eden, situated a short distance from the famous Catullo and Virgilio Spa Establishments, the imposing castle and Sirmione’s major attractions and highlights. This elegant Four-Star Design Hotel, which has recently been totally renovated thanks to a complete restyling of its inner spaces and furnishings, is the ideal accommodation facility for visiting Sirmione and enjoying its magic atmosphere."}