{"user_rating": 4.0, "review_count": 1713, "name": "Eden Roc Miami Beach", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "It was an ok stay. When we first checked in we were in the original hotel. The balcony was kind of scary when you looked over but really not much to see. The other issue I had is the refrigerator in the room. You needed to place ice in it to make it cold. This was not going to work for me due to the fact I was breastfeeding and need a place to store my extra milk. My husband went to the front desk and they insisted that the fridge was going to get cold eventually. An hour later still warm like the outside air. So finally, my husband went back to the front desk and they moved us to the newly renovated side of the hotel. The room was nice and spacious compared to the older room. And yes the fridge worked. The breakfast there at the hotel was amazing. There are these \"Tres leche pancakes\" you have to try to them. The pools were very clean but did crowded after 1pm. Overall It was an \"OK\" stay. I may go back again.", "title": "Eden Roc", "helpfulness": 1, "user": "mydiamondisforever", "date": "July 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 134670711}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I agree with the previous reviews. Like the person from Fairhope, AL, I too checked in on the Fourth of July. I don't know about their check-in experience, but it was a ZOO. I waited in line for what seemed like an hour. However, I'm not taking a whole lot off for this given it was a holiday and it seemed like a lot of local folks were perhaps checking in just for the night. Once I got to the front desk, I was nicely greeted by Mia and she was very helpful. Next, the elevators were old and took forever to arrive and go anyplace. But, I went up to my room and was pleasantly surprised. The room was HUGE and right on a corner, in the old tower, and it had a great view of the intracoastal waterway, or whatever they call it. The bed itself was big and clean, but not entirely comfortable. It didn't have a comforter either, which I like, but just a blanket. The bathroom was recently remodeled, very lovely and HUGE. Double sinks and a HUGE soaker tub with the jets, and rainforest shower with a wand as well. The floor of the shower didn't seem that clean but the rest of the bathroom was spotless. The food at the main restaurant was delicious, I had a fish and it was awesome, as well as room service. However, service at the cabana bar was ATROCIOUS. Literally, the first time I went I waited a full hour for someone to take my order. The good news is that I was not in any hurry, but it was ridiculous. The second time I went we literally had to flag someone down at the bar, and there appeared to be about 50 bartenders roaming around doing nothing. Service was the worst ever. However, the spa there was amazing. Very relaxing. The staff there was great. I had an amazing massage there. I can't remember her name sadly. It sounded sort of Indian, I think. Everyone was very accommodating. The facial however left much to be desired. I was sunburnt so I had the Cool and Calm which they swore would cool the skin and prevent it from peeling. The technician, I think her name was Jasminia, however attempted to use a Clarisonic on my forehead which was so painful to my sunburnt skin I nearly flew out of the chair! She was so sweet...but, my forehead peeled horribly after that. And, to top it off, they automatically tack on the customary 18%. They pretty much tack 18% onto everything, which is ridiculous. I think it is also ridiculous to charge for beach chairs. I could understand umbrellas and the portable cabanas, but come on, beach chairs? Plus, the tack on an additional 18% service charge to that. This is particularly ridiculous when the staff seemed upset that I wanted to lay out near the water. They were trying to get me to take chairs in the back away from the water so they didn't have to drag additional chairs out. And, like the other reviewers indicated, on the morning of July 5th, the bulldozers and crew came out and they ended up plowing the beach for the next few days. The staff should have warned folks when they made their reservations, or at least when they checked in. They moved the chairs etc down a little further and I was able to ignore the noise. The weather and the water were delightful, although there was a bit of seaweed near the shore, etc., which is normal. And, everyone is correct, there were about 800 Brazilian teens that totally took over the hotel, running around and giggling, like teens do. I believe they were with some Disney high school group. The good news is that they were not running around on my floor at night. The group itself should have done a better job controlling those kids. I'm not sure what the hotel could do, other than talk to their chaperones, maybe. Anyway, I gave it four stars, primarily because of the room, the spa, and the food, and the fact that I did have a lovely stay, despite the \"cons.\" It should also be noted that my friend had a room in the new tower facing the beach and it was gorgeous. I feel like my room might have been bigger, but the layout and the view of his room was MUCH nicer, obviously. If you can afford it, upgrade yourself.", "title": "Great Hotel, Holiday Weekend", "helpfulness": 1, "user": "MayorMcCheese", "date": "July 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 134656993}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "i recently stayed at this hotel friday june 29th. my friends and i attended a concert at the airlines arena and wanted to stay on the beach b/c none of us had ever been to miami before. the hotel was great. very clean, couldnt even tell that the hotel was about 60 years old or so. the pool area was awesome. they have a great happy hour which i believe lasts for 4-6. we went up there to have a drink and sit on the beach thinking that we were going to have to pay about 8-10 dollars for one beer but during the happy hour it was half that. had margaritas for about 5 so it was great value considering where your at. the staff was very kind and if you ever had any questions or concerns or any request at all they would help you out no problem. our room overlooked the bay and the beach and the view was awesome. best view ive ever had from a hotel that ive ever stayed at. we also wanted to experience the miami nightlife and the hotel is a great place to stay at if thats what youre going ot miami to do. its located directly next door to the fontainebleau hotel which hosts the hottest club in town \"liv\". great place to go, albeit, rather difficult to get into at times. anyways, its in great proximity to the hottest places to go to in town at night. some walking distance others a short cab ride. i plan on going back to miami in oct for my b day and i will be staying at this hotel and i would suggest to anyone, looking to relax, party, get away, business, or any reason at all, stay at this hotel.", "title": "great stay", "helpfulness": 1, "user": "ryan v", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134591592}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "My firm had it's annual conference at the Eden Roc last week and I was excited by the beachfront location. However, as luck would have it, the hotel was also hosting a very large group of young teens that same week. The teens spent their nights running up and down the halls, blasting music, and slamming doors well past midnight - every night. Repeated complaints by myself and many of my colleagues were met with blank stares from the front desk and management, who could only promise that \"security\" was aware of the issues. There was a total lack of control over this large group of unruly guests demonstrated by the hotel staff and management. Additionally, bathrooms in the conference area were \"overworked\" and not kept \"fresh\". Lastly, guests needed their room keys to re-enter the hotel from the beach, but the device on the door was not operating and no one could re-enter with their key. At some point, someone had to prop the gate open with a chair - great security feature! On the plus side, the meeting rooms were comfortable and the food was very good. The guest room was clean and well kept. Still, if you are unlucky with the timing of your stay, you may find it difficult to get a good night's sleep.", "title": "Hotel has no control over their guests, so - Good Luck!", "helpfulness": 1, "user": "David B", "date": "July 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 134531685}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We had the pleasure of staying in the Eden Roc Hotel after family cruise in March 2012. It is located directly on Miami Beach and has all the ammenities one needs in a hotel. The hotel staff was very accomodating and the rooms were fantastic. I would recommend asking for one that overlooks Miami Beach. You won't be disappointed.", "title": "A fantastic Miami Beach hotel", "helpfulness": 2, "user": "Kevin A", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134527036}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "Everything about this resort is gorgeous but my husband and I didn't spend anytime there. It was his first time to Miami so we were out sight seeing. I wish we would have used the money we spent on the resort for activities in Miami. We did use the pool once and the beach a few times.", "title": "Overpriced but breathtaking", "user": "amadison320", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 133870644}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Hotel was nice. Beautiful view. Negative- the valet drivers kept adjusting my seat and changing radio station in the car. Hotel shop didnt have the bare neccesseties needed. There was a descent wait on the room to be cleaned. Overall I would recommend.", "title": "Nice Hotel", "helpfulness": 1, "user": "hatedluv", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133861172}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "From the moment you check in to Eden Roc you are treated with the utmost respect from each and every one of the staff. I've never encounted the politeness and friendliness in other hotels as I did from this staff. As a Marriott Gold rewards member I was upgraded to an ocean view room - spectacular. The room itself was impeccably clean and large. Beautiful bathroom with rainforest showerhead. I was at the hotel/resort for 4 days and 3 nights for a conference. Our organization was pleased with the event and conference facilities as well. The skirt steak from 1500 Degress restaurant was delicious. Would definitely stay again at this wonderful hotel. (Note: didn't have time to use the spa or pool facilities).", "title": "Friendliest staff to be commended", "user": "NorthEndBos", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 133587003}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The property, the grounds, the pools and the rooms (Ocean Tower) are great. That being said, our room had no drawers, and it took a few hours for the front desk and housekeeping, with our help, to figure it out. The front desk was not very helpful in this case. Overall, though, I feel the staff was attentive throughout the hotel facility and grounds.", "title": "What Could Have Been.....", "user": "FHANDS", "date": "July 5, 2012", "detail_rating": {"value": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 133481465}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The breakfast was typical Marriott, and the lunch was terrific and the service in all the restaurants was terrific.", "title": "Decent stay...", "user": "Lenny G", "date": "July 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 133144676}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed at the Eden Roc over the 4th of July. Our first day on the beach was lovely. The beach umbrellas and chair package put us on the front row and the water was fantastic. On our second day, as we headed for the beach, in stead of lovely blue umbrellas, there were giant earth movers in their place backing, beeping and digging sand. Not what I expected on the 5th of July. After several failed attempts to find the new \"Eden Roc\" beach we ended up at the pool. We were finally told the concessions had been moved further south in front of the Fontainbleau.", "title": "Would have been nice if notice had been given of beach repair", "user": "suzu1209", "date": "July 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134197175}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Nice hotel, but a little notice on this planned construction site would have been nice.", "title": "Hmmm...actually pretty good!", "user": "BeachBound_MM", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 134150750}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "I stayed for a week at the Eden Roc this past July. Normally I wouldn't have chosen a place like this myslef, but my company was running an annual event (yes - Florida in the Summer - imagine!) so i didnt have much choice. I must say I was overall pleasantly surprised. The hotel is right on the beach and has 3 pools and plenty of very friendly staff. I was really impressed by the staff - all very nice and accomodating. Check in was smooth and I was upgraded to a King size ocean view room in the \"new\" tower. The room was huge, the bed very comfortable and the balcony was HUGE. The room overlooked the pool and the ocean. Overall very quiet stay and no noises of note that kept me up tossing and turning at night. The A/C worked very well, especially given there was a minor heat wave going one and the outside humidity was horrendous ... alot of really hot \"bad hair\" days for sure. The meeting spaces were all very nice on the main floors, though some of the breakout rooms in the lower level (ie basement) were stuffy and damp and a bit mildewey.", "title": "Ask for Stephanie at reception and Joey at the door!", "user": "Casita803", "date": "July 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 134140226}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I was equally happy with the on-premises food, though the choices were limited. 2 restaurants - one in the lobby and one by the pool - and one bar in the lobby. I didnt hit the pool restaurant but I did eat at the lobby one, called 1500 degrees. Excellent food. And most surprising of all the room service food was terrific. The roast chicken was superb and the key lime pie some of the best I ever had.", "title": "Beautiful pool area but...", "user": "nboyd95581", "date": "July 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 134081306}, {"rating": 5.0, "title": "Beautiful grounds, lovely staff nice time", "text": "As with most places I stay I always find a few things that annoy me - here the lack of a garbage can in the sleeping area of the room (though there was one in the bath room), the toilet that flushed itself frequently (despite calls to the front desk and visits from engineering (which did fiux the problem for a time)), the lack of a desk lamp and generally not enough light (or is that my aging eyes?) all irked me, but not enough to warrant the reduction of the 4 stars I give in the rating.", "user": "just2eazy4me", "date": "July 10, 2012", "id": 134064931}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed at this location after flying in from Cancun resort...perhaps not the best decision, so this is admittedly a bit biased. Still, the entry way, pools, and hotel common areas were very nice. The room showed some age and was just okay. There are more nicely appointed rooms in hotels that are less expensive. The beach wasn't bad, as the hotel had it's own designated area, but there were bull dozers and heavy equipment moving sand and structures etc when we got there. The earth was literally shaking as the equipment moved by. Don't know how long the construction will be going on, but definitely a draw back for now. Also no restaurants within walking distance other than hotel restaurants. Not a bad property but shop around.", "title": "Nice location, average room", "user": "MWP98", "date": "July 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134323855}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I was here for 5 days in June and loved it. Although, initially I was leaning towards staying at the neighboring place (Fontainebleau), I think I made the right decision in staying here instead. I believe that Fontainebleau is more grand and happening than Eden Roc, and I visited it often as some of my friends were staying there, but it was too grand and too expensive (or with too many temptations to make you spend your money and then feel remorse... possibly). Eden Roc was grand and not inexpensive either but probably more elegant and quieter. I enjoyed it more. There are lots of things to do with their \"private\" beach area, lots of swimming pools, nice bar, etc.", "title": "Great Place to stay", "user": "bondj303", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134306582}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The room I had had a beautiful view of the Atlantic ocean with a nice terrace-balcony with sitting area including a lounge chair. The room decor was very pleasing and contemporary and the bathroom as well as bathtub were modern. I really loved the shower and it always started my day right. Although there was a coffee machine in the room, I generally used the Starbucks in the lobby (somehow I have developed insane amount of liking for Starbucks coffee). A good morning shower and a good morning coffee always started my say right.", "title": "Good Hotel", "user": "DCBATS", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 134264466}, {"rating": 4.0, "title": "Great stay in Miami Beach", "text": "In evenings, it is very pleasant to walk on the beach. I enjoyed some nice strolls in the sand.", "user": "Michelle D", "date": "July 12, 2012", "id": 134239544}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Didn't get to use the restaurant much. I found the staff helpful and courteous.", "title": "Pricey, but nicer than expected. Great getaway.", "user": "Susan V", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 134213397}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "There are a lot of things I liked about Eden Roc, and a few I would change. I stayed in the Ocean Tower in an Oceanfront King room, which was gorgeous. Room was huge, balcony was beautiful, and the view was to die for. The bathroom was massive, which I loved.", "title": "What a gorgeous view!", "helpfulness": 1, "user": "RunCatchKiss", "date": "December 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 187877647}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The property itself is gorgeous, newly redone, very glitzy-looking. I stopped in at 1500 Degrees for breakfast and it was INCREDIBLE. I had a lobster marinara something or other on an English muffin, and it was possibly the best thing I've ever eaten for breakfast. Service was attentive, and the atmosphere was tranquil (which is a nice way to start your day).", "title": "Great stay, beautiful hotel, fantastic staff", "helpfulness": 2, "user": "Jeff K", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187823302}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "My one main quibble is their second restaurant, a more casual one that overlooks the beach. I arrived around lunch, and this was the only one open, so away I went. I ordered the ceviche, but when it arrived all three supposedly different varieties tasted the same. Unfortunately, the only thing I could taste was lime juice. Hoo boy! Face-puckering amounts of lime juice. The waitress was very gracious in taking it back after seeing me eat a piece or two and leave the rest, which is a point in their favor.", "title": "Awesome Stay", "helpfulness": 1, "user": "Paul R", "date": "December 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187725632}, {"rating": 3.0, "stay_parameters": "Stayed December 2013", "text": "I wish there were a few more restaurant options, or that 1500 was open for lunch as well.", "title": "Nice resort but it all depends on what you want ..", "helpfulness": 1, "user": "NRamsoomair", "date": "December 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 187668511}, {"rating": 5.0, "stay_parameters": "Stayed December 2013", "text": "We just stayed again at the Eden Roc Miami and had a great time! Hotel is spotless (and smells great!), rooms are impeccable. Staff of all levels tremendously helpful from Daryl on the beach (nice beach) to Hannah, Michael, Chris, Patricia and others at the outdoor Cabana Beach Club bar/restaurant to Paulette and Jamie indoors. Have met wonderful couples at the CBC from all over US to Australia. Workout facility been updated and is very good. Spa is something else. Beds could be some of the most comfortable we ever slept in/on. Breakfast Buffet will help you forego lunch; very good food throughout the Hotel. Certainly more relaxing than next door or being in the middle of SoBe. But in less than a 5 minute cab ride down Alton you’re at Lincoln Rd and then further South into SoBe if you want to spend time down there. Going back to Eden Roc again very soon.", "title": "Hotel Inspector Approved!", "helpfulness": 1, "user": "Gilda B", "date": "December 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 187658301}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled solo", "text": "The Eden Roc is a wonderful hotel. I was there for nine nights visiting Miami Beach, and the area. If you know one of the old I Love Lucy episodes, Lucy and the gang stayed there. However, the hotel has been quite updated. I was in the new tower with an ocean view. Enjoyed it. Great staff, especially in the 1700 Restaurant and Cabana Beach Club. Would stay there again.", "title": "Great stay", "helpfulness": 1, "user": "Richard M", "date": "December 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188076376}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We just returned after staying at Eden Roc for the 5th time. Because we live in New England we venture to FL any chance we can to escape the cold temperatures and snow. Staying at Eden Roc is more than a hotel; it’s like going to a relative’s house for the weekend. The Cabana Beach Club staff are some of the friendliest, attentive, and most welcoming. We consider them friends and look forward to seeing them on our return trips.", "title": "Beautiful hotel, fantastic staff and amazing amenities", "helpfulness": 1, "user": "Jen G", "date": "December 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188068383}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The fitness center is amazing, one of the best if not the best hotel fitness centers in that area (Collins, Washington, Lincoln and Ocean Drive). In addition to the newly renovated fitness center and spa which are amazing, they have a lap pool. I train for triathlons and Eden Roc has everything I need to continue my training while away from home.", "title": "Awesome stay great hotel.", "helpfulness": 1, "user": "Diana W", "date": "December 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 187964609}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "I’ve stayed at numerous hotels along Collins and even Ocean Drive and Eden Roc has the most comfortable beds, GREAT views from every room I’ve stayed in at Eden Roc. Your shower even has a view of the ocean. The hotel is immaculate, the grounds are immaculate and the staffs are the friendliest and most helpful from greeting you at the door to setting you up on the beach.", "title": "Great hotel, Amazing stay, Awesome views!!!", "helpfulness": 2, "user": "MonaLou78", "date": "December 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187930722}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "I will return soon and can not wait!", "title": "The epitome of Hospitality", "helpfulness": 1, "user": "Seminoles89", "date": "December 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187899548}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "My wife and I came in for a quick visit to get away from kids. We checked in early on a Saturday morning - and things were very quiet - and were surprised to get a room right away - although - it wasn't that great of a room - it was in the \"original\" part of the hotel - with no view - other than of the newer tower next door - but we were tired so that's ok.", "title": "Some Good - Some Bad", "helpfulness": 1, "user": "defore4735", "date": "December 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 188381327}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The room was fine - and even though we were on the canal side - things were relatively quiet. There's not much too the room as it relates to amenties - but I guess most people in Miami plan on being on the beach or at the pool - NOT the room.", "title": "Great Weekend Away", "user": "Tonibella", "date": "December 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188314454}, {"rating": 5.0, "stay_parameters": "Stayed December 2013", "text": "The Good -", "title": "Perfect location, great service, highly recommended!", "user": "Emily03820", "date": "December 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 188227991}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "Room was clean", "title": "Relaxed and Reasonable!", "helpfulness": 1, "user": "Noah K", "date": "December 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188227406}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Paid $100 to stay an extra few hours before catching our flight - checked out at 3:30.", "title": "Good hotel, good staff", "helpfulness": 1, "user": "ManishLGupta", "date": "December 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 188145335}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The quality of service we encountered at the Eden Roc was on par with the best hotels in the world. The staff was extremely profession, ever-present but not overbearing, and extremely pleasant. Overall the hotel was very very good. We stayed in the newer Ocean Tower, which we would definitely recommend. the rooms were in very good shape and had high quality modern furnishings. Get a balcony overlooking the Atlantic if at all possible.", "title": "Superb service", "helpfulness": 1, "user": "dkmr", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 188598926}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We went to the resort with the desire for a quick and close getaway (we live in West Fort Lauderdale). Our expectations were low knowing it is an older hotel but we were pleasantly surprised with the renovated and spacious rooms. We were in the \"newer\" tower of the hotel and very pleased with the room and large balcony. The front desk and check in area is a bit frustrating. The long lines and lack of personnel servicing the desk,only two employees,was not a great first impression for guests checking in to the hotel. However, the staff was efficient and accomodating at check in once you made it thru the long line. Since we know Miami we did not have to rely on the concierge for help with dinner reservations. The valet service was terrific! Even though there was alot of hustle and bustle in the driveway of the hotel our car was always delivered timely and with friendly service. It did help that we would call from our room to request our car before we went down stairs. The pool area is nice,the beach is very small but the staff was very polite and set up beach chairs and umbrella's to make it comfortable. We loved having Starbuck's in the lobby of the hotel! Joe, our Barista, made delicious latte's and handled the crowd with great service and a smile. A great three day getaway.", "title": "Great Resort - and Starbuck's too!", "helpfulness": 1, "user": "pbg627", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 188557319}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "With a storied past, the hotel has been well updated and modernized. Although I do have a lot of questions for the interior designer like why would they have licensed Knoll Bertoia chairs but then the cheapest ugliest rendition of an Arne Jacobsen Egg chair is beyond me! They are obviously trying to attract the young jet set from South beach but with subpar furnishings and detail?? On the design front, I also don't understand the 5 different looks of poolside furniture all mixed together.", "title": "Relaxing & stylish -needs upkeep and staff training", "user": "seekay03", "date": "December 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 188494110}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "There is nothing worse than modern design not being up kept. The hotel is already showing signs of wear throughout. The ceiling in our bedroom was half primed and had patches of plaster and tape half done. Door jambs were spray painted shy of a few inches off the floor and there were gouges in the walls and chips on mirrors. I would hope that they get to work on this before it starts to look too shoddy. It looks like a party hotel.", "title": "Great resort", "helpfulness": 1, "user": "BenSkitt", "date": "December 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 188453776}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "About the experience... As I travel a lot, i get to experience how different hotels are run. Although I appreciate the independent operator, that can go two ways. Either you will get impeccable personalized service, or they just have no idea what they are doing. The hotel is the latter, with staff tripping over themselves trying to figure out heads or tails. Nobody knows anything about the hotel, how to get you anything or how to provide service to guests. Our check in took almost 3 hours, having to go back and forth with the online booking company. It seems that after a couple of hours of negotiation, the hotel admitted that the room type we PREPAID for was sold out. We were then graciously upgraded to a penthouse suite, but it was hell getting to that point. The bell desk near the front door, has a bunch of guys loudly complaining about experiences with guests for all to hear. if you were to dare call down for anything, say a rollaway, after umpteen phone calls, it could take over an hour. On check out, should you call down for baggage service, 45 minutes later, they will tell you that they never received a call from your room number.", "title": "Perfect Weekend Aniversary Celebration", "helpfulness": 1, "user": "C R", "date": "December 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188381657}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 4, "variance": {"poor": 94, "average": 238, "very good": 586, "terrible": 69, "excellent": 726}, "aka": "Eden Roc, a Renaissance Beach Hotel", "slim_ranking": 0.209183673469, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Overlooking the world-renowned Miami Beach, Eden Roc Miami Beach embraces its role as a timeless treasure, yet welcomes guests with a gracious, new contemporary spirit. Guests can luxuriate in spacious rooms & suites, bask in the sun at one of four refreshing pools or claim a chaise lounge on the beach to watch the waves roll by. Enjoy 1500 Degrees, dine beachside in Cabana Beach Club, seen and be seen at the Lobby Bar and grab a little pick me up at Starbucks. Discover our sanctuary for your senses with the first ever ELLE SPA at this premier Miami Beach resort."}