{"user_rating": 4.5, "review_count": 199, "name": "Edenia Punta Soberana Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "After arriving to the freezing temperatures of El Calafate, it was such a delight to walk into the warmth of the Edenia Puento. On arrival we were greeted by Mateo, who I must say, really made our stay very memorable. He was the most amiable person we have met on our travels to date, he was such a pleasure to deal with and incredibly helpful. Mateo offered us a welcome drink which we thought was a really lovely touch. The hotel was roasting hot so it felt very relaxing having a drink in the front bar while the freezing temperatures remained outside!", "title": "A cosy hotel with first class service", "user": "mgirishrover", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 77488687}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We booked into a suite which was very spacious and extremely comfortable. The bedroom was large and along with the living room area, overlooked the lake to the front of the hotel which was beautiful, the rugged landscape adding to the view. The bathroom area was divided into two sections – one with wash hand basins and bathtub/Jacuzzi and the other with the toilet and shower. The suite really represented good value for money.", "title": "Pretty but not perfect", "helpfulness": 4, "user": "theTraveLees", "date": "August 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 77013702}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The hotel is approximately 7 kms from El Calafate however they provide a free shuttle bus service going to and from the centre of town. Staying out of town isn’t a problem, if anything it forces you to be a little more organised with your time which isn’t always a bad thing! Alternatively, a taxi from the town isn’t too costly either.", "title": "The best customer service - would stay again", "user": "BB0777", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 73224708}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The breakfast was basic offering very little choice. We didn’t bother getting up for it the last 2 mornings, however, if it’s just a light breakfast you’re after then it will prove sufficient.", "title": "amazing service - friendly staff and great value for money", "user": "DeborahELondon", "date": "March 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 59988889}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "I would highly recommend this hotel, its great value for money and the service is incredible. It has a very relaxing feel with truly breathtaking scenery.", "title": "NOT FOR THE INDEPENDENT TRAVELER", "helpfulness": 2, "user": "kmjmmm", "date": "March 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 59776956}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I cannot give this hotel less than 3 stars because of the fact that it was clean, had beautiful views, and was comfortable. However that being said, we came to this hotel with extremely high expectations. I had read so many reviews of amazing and attentive staff and when we arrived, we dealt with a blonde woman we believe was named Leah. She was cold and unfriendly to the point that if we had questions we waited until we got into town and asked elsewhere rather than having to have more interactions with her. Its a shame because when booking I had dealt with someone named Pascal who was super nice, we just never really got to meet him there.", "title": "Awful staff", "helpfulness": 1, "user": "Debbie090", "date": "February 27, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 57270288}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Also, while we knew we were booking a hotel further from town, it turned out to just be an annoyance for us. We would have much rather stayed in town. The shuttle came once an hour and the ride was about 20 minutes long. Again, not a huge deal but an annoyance for us because you have to schedule everything around the shuttle.", "title": "Quiet, peaceful and close to nature", "user": "lighton_10", "date": "February 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57226431}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "tips", "title": "Great Place to stay in El Calafate", "user": "gotomexiconow", "date": "February 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 57160609}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "THE BIG ICE TOUR!!! we loved it!", "title": "Located just outside of town, modern, well equipped base for visiting El Calafate/Perito Moreno Glacier", "user": "lostfisherman", "date": "February 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 55464918}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Eat at pure vida. we loved it there. very low key earthy vibe with great food", "title": "Stunning location, fantastic welcome, great value", "user": "SJY1", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55424650}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I would not hesitate in recommending this hotel. On arrival your luggage is whisked away to your room whilst you are sat down, in the very pleasant bar/lobby area, with a glass of champagne.", "title": "Outstanding Service", "user": "aevans64", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54534680}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Rooms are fine, bathrooms lovely - great shower, huge beds. But (and this is the only \"but\"), my partner and I found the walls thin and sound proofing poor. We could hear voices quite clearly through the walls and when the neighbours baby was crying, sleeping would have been impossible. We found ear plugs were essential - with these in-situ we slept soundly!", "title": "Very Good Hotel and Excellent Value - But not a Luxury Hotel", "user": "acoustesh", "date": "January 26, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 2.0, "service": 2.0, "rooms": 5.0}, "id": 54461830}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We ate in the restaurant one night and were impressed. I had the Patagonian lamb stew which was delicious. Fiance had the Steak - also very good, reasonable and not too expensive wine list and of the course - amazing views of the turquoise lake and the odd iceberg!", "title": "Amazing service, beautiful views, highly recommended", "user": "rachelchitown", "date": "January 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 54229027}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Matteo on the front desk it the best example of a hotel worker I have ever encountered - above and beyond helpful. The shuttle is also very reliable and convenient. Overall: beautiful location, exceptional service, nice accomodation.", "title": "Magnifico! Good combination of modern amenities in a rustic setting.", "user": "tcsmint", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54190301}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel is clean, nice, spacious rooms and the rate is very reasonable. I would recommend it i if you have a car. El Calafate is a nice town and the Hotel is 20 minutes away driving in a beautiful but not so special place. Inside the rooms of Edenia you feel like in an american Hotel, which is nice but maybe not what you want in a Patagonian Experience.", "title": "Great hotel - if you have a car", "user": "Mitch1978", "date": "January 16, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53610338}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Location: Catering to the tourist industry, El Calafate has a large number of hotels of various sizes for a wide range of budgets. Most hotels looked quite nice from the outside. Most hotels are within the small town of El Calafate. The Edenia hotel is situated on the outskirts of El Calafate town, on a peninsula by a huge lake. The location on a hill overlooking mountains and lake is beautiful, wild and windy. Sunrise and sunsets from the hotel are spectacular. It is only a 15 minute ride into town on the hotel's hourly shuttle bus (departing on the hour, and returning at 30 minutes past the hour), so don't be put off staying here because of negative comments about the location. Actually, I preferred the location outside of town away from the noise and traffic of main street.", "title": "Comfortable base in a beautiful landscape", "helpfulness": 1, "user": "GlobalVenturer", "date": "March 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 59541846}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Food: The breakfast buffet at the hotel is more than adequate, and the \"box lunches\" provided for tours, although not exciting, are sufficient (i.e. a sandwich, cookie, apple and drink). In the 3 days we stayed at this hotel, we had dinner once at the hotel and twice in town. The hotel dinner was well cooked and tasty, although the limited menu offering the same choice of beef, fish, chicken, pasta or vegetarian each night would become boring. Wine and alcoholic beverages are reasonably priced. The two nights we ate in town (I recommend La Tablita) we decided not to wait for the return shuttle and took a taxi back to the hotel instead. Ask the restaurant to call a cab before you leave, or wave one down in the street or go to the taxi office, if you prefer a walk through town after dinner). The ride back to the hotel costs around AR$20 (about US$5) including tip, so no need to wait for the hotel shuttle.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "kpatel80", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 58771379}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Room: The bed was comfortable and the room is nicely furnished. No English TV channel. However, despite the hotel's remote location, be sure to ask for a room with a view of the lake. As the hotel is partly dug into a hillside, some rooms at the back get no view at all, facing a mound of dirt. We were told the lake view rooms were unavailable but were given a ground floor room overlooking the parking lot, which had views back towards the town and the distant mountains. For the amount of time we planned to spend in the room, this was fine.", "title": "worth being a bit outside of town", "user": "basscomp", "date": "March 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 58159501}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Staff: The staff, like all people we met in Argentina, are very friendly and helpful. They helpfully directed us to excellent shops in town when we had to book tours or to buy warmer clothes etc.", "title": "Outstanding service", "user": "yns_10", "date": "March 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57832461}, {"rating": 5.0, "stay_parameters": "Stayed February 2010", "text": "Miscellaneous: The hotel represents good value for money and is a nice place to base yourself while touring the glaciers. My only complaint is that despite being cold outside, the room was a little too warm for me, and there is no air conditioning. The bathroom floor is heated, which is nice when getting out of the shower, however, it cannot be turned off and ends up overheating the room. We had to sleep with the window open to maintain a comfortable room temperature. Another gripe is that the shower over the bath had a nylon shower curtain that stuck to you when you are in the shower.", "title": "Best Hotel on our Trip", "user": "Escape01", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 57365638}], "location": {"country": "Argentina", "region": "Patagonia", "continent": "South America"}, "stars": 4, "variance": {"poor": 2, "average": 15, "very good": 52, "terrible": 0, "excellent": 130}, "aka": "Hotel Edenia Punta Soberana", "slim_ranking": 0.253521126761}