{"user_rating": 4.0, "review_count": 59, "name": "Edgewater Inn", "reviews": [{"rating": 5.0, "title": "Charming", "text": "Some friends and I just went to Biloxi for a weekend getaway and weren't originally going to stay at this hotel, we had originally intended on a camping trip, but when we decided against camping, this was the only pet friendly hotel we could find. We were so glad we found this hotel! It's right across the street from the beach and down the street from beau rivage, hard rock casino and next door to treasure bay casino. The staff at this hotel was extremely friendly and accommodating. We had a ton of food in a cooler already for a bbq at the campground so the hotel let us use their grill they had. The rooms were very clean! The pool was so relaxing and the courtyard and pool area had a Mediterranean feel to it. We all decided to make this weekend trip to Edgewater a monthly deal.", "helpfulness": 1, "user": "MrsB3212009", "date": "June 8, 2008", "id": 16760624}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We spent a week at the Edgewater Inn in Biloxi and it was great! The staff was wonderful and the room was great very clean. The bed was very comfortable. We were not supposed to have a room with a view but when we arrived the woman at the front desk upgraded us to one because we were staying for five days. I would definately stay at this hotel again.", "title": "Great hotel", "user": "ladybug12345", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16758525, "likes": {"liked": "— Clean room and friendly staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "Or group, The Travelers Social Club, from Augusta, Georgia, sponsored a gambling trip with a group of 43 people to Biloxi and we stayed at the Edgewater Inn. The rooms were very comfortable, the staff was very professional and friendly. I was in the Sun Deck Suite, and let me tell you, it was just like home; two bedrooms, two baths, living area, full kitchen. We also had access to a Conference Room that can hold about 50 people which we used for a little dinner party for our group. The staff was very helpful and provided us with whatever we needed.", "title": "Edgewater Inn is simply marvelous", "helpfulness": 3, "user": "MillenGAPeach", "date": "March 14, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7163335, "likes": {"liked": "— Price, Location, Cleanliness, Comfort, staff cooperation", "disliked": "— nothing"}}, {"rating": 1.0, "title": "Don't go here", "text": "There were no complaints from anyone in our group; everyone was very satisfied with their stay there and we got very good group rates.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 10, 2005", "id": 3752459}, {"rating": 3.0, "title": "nice rooms, but overated", "text": "I will be booking about three trips this year, or more if possible, and I will reserve rooms at the Edgewater Inn each and every time.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3643808}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Stayed at The Edgewater Inn while in Biloxi for a dog show. Checked in on May 30th and out on June 3, 2012. We were in a non-smoking room on the ground floor in the back. We had a nice double with kitchenette and had plenty of room. Room was nice and clean had plenty of towels and staff were all friendly and concerned that we were comfortable. It is an older facility so it was a bit noisy but running the AC at a low temp to keep it running blocked out the noise.. The friend that was with me froze but I like it cold anyway! :-)", "title": "Close to Coliseum", "user": "Patti G", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131766480}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "There were a lot of people hanging outside their rooms smoking and it caused us to smell the smoke in our rooms. I feel like they should possibly designate smoking areas. That would help. When we did tell the office we were bothered by the smoke and noise they took care of it promptly. So I have to say, all in all it was not bad. It is right across the street from the beach too!", "title": "Don't be fooled!!!", "helpfulness": 1, "user": "NOLAZoe", "date": "June 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131707238}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The staff make this place! Did not meet one unfriendly person on their staff.", "title": "One of the best hotels on the Coast!!!", "helpfulness": 1, "user": "Cindy L", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130904750}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "When I reviewed this site for information, it appeared to be a great looking place. When we arrived, it was not what we expected. It is a motel with dated furniture that needs an upgrade. The carpet needs to be replaced as well. I would not recommend this motel for a couples weekend get away:(", "title": "Splendid motel", "helpfulness": 1, "user": "KKG22241", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130016514}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I spent one night in Biloxi on a business trip and stayed here last month. The staff was friendly and the owner, Bob, was very helpful! The room was spacious, clean, and comfortable! The location is very central to everything including casinos, numerous restaurants, and the beach was across the street! I'll have to bring my family to Biloxi this summer and stay here again. Hopefully, we'll get a minute discount for being repeat customers! I would highly recommend the Edgewater Inn to anyone who travels to Biloxi whether it's a family vacation, reunion, weekend getaway, or on business trip.", "title": "Better than some casino hotels!", "helpfulness": 1, "user": "kjvangie", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126795642}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The place was O.K.,nothing special.Not a top 5..The good was the very nice front desk ladies.The rooms were clean but showing some wear.No elevator ,so beware of the third floor.In the room were only two towels and two wash rags.Not enough....Not even towels by the pool.....Noisey in the morning.Not worth the money they're asking in my mind.", "title": "nothing Special", "user": "harleybonz", "date": "July 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 33913923}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "The staff was very curtious and helpful with every need we had. They brought my faxes to my room before I could get them myself and provided all information requested from them. I could not ask for better service or response to things we were in need of. The room was very clean and spacous. It was located across from the beach and near various attractions. We were able to take care of our business and enjoy the coast. I would highly recommend staying here for all your travel needs. Definately a great place to stay.", "title": "We were very pleased with our stay.", "user": "WandaMs", "date": "February 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24679526}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "I made this reservation at the last minute for New Year's Eve. This was the only hotel that I found still with vacancy. I read the reviews and they seemed ok but the 2 star review given by tripadvisor.com really scared me. My mother and my boyfriend's mother got a very spacious room with a kitchen sink in it. I wouldn't recommend the hotel for older people because there is not an elevator and the stairs are a little dangerous. The room were extremely clean. The people at the desk when we arrived, were sitting in for the regular desk staff due to the New Year so the customer service was not the best. They were nice but one of the guys was getting extremely frustrated because he couldn't figured out something in the computer. The hotel put a New Year's welcome package with champagne, hats, etc. which was a very nice and free gesture. This is definitely not a honeymoon or romantic getaway, is an affordable place to stay if you are going to spend most of your time at the casinos. The walls are very thin so you can hear a lot of the noise happening in the parking lot.", "title": "Unexpected Pleasant Surprise...EXTREMELY CLEAN", "user": "soldevep", "date": "January 2, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 23204243}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Overall this was a good EXTREMELY CLEAN hotel, definitely more than two stars. I imagine that the two stars is because of the lack of an elevator and the noise but who goes to Biloxi to stay in the hotel 24/7? Definitely not us.", "title": "Excellent", "helpfulness": 1, "user": "mmtorro4", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19120171, "likes": {"liked": "— The area, and employees", "disliked": "— Would have liked for it to have a work out room."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "I was in Biloxi on business for a month. This hotel was exceptional. The employees were very helpful and if I needed anything it was brought to me right away. I had one of their rooms with a kitchenette area (refrigerator, microwave and sink) and there was plenty of storage space.", "title": "fabulous !!", "helpfulness": 1, "user": "farmerdon", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16832595, "likes": {"liked": "— pool area", "disliked": "— no complaints on anything"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Reservation in suite for two nights, was told it was supposed to be non-smoking by TJ. Even though we did not smoke and the room smelled ok when we arrived HORRIBLE CIGARETTE SMOKE FUMES CAME THROUGH THE DUCT WORK as soon as guests in other rooms started smoking!", "title": "nightmare", "helpfulness": 1, "user": "Gina P", "date": "March 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 126444689}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Will seek damages for second hand smoke. Loud upstairs neighbors all night long walls very thin. Guess satisfaction was not guaranteed cause all TJ said when we checked out a day early was \"sorry\" Will not stay here again and won't reccommend it. Pool was drained also courtyard crappy. Very dated Decor--The only nice thing was the bathtubs were clean.", "title": "Perfect for Us", "helpfulness": 2, "user": "craftycavalier", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115660442}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We have a special needs child and a dog and they accommodated for both. The Jaccuzzi", "title": "Great place to be on the beach", "helpfulness": 2, "user": "FunGuySantaRosa", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115019511}, {"rating": 3.0, "title": "An OK place", "text": "Suites have the balcony that looks towards the gulf, casino, restaurants and bars all within walking distance and public beaches only a couple of miles. For us this was perfect.", "helpfulness": 4, "user": "myosotis", "date": "June 16, 2011", "id": 113872816}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "The staff was outstanding in all areas they made you feel like you were part of their family and that is rare now a days.", "title": "one of the few bargains in the area", "helpfulness": 2, "user": "marieatta_pman", "date": "July 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 70731757}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband & I have stayed at the Edgewater twice before--one time when the casinos first opened on the Mississippi Coast and the other about 8 years ago for a wedding anniversary. We liked the small, family-owned feeling and enjoyed our stay each time. This past weekend, we took off on a spur-of-the-moment trip from our home in Jackson, MS. When pricing rooms at the casino hotels, the cheapest we could find was $99. We remembered being pleased with the Edgewater and decided, at $69 a night, it was worth another stay. This was our first visit to the Coast since Katrina paid her nasty visit 4 years ago. Our deluxe King room was very spacious and clean and comfortable. The staff was friendly and efficient. (Our only complaints--the bath towels were a bit thin and the magnolia wallpaper border quite dated. The blackout drapes were great, but it would have been nice to have some sheers to let a little natural light in, without totally giving up our privacy.) We were glad to sacrifice a little luxury to have more $$$ to play with at the casinos and will definitely consider staying here again.", "title": "Not the Beau, but clean, comfortable and roomy--good value!", "helpfulness": 1, "user": "WeLoveToRoam", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 47924731}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I took my teenage daughter and one of her friends down for a weekend getaway. The hotel is situated in a very good location, straight across from the beach with a casino next door. Looking forward to my next visit!", "title": "A good time!", "user": "Kissie66", "date": "September 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40370344}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "For the price you can't beat it.The rooms were clean and good sized.It has a very nice pool that stays open to midnight,which is great for the children.The casino is a short walk across the street.There is a Pancake House that shares the same parking lot.Also there is a Hooters a short walk away.Also the beach is right across the street.Everything you need in short walking distance.", "title": "Not Bad At All", "user": "harleybonz", "date": "August 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 136073125}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "I stayed at th edgewater for to nights. There are plusses and minuses...", "title": "Cute mom and pop hotel, but a few issues", "helpfulness": 1, "user": "rcm2115", "date": "July 22, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 135030402}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Pros: right across the street from one Of the nicer parts of the beach, helpful front desk staff, spacious rooms with fridge and microwave, pool open until midnight, 10% off at the waffle house next door, and free wireless.", "title": "This Old Gal Is Looking Good!", "helpfulness": 1, "user": "rajncajn", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134719940}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Cons- a few depending On your taste and needs:", "title": "Very nice hotel, great staff, confortable beds and rarest location", "helpfulness": 2, "user": "Dnll1221", "date": "June 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132192761}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "First, our room was not cleaned during our stay. Housekeeping brought by new towels, but never actually serviced the room. I found this pretty shocking--trash wasnt taken out, coffee wasn't replaced, no new soap provided, sandy floors not vacuumed, etc.", "title": "Stay here every time!!", "helpfulness": 3, "user": "Iesha D", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132053662}, {"rating": 5.0, "title": "Loved the Edgewater Inn", "text": "We took our best friends from Wisconsin to the coast. We stayed at the Edgwater Inn. I booked this hotel based on reviews I had read and the fair rates. We were very pleased with the clean and larger than average rooms. Our room also had a view of the ocean.The front desk was friendly and also prompt cleaning staff.The location was also a plus. It's set back a bit from the traffic and just a few minutes from casinos , local attractions and great eating establishments.We did day trips to New Orleans, LA and Mobile, AL during our stay but chose the Biloxi area for our hotel. We go to the coast about once a year. We'll stay at the Edgewater Inn again.If anyone has plans on making a trip to the coast, I will be glad to answer any questions.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 29, 2005", "id": 3424366}, {"rating": 5.0, "title": "Can't wait to go back", "text": "I wish everyones trip to the gulf coast could be as awsome as ours was. We stayed at the Edgewater Inn. We were there new years eve. We love the live entertainment at Treasure Bay. We wanted to drink a lil and not have to drive. We only had to walk across the street.( thats how close) Everyone at Edgewater were exceptionaly nice. The room was spotless. Not to mention the bottle of champagne and party favors that were on the table. That was an added bonus. Our stay could not have been better. We took a calling card with us when we checked out cause we will definately stay there again and again....", "helpfulness": 16, "user": "A TripAdvisor user", "date": "January 16, 2004", "id": 1553791}], "location": {"country": "United States", "city": "Biloxi"}, "variance": {"poor": 0, "average": 11, "very good": 9, "terrible": 4, "excellent": 35}, "aka": "Edgewater Hotel", "slim_ranking": 0.2}