{"user_rating": 3.5, "review_count": 137, "name": "Edward Lear Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We stayed in a triple and although we had to hike to the 4th floor, we enjoyed all the room in our place. We did have to share a toliet and shower but we got used to it. The breakfast was delicious. SO much to eat, cereal, eggs, sausage, bacon , beans, tomatos, toast.", "title": "Great Location and lots of room in our triple", "user": "ackart", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8058235, "likes": {"liked": "— location and breakfast", "disliked": "— fourth floor walk up"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This area had great shopping very close by. They had an ironing board on the bottom floor for community use. Hairdryer to ask at the desk. We loved the internet. There is a lounge area where the internet is - but it closes at 10 pm. The beds were comfy enough and the room was clean.", "title": "Great Location, Decent Enough Accommodation if On A Budget", "helpfulness": 2, "user": "VictoriaResident", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 7854348, "likes": {"liked": "— Location, Friendly Staff", "disliked": "— Needs to pay attention to deep cleaning"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My husband and I stayed here for 4 nights in June. We did not want to spend a ton of money but we did not want to stay in hostel either. This hotels location is AWESOME!!! Very safe and quiet as well. So close to the best shoping in London and minutes from the Marble Arch tube station which is very convenient as well. If you are travelling on the tube for more than 5 days get a 7 day travel card (oyster card), much cheaper and convenient to swipe in and out. The hotel staff were very, very friendly and our room was ready when we checked in early (noon). Be ware of having to carry heavy suitecases up lots of flights of stairs if you are on a high floor as they do not have elevators. Pros of the room: decent size for London, coffee and tea maker, bed was OK, room was quiet. Cons: carpet is old and needs cleaning (bring flip flops or slippers, flip flops for sure if you have a shared shower room). The bedding could use upgrading, pretty shabby. We only had breakfast one day and it was pretty decent. The free internet computer was awesome, always worked and never a long wait.", "title": "Reasonable affordable accomodations", "helpfulness": 2, "user": "wallyg", "date": "June 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7796244, "likes": {"liked": "— location", "disliked": "— accomodations"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "This hotel is a great choice if you are looking for a great location, not too expensive and can over look the run down side of the hotel. I would stay here again for sure.", "title": "Good value for money", "user": "timttrotter", "date": "March 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7162222, "likes": {"liked": "— Location."}}, {"rating": 1.0, "stay_parameters": "Stayed January 2003, traveled as a couple", "text": "Perfectly adequate and reasonably priced accomodations. The pros: its a great location...near a tube and hyde park, but out of the way just enough with lots of (relatively) cheap eats nearby. The room was clean and perfectly livable. The cons: the rooms are small and the beds are hard. We lost hot water in our shower one day and it was quickly fixed.", "title": "Horrible", "helpfulness": 1, "user": "msargent", "date": "March 13, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 7154828, "likes": {"liked": "— location", "disliked": "— cockroaches"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "I have just returned from London, staying five nights at the Edward Lear Hotel. I was looking for a bargain, and this hotel is that. My single room (no bathroom) was very small, almost a broom closet, but I knew that going in. The room was clean; the breakfast each morning absolutely delicious, and the guests interesting and fun to talk to. Many are return customers, liking the bargain and the history attached to the hotel. I was on the second floor, so be mindful that there is no elevator! The bathroom was kept clean, and yes, I did have to wait a few times.", "title": "Edward Lear is a bargain!", "helpfulness": 2, "user": "Xaris213", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6013711, "likes": {"liked": "— The price and the location!", "disliked": "— No elevator"}}, {"rating": 4.0, "title": "Exactly the Deal We Were Looking For", "text": "The staff was very friendly and helpful, especially when trying to figure out how to make a phone call. I would stay here again; London is an expensive city, and you can't beat the price!!!", "helpfulness": 9, "user": "monkman", "date": "September 18, 2006", "id": 5813168}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We were looking for a reasonably priced hotel near some friends by the Marble Arch. We wanted one with a full breakfast to cut down on our food costs. You can imagine our delight when we found the listing for the Edward Lear Hotel, just two blocks from the Marble Arch tube station.", "title": "Middle Aged Couple's experience", "helpfulness": 3, "user": "AngelaJersey", "date": "August 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 5569567, "likes": {"liked": "— convenient location", "disliked": "— position of room/no lift"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2003, traveled as a couple", "text": "We would have been willing to pay slightly more to get an ensuite bath, but none were available for our dates, so we went for the shared option. Each floor had a shower room. We were worried at first that we'd have to fight for our turn at the shower, but we never saw another soul the whole three days. The shower room was somewhat dingy, but completely functional. We were amused to discover that the window well on each stairway landing had been converted into a WC. One had a particularly low ceiling, but that just added to the experience, I thought.", "title": "Perfect Location; Great Breakfast", "helpfulness": 4, "user": "ennove29", "date": "August 3, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5552225, "likes": {"liked": "— The location!", "disliked": "— Somewhat shabby interior"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Our room had a sink and a mirror, so we didn't have to go to the stairwell to brush our teeth or anything. The plumbing is quite old, but everything was functional. The bed was fine and the room was comfortable. The hike up the stairs was a bit intense, but I'd read about that in the Frommers review, so I was prepared. Our room was at the rear of the building and it was perfectly quiet. The TV didn't work, but we hardly spent any time in the room anyway.", "title": "Very Disappointing", "helpfulness": 2, "user": "COTraveler66", "date": "July 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 5493312, "likes": {"liked": "— Location", "disliked": "— Cleanliness, out-dated decor"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at the Edward Lear Hotel for 4 nights. Location is fabulous - very central to everything. We had the quad room with bath and toilet, its worth paying extra for these facilities. The building is old like most english buildings, wonky stairs and all. Breakfast is included in your stay which was great. There is so much to see and do in London we basically just showered and slept in the room. The only thing we needed in our room was a small refrigerator for fresh milk and drinks. But compared to other London accommodation you can't beat the price.", "title": "Would definitely stay here again", "helpfulness": 3, "user": "tf1966", "date": "October 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10055633, "likes": {"liked": "— Location Location Location", "disliked": "— Stairs"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "In an effort not to go bankrupt due to our weekend in London, we selected the Edward Lear based partly on its inclusion in the DK Eyewitness Travel guide but mostly on its price. At £95/night, the Lear came in a good £25 cheaper than other options in central London. Nonetheless for the equivalent of nearly $200 we expected that it would meet a certain standard of comfort. Arriving late in the evening after a long journey, we were quite discouraged to find that while the room (room 1A) did have a shower as promised, the shower was a stand-alone unit installed into the bookcase next to the bed. I'm as lazy as the next guy but I really do prefer to have my shower in the bathroom. Call me crazy. We might have been inclined to describe this as merely quirky but the ripped sheets covering the plastic cover on the matters, the general dinginess of the room and the hostel-like environment that kept us awake most of the night was enough to send us running the next morning. We gladly put down the extra £25 to stay around the corner at the Cumberland. For our money, we easily doubled or tripled our comfort. $200 may seem like a lot for a room, but until you've spent a night in the Edward Lear, you'll never understand just how little it really buys you. Don't be cheap - spend an extra $50 and stay somewhere that offers a shower in room where it belongs and bans the back-packers and hostel-goers.", "title": "Don't be so cheap", "helpfulness": 4, "user": "JMKeynes", "date": "September 4, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8656491}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "When you hear the word \"charm\" it usually means accommodations that haven't quite entered the modern world. True enough here, but what can you expect of an old residence on a London city block that has been horsewhipped into a stopping place for modern travelers? Our room was at the top of the stairs, so we immediately wanted a lift. Bathroom facilities were old and leaky, but worked, although a standup shower instead of a handheld tub squatter would have been nice. Rooms were small, but had lots of storage crannies. Kid's \"bed\" was first a cot with broken slats, and then just a mattress on the floor. Weather was cool, but on hot days you'll want an air conditioner. Breakfast was filling, without many choices. Staff was excellent, helpful, and smart. Oh, and the wifi connection lets you research restaurants etc in your room, even from the top floor. Great location near Marble Arch. Would I stay there again? Mm, maybe, but those stairs don't work with a heavy suitcase. Nosebleeders and those with BP problems beware.", "title": "great location with \"charm\"", "helpfulness": 3, "user": "RandMcNally", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 8455392, "likes": {"liked": "— location, wifi", "disliked": "— stairs, small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My six year old son and I stayed at the Edward Lear for 4 nights at the end of June. Our double room was way at the top of the stairs, and was quite comfortable. The sheets and towels were of good quality and fresh. We shared a bath, but never encountered any other guests, and it was perfectly clean. The breakfasts were good; the coffee fresh. On the whole, we were very cosy and happy with our stay. And the location could not be better! I would certainly recommend this hotel!", "title": "Cosy and perfect location", "helpfulness": 2, "user": "saravamama", "date": "July 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8235310}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I read all the reviews for the Edward Lear and was pretty nervous about staying here. I heard about some pretty dismal sitautions. When I got there, I realized it may be a result of high maintenance travellers.", "title": "High Maintenance Travellers Beware", "helpfulness": 1, "user": "abigailheller", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8222364, "likes": {"liked": "— Location, location, location", "disliked": "— Bad internet connection."}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Just had my Worst travel experience EVER staying here!", "title": "abysmal", "helpfulness": 3, "user": "Sam6428", "date": "February 11, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "business": 3.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 6779587, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Some of the reviews cannot possibly be talking about the same hotel I stayed in last night. Although the bedrooms are reasonable other areas of the hotel are dirty, discusting and potentially dangerous!", "title": "Not the Ritz but great value", "helpfulness": 2, "user": "mark_f_peterborough", "date": "February 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 2.0}, "id": 6752452, "likes": {"liked": "— location, value for money", "disliked": "— decor"}}, {"rating": 5.0, "title": "Just what we were looking for", "text": "Key points for me were:", "helpfulness": 2, "user": "French_McGuire", "date": "February 6, 2007", "id": 6750513}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Mice droppings in the hotel", "title": "Perfect location,very good bargain", "helpfulness": 1, "user": "JoannaK", "date": "December 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6503909, "likes": {"liked": "— Location", "disliked": "— Lack of elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Really bad damp and falling apart floors in some of the bathrooms", "title": "Fantasic place to stay!!!", "helpfulness": 1, "user": "Brittstar", "date": "December 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6483217, "likes": {"liked": "— The location", "disliked": "— THE STAIRS!!!!"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 6, "average": 28, "very good": 66, "terrible": 15, "excellent": 22}, "aka": "Edward Lear London", "slim_ranking": 0.620817843866, "description": "Very popular former home of the famous Victorian artist and poet, Edward Lear. The perfect place to go back to after a busy day in London. We guarantee you'll always be met with a smile that's genuine, and, if you need help with finding your way around London, booking theatre tickets, checking on train times, etc. we'll always be glad to assist."}