{"user_rating": 4.5, "review_count": 96, "name": "Efteling Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Have to say this was our best ever family hotel experience. It's small enough to be cosy, but the rooms are spacious and homely in a good way, you want to spend time there, which is nice when you want to rest after busy times at the park. It was my daughters birthday and unlike the last reviewer we were very pleased with a happy birthday, balloons and pink cupcake with our room service breakfast on the day, guess so much rests on expectation. Bar nice, dinner fine, overall felt v special. It's. to cheap but with park included feels overall good value for and experience.mew had a comfort room with bunk beds,the themed suites looked special but not sure worth the extra money as the comfort room was also special.", "title": "Best hotel ever", "user": "twoplusonetravel", "date": "January 1, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 189243387}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We mad a reservation through Booking.com for a one night stay for two rooms for my husband and myself and our three children. We were planning to celebrate our youngest daughter's birthday. We booked two rooms.", "title": "What a dissapointment", "helpfulness": 2, "user": "rubissaphir", "date": "November 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183334958}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I called the hotel (from France) twice to make sure everything was fine. I asked for connecting rooms and seperate beds. I made a reservation for their main restaurant in the hotel and I also asked for a birthday cake to bring for dessert with candles. No cake, we don't do that sort of things (?????) They only offered me to bring a cake in the room. What do you want to do with a cake in your room? So I asked if at least they could put a candle on my daughter's dessert. Yes that was no problem. \"We are very good at that\" was the answer.", "title": "Nice Hotel and Nice service !", "helpfulness": 1, "user": "Juan R", "date": "October 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181439988}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "When we arrived the disaster began. It was like you walk into a government run hotel. The staff acts friendly but they don't really care.", "title": "A trip to fairy tale land", "user": "Jesse G", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176030063}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "So our room was indeed a connecting room but not connecting with the room of my two other children. They had a room somewhere else and with one large bed while I had asked for seperate beds. I went down again to the lobby and asked to change rooms so at least my children would have each a bed. No, that was impossible said a very unfriendly girl at reception. She was the same girl who checked us in and she made it clear that because we made our reservation through booking.com we couldn't expect the same service! They could only ad a (very uncomfortable) folding bed. My son is 20!!", "title": "Perfect for a 2-day visit to the Efteling Park", "user": "TimDK", "date": "August 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 173926891}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Kaatsheuvel"}, "stars": 3.5, "variance": {"poor": 4, "average": 15, "very good": 29, "terrible": 0, "excellent": 48}, "aka": "Efteling Hotel Kaatsheuvel", "slim_ranking": 0.333333333333}