{"user_rating": 4.5, "review_count": 676, "name": "El Albergue Ollantaytambo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My wife and I had a great two nights at El Albergue during our stay in Ollantaytambo. Like many people, we stayed there before and after a day trip to Machu Picchu. We loved the hotel, the restaurant and Ollantaytambo. We stayed in room #5, the 2nd floor Double room and enjoyed the open-air feel, the nice bathroom and wonderful views of the Andes and the Inca ruins. Our room had a desk, two beds, two night stands, and a sideboard. Each day, we were given two bottles of water in the room for free.", "title": "Wonderful Hotel", "user": "toltecs", "date": "April 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 62123800}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The restaurant was fantastic and the staff could not have been more accommodating. Adela, in particular, helped me print boarding passes for a flight, arranged an early breakfast for us prior to our 6 AM departure for MP, and arranged sack lunches for our day trip to MP.", "title": "A Wonderful Place", "user": "shli4", "date": "April 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61774439}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "I can confidently say that this was our favorite place that we stayed on our trip to Peru. We would definitely go back again.", "title": "Nice place to stay a night", "user": "mark_SydNSW", "date": "April 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 60959990}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The Staff at EL ALBERGUE were very pleasant. They were also very accomodating to any of our requests. We had a wonderful dinner htere, the food was delicious , the sevice was excellent & the brownie with ice cream was to die for! Breakfast the next morning was fine, plenty of coffe & coca tea. The sauna was a real treat.", "title": "Excellent Hotel - incredible service, beautiful setting, great value", "user": "travelfan59", "date": "April 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60759219}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "It is a bit of a walk to the ruins & the main part of town - uphill. While we were at El Albergue the work on the rail line had not been completed to Ollantaytambo , so also there were no taxis close to El Albergue. Perhaps when the train stops at Ollantaytambo taxis will be plentiful.The taxis were plentiful at the ruins & the town square.", "title": "A charming hotel with good food and a friendly staff.", "user": "wheretonext22", "date": "April 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 60756828}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Right at the train station, but in walking distance of all local sites. Good staff, fine room. The wood fired sauna was a quaint extra, and the inner courtyard garden quite amazing", "title": "Fine, friendly, relaxing great wood-fired sauna & good food", "user": "ourgardenhill", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55848850}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "After reading reviews on Tripadvisor, we decided to use Ollantaytambo as our base in the Sacred Valley. We had a wonderful time, the service was fantastic, our room was comfortable and clean, and the location was terrific! Unfortunately there was an agriculture strike while we were there. The staff helped us rearrange our travel plans to make sure we could get to Cusco before the strike. We stayed a couple of days longer in Cusco than planned so we could catch our flight to Quito on time. I can't say enough great things about the El Albergue manager who stayed late calling and rearranging our hotels in Aguas Calientes and Cusco, and rushed our laundry order since we had to leave earlier than planned. She continued to work on rearranging our trip even after she went home for the evening. Now that is excellent service! We also met one of the owners, he road the van with us to Cusco so he could get there before the strike too, since he had to catch a flight to Lima (very nice guy!). We had a great time in Ollantaytambo, we wil definitely return and stay at El Albergue!", "title": "Awesome place to stay!", "helpfulness": 2, "user": "rtwgal", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55426134}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I have now stayed in El Albergue on a few occasions and have always thoroughly enjoyed my time there. The rooms are simple and stylish (I love the sheets!) and the gardens are perfect for lounging around reading and enjoying the spectacular views. The staff have always been friendly and very helpful. A beautiful place to stay for a few days to relax and explore the surrounding area.", "title": "I wish I could live here", "user": "picarrones", "date": "January 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54278717}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed here two nights, and loved it! Our room was clean and comfortable and from our window we could look over the beautiful courtyard and see ruins in the distance. The trains never bothered us, in fact I loved seeing the train sitting feet from the door when eating in the restaurant and it was great to be so close when we had a 5:10am train to Machu Picchu. Speaking of the restaurant, it's amazing!", "title": "A great place to stay!", "helpfulness": 1, "user": "Boilers0809", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54135643}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The staff were great! We were able to get laundry done, and they set us up with a driver to see some of the Sacred Valley sights. They also had bottled water available for free (to reduce landfill waste, they give glass bottles in the rooms and have an office-type tank in the lobby for you to fill your own bottles). We needed a heater for the room but it was free and worked well. The bathroom had plenty of hot water which was great.", "title": "Peruvian Shaker", "user": "Burnzi", "date": "January 14, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53495090}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Lovely little hotel right on the train platform. Very quiet (don't hear the trains practically at all), surrounded by wonderful views of the mountains and the ruins. Spacious gardens great for relaxing and watching the hummingbirds. The staff was super friendly and helpful. The restaurant was very good. Free wifi, laundry service available, secure luggage storage. Convient to the train (obviously) but a bit of a walk into town. Highly recommend.", "title": "Home away from home", "helpfulness": 1, "user": "windcall", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 52135806}, {"rating": 3.0, "title": "noisy but quaint", "text": "I have mixed feelings about this hotel. It's a very cute little hotel, only about 8 rooms. BUT, it's right on the train platform, which makes it very easy to board your train in the morning, however it's quite noisy as you may imagine!!! Bring ear plugs for sure. The staff there is SO nice! Luke is wonderful and I can't remember the woman's name, but she is very accomodating too! They will also hold your luggage when you go to Machu Picchu b/c you can only take a small bag on the train. When I passed through the station again on my way back to Cusco they were standing there with my bag waiting for me exactly when the train pulled up, how nice since I only had a couple minutes to grab it and get back on the train. The food in the restaurant is good too. But the little sauna they advertise is like a closet sweatbox, I wouldn't recommend it. There isn't much to do at all in Ollantytambo, but I would recommend taking a horseback ride up to the salt pans....amazing!!", "user": "SDgirl32", "date": "December 11, 2009", "id": 51079793}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "El Albergue is very unique because it is literally part of the railroad station and if you are going to Machu Pichu - you just roll out of bed and step into the train. Despite its location, we were not bothered at all by the noise of the trains because the room was facing the back of the hotel. The view from the back of the hotel is great. The staff is very helpful and the restaurant is very good. You have to try alpaca for dinner --it was the best in all Peru. The room is very clean but small and short on amenities. Actually there was no closet in the room - only pegs on the walls to hang your clothes. Bathroom was modern, very small but with plenty of towels. Actually, if we ever went back to Peru I would definitely stay at this hotel again - it was cozy, had free WiFi in the lobby, helpful staff and its location on the railroad station added to the sense of adventure.", "title": "Great location", "user": "katiagal", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50209460}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed at El Albergue for our first 3 nights in Peru. It's about a 1.5 hr beautiful drive from Cusco. We found the location convenient, as we were taking the train to Machu Picchu our 3rd night. It is an uphill walk into town, which might be tough if you're affected by the altitude- we weren't, so it was fine. It's walking distance to the Ollantaytambo ruins, and we had a car take us about a half hour drive to visit Moray and Maras which were beautiful and worth seeing.", "title": "A great base for Sacred Valley/Machu Picchu", "user": "ansb10", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 49771456}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The rooms are spotlessly clean. We stayed in Room 1 on the 2nd floor- no TV or hairdryer like other reviewers said, but we slept pretty early and didn't spend much time in there. Dark plank floors, textiles on the walls, it was very charming and rustic. The food was excellent. We had dinner there twice, and the included breakfast (eggs and toast or pancakes) was delicious and filling. The coffee there was the best we had in Peru. We took their packed lunch to MP, which was a godsend after climbing Wayna Picchu- if you are going on the first train out (5am), you'll need to eat something as you're climbing all over everything and it's exhausting. We ordered room service once (a pressed hot sandwich) which was delicious, and later wished we used the laundry service (it was cheaper than our later hotels.)", "title": "Romantic, convenient location. Full of olde worlde charme!!", "helpfulness": 4, "user": "jofeck", "date": "October 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 47286890}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I recommend spending a few nights at this hotel to enjoy their wonderful food, sauna, and relaxing atmosphere. The experience with other hotels in the valley varied dramatically. The people at El Albergue make you feel truly welcomed. Although the internet connection is a little difficult to figure out, everything else was awesome. We spent 28 days in Peru, and our 3 nights at this hotel were the best!", "title": "Nice people, best service, incredible views, spectacular value", "helpfulness": 1, "user": "revellkid", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59869511}, {"rating": 3.0, "title": "Basic, a little out of the way, but good value for money and food at hotel great", "text": "Probably one of the nicer places in Ollay, but nothing to rave about.", "user": "Deb M", "date": "March 20, 2010", "id": 59089009}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Nice family run business", "title": "Good value, nothing fancy but what a traveler needs", "user": "ecotrips", "date": "March 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 57469033}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "El Albergue has clean rooms with heaters and warm blankets (you need these in June-Aug) Good breakfast and excellent restaurant as well as a nice expresso bar for caffiene addicts like me. If you are noise sensitive try to get an upper floor room away from train station as the wood structure means you hear footsteps from room above.", "title": "one word: wonderful!", "user": "Csfrankl", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56316667}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The library and sitting areas are welcoming with some good resources. Staff was very helpful and friendly.", "title": "\"The perfect country inn in the Urubamba Valley\"", "user": "HollyCuscoPeru", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55978779}], "location": {"country": "Peru", "region": "Cusco Region", "continent": "South America"}, "stars": 3, "variance": {"poor": 19, "average": 37, "very good": 170, "terrible": 2, "excellent": 448}, "aka": "El Albergue Ollantaytambo Hotel", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located on the Ollantaytambo train station, El Albergue is only one train stop away from Machu Picchu and not far from many interesting attractions. El Albergue dates back to 1925 and maintains the charm and elegance of the early 20th century while offering modern day requirements such as free high speed internet and in-room telephones. Owned by artist Wendy Weeks, this hotel has beautiful gardens, delicious food and special attention to décor."}