{"user_rating": 3.5, "review_count": 3243, "name": "El Conquistador Resort, A Waldorf Astoria Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "We traveled to the El Con for business but went early for some rest. It is a huge property and it seemed quite empty, even when our whole group was there. I had read mixed reviews but am always on the positive side so I wasn't worried. We upgraded to an ocean view room in the number four section and were right in the thick of it all. No balcony but the view was wonderful. We had a fridge and bought pop and beer at WalMart because this is NOT an all inclusive resort and the drinks were spendy. The cab ride is about 40 round trip but saved it in a cooler and our own snacks/drinks.", "title": "A perfect vacation/business destination", "user": "northdakotamom", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55591560}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The private beach is wonderful and the spa is top notch...Food is great, too, but we did eat out and met locals who gave us suggestions regarding where to eat, tour, etc...We ended up relaxing on the beach or by the pool but did meet a wonderful fellow from the University who took us up into the mountains for a traditional Puerto Rican day with the locals. It was charming and the authentic rice, beans and pork were wonderful.", "title": "Waldorf Astoria Group should be ashamed!", "helpfulness": 2, "user": "mckan514w", "date": "February 9, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 55547825}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I think Puerto Rico is beautiful and although the resort is spendy and I only saw our room, (which really the only blemish was that the bathroom needed updating) and I would have loved a deck...I would recommend the resort/property with so many pools, a casino, lots of restaurant choices and really nice people.", "title": "Absolutely out-dated and boring.", "helpfulness": 2, "user": "Jenna181", "date": "February 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 55374642}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "First off the good: The property itself was BEAUTIFUL, the views, pools, island etc... were all gorgeous and it was very relaxing... and the beds were COMFORTABLE... but that's about it for the good.", "title": "Paradise!", "helpfulness": 1, "user": "CS_711", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 55123829}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "THE BAD-- the place and rooms were FILTHY! Our room was disgusting. The floors and tiles looked like they had not been cleaned in years. I do not think our sheets were EVER WASHED in the 5 nights we were there (they had a sign saying they washed sheets every three days due to \"wanting to be 'green and environmental'\" unless you left a note saying otherwise, we did, and they still were not washed (even every 3 days)-- there were no bathrobes in room, and all around some Hampton Inns are better rooms.", "title": "Nice, but prepared to be nickel and dimed.", "helpfulness": 3, "user": "bdelsavio", "date": "January 27, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 54532013}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "My husband, myself, and our three year old son just returned from a five day stay to the El Conquistador. Although, the resort has been recently renovated, the service is in need of a major renovation. In all of our travels we have never experienced such poor service.", "title": "Awful Service", "user": "jodi36075", "date": "March 26, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 14564369, "likes": {"liked": "— The beautiful views from our room and the perfect weather", "disliked": "— The poor customer service from check in to check out and everything in between."}}, {"rating": 4.0, "title": "El Conquistador, Puerto Rico", "text": "Upon getting to our room we found the safe to be locked. It took five hours and a couple of phone calls before security managed to come up to the room.", "user": "snitzman", "date": "March 25, 2008", "id": 14520464}, {"rating": 4.0, "title": "We got a deal but still expensive!", "text": "As soon as we checked in I requested extra pillows so I could put them on my son's bed so he wouldn't fall out. Once again, it took numerous phone calls. Finally someone from housekeeping showed up approximately six hours later with one pillow. He couldn't understand why we were so upset. Upon speaking to the head of house keeping, additional pillows were finally delivered.", "user": "Lecarrow", "date": "March 24, 2008", "id": 14502949}, {"rating": 5.0, "title": "Wonderful Carefree Vacation", "text": "We knew that we were going to pay resort prices for food so we were prepared. However, the service in all of the restaurants, especially Otello's was beyond awful. It took approximately 45 minutes for them to bring out a plate of chicken fingers. We always eat on the earlier side to avoid any crowds and delays when we are out with our son. This is in fairness to him and to everyone else in the restaurant. However, you can't expect a three year old to sit for forty five minutes patiently before a meal arrives.", "user": "jkjk1", "date": "March 24, 2008", "id": 14491628}, {"rating": 5.0, "title": "Spend your time enjoying your Vacation", "text": "We knew the hotel was not inexpensive and we didn't have any problem with that. However, we expected to get far better service than what we received. Everyone who we spoke to said the same thing. Many of the people we met would not return because of the poor service.", "helpfulness": 1, "user": "skywd", "date": "March 24, 2008", "id": 14489803}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Very disappointed in El Conquistador, if you are planning a quiet relaxing vacation, do not go to this hotel, doors slamming and paper thin walls you can hear the person in the other room using the restroom. we stayed in the 3440 section, there were ants on the nightstand, bathroom was just remodeled but it looked like they just glued the new tile to the old, you could see the old mildew and old tub! long long walks to get to one place, NO golf cart transportation. Service by the hotel staff was poor, the only great service we received was from Fernando in Bella Vista, he did an outstanding job, the rest of the staff acted as they if we were doing them a favor. They all of sudden became alive when it was tip time. Hotel Hot tub near the Bella vista had a Kotex Max pad sitting on the side, the grounds are NOT kept there is cigarette bud, cups, napkins junk on the floor, there is NEVER anyone picking up or sweeping the property. THe lobby restrooms were flity and old. They need a serious paint job and chaulking the bathrooms! The food was very over priced, and the drinks were weak. The only place that had discent food or drinks wa the bella vista, the pizza was yummy. Forget about asking for assistance on tours or places to go, every time you called the concierge, they never knew anything or told us to call back. We did enjoy our $300 dinner at the strip house, it was delicious. I felt that I never got a good night sleep, there were doors and staff walking by talking on their radios, it was loud all night, and one night the wind was blowing so hard that we had to push the furniture up on the glass to stop the howling or the glass from vibrating! We did move rooms one from 3200 section to the 3440 but it was all the same LOUD! Bring your ear plugs, and be prepare to see trash every were you go. the beach was okay, my son enjoyed the boat ride, but there was trash all over the beach, and sea weed every where, it would be nice if they could of just invested a few hundred dollars to pay a cleaning staff to keep the properyt clean! A tip for Palamino beach, hire someone to rake the seaweed! Next time I will go back to Mexico!", "title": "El Conquistador was NOT a vacation!", "helpfulness": 1, "user": "peachHouston", "date": "March 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 14186139, "likes": {"liked": "— nothing", "disliked": "— dirty room - old and not kept up"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "This is not a hotel for someone who wants a beach experience. There are two problems with going to the beach here: 1) you have to walk a long way through the hotel, go down a cable car (funicular), board a boat and be taken to a separate island 2) the hotel has expanded drastically in recent years and there is not enough beach space to accommodate all the guests.", "title": "Not a Beach Vacation", "user": "Boswell_8", "date": "March 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 14149916}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We spent a week at the hotel during the recent winter break holiday. The staff was very kind and accommodating but they could not make up for a facility that was overwhelmed by the sheer number of guests. The hotel has added on hundreds of rooms in the last few years but they haven't been able to expand the swimming, boating, snorkeling or restaurant facilities to keep up with all the guests. In addition, the newer, nicer area where we stayed, (Las Casitas) is that much further from the main restaurants, beach facilities etc. One day we came back from the beach by one of the later boats, had a half hour wait for the funicular to get up to the hotel and then a 20 minute walk to our room. It took over an hour from the time I left the beach till I was sitting in my room.", "title": "Beautiful location but beware . . .", "user": "soccermomwestchester", "date": "March 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 14106858, "likes": {"liked": "— The kitchen", "disliked": "— The distance from the beach."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I also caution people against using the hotel's tour company to kayak into the bioluminescent bay. It is a wonderful sight and there were many other, better organized tour groups out at the same time as ours. The hotel's tour guides went ahead with the faster people in our group and left me with my 10 year old son to find the way to the bay by ourselves. We were alone in the water at night, couldn't see the way to go and were afraid to turn back. It was a very unpleasant experience.", "title": "Specatacular views & a few cash saving tips", "user": "DCChiq", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14102131, "likes": {"liked": "— Spectacular views, cleanliness, 5 star service, pools, room features", "disliked": "— $14.95 daily internet and the main building food prices"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "My husband enjoyed the golf course very much and was able to get tee times quite easily. My son had tennis lessons from a very good teaching pro. We found that the food was outrageously expensive and generally mediocre. We had rented a car and after a few days used it to go out for dinner every night. We discovered numerous restaurants right by the hotel serving terrific food. I particularly recommend Estacion, which cooks everything on an outdoor grill.", "title": "Five Star Prices for Three Star Product", "user": "pullthetrigger", "date": "March 6, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 5.0}, "id": 14094143, "likes": {"liked": "— The setting", "disliked": "— The value"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We just got back from a 4day stay and loved every minute. There is so much to do either ir your just a couple of a family of 8. the kids totally loved the waterpark and Palomino Island, no boredom for anyone. We had late lunches at Cafe Bella Vista and had the best \"fried pork\" with plantains, had it twice while there! Also had dinner at Chops and Blossom's both amazing food and service. Can't say enough about the views and lovely grounds, will definitely be back and recommend to others!", "title": "Great vacation", "user": "Esther1234", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 172973411}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Pros: Beautiful grounds of hotel, pools, island. Staff for the most part very friendly and most greeted you when you pass. Views are beautiful. Cons: Hotel needs serious updating and cleaning. Yellow carpet in hall was filthy! Bathrooms in room need vents and tile needs grouting. Room service trays people leave outside their doors stay there for over 24hours or more. Parking is the biggest hassle. $16 per day and you have to park 1/4 mile from hotel and trudge up a hill. You must get parking pass validated every time you leave lot. There is also a $15 per day \"hotel fee\" plus taxes, $5 per local phone call, $5 to play fooze ball and other games. Water park was nice, but $20 per person per day for 3 slides is too high! We paid $9 for a microwaved cheeseburger. Finally, there is nothing to do for families from 6pm on except sit in the 1 pool. Waterpark closes at 6pm, and last ferry is at 5:30pm.", "title": "Oh the walking...fees....dead after 6pm for families!", "helpfulness": 2, "user": "736Becky736", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 172894473}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "El Conquistador Resort is one of the oldest hotels in Puerto Rico, it offers world class service and wonderful views. Depending on where your room is located you can see you can see the Atlantic Ocean in all its splendor with its neighboring Islands, Vieques, Culebra and Palomino and its surrounding keys. Palomino is a little island property of the hotel, that offers shuttle services during the day. To the other side of the hotel the views are of El Yunque Rain Forest and all surrounding mountains. The main hotel, lobby, main area, restaurants and other amenities are beautiful and inviting. There are basically three buildings where the guest rooms are located, the ones for the jet-setters (Las Casitas), Medium side$$ bulidings (La Marina and Las Olas) and the main, and oldest building (Las Brisas) this one needs some love (maintenance) dirty carpets, cracks on the wall, etc. but overall is a beautiful hotel to stay a while and for conventions is a plus (that was the reason for my stay). So enjoy Fajardo and the Eastern shore of Puerto Rico, you won't regret it.", "title": "The best views of Puerto Rico's east coast and beyond, but needs a little maintenance", "user": "Orlandobori", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172837822}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We booked as Hilton Honors Gold using both $ and points. You have to plead for all upgrades except for 2 free water bottles, 2 free drinks and to use the nice but empty spa. The hotel is very nice but the breakfast buffet is just 1/2 step above an Embassy Suite's and for that too we had to plead for as well. Staff is very nice, grounds are well kept and location is great for rain forest, Bio Bay and conservation park and tour.", "title": "Nice, but not the feel of a \"Waldorf\"", "user": "Philip G", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172914025}, {"rating": 1.0, "title": "Very bad experience", "text": "Dear Ms. Toko, (Hotel manager) My name is Dr. John, my wife and family had made reservations to stay at the El Conquistador Resort / (the Waldorf Astoria Resort), on 08/14/2013 to 08/15/2013, just as a layover as we were traveling around the island on vacation. We made reservations with the front desk on 08/01/2013for two rooms in which the staff member (I do not remember her name) was gladly to assist us in our request and recommend that we stay at the (LAS BRISAS OCEAN VIEW ROOM’s), during our stay for the best views of the islands and ocean. During the reservation process, I asked if all members of my party would receive the complimentary breakfast which encompassed 5 adults and 1 child under the age of 8. The staff member stated “YES” that’s not a problem at all, we would be glad too. That’s when I stated to go ahead and make the reservations for the total amount of $945.77. Upon my arrival, I was met by your front desk supervisor whom which she stated that the rooms will only provide complimentary breakfast for two adults for each room. I then stated that I was told by the staff member that took my reservation that it would accommodate all members of my party. Eva then continually stated in a sarcastic tone of voice “NO IT’S ONLY FOR TWO” adults for each room. I then asked to speak with a member of management, which which the staff memebr when grinned and stated that “well that’s me” I was taken back somewhat by her unprofessionalism towards me and my family, which was very brash and condescending like in her attitude. Ms. front desk supervisor then kept on assisting that we were given the correct information (in which we were not), and made us feel unwelcomed and as if we were lying to her in order to get the free breakfast. (Trust me it’s not about the money, it was about the principal of the matter), I tried to explain to Ms. front desk supervisor the sequence of events that transpired between the phone conversations with the front desk staff member that who originally had taken our reservation. After having an in-depth conversation for over 25 minutes with Ms. front desk supervisor about this issue, and being completely embarrassed at this point, it was then I asked to speak with the resort manager, Ms. front desk supervisor stated that you were not available. I then asked for your business card. It was at that time Ms.front desk supervisor stated in a condescending tone of voice, “FINE I’ll GRANT you the breakfast for all members of your party, see I’m typing it in now.” I was shocked and utterly amazed on how my family and I were treated. It was then that I requested any and all documentation pertaining to this event that Ms. staff memebr was typing into the computer as evidence of our treatment on your resort, so that I would have the opportunity to discuss this matter with you at a later date. The following day 08/15/2013 at 10:00 am, my family and I went to the El Conquistador Las Brisas for breakfast, were we had another memorable experience, in which we had to wait over 22 minutes for service. If it were not for another member of your service team, which was already waiting on other guests, our wait time would have been longer. I believe her name was (Ms. Yahaira Quinones), she come over and apologized for our long wait time and took our order by pouring us coffee and juice and the rest which we took care ourselves from the buffet. We made sure that we took care of Ms. Quinones with a healthy and generous tip (which was well over $90.00 dollars); just for making sure we were fine. I would hire her for one of my practices, she gets the customer service piece without question, there is an old saying “without customers we would not have jobs”. On that same day, around 11:34 am I proceeded to check out which it took over 43 minutes because I had to explain to your staff member at the desk that charged me for the rooms again and the breakfast which I thought the front desk supervisor would have shared the notes that she took and gave me with her team. I had to show my documentation that the front desk supervisor gave me in order to rectify this issue, and not to be charged for the breakfast. In closing I would like to add that I my wife and I travel the world, and have stayed in other distinguished and prestigious resorts, which are well-known for their world renowned customer service. After each encounter with a guest the staff member is trained by saying “it was my pleasure.” I regret to inform you that none of your staff members in closing stated to any member of my party those words, neither did we over hear anyone say this at the El Conquistador Resort / (Waldorf Astoria Resort). This leads me to believe that this is neither part of the El Conquistador Resort / (Waldorf Astoria Resort) culture, nor part of the curriculum at the resort. I attached the documents for your review as well as my contact information. If I do not pick up please leave me a detailed massage as my family and I are still on vacation. Thank you for prompt attention to my concerns, and hopefully you would have the opportunity address your staff members on basics of customer’s service. Within your response, would you be so kind to provide me the names and numbers of the executive staff member’s that over sees the El Conquistador Resort / (Waldorf Astoria Resort). Respectfully, Mr. John, MD", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 18, 2013", "id": 172913827}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We enjoyed our trip, although this place is very expensive. We knew that going in, but WOW!!!", "title": "fun, but I don't know if we'll go again", "user": "tspeck", "date": "March 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 14048869, "likes": {"liked": "— the beautiful casita", "disliked": "— the fact that we coul"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Also, we were not a part of a very large group of Chase people who pretty much took over.", "title": "Worst catering manager and service staff", "user": "jetsetter2009", "date": "March 4, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0, "service": 1.0}, "id": 14040038, "likes": {"liked": "— nothing", "disliked": "— the staff"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "It would have been nice to know that going in!!!", "title": "Dated but has promise", "user": "Oulu", "date": "March 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 14044949, "likes": {"liked": "— Friendly staff", "disliked": "— Expensive for average to above average quality"}}, {"rating": 4.0, "title": "Fantastic Location, be prepared to spend some cash!", "text": "We stayed in a beautiful casita and it felt like we had our own private home on the ocean.", "helpfulness": 1, "user": "RaeFortCollins", "date": "March 3, 2008", "id": 14022555}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Gorgeous view!!!!", "title": "Wonderful Staff, Beautiful Location!", "helpfulness": 1, "user": "Meghan1115", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14011437}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "This is a great location but it's such a huge property that it needs constant updating. After many years of visiting this property I can see that employees are not happy, casino has been reduced in amount of tables, slots and hours of operation to a bare minimum. The rooms are nice but could use some renovation. The beach is great since they have their private island.", "title": "Gorgeous location, very nice Property, but Could use a little updating for The price.", "user": "susy009", "date": "December 9, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 121551932}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Food is average, however I would recommend taking a quick cab ride to Pasion por el Fogon just outside the hotel...superb!!", "title": "Once In A Lifetime, A Hotel and experience to remember", "helpfulness": 1, "user": "trendy2", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121538252}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Thanksgiving 2011 our family of 6 adults and 2 children went to Fajardo, Puerto Rico to see 3 extended family members and we stayed at this marvelous hotel. It was an experience of a lifetime. It also owns an island which you go to on their ferries. On this island you are provided towels and beach chairs. You can buy your drinks and food there at their open bar. The adults and children loved this experience. This Hilton Hotel has a huge central hallway with 2 parrot cages, shops, a casino, restaurants...just about everything you want so one has fun browsing. You fly to San Juan, rent a car for it takes an hour to get there. Look it up on the internet.", "title": "Beautiful and friendly, but deceptive billing and some noise", "helpfulness": 1, "user": "CYLau", "date": "December 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 121532127}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The grounds and rooms are gorgeous. Staff is friendly. And Palomino island (accessed by hotel ferry) is a wonderful retreat with numerous nice lizards. We enjoyed relaxing here after several days of being in the mountains.", "title": "Bar Iguana at Palomino island", "helpfulness": 1, "user": "Wilfredovr", "date": "December 8, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 121527394}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "On the downside, our room was across from a party room where hooting and hollering went late into the first night of our stay. The hotel is unable to provide earplugs, but is cheerful about assuring you the noise will end soon (though it does not).", "title": "Sprawling, Clean, Well Appointed, A good Choice.", "user": "ExoticDave", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121442027}, {"rating": 4.0, "title": "Great Hotel - Loved the Spa!", "text": "This was a last minute labor day trip and we chose Puerto Rico as it was the only place at the time that was not being hit by a hurricane! What a pleasant surprise - the hotel was huge and lots of fun (we are a very active couple in our 30s) - great private beach - very few kids - wonderful spa!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 7, 2006", "id": 4331319}, {"rating": 4.0, "title": "amazing property but....", "text": "Service was a bit lacking, but it didn't bother us much! Rooms were well equipped and Golden Door Spa products were awesome! The cost for the entire trip was soooo reasonable - I would have expected a lot less - it's a great bang for your buck.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 4, 2006", "id": 4324895}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "The restaurants are very pricey, but lots to choose from and food was good.", "title": "Lot's of Plus's Few Negatives", "helpfulness": 13, "user": "janinelouie", "date": "January 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 4.0}, "id": 4324562}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We stayed at the Conquistador from the 26th until the 31st. It is an amazing property!!, truly one of the best hotels I have seen (and we travel quite often). The hotel, the Island, the pools, truly beautiful. But, some things need to be polished. First, the incredibly noisy band in the lobby, please lower the volume!!. It is impossible to talk or even ask for a drink while the band is playing. Seriously, the noise is unbearable. Asides from this, the rooms need to be upagraded a bit. The quality of the food in most of the restaurants need to improve. We liked Isabella's, but franky the rest were just eeehh whatever.", "title": "Beautiful grounds, expensive food", "helpfulness": 10, "user": "vipnj", "date": "January 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4324240}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "This was the second time that I have stayed at this hotel.", "title": "Repeat visitor very pleased", "helpfulness": 9, "user": "rushradman", "date": "January 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4323434}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My husband and I are easygoing travelers and found this resort based on the recommendation of a few friends who absolutely raved about it. The resort has some good qualities, but it one of the worst value vacations we have ever experienced. It has the ambiance, food quality, and feel of a mid-range \"Sandals\" type resort, but is priced like a Ritz Carlton. We spent almost $3000 on a 4 day trip there, with a middle-road \"Ocean View\" room (actually we were given a blocked view, but that's another story). Bottom line - 4 days in Hawaii could be done for this price, or 2 weeks in a similar quality all-inclusive adult or family resort.", "title": "Skip this resort", "helpfulness": 2, "user": "bellelpc", "date": "April 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 4.0}, "id": 14749135, "likes": {"liked": "— Pretty grounds", "disliked": "— Constant hassle with service and slow Funicular."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The problems seemed to be mainly service based, rather than facility based (other than them giving us the wrong room and refusing to acknowledge it). We are very seasoned travelers and have spent time in the Carribean, Mexico, Africa, Europe, and all over small towns in the US - so we are not sheltered Yankees with bad attitudes - I promise. We maintained our patience the whole time but by the end of the trip we were ready to go home, which is not typical for a 4 day weekend in a supposed luxury resort. Waiters/waitresses were understaffed, had bad attitudes, and were not attentive. Pricing throughout the resort was ridiculous (every meal was $50 for two people, usually a salad and sandwich with soda). On top of that, there was no authentic Puerto Rican twist, not even a local type restaurant, on the resort. It could have been located anywhere.", "title": "Beautiful Resort!", "helpfulness": 1, "user": "pupdog224", "date": "April 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14715200}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I would suggest to the resort that they space out their conventions or add a convention wing to separate convention guests from other guests. They actually closed the main pool on 2 out of the 4 days we were there for the corporate parties, which for us was pretty disheartening. There were 2 conventions while were there - Chase and B of A, back to back. This was a big spring break week, too, so it was 100% capacity. The resort should not have booked the hotel to 100% capacity, as the restaurants and staff were not able to handle it. Again, attitudes were poor, guests were grumbling, and many people's room bills had invalid charges.", "title": "loved stay, however, I can appreciate concerns of others", "user": "bambam007", "date": "March 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14680386, "likes": {"liked": "— relaxing, going to the island", "disliked": "— prices, going to or calling the front desk"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I would recommend spending 4 days at the Mirage or Caesar's in Las Vegas, or heading to an all inclusive mega resort in the Carribean or Mexico instead of spending your money at El Conquistador. It is a terrible value for a similar experience.", "title": "Tips for El Conquistador", "user": "BH55", "date": "March 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 14647140}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Just back from a great stay 3/21 - 3/25 at the El Con. I used this site extensively when deciding on where to stay so I want to share my experience. I was with my husband and two boys ages 14 & 11. We stayed in a Las Brisas ocean view room. The room was nice, spacious, and clean. The view from the balcony was beautiful. The beach at Palomino island is very nice, and the ride over only took about 6 or 7 minutes. The pools at the main resort are nice, but cold. The new waterpark is a lot of fun, my kids really enjoyed it. The food was good. You don't have to spend hundreds of dollars at the expensive restaurants. There are other options. We ate several mornings at Cafe Caribe at 6.95 - 8.95 per person for a nice breakfast. We also ate dinner at Cafe Bella Vista by the main pool, for 4 people with drinks and desert it was about $100. There are also off site restaurants that are good. We ate at Metropol and Calizo in Fajardo and both were great. Overall this was a beautiful resort and a good place for a vacation. I would recommend having a rental car, the ride from the airport and going to some of the different sights and restaurants was less by paying for the rental and parking, than what it would have cost for other transportation.", "title": "Overrated!", "helpfulness": 1, "user": "Jodeci68", "date": "March 29, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 14636924, "likes": {"liked": "— Beautiful views", "disliked": "— Prices"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "If you want to pay for view this is the place. The views and the private island are just beautiful. If you expect to get a decent room for your money well....this is not the place. I can't even describe how dirty our room was. The bathroom cealing was full of mold, there was an old choocolate stain on the closet doors, hand prints all over the slidding doors, dry ketchup in the chairs, unclean carpet etc... we stayed for two nights and we couldn't stay in the room too long. We found the service to be very good ,except at the fine dinning restaurant called Picola Fontana where the head waiter was running the place like a glorify cafeteria. I payed $49 for a lobster and I didn't appretiated how this lady ran the place. There is a piano in the hallway near the restaurant that was hit by children for our entire dinner. Unfortunately they keep the restaurants doors open at all times, so the teriible noise was horrific and nobody seemed to have control over what was done to the piano. My husband and I where hoping to get a relax dinner. I know it can be expensive and we were fine with that, what we didn't know is that in order to have dinner there we needed to tolarate horrific piano noise, a loud headwaiter shouting to the waiters from far, and ok food ( not excellent) for a $100+ dinner. Too Bad! El conquistador use to be one of my favorite places to stay but no more. They need to get better cleaning service and take care of their rooms. It is shameful.", "title": "El Conquistador Down the hill", "helpfulness": 2, "user": "chanitaTampa", "date": "July 27, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 5.0}, "id": 115872369}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We stayed at this \"Resort\" in December 2010. Rooms were okay, nothing great. Service & food average. During our stay the casino, bars, and restaurants all closed by midnight. There are no bars close to this hotel. Cannot believe they roll up the carpet so early in the night.", "title": "Will NOT be back", "helpfulness": 4, "user": "mich130", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0}, "id": 115872134}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Stayed here with family of 4 in early July 2011. Staff was very friendly. Grounds and hotel very clean and well appointed.", "title": "Great staff, couple of pitfalls", "helpfulness": 1, "user": "Frank42808", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115869991}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Cautions: once you are on the grounds - the food is really expensive. Best to have a rental car and get out to the local towns (Las Croabas etc) for more reasonable prices. Works better for booking tours yourself as well.", "title": "Nice and will return next time in Puerto Rico", "helpfulness": 1, "user": "Fish095", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 4.0}, "id": 115827601}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Parking is a bit of hassle - so be prepared to take the good with the bad.", "title": "Loved it", "user": "Diana129", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115796146}, {"rating": 5.0, "title": "Unbelievable!!!!!", "text": "I usually do not write reviews on this site, but it made me very upset to read what I was reading before I made the trip to El Conquistador. I went with my wife and 2 kids age 3 & 5 with an open mind. Everyone that I has spoken with said this place was Breathtaking and you have gotta go! I read these reviews and did not really know what to think? Well, We just got back last night and we had the best vacation we have ever had!!!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5470575}, {"rating": 2.0, "title": "worn-out, bad service", "text": "The views are breathtaking. We stayed in an Oceanview room overlooking both the Atlantic and Carribean. I personally am very picky in my hotel rooms I usually stay at Hilton, Embassy Suites etc. The room was fine especially once you look outside the balcony and see paradise.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 9, 2006", "id": 5443412}, {"rating": 5.0, "title": "The good the good and the good! Not, the good, the bad and the ugly!", "text": "The rooms are a little outdated, but very clean and extremely acceptable to our taste. The beds were very comfortable and everything worked great!! When you go to a resort like this, you are going for paradise not to stay in your rooms all day. We were in our rooms in the morning before breakfast and at night to go asleep. My wife and kids hung out at the pool for 1 day while I played golf. The golf course is outstanding and well manicured. Shot 77 with a double bogey on 18???? The pools are clean and a blast!!! We has the best time on the private island. If we had to do again, we would spend everyday there, It is truly Gilligans Island. Grass umbrellas, horseback riding. Absolutely the best time you will have!! The boat takes about 20 minutes which seems like 5 minutes. The boats leave El Con and the island about every 30 minutes. If you want more wind and breeze, go to the right side of the island when you get off the boat. Truly Paradise, we did not want to leave!! We got married in Jamaica and this place literally blows that away!!! cont--------", "helpfulness": 32, "user": "chicagogirlonthego", "date": "June 30, 2006", "id": 5412721}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "observed whirlpools with mold, pools that require resurfacing, old very worn rooms with broken decorations and balconey doors that were broken, also broken tram(funicular)...there are only 2 and one was not in operation..no sign or warning.", "title": "El Con was Okay", "helpfulness": 11, "user": "vtgambler", "date": "June 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 5409247}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "carefull around landscaping in the pool area as several exposed electrical wires were observed.", "title": "El Con; the good the bad and the other...", "helpfulness": 18, "user": "zermas", "date": "June 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 4.0}, "id": 5378437}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "I spent 2 nights at the El Con (Sept 23-25) with 2 friends and found it to be well above my expectations based on other reviews. Overall, we were thrilled with our stay and had a fantastic time. The grounds are beautiful and the view is first rate.", "title": "Great time at El Con", "helpfulness": 6, "user": "TCBrooklyn", "date": "October 2, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5900787, "likes": {"liked": "— Killer views, terrace, cleanliness, nice large bathroom for 3 gals", "disliked": "— paper-thin walls, rooms could use a face-lift"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Room: On the Marina level, but overlooking the pool and ocean, and not right on the marina. It was clean and comfy with a beautiful terrace and large clean bathroom. Easy access to the marina and Ballyhoo bar were a plus. Minuses: Walls were paper thin (not a problem for us since it is the off season, so the resort was pretty quiet in general. But could be an issue if the resort was more crowded). The beds were ready to be replaced but were not uncomfortable.", "title": "LOVED El Conquistador", "helpfulness": 9, "user": "pjmrio", "date": "September 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5882334, "likes": {"liked": "— Huge room, walk-in closet"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Dining: Being from the Northeast (NY, DC and CT) we didn't find the food prices to be outrageous - it was what we expected for a resort. We shared most of our meals, ordered half portions and always had enough to eat. All of the restaurants we tried were tasty - Otello, Blossom, Ballyhoo, Caribe Cafe, the place on Palomino Island and David's Cookies.", "title": "Absolutely loved it! Forget those other reviews!", "helpfulness": 13, "user": "pumpkinpie76", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5804231, "likes": {"liked": "— The views & amenites", "disliked": "— nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Palomino Island: In a word, spectacular. Make a right from the ferry, past the rental shops for a cool ocean breeze and pristine looking beach. We didn't find the ferry to be a hassel and our boat even stopped to let people see a few dolphins who swam by us.", "title": "Wonderful and yet nasty", "helpfulness": 5, "user": "Kenn_P", "date": "September 11, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5790517, "likes": {"liked": "— The grounds/views", "disliked": "— The uncleanliness & food"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "Water sports: I went diving and my friends snorkelled with the in-house dive shop. They made it very easy - I dropped my gear off with them in the morning, and they picked us up from Palomino Island with the gear on board later in the day. It was not the best reef I've seen and it was a guided dive (with dive master Tito), but we had long bottom time (60 min) and after the dive there was time to swim on the surface with the snorkellers. Very relaxed pace overall.", "title": "Worth a Visit", "helpfulness": 6, "user": "rayjay80", "date": "September 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5760052, "likes": {"liked": "— The private island and beach", "disliked": "— Outdated room"}}, {"rating": 5.0, "title": "Have you really been there????", "text": "Sheesh, people. My wife and I fretted over our decision to stay at the El Conquistor for weeks based on the surly reviews we saw on Trip Advisor. I have no idea what ax these folks have to grind, but here's the real skinny:", "helpfulness": 16, "user": "Capnsteve62", "date": "January 18, 2006", "id": 4359832}, {"rating": 4.0, "title": "A good time at the Elcon.", "text": "The El Conquistador is a world class resort. There is no way pictures can do it justice because it is built on such a grand scale.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "January 13, 2006", "id": 4350071}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We found the food to be very good (exception being the Caribe Coffee Shop which seems to cater to families with kids). Yes, things were a bit pricey, but what do you expect at a resort of this caliber? The prices weren't any worse than what we see here in the Dallas area.", "title": "Great family vacation. No serious complaints", "helpfulness": 12, "user": "BB_5", "date": "January 9, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4335085}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "The rooms were magnificent. We caught a deal through Hotwire and were worried we'd end up with a room in the dungeon, but we ended up with a gorgeous room, huge bathroom, large balcony and a view of the golf course with the ocean in the distance.", "title": "It was okay.", "helpfulness": 7, "user": "Connie Y", "date": "January 9, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4332788}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "We found the casino to be lively and somewhat lucky. The private beach with free ferry service was the most relaxing part of the stay.", "title": "NOT the Wyndham El Conquistador Resort", "helpfulness": 26, "user": "yakityakity", "date": "January 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 4330715}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Once you stay here you will not want to stay anywhere else in Puerto Rico. I just returned from 5 days at the El Conquistador and found it to be a absolutely wonderful! We took advantage of the \"summer special\" of $99 a night. Paying such a low price we really didn't expect much. But we were delighted to find the room was clean and very spacious with a spectacular view of the ocean from our private balcony! The setting of this sprawling property is on a cliff overlooking the Caribbean and let me tell you the views are breathtaking! I would start my day by grabbing a coffee early at David's Cookies off the lobby and just sit outside on one of the patios and look at the magnificent views around me. The pools are superb--clean and well maintained, as is the entire complex. The various restaurants on site tended to be pricey, but there are enough choices to eat reasonably without leaving the property. The staff was top-notch, friendly, and helpful. One thing to keep in mind: parking is $15 a day, and there are hotel taxes added on to your bill that you should be aware of when you book. But for the deal I got, and the sheer beauty of this place, I will be back!", "title": "Puerto Rican Paradise!", "helpfulness": 6, "user": "FriarBri", "date": "August 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5710868, "likes": {"liked": "— The beauty of the views and the property"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Let me start of by saying if you travel to the El Con you will have a wonderful vacation. Pleas do not believe all the negative hype on the site. It’s just not true. We recently returned from an 8 night stay at the resort and found that it met or exceeded our expectations. We had a party of 7 (4 adults, 3 children ages 10, 13 and 14). We are from NJ and CT and have traveled to many locals with and with our children over the years. We can be picky but I must say everyone had an enjoyable time. Here's the deal-", "title": "A Fantastic Resort and Island", "helpfulness": 6, "user": "SB2564", "date": "August 11, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5601475}, {"rating": 5.0, "title": "Great Resort in Puerto Rico", "text": "We arrived at the resort Tuesday July 25th. We rented a minivan which I would suggest doing. It gave us the freedom to explore and go off the resort to local restaurants for dinner. The hotel shuttle is about $66 R/T per person. Our two families split the rental which came to about $250 per family and we had use of a car all week long. They do charge daily for parking but I suggest when you depart you ask for some of that to be removed from the bill. We waited for our car from valet one night for about 45min. We mentioned that before we checked out and were only charged 3 nights for parking. The staff is very accommodating but you'll have to put in a little time and effort to get exactly what you want/except. Check-in was somewhat slow. The rooms we had been promised were booked (In the Las Brisas bldg). Apparently there was a large wedding taking place over the weekend and the entire building had been reserved. They put us in the Vista wing of the hotel overlooking the pool with a spectacular ocean view. These rooms were a bit smaller than what we had reserved. The told us they could move us on Thursday to a newer building adjacent to the vistas. This building had larger rooms (King bed with pull-out couch) and had 6 floors instead of 4 and a balcony. They put us on the 6th floor. I suggest this part of the resort or Las Brisas when traveling with kids. The resort is large and you will be in a central locale to all the resort has to offer. The rooms we were in were not falling apart. They were very clean; beds were comfortable and not really outdated. The bathroom was quite large and in great shape. AC worked well too.", "helpfulness": 5, "user": "NewYorkvacationer", "date": "August 11, 2006", "id": 5600842}, {"rating": 4.0, "title": "Had a great time at El Con", "text": "The resort has many restaurants. The prices tend to be somewhat expensive but no more than you would pay at any other resort. I must say that we didn’t have one bad meal at the resort. The food was very good. You can do a casual meal outside on the patio overlooking the pool or a more formal one at Stingrays or Blossoms. Do yourself a favor. Get some food for the room like bagels, cereal etc if you want to save a bit of money. The room has a coffee machine. We also bought some rum and beer on hand to make drinks. The only issue I has was paying $5.50 for a bottle of beer. Go to the local supermarket and get a Styrofoam cooler for $2.00 and fill it up. Rooms also have small refrigerators too.", "helpfulness": 4, "user": "Stanno", "date": "August 10, 2006", "id": 5593740}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "The pools were clean and refreshing. There are 3 pools and a waterslide on the main level. I would also suggest going over to Las Casitas to swim in the infinity pool. Although it states that only guests of the Casitas can utilize the pool, we went several times and were handed towels from the staff. No one will bother you. It’s a beautiful pool with a magnificent view. Palomino Island was also a favorite among our group. Taking the boat ride to the island is fun and enjoyable. Once you arrive on the beautiful island, everything you need is there. Food, drinks, lounge chairs, towels, snorkeling gear, jet skis etc etc. The beach is a bit rocky when entering the water but once you get into the beautiful Caribbean, you’ll forget all about it.", "title": "Can't Wait to go Back", "helpfulness": 3, "user": "DavidCoquita", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5509315, "likes": {"liked": "— The Views", "disliked": "— Rooms need to be updated"}}, {"rating": 2.0, "title": "Unless you are being paid to stay here, don't", "text": "We stayed at the El Conquistador from December 20, 2005 through Christmas Day. I am a travel agent, and would not recommend this resort to my clients.", "helpfulness": 21, "user": "peamomma", "date": "December 28, 2005", "id": 4306986}, {"rating": 4.0, "title": "Nice hotel in Puerto Rico", "text": "Upfront summary: Unless you have very low expectations for quality and service and have very, very deep pockets, I would not recommend a stay at the Wyndham El Conquistador. It is a 2-3 star resort with 5 star prices. LXR Luxury Resorts purchased it about 6 months ago, however, there are severe management/operational problems with the resort.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 25, 2005", "id": 4300508}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "The hotel is about 30 miles from the airport, and takes about an hour and a half to travel to the hotel. You can arrange for a shuttle from the hotel (call ahead to arrange this). This will cost $32 per person each way.", "title": "Very nice, but very expensive", "helpfulness": 8, "user": "RLSBostonMA", "date": "December 25, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4300222}, {"rating": 5.0, "title": "Friendly, well maintained, good deal", "text": "The hotel looks great from the outside, but don’t look too closely, otherwise, you will see the circa 1960 veneer. The common areas are showing wear, and the guest rooms, although large, have definitely seen better days.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "December 24, 2005", "id": 4298796}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The hotel grounds are expansive, and there are guest rooms spread all over the resort. Depending on your room location, it can take you 20-30 minutes to get to the main lobby, incorporating a couple of elevators and the Funicular (trolley-like vehicle).", "title": "FABULOUS RESORT!!!", "helpfulness": 11, "user": "compassquest", "date": "December 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4254582}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We definitely enjoyed our stay at the Waldorf Astoria. Our room \"view\" was spectacular. On arrival the gentleman who assisted us with our luggage, noted that our bathroom sliding mirror was \"off\" of its sliding tract. He then called for service to repair the door.The room was missing several wall hangings, which I reported to the staff. On our third day, after our room was cleaned, we noted that the inner shower curtain was missing. I called for a hair dryer for the room. Our breakfast was mediocre at best. Our food was cold. Palamino Island was fun. I feel that the Waldorf Astoria should be aware that the beach is poorly cleaned. I did not see anyone doing an hourly \"pick up\" of discarded trash at the lounge areas. We feel that this simple, hourly sweep of the beach grounds would greatly enhance the experience and the Waldorf reputation for excellence.", "title": "Honest Review", "helpfulness": 3, "user": "Nancy G", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173285583}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Great resort to stay at. Lots of activities and a convenient shuttle to their private section of Palomino Island. My family and I stayed for three nights. Nice place. The down side- we could here everything out in the hall way from inside our room and it's a long walk to Las Olas Building from the main entrance.", "title": "El Conquistador", "user": "Jose G", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 173286515}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I use to live in Fajardo and I decided to stay in this Hotel just because is suppose to be a 5 stars hotel. IT WAS A NIGHTMARE! I arrived late at night and the front desk gave us a dirty room. I was really tired and wanted to sleep but had to wait for an hr until they gave me a cleaner room. No apologies no nothing. Plus they charge more money I pay an extra 140 plus what I already paid for 2 nights. I will not recomend this hotel to anybody. Worst hotel Iv'e ever been!!", "title": "DIRTY ROOMS", "helpfulness": 5, "user": "Natasha V", "date": "August 19, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 173085640}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The hotel is very good and clean. The staff in some of the restaurants and in the coqui water park need a lot of trainning. The Palomino Island is stunning. The food is very expensive and its not that good.", "title": "Good hotel, some of the staff needs to be trained", "user": "Waleska V", "date": "August 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173112055}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Went there in early August, The resort is worn down. Paint, floors etc. Service is good in some places (Las Brisas restaurant), subpar in some others (Cafe Caribe, pool wet bar).", "title": "You get what you pay for...", "user": "j l", "date": "August 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173027430}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The El Con is a 3 star hotel located on a 5 star piece of property with 2 star guests. We stayed one week from July 31st and got a great deal on Hotwire so I cannot complain about the room rate. Then we were upgraded to a beautiful oceanfront room with a terrace or balcony that was at least 12 feet by 13 feet and had breathtaking and ever changing views. The room had not yet been updated but we found it very clean and appreciated the DVD player, coffee pot (with free coffee) and mini fridge. The safe was big enough to hold a laptop plus other items. There were no robes and no turn down service than one comes to expect in most 4 star hotels. Contrary to many of the reviews we did not find anything missing from our room, all staff were always nice, polite and friendly and the two small complaints we had were corrected by maintenance within half an hour. We found our bill to be correct but had saved all receipts as a precaution.", "title": "3 star hotel on a 5 star piece of real estate", "helpfulness": 4, "user": "monicajay", "date": "August 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 8376201, "likes": {"liked": "— The views were spectacular", "disliked": "— Everything at this hotel is WAY to expensive - worse than we have ever seen"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2004, traveled on business", "text": "Fortunately and based on information we had read in previous reviews we rented a car at the airport for the duration of the trip. We used the self parking which cost $15.00 plus tax per day but was well worth it as it allowed us to do all our sightseeing and exploring on our own along with many outings for meals. We bought our own breakfast supplies and ate on our terrace each morning. We even went to town to the blockbuster and rented movies.", "title": "Beautiful hotel", "user": "HollyBear75", "date": "August 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 8369340, "likes": {"liked": "— Beautiful - just beautiful", "disliked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The private island is spectacular and some of the food is cheaper there than at the hotel, a fact which made no sense to us. Jet skis $110 per hour, double kayaks $38.00 per hour. Mask and fins and snorkel $15.00 just to give you a reference for rental rates. They also had sailboats, horseback riding and a sort of mini-put. The snorkelling was great about 200 ft off shore but we had to laugh as most guests stayed within 30 or 40 feet where there was absolutely nothing to see but the odd stray fish. The ferry could use a schedule and the funicular must become a huge problem when the hotel is full but was fine during our stay.", "title": "Wonderful views, don't forget your sunscreen!", "helpfulness": 1, "user": "Lovestotravelgirlie", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8363291, "likes": {"liked": "— the views and palamino island", "disliked": "— pricey food"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "We found two major problems for us at this hotel. The first, being the cost of everything. The cheapest bottle of wine on any menu is $40 but once you add tax and tip you are closer to $50. A hotdog and fries is $10 of course you still have tax and tip.", "title": "Is Good But Can Improve", "helpfulness": 1, "user": "Diana D", "date": "August 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8350281, "likes": {"liked": "— The views and the service.", "disliked": "— Problems with the A/C."}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Beer is $6 and drinks range from $8 to $14, again you must add tax and tip. Everybody we spoke to at the hotel felt it was pushed over the top and most were consuming all kinds food and drink in their rooms to avoid the excessive charges. We enjoyed a meal in the Chinese restaurant $60.00 for 2 with no drinks and the Italian at $75.00 for 2 with no drinks or wine. Both restaurants gave us excellent service and above average food. We also shared a pizza one night by the pool which came to $22 and was really good.", "title": "Be warned do not stay in this hotel", "helpfulness": 2, "user": "sbxplaya", "date": "August 3, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 3.0}, "id": 8316337, "likes": {"liked": "— The best thing was when i left the hotel.", "disliked": "— Service was the worst for any hotel i have stayed in."}}, {"rating": 4.0, "title": "Wonderful!", "text": "My husband, two teenage girls and I stayed there last summer(when it was a Wyndam) for a family reunion on my husband's side. We had a wonderful time. Service was always friendly. Our rooms cleaned nicely and daily-very nice and accomodating maids. Our room was modern, clean and had a big walk in closet! And a great ocean view.", "user": "cardonacasa", "date": "January 25, 2006", "id": 4387923}, {"rating": 4.0, "title": "Had a great time", "text": "The resort is beautiful and big! It is surrounded for miles by the spectacular golf course. Palomino Island is a must! The water there is chrystal clear and so warm-I could have gone there every day during our week long stay.", "user": "mmoneill", "date": "January 22, 2006", "id": 4370693}, {"rating": 4.0, "title": "Beautiful!", "text": "The lobby is very attractive, with lots of areas for visiting, reading, playing card games, etc. I did not see any \"neglect\" as some reviewers have written. The only two down sides to the hotel were:", "user": "A TripAdvisor user", "date": "January 21, 2006", "id": 4367276}, {"rating": 4.0, "title": "Great place to stay if you manage your expectations.", "text": "Very medicore food. Expensive as you would expect at a resort, but boring. I would have like to see \"local\" food on the menus rather than bland \"americanized\" food.", "user": "Costasid", "date": "January 20, 2006", "id": 4365877}, {"rating": 2.0, "title": "El Conquistador a resort in decline.", "text": "Very crowded pool area. Seems June and July are when the local kids come to spend the day at the pool, and it was far too noisy and kid laden for us. We skipped the pool and went to the island instead.", "user": "A TripAdvisor user", "date": "January 20, 2006", "id": 4365524}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My husband, my teenage son and I found this hotel by accident on a discount hotel website! The view is amazing, the rooms are nicely appointed (we were in the rooms that were refurnished from the floor up). The staff is friendly and helpful. There are several pools throughout the resort and a water park, too!", "title": "Enormous resort - quite breathtaking location!", "user": "SarahBG", "date": "December 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121763588}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Parking was additional at $16.00 a day, so count that in your budget. As a cost-considering traveler, there is no economical way to eat at any of the facilities here (cheapest we saw was $9 for a sandwich) particularly with a teenage boy! Solution: drive to Ralph's Supermarket and load up there on basics and snacks. Small fridge in room, but big enough to store milk, cold cuts, etc.", "title": "Love the beach property", "helpfulness": 1, "user": "maggie44113", "date": "December 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 121761277}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Also, Bacardi Gold is sold in the supermarkets here...a bottle for $11, and a couple of cans of local juices sure beat the $10 per drink price tag at the bar/restaurant!", "title": "Stunning visually, warm hospitality, a bit dated.", "user": "gringoron", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121739047}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "While this sprawling resort has a lot to offer, unfortunately the hotel buildings need a lot of updating/repairs. I enjoyed two rather pricey yet luxurious spa treatments in the lovely Golden Door Spa and had some excellent meals at the resort restaurants yet I hesitated to give this a 4 star due in part to some preparedness issues. When we arrived, the check in line was very long so we went outside to enjoy the patio bar - however, they did not have any cold beer! So we went to the pool bar where they did not have any limes! While the staff was apologetic and attentive, for the prices charged, I would expect far better. While we waited for the ferry/shuttle to the beach property one morning [they only were providing service once per hour] we wanted to go to the pool down by the Marina but were told that we had to pay an entrance fee to Coqui Park, the slide park which adjoins the pool. It should be available to all guests of the resort at no charge, especially since we did not want to use the slide park, only wait poolside for the next ferry. The beach property is very nicely maintained and managed - the beach service somewhat sporadic but the water and wonderful weather we had more than made up for that. All in all, the property has some exceptional features yet needs attention and updating.", "title": "Excellent hotel and hospitality", "helpfulness": 1, "user": "vicky s", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121701700}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Beautiful resort. Generally excellent staff. Rooms are dated. Resort food mediocre: get a car and try local panaderias for breakfast and Calizo, La Estacion and Metropol for lunch/dinner. A real find: Racar's Seafood in Las Croabas. Mix own drinks with local DonQ rum if you want to save $. Driving own car: watch for potholes and erratic drivers, drive defensively, consider prayer. Consider visiting Humacao, 45 minutes to south, if you seek a local retirement resort. For Old Town, consider parking on outskirts to avoid extremely narrow streets and use free trolley inside Old Town. El Yunque: arrive early to avoid rain/mosquitos and carry water on trails. Seek help of Conceirge to avoid bad areas, especially at night. Self-parking is adequate, so no need to use valet service. Palomino Island: nice, but bring repellent if bugs are a concern.", "title": "Beautiful Resort!", "helpfulness": 2, "user": "jerry1844", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121593964}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We have just returned from our amazing stay at The El Conquistador Resort and Golden Door Spa (Arrival April 27, 2007 - Departure May 5, 2007) Our two children actually cried the whole way to the airport on the day we departed. They did not want to leave and neither did we!", "title": "El Conquistador Is THE BEST!!!", "helpfulness": 1, "user": "YGD", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7586321, "likes": {"liked": "— The luxury rooms, service, amenities and amazing views.", "disliked": "— Not applicable"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007", "text": "This phenomenal property is located on a cliff with unsurpassed ocean views. Our two connecting rooms were deluxe with large bathrooms (nicely upgraded), walk-in closets, large bedrooms, nice sized balcony and flat screen TVs (full cable access). I might also mention that the beds were very comfortable!", "title": "save your $$$", "helpfulness": 1, "user": "kytraveler99", "date": "May 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7586156}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "There is so much to do while \"on property\" that we never felt the need to leave. We all enjoyed the two brand new $2 million+ catamarans that sweep you from the Hotel's marina to their private island. We visited the island every day - sometimes staying 2 hours, sometimes longer. Our two children (ages 3 and 6) played endlessly in the safe clear water while we relaxed over cocktails and good reading.", "title": "El Conquistador", "helpfulness": 4, "user": "plaindealer", "date": "May 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7571389, "likes": {"liked": "— The rooms, view and staff", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "There is fun for the adults, too! I had the most amazing 80 minute facial (The Rainforest Organic Facial) at the Golden Door Spa. I personally belong to a very high end spa in Colorado and the Golden Door was superior to my spa by far! I highly recommend the Rainforest Facial, all of the massages and the reflexology treatment. You will not be disappointed! The treatments along with the venue are superb. I also attended many of the fitness classes at the spa. One of the instructors taught me some great balance techniques during a group class. This particular trainer was very knowledgeable and used to train Mariah Carey!", "title": "Resort is pricey and lousy but location is simply awesome", "helpfulness": 2, "user": "incognito2007", "date": "May 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 7567905, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband skipped the spa and played two rounds on the golf course. He was pretty excited to get to play more than once! I know he had a great time. I did not play the course but drove by it a few times in the complimentary valet golf cart. The course is beautiful with breathtaking views and lovely landscaping.", "title": "Overpriced and unbearably rude staff", "helpfulness": 4, "user": "tricia_la", "date": "May 6, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "rooms": 5.0, "location": 5.0}, "id": 7552535, "likes": {"liked": "— Grounds and facilities were beautiful and well-kept", "disliked": "— Unbearably rude staff and overpriced food and beverages"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at Brisas room with an ocean view and it was great. To me the resort was too big that everything was a long walk. During our stay some elavators were not working adding to added stairs. Walked about a little and I am so glad that we stayed at the Brisas room as the other area seemed small with little privacy. Cannot comment about the room itself. Breakfast buffet was pretty much the same every day that after 3 days I was tired of it. Since it was pre-paid, something to the tune of $16 PP I did not go elsewhere. The Japanese retaurant was a joke. Not sure how they got the awards. The prices were like a 5 star, but plastic plates and the cheap wooden chopsticks and bad service. Food / sushi was okay but not worth the price. Wife went to the spa, the sauna and hot tub was not working!! The private island was nice but no service. Had to walk all the way to the only one place that was open. Wait staff did not come to you. Parking is another issue. It is a good hike down. They have a shuttle but it is not always available and $15 per day. They should have a few golf carts. This resort is in the middle of nowhere so either have a car or plan on staying in the resort. All and all it is not a bad place but not worth the money you pay for it. The only 5 star here are the prices.", "title": "One week stay", "user": "Kingwood1811", "date": "December 18, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121858530}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "What a great property. Got an upgrade to an Ocean view room in building three. Outstanding panoramic view of the sea and the hotel island. The resort fee includes a free boat ride to the hotel's private island which has a beach, restaurant, Volleyball, etc. Self parking is 15 dollars and a short walk away from the hotel but just walking around this gorgeous property (say to the Gym which was pretty good, or to the parking which also has a shuttle bus ) you are surrounded by amazing views. Didn't eat at any of the hotel restaurants but got coffee from the Resort Starbucks.", "title": "Wow", "user": "Smartflyer", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121855245}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I am glad I didn't stay at San Juan which is ok but nowhere near as beautiful as the vast resort.", "title": "We were Wowed by the Views!", "user": "mountainmama79", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121836823}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Definitely a great place and would love to stay here again.", "title": "Very Nice", "helpfulness": 1, "user": "tonytronic", "date": "December 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121827035}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We stayed at this resort for one night pre-cruise. Although it is about an hour drive from San Juan, we found it to be well worth the time and effort. The property is gorgeous! The staff was friendly and helpful from the time we pulled up to the lobby. Our room had a french balcony overlooking the pools and an ocean view. We spent the morning just walking the property. The scenery is breathtaking from the ocean to the mountains. Very convenient to El Yunque rainforest. Be aware there is a charge to park and the restaurants can be pricey. There is a Walmart on the drive in for anything you want to pick up. We would definitely stay here again.", "title": "Beautiful Hotel", "user": "slattmando", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121763713}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We just returned from 10 days at El Conquistador. Everything was just perfect. We stayed in Las Casitas but had been at the hotel the prior year. Both are great although we liked Las Casitas more because of the privacy, the larger accomodations and the quieter atmosphere (although still close to the hotel).", "title": "Great Experience", "user": "Pamory", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14566615}, {"rating": 5.0, "title": "Resort that Deserves Recgonition", "text": "Especially great are the people there. Our \"butlers\" Manny Santiago and Wilfred couldn't do enough for us - reservations, shopping, renting a car, advice re: local restaurants, visiting old San Juan, dealing with a couple of glitches in the room, room keys, etc and giving us advice on where to go, etc. They practically became part of the family. Very professional, kind and effective.", "user": "mcmac514", "date": "March 26, 2008", "id": 14566462}, {"rating": 4.0, "title": "Beautiful resort but pricey!", "text": "My husband and I stayed at this resort for a trip I had won through Southern Living at Home. I have to say that I was very nervous with all the bad reviews of this hotel but the trip was free so of course, we took the chance. The bus ride is a long one, but I caught a nap! Our check in was a little bit different since the resort was sold out for SLAH. Check in was not the greatest, we went to check in at 3:45 after standing in line for quite some time (again, due to 1100 people checking in that day) and was told that the room would be ready at 4pm. I had to stand in another line to see if my room was ready and finally it was at around 4:30ish. The bad thing is that while we waited for our room, there wasn't a single bar open. We went to the casino and the guy there was very nice and went back and got us 3 beers and a pina colada on the house and urged us to complain to the front desk. They ended up giving us an oceanview room so we were pleased. We found the staff to be very, very nice. If I would have paid their normal rate, I might have been a little disappointed in the room. I would say it was average. The room had a good amount of space with a nice balcony but it could use an update, but nothing appeared to be dirty and we didn't see any signs of mildew or anything else that others have complained about. The bathroom area is huge and there is a very large walk in closet with a safe. THe actual bathroom with the toilet and shower is small but there is a large dressing area that has a fridge and very big mirror and sink to get ready in. That was a definite plus!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 17, 2006", "id": 5356078}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "ONe thing I will warn you about is that the prices there are OUTRAGOUS! I almost passed out when I saw the menus! 18.00 for a hamburger, 16.00 for a hot dog, 9.00 for a glass of wine at one of the restaurants (for an average Pinot Grigio) and 7.00 for a Corona. We wised up pretty quickly and jumped in a cab the following morning to the closest grocery store. That ride cost us 40.00 but the rate is set by the govt. We stocked up on liquor, snacks and other stuff because we were not paying those prices! The Bally Hoo bar down by the marina had reasonable prices, 10.00 for quesadillas I didn't think was too bad and they were good! The only other place we ate at was at Stingray. The food was excellent and the prices not too out of line.", "title": "Nice trip but the El Conquistador Could Use an Update", "helpfulness": 8, "user": "ATR25", "date": "June 16, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5354112}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Waiting for a taxi is an issue, we had to wait for an hour to get a taxi and found out later that we could have walked there (which we did on the way back). The conceriege didn't relay this info to us but we went to Ocean View. If you are looking for a quick dinner, you won't get it there but the food is great, it appears to be a hole in the wall that is family owned but again, you aren't there for the atmosphere! We all laughed about it later, I think we were there about 2 1/2 hours. They do the best the can and we were glad we went.", "title": "Ignore bad reviews - this hotel was amazing!!", "helpfulness": 8, "user": "LinzS914", "date": "June 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5339526}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "There are definitely some negatives to this resort but some awesome positives. We had no problem at all taking the ferry over to the island, we did have to stand in line at times but we loved the island. There are wild rabbits there that are huge and they will walk right up to you and let you feed them. That was cool. The swimming was great, lots and lots of seaweed on one side. The other side is extremely breezy and the beach is rocky rather than seaweed. Lots of people were finding starfish in the water. Some idiots decided to take them home which we knew was illegal but they don't seem to realize that a living creature is inside the starfish. We played with our for awhile and swam around with it and it's awesome how gently it latches on to your hand and is very flexible in your palm, we of course put it back where we found it. We did spot several jellyfish so be careful and I got a great glimpse of a large stingray. We snorkeled of course, it's better snorkeling on the other side where it is breezy but be sure to bring your water shoes.", "title": "Don't bother - expensive, tired rooms, generally not helpful staff", "helpfulness": 6, "user": "dottie dog", "date": "June 12, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5335681}, {"rating": 1.0, "title": "Wasted Money - El Conquistador Resort & Golden Door Spa", "text": "Overall, great trip since it was free and the views are spectacular. Being more prepared with snacks going in would be good to save some money!", "helpfulness": 8, "user": "mmoore408", "date": "June 7, 2006", "id": 5318460}, {"rating": 5.0, "title": "Great Hotel!", "text": "The Red Door spa was the BEST! Hotel has a water park, golf course and marina. Beautiful views and really nice employees. The sushi in the Japanese/Chinese restaurant was outstanding! Would love to go again!", "user": "NatashaP-M", "date": "February 15, 2010", "id": 56092581}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "I really wanted to like this hotel - it's absolutely gorgeous and the scenery and views are amazing.", "title": "Prepare to Spend All of Your Time Waiting", "helpfulness": 1, "user": "JadieR", "date": "February 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 55937329}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "But it's such a frustrating experience I seriously can't see myself going back. The biggest problem is that you will wait for EVERYTHING. Checking in took about 30 minutes because of the line. Getting a bellhop to bring my bags (wasn't given the option of taking them myself), another 35 minutes. Waiting for elevators, waiting for the funicular (usually about 5-10 minutes), waiting for the water taxi to the island. The waiting for breakfast was unbelievable - the Las Brissas had about 30 people in line JUST to put your name on a list, and other restaurants were closed after 10 am (I was turned away at 10:03 - sorry, I was waiting for elevators and the funicular). Call the front desk? Be put on hold for 10 minutes. You spend so much time waiting you barely have time to enjoy the place.", "title": "Holiday Inn style, Waldorf-Astoria prices", "helpfulness": 1, "user": "mikevwguy", "date": "February 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 55829214}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The other problem is that as a solo traveler you're pretty much invisible. The staff is friendly when they DO notice you, but if you don't have 3 children with you prepare to be ignored by the staff. That is, if you're not being hit on. My first day one of the male members of the staff decided to interrogate me about why I came alone and then suggested that he and I could \"have some fun together.\" UGH. I just wanted to have a relaxing weekend and this is what I have to deal with?", "title": "A surprising, Caribbean gem only three hours from New York's JFK", "helpfulness": 1, "user": "weedybeedy", "date": "February 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55802436}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I don't think I'll come back here. It's a shame - it really is a beautiful place but there are insufficient staff/facilities for the number of guests.", "title": "Beware of the Bed Bugs!", "helpfulness": 4, "user": "Frances70NewJersey", "date": "February 10, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 55674070}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed at the El Con in February of 2007 in a La Marina room before the renovation and the water park and during the convention center construction. We received a great offer to come back and visit after the renovations were completed so we found ourselves back in La Marina February 9-16th of 2008.", "title": "Even Better the Second Time Around!", "user": "Wilda", "date": "April 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14944196, "likes": {"liked": "— Beauty of the resort", "disliked": "— Nothing. Although anyone with a mobility issue may be challenged at this resort, it is very large."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "The rooms are bright and tasteful, if somewhat IKEA in style. All of the standard upgrades that you would expect; flat screen tv, better bedding, more spa products in the room.", "title": "Way overpriced, not worth it at all!", "helpfulness": 2, "user": "Talltexan14", "date": "April 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 14920450, "likes": {"liked": "— The private island and its beach", "disliked": "— Food prices and the poor staff service. The shuttle service from the airport made me feel robbed."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The service remains consistently friendly. Not once in either one of our trips did we have poor service. I honestly don't get the horror stories that I read here about poor/lackluster service.", "title": "Absolutely Beautiful, Dont Let Negative Reviews Scare you", "helpfulness": 1, "user": "babyblooeyes21", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14872175, "likes": {"liked": "— Palamino Island ten minute ferry ride to a private island, unbelievable", "disliked": "— the long ride from the airport (45 min- 1 hr)"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Giovanni Jones was outstanding, professional, and really went above and beyond to insure satisfaction. Everyone from the bellmen to the valets to housekeeping were very outgoing and approachable.", "title": "Great People & Service", "helpfulness": 1, "user": "outboating", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14834225, "likes": {"liked": "— Great Staff, very Friendly, Hilda was great hostess at Drakes", "disliked": "— To far from San Juan"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The food is another story. We are from New England and have an abundace of great restaurants so it is always a fun challenge to find the same quality. The Strip House and Blossoms, the Japanese restaurant were good. Stingrays, the seafood restaurant (remember where we're from) was a bust. Prices overall are high.", "title": "You can definitely do ALOT better than the El Con!", "helpfulness": 1, "user": "fatnsmelly", "date": "April 6, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 2.0}, "id": 14826929}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Simply shocking that this \"resort\" would be allowed to carry the Waldorf name. There is not one ounce of this place that represents luxury and service (except for maybe the spa). We went with 2 other couples on our trip here. One couple had recently gotten engaged and they didn't offer much of anything as a special treat. Service here definitely leaves much to be desired...", "title": "Sadly disappointing...", "helpfulness": 2, "user": "islabery", "date": "July 22, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 115660273}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The grounds and the buildings are not well kept at all, and one couple we were with had to change rooms 3 times before they got one that was all in working and presentable order.", "title": "Birthday family getaway", "helpfulness": 4, "user": "almondjoy_73", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115658532}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The private island is definitely nice - but you have to take a shuttle there and there water there is not really conducive to swimming (too shallow). The pools were dirty and too overcrowded to even consider.", "title": "Could be better", "helpfulness": 2, "user": "travelingforfuninNE", "date": "July 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 4.0}, "id": 115633105}, {"rating": 3.0, "stay_parameters": "Stayed July 2011", "text": "There are a couple of local eateries that are incredible (la estacion), but to get anywhere you either need a car or to hire a taxi. We walked off the resort one day and the roads were narrow and definitely not conducive to exploring the local area. This resort is also ages away from San Juan, and the traffic is horrible at night so this really forces you to stay around the resort. The food on the resort is pretty poor and the prices are way too expensive for what you get. You also had to wait up to 40 minutes for a breakfast table to open up.", "title": "Beautiful Views", "user": "Nursekatie79", "date": "July 21, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 115629322}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The only positive about this place was the spa treatments. The spa itself was ok, small but nice. The treatment was awesome and I don't think I've ever had a more incredible massage... too bad this is only one piece of the whole experience here.", "title": "Beautiful resort but food was overpriced for the quality", "user": "JRo3", "date": "July 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 115625021}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "What a gorgeous hotel! Yea, prices are high and service is slow and not what it should be, but the grounds and the amenities are something to see. We were upgraded to a ocean view room in Las Brisas. The view was amazing, the room was nice, but cleanliness not quite up to par. We rented a car and drove to the hotel from the airport and were never told when making the reservation for the room that if you rent a car from Enterprise you do NOT have to pay the daily parking fee of $16.05 (wow!)......so be advised. When we expressed our displeasure with the hotel staff never making this clear we got an \"oh well\" response. We tried the Cafe Caribe for food and were not impressed, maybe the price tag has something to do with that. But we went off property for dinner the next night--Calizo Seafood--excellent! And just moments away from the hotel. Breakfast was included in our stay at Las Brisas restaurant and it was wonderful! Huge selection and amazing views! The funicular and Palomino ferry were very accesible and readily available. Will go again!", "title": "Good outweighs the bad!", "helpfulness": 1, "user": "Jessica7619", "date": "February 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56298717}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Just came back from this Resort travelling for 4 days with my 80 year old mother and two teenage boys. Overall, loved the resort and all it had to offer. We stayed in Las Olas in the middle section. Wanted a cot, but they wouldn't give us one because we had 2 queen beds, so my sons had to switch sleeping on the floor. No car, so we had to eat all our meals on-site. Took the shuttle to and from the resort. The rooms were very big and balcony was generous size with great views of the pool, ocean and Palomino Island.", "title": "Great Resort, High Prices, but Worth the Trip", "user": "spinner24", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 56283542}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Pros: staff was extremely friendly (some of the best in all of our travels), upper pools were crowded, but ours at Las Olas was not and is available to all hotel guests; island was very cool, even my mother travelled the funicular and all the walking that was needed; was a little rocky with coral, etc. so make sure you and kids have water shoes; snorkelling was ok if you can get out far enough, too murky close to the shore; funicular was easy to use and not long waits; we caught the catamaran every time to and fro the island with no wait or long lines; no car so eating at resort was very expensive.", "title": "Bed Bugs, Filthy, Terrible Management, Over Charged. Stay at your own risk", "helpfulness": 5, "user": "partnesr1407", "date": "February 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 56190785}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Cons: mini-frig didn't work when we checked in, then it took 2 days to get a new one. That one didn't work either. I filled an ice bag and stuck that in the frig. It kept it cold for rest of the stay. A little dirty......carpets need to be cleaned in the hallways. Room was clean, but balcony should have been rinsed off with a hose. Dirt and funk over most of it, couldn't really walk on it barefoot. Food was VERY expensive and drinks, but i expected this. Better for me than renting a car and trying to find some local joint to take everyone.", "title": "Exceptional Family Resort", "helpfulness": 1, "user": "travel4290", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56178773}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "At checkout, they didn't tally up my bill because they said charges were still coming in?? I still don't know what my final bill was and from what i am seeing on my card charges coming in today, it looks pretty screwed up.", "title": "Great for kids but a really bad beach", "user": "Tiranga", "date": "February 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 56158931}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I recently stayed at the Las Casitas in the El Conquistador during the tail end of my honeymoon. We came off a beautiful cruise to the Southern Caribbean with Royal Caribbean and thought what better time to visit the beautiful El Conquistador. I had stayed here approximately 3 years ago and loved the entire experience. This experience, however, left much to be desired.", "title": "Not the same", "helpfulness": 4, "user": "theprincipal77", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 8460419, "likes": {"liked": "— The spectacular views", "disliked": "— Poor Service, Unreasonable food prices, Crowds"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I booked a 1 bedroom villa in the Las Casitas. When we arrived, the room had not been cleaned. The refuse laid on the front landing. Additionally, we paid $500.00 for a oceanview. For one to see the ocean you must go out on the front landing and look around the palm trees. We made the best of the stay becase of our prior experience; that was until we went to dinner. Being from NY, we are accostumed to higher prices, however, this was insulting. The restaurants were mediocre at best.", "title": "Can't wait to return to the El Con", "helpfulness": 2, "user": "Margarita923", "date": "August 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8431793, "likes": {"liked": "— Beautiful scenery and friendly faces - diving with William and Tito", "disliked": "— Wish they let the El Con guests use the Las Casitas pools"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "During our previous stay, we were entitled to a complimentary breakfast at the Las Casitas. When we awoke, we did not see the same continental breakfast. We asked the wait staff and were told: \"there is new management, no more breakfast.\" We visited the concierge and were informed that the information given by the waitstaff was correct; the new management eliminated the breakfast. Subsequently, I had the $18.00 \"Golden Spa\" egg white omelet.", "title": "wouldnevergoagain", "helpfulness": 4, "user": "ministerhughes", "date": "August 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8400738, "likes": {"liked": "— the scenery", "disliked": "— the prices"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We complained to the concierge about the messy, outdated villa. As a result, they moved our room, but informed us that he could not assist us further. He promised to send a bellboy to assist us with our luggage. Unfortunately, he forgot. I called and voiced my frustration. A bellboy arrived and brought us to a new room. The room was better, but not worth the rate. We became so frustrated that we contacted the airline and cut our visit short. The airline informed us that it would cost an additional $200.00 per person. It was worth salvaging our wonderful honeymoon experience. When we called the concierge, they did not seem surprised.", "title": "conquistodor was freakin expensive but nice vaca. will do allinclusive next time", "helpfulness": 2, "user": "jenn8995", "date": "August 11, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 8396496, "likes": {"liked": "— beach was beautiful but rocky", "disliked": "— front desk girls.. prices of the food"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Overall, the resort has beautiful property, but the El Conquistador seemed to be open to the public as a day resort which made for crowded pools and a not so luxorious Las Casitas. It was very disappointing because we loved it so much on our previous visit. I was relieved that when we boarded the shuttle bus to the airport an older couple echoed the same sentiments about this disappointing visit. Additionally, they informed us that they paid $280.00 per night for the same room. I would not recommend this resort to anybody in the future. It is unfortunate because the property is beautiful, but definitely not worth the money for the food alone.", "title": "Dated and Faded - NOT a 5 Star!", "helpfulness": 6, "user": "emmakerins", "date": "August 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8388476, "likes": {"liked": "— Room Size", "disliked": "— Overall Decor"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "My husband and I took my 77-year-old mother and our teenage daughter to the El Con last week. Although we were told the property was at 100% capacity, we rarely felt that it was overly crowded, as the place is absolutely huge! We rented a car at SJU, which ended up being cheaper for the 4 of us than taking the hotel shuttle. Having the car made it possible for us to stock up on some breakfast items, tour the El Yunque rainforest, and visit a friend in Luquillo for dinner.", "title": "Beautiful Resort - Worth Every Penny", "helpfulness": 1, "user": "Bandlady", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56848844}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The resort is beautifully decorated and landscaped, and is located on a cliff high above the ocean, making for stunning views. There are also rooms halfway down the cliff in the Las Olas section, and down by the water at La Marina. We were located in the marina section. All sections are connected by the funicular, which runs continually up and down the mountain. You really get an awesome view from there. Since the property is so large, be prepared to do a lot of walking.", "title": "straight forward experience", "helpfulness": 3, "user": "travel99boston", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56703831}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "OK, there have been some negative posts about this place recently, but I think people have to be realistic about what they will experience in Puerto Rico. The culture is much more relaxed than in the \"States\". Get on \"Puerto Rican time\" as soon as you can, and you will be happy. If you can't accept the more relaxed style, vacation somewhere else. However, the staff was extremely friendly and welcoming, and we've waited longer in many NYC restaurants than we ever did at El Con. The staff is clearly trying very hard to please.", "title": "disappointing", "user": "perfectvacay1", "date": "February 21, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 56686777}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Our room was beautiful, with a large bathroom and a marina view. The patio was quite large, and we enjoyed eating breakfast there. Everything was clean, although I believe the hotel will soon want to update some of the carpets and furnishings. We found the bed comfortable and the room amenities very nice. Yes, there was a coffee maker with excellent Puerto Rican coffee!", "title": "Nice Place for a Family Vacation", "user": "lbinutt", "date": "February 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 56644595}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "We would recommend the food at Stingray if you like seafood. We also ate at the bar at the marina. The food was fine, and the service excellent. The restaurant on Palomino Island had similar food and fine service, as well. Prices at Stingray were similar to NYC restaurants - dinner for 4 came to about $200. with drinks. Prices at the bar are about half that.", "title": "Great vacation", "user": "MPickhouse", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56622376}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We have recently came back to what we hoped,a great 15 year anniversary trip. This place came highly reconmend to us by people who have traveled extensively and who I trust. The hotel", "title": "paradise gone bad", "helpfulness": 5, "user": "GeorigaCasinoman", "date": "September 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8674535, "likes": {"liked": "— the room was very large", "disliked": "— casino staff non professional"}}, {"rating": 4.0, "title": "Great Resort I can tell they are making major improvements", "text": "is renoun for its service our so we thought. I booked through the casino at the resort because me and my wife like to gamble a little. The casnio is small but with a cosy personailty. Here is where the nightmare began on our anniversary night we had a great dinner at the strip house with is a premire steak house the food was excellent and service was above average. We decided to go to the casino around 11.30 p.m. for texas holdem limt play . My wife gracelessly asked if I would like to take the only empty seat at the one table they had. I sat down while she put her name on the waiting list for the next seat several others that came in after us also put there name on the waiting list. About 35 minutes went by, be for there was a open seat at the table, a gentleman who had just arrived at the casino took a seat my wife informed the dealer that she had been waiting for the seat for 35 minutes and her name was next on the list. The dealer continued to ignore her and continued to allow the gentleman who afford to give the seat up since there was a waiting list the dealer informed my wife that he would have the seat since he is a man and she could wait. Sexual Discrimanation at its worst she in formed the pit bose who also ignoed her and then procedded to ask for the casnio manager who also gave her lip service wanting to voice my opionin in the mattter but not wanting to trump my wife handling of this matter I continued to be a spectator, after the situation continued with not the slightest apology or resolution ,she told me she was going up stairs to pack and that we checking out after that, but for me to continue my game till then. They had numerous opportunities to apologize to her but they never did . They did offer us dinner on them witch we refused. This casnio is poorly ran with the dealers not knowning the rules and pit boses who are not capable of making sound judgements as to the gaming rules , not all the dealers and pit boses, but most are poorly trained . When my wife came down to say she was ready to check out at 3.00am, I gatherd my chips and in the hast to leave took my cards that we in play at the table with my chips. They offerd me a 3 night comp Till this day I have never recieved our room comp that they said should make up for the blatent sexual discrimination that presist in the el conquistador resorts casino . .So women beware sexual discrimination is alive and well in that resort. It truely could be one of the premire resorts in the caribbean, It is a shame the management will not step up and address this issue, as any competent resort would. They will never make that 5 star if this is not changed .", "helpfulness": 3, "user": "travel21stcentury", "date": "August 29, 2007", "id": 8538592}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I have to say that I too was a little concerned after having read the many previous reviews.", "title": "Awesome place", "user": "Digital824", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8525416}, {"rating": 2.0, "stay_parameters": "Stayed August 2007", "text": "To the best of my knowledge many of the rooms have been completely renovated. A previous review had suggested the Las Brisas section of the resort. I asked for this section and in fact the room was completely renovated. The flooring, furniture and bedding were if brand new. The ocean view from this section was incredible. The room was spotlessly clean.", "title": "Will not return", "helpfulness": 2, "user": "alloverwhenican", "date": "August 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8518297}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The balcony is great for having breakfast in the AM.", "title": "Wow!!!", "user": "tears1988", "date": "August 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 8505867, "likes": {"liked": "— Beautiful Grounds and private island", "disliked": "— overpricing in food and services"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Went on a girls long weekend, the grounds are beautiful and I would highly recommend staying at the Casitas. While everything is connected, the El Conquistador hotel was huge and the pool area was massive - lots of chairs, lots of people, I felt like it was \"spring break-ish\". The casitas were more secluded and the pool area (not the one by the restaurant) was spectacular- we used it everyday and didn't even venture to the island that the resort has.", "title": "Great Place to relax but it is not a 5 star", "helpfulness": 3, "user": "JJFBEAN", "date": "May 21, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 7669017, "likes": {"liked": "— The Location - it is by far the most breathtaking views", "disliked": "— The Rooms and the Prices"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I have stayed in many hotels (I am a big business traveler), and if you say you are a 5 star, then I expect a certain level. While everyone was nice and accomodating, I can safely say the rooms are not 5 star qualilty (we moved because the first room we were placed in was at best, a room that you would get at a Quality Inn). The second room had a balcony and a view of nothing much but it was far superior than the first room. We were moved quickly and the butler (nice name for a bell boy) was very social. The service was not 5 star, they were nice but S-L-O-W, and considering they include a 20% tip in every transaction, why should they servers go faster? Everyday, we had to go and find a server to come to the pool area. At the pool, we would havedrinks and lunch and bill was always around $100 - we didn't drink anything fancy it is just that expensive. A diet coke can was 4.95, just for an example of the prices. We got room service and it was another $100. they charge you double the service charge to deliver to the casitas and the 20% tip.", "title": "Beautiful Hotel, all in all good bet", "helpfulness": 1, "user": "Ria H", "date": "May 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7668924, "likes": {"liked": "— views", "disliked": "— prices of food"}}, {"rating": 4.0, "title": "Good overall", "text": "The marina area is dumpy and the Los Olos area isn't much nicer, we only went to the marina to get picked up for the bioluminecent tour. The kayaking was nice but make sure you use BUG spray, I did and still have 12 bites on one arm. Good experience to go into the lagoon and you do get wet, so bring a towel for when you are finished. Don't bring cameras, etc. they will get wet.", "helpfulness": 2, "user": "destination", "date": "May 19, 2007", "id": 7645934}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Got pizza from one of the restaurants and it was FABULOUS. seriously, the best meal we had. Ate at Strip, and it was very good, the service was exceptional and the manager on duty was doing everything right, he came by our table and ensured everything was going well (not obtrusively..just wanted to take care of his guests). I would recommend this place for a nice dinner.", "title": "Nowhere deserving of 5 stars; not in Four Seasons or Ritz league at all", "helpfulness": 2, "user": "No1DMBfan", "date": "May 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7627547, "likes": {"liked": "— private island", "disliked": "— poor service"}}, {"rating": 4.0, "title": "My experience and a few $ tips", "text": "Had massages at the spa, and I thought they did a nice job. Efficient, on time and most of all, I felt as thought I had gotten a massage.", "helpfulness": 7, "user": "ringaPr", "date": "May 12, 2007", "id": 7592848}, {"rating": 5.0, "title": "They saved my Vacation!!!", "text": "I was originally staying at Paradisus Resort (See my review) but Paradisus was terrible. I called The El Conquistador and was able to book one of the private Villas at Las Casitas Village. We packed our bags, left Paradisus and took a cab to the El Conquistador. Actually the El Conquistador sent the cab for us as Paradisus could not locate one!!!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 23, 2006", "id": 5376350}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "If you want to experience luxury, great service, superb food and friendly smiles than Las Casitas Village at the El Conquistador is the place to go. Our one bedroom Casita overlooked the ocean and had a huge balcony where we sipped wine in the evening and had coffee in the morning. The beautiful Infinity pool was busy but the two other private pools for Las Casitas guests always had Lounge chairs and friendly staff to serve you. I wish I had written down the names of the great staff that serviced our needs. I did meet one of the Food and Beverage Managers Ms Keyla Tarabochie who went above and beyond in getting us dinner reservations and spent time helping us plan our days so our dining experiences would be the highlight. Even the little snack bar named Virgin by the main pool serves a crab cake cobb salad worthy of any fine NYC restaurant. If the whole management team is of the level of Ms. Tarabochie than this resort will always succeed. Having just had such a bad experience at Paradisus my expectation level was low. Each day as I walked throught the beautifully landscaped grounds of the El Conquistador I was so pleased that I made the decision to leave Paradisus. I soon realized the my original expectations of Paradisus were being exceeded by the El Conquistador. Each day we planne to take the Ferry to the El Conquistadors private Island and beach but could not tear ourselves away from the luxury and service of Las Casitias. Now we have a reason to return. Thank you to everyone at the hotel that salvaged our vacation. The hotel and staff are tremendous.", "title": "Loved this resort. It is paradise", "helpfulness": 9, "user": "Ashley48", "date": "June 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5375226}, {"rating": 4.0, "title": "El Conquistador was great hotel to stay", "text": "I just came back from staying at El Con for a week with my husband and 2 kids ( 8 and 12). We loved every minute of our stay. We checked in a day before Southern Living group showed up so the check in took 5 minutes. United Airline had sent one of our suitcases to Chicage so the front desk sent us tooth brushes and tooth pastes as soon as we walked into our room. We had a deluxe ocean view room in Las Brisas only a floor down from the main lobby. That was a major plus since everything was very close by. The most important thing in this hotel is location of your room, cause it is so spread out that getting to the main lobby can be a pain if you are in the La Marine village and have to take the funicular.", "helpfulness": 6, "user": "Susan038", "date": "June 21, 2006", "id": 5372075}, {"rating": 2.0, "title": "El Conquistador Hotel and Spa No Way Jose!!!", "text": "My wife and i have been all around the world and have grown accustomed to resorts that actually meet their 5 star rating. The El Conquistador did not!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 27, 2006", "id": 5222741}, {"rating": 4.0, "title": "Close to Paradise!!", "text": "The room we had, located on the sixth floor facing Palomino Island, was outdated and no way could compete with the splendor of the ocean view.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 26, 2006", "id": 5223290}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The fixtures, furniture, and clothes drawers were pre 1980. The handles fell off the drawers, even after a resort maintenance employee spent several hours attempting to fix them.", "title": "Great Place!", "helpfulness": 1, "user": "RPGJr", "date": "May 24, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5226697}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The overall rating on this room should have been a minus star!", "title": "MAking sense of conflicting reviews", "helpfulness": 6, "user": "trey12345", "date": "May 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5188356}, {"rating": 5.0, "stay_parameters": "Stayed October 2002", "text": "The staff were outstanding, friendly but not very expeditious. Things took a while to happen.", "title": "Would Love to go back!", "helpfulness": 1, "user": "marielle03", "date": "May 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 5.0, "service": 4.0}, "id": 5180477}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I read alot of the reviews on this site. I feel that the conventions do take away from the experience. We had the opportunity to enjoy the resort before UBS came in. After that large crowds of families came to the resort. It does take away from the resort. Be aware the ugly American has arrived. (and I'm from New Jersey, LOL.)", "title": "Made Great New Friends", "user": "horsedadMorrisCounty", "date": "March 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14620954, "likes": {"liked": "— We are easy, the great people made our stay exceptional."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Bottom line, we made many new friends. Jessica Colon, the concierge supervisor is the kindest, most caring person we have run across in many hotels. Well before our trip we lost two family members. Jessica, was so kind and attentive that I decided to take a private car to the resort instead of the bus provided. Just to pick up flowers for her.", "title": "Overpriced, Over-rated", "helpfulness": 1, "user": "MNSinDC", "date": "March 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 14606880, "likes": {"liked": "— Pool/Beach", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Jessica set us up with Millinium Limos. Pedro the owner (whom I never met) provided superior service. Nestor, our friend and driver was fantastic. I could not imagine the island without Nestor. Nestor, took us and our friends to Old San Juan. His knowledge and experience made our trip second to none.", "title": "wonderful trip and experience", "user": "travel_for_the_kids", "date": "March 28, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 14605603, "likes": {"liked": "— everything one needed was right there on site and nicely delivered", "disliked": "— Although the boat was efficient and fun it would be nice to have a closer beach"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Norman, the bell captain, truly, made us feel like family. I know that Norman is now welcome in our home, as we are in his. We spent alot of time talking to him. He is a wonderful person.", "title": "Had a great time but....", "helpfulness": 1, "user": "dee051", "date": "March 27, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 14577377}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Selelnia, our server at the pool, was wonderful. Luis, Louis and Juan were also great.", "title": "Disappointed", "helpfulness": 1, "user": "nalvg", "date": "March 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 14576330, "likes": {"liked": "— The waterpark", "disliked": "— the beach"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "This property is absolutely wonderful. I was a little apprehensive when booking as I have a toddler and it seemed like a lot of walking, however our room was very close to the elevators, Starbucks, and some restaurants.", "title": "Beautiful and relaxing", "helpfulness": 1, "user": "Spabliss", "date": "August 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 174035829}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Upon arrival you are overcome by the breathtaking panoramic view.", "title": "Not a typical Waldorf Astoria", "helpfulness": 2, "user": "LtCheeseWhiz", "date": "August 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 173882249}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The pool area has enough to spend the whole day, and the private island is so peaceful and pristine. Lunch on palomino was great, and the stingray cafe was great. The family style restaurant is awful! I'm sorry I cannot remember the name of it, but it was TV dinner style food.", "title": "Great Vacation!", "helpfulness": 1, "user": "VirginiaRescue", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173879644}, {"rating": 4.0, "title": "A frequent and pleasant 'Day Trip' from our nearby Condo in Luquillo", "text": "We rented a car and there are plenty of restaurants around the El con to explore.", "user": "GoryJorysScriptorium", "date": "August 23, 2013", "id": 173644583}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "All in all a great stay and we would return.", "title": "Family vaca", "helpfulness": 1, "user": "Michele L", "date": "August 22, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 173532157}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "As a family it is a great hotel. It has great pools in the main building and an awesome water park just great for families with kids of all ages. Its own private island with a lot to do like jet skiing and horse back riding", "title": "Great Family Fun", "helpfulness": 1, "user": "Javier C", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173498317}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My overall experience with this hotel was horrible. Everything is way overpriced and you get charged a hotel fee every day based on the price of the room. The panoramic elevators was not working well. The door almost slammed shut on my daughters stroller twice. Once after the problem was addressed to the staff in the hotel. The main pool was inaccessible on sat because they rented it out for weddings. They offer the olay pool which is poorly maintained with no service for towels or drinks. Everything is a do it yourself. When it rained they left puddles on the path to get to the rooms by the olay pools. No service or any type of entertainment unless its a friday sat or sunday. During the week there is nothing they do for you besides offer you services in which you pay for. Very disappointing.", "title": "Be aware of hotel.", "helpfulness": 1, "user": "Gladys M", "date": "August 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 173596952}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The stay in this hotel was very satisfactory, my kids enjoyed a lot. The food was very expensive, I suggest buffets for breakfast and lunch. You can enter other economic restaurants. We did not like the food at Palomino must be other alternatives.", "title": "Waldorf Astoria", "user": "ReyBoricua", "date": "August 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173442970}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This was our first 'tropical' vacation with our small kids, and we all loved it! From the waterpark, to the adventurous boat ride to their private island, to the talking birds in the lobby, to their arcades/game rooms, we had a fabulous time and the kids did not want to leave. The staff was very courteous and well-trained and we had many choices of onsite restaurants in varying price ranges. The more pricier restaurants were excellent, but nearly double the cost of what you would get in the U.S., i.e., their sushi for example. Rooms were spacious and comfortable, although could use some updating. Beware of the parking lot! We had a rental car and often had to lift the access gate ourselves when trying to leave b/c it wouldn't work and there was no staff there to help validate our ticket. Valet might be worth the extra cost! Overall a beautiful resort.", "title": "Wonderful & beautiful family-friendly resort!", "user": "Amy T", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 173240242}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "this is supposed to be a Waldorf-Astoria level hotel, the only thing that is high class are the prices. Mininum of $10 per drink, food is very expensive at all the restaurants and not worth it, people were going in town to the WalMart for liquor and food and bringing it in. The rooms are old and worn. If you have children over 12 there is nothing for them to do, even though they say they have weekly activities, there is no one running them. No guest service, had to get our own towels and water at the pool. Staff very unfriendly, unless you are a local. Was a waste of a 20th anniversary trip. Many other choices out there..", "title": "Not worth the money", "helpfulness": 1, "user": "laura e", "date": "August 20, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 173215519}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My family stayed in the hotel for 5 nights to celebrate 2 happy family occasions. I have nothing but wonderful things to say: The rooms were beautiful, the food delicious and the entire setting was like a dream. I give 5 stars along to the hotel manager Dermot Connolly, who helped us plan our special celebrations, and went above and beyond to ensure our stay was magical. He helped us get wonderful last-minute dinner reservations, and fantastic champagne to celebrate a wedding anniversary. The hotel provided a great adventure for our family, which ranges in age from 12-56. We loved the amenities and great service of the staff. We look forward to many future visits!!", "title": "A most wonderful hotel, excellent staff!", "user": "Guest1234554321", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121440876}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The previous two days we had spent at the Ritz in San Juan with no ability to open the windows, so staying here was amazing. The ocean view room is the only way to go. I sat for many hours sipping a cocktail and just watching the incline and activity at the marina. We stayed at 4 different resorts during our visit and liked this the best. We ate at the Italian restaurant and found the food decent, service average for Puerto Rico. I will definately go back here.", "title": "Beautiful views, did I say beautiful views", "helpfulness": 1, "user": "Valerie K", "date": "December 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121432330}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I have been visiting this property since I was younger with my family, and this was absoluetly the best time I have ever had. Although the property has not changed physically, the location and amenities are very worth it (lot's of pools to choose from, Private Island with a great beach, lots of restaurants to choose from, close to El Yunque, golf, tennis, etc). When you go on a trip whether local tourist or not, you want to take a memory back with you and that is what my husband and I got thanks to the excellent service of the staff. Smiles, good Morning's, helpful attitudes all contributed to our trip. I have to mention Betzaida at Iguana's was awesome, Luis G at front desk very accomodating, Diane and Gian at Stingray's on our 2nd night made up for our only complaint (unprofessional service at the Strip House on the night of our Anniversary) with there very warm and professional approach, Richard and Elizabeth (best therapists at the Spa), and especially Grace and Tati from the Spa that before we arrived already made us feel welcome and motivated us to go back a 2nd time during our mini-vaca.", "title": "Wonderful Memory thanks to a great staff....", "user": "Yunquemarsita", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121421317}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I would say that the restaurant prices are a little on the too high side, but Overall would always highly recommend and can't wait to go back!!!!", "title": "Stay away from this property", "helpfulness": 3, "user": "buho66", "date": "December 4, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 121383799}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "If you can only eat one nice elegant dinner, Stingrays was great in food and service.", "title": "Beautiful Views", "user": "LaurenBlauvelt", "date": "December 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 121337903}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I've never actually been motivated to log onto trip advisor and write a review, but this hotel stay made me a believer in trip advisor. This place is SUCH a has been hotel. I won't go into detail about the tired decor and the poor cleaning job the room received (pillows smelled like mildew and there was TOOTHPASTE in the bathtub) but my issue is the PRICE HIJAKING they give you during your ENTIRE stay.", "title": "completely OVER RATED", "helpfulness": 5, "user": "CuppaJoe80", "date": "July 25, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 1.0, "service": 2.0}, "id": 115779671}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "This being a resort in the middle of no where they know you can't get, say, a bottle of water down the road so they charge you $3.75. They DOUBLE the price on EVERYTHING and you are held hostage in the resort (unless you want to go ALLLL the way out to your car and drive ALLL the way down that hill into town...and who is going to do that???).", "title": "Beautiful views but to pricey.", "helpfulness": 2, "user": "SheilaAnn1080", "date": "July 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 115728221}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "They charge insane prices for just ho hum service (check in/check out was HORRIFIC and took FOREVER and we had to stand in this crazy line the whole time). I was not blown away and I am writing this review so that you will know BEFORE you step foot into that place they will:", "title": "We HATE IT!", "helpfulness": 5, "user": "cruiseryatch", "date": "July 23, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115691514}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "1. charge you a ridiculous resort fee on TOP of your hotel room quote and local tax", "title": "Depends on what you are looking for...", "user": "frank123455", "date": "July 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 115689200}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "2. rack up the price on everything from a slice of pizza to bottled water", "title": "Poor Service and Hospitality", "helpfulness": 6, "user": "ravi01", "date": "July 22, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115669948}, {"rating": 2.0, "title": "Underwhelmed", "text": "I found the service at the Hotel to be poor at best except for the \"Otello Restaurant\" where the service was superb. The staff at Otello's is to be commended.", "user": "lroiboblogan", "date": "March 22, 2008", "id": 14444700}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "From the front desk to the bars to the other restaurants we where very disappointed with the lack of professionalism. I would expect that from a place charging $99 per night but not for $419 per night. The drinks and food where very overpriced for the service that we received. Otello's was expensive as well but we did not mind paying it in exchange for excellent food and service.", "title": "The WORST stay EVER!!!!", "helpfulness": 2, "user": "1serioustripcritic", "date": "March 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 14431140, "likes": {"liked": "— Water Park and Bedding", "disliked": "— Everything else"}}, {"rating": 5.0, "title": "Great Service at El Conquistador", "text": "The view was excellent but the overall resort was run down and needed a face lift.", "user": "smclaudio", "date": "March 16, 2008", "id": 14330408}, {"rating": 5.0, "title": "Butler service rocks! And great exercise classes!", "text": "Very Disappointed. Would never return.", "helpfulness": 1, "user": "weinybear", "date": "March 15, 2008", "id": 14300117}, {"rating": 5.0, "title": "Butler - Isreal Trevino", "text": "This was the worst stay that I ever had ever! The service was horrible. It took over an hour just to get a plate of chips at the BallyHoo Bar and Grill. All the restaurants had bad service and so-so food. Also, the prices were really high. It was $3.50 for a bottle of water. The room service took a hour and a half for a bowl of cereal and some coffee. Really, the only good thing was the comfort of the beds. The hotel workers were grumpy and unfriendly. It took a whole day to get the towels that I had ordered the day before. The hotel was one hour away from San Juan Airport and you need to take a bus to the hotel. There is no beach on the mainland so you have to go to Palomino Island, but there could be bad weather so you can't go to the beach all the time. The Las Olas pool and the water park pools are not heated. There is no jacuzzi at the water park and the shady seats are very, very limited. The normal seats are limited, too. The jacuzzi at Las Olas had BROWN water and towels are very had to come by, so if you see some, grab them. We stayed at the Marina, so we had to take trams to go up to the main hotel area. The first few times are O.K, but it gets old. The direction to hold on to the rails comes on AFTER the tram moves. All the rooms were recently renovated, but we thought that we were staying at a beachfront motel it looked so cheap. We thought the furniture was from IKEA. The service at the front desk takes minimum fifteen minutes to speak to someone, and they sound like they don't care. My daughter thought that this was horrible and wouldn't go back even if there was first class airfare all expenses paid. Our trip WAS all expenses paid and it was STILL bad. The food was good at The Strip House. They have great steak. But, that was it. A glass of wine costs at least fifteen to twenty dollars per glass. They don't leave chocolates on your pillow when they clean the room. If they say they are a four star hotel,(we couldn't believe it), they should act like it. My final words are, DON'T GO. Here is a handmade chart on ratings.", "user": "iminlovepr", "date": "March 12, 2008", "id": 14241225}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "My husband and I stayed at El Conquistador two years ago and again this past March. It has really improved. The facility was spotless, great staff, beautiful views and plenty to do. Palomino Island is well worth the trip. There is no need to carry cash anywhere since everything is billed to your room if you wish. I will definitely return.", "title": "Well worth the trip", "helpfulness": 2, "user": "Evie049", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115940694}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "I had stayed here once before and decided to ring in the new year in a warmer climate. They had everything well decorated for the holidays and a whole schedule of events for Christmas and New Year's eve. There were definitely a lot of families as I didn't run into another solo traveler but it was fine and everyone was incredibly nice. This hotel has a few pools but the bigger draw is the ferry to their private island. There are plenty of chairs and towels (which you pick up right when you walk in). The only downside for me is that the water is very shallow and there is a lot of sea grass. It's certainly possible to get wet but I usually enjoy playing in the waves. There are all kinds of water sports and activities if you don't feel like relaxing. The onsite restaurants are very good and the parrots in the lobby are fun to watch. Actually it's more fun to watch people reacting to the parrots! Rooms are ocean view or garden view. I have stayed in both and I enjoyed the ocean view more.", "title": "Nicely decorated for the holidays", "user": "citymouse7", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115940657}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This was our 3rd trip to Puerto Rico and we will not stay at ANY other resort from this point on....the best of the best. We had stayed in Dorado our first 2 times, but liked the El Conquistador in Fajardo much more. Views - 10 stars. Rooms - 10 stars. Views - 10 stars. Courtesy of staff - 10 stars. Food 10 stars (but pricey) Pools - 10. Palamino Island 10 stars!!!!! If you plan ahead a little you can save some cashola by bringing lunch meat and beverages and making sandwiches in the room so you don't eat at the restaurants 3 times a day. Definitely take advantage of the breakfast buffet in any package as it is lavish and more like a luncheon and will fill you up for a good part of the day. So much to do for kids to do - the water park, the pools, activities, clubs, arcades, and for our 10-yr. old the main attraction was CATCHING LIZARDS! We went to Walmart and bought a small net and it kept him occupied for hours. (you probably want to avoid the larger iguanas as they can whip you with their tails) We also bought a fishing pole and our son brought it to Palamino Island every day and fished on the dock for hours. You can buy squid or even use chicken tenders or any meat for bait. He caught some really cool fish! The staff was amazing...your wish is their command. Ask for MICHAEL ANTHONY when checking in as he gave us a personal tour of the resort and was so welcoming. I can't say enough about the staff at the El Conquistador. I think that the negative comments may be coming from the competition - this place is A+++++++++++++++++++++ in my book. We will be back again next year!", "title": "BEST LOCATION ON THE ISLAND! DON'T LET A FEW BAD REVIEWS STOP YOU!", "user": "palmiter2", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115937236}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This hotel is like a palace. It's almost overwhelming at how much there is to do in it. If you've ever been on a cruise, it's a bit like that. The place is so big it took about 15 minutes to walk from the reception to the room. It's like a little town in itself. We stayed in the Marina Village. it was a great room. Very spacious. Great view. Great bathroom. Really pretty. But it wasn't cheap, but it was so nice, I think it was worth it. We bought the package with breakfast included and the breakfast was very impressive. They have a private island which was BEAUTIFUL! The only regret is that I did not stay here another night. All in all I would say if you can afford it you should stay here at least one night.", "title": "Amazing hotel", "helpfulness": 1, "user": "PhlPA", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115911149}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "It is with so much pleasure that I write an honest review of this magnificent facility. It is more than a resort. It is an adventure for the family. My daughter and grandson and I had so much fun. First let me say that our beautiful room with it's breathtaking view will be in my mind for a very long time. Seeing the Caribbean Sea and the boats docked from our balcony was all that and more. The resort and the staff are all top-notch and professional and not stuffy and not pretentious and just desiring that you enjoy your stay there. The food was good at all of the restaurants we went to, but my favorite would be Blossoms and also the restaurants on the marina. The water park and activities for the youngsters was one of the highlights for us along with our visit to the private island, Palomino, was pure pleasure. I recommend this facility for people with children and people who want a real family vacation that everyone can find something for each member of the family. I wish I could have stayed longer. Oh the facility is well kept and clean and the lobby is one of the beautiful places with the exotic birds and assorted chairs and sofas. So much to see and also we went to the Golden Door Spa which is a vacation treat in itself. OK it is a bit expensive but you know that and it's all worth it because you deserve the best. Enjoy and I will go back as soon as I can afford to do so.", "title": "A lovely, lovely vacation at a lovely, warm and wonderful place!!", "helpfulness": 1, "user": "pecanglo", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115873236}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "I got a great rate on this hotel for four days during the last gasps of winter. The property is beautiful, and the amenities are abundant. There is much to enjoy and there is much not to like. For your reference, I came in on a Monday and left on a Thursday.", "title": "Think about what you want before going", "helpfulness": 8, "user": "TigerVA", "date": "April 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 7430905, "likes": {"liked": "— The views, the weather, and the grounds.", "disliked": "— The food was disappointing."}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I would urge you to consider the following before committing to this hotel:", "title": "Luck of the Draw", "helpfulness": 2, "user": "NJkenzie212", "date": "April 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 7405119, "likes": {"liked": "— the view, Palomino Island, the spa, The Strip House restaurant", "disliked": "— Inconsistent quality and service among our traveling group - extremely expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "•The property is self-contained and removed from the rest of Fajardo. If you are looking for a real and total Puerto Rican experience, you are not likely to encounter it here. My entire stay felt like a mainstream mainland resort experience.", "title": "very nice resort", "user": "stellanewyork", "date": "April 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7390892, "likes": {"liked": "— brand new aand the view"}}, {"rating": 5.0, "title": "Heaven", "text": "•The private island and its views are stunning. The beach there is beautiful and in good shape. Aside from the strong winds, the day I spent on the island was really great. (The food and drinks were respectable, too, but a bit pricey.)", "user": "frcbtoworld", "date": "April 17, 2007", "id": 7381571}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "•You will walk—a lot. The property is huge, and you will likely do a lot of walking to get from where your bed is to wherever you want to go. So much moving around is not necessarily a bad thing, but it is something to consider. This is especially true since there is not all that much to see after the second day.", "title": "No place like it on the planet", "helpfulness": 1, "user": "vajamesfamily", "date": "April 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7363904, "likes": {"liked": "— Beauty and View", "disliked": "— No wireless internet"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I read the reviews on this website before I went to this hotel, and honestly I was afraid of what I would find. However I was pleasantly surprised!! From the moment we stepped out of the cab to the moment we were dropped off at the airport, the staff was extremely courteous - my family and I are not used to this kind of service. The property and views will take your breath away. We went in the first week of May from Mon-Thurs so there were fewer crowds and the staff had more time to really take care of you, so if you're planning to go for a weekend in July/Aug keep in mind they are probably booked to capacity and cut them some slack!! Also, there was construction going on in some areas but honestly it didn't bother us, the workers were friendly to you if you were nice to them. Also there were no problems with our bill.", "title": "A Wonderful Experience!!", "helpfulness": 2, "user": "kitkatl3ar", "date": "May 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7548383}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Some warnings: be prepared for the expensive restaurants; we spent the most on food while we were there. Apparently, there is a small fishing village you can walk to from the marina where you can experience real Puerto Rican cuisine for cheap prices; we didn't find out until the day we left so we missed out on that. Palomino Island (their private island) is a great place to spend a day, they have tons of water sports and horseback riding, etc. Again, keep in mind the prices. For tours and excursions, I would recommend renting a car for El Yunque Rainforest instead of paying for the tour. I would recommend bringing rain gear and wearing a swimsuit as it WILL rain when you go, and there are these falls which you can swim in. However it is a 35 minute hike from the main trail. For Old San Juan you should go with a tour; we went by ourselves and had no idea where to go. Also, for most of the tours that the hotel organizes, there is a 6-8 person minimum so we missed out on some of them cause there weren't enough people interested in going. If you're going with a group then you're fine but if you're in a smaller group (we were 3) then keep that in mind. Probably in the middle of the summer the tours will leave every day but make sure to call ahead to check.", "title": "I Beg You, Please Don't Waste Your Money. This Is the Rodeway Inn Of Resorts", "helpfulness": 8, "user": "niecymac", "date": "May 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 5.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 7538908, "likes": {"liked": "— service", "disliked": "— everything else, it was dirty and not well kept"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "All in all - this is a great place for groups to go to, there is so much for everyone to do. They have a lot of wedding parties here as well, they have a beautiful location for a wedding although I have no idea how much that would cost. Really romantic for couples. Families would enjoy themselves as well - they have a children's \"club\" with activities. I would definitely recommend this hotel for people who enjoy watersports, otherwise you will have less to do. Basically take these reviews with a grain of salt, as each person's experience will be different. We went at an opportune time because it wasn't so crowded and we were able to enjoy ourselves. When we left on Thursday we noticed the crowds rolling in and they probably had a different experience than us, who knows. Basically you need to go for yourself to find out!", "title": "Do Not Stay There!", "helpfulness": 6, "user": "bfreedman", "date": "April 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 7486303, "likes": {"liked": "— The view from my room.", "disliked": "— The outdated room with damaged furniture."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This hotel/resort is NOT worth the money we spent to stay there. This resort is in terrible condition and the location allows them to overcharge on meals and drinks. I 've seen motel 6 rooms in better condition than this one.", "title": "Overbilled at El Conquistador", "user": "derryann", "date": "April 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7485858, "likes": {"liked": "— view", "disliked": "— size - long way to everything"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We went on an all girls celebratory trip and dished out over 400/night for our room, needless to say we had high expectations but much to our dismay we walked in to our room to find-", "title": "Gorgeous!", "helpfulness": 1, "user": "Josie630", "date": "April 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7484924, "likes": {"liked": "— Ocean View", "disliked": "— Tiny Casino"}}, {"rating": 1.0, "title": "No!!", "text": "Stay away. Half the hotel is under renovation, the other half is totally dysfunctional. The nicer rooms are at the bottom of a very steep hill, at the marina, but to reach it you need to take a cable car up and down. Given the shoddy desk service, lack of in-room amenities, failed wireless internet access, bad food, horrible bellhop service, and other disappointments, there's no reason to think one should have confidence in the cable car (which in fact went on the blink when we were there).", "helpfulness": 3, "user": "deniroNewYork", "date": "October 8, 2007", "id": 10056040}, {"rating": 1.0, "stay_parameters": "Stayed September 2007", "text": "I do not recommend anyone staying there. Everything on the whole resort is extremely over priced. And at one point we came back to our room from dinner to find a Hotel Bell Hop rumaging through out suitcase. I got stuck in two of their elevators , neither of their two hot tubs were working. We had a camera stolen by housekeeping. I could go on and on. This resort ruined our vacation and I suggest if you are thinking about staying there dont find somewhere else.", "title": "Worst Vacation Resort Ever", "helpfulness": 8, "user": "MasonPI", "date": "October 1, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 1.0, "rooms": 3.0}, "id": 10026078, "likes": {"liked": "— Nothing the place is overrated", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We found the hotel to be absolutely wonderful... landscaping was incredible - as was the water taxi ride to the private island. There you'll find a beautiful, secluded beach.", "title": "We loved El Conquistador", "user": "julie078", "date": "September 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10014943, "likes": {"liked": "— The view, the private island with secluded beach, the landscaping", "disliked": "— Isolation, trip to San Juan airport"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The staff was attentive and helpful, our guestroom was wondeful, the entire experience was great.", "title": "Amazing Views!!!", "helpfulness": 3, "user": "thaddues63", "date": "September 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8826665}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Highly recommend.", "title": "Experienced Traveler Review", "helpfulness": 8, "user": "Ace787", "date": "September 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8675207, "likes": {"liked": "— Private island and staff", "disliked": "— Food prices"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "I agree with other posters that the rooms were a bit tired, the pool was less then pristine (and the hot tub kind of swampy), and the prices were OUTRAGEOUS! But what really bothered me about this place was the apathetic and at times down-right rude service. Where do I begin... I was repeatedly met with eye rolls and one syllable answers when I aksed various hotel staff for directions or other assistance. I saw a couple of the guys in our group order drinks from the casino waitress. She turned to them and snapped, \"you gonna pay for it? I'm not getting them unless you tell me who's gonna pay for it.\" Even if the drinks were not \"on the house\" because they weren't sitting at a table at the moment, she was ridiculously rude. One couple in our group had their camera stolen from the casino and security seemed as if they couldn't care less. They were told that although the security cameras caught the thief on video, there was nothing that could be done about it. The whole incident seemed fishy. Another person prebooked the shuttle bus back to the airport on her final day, only to arrive and be told that the bus was full and she'd have to wait an hour for the next one. She barely made her flight. Overall, I was extremely disappointed in El Conquistador. It is clear to me that this place is just gliding by on its reputation, hoping to squeeze the most money out of their guests while doing the least for them. I would not recommend this place for the price!", "title": "Tired, rude, and over-priced", "helpfulness": 6, "user": "elmacho", "date": "June 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5297064}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Ay caramba is this place expensive. We were there off season for a meeting, so the room was reasonably priced, but this resort sure makes up for that in charges for everything you can imagine ($10 for a bell fee, which they don't let you know about until it winds up on your bill, 25$/day for internet connectivity, etc). We had a simple lunch by the pool of hamburgers (which were actually quite good), but which cost $18 apiece. A small bottle of water is $3.50. fortunately most of our meals were included with the meeting, but we still spent a lot for snacks. The resort is far away from anything else, we couldn't rely on our trick of stocking up on water and snacks at a local convenience store. The food is actually pretty good, but not worth the prices charged.", "title": "you've got to save up for this one", "helpfulness": 7, "user": "shmoopy", "date": "May 31, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 5237644}, {"rating": 2.0, "title": "5-Star?? Very disappointing....", "text": "The rooms are really outdated, but I understand that a major rennovation is planned. One thing to note is that the maids only change the linens and don't clean the bathroom. We got a little sand in our tub, and it stayed with us for all 4 days that we were there.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 30, 2006", "id": 5236443}, {"rating": 2.0, "title": "NEEDS TLC!!", "text": "The pools are pretty but too small for the size of the resort. You have to take a boat over to Palomino Island (25 min trip) to get to the beach. The island and beach are breath takingly beautiful, but the boat lines can get quite long and there only a small awning to wait under; we stood in the blazing sun for almost an hour as there were so many people waiting that we watched two boats come and go.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 30, 2006", "id": 5235829}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Just came back from spending 2 days at El Conquistador. We were really looking forward to our stay there for which we had really high expectations. For a long time, we had heard so many great things about this hotel so we were really disappointed when we got there. From the moment we pulled up to the Valet ($20/day) we realized that we weren't staying at a \"5-star\" resort. Noone bothered to greet us, much less help us with our bags. My husband had to go look for someone to leave the car to..... Lady at the Front Desk was just average not very service oriented. We went to the infinity pool at The Casitas where they didn't have any towels available, we asked the attendant twice and he just responded that they were out. The gentlemen didn't bother at all. If you are not familiar with Las Casitas, they are villages within the El Conquistador complex and they average nightly rate is around $600 or higher...I think towels in the pool should be included at that rate. Overall, the serivce was awefull and definitely not what you expect from a 5-star resort.", "title": "Beautiful~", "helpfulness": 3, "user": "cheri13", "date": "May 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5235112}], "location": {"country": "Caribbean", "city": "Fajardo"}, "stars": 4, "variance": {"poor": 385, "average": 554, "very good": 1081, "terrible": 230, "excellent": 993}, "aka": "El Conquistador Resort, a Waldorf Astoria Hotel", "slim_ranking": 0.666666666667, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Award-winning oceanfront resort perched atop cliff, overlooking Caribbean Sea on one side & Atlantic Ocean on the other. Check out the dramatic views, the private island or the brand new water park - it's all part of this Caribbean paradise."}