{"user_rating": 5.0, "review_count": 46, "name": "El Cantil Condominiums", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I have been going to Cozumel for decades. I have tried all-inclusives and other resorts. Renting a at El Cantil is the only way to stay in Cozumel. You will not need a rental car. You can walk across the street to grocery shop, walk into town to eat at numerous restaurants or cook if you want. The condos are very modern with fully equipped kitchens. The bedrooms are spacious and the bed are very comfortable. Each bedroom has its own bathroom. The rooms are cleaned daily. It is just like staying in a hotel but with much better service and amenities. The pool area is beautiful and you can jump right into the ocean from the pier. If you dive, the boats will pick you up at the pier. There are dive equipment lockers in the basement and rinse tanks. It is a perfect place to stay. Also there is a roof top restaurant called Primas. THey have excellent food. Our condo included breakfast and it was wonderful to start the day overlooking the island.", "title": "The only place to stay on Cozumel", "user": "AVLME", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132088442}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We just spent 5 days at Casa Phoenix (rented directly through owners). It was a very nice condo- spacious, clean and fully equipped. The huge balcony and hot tub was a bonus! The pool was clean and refreshing, also there is easy access to the ocean. It was nice having the option of room service from Prima. No problems with the front desk or other staff, everyone was helpful and courteous. We liked staying close to town and grocery shopping. Also, there are free calls to the U.S. which is a big bonus. For divers, there is a dock where you can be picked up. We would certainly stay at El Cantil again.", "title": "Great Place to Stay!", "helpfulness": 1, "user": "cajundiver", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130572901}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed at El Cantil for 8 nights in March in unit 6CN, and there are many factors as to why El Cantil is such an awesome place to stay! 1) The location, just a few steps to 2 different grocery stores for supplies and a stroll into town for other shopping and dining, 2) The staff were wonderful and accomodating and housekeeping kept the condo spotlessly clean, and 3) the condo itself was amazing....lots of space for everyone to spread out and the main balcony(1 of 4) had a view of the caribbean that took my breath away. My family all agreed we can't wait to return to Cozumel and my first call will be to El Cantil.", "title": "Awesome place to stay!", "helpfulness": 3, "user": "osagegal", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126802184}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My wife, stepdaughter and some friends stayed in PHCS for a week. This is a penthouse in the south building. The unit was beautiful with first class furnishings and all the amenities one would need - Direct TV, wireless internet, free local and long distance calls to the US and a hot tub. We also enjoyed watching the sunset each evening and the arriving cruise ships each morning while relaxing on the balcony.", "title": "Best place to stay in Cozumel.", "helpfulness": 1, "user": "Scott S", "date": "March 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126252677}, {"rating": 5.0, "title": "Great Place to Stay", "text": "The staff were very professional and attentive. The daily maid service was top-notch. The only issue we encountered was with the ice maker in the fridge - for some reason it just didn't want to work. So, instead our maid would bring us ice from the restaurant each day.", "helpfulness": 1, "user": "ShawneeKansas", "date": "March 15, 2012", "id": 126131353}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed in Studio Azul 7-B N. I had wanted a unit with a full kitchen but the only one BR unit was already booked. Studio Azul is basically like a very nice hotel room. The king size bed was very comfortable. We had a mini fridge that was slightly bigger than some that we've had at other hotels. There is also a microwave and coffee pot. The closet is larger than a typical hotel room closet and there is a safe in the closet. The bathroom was nice and large with beautiful tile from floor to ceiling.", "title": "Great complex, perfect location", "helpfulness": 1, "user": "vacationjunkieIndy", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 125695478}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The rest of the complex was very nice. The main pool is heated which was great. There is also a separate kiddy pool and a hot tub. There is a pier for divers to get picked up. There is easy access for snorkeling. Snorkeling is decent in this area. The complex is very secure and requires your key card to go up the elevator.", "title": "Wish I could give 6 stars", "helpfulness": 2, "user": "MarcLovesTravel", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125506573}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We had a great time and would definitely stay there again. I don't have any complaints but just a warning. It can be loud in this unit if there is anything going on in the park across the street. We came in on the weekend after Carnival and they had bands playing Saturday night and Sunday night. Also, the birds are extremely loud in the morning. Our remedy was to turn the A/C fan from \"auto\" to \"on\" so we had constant noise to drown it out. This was not a big problem for us but could potentially for a very sensitive sleeper.", "title": "PHB-Norte", "user": "kentmorrdave", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123802661}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Note: all units are privately owned. Search the web for El Cantil and you will find the ground floor unit (SLB) that I stayed in.", "title": "Great location, good staff, GREAT view", "user": "iyhberry", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123797852}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I am not the type to just give 5 stars away. However, this was one of the best places I've ever stayed especially when you consider value. The location is perfect. You are a 5-10 min walk to the touristy part of town but just far enough away that you see more locals on your block than tourists. Within 1/2 a block is a huge grocery/pharmacy/wal-mart-type store (has a GREAT bakery) and a movie theater which showed newly released movies for cheap in English with Spanish subtitles. The condo facilities were outstanding. The unit was probably the cleanest I've ever stayed in. The beds were very comfortable. Each bedroom was huge with walk-in closets, walk-in showers. Our favorite part was the waterfront view and balcony. With three rooms facing the ocean only 100 feet away, and floor to ceiling glass on those walls, we felt we were always looking out at a picture perfect setting. I was worried that we wouldn't have privacy. However, the 1st floor units are about 1/2 a floor above the beach level and with strategically placed plants, it was very private. My wife and kids couldn't believe I got such a great place. I was a bit of a hero.", "title": "Great condo in a great location with a great staff!", "helpfulness": 1, "user": "scooter824", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123000953}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "We went with a group of 20 family members. It was perfect! We could make drinks and food and bring them to the pool area or we could order them from the restaurant. Almost everything was within walking distance. We still had a cleaning service even though they are condos. The only negative was the loud holiday celebration concerts on the weekends from the plaza across the street. It wasn't that bad and ended around 11 or so. Still worth the stay!", "title": "Excellent!", "user": "Cmaea", "date": "January 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 122730612}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I just got back from Coz, and liked this place enough to write a review! We stayed in unit 4B-S, a HUGE 3 bedroom. Prices are probably comparable to a hotel, and you get tons more room. Claudia gave us a thorough briefing when we checked in, so knew the do's and don'ts of the place, like turn the AC off if you want to keep the balcony doors open and get the fresh air. Beds were very firm--my family liked that. Daily maid service was great--they keep the place very clean, including loading and unloading the dishwasher. Staff there are all great, from the cleaning people to the security out front to the restaurant wait staff. Very helpful and friendly, and they remember you. There was always tons of hot water for showers for our group. Restaurant breakfast at Prima was included and was great--they have lots of choices so you don't get tired eating the same things. The view from the balcony is probably the best in Coz, so I recommend eating outside. Location of this condo is awesome: easy walking distance to the center of town, and the two best groceries in town, Mega and Chedraui, and both less than a block away. Pool area is great-we hung out down there every day, and people in the other units were very friendly. We had no issues with the hot tub on our balcony: we were able to make it as hot as we wanted, and a guy came every other day to check the chemical levels. We have a hot tub at home so I have an appreciation for clean water and would not get into it if it was dirty. (Note: I would NOT get into the hot tub down at the pool!) The only down side to El Cantil, if you can call it that, is the location. We were there over Christmas and New Years. The town's public plaza is right across the street, and every night there was music performances on a stage, a little carnival, food vendors, etc. A few people in our group who liked to go to bed early didn't like the noise, but I went over there every night and watched how the local townspeople celebrated the holiday. Those events were staged for the town residents, not the tourists. Very interesting!", "title": "Just back and loved El Cantil", "helpfulness": 4, "user": "andy d", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122401343}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We had a very unique experience in dealing with this property. My husband and I have stayed at hotels and VRBO rentals around the world and have never had an issue. We originally had booked the penthouse in June of 2011 for a stay over Thanksgiving. I had emailed back and forth with the owner (thought I later found out it was not the owner, but a management company so beware of this) to confirm the details of our arrival. When I emailed to confirm everything about checking in one week before arriving, they said they did not have our reservation on file. I found an email saying they had found our fax confirming our stay, but they denied it and said they never sent me an official confirmation so they did not hold the condo for us. IMPORTANT NOTE to guests, this is more of a hotel then a condo the way they are run and do require a specialized confirmation in order to stay there. I am accustomed to dealing with owners who email me to tell me something is confirmed and it normally is all set at that point. The only caution I would give you is to make certain you get everything in writing.", "title": "It started off rocky...but wound up being good", "helpfulness": 5, "user": "JenHillJHCCS", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 121716338}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The condo itself was lovely and was in the perfect location for the Ironman my husband was there to do. The only downside was we no longer received the penthouse since they were booked, but they were able to find us something on the 3rd floor which was nice, especially since it was the week before our vacation.", "title": "Great, except the residents that live there...", "helpfulness": 6, "user": "Remy L", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 121455884}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The beds were a little bit hard, but the view was spectacular. The staff was incredible and the location could not have been better. The pool was great too, as was the snorkeling out in front of the hotel.", "title": "Convenient luxury condo, well-located", "user": "rlf_vancity", "date": "December 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121340549}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "This is my 4th year staying in 7 J Norte, a 4 bedroom with magnificent views. Spacious, about 3000 sqft. Best location, between two supermarkets and a short walk to downtown. Dive shops pick up at the Condo dock and lockers to store dive gear. We are already booked for next year. Restaraunt Prima upstairs is a bonus!", "title": "Still the best deal in Cozumel", "user": "Alevey64", "date": "November 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120973278}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I've been coming to Cozumel for 30 years, and the El Cantil condominiums are SO much better than any hotel. (We always stay in unit 6C in El Cantil Sur.) Spacious, well appointed, free wi-fi, TV, free long distance phone service to the U.S., fully equipped kitchen, 4 bedrooms (2 with king beds, 1 with two queens, 1 with 2 double beds), 4 full bathrooms (one for each bedroom), hot tub on the balcony which overlooks the ocean, maid service, and more. The condominium complex has a pool, underground parking and a dock where dive and fishing boats can pick you up for your daily activities. The complex is within easy walking distance of downtown, and there are 2 large supermarkets very close by. This is about as good as it gets on Cozumel!", "title": "Better than any hotel on the island!", "helpfulness": 3, "user": "TRHinHouston", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119302013}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "There are so, so many great things going for this place its jard to even start.From the front desk staff.who double as a concierge to the bus boys to the cleaning staff they are all super friendly, eager to help and appreciative of a hard earned dollar. Stayed in the penthouse for the week of carnival and couldnt be more pleased. The rooms and fernishings were immaculate and well kept. The view is bar none AMAZING. Full service kitchen with a superstore across the street. Everything you need is within walking distance. Private parking for free if you choose to rent a car, or in our case a jeep. The penthouse is high enough that you dont hear any road noise and big enough for four adult couples. El cantil is amazing especially for cozumel. A dock just outside for the fisherman and snorkelers. The only drawback is theirs no beach but on this side of the island there are no beaches really. They make up for it marvelously with the man made beaches at the pool where when at ground level disappears seamlessly into the ocean. I honestly wouldn't think of staying anywhere else in cozumel. They offer free breakfast on the rooftop resturaunt which is nice. The only drawback was the resturaunt. They really want to be a resturaunt bar with class the only problem is that its really sub par at best. Not many people go to mexico for italian and thats what they want to be. High end italian, only not. I wouldnt pay to eat there but the free breakfast was a nice touch. Highly, highly recommend el cantil to anyone visiting the island for relaxation. All that and a private elevator to boot!", "title": "Unbelievably perfect", "user": "cjournigan", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117761404}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed in the Studio Azul 7B-N. We had a king size bed and two terraces. One terrace overlooked the street, and the other was on the side of the building (between the north and south towers). You can see the ocean from the side terrace, but it does not face the ocean. The room is basically a like a hotel room, but it has a large closet, large updated bathroom with shower only, microwave, coffee pot, refrigerator, blow dryer, and free wirelss Internet. Since we booked online, we got a free sit down breakfast every morning at Prima. There were several choices like French toast, pancakes, omletetes, huevos rancheros, and two eggs with home fries. We tried almost every meal, and they were all great. The condo also has a beautiful pool area which is never crowded. You can also order food from Prima at the pool. There is a call box to use, and the waiter comes down to take your order. You can rent snorkel gear from the office for $6. We saw some really neat fish snorkeling in front of the condos. The staff is very helpful. One day during a dune buggy excursion, my hat blew off my head right as we passed El Cantil. Since we were in the middle of a tour we couldn't turn around to go get it. Somehow, Abraham ( the doorman) saw it happen and rescued my hat. I could't believe it when he had it when we got back to the condos later that day. The location of the condos cannot be beat, especially if you like to walk into town for dinner which we did every evening. It is also really close to Mega which is great for picking up groceries which we often did on our walk back from dinner each evening. This is a great place to stay! One warning, the birds in the trees outside can be very loud in the morning- bring ear plugs!", "title": "Great place to stay!", "user": "Beachgal817", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114734407}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "We stayed in Casa Phoenix at El Cantil, a four bedroom, four bath luxury condominium. Beautiful view, location is central to the town, dining and shopping. The staff is fantastic. Breakfasts are included in the fee. Wonderful place to stay.", "title": "Fantastic, luxurious place to stay", "helpfulness": 1, "user": "CSBBozeman_MT", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92235597}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "variance": {"poor": 0, "average": 1, "very good": 4, "terrible": 0, "excellent": 41}, "slim_ranking": 0.0740740740741}