{"user_rating": 4.5, "review_count": 5053, "name": "El Dorado Royale, a Spa Resort by Karisma", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "just writing to say what a great holiday me and my wife had here. I'am going to go through each aspect of the trip", "title": "dream holiday", "helpfulness": 2, "user": "triggerloverman", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34660789}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "1-room. i cant recomend this hotel highly enough! we stayed in the casita suites which were absouletly fantastic. the best thing about the room was the in room jaccuzi bath which me made great use of. The casitas are a bit extra but worth every penny.", "title": "Great Resort but avoid any issues if possible. Customer service is not their strongest point", "helpfulness": 1, "user": "loveDRepublic", "date": "July 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 34636323}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "2-service. the staff at this hotel would always go out of there way to help you and room service is brilliant. have to mention abel, he is a barman at one of the casita swim up bars and always had our drinks ready for us.", "title": "Wonderful Resort", "helpfulness": 2, "user": "wylietx", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34581629}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "3-location. If your looking for a relaxing beach holiday this is the place for you, but if your looking for a lively holiday you should book a hotel in cancun. We did go into cacun one night and did enjoy it, but one night was more than enough. the taxi fare into cancun was about $35. we also went into playa del carmen for a night and found this a much more enjoyable night out, not as lively as cancun but there is still plenty to do.", "title": "This place is awesome. Here are my pros and cons...", "helpfulness": 5, "user": "DavidF123", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34539688}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "4-food. went here expecting the worse when the food was described as gourmet al a carte, but was deffinataley surprised how much i enjoyed the food and it widened my food horizons no ends. Would reccomend the asian and the itialian but as i say all the restaurants are amazing!", "title": "Stay in the Casita at all cost", "helpfulness": 6, "user": "troyturnbow", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34186150}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Restaurants are great,a little tip ,bribary will get you in every night.", "title": "Great food warm flat beer", "user": "StPatrick17", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 35588405}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The lobby bar is very good, the batman is great, the pool bar is slow and the coolers don't cope with the heat. Will be back on February will not be staying here.", "title": "tropical paradise", "helpfulness": 2, "user": "lesley22", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35348639}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband and I have just spent 2 weeks at the Eldorado Royale and if you are reading this review you are either going or thinking about it believe me you are in for a real treat!!!!!!!!!!!!!!!!!!!!!!!!!", "title": "Fabulous Honeymoon from Start to Finish", "helpfulness": 2, "user": "TinyDancer26", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35153733}, {"rating": 5.0, "title": "Perfect Honeymoon Resort", "text": "We stayed in a standard garden view rooms which are beautiful and luxurious the real bonus to these rooms are the location very cenral ,easy walking to resturants pools and bars you can upgrade to casitias which looked divine and very exclusive or swim up rooms which looked great fun we were more than happy with our rooms.", "user": "VacationLover2222", "date": "July 17, 2009", "id": 35027317}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We had two lively teenage boys with us and although the hotel is mainly couples they had great fun with the K Entertainmet Team who work tirlessly to arrange daily sport activities and a vaired and fun evening program with shows, dancing, casino nights, live bands ect", "title": "Best holiday we've ever had", "helpfulness": 4, "user": "Shane78", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 34717766}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Nothing like the brochure. Picked up by minibus,which was very good 1/2hr from airport which was good after a 12hr.flight. Upgraded room due to 40% occupancy room overlooking sea but a bit dark due to Palm treesin front of view.Poor customer services asked for assistance with patio seating due to needing a higher chair still waiting .Waste water from upper room jacuzzi running through waste pipe in our room at 6am every morning.NO SLEEP IN. Resturants closed for 1 week at a time for some areas, pool bars not open I ccould go on . Dress code is a laugh not applied unless your British. Would not recommend. Not worth the money spent expected more.No MEXICAN atmosphere.The waiters made this holiday", "title": "Not as expected", "helpfulness": 3, "user": "Susan M", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 117685721}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This was the most wonderful vacation we've ever had! This place is excellente (Spanish accent)! I stalked reading reviews before we went and now I just laugh at the \"horrible reviews\" I read before we left.", "title": "Excellente!", "helpfulness": 6, "user": "Suzanne R", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117677831}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "First off, we upgraded to the Casita's - do it! We were treated wonderfully from the moment we arrived (thank you Leo) to the moment we left. We stayed in the 2800 Casita block and met THE most amazing people - our new friends for life (in fact we're meeting up next year, same time)! The resort is gorgeous, the casitas are wonderful, the food was great and employees are fantastic! Everyone is so courteous and helpful it was amazing to us; from the bartenders: Abel, Orveline, Angel, Adel, Rodolpho to housekeeping to the golf cart drivers. Rodolpho was so sweet, he came to our pool everyday to offer us pop-scicles, and always \"apologized for interrupting\" - that's not interrupting, that's providing 5-star service! This place is was well worth the wait and we can't wait to go back! We tipped a lot, but it was worth it - in fact we should have tipped more for the outstanding service we were provided.", "title": "AMAZING!! Best Honeymoon Ever!!!!", "helpfulness": 15, "user": "Daniel M", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117663928}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Ok, for all those people worried about the bad reviews, here is a tip - relax and enjoy! Upgrade to the casitas (negotiate when you arrive), use your personal concierge, tips your staff, and mostly be kind. Hola and a smile go a very long way.", "title": "Overall it was good but not good enough to bring us back again.", "helpfulness": 1, "user": "Michelle E", "date": "September 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117663654}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Where do I begin? I have worked in the Luxury Hotel business in NYC for over 18 years and believe me, for me to write anything nice about another property is very very rare. My wife and myself work about 16 to 18hrs a day so the build up to our wedding was extremely stressful. To say we were excited to get away was an understatement. Well the day finally came and we couldn't get to the airport any quicker!! The entire flight I had my job on my mind....(how can I go 7 days without checking my email!!!!!) Well we finally arrive in Cancun and our American Express Van was waiting there for us, he politely took our bags and we were off to the El Dorado Royale. I knew nothing of this hotel but from what our Travel Agent told us and whatever we read on Trip Advisor. From the min we walked out the Van until the day we left we received the Highest level of service imaginable. I was blown AWAY!!! All of the employees there are genuinely happy to be there and it shows. We had booked a Casita with the infinity pool in our room. The room was gorgeous...just what we needed (how much time do you spend in your room on vacation?) The housekeeping staff was efficiently quick and the turndown staff was quite creative with their towel animals.", "title": "AMAZING HONEYMOON", "helpfulness": 3, "user": "LandMBrighton", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117653595}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is the 2nd time we have been to El Dorado Royale, the first time was our honeymoon 4 years ago. We booked a regular swim up room then upgraded to a swim up Casita in section 29 which was worth the $80/night. They were having a 50% off promotions on upgrades. We felt the casitas section didn't feel quite as \"elite\" this time as it did 4 years ago, perhaps because they are having to discount rooms to get people to come there and also to upgrade and the guests are not quite as elite. We love the swim up concept and are willing to overlook the very open concept bathroom (one of us would leave the room because it is weird to hear someone else's bathroom activity), the very bland food, the inability to just walk in to a restaurant and grab a plate at any time and take it where you like (we loved the RIU for this), the pool that had lots of people's oils and lotions floating in them as well as bugs and debris from the trees and plants, and a very not private experience if your neighboring room which shares your swim up shelf is occupied. For the last point, we will probably book the infinity swim up next time which has a low divider with plants between you and your neighbor. It is more expensive than a regular Casita swim up, but the sections are newer and don't seem to have as much rust or staining in the grout in the pool. If you do opt for the infinity, be aware if you love sitting at the swim up bar that section 32 gets no sun at the swim up bar after about 11 in the morning because the palapa roof over it is very big and sits far into the pool area.", "title": "Good enough for the money", "user": "Minnes0tans", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117769231}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "People seem to love congregating by the swim up and talking to each other for hours. We met many nice couples but did not want to spend our whole afternoon with them. Bring floaties and you can make your way around the lazy river a few times for some variety. The iguanas will appreciate a fresh hibiscus if you are not too scared to feed it to them. The bigger ones are less skittish and will take it right out of your hand. They do a nice job with the vegetation around the grounds and rooms. It is lush and beautiful.", "title": "Loved it.............AGAIN!", "helpfulness": 6, "user": "LandonApril", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117752421}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We liked sitting on our swim up shelf in the 12\" or so of water rather than on the loungers on our shelf because this time of year is so hot. There was not much room to move the loungers, we had to partially block our entrance by putting one on our very small patio, but something to consider if you are too hot to sit in the loungers but want to be alone together and by your room.", "title": "Very good All Inclusive - Skip the car rental (Adocar) at the location", "helpfulness": 2, "user": "hiker_pal", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117720049}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Yes, the menu on the TV was annoying as you had to wait for it to switch to the next 3 items and it would have been nice to just have a piece of paper to look at. Perhaps they offer one if you ask, we just were not that very long and never did ask. Late night the room service menu is very limited, but we asked for things that were on the daytime menu and they did bring them to us. Don't be afraid to ask for things you don't see like a side of refried beans.", "title": "THANKS KARISMA FOR ANOTHER WONDERFUL HOLIDAY!!!", "helpfulness": 4, "user": "PDoucet", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117716335}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Kampai was much greasier than last time we were here and the tempura was more of a deep fried shrimp that actual tempura. The cheese at the Fondue restaurant was kind of like that stuff you get at a ball game if you go to the concession stand and get their \"nachos\". IN fact, that was what they put on the nachos we ordered from room service. We asked for real shredded cheese the next time, but still got the goo. Order room service before you are very hungry. It took no less than 35 minutes and whatever they quote you, add 10 - 15 minutes and be prepared to call twice. There is almost no mexican food on site as Fuentes restaurant is always closed. You can ask for the mexican menu at most restaurants and get about 3 mexican choices. The cool bar everyone is taling about in the reviews above D'Italia was also closed the whole time as well as D'Italia.", "title": "perfect", "user": "highstandardsleeds", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117694292}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "We had a wonderful stay. My friend was getting married and we were joining the celebration.", "title": "Wonderful! Activities, food, people, everything - great!", "user": "rachfowler", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34051262}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The hotel created a beautiful wedding. I just wish they would have made sure the wedding party stayed closer to each other (ask for that). We were in rooms from one end of the peoperty to the other.", "title": "Darn near perfect!!", "helpfulness": 8, "user": "pauliez13", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33680981}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The food was wonderful - no buffett just good menus to choose from. I hated that the places closed from 11-1230 to prepare for lunch - this is when I usually would eat at home. Had to just call room service during that hour.", "title": "So nearly perfect", "helpfulness": 7, "user": "gillsontour", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33593877}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The staff was wonderful and everything was clean and the way it should be for a vacation.", "title": "Want an experience", "helpfulness": 2, "user": "musseycat", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33589654}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My wife and I spent our honeymoon in the Casitas (section 31) end of the resort the week of June 22. From the time we walked in, greeted with a glass of champagne, to the time we left, it was absolutely amazing!! I read a lot of the reviews on this web-site and can't imagine how anyone could not have an amazing time here. Maybe it was because we were staying in the newest of the Casitas sections or because the level of service is higher there, but the rooms were perfect, the staff was delightful and the food was outstanding.", "title": "Round Two Even Better!!", "helpfulness": 3, "user": "BGs07Bride", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33553654}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Pure luxury. A-m-a-z-i-n-g gourmet all inclusive. We are so glad to be members and can't wait to go back!", "title": "Absolutely the best place we have stayed on Riviera Maya", "user": "lorimac", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117993322}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My favorite thing , besides the outstanding food and service is the \"living rooms\" by the beach, where you can sit comfortably out of the sun and enjoy the ocean while reading or having a cocktail or smoothie (included and served to you by the beach servers). The watre journey at the spa was also very special (and included). We have no reason to go anywhere else but the Karisma hotels when we are in Mexico. No other company could possibly beat the food, service, or atmosphere.", "title": "Highly recommend, excellent service!", "helpfulness": 3, "user": "Laura M", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117915622}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "We loved El Dorado Royal, everyone here was amazing, the staff really impressed us. The food was definitely gourmet, many restaurants to choose from. I recomend the Italian and Asian place the most. Everything from a personal concierge to free snorkel/bike/kayak rentals to wake up call with coffee delivered straight to your room. The snorkeling on the beach was beautiful, bring an underwater camera for sure because they have a man made reef with tons of cute fish. We will definitely be back, I ´can´t say enough about El Dorado Royal. The only warning I would give is that if you are an early riser you may want to ask for a room away from the show/ dj area. We still slept great because we stayed busy and came back tired. Love it!!", "title": "Great first experience of all inclusive and Mexico.", "helpfulness": 2, "user": "Sambob01", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117914647}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We have always been sceptical about all inclusive holidays and finally decided to take the plunge. We booked an Ocean view suite for seven days. We were pleasantly suprised. This resort had pretty much all we wanted out of a holiday. The service was excellent and the staff were very attentive. The weather was also good despite a tropical storm on the last day. Prior to coming out we read many of the reviews, some good and some not so good. For those good reports I fully agree with you, for those not so good....what on earth are you expecting out of a holiday?", "title": "My husband is still talking about it....", "helpfulness": 5, "user": "gidget265", "date": "September 10, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 117912544}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The food at the many restaurants was excellent, I would recommend that you order extra starters as they are pretty small. The bars served top brand spirits and the variety of cocktail recipes was top notch.", "title": "Best Holiday Ever 6***", "helpfulness": 1, "user": "jamie c", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117895132}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Disregard the negative reviews of this hotel. We stayed in the Castita section and it was absolutely amazing. The staff is so friendly and the food was great.", "title": "Best all inclusive", "user": "R0sieR", "date": "June 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33472706}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "First off, a group of fourteen Travel Agents all traveled together to see a total of 14 properties in the Cancun and Riviera Maya area. We were very fortunate to have a stay at in a Swim-Up Casita. My room was 3028 and it was lovely!! This resort is truly made for couples, but since I was not traveling with my spouse but with a group of friends/colleagues, it was still wonderful to be at an adult only property. I had sold this property on many occassions, but had not ever stayed. Here are a few things I loved...", "title": "Travel Agent loves El Dorado Royale Casita", "helpfulness": 5, "user": "MarahJean", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33403022}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "1) FOOD! This is truly a gourmet resort. Everything I had was wonderful. We loved Kampai and ate every morning in the Cocotal resturant. Several in my group ordered room service and all enjoyed it. The service was outstanding!", "title": "A Great Hotel for Honeymoon", "helpfulness": 1, "user": "Louthmcm", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33231869}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "2) Beach Beds! Staying in the Casita section, we loved using the beach beds.", "title": "Elegant Relaxation", "helpfulness": 2, "user": "TNTravelChick", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33195912}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "3) Martini Bar! Had fun hanging out in the martini bar a few times. The service was wonderful and I suggest you try a chocolate martini!", "title": "What more can I say????", "helpfulness": 1, "user": "lakeratz", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33190261}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I've stayed at a couple of all inclusive places in the Mexican Riviera and other resorts around Latin America. El Dorado Royale is hands down one of the best.", "title": "Fantastic service, great food!", "helpfulness": 1, "user": "jayci", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 118041513}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "First, the property is really beautiful. I mean, really beautiful and very well thought out. It is a large property for sure, but there's lots of options for beaches, pools, food, bars, and spas so you're never too far from a service you want. Also, since there's so many places to get services you can always find the \"vibe\" you want. If you want to party, there's a pool for that. If you just want to be lazy and get a massage on the beach, there's a place for that too.", "title": "outstanding food and service .........", "helpfulness": 2, "user": "BUGSI", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118021682}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Secondly, the food is really good. Unusually good for an all inclusive place. They really try to make the food something special. There's even foams for the molecular gastronomes.", "title": "HONEYMOON FOR FIRST AND LAST WEDDING", "helpfulness": 1, "user": "daniel f", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118019670}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Third, the service is impeccable. Not just western standards good but Nordstrom good. My friend and I were standing in front of the events board trying to figure out where we were and someone from the K Team rode by on a bicycle and asked us if we needed help. We asked him where we were and where we needed to go and he cheerfully told us where to go and even offered to lead us there. By the end of our three day stay, staff members knew our name, and we even had a special member of the bell boy staff who would help us with our transportation and bags whenever we needed him.", "title": "what a fantastic place", "helpfulness": 2, "user": "george j", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118006243}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "If there's any drawback it would be that the rooms. They're about average for the resort market. They're also tiled in super smooth marble which gets slippery when wet, and between the condensation from the AC, the step out jacuzzi in the middle of the room, and the shower, it gets wet and slippery A LOT. There's also not many places in the bathroom to hang towels. However, these are minor complains compared to the wonderful time I had.", "title": "Great seaside All-Inclusive with all the extras!", "user": "AmyWinGA", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117997058}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 252, "average": 343, "very good": 954, "terrible": 159, "excellent": 3345}, "aka": "El Dorado Royale", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "A Conde Nast Traveler Readers’Top 100 Hotels in the world and a AAA Four Diamond Resort, El Dorado Royale is an adults-only destination that provides the ultimate in service in the ultimate setting.With more than a mile of sandy beach in Mexico's Riviera Maya, El Dorado Royale, a Spa Resort, by Karisma offers an escape which no other destination can match. All the luxuries you can dream of, combined with an emphasis on personal attention to your every whim, make this an ideal location for a getaway. Travelers join us from around the world for romantic outdoor beach weddings or ceremonies in our intimate beachfront chapel, relaxing honeymoons, anniversary celebrations, or just much needed time off."}