{"user_rating": 4.5, "review_count": 112, "name": "El Galleon Beach Resort & Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Not having visited Puerto Galera in almost 30 years, I took a long time trying to decide where to stay. I had been warned of staying on Sabang because of the noise and crowds but didn’t really want to stay in an isolated resort where I am stuck with one restaurant. Eventually I decided in El Galleon and the reason for the choice was primarily based on other reviews I had read.", "title": "If you're thinking of going to Puerto Galera, take a look at El Galleon", "helpfulness": 1, "user": "StormyN", "date": "April 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 29061942}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Well, I can confirm everything I’ve read is correct – it really is a very pleasant place to stay. Not 5 star luxury, El Galleon suited me perfectly. There was an excellent friendly dive team – thanks Jamie for being so helpful. The food in the restaurant is by far the best we tried and even when I bought 2 big lobsters from a girl walking along the beach I was only charged 400 peso for the chef to create one of the best dinners I have had in years. Grilled fresh lobster & vegetables with plenty of excellent New Zealand wine and the cool sea breeze hmmmmm.", "title": "Best experience on Puerto Galera", "helpfulness": 1, "user": "BillDaddyO", "date": "February 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24490315}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I decided to splash out and have a room with terrace overlooking the bay and again it was perfect. I have to keep in touch with the office every day and there I could wake up and sit outside on the terrace with a coffee checking the e-mails until it was time to go down for breakfast. OK one small thing is that the room could do with a bit of maintaining.", "title": "the place to experience it all", "helpfulness": 1, "user": "nudibranch28", "date": "January 10, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 23420953, "likes": {"liked": "— Diving and food", "disliked": "— noisy fan"}}, {"rating": 5.0, "title": "My happy place, El Galleon, Puerto Gallera, Oriental Mindoro, Philippines", "text": "The Point Bar is everything it is made out to be. I am not a known for sitting in a bar all night talking to the guys, but each night, we somehow ended up there and always ended up chatting to the dive staff or other guests.", "helpfulness": 9, "user": "divetraveler_8", "date": "December 9, 2008", "id": 22596881}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The only drawback is that there is no beach and only a very small pool, so if you are beach lover, then its not for you. But I will certainly return.", "title": "EL Galleon the best!", "helpfulness": 4, "user": "Sanders_CR2", "date": "December 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22406953, "likes": {"liked": "— Traditional build with good fixtures and fittings", "disliked": "— The stairways up to a minority of the rooms can be a challenge"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2010", "text": "I just returned from the hotel after a 9 night group dive adventure organized by Island dreams Travel in Texas. Ken put together an excellent trip at an amazing price which featured this property. I dive the planet in search of exotic species and let me assure you- this place is as good as anywhere! There were dozens of photographers and experienced world traveled divers who all agreed- for the price this place can not be beat! Food, servce, diving, Asia divers, rooms were all excellent. I would give this place a try in a minute! Only draw back is it's a typical seedy village with tons of hawkers selling crap and the sex trade in the bars is alive and well. Hard to avoid but certainly prevelant in most 3ed world places. Dive masters were all excellent and prices very reasonable.", "title": "excellent choice!", "helpfulness": 1, "user": "dreemin2", "date": "April 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 62023246}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I have stayed in El Galleon several times and have always had a good time. The restaurant serves great food. The bar has yummy cocktails and a good happy hour. The dive shop is very professional and helpful", "title": "Best food in town.", "user": "mmgirish", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 60522438}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "El galleon has excellent service the rooms are native designed clean and located in front of a small heated pool that is also used in teaching divers, they also have rooms with a view of the ocean but getting up the rooms is a cardio workout. They serve western food and if you get tired of their menu lots of restaurants are lined up beside the resort. Only hassle for me i think is getting here 1 hour ferry boat ride. If long boring boat rides are your thing then it's no problem. what i liked here is the dive sites nice variety of pelagic fishes,sharks and sea turtles are a common site here. Mostly the clients here are americans and europeans. Night spots are 3 minute walk from the resort it's like a mini version of patpong in thailand i highly recommend this resort enjoy your dives!", "title": "great accommodation in el galleon and excellent dive spots in puerto gallera", "user": "orioner00", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 53676381}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Arrived in Puerto Galera on Dec. 20th mid-afternoon. I had booked my trip through a US based travel agency and the trip was to be all-inclusive with private transfer from our hotel in Manila to the resort. Two of us, four suitcases and two back packs were stuffed into a Honda Civic for the two hour drive from Manila to Batangas; the agency advertised a van.", "title": "Great Diving and Divemasters; So-so Resort", "helpfulness": 4, "user": "RickN6900", "date": "January 11, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 53227693}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "Upon arrival we went to the restaurant and ordered two appetizers to tide us over until dinner. When dinner time arrived we went back to the restaurant and were just about to order when we were told that we had the \"wrong menus\" and were given very abbreviated versions of the first. The only meat option was a hamburger and there were no appetizers at all. This menu fiasco went on for two days until we were the ones telling the waitresses \"wrong menu\". After five days this limited menu got pretty boring and I was a bit put off since the food is so heavily advertised and highly reviewed I wondered where it was. I could have ordered from the original menu but there would be an added price.", "title": "The Best", "helpfulness": 1, "user": "MichaeldCambridge", "date": "January 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52779126}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Stayed at El Galleon during a 7 day dive trip. We were a big group and very well looked after. The minute we arrived we were made to feel welcome and the owner Allan was ever present to make sure his great staff were all doing their jobs well. The diving and facilities were superb and for a bit of post diving relaxation you cannot go past the \"Point bar\" around the corner from the hotel. Rooms vary quite a bit in size, but even the smaller ones are quite adeqate as you tend not to spend a lot of time in your room. There is a small pool for cooling off in between dives if you feel the need to stay wet...Must recommend hiring the dunebuggies for a day of fun exploration of the area. An absolute blast! If you are diving, don't miss a trip to Verde Island, you won't be disappointed. Will definately come back!", "title": "Fantastic and lots of fun!", "helpfulness": 5, "user": "Maddie71", "date": "June 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 17043993, "likes": {"liked": "— Good setup, very friendly and helpful staff", "disliked": "— Noisy fan"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "3990 per night for a seaview room looking across the ocean from a high vantage point. Hotel has good staff, a good restaurant (check out today's special, always a great deal), cable TV, a dive school, a pool, very good AC and is located right on the beach.", "title": "Great hotel on the beach", "helpfulness": 6, "user": "MillOaks", "date": "March 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14358710, "likes": {"liked": "— Location and value", "disliked": "— Error on the bill"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "When I hear people mention Puerto Galera, only one thing comes to mind, EL GALLEON BEACH RESORT.... I have never felt so relaxed and at home in any of my beach resort destinations except EG... I will definitely go back there with my family again and bring some friends.", "title": "Great Destination", "helpfulness": 1, "user": "click1961", "date": "December 15, 2009", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 51288770}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "EVERYONE that I’ve met in EG is friendly and warm...", "title": "El Galleon was a steal at the price.", "helpfulness": 1, "user": "jetlag_8", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46334455}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The front desk ladies were nice and super helpful…", "title": "A great dive resort", "helpfulness": 2, "user": "PJ-Scuba", "date": "September 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 43810749}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Ruby the resort manager helped me acquire medication I badly needed by sending a staff to get it instead of me taking the jeepney ride to and from Puerto Galera town… Angel too has gone out of her way to help us in getting what we left out in the car so we didn’t have to take a boat ride back and forth to Batangas and assisted us in our last minute booking in EG", "title": "A great vacation location in the Philippines", "helpfulness": 4, "user": "2skidivers", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31182085}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The food service ladies with their ever ready smiles and greetings… the men in the kitchen who were always accommodating to special requests or favors…", "title": "El Galleon stayed for the last part of our honeymoon", "helpfulness": 6, "user": "Loctite", "date": "May 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31012850}], "location": {"country": "Philippines", "continent": "Asia"}, "variance": {"poor": 0, "average": 4, "very good": 53, "terrible": 1, "excellent": 54}, "aka": "El Galleon Beach Hotel Puerto Galera", "slim_ranking": 0.148936170213, "description": "Renowned for its serene and quaint beachfront surroundings fronting Small La Laguna Beach, Puerto Galera, Asia Divers and El Galleon Beach Resort and have thirty air-conditioned rooms that blend into the tropical hillside. Majestic views of Sabang Bay and Small Lalaguna Beach, with a restaurant which extends to the water’s edge offering a great value in European and local cuisine, a small pool for learning how to dive, spa, and all the hotel amenities and necessities one needs to totally enjoy his/her stay. The dive facility is less than a year old and there is nothing like it in Asia! We have a diving platform with a large pontoon where boats can easily dock making it easy for guests to get on and off the boats. Divers have their own crate for storage in a spacious area, a dedicated camera room; you are well looked after by the crew who are there to help you with anything you may need."}