{"user_rating": 4.0, "review_count": 99, "name": "El Punto Hotel", "reviews": [{"rating": 5.0, "title": "Couldn't have asked for any better!", "text": "My family of 5 decided to stay at El Punto after landing in Liberia and before setting out on our 2 week vacation accross Costa Rica. Our experience was just great! Mariana, who owns the hotel is fantastic. Her English is great and she can give you some good suggestions as to where to eat, what to see, etc. The price was very much affordable. We have a \"studio\" room, with 2 double beds and a single. The rooms were cool (there was airconditioning), and comfortable. They were also very safe (safety shouldn't be a worry, but their was a night watchman while we were there). The hotel is NOT a hostel, as it is listed on some other website. Instead, it could be closer compared to a boutique hotel or bed and breakfast. In total, there are about 4 to 6 rooms, each with it's own bathroom (with shower), ac and a rocking chair or hammock outside each door. The hotel is painted in great bright colors and is very well kept and cleaned. The complimentary breakfast is great with fresh fruit, juice, cheese, breads and various jams (traditional latin american breakfast). We greatly enjoyed our stay at El Punto and hope to return again soon.", "helpfulness": 4, "user": "MeetmeinSanJuan", "date": "March 10, 2007", "id": 7010285}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I stayed at El Punto the first night of our trip in Costa Rica and our last night since we wanted to avoid driving our rental vehicle at night and we flew in and out of Liberia. Stayed in very last room on the 1st night and the 2nd room on the last night.", "title": "Charming & Friendly place to start & end your trip in Costa Rica!", "helpfulness": 5, "user": "krystennicole", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6780904, "likes": {"liked": "— Friendly owner and true Costa Rican experience in a colorful enviroment.", "disliked": "— Second room we stayed at for our last night in Costa Rica did not have a microwave. No biggie though."}}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Liberia"}, "variance": {"poor": 5, "average": 8, "very good": 30, "terrible": 7, "excellent": 49}, "aka": "El Punto Hotel Costa Rica/Liberia", "slim_ranking": 0.181818181818, "description": "Rustic Chic for the well traveled. El Punto is a refurbished elementary school converted into a seven room bed & breakfast. Staring February 10th we will have a new room suite. Centrally located in the main intersection to all major tourist destinations in Guanacaste, walking distance to downtown and historic district,10 minutes from the International Airport. El Punto or the spot features paintings and unique furniture in bright modern colors. Our lounge area is wonderful to chill out, check your mail, read or listen to music. Children can play in our children's corner. breakfast is served in a delicate manner with fresh ingredients and perfect presentation. Stay with us and live the magic of el punto! Rooms: A/C, ceiling fan, WI/FI, solar heated water heater, toiletries, mini fridge, loft for additional sleeping quarters, daily maid service, free laundry service, private porch, hammock, rocking chair, night guard, free breakfast, walking distance to downtown Liberia, 10 minutes off the airport.• 15 minutes off the airport• Walking distance to downtown and next to a Super market, several Banks and surf and clothing shops• 30 minutes from Rincon de la Vieja National Park and from Coco and Playa Hermosa Beach. \u2028• 45-60 minutes to, Santa Rosa National Park, Tamarindo Beach,the Nicaraguan border. \u2028• Day tours available to other local destinations such as: Guaitil, Rio Celeste, Llanos del Cortez waterfall.• On the road to Monteverde, Arenal Volcano, and San Jose."}