{"user_rating": 4.0, "review_count": 1415, "name": "El Tovar Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "El Tovar has a classic history, including visits from US presidents and other notables. In a location not known for luxury hotels, it would not be a top accommodation in urban locations but at the Canyon, it is THE place to stay if it fits your budget. Note that there is no elevator, and while there are porters to help with luggage, the stairs can present a challenge for some.", "title": "The best at the Canyon", "user": "elainesl", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83250528}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel restaurant is fine, but one of its advantages during the daytime is the view. Spectacular views can also be had from some of the hotel rooms and balconies--YES! the additional charge for a room with a view is worth it. The decor is dated, the lighting somewhat dim, the rooms not huge. But step outside, and you see a glimpse of heaven.", "title": "Wonderful Historic Hotel", "helpfulness": 2, "user": "VeeBee66", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83202856}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "My husband and I stayed at the El Tovar Tuesday, Oct 5 thru Friday, Oct 8. When we arrived during a rain storm the lobby of the hotel was crowded with people trying to escape from the rain. There was construction going on on the south side of the front porch. It appeared that the wood was being sanded down. The noise and smell was really bad. I'm sure there's no good time for this to be done and it needed to be done so all we could do was just try to avoid that area.", "title": "Lovely Old Hotel", "helpfulness": 1, "user": "mudskippa", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83080119}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "When I inquired if we could do an early check-in the gentleman advised that yes we could if our room was ready. Sadly, ours wasn't ready. When were were finally able to check in we found that the staff to be very friendly and accommodating. The check in went fast and we were off to our room. We were really happy when we realized that we didn't have to lug our luggage up the stairs. We were on the first floor. The room was spotless as was the restroom. There was some sort of overpowering air freshener in the room. It irritated my nose until I finally got used to it. I had to get used to it each time we left the room for several minutes. There was a nice supply of pillows, toiletries and towels......soft towels. The room was equipped with a flat screen TV, refrigerator, safe, iron and ironing board and hair dryer. The room was of a decent size with a nice closet for storage of our luggage. Even though we were only 3 doors down from the busy lobby our room was very quiet other than the air conditioner.", "title": "If you go to Grand Canyon, stay here!", "helpfulness": 1, "user": "tobique", "date": "October 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82878517}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We had direct access down the hall to the back porch all those wonderful rockers and swings just a few steps from the rim. Parking was a hassle but we got lucky and found a place just behind Hopi House. We didn't move until the night before we left, then we lost that great parking space and had to park down by Kachina Lodge.", "title": "location, location, location", "helpfulness": 1, "user": "Bedazzledish", "date": "October 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82593999}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "...its remote location. My family (wife, two tweens, and mother) stayed at El Tovar for two nights in December 2008 (booked nearly a year ahead of time) near the beginning of a big winter road trip vacation swinging from the Southwest through the mid-West. I had done a lot of research before selecting our accommodations in Grand Canyon, and I was glad to see that the effort had paid off, as the visit to El Tovar was quite nice. We had the Manager's Suite (the existence of which was not apparent from the Xanterra website and which became known only with a call to Xanterra's reservations line) for what I thought was a pretty decent rate ($306/night, and right at the holiday, too), with two double beds in the bedroom and a double (or queen?) sleeper sofa and twin sleeper lounge chair in the other room. Unsurprisingly, all of the furniture, decorations, etc. were fairly dated, but everything was acceptably comfortable and clean and warm (though my wife thought the auxiliary heater in the bathroom wasn't working well enough, despite a visit from Maintenance asserting it was working as well as it always does), and the front desk and bell and restaurant staffs were pleasant enough, though the front desk staff were less knowledgeable than I would have expected about driving conditions on nearby roads during the snowy time we visited. Wi-Fi in the room would have been nice, but at least it was available (free) in the hotel's common areas. Except for one (decent) breakfast in the cafeteria of a nearby lodge, we had all of our meals in the hotel restaurant and found it no more or less pricey than I would have expected, with the quality of the food and service average to perhaps a bit better than average for what I expect from a hotel restaurant. Live piano music during afternoons and evenings in the mezzanine lounge was a nice touch. The only thing that could have been better was the view from the room; rather odd that, for a canyon rim hotel (and especially for a \"Manager's Suite\"), it wasn't built so that all of the rooms would have a canyon view. Still, once we got out onto Desert View Drive to the east and the hiking trails to the west of the hotel (hey, snow wasn't going to stop our once-in-a- lifetime touring of the sights!), the views of the canyon were simply spectacular (even more so once the sun broke out in the afternoon). It's one of those sights for which words and pictures (not even IMAX) will suffice. I can recommend El Tovar as long as you're not expecting better than 3- or 4-star accommodations; there simply is no 5-star property within at least a couple hundred miles, and the El Tovar is by far the best property in the area, from what I could see in our drives around the area. But the enjoyment of the canyon will easily make up for any minor disappointments in the accommodations.", "title": "Decent hotel, considering...", "helpfulness": 4, "user": "afrinl", "date": "January 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23261788, "likes": {"liked": "— Comfort and convenience given its remote location", "disliked": "— A view of the canyon from the Manager's Suite would have been more in line with my expectations."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "We stayed at the El Tovar during the Thanksgiving holiday. We were pleasantly surprised with the room at the hotel. We saw three of the rooms, and ours was \"medium-sized\" between the suite and the smallest room (smallest room is too small). It was clean and had a very nice, large bathroom. The windows were top-quality and we couldn't hear any outside noise. It snowed during our stay - what a treat!", "title": "Hotel was great, but the food??", "helpfulness": 4, "user": "Seasoned_Guest", "date": "December 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22814266, "likes": {"liked": "— Location", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My only complaint was the food at the hotel. The Thanksgiving dinner was far below par, and highly overpriced. In fact, most of the people at our table just pushed their food around on the plate and didn't eat much at all.", "title": "Really lovely hotel. Overdone restaurant.", "helpfulness": 6, "user": "saracHouston", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 22735047, "likes": {"liked": "— bathroom, public spaces", "disliked": "— restaurant, cocktail lounge"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "So, my advice is stay at the hotel, but find someplace else to eat!", "title": "Best option on the rim", "helpfulness": 4, "user": "BostonMAC", "date": "December 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 22444445, "likes": {"liked": "— The location - right on the GC South Rim", "disliked": "— Just basic rooms and OK service"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "This is a beautiful, historic hotel that I immediately fell in love with when I walked in. The staff was very friendly. The room was lovely -- especially an elegant bathroom that I would really love to have in my home. The website check-in time is stated as 4 p.m., but I was able to get in at 2 p.m. No wifi in the rooms, but the nearby public areas have free wifi, and they are so cozy that I had no problem spending some time there with my laptop. It really doesn't matter that the rooms don't have great views of the canyon; just walk a few steps outside and you'll see it just fine.", "title": "Charming family getaway", "helpfulness": 6, "user": "vintage2002mom", "date": "November 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22295537, "likes": {"liked": "— The location"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "we spent 2 nights at the El Tovar late september travelling with 2 other couples. obviously the hotel benefits from an outstanding location near the Grand Canyon. However the hotel is in dire need of a major renovation. rooms are oldish, service is poor, there is no wifi except int he lobby. all this for 400$ a night in a suite. food in the restaurant is good.", "title": "disappointing", "user": "ecran56003", "date": "October 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 81979063}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We were on a business trip to Las Vegas and decided to go see the Grand Canyon. I made reservations at the El Tovar the day we arrived. We were able to get a small standard room on the first floor. We had a beautiful view of the Canyon which was unexpected.. The room was small but cozy. The bedding was comfortable and there was a flat screen tv in the room which I would rather have not had. The room was small but charming and the bath had a pedestal sink and full tub with shower. It was a great stay. We enjoyed the hotel and all it had to offer...from the porch with its swing and rocking chairs to the beautiful restaurant and bar. In the morning coffee and tea are waiting for you in the mezzanie and the restaurant opens early as we got up at 5am to watch the sunset and then had a fantastic breakfast. My husband ordered the sonoran eggs which were amazing and highly recommended. The El Tovar is rustic but elegant and the location is incredible steps from the canyon. Enjoy!", "title": "Grand Style at the El Tovar Grand Canyon", "helpfulness": 1, "user": "cstarlight991", "date": "October 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81855014}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "Beautifully renovated rooms! We stayed in the Solarium Suite for our honeymoon! Elk on the lawn in the morning and a breath taking view twenty feet from the hotel! Do not come to Grand Canyon Park thinking you are going to get a five star meal, not bad, but not amazing. Even at the El Tovar dining room...it's nothing to write home about, but it's a pretty setting and it's the nicest you get on the rim. Second to that food wise is the Bright Angel lodge restauraunt, which Isy have even preferred over the El Tovar dining room. If you can afford the El Tovar Hotel-go for it. Book very far in advance!!!!!", "title": "Beautifully renovated rooms! We stayed in...", "user": "Coley710", "date": "September 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 81274781}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "There is no way to describe the location of this hotel other than awesome. The restaurant served at the hotel was good although very busy. We put the meal on the room and when we came to settle the bill there was $1-2 added to the bill- would suggest paying cash. The view from the bar veranda was awesome.", "title": "Great spot, but many other places to stay next door", "user": "MidlandsUnknown", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81100037}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed at El Tovar for two nights. Even though my confirmation from them said the room would not have a view of the canyon, we were extemely surprised to find that we were on the top floor with a great view. There is no lift, but valet staff are on hand to help you with luggage if required. The room was fantastic, very \"olde worlde\" plush, clean, huge comfortable bed. There is a restaurant (you have to book during the day for the night meal), great little bar area with snack food, looking out at the canyon through hugh glass windows. The price of the room, keeping in mind where it is, was more than reasonably priced. We just loved it, and wished we had enough time to spent another night.", "title": "A very special place to base your stay at the Grand Canyon", "helpfulness": 1, "user": "MingymooBrisbane", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80230958}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "Stayed at the El Tovar hotel for 1 night with my partner as part of a 2 day visit to Grand Canyon National Park and didn't want to leave!", "title": "An amazing stay....", "helpfulness": 4, "user": "Laineylop", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22101039}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The location of the hotel is superb. OK, so most of the rooms do not have canyon views, but you are right on the edge of the south room and the public porches provide you with excellent views over a well mixed cocktail from the bar.", "title": "Wonderful Hotel, Poor Restaurant", "helpfulness": 4, "user": "Gardner43", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21976700, "likes": {"liked": "— Beautiful room/location near rim of canyon", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We arrived at the hotel at 11am after taking the Open Roads Tour shuttle bus from Williams (which I would highly recommend!) and didn't expect to be able to get into our room due to the 3pm check in time. However, we were impressed that we were allocated a room on our arrival which was very convenient for us as it allowed us to change clothes before starting our 2 day GCNP adventure.", "title": "Fantastic hotel old world charm", "helpfulness": 2, "user": "sandalan", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21910335, "likes": {"liked": "— location", "disliked": "— bit pricey"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The hotel is historic and the public areas of the hotel were well maintained from our perspective. Our room was on the mezzanine level with a comfy bed and beautiful bathroom. We heard a few people complaining about the lack of elevators but that was to be expected given the age of the hotel. We had a lot of luggage but didn't find it too much of a hassle for staying in this wonderful place. We marvelled at the Elk grazing on the lawn.", "title": "Great Place to Stay!", "helpfulness": 1, "user": "MHS62", "date": "November 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21835288, "likes": {"liked": "— Close to the rim of the canyon.", "disliked": "— Room Service rudeness"}}, {"rating": 4.0, "title": "Liked it, was clean and great location, but can't say the same for restaurant", "text": "We booked a table in the restaurant a month or so in advance and were promptly seated for our evening meal. Perhaps it is a little pricey but we thoroughly enjoyed our meal after a busy day. I have read some of the comments about the wait staff and the quality of the meal, but we felt it was great on both counts so our experience seems to be contrary to some other reviewers, and we ate in some expensive restaurants during our 3 week US vacation. My french onion soup, pork with pineapple & mango and chocolate taco was yummy!", "helpfulness": 1, "user": "Devon11", "date": "November 13, 2008", "id": 21821347}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The El Tovar is definately the fanciest and nicest hotel within the Grand Canyon National Park. It has a great vibe and oozes history. The western style lobby is filled with antlers and comfy chairs. The restaurant is pretty good, but expensive, some of the seats have rim view. Luckily the Bright Angel lodge is 5 minutes away and has a much better value for money menu.", "title": "Location and history, but smallish rooms", "helpfulness": 2, "user": "WalterZDC", "date": "October 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20841861}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "One of the best things of the hotel is the outside porch where you can have your drink while watching the sun set over the canyon.", "title": "Wouldn't stay again", "helpfulness": 4, "user": "minsagin", "date": "October 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 20703635, "likes": {"liked": "— The location", "disliked": "— The chef plus very uncomfortable sofas."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Downsides of the El Tovar are that the rooms are not that big (remember, it was build 150 years ago), but instead you get history and location. The beds are great and the free coffee in the morning is a nice extra. I would certainly recommend this place and would stay here again if I visit the Grand Canyon.", "title": "Great location", "helpfulness": 4, "user": "Cazzyg", "date": "October 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20680860, "likes": {"liked": "— The location", "disliked": "— Motion in floorboards"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "What a location - it is fabulous and the Grand Canyon was beyond expectations. A truly wonderful destination.", "title": "Beautiful Location but staff very unhelpful", "helpfulness": 2, "user": "quirky76", "date": "October 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 20620333, "likes": {"liked": "— Amazing Location", "disliked": "— Old and smelly"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "We stayed in a ground floor standard room. I cannot fault the room. It was clean and the bed was comfortable. Our room was yards from the rim.", "title": "Room with a view", "helpfulness": 6, "user": "rosiebag", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20445263, "likes": {"liked": "— Views and convenience"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We had a small room at the terrace level. The room had an odd sound throughout our stay - almost as if the room was quietly breathing evenly in/out. The sound, though odd, was not disruptive to sleep.", "title": "Enjoyed our stay at El Tovar", "helpfulness": 1, "user": "VisitorBob", "date": "October 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 84580015}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We chose El Tovar for our stay as it was a historic lodge and the location was walking distance to the rim. Actually, we found that there are several hotels in the village area that are within walking distance to the rim. The room, while small, was clean and well appointed. So, our recommendation would be more for the historic lodge experience rather than location. While there was wireless Internet in the hotel lobby, we found that we could connect to wireless service from our room.", "title": "Awsome to stay just steps from the Grand Canyon!", "helpfulness": 1, "user": "worldtraveler38839", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83965141}, {"rating": 3.0, "title": "Cocktails and a great view", "text": "Everyone was friendly. The charm of the old lodge, the excellent food at the resturant and the huge porch with spectacular views all enhanced our experience of the Canyon. Being just steps away from the Canyon allowed us to take numerous walk and many pictures. The acutal room was small and not much counter space in the bathroom but the charm and location made up for the room size.", "helpfulness": 2, "user": "IllinoisFamilydude", "date": "October 17, 2010", "id": 83883463}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I did not stay at the El Tovar rather enjoyed some libations and appetizers out on the porch. Like many locations in Grand Canyon, the views are spectacular. We were fortunate enough to sit out on the deck overlooking the South Rim on a recent warm October afternoon. The main dining room was closed in preparation for dinner service but the cocktail lounge was open. We enjoyed the calamari appetizer which was lightly fried and not at all greasy. Instead of the usual calarmari rings, the rings were opened and served like a strip. They were presented in a \"flute\" of parchment paper which was unusual. A prickly pear margarita hit the spot perfectly. Nachos and wings rounded out the meal and were fresh and well prepared. My wife finished our snacking with a pecan creme brulee which was perfectly executed and delicious.", "title": "The Trip Of A Lifetime...The El Tovar !!", "helpfulness": 5, "user": "Arizjackie1022", "date": "October 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83745788}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Wanting to make our 15th wedding anniversary something very special, I booked 3 nights in the El Tovar Suite a year ago for our anniversary in Oct of 2010. It was hard to keep it a secret, but I did. My husband knew we were going to the Grand Canyon and the El Tovar, but he was expecting a small everyday little room. I really wanted to surprise him with something extraordinary to celebrate our 15 wonderful years together.", "title": "Stay there at least once", "user": "westozman", "date": "October 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 83707133}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The best thing about this hotel is the location. We were only staying for 1 night as part of our honeymoon. We had driven the 5 hours from Las Vegas and arrived just before sunset, which was amazing.", "title": "location, location", "helpfulness": 1, "user": "AET", "date": "November 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 21477821}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Our room was a double terrace room, which was down at basement level and was pretty small but was very clean, with a nice bathroom.", "title": "Excellent hotel", "helpfulness": 2, "user": "wsm4", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21381254, "likes": {"liked": "— So close to the rim", "disliked": "— Our room overlooked an employee car park but they all can't have a view of the canyon"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We tried to book dinner but couldn't get a table until 9.30pm so we just had some snacks at the bar. We ordered room service breakfast in the morning which was really nice.", "title": "Stunning Location", "helpfulness": 3, "user": "PackedNReady2GoAgain", "date": "October 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 21380063}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Stayed just one night at El Tovar in September 2008, what a lovely hotel.", "title": "Location,Location And History", "helpfulness": 2, "user": "aussiefamilySydney", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21093637, "likes": {"liked": "— Location and History", "disliked": "— Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We were staying in Scottsdale and made the trip up through Sedona National park, well worth the trip.", "title": "Wonderful!", "helpfulness": 1, "user": "Gina E", "date": "October 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21034748, "likes": {"liked": "— Location and comfort", "disliked": "— No elevators"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed at the El Tovar for 3 nights, having been to the Grand Canyon before on a day trip, we we wanted enough time to see and hike the canyon properly and decided that staying right on the rim was the best way to do this. The hotel's location really couldn't be any better and the building itself is very impressive.", "title": "Expensive and unfriendly, much better to stay in the village", "helpfulness": 1, "user": "BobandHannah", "date": "October 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 82562620}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "It should be noted that the 'free parking' is just the general visitor parking for the canyon, therefore you have to be lucky to get a space anywhere near the hotel.", "title": "Historic, great views -- teensy tiny rooms!", "user": "yakinikuman", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 82508371}, {"rating": 5.0, "title": "amazing", "text": "We arrived early for check in, so it was fair enough that our room wasn't ready, however go away and come back in 2 hours' is not exactly what we expected from a hotel that describes itself as 'First Class', with prices to match. This was generally the attitude of all the staff we came into contact with, but in the restaurants in the other lodges. When we got to our 'deluxe' room it was what you wuld normally expect in an average motel. When we spoke to the concierge to see if he had any suggestions as to what we could do during our stay, he told us to look at the leaflets and go to the visitor's centre, other than that he was unable to help.", "user": "gypseygirl", "date": "October 7, 2010", "id": 82473355}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "On one night we had dinner in the El Tovar dining room. The food was quite good as was the service, however it was very expensive. We also used the Arizona Room and The Bright Angel Restaurant, in both cases the food and the service was poor.", "title": "grand canyon is grand", "user": "kauniit", "date": "October 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82347088}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We also visited The El Tovar Lounge for drinks, here the service ranged from indifferent to openly rude.", "title": "AHHHHHHH the El Tovvvaaarrrrrrrrrrrrrr…..", "helpfulness": 5, "user": "NJoisygirl", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82253803}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 88, "average": 192, "very good": 508, "terrible": 43, "excellent": 584}, "aka": "El Tovar", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}}