{"user_rating": 4.5, "review_count": 813, "name": "Elan Hotel Los Angeles", "reviews": [{"rating": 4.0, "title": "Great value for the area", "text": "This is the second time I've stayed at the Elan, and once again I was very satisified. The staff is very helpful, but free parking would be nice (it's an additional $14.50). The hotel was nicely decorated and the location is great.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 28, 2005", "id": 3307485}, {"rating": 4.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "As your taxi draws up outside the Elan Modern, you could be forgiven for thinking \"Uh oh!\". But behind the worst-of-the-sixties architecture lies a little gem of a hotel with a level of service and the kind of personal touches usually reserved for the most expensive upscale chains. The hotel plays subtly on that sixties look throughout its very 21st century operation: the reception staff are dressed in fawn suits and crew neck sweaters; the lobby is furnished in modern retro; even the name evokes the era of Englebert Humperdinck and Frankie Vaughn. The rooms are a real pleasure. There are only about 20 of them, on two floors, and they are furnished in relaxing creams and browns. Toiletries are top quality, and are presented pocketed in folded towels. A dressing gown hangs on the bathroom door. There's a minibar and a stock of snacks, but you're unlikely to go hungry, because the Elan Modern includes a buffet breakfast in the very reasonable price: cereals, eggs, bagels, muffins and yogurt without the usual $15 added to the bill. Now to what's not perfect. The rooms are centered around a little inner courtyard, and for inexplicable reasons, they leave a bright light on in the yard all night. This means your room is never dark, and in fact, I ended up hanging a bath towel over the top of the curtains to block out the glare. The obsession with bright light extends to the fitness room which is oppressively overlit; it's also pretty basic, but there's a proper gym just along the road if you want a more extensive selection of kit. Despite the irritations this hotel is hard to beat, whether you're a tourist or business traveller. The attractions of Beverley Hills - the shops of Rodeo Drive and the bars and restaurants of Santa Monica Boulevard - are just minutes away, and it's a short drive to the Hollywood hills and the film studios which are a must see for every tourist. You won't go wrong basing an LA visit here.", "title": "Hidden secret of Beverly Hills", "helpfulness": 11, "user": "Scot_Wha's_Away", "date": "March 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3284526}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "We never guessed how cool this place would be, especially considering the price and location. It's very comfortable, although the rooms are small, and the decor is very cool. 600-count egyptian cotton sheets to boot. Within walking distance to the Beverly Center, real nice spread for the continental breakfast, and extremely friendly staff. It doesn't look like a hotel from the outside, so we actually drove past it a couple of times before we found it. This is my hotel of choice when I stay in LA.", "title": "Loved it!", "helpfulness": 13, "user": "fonz333", "date": "March 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3250224}, {"rating": 4.0, "title": "Comfy Retreat", "text": "This place suits my needs for a stay in la.", "helpfulness": 7, "user": "sfbaker", "date": "February 19, 2005", "id": 3211131}, {"rating": 5.0, "stay_parameters": "Stayed October 2006", "text": "Stayed just 1 night, after flying to LA before travelling inland, quality place, clean and well maintained, exellent staff, enjoyed the wine with the mangers in the evening and the breakfast before setting off. Well priced and well located for exploring LA.", "title": "Reccommended", "helpfulness": 5, "user": "John&Jennifer", "date": "November 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6063723}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Deserves all the praise you read. Nice modern rooms, free internet, nice morning breakfast, helpful staff, great location in the middle of Beverly Hills. All for a great price. Can't go wrong choosing Elan.", "title": "Great 3 Night Stay", "helpfulness": 5, "user": "nammer21", "date": "November 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6053877}, {"rating": 4.0, "title": "good", "text": "Stayed here for one night. Nice accomodations. Clean, modern. Not too noisy. I would recommend.", "helpfulness": 5, "user": "NYC999", "date": "October 31, 2006", "id": 6032824}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Stayed at the Elan from 13th to 16th October and, as we liked it so much, returned there after our 5 day trip to Vegas for another 3 nights. Unassuming in appearance, the hotel scores heavily for its great location, spotlessly clean, classically designed and very comfortable bedrooms, and the friendliness of management and staff. Jorge and his colleagues on the front desk were a revelation with their untiring and enthusiastic help in recommending great restaurants, places to visit etc. And management were particularly helpful in letting us have a complimentary room post-check out to freshen up for our evening flight home after a long day enjoying the Southern Cal sunshine.", "title": "Thoroughly recommended.", "helpfulness": 9, "user": "GJay", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6027925}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Had a great 3 night stay at the Elan Hotel in September.Location is convenient for all attractions-walking distance to Beverly Centre and simple drive to Hollywood,Farmers Market and Rodeo Dr.There is also a great diner across the road (Jans I think)and superb sushi bar 100 yards from the hotel.Staff were very knowledgable and friendly.Breakfast nice and cheese and wine in late afternoon very welcome after long day sightseeing.This really is a great value hotel and I wouldn't hesitate to use it again.", "title": "Great stay", "helpfulness": 9, "user": "MHH1", "date": "October 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5979992}, {"rating": 5.0, "title": "Top Service", "text": "We stayed in this hotel for 7 nights and from the minute we walked through the door, the staff exceeded our expectations. They were always helpful and honest and went beyond their call of duty to ensure we enjoyed our stay. The complimentary breakfast is wonderful and our rooms were always left immaculate. The free internet was also a nice bonus. If we return to LA we will definitely stay here again.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 26, 2005", "id": 3088852}, {"rating": 4.0, "title": "Slice of Style", "text": "This place was an awesome slice of LA style - cool colors, funky, laid-back. Not cookie-cutter at all - this place was not a chain and it didn't feel like you could be anywhere except LA. We booked a package through them for 360 total which included two nights, museum tickets, fanastic fresh breakfast, and $60 towards dinner at a nearby trattoria. The breakfast was hands down the best complimentary hotel breakfast I have ever seen - granola, wheat bread, bagels, real bakery pastries, fruit, fruit, fruit, great coffee. Bed was super-comfortable with high thread count linens. Bathroom was tiny but acceptable, bathrobes a nice touch. Common areas looked like they were either being renovated or in need of renovation but all in all, the Elan puts money into important stuff (bed, linens, funky decor, breakfast) and as for the rest, who cares if the hallway looks a little shabby. Finally, the front desk was phe-nomenal. I'm not usually a P.I.T.A. but I was without a car in LA and wanted to go to off-the-beaten-track places like Japantown and they helped me find bus routes to these random places even though they didn't know where they were - which means they took the time to research my P.I.T.A. requests - all with a smile. Finally, on the last night, I had planned to use my restaurant voucher but the place was closed on Monday nights and the front desk scored me a voucher to another restaurant even though we didn't make reservations like we were supposed to. They also arranged our super shuttle for us and had them wait for us when we were tied up at dinner. These people gave us 5-star service for a 2 star price. If their manager is reading, Jorge and Jordan deserve a raise. They were outstanding.", "user": "PT1976", "date": "August 30, 2005", "id": 3816437}, {"rating": 3.0, "title": "Opaque but not bad for the price.", "text": "After I read the reviews of the Elan on Trip Advisor and in several publications, I expected an incredibly hip hotel experience. Perhaps my expectations were too high certainly considering we didn't pay a whole lot. The room was rather bland filled with IKEA type furniture. Perhaps this where the \"hip\" quotient arrives from. Yet, this furniture is not holding up well and is showing signs of wear and tear. The bathroom was styled nicely in an inexpensive manner and looked like something a young up and coming couple would have in their first apartment The staff was friendly in that L.A. way letting you know that this hotel job is just temporary until their acting skills are discovered. The entire hotel experience was rather opaque reflecting on the entire hotel's ambience. The neighborhood is not too bad, within walking distance of Melrose etc. But, I forgot, nobody walks in L.A.! We were rather incongruous as we strolled down Beverly Blvd. If you can get a really low price, the Elan Modern Hotel is not too bad. It's just rather opaque.........Whatever that means.", "user": "enofile1", "date": "August 24, 2005", "id": 3803066}, {"rating": 2.0, "title": "Not good", "text": "Stayed at the Elan for 2 nights - in town for business. It is very sad if this is one of the top hotels in LA...b/c frankly it was not good AT ALL!! The room I was given at first was on the main floor and was sooo loud, it was ridiculous!! The bed comforter had stains all over and so did the carpet and headboard. The carpet edges were brown with dirt and were very frayed and tattered. Overall the room was very old and worn looking - marks all over the wall etc. - much in need of a reno. The garbage had not been cleaned out from the previous guest and there were hairs in both the sink and all over the tub. The room framework ie. bed, comforter headboard(as seen in pics) looks nice but it is deceiving. I asked to switch to a clean and quieter room. The front desk was not very understanding or helpful. I'm sure this was a nice hotel 5 to 10 yrs ago but now it is just old looking. Note: The main areas are better maintained than the rooms and beds are comfortable. When they finally allowed me to switch to a 2nd floor room it was only slightly better - still fairly noisy (all though not nearly as bad) but again the room was old, worn and stained. There were also hairs in the shower of this room! I will definitely not stay here again even though the location is great, price is good and the cocktail hour and breakfast were good - cleanliness is very poor and that is much more important to me!", "user": "beachydr", "date": "August 20, 2005", "id": 3792006}, {"rating": 5.0, "title": "A Fabulous Find", "text": "My wife and I are frequent domestic and international travellers who have visited LA often in recent years. After an extended cruise we just spent three thoroughly enjoyable nights at the Elan Modern and cannot be more positive in our evaluation of the establishment and its services. This is a terrific boutique-style hotel at a great location for dining, shopping, night life and just getting around LA. Our very spacious room with king size bed and large bathroom was tastefully decorated in muted tones with fixtures and furniture of Art Deco/Moderne design. A nice touch was the availability of a local restaurant listing delineated by ethnicity, location and price, complemented by an abundance of recent periodicals reviewing current tourist attractions and museum shows, as well as additional dining and shopping possibilities. Bedroom and bathroom linens and toiletries were of the highest caliber and a DSL connection (which we did not need on this occasion) was available in the room, while internet access (which I did use) and a printer (handy for keeping directions to the Getty and other tourist attractions) were available in the lobby's business center/lounge. The hotel's clientele was quite diverse: straight couples, gay couples, business people and singles. With West Hollywood nearby the hotel was clearly gay-friendly.", "user": "Catullus1", "date": "August 18, 2005", "id": 3787994}, {"rating": 3.0, "title": "Good Value for the Area", "text": "Valet parking was swift and efficient ($14.50 per 24 hrs.), with its own underground garage which minimized waiting time (almost none). The included continental breakfast was a cornucopia of choices: hot and cold beverages, fruit, cereals, eggs (hard boiled), toast and muffins. The services of the front desk and the housekeeping staff could not have been more friendly, welcoming, courteous and helpful.", "user": "SLTravels", "date": "August 12, 2005", "id": 3756754}, {"rating": 4.0, "title": "Eclectic style, privacy and convenience", "text": "I recently stayed at the Elan Hotel Modern on Beverly Blvd., in Los Angeles, near Bevery Hills. It was within walking distance of the Cedars-Sinai Hospital complex and the decorating district on Beverly, and within a short drive to Hollywood, Sunset Blvd, and La Brea. The styling inside and out is a delightful modern version of the late 1950s-early 1960s. The accomodations are all one needs, with an emphasis on privacy. Continental breakfast was delicious, and the staff was both friendly and accommodating. The facade is modest and inconspicuous, and is thus a perfect spot for one seeking to be in town without a lot of attention. Evidently, Matt Damon selects the property for that quality, and I would agree. Prices are reasonable, esp. for LA. My expectations are simple, and set low by too many nights in hotel rooms that all appear the same, down to the TV remote. This hotel will make you comfortable, not cost you too much, and you will feel you are in a memorable place. Highly recommended.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 21, 2005", "id": 3588978}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "To paraphrase a prior review, you may very well indeed think “uh-oh” at first sight of the Elan. The hotel is pretty small, and although they’ve updated the place to give it a hip vibe, it’s still pretty easy to discern that the building itself is getting on in years. When we were greeted promptly at the curb by a friendly valet, however, and then by the professional front desk staff, our minds were soon put at ease.", "title": "Aims for style but wins on substance", "helpfulness": 30, "user": "JohnInLouisville", "date": "June 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3520389}, {"rating": 5.0, "title": "Terrific secret", "text": "Although our deluxe king room was on the small side, it was quiet, clean, and comfortable. The somewhat overwrought décor of the hotel’s public areas thankfully did not extend to the rooms which were still modern in design but more subdued. Even though our room was facing Beverly Boulevard, we were not kept awake by traffic noise save for an occasional siren (the hotel is a few blocks from Cedars Sinai Medical Center) which I doubt even the best soundproofing technology could have stifled. Linens were of high quality and soft; bed was firm. The closet comes with lots of shelf space which was so useful! Could hear some occasional chatter coming from an adjoining room but nothing too disrupting. Bathroom was small but adequate—for some reason we seemed to have problems with water splashing up and pooling on the basin’s countertop.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "May 21, 2005", "id": 3491284}, {"rating": 4.0, "title": "fabulous little place", "text": "The lobby’s retro-modern design came across as a bit cold and echoey; carpeting would have helped. The floor-to-ceiling windows were compelling but offered little more than a view of the Taco Bell across the street. The continental breakfast served in the lobby was akin to what you might get at a Hampton or Best Western which, for us, was preferable to gorging on pancakes and eggs every morning anyway. Free internet access in the small business center right off the lobby was handy for checking e-mail or printing boarding passes. The elevator was slow and a little crude. Hotel’s hallways were a bit dark and narrow.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 5, 2005", "id": 3440919}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "The location of the Elan is good. The hotel’s small size makes stepping out of your room and going places a snap, unlike larger hotels which sometime require an act of Congress just to reunite you with your car again. Beverly Center shopping and restaurants are only a 2 or 3 block walk away. Several other decent restaurants were within walking distance. There is also a huge Rexall drug store a block away for all those items you forgot to bring with you on your trip. Beverly Hills, CBS studios, and all the Hollywood attractions are a 5-minute drive—10 minutes tops. My companion and I did manage to walk to West Hollywood from the hotel, which is quite a trek but manageable if you’re up to it. (I suggest taking Beverly to Robertson rather than walking straight up La Cienega to Santa Monica Boulevard should you decide to walk it. It’s a shorter and a much more pleasant stroll.)", "title": "Elan is a great place!!!", "helpfulness": 13, "user": "ATX-HOU", "date": "April 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3416661}, {"rating": 4.0, "title": "LOCATION LOCATION", "text": "We stayed here for 7 nights based on reviews on our vaction from singapore, and 1st impression was how friendly the check in staff were. Rooms are small but clean and buffet for breakfast was ok. The location is great and its easy to get anywhere around LA from here if you have a car. The free wine and chees every evening is a nice touch.", "helpfulness": 8, "user": "Vic888", "date": "January 8, 2007", "id": 6566864}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "negatives would be the lack of blinds to stop the sun literally blinding you in breakfast area, and prices are high at $150ish/night compared to other 3 star hotels like Holiday Inn express ..especially ig like us you just want a place to sleep.", "title": "Very friendly, helpful staff and a great location!", "helpfulness": 6, "user": "lessmore", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6563126, "likes": {"liked": "— Location", "disliked": "— Valet parking with no other option"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "Overall a nice hotel with very freindly and helpful staff .", "title": "3-star hotel in a 5-star location", "helpfulness": 5, "user": "Sophie_In_Taipei", "date": "December 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6517942}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We stayed here once in early December, '06 and again in early January, '07. Both times were great experiences and we'll not hesitate to go back again.", "title": "Thanks for a wonderful time!", "helpfulness": 9, "user": "Rach212", "date": "December 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6470636, "likes": {"liked": "— Superb staff!", "disliked": "— Breakfast area gets v hot in the morning"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The location is within walking distance of many excellent restaurants and shopping. A short drive will take you to the heart of Beverly Hills and all it's hot spots for shopping, dining and nightlife.", "title": "This place is the business !", "helpfulness": 10, "user": "cquinn", "date": "December 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6436726, "likes": {"liked": "— free wine and breakfast and staff", "disliked": "— Go to elan if you travel to LA"}}, {"rating": 5.0, "title": "A great hotel bargain", "text": "We have stayed at the Elan about 6 times during the last 2 years. Our daughter lives in the area and we have experimented with other properties close by (Sofitel and LeMeridien). When we found the Elan, we stayed with it! We like that it is NOT a chain. The service people are friendly and the ambience is a bit different from other places. It is small (about 50 rooms) and only two floors, consequently, no lines for elevators or to access our car.", "helpfulness": 11, "user": "MissChrisCentralPA", "date": "January 24, 2007", "id": 6687727}, {"rating": 4.0, "title": "good location, clean and friendly personnel", "text": "A straight shot from the airport (on LaCienega) it is convenient to get to and to get around to Beverly Hills, Hollywood, Miracle Mile, etc., without getting on an freeway.", "helpfulness": 6, "user": "huguetje", "date": "January 19, 2007", "id": 6623616}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "There is a convenient buffet breakfast and access to the internet. I do not think this place is for heavy-duty business travelers nor does it seem to attract them. For those of us who are there for vacation, it's nice not to have those work-type intrusions.", "title": "Would recommend to anyone!", "helpfulness": 8, "user": "JustMarriedWtgn", "date": "January 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6621251, "likes": {"liked": "— The staff", "disliked": "— The breakfast's"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "My one criticism is that some of the rooms are looking a bit tired. I have heard that a refurbishing is planned, so you may want to check on that.", "title": "Really friendly staff", "helpfulness": 11, "user": "bewoodsy", "date": "January 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6604205, "likes": {"liked": "— Friendly atmosphere", "disliked": "— Sun shining in my eyes when eating"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I just came on the website to check about the Orlando which is another boutique hotel in the same area; however, given the cost of that hotel (~$100 more per night) and the guest reactions, I am staying with the Elan.", "title": "Here are the special advantages of this hotel", "helpfulness": 16, "user": "boomertraveller", "date": "January 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6586240, "likes": {"liked": "— Superior front desk service", "disliked": "— Rooms are a little small"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "After reading the rapturous reviews on TA, my expectations were sky high. The reality? A perfectly OK budget hotel, but nothing to write home about.", "title": "What's all the fuss about?", "helpfulness": 8, "user": "estragon", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 6364298, "likes": {"liked": "— free internet, friendly staff", "disliked": "— small room, overheated lobby at breakfast"}}, {"rating": 5.0, "title": "Unbelievably peaceful place to stay and relax", "text": "First, the good. The service was first-rate. The staff were uniformly friendly, welcoming and competent. The bed in my first-floor room was extremely comfortable, and the bathroom was clean and well-maintained. Free wireless and a free printer in the business centre are definitely a step above the hotels that charge ten bucks a night for internet. And the 5-7 wine reception is a very nice touch.", "helpfulness": 10, "user": "Sistinas", "date": "November 26, 2006", "id": 6178600}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The not-so-good: The rooms are small, the decor is bland, and the hallways are especially ugly. The location? Other than the fact that there's a huge mall a block away, there's nothing to recommend it. The Elan Modern is on a bland stretch of Beverley Blvd., across from a Taco Bell and a greasy spoon. The hotel is only two storeys high, so most of the rooms are uncomfortably close to the street, which sometimes gets quite noisy. The buffet breakfast (included in the room rate) is OK, but it's served in the lobby, which on sunny days (this being L.A., that means most days) is uncomfortably hot, with barely any shade.", "title": "Why stay anywhere else?", "helpfulness": 7, "user": "frocha", "date": "November 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6171228, "likes": {"liked": "— Spacious, clean, location", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "So, bottom line: if I come to L.A. on vacation and need an inexpensive, centrally located place to stay, I'd consider the Elan again. If I am travelling on business, as I was this time around, no way.", "title": "Enjoyed stay at the Elan", "helpfulness": 4, "user": "moodster", "date": "November 20, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 6157967, "likes": {"liked": "— Comfortable accommodation", "disliked": "— Noisy road"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "This was our first vacation in years, to visit my brother after he moved to LA, and spend Thanksgiving (and our birthdays) together. I had a huge fear of paying a ton of money to be treated like crap or have a bad experience, so I really sweated the hotel selection. I craved a modern decor and not a chain hotel, and leaned toward the Chamberlain for awhile, but eventually decided on the Elan thanks to the reivews on this site. I booked thru Travelocity and paid $155/night from Nov 19 to Nov 24, checking out on Nov 25. This was for the king sized bed suite.", "title": "Elan Excells", "helpfulness": 10, "user": "kangas", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6093413, "likes": {"liked": "— The exceptional service we received.", "disliked": "— nothing !!"}}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 3, "variance": {"poor": 17, "average": 53, "very good": 254, "terrible": 3, "excellent": 486}, "slim_ranking": 0.0159744408946, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "With an address at the cutting edge of Beverly Hills and Hollywood, the Elan Hotel is just steps from world class shopping at Beverly Center and The Grove Los Angeles. Just minutes to Cedars-Sinai Medical Center, CBS Television City, Rodeo Drive, the Sunset Strip and central to the Pacific Design Center, museums, movie studios and the restaurants and nightlife LA is famous for - this is a location that cannot be beat."}