{"user_rating": 4.0, "review_count": 545, "name": "Elbow Beach, Bermuda", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "After staying at many Ritz Carltons and 4 Seasons around the world, my girlfriend and I were not satisfied or impressed with Elbow Beach. The beach is top notch and one of the nicest in Bermuda. The service is very good and the staff is very friendly and attentive, but they have really have no choice. This hotel is very dated and the rooms are old. They claim to have renovated rooms out of the main hotel, but they are more like mildew smelling cabins you would see in a Friday the 13th movie. After viewing the so called villas (which really do not overlook beach) we chose to stay in main hotel. At first glance the room was better, however the hot water did not work and we had major plumbing issues. On day 2 we checked out and said goodbye. They did credit us substantially and the hotel was well aware of several issues with many rooms. The food was ok, but nothing great. The Brunch on Sunday was really good though. There are free internet computers in the lobby which is a nice feature.", "title": "Great Service but very Old Hotel", "user": "AMG329", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 8704249, "likes": {"liked": "— Free Internet and Great Beach", "disliked": "— Very Dated and Old Windows, Doors, Elevators, Furniture, etc"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I totally agree with the last review, which by the way, was submitted for the same period that we were there. We've been to Bermuda several times in the past and have stayed at Elbow Beach before, but we don't ever remember the service being so non-existent.", "title": "2 Thumbs down to the service at Elbow Beach", "user": "kelbon", "date": "September 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 8659975, "likes": {"liked": "— The new spa is amazing!", "disliked": "— The lack of service."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We had a horrible experience upon arriving at the restaurant near the pool. After waiting for almost 40 minutes, after being totally ignored by waiters, we got up to ask for menus. Even after we got the menus we still had to wait for at least another 10 minutes to order. The waitstaff just didn't seem to care one way or the other about us.", "title": "Elbow Beach - NOT so great!!", "helpfulness": 2, "user": "Trvlr90", "date": "August 31, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 8591654, "likes": {"liked": "— The Beach", "disliked": "— The Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Another poor experience was when we went for a drink at the bar on the beach and had to listen to the two bartenders complain non-stop about their jobs, the clients and everything else under the sun. We almost felt apologetic being there.", "title": "First class hotel in a brilliant location", "helpfulness": 3, "user": "aTraveller67", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8548264, "likes": {"liked": "— The location", "disliked": "— Small Bathroom"}}, {"rating": 4.0, "title": "Nice Property", "text": "To be fair, we did have a few very good experiences with individual servers during our trip. And the housekeeping staff were very friendly and attentive, but on the whole, we were very disappointed with the service we received while there.", "helpfulness": 1, "user": "Bellapriss", "date": "August 18, 2007", "id": 8449381}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I just returned from a week stay for my honeymoon. Elbow Beach is definitely the fanciest place to stay and best for couples (rather than families). The entire hotel was booked but the place was very quiet and we rarely saw crowds of people. There was never a problem getting a (good) chair at the pool or beach and the service was impeccable. The hotel rooms are definitely on the small side but Mandarin Oriental is apparelty upgrading everything, starting with cottages. I would go for a cottage next time. Bermuda is expensive and this place is no exception but its vacation and everything is well worth with. Cant wait to go back.", "title": "Amazing Beaches & Perfect Service", "helpfulness": 2, "user": "EKPD", "date": "August 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8443032}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I went for 4 nights (Aug 11-15 Aug). I had read reviews and knew it was going to be expensive. I choose to stay in a premier room in a seperate cottage type room not in the main hotel (I had heard main hotel was still dated and premiers were updated). It was $600 a night but I must say the room was beautiful. It was large with a huge vanity area and the shower was big a fabulous (great temp and pressure). I heard the water tasted bad so I brought a few mini bottles of water with me and used it for brushing my teeth. I saw only one ant in the room the entire time. The beach is beautiful and it is so nice to go down there and have a towel, lounge chair, and umbrella available. The pool was nice too. The food was good that I ate. It is expensive but I expected that. Breakfast buffet at seahorse grill was $26 per person. It was good. In the states I would expect alot more for my $$--but I knew what I was getting into. We used the bus system and you can have the conceirge help you with that. We rode the ferry as well--it is a very nice ride. We went to the aquarium -- it was nice. It's not like a huge big city aquarium but nice enough. We went to St. George and took a tour with a horse/buggy and the man gave us history of the island. I enjoyed that. Tobacco Bay is there -- we saw it but didn't have our suits with us. It look like a nice place to snorkle and hang out. We went to the perfumery -- it was interesting to hear the history and see how they make the bermuda perfume. We went to Hamilton and shopped some--it is nice.", "title": "Very Nice", "helpfulness": 1, "user": "tripsmomma", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8434081, "likes": {"liked": "— Beautiful room, large vanity and fabulous shower!!!!!!!!!!!!!!!", "disliked": "— The best was average - could have been a bit more comfortable,"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "All food/bar already has tip included. I have been to Mexico and Bahamas before and I'd say they all have beautiful beaches. I love bermuda's sand -- it has all the pink flecks in it. If you are on a budget -- go to Mexico. I liked the fact that in Bermuda I didn't have one timeshare person approach me. Maybe there aren't any? The people are very very friendly too. I also had 2 spa treatments that were really nice--once again expensive. Have fun if you decide to go and feel free to email me.", "title": "Lovely Time for One time", "helpfulness": 2, "user": "moraly", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8422644}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Read the reviews on TripAdvisor ( as always) before going to Elbow Beach and after spending a 3 night mini honeymoon there I can tell you this:", "title": "Babymoon in Bermuda", "helpfulness": 1, "user": "Wicomico091705", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8386282, "likes": {"liked": "— Beach and Friendly Service", "disliked": "— Going Home!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "1. Being from NYC and traveling all over the world staying at very nice hotels, the prices are expensive, yes, but not anymore expensive than any other 4 or 5 star hotel. The food was very good over all. I suggest splurging at the Seahorse grill in ordering the Tasting menu with wine pairing. The meal for the 2 of us came out to a little under 300.00 but it was worth it!", "title": "Great Service", "helpfulness": 1, "user": "pebblebeach46", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8380008}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "My sister and I took our mother for a long weekend away. We arrived early and were thrilled to be able to get into our room before noon. We had a deluxe beach front room which was really clean and nice. The only complaint I had with the room is the pull out sofa bed. It was bent beyond repair and my sister slept with her feet raised above her head each night. So, if you plan on having to use the sofa beds make sure it's the first thing you check when you get into the room. They had no other room to give us since they had 4 weddings taking place on the property during our stay.", "title": "Nice but expensive resort", "helpfulness": 1, "user": "PottDuff", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 10319717, "likes": {"liked": "— Location on Beach", "disliked": "— Sofa Bed"}}, {"rating": 4.0, "title": "Much improved", "text": "The staff for the most part were very nice and pleasant. The door men were fantastic. Very friendly, funny and informative. The waitstaff at the beach restuarant and the lido cafe were average. Had to wait to get service and to recieve our drinks. Prices were high but that is every where on the island. We took the breakfast package which is well worth it. They had a real nice buffet each morning with a large selection of items to choose from.", "helpfulness": 3, "user": "tynwald", "date": "October 23, 2007", "id": 10249212}, {"rating": 1.0, "title": "Sometimes old is just OLD", "text": "I would check out some of the other resturants on the island. Waterlot was wonderful, Fresco's wine bar was really nice and Aqua was average. All very pricey but nice.", "helpfulness": 6, "user": "dcoyne1950", "date": "October 21, 2007", "id": 10187030}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "I will go back to Elbow Beach again sometime soon.", "title": "Unbearable mold and mildew in older rooms", "helpfulness": 8, "user": "PCV_hasbeen", "date": "October 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 10079747}, {"rating": 2.0, "title": "Bugs & Mold", "text": "Elbow Beach, well situated on a small but lovely Bermuda beach, has been revitalised over the last 2 years by Mandarin Oriental management. It had become tired and run down but now ,thanks to some major refurbishment and the excellent hotel managment you would expect from MO , it has once again become an enjoyable place to stay at.. Further refurbishment is on the cards, which if attractively done will make Elbow Beach a No 1 place to stay in Bermuda.", "helpfulness": 1, "user": "Jacktrack", "date": "October 14, 2007", "id": 10078841}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "This is a Mandarin property - but it needs a lot of work to step up to Mandarin standards. Service was good - but not stellar. My first room smelled so badly of mildew that I had to switch rooms - and the 2nd room was \"ok\" - I even paid to upgrade from a deluxe to a junior suite (no other deluxes were available to switch to, and the hotel did not offer to comp the change despite the mildew issue). Both rooms were in the main building. I have stayed here before in one of the \"cabana\" rooms - which had been upgraded and was much nicer. Internet service was spotty. The restaurants are good, and the hotel is beautifully sited - can't complain about the pool or the beach either. Mandarin needs to step it up a bit here..", "title": "Mandarin needs to spend some $$", "helpfulness": 2, "user": "Rafi2000", "date": "October 2, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10031446}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed at the Elbow Beach Resort in Bermuda for 5 nights. It was a short 1 hour and 38 minute flight. I read some negative review sof the hotel and I don't agree with them at all. We stayed in a renovated Premium Ocean view Room. We were in the Coralita Building Room 754. It was right in the middle of the resort between the beach and hotel. It was gorgeous! It was honestly the best hotel room I have ever stayed in and I am pretty fussy. The king bed was luxurious, there was a soaking tub in the middle of the room. The bathroom had a separate toilet area and huge shower with a huge shower head from the ceiling. There were double sinks with marble tops. It was really gorgeous. The best part was these shutter doors that closed off the bath completely or you could keep it open to the bedroom. Really Cool! There also was a desk area, plasma television, huge walk in closet and a bar area. The design was truly wonderful.", "title": "Loved this Hotel", "helpfulness": 5, "user": "stjlva", "date": "September 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10016000, "likes": {"liked": "— The Room", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I don't think that the main hotel has been renovated just yet so maybe that is where the complaints are coming from. The hotel itself I think was built in1899 but from the common areas that I could see they were very clean and well kept.", "title": "Perfect Vacation", "helpfulness": 1, "user": "mariaprincepecia", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10000244, "likes": {"liked": "— The location", "disliked": "— The ants ...but they are all over Bermuda."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The beach was fabulous. The water was 83 degrees and crystal clear. Hardly any seaweed and pretty good size surf. The sand was slightly pink. We walked down to the right about 1/2 mile to this very private beach with small caves. Nice Walk.", "title": "Not a 4 or 5 star hotel....but just okay.", "user": "goodsport123", "date": "September 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8751990, "likes": {"liked": "— The View from our hotel room.", "disliked": "— Restaurant service at the hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The drinks were expensive, Each round was about $20. My husband would have a beer and I would have either a frozen drink or grey goose. The tip is always included which is 15%.", "title": "Fantastic Trip", "helpfulness": 2, "user": "pinkolya", "date": "September 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8736932}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 73, "average": 80, "very good": 162, "terrible": 29, "excellent": 201}, "aka": "Elbow Beach, Bermuda Hotel", "slim_ranking": 0.714285714286, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Elbow Beach is an intimate luxury resort featuring 98 guestrooms and suites spread amongst 50 acres of tropical gardens sloping down to an immaculate private pink sand beach. The newly refurbished guestrooms have been enhanced with the addition of advanced in-room entertainment systems, luxurious soft furnishings, iPod docking stations, personal espresso machines and upgraded bathroom facilities. Facilities include a holistic spa, swimming pool, fitness room, recreation lounge, tennis courts and more."}