{"user_rating": 4.5, "review_count": 401, "name": "Elephant Safari Park & Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "First of all I can't stress enough how much fun the elephants are, was a thoroughly enjoyable experience throughout our stay!! They are beautiful gentle creatures that truly made our stay! The rooms were luxurious and spotless and were turned down twice daily, again very impressive. The food and especially the drinks were very pricey ($30 per person for a buffet) and as you are confined to the park you dontreally have any option. This didn't really bother us too much, but as my girlfriend is vegetarian her options were very limited ( pizza or pasta) another issue was how early everything closed, I am aware that it is primarily aimed at families but however after 8.30 pm it turns into a ghost town. There is a bar but it never seemed to open, kind of forcing you back to your room very early. Overall this does not take away from what was a fantastic experience. Day and night safari rides were great fun, talent shows 3 x daily and getting picked up from your room by an elephant was again a great touch!!", "title": "Brilliant,brilliant fun! If not slightly pricey", "user": "teamporse", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 117159094}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "If you want to ride elephants, go to Chiang Mai, Thailand instead. This hotel was a very big disappointment.", "title": "Not a good hotel", "helpfulness": 1, "user": "CdrD", "date": "August 23, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 2.0}, "id": 117111244}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "*Rooms were no better than a low end 2-star hotel.", "title": "fantastic park, spectacular gardens, warm staff, gentle beasties", "helpfulness": 2, "user": "picnicjones", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117047164}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "*Rooms were very very dank and musty.", "title": "Magic, Can't wait to return with family and friends.", "user": "RapBerry_NSWl", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117043177}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "*Lighting was terrible.", "title": "The most exciting experience in a magic location", "user": "GLC-IT", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117035679}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We loved our experience at the Safari Park. You are able to get up close and personal with the elephants on a ride and feed them. All the elephants seem to be humanely treated and well looked after. The guides were very friendly and happy to answer your questions. The show was interactive and demonstrated what clever animals elephants are.", "title": "Amazing experience", "helpfulness": 3, "user": "xelar8", "date": "November 20, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 120807618}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We couldn't believe how available the elephants are. When we visited, there were about 40 of them, several very young. They are rescue animals from Sumatra and seem in great health. They are tethered at night, which is a little bothersome, but when you see them splashing in the water and playing with their mahouts, you almost forget about it. We washed them, fed them, swam with them (!) and fell completely in love. The staff is wonderful, the accommodations were fine (good, clean). The elephants come to pick you up for dinner each night. Close to Ubud, the must-see cultural center of Bali. We had a ball, both in town and at the Park. Next time I might devote several days just to the elephants.", "title": "If you love elephants, come here!", "helpfulness": 1, "user": "davitt", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120710526}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "didn't stay at the hotel, just did the visit during the day and found it clean and well run! Definitely buy the lunch inclusion when booking from your hotel, although the food was pretty average. But, you're not there for the food are you?!", "title": "Great day out!!", "user": "ropate01", "date": "November 16, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 120686347}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We all loved it, loved the elephant rides and thought it excellent value for money compared to what else is on offer....we are always wary of anything to do with animals in Bali as often we have found the animals (see Turtle Island review and then DONT GO THERE!!) but this, along with the bird park is clean and humane...", "title": "visit to park only, didnt stay at the hotel", "helpfulness": 1, "user": "womblewa", "date": "October 25, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 119733099}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed 2 nights, I chose this place because my sister has always loved elephants and I was taking her to Bali for the first time (my 8th time). The price almost scared me off, we needed 2 rooms because I had my 2 teenagers with me as well, I'm glad it didnt. We dont have a bad thing to say about the place. The food was lovely, we did a la carte for dinner and it cost us less than AUD50 for 4 of us to have 2 courses. The professional photographer followed us around for the 3 days and the disk of all the photos cost around AUD3. I would definately consider going back - a welcome change from the kaos of Kuta. When we arrived they gave us a printed itinerary with our activities already booked for safaris etc. It made the stay stress free.", "title": "Awesome experience", "helpfulness": 3, "user": "DiBecker", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 119013538}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed only one night up at the safari park, but it was truly lovely. I took my mum there for a surprise for her, but i was truly pleasantly surprised as well.", "title": "Simply lovely", "helpfulness": 1, "user": "Lisa R", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118988137}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The room was spacious and very clean. Looking out over the park and seeing the elephants playing and walking was just wonderful.", "title": "gorgeous creatures", "helpfulness": 2, "user": "Dianne R", "date": "October 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 118913934}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The food was great and my mum didn't want to leave the next day - she bathed the elephants and was so excited to be picked up by the elephants and chauffeur driven(ridden) to dinner.", "title": "Loved it! Great with the kids.", "user": "Chab1", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118867052}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "The only down size is the price, but i guess it does take a lot to look after the elephants", "title": "Fantastic Experience - Well worth staying overnight", "helpfulness": 2, "user": "stuffmatters", "date": "September 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118344096}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I have not stayed at the Lodge yet but hopefully will soon. We visited the park last year for the first time and I was just blown away by these beautiful creatures and how close you could get to them, We revisited this September and unfortunately chose the day the main pond was being drained for cleaning. This was more than made up for by actually meeting Nigel Mason, (my hero), who was down in the muck helping out. Nigel was very friendly and informative and as we were leaving tooted and waved to us from his little bobcat. I just love this park and cant wait for my next trip.", "title": "Elephants and more elephants", "helpfulness": 4, "user": "tinytravellers", "date": "September 19, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118314968}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "For my first few trips to bali i dismissed staying here due to how expensive it was per night.", "title": "Great Value For Money", "user": "Chels-bali", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 118096719}, {"rating": 2.0, "title": "I couldn't help feeling uncomfortable...", "text": "however after staying here we sat s=down and calculated how much it would actually cost for all the inclusions we received.on arrival we recieved welcome drinks we ashumed we would have to wait as we arrived earlier than check in however we did not someone took our bags up to our room as our escort took us for a tour and orientation to the park. so of we went cocktail in hand to checkout the spa, resteraunt elephant gardens and the baby animals we couldnt beleive we we got to our room that our travel agent had managed to get us an upgrade to the elephant view rooms. we were about 10mtrs from the hugest elephant we had even seen.", "helpfulness": 11, "user": "pointgreyeric", "date": "September 4, 2011", "id": 117644684}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "once we had settled down from all the excitment our guide informed us that they had taken the liberty of writing up ittinararies for us so we could get the best the park has to offer in the small amount of time we were staying at the park.", "title": "AWESOME, FANTASTIC!", "user": "travelbugDarwin", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117487078}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "we arrived at our room and started to get settled in around 12 just as it started to pour. so we ordered room service and settled in with some cocktails on the balcony.", "title": "Nice place, One Night Will do", "user": "JRA222NYC", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117251759}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "after lunch we decided to have some spa treatments which was convieniently located right next door. i have a manicure and pedicure my sister had a leg massage and my friend had a pedicure they timed our services perfectly so we could sit and have the complimetary ginger tea together. the girls that work in the spa are a credit to the hotel they were always perfectly timed so they made you feel at home without chatting the whole way through the treatment. i'm pretty sure i even fell asleep which is what i really needed after the last 3 day being jam packed full of tours in ubud. later that evening were received a phone call to let us know it was time to get ready for dinner as the elephants would be arriving in 15 mins to chaufer us to dinner. which was a lovely suprise. while in the resteraunt we sat down to our complimentary appertisers and ordered our meals we were then told it was time for our included night safari and that dinner is perfectly timed for when we finish the ride which it certainly was. all the elephants at the park seam very happy their manhouts take good care of them and know them very well. after a long day we hit the sack.", "title": "Back For More Tranquility", "helpfulness": 1, "user": "Melanie R", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117210909}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 11, "average": 15, "very good": 85, "terrible": 5, "excellent": 285}, "aka": "Elephant Safari Park Hotel Ubud", "slim_ranking": 0.0823529411765, "description": "Ideal for animal lovers and nature lovers, guests staying at the Elephant Safari Park Lodge get to wake up to the sights and sounds of elephants. When you wake up, head to the Mammoths Head Bar terrace and enjoy your breakfast as you overlook the surrounding lush forest. Have your private elephant chauffeur pick you up from your room and take you on an elephant trek through Taro forest. Have fun bathing, feeding and petting the elephants before you enjoy an evening stroll around the botanical gardens. The Elephant Safari Park Lodge is located just 20 minutes north from the islands cultural and artistic centre of Ubud and 75 minutes north of Ngurah Rai Airport in the historic village of Taro."}