{"user_rating": 3.0, "review_count": 217, "name": "Eliseo Hotel", "reviews": [{"rating": 3.0, "title": "Do not expect too much", "text": "I stayed two night at Eliseo hotel in Rome. I may agree with others that it is not a four star hotel. However, the location is great, it is in a quiet street, and it has some special atmosphere. Bear in mind that hotels in Via Venetto are highly expensive so this hotel offers rooms for reasonable prices. I am not a demanding traveller and I used most of my time to enjoy Rome so I was satisfied with my room. However, it was rather small. Bathroom was nice, but you can hardly fit into the shower. Breakfast was fine although the service was poor - my impression was that lacked staff so poor lady did not manage to serve everyone. Receptionists were OK, somewhat cold and over proffesional. Definitely, you should expect more comfort in a for star hotel but you may be satisfied if you do not expect too much.", "user": "Shule", "date": "September 8, 2005", "id": 3887269}, {"rating": 2.0, "title": "4 star price, 2 star hotel", "text": "Just returned from a 3 night stay. We booked 2 rooms both were as bad as the other, before going read other peoples reviews and was open minded as some people would complain that the sky is blue!!. However totally agree, it is not a 4 star, no room safes, rooms were shabby and poorly furnished. My sons room the air con did not work, the hotel has a bar which is shut on a sunday because the guy has a day off. Asked for an iron, which we were given along with an ironing board and had to transport them ourselves to our room on the 5th floor, lovely!!", "user": "A TripAdvisor user", "date": "June 28, 2005", "id": 3616892}, {"rating": 4.0, "title": "Great location,great views", "text": "The breakfast room is pleasant with good views over the city, but pot of tea", "user": "A TripAdvisor user", "date": "May 10, 2005", "id": 3457137}, {"rating": 2.0, "title": "Not a 4-star hotel at all!", "text": "arrived with no lid, hardly 4 star material.", "user": "Dagnole", "date": "March 23, 2005", "id": 3296037}, {"rating": 2.0, "title": "Disappointed", "text": "We stayed at this Hotel in September and enjoyed it very much.Yes, it is an old hotel, and as such, tends to be full of nooks and crannies but it does have character.We had an attic room up a tight spiral staircase and it was a bit gloomy but spotlessly clean, had a sitting area and it had a balcony with great views over Rome and of St.Peters in the distance. We thought the hotel was very good value for money, quiet at night and in a very good semi residential area.The location could not be better, if you want a bus they stop outside but we walked everwhere from the Hotel with ease.We have to say that the slog back up via the Spansh Steps after a long day sight seeing was hard work, so we often took the lesser gradient via the Via Vento.The staff at the hotel were courteus and helpful and the breakfasts were good.The views from the breakfast room over Rome, mirrored those from our balcony- fantatsic. You have to take what you pay into consideration when judging a hotel,the Eliseo is a mid price hotel and worth every penny. We would recommend it for its quiet location , freidliness and accesablity to all of Rome's attractions.", "user": "A TripAdvisor user", "date": "February 25, 2005", "id": 3230601}, {"rating": 3.0, "title": "good location, but def. not a 4* hotel", "text": "Great location, but the rooms are very poor (small with a terrible bed!!). A bit dissapointing..", "user": "A TripAdvisor user", "date": "February 11, 2005", "id": 3178832}, {"rating": 1.0, "title": "Definitely not a 4* hotel", "text": "We have just returned from a 2 night stay in the Eliseo Hotel, Rome. We were extremely disappointed with the quality, no way is this a 4* hotel. The hotel requires a COMPLETE overhaul.", "user": "A TripAdvisor user", "date": "February 4, 2005", "id": 3161134}, {"rating": 5.0, "title": "Fantastic! Best location. Best breakfast. Great service.", "text": "This hotel is superb for the price.", "user": "E M", "date": "January 12, 2005", "id": 3003850}, {"rating": 2.0, "title": "Very disappointed", "text": "Great price. $131 for each of our 5 nights. (probably only because we went in January).", "user": "A TripAdvisor user", "date": "October 19, 2004", "id": 2758964}, {"rating": 4.0, "title": "Very Enjoyable Stay", "text": "Great breakfast. Each morning the breakfast room had a great array of fresh food. Servers provide a pot of coffee or tea. A great bar area with very friendly waiter.", "user": "A TripAdvisor user", "date": "October 17, 2004", "id": 2753867}, {"rating": 4.0, "title": "Lovely hotel - will definitely go back!", "text": "My husband and I stayed at this hotel in June 2004 for a week. We found the staff to be extremely friendly and for that reason alone we will be back. The rooms were average sized but comfortable with a nice en-suite bathroom. The breakfast was amazing with everything from fruit, cereal, yoghurts, croissants to cold meats, bread rolls etc and the view was spectacular. You could see Vatican City while you were eating your breakfast! We can highly recommend this hotel and only 5 mins walk from Via Veneto with Cafe de Paris and Hard Rock Cafe! and 10 mins walk to the Spanish Steps. Definitely the best area of Rome to stay in at a good price.", "user": "SableRostron", "date": "October 9, 2004", "id": 2673554}], "location": {}, "stars": 4, "variance": {"poor": 43, "average": 50, "very good": 76, "terrible": 20, "excellent": 28}, "aka": "Eliseo Hotel Rome", "slim_ranking": 0.567716535433, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "Pleasant Old-fashioned Hotel situated in residential Via Veneto district, overlooking Villa Medici & Villa Borghese Gardens."}