{"user_rating": 5.0, "review_count": 67, "name": "Elk Ridge Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "My family (wife, two tweens, and mother) and I stayed at Elk Ridge B&B for three nights in late December 2008 (booked nearly a year ahead of time) at the end of a big winter road trip vacation swinging from the Southwest through the mid-West. I knew the property was basically a rural home residence rather than an inn or lodge, and thus I wasn't expecting much more than standard rural residential-type accommodations, but Ron and Leslie's hospitality really made our stay much more enjoyable than I had been expecting. We had a private entrance, the rooms were clean (and kept clean) and adequately sized, the furnishings solid, the linens fresh, hot water aplenty, satellite TV and WiFi available throughout, home-baked cookies and treats awaiting our arrival each evening, plain and flavored coffees awaiting our arising each morning, and *terrific* country breakfasts. Leslie and Ron were very helpful with pointers to local activities and such, too. We had a good time exploring the local areas and still managed to get some fun shopping done despite how generally commercially dead the area was at that time of the year. My wife and kids had a fun couple of hours at the Journey Museum and we all had a great time visiting Crazy Horse (note: you'll spend a *lot* more time there than you might imagine -- it's a terrific facility) and Rushmore (tip: unless you've really got a disability, don't avoid the Presidential Trail because of the \"strenuous\" warnings -- it's not really that strenuous, and the views are fabulous). We had a decent country dinner the first night at the Slate Creek Grille in Hill City, a mediocre dinner the second night at the Pirate's Table that did not come anywhere close to living up to the praises I had read on Tripadvisor (certainly not worth the one-hour wait we had to withstand New Year's Eve, and wouldn't even have been worth a ten-minute wait, but I guess it counts as a good restaurant for that area given how long it's been open), and a fabulous dinner at Enigma in -- of all places -- the Radisson in Rapid City. Unfortunately, we couldn't try what we heard was the other really good restaurant in Rapid City, the Corn Exchange, since they had no availability at any point during our visit.", "title": "Terrific B&B", "helpfulness": 1, "user": "afrinl", "date": "January 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23264906, "likes": {"liked": "— Terrific hospitality in a comfortable, picturesque, rural setting", "disliked": "— There really wasn't anything to dislike!"}}], "location": {"country": "United States", "city": "Keystone"}, "variance": {"poor": 0, "average": 0, "very good": 7, "terrible": 0, "excellent": 60}, "slim_ranking": 0.25, "description": "Make the award winning Elk Ridge Bed & Breakfast your \"home base\" while visiting the Black Hills of South Dakota. Elk Ridge Bed & Breakfast is less than an hour away from all the spectacular scenic routes and points of interest of western South Dakota. We will sit by the fire ring at the end of the day while you recap your adventures. Three cozy rooms with fluffy bathrobes* queen Sleep Number beds * full breakfast * night time treats * fresh flowers, seating outside of your room * \"concierge\" service are all waiting for you in the \"heart of the Hills\" at Elk Ridge Bed & Breakfast."}