{"user_rating": 4.5, "review_count": 230, "name": "Elvey Farm", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We visited for a meal on our wedding anniversary (have been a coupe of times before), and the meal was lovely. It seemed to us that they had really taken time to choose and source the ingredients, thought about what to put on the menu and made a lot of effort with both the cooking and presentation of the food. We all had steak and it literally melted in the mouth. The home made ice cream was too die for! Would definately visit again (and again....).", "title": "Wonderful idyllic place", "user": "muffin6132", "date": "September 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0}, "id": 176869693}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Have stayed here twice this year- overall we have stayed here 4 times. It's such a warm inviting venue. I'll review the last time we stayed as it's the most recent (although still a late review). We had a room in the stable block- lovely cosy room, and dog friendly too! Love the fact the dogs get treats on arrival too! :).", "title": "Love this hotel!!", "user": "Alexandra P", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175522673}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "A truly wonderful place to spend a night...or two!! Really can't recommend it enough for a special occasion.", "title": "Great Venue, very, very poor restaurant.", "user": "Peter W", "date": "August 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173847887}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Food in the restaurant is always such a high standard- my steak this time was a real highlight, although I have never had a bad meal here. Breakfast is also of a really high standard and the staff are only too happy to help with any question or request!", "title": "Rural Kent hideaway", "helpfulness": 1, "user": "torquaytourist", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173813848}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The accommodation was great, couldn't fault it. The restaurant was really poor. No bread rolls for the soup, we don't do bread rolls, later she told me that she could bring me sliced bread, I think even chip shops have sliced bread. My wife had the Duck and it was so over-cooked that it tasted of liver. I had the Traditional Roast dinner. The potatoes had been cooked at least once before and re-heated just for me, unless some other poor soul was unfortunate enough to order the same. There was no sauce, jus or gravy served with the yorkshire pudding and if I had wanted to scratch the inside of my throat it was certainly crisp enough to do that, without gravy. We didn't want to risk a sweet course.", "title": "Really pretty location just a few niggles!", "helpfulness": 2, "user": "BCJC", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 172816279}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I discovered Elvey Farm through a Google search and have just returned from a 2 night stay there in the Canterbury Suite - and what a good discovery it was! The room was amazing, exceptionally clean and well facilitated (i.e. toiletries, robes, hairdryer, I-pod/radio player and tea/coffee amenities were all provided) and the restaurant on site is the perfect mixture of being very smart yet cosy, excellent service and the food I had for both breakfast and dinner was delightful - all cooked exceptionally well with good presentation. I didn't venture very far in the surrounding area or do walking (it was simply a quiet getaway) plus the weather/winds didn't allow for much exploring, but this didn't detract from the experience there; for the purposes of simply escaping reality and revelling in good surroundings with excellent food, it was perfect and I will go back.", "title": "Lovely hotel in a lovely setting!", "helpfulness": 1, "user": "TheKentTraveller", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182966158}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My new wife and I stayed here for one night mini honeymoon, we stayed in the amazing Canterbury Suite, which the pictures do little justice! It was warm, the bed was luxurious, spotlessly clean and well kept and so inviting. Every detail of the room was perfect!", "title": "Local hiden gem!", "user": "Allan_Norris", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182925336}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The food was fantastic, all locally sourced (even saw the morning deliveries as evidence!), cooked to perfection and the service was just as rewarding, the staff could not do enough to make us at home.", "title": "Fantastic", "user": "Nicola M", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182921882}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The hot tub....wow! Tucked away in a private corner overlooking fields, so peaceful and private! I wish I could just book that for a night at a time!!", "title": "A little bit of heaven", "user": "MalvernHels", "date": "October 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182209034}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "It is a little pricey (£240 for the night), but I have already seen special offers for cancellations. I would return but I have seen similar properties (including private hot tubs) for less. I would knock half a point off for this, but I did love my stay.", "title": "Hidden gem,well worth a visit", "user": "Cangan", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181997042}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband and I booked a night away at Elvey Farm to celebrate our wedding anniversary. From the moment we arrived we were relaxed and felt that we were in our own \"bubble\" away from eveything. We stayed in the spotless four poster room and enjoyed a perfectly cooked meal in the restaurant that evening. A very sound nights sleep was followed by a lovely breakfast the next morning, the whole stay felt like a second honeymoon for us and we will definately be recommending Elvey Farm to our friends and family.", "title": "A wonderful place to celebrate", "helpfulness": 1, "user": "Gemma F", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171916934}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "Booked this to celebrate our 20th wedding anniversary and because they had family rooms and took dogs. Also we are 'foodies'and the menu's looked good. Unfortunately they didn't inform us that it was different on a Sunday! We had a very small menu to choose from, as I didn't fancy fish, that took the choice down to two. I am not keen on chicory, so the only option left was soup-not on a glorious hot summers evening. My husband had the sardines, no I mean sardine for £7.50, and my daughter had the three small langoustine for £ 8.50! The main course options were really only roasts as it was a Sunday menu. The lighting was so dim I couldn't see my chicken breast, three previously cooked roast potatoes then reheated and one spoonful of cabbage. That cost £12.50 and wasn't very tasty. Three scoops of ice cream for £7 and no cheese as it was Sunday! Staff were friendly and I would of left a tip for them, but the owners add in a 'optional service charge' within the middle of the restaurant bill so that initialy you don't notice it- I think it should be discussed when you are settling up. Feel the venue is looking slightly tired and there were fag ends everywhere outside. We didn't let it spoil our weekend but won't go back and won't recommend.", "title": "Not that impressed......", "user": "lpp22", "date": "August 12, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 171909497}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Elvey farm is a characterful set of buildings in beautiful Kent countryside. The staff are friendly and the place has a lot going for it, but we found the restaurant had an underwhelming menu and a noisy clientele – children and adults making a noise. Perhaps we were just unlucky that day.", "title": "Lovely setting but restaurant could be better", "user": "James P", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171751357}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My niece got married here and practically took the place over. Plenty of parking on site. Had a family meal in the restaurant the night beofre. Food was excellent as was the service. Breakfast was okay with a few wrong orders but plenty of food. The ceremony was either outside or inside the building with the couple in the doorway, unusual but it worked. We had afternoon tea in the lovely gardens (with plenty of shade). The wedding was follwed by an excellent BBQ and then dancing from 8 -12midnight. Rooms were spacious and comfortable the Whitsable suite had a lovely bath. If you needed somewhere to pop out to the village of Lehman was well worth a visit. Farm is set back from the main roads so a car is a necessity.", "title": "Great place to hold a wedding", "user": "WestLondonMrBaxter", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169613332}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I had to book three rooms with very little notice and the hotel was most accommodating and helpful. We stayed for three nights and it really is like staying on a farm, only the hotel and rooms are all of the highest standard. The hotel is in the middle of beautiful countryside and drive down the country road to get to it is delightful. There are sheep in the field next to the Oast house and old old tractor in one of the barns. It was really great! The staff were very helpful, the food was excellent and all in all we thouroughly enjoyed our stay. There is wi-fi in the rooms in the main building but not so much in the other rooms. However there is wi-fi in the bar area.", "title": "Lovely hotel in a rural setting", "helpfulness": 1, "user": "vanzanten", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168109649}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We recently spent a couple of days at Elvey Farm. We were visiting Chatham Historic Docks as a birthday treat for my husband and I had wanted a bit somewhere special and off the beaten track to stay. Elvey farm did not disappoint. We had a lovely time there (in spite of a noisy party on the second evening). The staff were so welcoming and considerate and the food was excellent. The accommodation was first rate and I would gladly recommend the farm to anybody looking for an interesting and peaceful place to stay.", "title": "Birthday treat", "user": "JGWMiddlesbrough", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180172622}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We came in late and left at the crack of dawn to get to work in London but it was a lovely 12 hours we spent at Elvey Farm. The service was wonderful and we were looked after perfectly, even being given a packed breakfast to take away with us. The dinner was delicious, if a little rich and they catered for my funny dietry requirements without batting their eyelids. A wonderful retreat that I would thoroughly recommend.", "title": "A quick but lovely stop off at Elvey Farm", "user": "LilpilFraser", "date": "October 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179718155}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Wonderful hotel, rooms and food excellent. Our latest stay was for 2 nights before and after a trip to Europe. The staff were all friendly and helpful at all times. Rooms excellent and the bones left for our Labradors were a nice touch. The restaurant is a lovely place to eat and the food is brilliant. Not the cheapest place to stay but well worth the money.", "title": "We all love this place including our labradors", "user": "Lesley M", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179497833}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I arranged to stay at Elvey Farm for my husbands birthday as a special surprise, and how very special it turned out to be! We stayed at Elvey in the Hawkhurst room back when we got married, but this time I decided to go the whole hog and have the Canterbury suite! We had an amazing dinner in the restaurant and all staff managed to keep the secret going for the evening until I told him we wouldn't be going home but in fact staying! We had a fantastic time in the Hot tub and after returned to the room where we were treated to double shower, super king bed (super comfortable) double ended bath, beautiful decor, double sinks, chaise lounge.... It was truly luxurious! The following morning I woke early not wanting to waste any time sleeping and woke my husband to get him back in the hot tub! We wanted to get the benefit of the view in the daylight. I drove home (5 mins away) and picked up our daughter from nannies! We then went back to all hop into the hot tub! Then, breakfast back in the restaurant, where staff couldn't have been more hospitable with our little addition! All round a truly fantastic evening, night and morning had by all. Can't wait to plan our next trip there! Thank you to.all the lovely staff who made it what it was!", "title": "Worth every penny!", "user": "Kelli N", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179449076}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Checked in with owner Simon at reception, who showed us to our room. As it was our 20th Wedding Anniversary, we treated ourselves to a stay in the wonderful Canterbury Suite!", "title": "What's Not To Love!", "user": "Feline_Fan_9", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 176981531}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 5, "average": 17, "very good": 39, "terrible": 4, "excellent": 165}, "aka": "Elvey Farm Hotel Pluckley", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}