{"user_rating": 3.5, "review_count": 397, "name": "Elysian Beach Resort", "reviews": [{"rating": 1.0, "title": "Rude and Dishonest", "text": "We encountered the same long delays and rudeness on check-in that others have mentioned. The advertised 3pm check-in does not apply to guests, only to time-share owners. For guests it's 4pm, but you won't find this posted anywhere. The front desk staff could hardly be more rude, in every dealing we had or observed others having. The pricing is simply dishonest. They charged a 12% room tax. A sign on the check-in desk said the room tax is 10%. In fact, St Thomas officials confirm that the room tax rate is 8%. Then there is the energy surcharge. This was not mentioned at all in our reservation or anywhere else we've found. The surcharge was 18% of the daily room rate. We were told this was a regular tax. It is not. Neither WAPA (the electric utility) nor the government charges any surcharge. Some other hotels charge $1 - $4 per day per room for increased energy costs, but the 18% charge is not found elesewhere. In our case this amounted to $25.74 per day above the room rate. This is nothing less than a trick to charge a higher room rate than quoted by the hotel or the agent. The overcharge on tax was refunded after protest to Wyndham, the parent of Fairfield Resorts, but only after their effort at another lie, to the effect that the room tax charged by the government changed between our reservation date and the date of our stay, which was completely untrue. Wyndham stood by their 18% energy surcharge, which by the way, bears no economic relationship to actual energy costs as far as my investigations reveal.", "helpfulness": 5, "user": "VIFriend", "date": "April 2, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 7271475, "likes": {"liked": "— proximity to Red Hook", "disliked": "— rudeness and dishonesty"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "As to the resort itself, it is well located and generally pleasant, although not well maintained. We observed leaks, faulty appliances, poor hygeine, and a general unwillingness to respond to requests for service.", "title": "Don't do it.", "helpfulness": 6, "user": "Falcon_Driver", "date": "March 22, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 7201714, "likes": {"liked": "— It had a roof and four walls", "disliked": "— It was dirty, service was bad"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We have many years of experience visiting the USVI and know it well, including the cultural style and standards of courtesy. The poor management and deceit encountered at this resort is in no way typical of Virgin Islands society. It comes from somewhere in upper management and passes down through the organization.", "title": "Horrible experience, watch out for bed bugs!", "helpfulness": 3, "user": "jchang77", "date": "March 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 7191009, "likes": {"liked": "— nothing", "disliked": "— bed bugs!"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My job as a corporate pilot takes me to many hotels within a year, but never again this one. I've stayed at many hotels on St. Thomas and throughout the Caribbean in the past few years and know what to expect in this part of the world, having no unrealistic expectations.", "title": "If you like bug bites....", "helpfulness": 2, "user": "ptravlorkra", "date": "February 5, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6748739}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "We arrived at about 9:00 PM and the front desk staff seemed to have a hard time finding rooms to put us in, despite the fact we had confimation numbers for that date. After finding our way to our rooms (it's not easy to navigate this property at night, not many markings and lots of buildings), I found that there were no pillows in the room at all. I called and was told they would deliver some. About 2 hours later, I still had no pillows and called again. This time they were delivered within about 20 minutes by a rude bellman. The other pilot that I was traveling with was given a room with just a pullout sofa for the bed, despite the fact that we had confimation of two King non-smoking rooms. In addition, he also lacked pillows in his room.", "title": "Relaxing Vacation", "helpfulness": 9, "user": "darlteach", "date": "January 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6606981, "likes": {"liked": "— Location and view", "disliked": "— check-in staff was rude"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We traded a time-share for the Elysian and we had a great time. We had a studio in building F 224 with a beautiful view of Cowpet Bay. Our studio included a large living area with a murphy bed that we loved. We called it the 007 bed. The studio had a full kitchen with plenty of utensils and pots and pans, toaster, coffee maker, a bag of ice in the freezer and even a dishwasher. There was a bar and stools, a dining table and a patio with table and chairs and a lounger.", "title": "Loved The Elysian Resort", "helpfulness": 4, "user": "jonnie", "date": "June 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7872778, "likes": {"liked": "— location"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The lobby personnel were very helpful and friendly and were a wealth of information that helped our vacation run smoothly. We found all the resort personnel to be very friendly and welcoming. A smile and respect will open many doors. Taxi drivers, Joe and Miss Claudia, were very helpful and friendly. Both are careful and safe drivers. Taxi service is expensive but then you get to sit back and enjoy the beautiful scenery and leave the driving to someone who knows how to drive the winding hills. Cingular phone service was very good so we used our phones whenever we needed a taxi ride.", "title": "Acceptable but not outstanding", "helpfulness": 2, "user": "Belsman", "date": "June 9, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7809593, "likes": {"liked": "— The view from the room patio", "disliked": "— The rudeness of 2/3 of the front desk staff"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Beach towels were available whenever we needed new ones.", "title": "Loved Saint Thomas but not this resort", "helpfulness": 2, "user": "isletime", "date": "May 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7721262, "likes": {"liked": "— location", "disliked": "— resort needs repairs, paint and updates"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "Robert's Grille was very good and island reasonable. Page's Painkiller was the best compared to any of the others I sampled.", "title": "Can't wait to go back!", "helpfulness": 3, "user": "krisad", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7686385, "likes": {"liked": "— Beautiful Resort", "disliked": "— Getting in and out of the Airport was the only problem - plan on 2 hours prior to departing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The Elysian has shuttles available (and reasonable) to downtown and to Magen's Bay (also a St. John day trip). We took advantage of the Magen's Bay shuttle and fell in love with the beach.", "title": "Great Vacation! Will Absolutely Return!!", "helpfulness": 5, "user": "travelgrl1122", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7657348, "likes": {"liked": "— Friendly people, great pool and beach area, lots to do!!", "disliked": "— you can't walk into town"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "When we arrived promptly at 4:00 for check-in, our rooms were not ready and the 2 women at the desk didn't seem to think it was a big deal. We waited around the very small lobby for about an hour before we could get a room key. Once in the room, we found the kitchen to be broken down...the drawer front had fallen off and never repaired. We could find no silverware in the dirty kitchen. Oh yea, I bought cleaning supplies to use before I could use the kitchen. We called 2 days in a row before we finally got someone to bring some forks and spoons. There is barely enough room for 1 at the bathroom sink so it is not easy for a couple to get ready at the same time. The so called ocean view is a tiny spec of water you can see if you really try from the edge of our balcony. I didn't realize that we would have a murphy bed to sleep on but there was not enough room for a real bed. The beach is small and not very nice. There are no jet skis or anything to rent at the beach. Although we were not allowed to check in on time, there were nocking at my door at 9:50 to see if we were gone yet when check out is at 10:00 am. The only good thing was the restaurant, Roberts, which had the best lobster I have ever had. It was not cheap, but really good. Dinner is certainly better than breakfast. The pancakes were not good at all. This is the worst Fairfield/Wyndham property I have ever seen and I will definitely not go back.", "title": "Won't stay there again!!", "user": "1TexasMomof3", "date": "May 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 7657202, "likes": {"liked": "— Robert's restaurant", "disliked": "— just about everything including the rude staff"}}, {"rating": 1.0, "title": "What a lousy place.", "text": "The place was dark and dreary. The beach was dirty. There was only one restaurant - the other was closed. We requested a king bed and instead received two double beds. The service was unbelievably awful. I can not belief that we used our timeshare points for this dump. I would never again encourage anyone to purchase a timeshare with Fairfield (now Wyndham).", "helpfulness": 1, "user": "PaBarb", "date": "May 15, 2007", "id": 7628146}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is the place to go in St Thomas! The front desk folks will be curt with you if you don't open with a pleasant \"Good Morning\" or Good day\" and a smile. They are islanders. It is a cultural thing.", "title": "Loved it!", "helpfulness": 3, "user": "solesol", "date": "May 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7580306, "likes": {"liked": "— Natural setting, seculsion, beautiful area", "disliked": "— front desk folks, but you only see them 2 times."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "What a beautiful resort. We've been there a few times now and know to get a unit near the bottom of the hill. View are better there and your walk to the amenities is short. We got a loft unit with a full kitchen and a roof-top patio that was enormous!!! Try to get one of these - no doubt the best setup there!!!", "title": "Not a Satisfied customer", "user": "vacation70", "date": "April 25, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 7434926, "likes": {"liked": "— The pool area", "disliked": "— the stair climbing and the pesty bugs."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "The grounds are beautiful and we relaxed so much there and on the beach. Never would guess, but there's some pretty good snorkeling to the left off the beach.", "title": "A bit disappointed", "helpfulness": 1, "user": "nminotti", "date": "April 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7394683, "likes": {"liked": "— Great private beach", "disliked": "— Lack of cleanliness and mediocre staff"}}, {"rating": 4.0, "title": "Beautiful Resort - but need to watch your $$", "text": "Just returned from a trip to the Elysian Resort, I was pleased with the room which included a frig, microwave and coffeemaker, this was in a hotel unit. Be prepared to pack some coffee along with anything useful you can refrigerate. I would suggest going to the Marina Market in Red Hook upon arrival to pick up a few things. The restaurant at the beach side called Bonnies is decent, but still expensive. You need to watch the wait staff, I was charged one morning $4 for a glass of milk by a waitress, but was refunded the money once I talked to the manager about the price later in the day. The waitress was ripping me off with a straight face. The other thing is to be aware that if you do not have a car, you should consider renting a car one for more thant 2 people, the cost to take a taxi one mile into Red Hook is $5 per person so round trip just to go to the market would be $10 per person. I did find out if you want to go into downtown that would be a $30 roundtrip cost. I would suggest that you make it to the main road at the end of the hll, which is a good walk and dangerous beause of the roads, and the public bus is a $1 and the safari taxi is $2....no one at the Elysian told me of optional transportion. Also Jamie who is the excursion coordiantor is very rude, she has an attitude, so beware of booking trips with her, she over ephasizes the trips, like all you can eat etc....and they are far from that on the day trips. I took the Breakaway day trip to the BVI which was highly recommened cost $108 and did not include a meal, the drinks were passed around in sippy cups that were recylced and the snorkle masks did not seem santiized. I had a sore throat the next day after drinking out of one of these cups. The day trip was suppose to last until 5pm and we arrived at 4pm the 7 - 5pm turned into 8 - 4 and was not worth the $108 after buying your own lunch figure costs aprrox $135 for the day. Overall you will like the resort, very clean and well taken care of, the room cleaning service is only on Wednesdays one day per week, if you choose for maid service its an addtional charge, also they have a surcharge of $9 pp per night for electricity....so plan on additonal costs if you are there with a timeshare trade.", "helpfulness": 8, "user": "francesE", "date": "January 2, 2007", "id": 6540541}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We just came back from St.Thomas. We stayed at the Elysian and had a wonderful time. The staff was friendly and every time we called the front desk they helped us right away. The beach was awesome and so was the pool. We ate at both Bonnies and Roberts and the food was incredible!! Too bad we had to come home...oh well.", "title": "loved the elysian", "helpfulness": 5, "user": "carolannmag", "date": "October 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6020725, "likes": {"liked": "— beach", "disliked": "— the hill!"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "The property appears to be a condo/timeshare that also serves as a hotel when owners are not visiting. We stayed there for three nights; while the room we eventually got was itself nice, the service at the front desk was terrible. We called the hotel's U.S. booking office directly to reserve an ocean view room, and when we arrived at the property itself, it was not at all what we had booked. The front desk staff also had a terrible attitude, and it took more than an hour just to check in. St. Thomas is definitely worth visiting but this hotel can easily dimish the overall experience.", "title": "Seconding the recommendations to stay elsewhere", "helpfulness": 9, "user": "CarribeanTraveller", "date": "September 18, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 5814368, "likes": {"liked": "— Room was clean", "disliked": "— Front desk staff were among the worst I've ever encountered."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Wow, what a surprise after having stayed at 5 other Fairfield properties and expecting the usual 5-Star quality - The Elysian is NO WHERE near that! I was prepared for the rude front staff (I thought), and so went in with my goal to be nice, and polite...well, after waiting over 2 hours (!!) to get our room (even though EVERY other person who arrived AFTER us got their rooms), I decided to get the attention of the staff...they still could have cared less. This behavior didn't change at all the entire week - rude, unwilling to help, no eye contact...simply the worst customer service I've ever seen. I had also requested a room close to the beach and without many steps due to my husband's heart condition - and we were assigned Building W - the farthest from the beach! If we hadn't had a car we would have never been able to go there! So we drove to the beach every day - what a waste of gas! The rooms were fair - roomy enough - but the Murphy bed in the middle of our living room was a surprise. I couldn't easily lie down and rest in the middle of the day without pulling it out. Oh, and for you Fairfield guests who are used to in-room washer/dryers...NOPE - it'll cost you $7.00 to do a load of laundry in the resort laundry room!!! Housekeeping was terrible - their idea of a mid-week clean up was to take my soiled washcloths and spread them out over the side of the bathtub! No clean ones mind you!", "title": "Definitely Not 5 Star!!!", "helpfulness": 7, "user": "txstransplant", "date": "August 21, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 5689056, "likes": {"liked": "— beach", "disliked": "— all staff"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The beach was great - quiet and clean and the water was awesome. I highly recommend the sailing trips on New Horizons - worth the entire trip !!!! We also enjoyed dinner at \"Off the Hook\" in Red Hook (expensive but worth it) and \"Glady's\" in Charlotte Amalie....otherwise the restaurants were expensive and only so-so on quality - we bought at the grocery and ate in a lot.", "title": "Very Nice Vacation", "helpfulness": 6, "user": "knt", "date": "August 10, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 5597472, "likes": {"liked": "— beach", "disliked": "— No beach towels at the pool, you have to check them out in the lobby"}}], "location": {"country": "Caribbean"}, "stars": 2.5, "variance": {"poor": 45, "average": 72, "very good": 178, "terrible": 34, "excellent": 68}, "aka": "Elysian Beach Hotel East End", "slim_ranking": 0.2}