{"user_rating": 3.5, "review_count": 324, "name": "Embassy Suites Phoenix Airport at 24th Street", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Ever had such good service you just couldn't wait to leave a good tip? That's exactly what happened here.", "title": "Our stay just kept getting better each day", "user": "dbcme", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125323513}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Background: Long weekend adventure in PHX. This hotel was close to the airport and freeways. Booked at highly discounted rate on third party site.", "title": "Great Place to Stay", "user": "Debbie A", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125290281}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Rooms: All suites, including a kitchen area, and large bedroom. Very comfortable beds. Standard toiletries. Ceiling in our room had some water stains, and walls were a wee bit aged, but nothing to crazy. Good water pressure in bathrooms. Coffee, tea, refrigerator. All good.", "title": "Awesome Service!", "user": "A R", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 125245616}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "During our stay we encountered staff who smiled, made small talk and were overall friendly. Housekeeping was also friendly. They had a sign offering complimentary toiletries for anything we may have forgotten,", "title": "Best Customer Service", "user": "Aaron L", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125163949}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Breakfast was amazing. Made-to-order breakfast. The cook worked by himself, but was fast and efficient. Making omelets and hot cakes. He was friendly and fun, even with many people anxiously waiting for their orders. This guy was amazing! In addition to the hot stuff, plenty of cold foods (fruits, pastries and more) were available.", "title": "Ehh.", "user": "PamL0vesT0Travel", "date": "February 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 125148961}, {"rating": 2.0, "title": "No wifi!", "text": "Only one point here matters as a warning to business travelers. This hotel does not have wifi. For real. You have to plug in to Ethernet and then pay. It has less connectivity than hotels in third world countries 10 years ago. When I expressed shock at front desk I was told \"we've never had it\".", "user": "rsp1", "date": "April 23, 2012", "id": 128399579}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "looking for basic place to stay, we had early flight out the next day. $51 plus tax on priceline for a wednesday night. neighborhood just ok. because of this, we werent real excited about going out anywhere for dinner. the check in was a bit slow. directions to room not the best. lay out of place is different than any Ive been to, so maybe its on me. room was nice, clean, beds comfortable.", "title": "price was right.", "helpfulness": 1, "user": "apackerfan", "date": "April 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 128203164}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "turned out we were next to exercise facilities on 3rd floor. room 303. lots of clunking in middle of the night, either that or maybe laundry is located in same area as well.", "title": "Much better than expected", "helpfulness": 1, "user": "JKNY329_10", "date": "April 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127494915}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "pool looked inviting. they said it was heated so we checked out. if it was heated, it was to about 70. we lasted 2 minutes. others said you can get used to it. jacuzzi was only half full of water.", "title": "Business Trip in Phoenix", "helpfulness": 1, "user": "travelin4funfools", "date": "April 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 127131197}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "they had happy hour with appetizers on 5th floor restaurant. we did that for dinner. the guy and gal working up there went all out. Ive never seen two people try harder to please their customers. It was impressive. It was also disturbing to see people getting free food and drink and can not even leave a 1 dollar tip.", "title": "First class customer service", "user": "bigdog33", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126939020}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "And with teenagers it is nice to have the adjoining family room with pull out couch and tv. The pool looked nice. The happy hour with free cocktails and appetizers was nice. The shuttle drove us to a great mexican restaurant out of his normal range, but happily accommodated us. I would stay again nighr before or after a flight.", "title": "Older Embassy Suites, but convenient, nice inside, staff is friendly", "user": "skidownbrown", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 126878074}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Do not let any of the negative reviews affect your decision to stay here......just know up front what you are getting.....which is an updated, clean 2 room suite, breaksfast just like the ES with the fancy atriums, and an enjoyable Manager's Reception! This hotel reminds me a lot of the NICER hotels along Myrtle Beach......with the beautiful pool and courtyard area in the middle. You would never know you were in the middle of Phoenix! This hotel is very convenient to the airport and car rental return and just a short drive to the Biltmore Shops and other areas of Phoenix like Camelback mountain. Service is great, staff is friendly and accomodating....we will be back!", "title": "Would stay here again in a heartbeat!", "user": "IUgrad1975", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126763117}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I attended a small conference which was hosted at this hotel. I got picked up at the airport by the free hotel shuttle which arrived within 10 minutes after I called the front desk. The shuttle driver gave the passengers a detailed explanation of all the services offered at the hotel during our ride there. Was able to check into my room early by 9.30 am and they offered me to enjoy their wonderful breakfast right after my arrival. My guest room was clean, well equipped, spacious, with a separate living room, two flat screen TVs and a small kitchen. Every morning the current edition of US Today was hanging outside my door for me to enjoy.", "title": "Great Hotel!", "helpfulness": 1, "user": "Jacko1974", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126635158}, {"rating": 4.0, "title": "Older with motel like outdoor corriders", "text": "The hotel building surrounds a centrally located pool area that is accessible until midnight. Free pool towels are provided, and there are plenty of reclining chairs and umbrellas to relax. The only small downside is that parts of the pool area are always in the shade due to the hotel building around it.", "user": "familyfromphilly10", "date": "March 20, 2012", "id": 126399260}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The best part about the hotel is the generous breakfast which includes - among other things - cooked-to-order omelettes, sausage, bacon, fried potatos, coffee and tea, various fruit juices, joghurts, fresh fruit, various breads, muffins, bagels, etc. Everything is \"all you can eat\". The other great thing is the nightly 2-hour \"happy hour\" at the rooftop bar during which they serve snacks and unlimited free beer, wine and well drinks to all hotel guest. This event happens EVERY night, and needless to say it keeps the bar pretty crowded and entertaining.", "title": "Home Away from Home", "user": "TEH3", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126095934}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I changed hotels halfway through a 2-week stay in Arizona, after being disappointed by the first one. When I arrived at this hotel the location and exterior did not impress. It just looked iffy. Fortunately I went inside. It was a great place to stay, with a nice courtyard in the interior, a wonderful bar/dining area on the 5th floor, plenty of parking, and great staff. I'd definitely stay here again.", "title": "Don't judge a book by it's cover", "user": "notamac", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 125909072}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Stayed in this hotel and all i can say is wow. its not just the hotel itself but the staff. the front desk are very kind, polite and helpful, tyler, amanda, BB, rick are a few of the names that stick with me and the cook at breakfast is such a nice guy who puts in 110% effort into his work as well as the bar staff in the squaw peek cafe on site. The cleaners around the hotel are very good and always say hi as you walk by. But the thing that tells you that you are about to have a good experience before you even arrive are the drivers from the airport Joe and especially Jonny D. These guys make you feel at ease can liven up a shuttle ride from the airport even after a 10 hour flight. I would recommend this hotel above all others i have stayed in around the world, and that is alot of nice hotels i assure you, because of the people at this hotel. Try it you see what i mean", "title": "what a place to stay", "user": "andy g", "date": "March 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125834993}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Andy g", "title": "Bartender for the Manager's reception was awesome!", "user": "srmmurfreesboro", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 125766947}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We stayed on a Saturday night before we flew back home on Sunday so we were in and out but felt the service in the Manager's reception area and breakfast was great!", "title": "One of the original Embassy suites", "helpfulness": 1, "user": "MyZenworks", "date": "March 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 125462753}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "This Hilton property is one of the original Embassy Suites in the chain.", "title": "Past It's Prime", "user": "IMFLYBOY", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 125428748}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 56, "average": 67, "very good": 72, "terrible": 40, "excellent": 89}, "aka": "Embassy Suites Phoenix Airport At 24th Street Hotel Phoenix", "slim_ranking": 0.497175141243, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 3.5}, "description": "Located only two and half miles from the Phoenix Sky Harbor International Airport and only two miles from Downtown Phoenix and the prestigious Biltmore Fashion Park. All of our Phoenix Airport hotel guests can take advantage of our 24-hour complimentary shuttle service to and from Phoenix Sky Harbor International Airport (PHX)."}