{"user_rating": 4.0, "review_count": 325, "name": "Embassy Suites Hotel Phoenix Biltmore", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "I am currently staying at the Embassy Suites -Phoenix Biltmore. The hotel is better than anticipated. The rooms are very large - much larger than most Embassy Suites. The atrium is lovely with a stream and goldfish.", "title": "Very Nice Hotel !", "user": "pdjcfo", "date": "March 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14107342, "likes": {"liked": "— Large rooms", "disliked": "— The valet parking"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The morning breakfast is fresh and quick and the evening reception is nice as well.", "title": "A great hotel with few problems", "user": "OftenContentFlyer", "date": "March 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 13997592, "likes": {"liked": "— Great rooms", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The rooms have been recently updated; however, the meeting rooms could use some updating.", "title": "Great Breakfast", "helpfulness": 1, "user": "skinanny", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13097138, "likes": {"liked": "— space, and great breakfast", "disliked": "— decor"}}, {"rating": 4.0, "title": "Embassy Suites Rock!", "text": "My only complaint involves the parking. Returning to the hotel on my first day, the parking lot was full with the exception of many spots reserved for the valet. Now, there is no need to use a valet since the spots are so close, but unless I wanted to park around the back of the hotel by the dumpster, I had to use the valet. so I will have $6 per day added to my bill to walk just a few less feet than I would have had I been able to self-park AND I had to seek out a valet to park my car.", "helpfulness": 1, "user": "MsMaryMack", "date": "January 14, 2008", "id": 12620649}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "I would stay here again since it is a great location and a reasonable price during high season.", "title": "Great hotel", "user": "Carol1027", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10044656, "likes": {"liked": "— The friendly atmosphere", "disliked": "— The cold pool"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Great Hotel. I was there with my kids ages 13 and 11 and we had a wonderful stay. The pool is very large ranging in depth from 3 feet to 8 feet and there is also a hottub. They serve a free cooked to order breakfast each morning and have free drinks and light happy hour type food in the evening. Our room could have used a little updating but it was very large, clean, and had two TV's with plenty of channels, pay per view and Nintendo. The hotel employees were very courteous and helpful. The lobby is decorated with many plants and also has a little river filled with huge Japanese fish. There is also a computer set up with free internet access in the lobby. The only word of caution is that they do not use chlorine in the pool as most do. Instead it is a salt water type treatment that while safer and less irritating gives the water a salty taste.", "title": "Great Hotel... Especially if you have kids", "helpfulness": 3, "user": "Boscokramer", "date": "August 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8443739, "likes": {"liked": "— Pool, free breakfast.", "disliked": "— Nothing significant."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "My family (wife, two tweens, and mother) stayed at the Biltmore Embassy Suites in Phoenix for two nights in December 2008 at the beginning of a big winter road trip vacation swinging from the Southwest through the mid-West. In general, it was a standard Embassy Suites experience -- that is to say, a fairly good experience -- with the exception of the air-handling problem mentioned in the previous review. It seems the hotel's entire air-handling system is switched either to cooling or heating (which in itself is not odd), but if the hotel's system is set one way, you cannot achieve the opposite effect in your room no matter how you set the room's thermostat. Thus, we found our rooms uncomfortably warm but could cool them only by opening the sliding glass doors to the outside. Otherwise, it was a good stay. The front desk staff and breakfast staff were pleasant and helpful, and the breakfasts were quite tasty and filling.", "title": "Typical, fairly good Embassy Suites experience", "user": "afrinl", "date": "January 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 23260336, "likes": {"liked": "— Good breakfasts, good amount of space per room", "disliked": "— Inflexible air-handling system"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Stayed at this hotel while in town for SHPE{ society of hispanic professional engineers}.great location,next to a great mall with several restaurants nearby. Clean and well kept. 2 mildly annoying problems. The air sytem in the hotel is either off or on.At the time we stayed there it was off. Unless you opened the sliding door you had no air circulating in your room. We were on the top floor so we did just that, but for those on the ground floor that wasn't an option as that would be unsafe. I prefer that the rooms have individual control,again a minor thing. The front desk had no knowledge of other places in the immediate area for shopping, spa services etc. I think that this is something that could be easily remedied. Over all it was a pleasant stay.", "title": "nice chain hotel", "helpfulness": 1, "user": "Simplycuban", "date": "November 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 22029955, "likes": {"liked": "— cleanliness,size of rooms,happy hour,free breakfast", "disliked": "— no individual control of air"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Upon arrival of the hotel we were greeted by very happy desk clerks. My son had picked us up at the airport, we flew in from Fresno Ca., and he had his two children with him. My daughter was with us and she had her child with her also. Before we were checked in, the doorman had taken my grandchildren, with permission , to get fish food to feed the Koi in the pond at the Atrium. They loved it. That was very nice. We went to our room, third floor , in a glass elevator...loved the view of the Atrium and the Koi pond. Beautiful decor. Large painted mural on the wall. Our room was ready, the hotel let us have an early check in, very nice. the room was clean, big pillow top bed. some noise from the air-conditioner and the channels on the TV were fuzzy. But the view of the pool was great. Coffee maker, coffee, sugar , creamer, tea all waiting. A bottle of water too...for $4.00, but it was a big bottle. Lots of clean towels. We went downstairs for the morning complimentary breakfast..wow...it was fantastic. Best I've ever seen. made to order and everything you could ask for. Fruit, muffins, bagels, yogurt, plenty of anything you could want. We ate our breakfast in the Atrium watching the Koi in the pond...a turtle or two swam by . I loved it. Later on , the desk clerks told us we could invite our family to come over and swim in the pool...as we did, and all had a blast. Plenty of clean towels there too. And a jacuzzi. I would recommend this hotel and will stay there again. The people working at this hotel were all very nice.", "title": "Pleasant stay", "helpfulness": 1, "user": "blondegal57", "date": "August 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18951302, "likes": {"liked": "— the breakfast in the atrium looking at the koi pond", "disliked": "— noisy air conditioner"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I recently stayed at the Embassy Suite Biltmore for 6 nights and was pleasantly surprised! I had come to expect large rooms and little service from the brand, but this was not the case; Bellman, knowledgeable front desk staff, a decent gym, and a nice pool were all perks. The free cocktail hour was a nice touch and as long as you’re not expecting the Ritz, this place has it all. I was there with about 15 colleagues for an event, and while a few of them complained about some maintenance issues, no one felt that the issues went unresolved. We all work with and stay in hotels for a living, and felt safe, well taken car of, and in fact, took the opportunity to relax and the bar and pool at the end of our long days (usually we shower and go to bed).", "title": "Perfect for what we needed", "helpfulness": 2, "user": "NewYorkTravelCoord", "date": "June 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 16577377, "likes": {"liked": "— Rooms and Free Drinks / Free Breakfast", "disliked": "— Room was almost too big for just me!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The made to order breakfast counter was nice (though a little confusing – no wait staff and food wraps around a corner), but was tasty and a nice place for everyone to meet in the morning.", "title": "Great hotel for toddlers and children", "helpfulness": 1, "user": "specialseahawk", "date": "April 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14927284, "likes": {"liked": "— Atmosphere/Koi Pond", "disliked": "— Business/Computer Services"}}, {"rating": 2.0, "title": "We liked it", "text": "The front desk staff of this hotel is excellent and it definitely made a difference in our decision to stay there. We called, lost, and the front desk person very patiently gave us directions TWICE. When we arrived, she continued to be pleasant and welcoming. We really liked the manager's reception and breakfast and would stay again for that reason alone. The pool, while chilly and a bit noisy, was fun and relaxing. Our room was large and updated although the balcony screen door was broken which was too bad considering the fabulous weather (80-90 degrees with no humidity). The upscale shopping area across the street is also a plus. Overall, we had a nice stay.", "helpfulness": 1, "user": "travelingissofun", "date": "April 4, 2008", "id": 14799616}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "My husband and I stayed at The Embassy Suites Biltmore the week after Easter and had a wonderful time. We were in Phoenix as my husband was attending a business convention held in downtown Phoenix. This hotel is a little ways out of downtown but the routes are simple and only took 15-20 minutes to reach the convention area and attractions of downtown Phoenix. Found the location close to everything the Phoenix area has to offer. The rooms we clean, spacious, comfortable and quiet. The evening happy hour,5:30PM-7:30PM was great. Appetizers and drinks were enough for a meal and changed nightly. Had to be careful not to enjoy too much if was going out to dinner. The first of the week there were families with lots of children that seemed to be feeding them their evning meal at the free appetizer buffet.The pool was nice, good sized and inviting. The wirlpool was also a nice touch. The staff was friendly and accomodating. The only problem while we were there was that the elavators were being worked on and usually there were only 3 of the five running on any given day. On the whole we enjoyed our stay and would return to this hotel.", "title": "Nice Hotel; Good Location", "helpfulness": 1, "user": "pulpoeater", "date": "April 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14765447, "likes": {"liked": "— Nice room, close to a lot of activities", "disliked": "— Elavators not all runing at once"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We just stopped in for the night on the way home from the Grand Canyon. The hotel has a lovely interior design and is very refreshing to come into from the hustle and bustle of the outside.", "title": "A Very Nice Overnight Stay for the Family", "user": "OperaFan", "date": "April 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 14714035, "likes": {"liked": "— Spacious Room (we have 3 kids and an infant) with 3 sinks", "disliked": "— None"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We were travelling with 3 children and a 1-year old and it's difficult to find a high-quality hotel that can accomodate all of us without breaking the bank.", "title": "Pool was freezing cold, leaves floating on top, broken patio doors...", "helpfulness": 2, "user": "pbdOhio", "date": "March 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 3.0, "rooms": 4.0, "location": 3.0}, "id": 14643825, "likes": {"liked": "— very clean and roomy rooms", "disliked": "— pool"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "As the previous reviewer noted, the pool doesn't seem to be heated, so it may be warm and comfortable while the sun is out, it becomes chilly when the sun goes down. However, it makes a nice contrast when used in combination with the hot tub. The kids loved it.", "title": "Good Location Adequate Hotel", "helpfulness": 1, "user": "TravelBoulder", "date": "March 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 14173947, "likes": {"liked": "— Location", "disliked": "— Staff seemed poorly trained regarding recommendations in neighborhood"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 19, "average": 57, "very good": 108, "terrible": 10, "excellent": 131}, "aka": "Embassy Suites Phoenix", "slim_ranking": 0.282485875706}