{"user_rating": 3.5, "review_count": 337, "name": "Embassy Suites Hotel Syracuse", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I've stayed at this hotel at least 4 or 5 times in 2009. The managers cocktail hour in the evening is a nice added touch. The hotel staff is friendly and the rooms adequate. It's nice that they have decent flat screen TVs in both the bedroom and the living room area of the suite. The breakfast in the AM is good w/ eggs cooked to order and you can't beat having free Starbucks coffee on site. I have used the fitness center a few times and it's modern and convenient. Finally the restaurant food isn't anything special, but the lounge is decent.", "title": "Nice Place for Business Trip", "user": "mainetoday", "date": "January 18, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 53805785}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "All in all, great for business travelers.", "title": "Nice Hotel - Great Value", "user": "cab1002", "date": "December 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51740304}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "This hotel is the only place that I will stay in when in Syracuse. All rooms are truly suites. Separate living room area, wet bar, pull out couch, free internet. During the week there is a managers reception with free drinks and snacks. The next morning there is a free breakfast. The courtyard lobby is beautiful. The restaurant on site is average, but good enough for a quick dinner if you don't feel like going out.", "title": "Very nice hotel", "user": "Mindy_Nicole", "date": "December 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 50821939}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I stayed at this hotel once last month, last week and will stay again this week. I have had no problems at all. The rooms are nice and clean, staff is friendly, fitness room has great equipment, etc. I stayed here for a conference in the hotel and they provided the food which is fabulous as well. I also ate in the hotel restaurant and their food is very good. I would definitely recommend staying here but I know their regular prices are quite expensive. I received a big discount for staying here because the conference was held there.", "title": "Fawlty Towers West", "user": "NoYahoo", "date": "November 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 50358661}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Anything that could go wrong did. At check-in the receiptionist was yacking on the phone. She then gave us two cards and room number. We went up in the elevator. The cards didn't work. The building engineer spotted us, came up and said that the suite hadn't been cleaned and to go back down to the desk and get another one.", "title": "No emergency exit plan", "user": "Adir0ndack", "date": "November 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 48942229}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Stayed here for one night en route to vacation in Canada. My wife & I and four kids. Both the service, facilities and food were exceptional and exceeded our already high expectations for the Hilton family of hotels.", "title": "Terrific hotel; expectations exceed", "user": "Miusa", "date": "February 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25082793}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The staff at check in was helpful and pleasant,", "title": "Cruddy and Not up to Hilton Standards", "user": "ComputerGuy_9", "date": "February 21, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 24897202}, {"rating": 4.0, "title": "We had a Great time!", "text": "The free breakfast was outstanding and the staff again pleasant and helpful. At some hotels we eat out because of the limited offerings, limited quantities and poor quality of the food.", "user": "GOSUNy", "date": "February 2, 2009", "id": 24098251}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The facilities, both the room quality and the public areas were very well maintained. We enjoyed using the pool and the hotel had a staff member available to supervise the pool activities and prevented some unruly guests from ruining the experience for everyone else.", "title": "Not our best Hilton stay", "user": "4kidstolove", "date": "February 1, 2009", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 24067242, "likes": {"liked": "— Great beds and breakfast", "disliked": "— Filthy carpet"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "Terrific hotel I recommend it highly.", "title": "Avoid this hotel if you want TV", "user": "KevinBacon69", "date": "December 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 22455963, "likes": {"liked": "— room size", "disliked": "— front desk staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed during a SU parents weekend. Once we found our way, it was an easy trip back and forth to campus. Due to rain we spent more time in the room than we had intended! Big TV's were great for watching college football games, so not a total washout! Nice manager's happy hour with complimentary beer/wine and snacks. Setting for breakfast is lovely with lots of choices including cooked to order omelets. Rooms were a bit tired (stained carpets, worn bathroom tile etc.) but the comfortable beds more than made up for this. If you are bothered by highway noise, suggest you request the side of the building not facing the traffic - overnights were not a problem, but I could hear the traffic picking up in the morning. Would definately stay here when we go back to visit.", "title": "Comfortable King Bed", "user": "Sassy77Cat", "date": "November 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48363273}, {"rating": 3.0, "stay_parameters": "Stayed November 2008", "text": "I have stayed in this hotel many times over the years. We always do a shopping weekend in syracuse. Needs a few updates as some of the rooms are starting to get a little dingy but over all pretty good. Breakfast in the morning is always nice. Happy hour is fun as well. Only bad comment. Its free range children. where are the parents????? Wow its like they check in and let them loose.", "title": "Not Bad needs some updates", "user": "Photolady2010", "date": "October 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 46542201}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Though it's 20 years ago, the Embassy Suites is still the best value on Carrier Circle. We stay here every Christmas for our annual family visit. The suites are a bit small by modern standards. The breakfast is excellent.", "title": "Best on the circle", "user": "panchess", "date": "September 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44010102}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Stayed here for one night on the way to Maine. Hotel shows it's age in some areas, but is mostly clean, and is great for a stay with young children. Breakfast was average at best, with most of the hot food served at room temperature, and the cooked to order omelets underwhelming. One nice touch is the nightly manager's reception, which offers complimentary adult beverages. Staff is all very helpful and friendly. Rooms look like they were somewhat recently spiffed up, but their age is still evident if you look hard enough. There is a Ruby Tuesday across the street, but you will need to drive everywhere else. Hotel is located in an old, industrial section of Syracuse, so do not stay here if you are adverse to that.", "title": "Little things make up for it's age and retro design", "helpfulness": 1, "user": "TravelHound1", "date": "August 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 36904569}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I stayed here twice in March for business. Check-in was speedy and my first impression of the hotel was very good!", "title": "Perfect for Business Travelers", "user": "delsino", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 30440774}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This Embassy Suites is outstanding. A lovely facility with evening reception and large 2-room suites. We thoroughly enjoyed our stay here and would definitely stay again if our travels take us to Syracuse. We even ate dinner in the restaurant there and it was very good.", "title": "A great place to stay with extremely nice and helpful staff.", "user": "Murfee", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30323338}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Beautiful hotel..........Free buffet breakfast...........Free cocktails in the most beautiful setting in the afternoon...Hightly recommend staying there ....suites are clean with 2 large tvs....will be the only place we stay at in Syracuse....", "title": "Perfect....", "user": "judeca1952", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29283416}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "I have stayed at this hotel a few times now for business meetings and it has always been very accommodating. The staff is very helpful, polite and knowledgable. If you're planning a work meeting, this is a great place because they have a few different Executive Suites or conference rooms to choose from. Everything you need is on site; a small store with snacks, frozen foods, drinks, toiletries, etc. There's a good size business office for printing and using the internet, a full restaurant/bar that's extremely convenient for lunches or dinners and after work gathering, a free 5-7pm happy hour, a full breakfast every morning with made to order eggs/omelettes, cereal, coffee, etc., several lounge areas, a pool, workout facility etc.", "title": "Great value", "user": "Ollie12", "date": "April 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27801648}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "There are a few restaurants within walking distance if you want to host a dinner off site. There's an Italian restaurant called Grimaldi's that you can walk to, Ruby Tuesdays, Justin's Grill or you can drive to Joey's Italian Restaurant (highly recommend) that less than 5 minutes away by car. There's 2 Dunkin' Donuts locations nearby and a Starbucks down the road. This location is right off I-90, so it's a convenient location for people traveling by car or from the airport.", "title": "Bring you own air conditioner - it is 80 degrees and stifling!", "helpfulness": 1, "user": "MaineHazel", "date": "April 3, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 27375247}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "You really can't beat the price for this hotel for what they offer.", "title": "Worst Hilton Stay EVER!!!", "helpfulness": 1, "user": "thefunkchild", "date": "March 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 25547096}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 29, "average": 75, "very good": 106, "terrible": 26, "excellent": 101}, "aka": "Embassy Suites Syracuse", "slim_ranking": 0.533333333333, "description": "All suite property featuring spacious two-room suites, complimentary full cooked-to-order breakfast and complimentary beverages and snacks at our complimentary evening reception. The hotel is conveniently located off the New York State Thruway (i-90) at Exit 35 and Carrier Circle, just minutes from Downtown Syracuse, Hancock International Airport, Syracuse University, LeMoyne College and Destiny USA. Many outdoor recreational activities are available including Onondaga State Park, beaches and public golf courses."}