{"user_rating": 4.5, "review_count": 289, "name": "Embassy Suites Columbus - Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "This is a newer hotel. I've always been a fan of Embass Suites, but I don't like the lobby of the new design. Breakfast didn't have enough seating, which was never a problem in the old atrium design. The new design just isn't as interesting as the old design. The room design is outstanding! Very comfortable bed, large flat screen tv's. No bathtubs which I enjoy, but nice bathroom. Only problem was I could hear my neighbors showering through the exhaust fan. It was very loud, as though they were showering in my room - obviously a mechanical or design flaw. The service was better than average but not outstanding. I would stay here again.", "title": "Very comfortable, good service", "user": "swandive208", "date": "October 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142739192}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The hotel was more than expected and the conditions were some of the best I have seen at Embassy Suites. Rooms were neat and showed no signs of wear. Restaurant food was great and resonabaly priced. This establishment is approximately three years old and is impressive in design, cleanliness, and decor. One thing of note that left me with a very positive impression was the smell in the shower which indicated the room had properly serviced.", "title": "Well Worth the Price", "helpfulness": 1, "user": "benfen6293", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142247237}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I stayed over the weekend for a business trip--what a treat to relax in a mini-apartment after an exhausting workday! The hotel is very upscale, modern, and clean. Close to the airport, Easton shopping and dining, and only a short hop to the interstate. Buffet breakfast was good, offering cooked-to-order omelettes in addition to the buffet. Rooms are spacious, nicely appointed, and quiet. The price is quite reasonable for this quality, and the size of the suite. I've stayed in lots of ordinary hotel rooms at this rate, so it's well worth it.", "title": "Very upscale, at a reasonable price!", "user": "Nita P", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138475489}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I stayed 2 nights during a continuing education session. My room was just the BEST! It was large, comfortable and full of amenities. The parking was very convenient. Although my check in was late (I had to work that day and then drive to Columbus) it was a breeze and they made certain I knew how to get anything I might have forgotten. The room was quiet, the bed clean and comfortable and I was very impressed", "title": "Lovely place", "user": "Thpeaky", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 138163687}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The breakfast was good but opened late which made a lot of us late for the opening session.", "title": "Robin K", "helpfulness": 1, "user": "Robin K", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137933709}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "The hotel overall is beautiful.everything from the rooms to the pool and work out area to the breakfast area.....fantastic.the bathroom is really nice.housekeeping walked in on me twice.was overcharged for an additional night and went through a lil bit of a hassle to get refunded due to one of the front desk reps who just made me out to be a liar.the second rep just blew me off and sent me straight to a managers voicemail.it did get straightened out eventually.other than that.best hotel in that area.", "title": "Minus the impatient housekeeping and 2 not so friendly front desk reps this hotels rocks!!!!!", "user": "bambam704", "date": "November 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 145422353}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Second time I have stayed there for a park, sleep, and fly. They allow you to keep your car there while you are gone and shuttle you back and forth to the airport. The staff and especially the shuttle drivers are excellent, friendly, and professional. The breakfast was very typical of embassy suites (not better or worse). A little pricey compared to other park, sleep, and fly hotels in the area, but I would certainly keep staying there.", "title": "excellent", "user": "T S", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144658587}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This hotel, with its close proximity to the Columbus Airport, was a terrific venue for a recent professional conference I attended. This was the second time that our association hosted its annual meeting and training session here.", "title": "Perfect place for a business meeting/conference!", "user": "Emmy1965", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143903214}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The staff are all guest-focused and they all went our of their way to accommodate us.", "title": "“Good hotel, great breakfast” - a year later & good enough for a Presidential hopeful", "user": "CJ_Ranch", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143766235}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The vendor/exhibitor area and the break-out rooms allowed for networking and socializing.", "title": "Great stay", "helpfulness": 1, "user": "Bill E", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143575593}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Beautiful rooms, friendly staff, convenient location. Great, made to order breakfast. This Embassy Suites meets and exceeds expectations. Good value for the money. Easy access to both airport and Interstate.", "title": "Great Embassy Suites", "user": "Peter A", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147400152}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "I stayed here few times while I was working in the area. They have free shuttle to/from airport, unless it's too late at night. I think they stop at 10 pm or around. They also offer shuttle to downtown or neighboring areas. Free breakfast, great location.", "title": "Great place", "user": "samdallas972", "date": "December 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146835306}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "My husband and I stay at this hotel because it is one of the only ones in Columbus that has NOT had a bed bug sighting. We have been staying there for a few years now while in Columbus on business over the Thanksgiving weekend. There is nothing terrible about the hotel, however people should know that they gouge you on holidays ($70.00 extra for Thanksgiving night - and we made our reservations way in advance) and they seem to have an aversion to vacuuming.", "title": "Please vacuum more and often!", "user": "museumcurator", "date": "November 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 146486099}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Upon checking in, we check the room extensively for signs of bed bugs - looking under the mattress, behind the headboard, etc. We were shocked at how much food and debris was there.", "title": "Embassy Suites Is Truly A Hotel That Gets It Right!!", "helpfulness": 1, "user": "LoveToCruise2009", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146328534}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Their hot breakfast has great potential. Unfortunately we have very early mornings while there, and usually only partake once during our 3-night stay. Again, when we did eat the breakfast, cleanliness was an issue. The food was okay, however many of the \"clean\" plates on the breakfast bar still had food attached - just makes you wonder...", "title": "Clean, big rooms", "user": "JC2", "date": "November 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 145670034}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "This was our second visit to this hotel. We've enjoyed both visits. The rooms are very nice, and we feel very comfortable there. Beds are comfortable, two large tvs, and everything you need to stay. There's a desk/table with chairs, internet, mini kitchen area, and the bathroom is large and has a lot of counter space.", "title": "Great Embassy Hotel", "user": "Tbelle", "date": "January 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 149383171}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "My one and only complaint is that there is no bathtub and I like to relax in a tub.", "title": "Disappointed with service and inattention to details", "user": "singabob", "date": "January 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 149135771}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The breakfast is one that you can actually order your eggs the way you like them, and there's a buffet with a good assortment of food. What's with hotel toasters, though? I don't care what hotel it is, the toasters don't toast. Kind of funny. There is a nice afternoon snack and drink time. Most drinks are free, and there is an assortment of cheeses and snacks. It's a great time to kick back and chat. Very nice.", "title": "Highly recommend this place!", "user": "LeeGen", "date": "January 6, 2013", "detail_rating": {"sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 149007327}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The lobby and lounge areas are really nice - much more upscale that expected. Beautiful bar with separate areas with club chairs and plenty of sofas and tables. Not the cheesy early American yuk furniture you find in a lot of places, but contemporary furniture with high end fabrics. And there is fine art on the walls, framed large photography, and it all looks much more lush than a mid priced hotel.", "title": "Not for the disabled", "helpfulness": 2, "user": "fauxgypsy", "date": "December 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 148019890}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I say mid priced, because this hotel is not inexpensive. We paid around $150 a night both times we stayed there and we price shopped. We were there for an event and the rooms were offered at a reduced event rate, but I didn't think they were reduced by much, if at all. Even so, I think it's worth it. I'd like to have the rates a little less, but who wouldn't.", "title": "Great weekend stay for rock groups, easy to meet for check in", "user": "theawesome1", "date": "December 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147842843}], "location": {"country": "United States", "city": "Columbus"}, "stars": 3.5, "variance": {"poor": 5, "average": 15, "very good": 72, "terrible": 5, "excellent": 192}, "aka": "Embassy Suites Columbus - Airport Hotel Columbus", "slim_ranking": 0.0575539568345, "description": "The Embassy Suites Columbus Airport in Columbus, Ohio is the premier full service hotel near Port Columbus International Airport and a preferred choice for business travel, Columbus vacations, and convention guests. The hotel is conveniently located 4 miles from Easton Town Center, 5 miles from downtown Columbus and the Greater Columbus Convention Center, and 10 miles from The Ohio State University.All registered guests receive accommodations in a 2-room suite, access to our evening Manager's reception featuring complimentary snacks and beverages, cooked-to-order breakfast each morning, and airport transportation.Whether visiting Columbus for business, leisure, sports or a convention, the new Embassy Suites Columbus Airport hotel is a central location to all Columbus has to offer."}