{"user_rating": 4.5, "review_count": 851, "name": "Embassy Suites Montreal", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I love suites and like other Embassy Suites, you get full breakfast and evening cocktails included in your stay. The suite I had included a kitchen with a full-sized refrigerator, microwave oven, dishwasher, sink and cabinets --- no stove. However, there were no plates, pots or utensils. Maybe they could have been borrowed, but I never asked. The living room was decent sized and had a desk and flat screen TV with a remote controlled propane fireplace. The bathroom had shower and separate jetted tub. The sink was nice but too tall -- I had to stand on my tiptoes to rinse my face. The bedroom had a second TV and two queen beds --- but, space was tight and I banged up my leg trying to get around the bed. There was an odd little hallway at the entrance with a fairly large coat closet. A separate smaller closet was in the bedroom. Overall, quite a nice place to stretch out and relax. Newspapers provided daily --- in French or English --- although it took a couple of days to get it in English.", "title": "Great suite!", "helpfulness": 2, "user": "otsthedog", "date": "March 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155853144}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "For a weekend vacation from NY, we selected a regular room - not a suite. It came with a kitchenette (frig, microwave, dishwasher, sink). Room is attractive and nice size but otherwise pretty standard. For a very reasonable price, modern building located central to old Montreal with its great architecture, many restaurants and bars, and galeries. The low price included happy hour beers and snacks and an excellent full breakfast buffet with omelette station, fresh fruit, etc. Parking below was a bit pricey but very convenient. We were on the alley with construction out back, but not much of a problem on the weekend. Some carpet stains kept this from a five rating. Staff and service pleasant and tried their best to be helpful. This place suited our needs very well.", "title": "A Lot for the Money", "user": "Smalbany", "date": "March 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155416617}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My boyfriend and I stayed at this hotel in August 2012 for three days.", "title": "Great location and suites!", "user": "shuang_viv", "date": "March 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154970746}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The hotel is conveniently located at the boarder of Old Montreal, right beside the Nort' Dame , right across from the convention center, 5 min walk from China town, 20 min walk from downtown Montreal. Self Parking was convenient.", "title": "Our Fourth Visit", "user": "lyagirl", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154956567}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Breakfast buffet was awesome for the price you pay, large selection of various cold/hot dishes. The only thing is that if you go during a busy weekend, you might want to get up early for breakfast or else it'll be hard to find a table.", "title": "Good also for a bit longer stay", "helpfulness": 1, "user": "SlatsRetract", "date": "March 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154769731}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Embassy Suites on St. Antoine is an ideal location with Old Montreal an easy walking distance. The Notre Dame Cathedral is steps away. There is plenty of shopping nearby - with a vast network of underground access to shopping in case the weather is too cold or it's raining. Montreal has wonderful restaurants, particularly in Old Montreal - with plenty of nightlife too. It's a world class city and a must see!", "title": "Fantastic location, very friendly hotel, great value", "user": "DestinDestiny", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153058338}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Great place to stay with the kids - so convenient to walk in Old Montreal and see the sites (Notre Dame, Archeology museum, ...) and lots of restaurants in walking distance. The Metro station was right across the street and so easy to use to visit BioDome/Olympic Park and downtown/St. Catherine St. area. Staff was fabulous for reception, breakfast, things needed in the room - and Chris the concierge was so helpful in getting us around!", "title": "Fabulous location & service - Chris the concierge is the best!", "helpfulness": 1, "user": "cvghui123", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152995843}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Had a very nice weekend stay in this hotel. It's closer to old Montreal but across the street there is access to the Montreal Underground City, so you can venture to other parts of downtown by walking or via subway without going outside (important in the winter). The garage is reasonably priced but tight in terms of spots/turns. Rooms are spacious (like most Embassy Suites) and clean. There is a large kitchen that is of limited utility as it contains for example a dishwasher but no oven. Strangely, there is no in-room safe and you must instead use a safe at the front desk (not very convenient). WiFi is unfortunately not free but was reasonably fast and reliable.", "title": "Good choice for stay in Montreal", "user": "vvv3", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152789552}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "In terms of common areas, there is a small fairly well-equipped gym with a VERY low ceiling. Don't expect to do any exercises where you raise your arms unless you're on the short side. The breakfast has a nice selection of hot items (including omelet/egg station) but is a mob scene on weekends or when the hotel is full. There are people scrambling for tables, long lines, etc. The hotel tries its best to compensate but is clearly best experienced during the week when it is not at capacity.", "title": "I recommend!", "helpfulness": 1, "user": "Fabrice D", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152622905}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The crowds lead to other negatives, such as difficulty finding a table at Happy Hour and snack items there that are consumed and never replenished. As others have mentioned, the elevators are a design disaster with only 2 to serve the entire hotel and multi-level parking. Expect to wait a long time for one to come and if you're on a lower floor, to find it full by the time it gets to you so you have to keep waiting. Adding to the elevator misery, there appear to be no stairs to get to the lobby (they only lead outside).", "title": "Great stay.", "user": "Linleymac", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152580148}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Rooms are a good size for stretching out, but again they are suites. Nice size fridge/freezer in the full size kitchen. The beds were very comfortable and great pillows.", "title": "Comfortable", "helpfulness": 2, "user": "geeflo", "date": "March 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 154600599}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Location was decent and not too far from Old Montreal and Chinatown. The Metro is close by, and downtown is a short cab ride or walk even. The happy hour is great (2 free drinks per night per guest - book in as 2 adults even if you're solo). Staff was attentive and helpful.", "title": "Lost The Hospitality Theme", "helpfulness": 2, "user": "andy.karla", "date": "March 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154571516}, {"rating": 3.0, "title": "NOT Staying Here Again", "text": "As our go to place when in Montreal we made the decision to splurge on the Presidents Suite for our 20th Anniversary. At a price of $800 and up we were disappointed in what we got. In comparison a one bedroom suite at the Ritz on their club floor at comparable cost was much nicer and came with more personalized services and amenities and a much more luxurious room.", "user": "5starbabe", "date": "March 13, 2013", "id": 154462534}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The president’s suite here is very spacious but also very simply decorated, for the price and name one would expect a more style luxurious suite. The bedroom has a seating area in front of the fireplace, while the en-suite features a Jacuzzi tub large enough for two!", "title": "Great location and wonderful people", "user": "paypay7575", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154311410}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "There is also a full kitchen, however the dining area furniture resembled the entire suite in which we found the furnishings to be very plain and of the cheaper variety and certainly not what one would expect from a presidential suite.", "title": "Convinient Hotel!!", "user": "Steph89Dum", "date": "March 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153892865}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Well as all the reviews point out, the suites here are great. Large, well appointed, comfortable - the list goes on. Bed was wonderful, great height (might hurt a little if you roll off it ;)) and very comfortable as well, not to hard, not to soft.", "title": "Great size, well appointed suites.", "user": "AusJeff", "date": "March 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153764466}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Food - Breakfast was very ample, especially the custom omelettes (didn't see this the first day). Dinner was fine, but nothing to write home about - albeit I wasn't really hungry.", "title": "Spacious Room, Good Breakfast, Great Location", "user": "Rebecca B", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153598645}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Staff - ALL very helpful and pleasant. particularly Philippa (sorry if that's wrong) from concierge.", "title": "Always enjoy coming back!", "user": "SwissCapo75", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153133053}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Location - great for the Old Montreal site seeing, waiting for a cruise ship.", "title": "Good option in downtown Montréal-but.....", "user": "JasonG14", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 153086095}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Ok, so given all the positives on all reviews I'll cut straight to the negatives:", "title": "Great Suites", "user": "ckoelbl", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153077510}, {"rating": 5.0, "title": "Fantastic Hotel!", "text": "I spent 150+ nights in this hotel in 2011 (sorry for the late review!!) and honestly can't say anything bad about this hotel. The rooms are great, lots of space, comfy beds, huge bathroom. The kitchen appliances are useful for long stays. The check in staff are friendly and always smiling. The cocktail hour is a nice bonus, and Amber and Mario in the restaurant are awesome! Location in the Old Port is a big winner in the summer and winter month. Love this hotel!", "helpfulness": 1, "user": "wehearttravellin", "date": "May 25, 2013", "id": 161777677}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Used the Embassy Suites hotel for a post cruise location to relax and enjoy Montreal. The location was close to the port and old town. Very close to the Notre Dame Cathedral. Booked in advance and received great value. Highly recommend this place!", "title": "Great Location and Value", "user": "JimH196", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161844429}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Clean, comfortable, well appointed. Centrally located to Old City and across the street from convention center. Plenty of room to relax in the living room area. Living room and bedrooms had television sets. Compimentary coctail reception and breakfast are good extras. Staff was friendly and efficient.", "title": "Embassy Suites Montreal", "user": "Kenneth C", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161698626}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We got this for a great price. We were upgraded for free. It had a full kitchen, living area, bathroom, and bedroom with a king bed. The bathtub fit my 6-3 husband comfortably. The internet was free in the lobby and bar. I think it was like, 10 dollars per day for wireless in the room. They have parking on location for a fee, under 30 dollars per day. This is not too bad for downtown Montreal. But you should skip a car. It is a nightmare driving in Montreal. The subway station is across the street and is very easy to navigate and is cheap. We are from a small farming town in the Midwest and were able to navigate it easily. The location is perfect. It was right next to the down town, old town, and the subway. They also include free breakfast (omelets to order and a good spread) and 2 drinks per person per night. We used the free drink time to check our emails and Facebook. They have laundry on location. It is in the parking garage level and is $1.25 per wash and dry. Felt very safe and secure. It was very clean and spacious. The staff was very helpful and accommodating. Beds very comfortable.", "title": "Awesome", "helpfulness": 1, "user": "Lizzie0113", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161547111}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Great location, easy walk to old Montreal, Notre Dame, and convention center. Lots of restaurants and nightlife in walking distance. Very clean rooms. Friendly, helpful, and knowledgeable staff. Good complimentary breakfast (loved the omelettes). Nice fitness center too. Business center is below average. Construction noise next door starts early in the morning.", "title": "Nice Stay, Nice Location", "user": "Will M", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161296232}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The room was large and clean. Great kitchen. Huge bathroom. Free breakfast the was pretty good. Free drink and refreshments in the afternoon. Great value. It's located near old Montreal. East access to the metro. Staff was friendly and accommodating.", "title": "Beautiful room great location", "user": "toastywoods", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160833189}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The hall is quite small. not easy to circulate. The quality and variety of the breakfast food is comparable to a motel food: it is not good, not various from a day to another, it really is greacy and cheap food. apart from that, the location is perfect. The employees are really nice. There always is a taxi available in front of the hotel. Their are 2 metro stations within 3 minutes on foot from the hotel. The rooms are nice and clean. The hotel is quiet.", "title": "good to stay, not to eat", "user": "Guillaume V", "date": "May 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 160677819}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Embassy Suites in downtown Montreal has large comfortable suites at a reasonable price. It is conveniently located, close to Old Montreal. They offer a free full breakfast, not just a coffee and muffin. Highly recommended.", "title": "Good Experience", "user": "David S", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170166621}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed here during a conference. Easy access to the conference center across the street. Hotel was undergoing some renovations during my stay, but you would never have known as they kept noise level down, etc.", "title": "Excellent Property", "user": "Michelle P", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160674938}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Booked a one bedroom with double beds for 2 nights for our anniversary because we had the kids (2+6) with us. I guess when we got there there were none available so the upgraded us to the presidential suite. Ok?! 2 bedrooms, full kitchen, living room, dining room area, huge jacuzzi tub. 1300 sq feet. It was pretty much an apartment, not a hotel room. It was awesome. $1100 room for $193 a night. Not bad. Free drinks were nice especially to relieve some stress before going out to eat with rowdy kids. Breakfast was amazing both mornings. Location was good for walking around the old city. $10 for wifi per day per device is a rip off but whatever. My bill of extras and fees for 2 nights with parking and wifi of 1 device was $104. Not bad since we usually got to NYC and pay $60 a night just for parking. Overall this hotel is a solid 3.5 stars borderline 4. The picky wife was happy and that's all that really matters, right?", "title": "Presidential Suite", "helpfulness": 1, "user": "Mlucas2", "date": "May 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 160038749}, {"rating": 2.0, "title": "once, there was a small cafeteria, and then a huge hotel grew over it...", "text": "The hotel is fine. Rooms are large, location convenient, staff helpful.", "helpfulness": 3, "user": "anon73", "date": "May 28, 2013", "id": 162123898}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Its biggest (and truly the only flaw) is the \"restaraunt\".", "title": "Luxurious Weekend", "user": "Hannah B", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162063869}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I use the term loosely, as it is little more than a cafeteria. In addition to being completely barren of any kind of decor, it's absolutely tiny. There may be 30-40 tables - which means that in an 11-story hotel, if you want to eat there, there's no room.", "title": "Great location and huge rooms!!", "user": "Joan J", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161941859}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "3 breakfasts in a row the place was mobbed. Families with young children stood in the lobby waiting to be seated. Servers rushing guests off the tables to seat others. A humiliating experience.", "title": "The best hotel experience", "user": "VeraTraveler", "date": "May 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161938423}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "And the same thing with the \"happy hour\". The manager's reception is nice, but if it consists of an overworked bartender and crowds of people in a cramped space, with no tables to spare...and no manager in sight, what good is it?", "title": "A Great Property Near the Convention Centre", "user": "NorthernGuy13", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161932316}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "My husband and I recently stayed a this hotel to celebrate our 1st wedding anniversary. We travelled from Madoc, Ontario and felt very welcomed and relaxed during our stay. There was a small mess in the bathroom that we addressed to the front desk and they had cleaned up while we were out, and they even went as far as leaving us cookies in the room with an apology letter, which I thought was wonderful! Great location, we walked to everything. Managers drinks were a nice treat and the breakfast included was amazing! Hubby speaks french but i dont, they were great with helping us in english so we could see everything we wanted! Definitely worth the 5 hour drive and the price was great too! We'll be back for our 5 year wedding anniversary and hopefully many more after!! Thanks embassy!", "title": "Excellent hotel experience", "user": "SanAdam", "date": "May 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159788433}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Overall I thought this was a great hotel. Loved the complimentary evening drinks and continental breakfast. Only thing it was missing was a pool and Free Wifi. I had never been to Montreal before and the staff were very helpful in pointing out places to explore, restaurants to try, and directions to anywhere I needed to go.", "title": "Great for long stays", "user": "Katrina M", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160665685}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Nice hotel, good value for money and well located, this hotel is within walking distance of the Montreal train station and right on the edge of Old Montreal. Staff is very helpful and breakfast was very good. Our only issue was that our room was on the front of the hotel, which means it faced busy St Antoine St which was understandably busy and could be noisy due to the traffic. That being said, we'd definitely stay here again.", "title": "Great location", "helpfulness": 1, "user": "Jennifer H", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159400521}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Apart from the building works (which will be finished soon) and the temperamental remote control (which I didn't complain about) my stay was great. The hotel was extremely handy for all my needs so I would recommend it.", "title": "Survey", "helpfulness": 1, "user": "Toni F", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159253482}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "An excellent experience all around. The hotel staff were friendly and helpful. The access to the business center 24 hours was very useful. The room was very clean and nicely designed. The large refrigerator is a plus.", "title": "Embassy Suites Montreal", "helpfulness": 1, "user": "Robin A", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159139118}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 3.5, "variance": {"poor": 25, "average": 79, "very good": 313, "terrible": 21, "excellent": 413}, "aka": "Embassy Suites Montreal Hotel Montreal", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Embassy Suites is Montréal's newest downtown \"Suite\" hotel. With a contemporary style, our uniqueness extends to our \"Zen\" inspired lobby décor featuring wood paneling and ceilings, black granite floors, and an indoor water display. Offering so much more than ordinary rooms, our 455 square-foot studios and 600 square-foot suites are well equipped; many with full kitchens, fireplaces, and \"double\" Jacuzzis."}