{"user_rating": 4.0, "review_count": 295, "name": "Embassy Suites Hotel Seattle - North / Lynnwood", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "This is our second stay here and again it was just as nice as the first time. We go with another family each year and the suites are spacious and comfortable for us. The breakfast in the morning is wonderful including an omelette bar and a nice selection of hot and cold breakfast as well. Everything was great however the only downside to this hotel and we had this problem last year was the busyness of the hotel and the pool area was chaotic. Kids are everywhere and scream quite loudly and echos in the pool area. The pool is quite cool so not really enjoyable and the hot tub is always jammed with people. All in all though our stay once again was relaxing and we would definately stay there again!", "title": "Spacious and clean rooms with a great breakfast", "user": "mauitikitikitribe", "date": "April 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27620225}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The room was clean, comfortable, and spacious. I appreciated the two-room suite. The restaurant is a convenient feature, but the food is not great.", "title": "Spacious room, nice stay", "user": "OregonSp8", "date": "March 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 26136398}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "I went to visit a friend and stayed for 3 days. I would definately stay again. Is it fancy -no. But the service was great. The room clean and decent. The room service was even tasty. My only complaint was the pillow are like rocks! It is very convenient to I-5 as well.", "title": "A convenient place to stay", "user": "Dofre", "date": "March 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 25675684}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "From the moment we entered the hotel, we were treated almost like royalty. We arrived a bit before the check in time, but were able to go into the restaurant/bar and have drinks while we waited. The front desk called the bar to let us know when our room was ready. We booked the Valentines Package, and our chocolate strawberries and champagne were in the fridge chilling. On the bed were two long stem roses, with rose petals all over the bed also. The pool was relaxing with the waterfall cascading down into the water. The complimentary breakfast was amazing. The amount of items to add to your omelette was quite vast; about 10 different things. You could also have your eggs any other way that you wanted. There were also fried potatoes, sausages, and bacon; as well as breads and fruit.", "title": "A very royal experience", "user": "Janie70", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25022028}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Definately enjoyed our stay and will be back again for sure.", "title": "recommended", "user": "terryjgardner", "date": "January 21, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 23767038, "likes": {"liked": "— familiarity of Embassy Suites", "disliked": "— The location is not optimal. Can be difficult to find going south on 5."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "As the world of Embassy Suites go, this is a fairly dated property. The rooms themselves are relatively new, but the lobby looks like it is vintage Embassy Suites.", "title": "Fairly Good Stay", "helpfulness": 2, "user": "bisbohemian", "date": "December 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 22593059}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The breakfast buffett is the high-point. The lady who is the head chef makes everyone smile! She is a great send-off to the business guests! I give her an AWESOME!", "title": "Weekend Getaway", "user": "YVRTraveller", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21491589, "likes": {"liked": "— Nice property.", "disliked": "— Evening reception was not very good and the internet connection at the business centre was hit and miss."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The 4th floor is a non-smoking floor. However, it seems that the 5th floor is still a smoking floor. Every morning when the guest above me lit up his first smoke of the day, I could smell it in the vents coming into my room.... not the most pleasant way to wake up.", "title": "Great place to stay!", "helpfulness": 1, "user": "GK360", "date": "August 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19061838, "likes": {"liked": "— Proximity to freeways, restaurants and shopping; good food; clean and comfortable room; friendly staff", "disliked": "— Nothing really, other than a very minor issue with the shower."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The other ding against the property is that the entry to I-5 north is... not what you might call... efficient. You have to either wind through a neighborhood or through the nearby mall. Odd. Not the fault of the hotel, but then it does affect the hotel's guests who may be working north in Everett.", "title": "Nice Place", "user": "Crayh", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 19055973, "likes": {"liked": "— Happy Hour and Breakfast", "disliked": "— Pool is crowded, but its okay."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I would probably stay here again.", "title": "Perfect in Lynnwood", "helpfulness": 1, "user": "dstraveller", "date": "August 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18757310}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "I was really worried when I checked in at this hotel because they handed me a paper to sign that said I would not \"run in the hallways,\" \"make excessive noise\" and would \"take full responsibility for any children traveling with me.\" As a childless couple, I turned to my husband and said \"oh no, I think we are going to be in for a very unpleasant stay.\" Thankfully this wasn't true, but the hotel obviously has severe trouble with families / children running amock at all hours of the day and night. The only time we were bothered by obnoxious kids was at the free breakfast buffet in the morning.", "title": "Spacious and Clean, But They Cheap Out on Air Conditioning!", "helpfulness": 2, "user": "moviegal226", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 17660717, "likes": {"liked": "— Spacious, large and clean rooms.", "disliked": "— Management shuts off the central air conditioning units at night."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The hotel has a decent free breakfast bar for all hotel guests. It is served in the main atrium off of the lobby. There was a made to order omelette station and several hot selections (oatmeal, bacon, pancakes) and a pitiful selection of fresh fruit and cereal. Again, the breakfast is free with your room rate, so it's hard to complain too much about it.", "title": "Great Accommodations and Amenities", "helpfulness": 2, "user": "MSRuby-7", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16836239, "likes": {"liked": "— The beds and excellent service", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Ample, free outdoor parking was a breeze and I also made use of the small gift shop and Seattle's Best Coffee outlet in the lobby. The hotel had a small business center as well, with two computers with internet access and printers that guests could use free of charge.", "title": "Awesome Hotel!!", "user": "BCFamily0f4", "date": "May 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16310121}, {"rating": 3.0, "stay_parameters": "Stayed February 2008", "text": "The room was very spacious, clean and comfortable. This hotel has obviously been recently remodeled. Crisp and fresh bedding topped off a very well appointed guest bedroom. The rooms are set up as 2 room suites. The main bedroom is in the back, with a larger sitting area in the front. The sitting area has a fold out sofa bed, a big desk and work chair and television. The main bedroom also has a work desk and chair and t.v. The room is equipped with a mini refrigerator and microwave and wet bar sink. The bathroom is an adequate size, but a bit more room here would have been appreciated (as would a second sink).", "title": "Standard Embassy", "user": "Tipster2000", "date": "March 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 14070572}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "My biggest pet peeve as a traveler is when a hotel shuts off the main air conditioning at its hotel if they deem it \"cool enough\" outside. The a/c would not come on for our entire stay, and we had to open the window for cool air. I know this is a money saving tactic for hotels, but if I am paying over $100 a night for a room, I should be able to run the a/c or heat if I so choose and I should not have to open up an outside window to keep cool. I love my room very cold when I sleep so thank goodness I had packed a fan in my suitcase! This just amazes me that hotels do this, and unapologetically too! I would NOT recommend staying here if you enjoy a very cold sleeping environment.", "title": "Great Hotel with a Great Breakfast!", "user": "jparks2007", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13991371, "likes": {"liked": "— Staff, Room and Breakfast", "disliked": "— Hot tub was small and sauna under repair"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed at this hotel a few years ago and I said never again. But after reading the reviews I gave it another try, and I am glad I did. The rooms have all been renovated which was the biggest problem last time. I like having the separate bedroom and the extra space as we were travelling with our kids. They love the pool area although it isn't very big and on the weekend we were there it was packed with kids. The daily breakfast is great. I love having both the breakfast and the evening reception and even if it is typical Embassy Suites stuff as mentioned in other reviews, it is a great feature to have. The prices are still really reasonable and you are only minutes from Seattle and lots of shopping.", "title": "So much better than last time", "user": "ryjenw", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 35742955}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This is a nice location just off I-5, 15 minutes from downtown. Room was very clean and had all amenities you expect from Embassy Suites. Atrium area is dated and in need of some love. Reception and breakfast was standard Embassy Suites fare, which is not spectacular, but is a good meal and a solid value. Had on my reservation On request for extra towels and pillows which we had to call down for in the morning (only 3 towels and 4 people). But I would stay here again.", "title": "Good Value, Good Location, Minor Quibbles", "user": "Rob S", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 34784341}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This is a beautiful hotel with a very small pool area, although the waterfall is nice and my little girl had a great time. Don't let the words \"two-room suites\" fool you. The total room is not much bigger than your average hotel room. There is no storage for your luggage if you have more than one bag. the closet is very small. It was nice having two tv's and the fold out sofa was comfy for my 5 yr old. The pool area is extremely noisy. Don't expect to relax in the hot tub. It was always packed and heavily chlorinated, so much so we left early to keep our eyes from watering. Their heavy chlorine made my legs itch very badly. The breakfast is the highlight of the stay with sounds of waterfalls around you. Everything was delicious, pancakes, french toast, and bacon were barely warm though. They have a very good oatmeal with all the fixings. The elevators smelled pretty bad, like stinky feet. I don't know about the past complaints about the pillows, but ours were fabulous, fluffy feather pillows. Bed was very comfortable, just very tight in our room. Not much distance between the bed and the tv. We left our hotel everyday in the morningand didn't come back til the evening, so we would stay here again. difficult acces from the south bound I-5. Easy to get to heading north from Seattle. No matter what they say, the internet service is NOT free.", "title": "nice hotel with pretty atrium area", "user": "ciera1love", "date": "June 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 33331180}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Nice Embassy Suites north of Seattle. Pick this hotel due to a graduation we had nearby. Good size rooms with large bathrooms. Good breakfast every morning.", "title": "Very good", "user": "BadgerTim", "date": "June 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 33000354}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I booked this hotel based on the relative distance from my business location near Bothell, which as it turns out was less than 10 minutes commute from Lynnwood.", "title": "Solid Property, Good Location", "user": "VisitedNewPlaces", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32386639}], "location": {"country": "United States", "city": "Lynnwood"}, "stars": 3, "variance": {"poor": 20, "average": 44, "very good": 116, "terrible": 11, "excellent": 104}, "aka": "Embassy Suites Lynnwood", "slim_ranking": 0.333333333333, "description": "The Embassy Suites Seattle-North/Lynnwood is an all-suite hotel located just a short drive from downtown Seattle. Guests relax in spacious and beautifully decorated two-room suites. Each suite features a private bedroom and separate living room, and all suites are equipped with two flat screen TVs, wireless high-speed Internet access, two telephones, dining/working table, wet bar, fridge, microwave and coffee maker. In the morning guests are invited to a complimentary full cooked-to-order breakfast, and in the evening complimentary drinks and light snacks at the Manager’s Reception. The hotel also has an on-site restaurant, McCarthy’s Bar & Grille, and Room Service is available. Other amenities and services at the Embassy Suites Seattle-North/Lynnwood hotel include an indoor pool and sauna, a fitness center, and business center. The hotel offers business services such as printing and copying, audio/visual equipment rental and meeting rooms. The hotel is business-friendly and has perfect accommodations for leisure travelers and families. Conveniently located near downtown Seattle, attractions near the hotel include the Seattle Center, Pikes Place Market, Museum of Flight, Alderwood Mall and more."}