{"user_rating": 4.0, "review_count": 883, "name": "Embassy Suites Orlando/Lake Buena Vista Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We took my son to Disney and Seaworld in March, 08 and stayed at the Lake Buena Vista Embassy Suites. I was a little concerned because not all reviews were favorable, but they must have stayed somewhere else. The hotel is in a great location and just a few minutes from the gates of Disney and Seaworld. The staff was great and the room was above average. It was clean and comfortable. It was not over the top, but a very good value for the money. The restaurant is pretty good and my son enjoyed the pool. Disney not have indoor pools at their properties (or microwaves) so this was a big plus to stay off site so early in the year. I tavel a fair amount for work and find the Embassy a great place to stay with the free breakfast and cocktail hour. I would easily stay at this property again.", "title": "Great Hotel, Great Location, Great Experience", "helpfulness": 4, "user": "Spark001", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14507026}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "My husband, 14 month old daughter, and I have been here twice now. We came in January for a night. We have seasonal passes to Disney and live in Tampa so it is not a long drive but sometimes just would rather spend the night. I like how this hotel is so close to Disney. The rooms were nice, perhaps in need of a little updating of the bed linens. Everything else was wonderful. The housekeeping staff are so nice. There is free internet access in the lobby. The fact that breakfast is included is definitely a plus. The omelet/egg chef is so cool. He'll call you whatever name and make up information about you. Definitely can get a laugh out of you!", "title": "Can't Say Enough Good Things...will definitely be back!", "helpfulness": 5, "user": "Shea1982", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13720578, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Pleasantly surprised", "text": "Kitchen staff was nice. We brought a can of liquid formula and no can opener and they gladly opened it for us.", "helpfulness": 7, "user": "mbeach", "date": "February 17, 2008", "id": 13624006}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The management was exceptional. We cut our trip one day short because we got bad news about a death in the family. They didn't charge us even though it was already 3 in the afternoon, way beyond the check-out time. We had expected them to charge us.", "title": "Will come back when ever possible", "helpfulness": 3, "user": "sliderjudkins", "date": "February 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13368169, "likes": {"liked": "— View overlooking the Pool"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We will definitely be back to this hotel whenever we decide to stay the night here in Orlando.", "title": "needs improvements", "helpfulness": 3, "user": "gm60", "date": "January 17, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 12735015}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Went there with toddler and wife...overall we were happy with our stay. Our room was clean, breakfast was good, and happy hour was great...needed a cold beer after a long day at the Magic Kingdom.", "title": "Above average.", "helpfulness": 2, "user": "uponbase", "date": "November 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21881499, "likes": {"liked": "— Easy access to Disney"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "It's not the nicest place I ever stayed but far from the worst, it's a GREAT value and perfect place to stay w/ family. Having the small kitchen area and seperate rooms was key.", "title": "Fine Place to stay 2nd time in 3 years", "helpfulness": 1, "user": "dudsterdudster", "date": "October 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20909716, "likes": {"liked": "— Free Breakfast is always nice", "disliked": "— this time....I'll say a lack of tv choices for during downtime"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I would go again, much better value than staying on-site.", "title": "O.K. hotel for the money with breakfast deal", "helpfulness": 2, "user": "rruiz4444", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 20315151, "likes": {"liked": "— The cooked to order omlettes and the staff was outstanding", "disliked": "— The traffic sound from our room and uncomfortable pull out bed"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Second time within 3 years that I brought my family and stayed at this Embassy Suites. Rooms & Bathroom clean (tiles clean, no mildew, Food good) Overall condition of the facility was fine. If comparing to other hotels within this neighborhood, I'd rate it above Average. If comparing to an Embassy or other Hotel located in a \"LESS ACTIVE\" (i.e. not so crowded/ tourists) neighborhood...then yes..it is average. Only issue I had was with housekeeping but it was resolved.", "title": "Had a Great Time, Will Return", "helpfulness": 1, "user": "pvbmom", "date": "August 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 18586432}, {"rating": 2.0, "title": "A pretend embassy", "text": "Pool is very nice and we stayed in the indoor suites. Plenty of food for Breakfast (due to lines for cook to order, I opted to go with buffet choice). Happy hour bartenders courteous.", "user": "mrsannnga", "date": "July 13, 2008", "id": 17825743}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I booked a 2 night three day stay here after receiving a gift certificate for a \"vacation in your own backyard\". I called and spoke to a manager about redeeming my gift certificate. I was told that I'd have to speak to Carol who was in charge of reservations. She had left for the day but would be in from 7 am- 4pm the following day. I called and spoke to Carol however there was a problem with the phones at the front desk and she very politely asked me to send all the info via e-mail. She promised she'd get back to me asap and would not forget me. Famous last words:) The next afternoon having still not heard from anyone I called and was told by Carol that there was no availability. Needless to say at this point I wasn't very happy. I then spoke to another manager who told me she would take care of the problem and while in the middle of the conversation Carol miraculously found my reservation. The manager asked me if I'd prefer a lanai view or an interior room. I chose the lanai on a previous suggestion from this site. The manager was very apologetic regarding the reservation issue and I accepted her apology as she was very helpful and sincere.", "title": "Not worth staying even for free", "user": "pab34", "date": "July 5, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 5.0, "location": 1.0, "value": 1.0, "rooms": 2.0}, "id": 17555509, "likes": {"liked": "— nothing", "disliked": "— dark, damp, musty room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Upon check in the staff was very helpful and even gave my husband and I vouchers for free drinks since we missed the free drink/appetizer event. When we found our way to the room I was very disappointed. In order to get to our room we had to exit the main hotel on an upper floor and go to an attached outdoor building that surrounded the pool area below. The pool was MUCH smaller that I expected. The lanai view was not what I expected as it was just a larger concrete area in front of the hotel door with 2 plastic chairs that were dirty and a small table. Upon entering the room I immediately wanted to go home. It was dark and damp. The furnishings looked fairly new but the bed spreads were more like worn out blankets with a native american design. The microwave was the tiniest I have ever seen and there was no natural light what so ever. The front room window opened to the walk way and \"lanai\" and the back window had a view of I-4. For those of you not from FL it is the major highway that runs through Orlando. I had asked several staff members on more than one occasion if this hotel was renovated due to my daughter's asthma and my acute allergies. I was reassured everytime that it was a few years ago. The only reason I did not go home was b/c I had promised my daughter that there would be a movie on the big screen outside. The weather held off and we were able to see the movie from our \"lanai\". The sad thing is that we probably had the best seats in the hotel. The next morning we could not find the \"do not disturb\" sign so we called the front desk to tell them we did not want our room cleaned. We had planned on spending the day at Seaworld since we were so close and then going home. When we came back that evening to check out our room had been cleaned. As locals we knew enough to take our valuables with us but as tourists in our area please remember to be careful. I was so astonished that people were allowed in our room! Needless to say we grabbed our suitcases and were more than appreciative to know we COULD go home and weren't stuck here on vacation.", "title": "Nice Hotel - But Expected More From An Embassy Suites", "user": "milkmaninflorida", "date": "July 3, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 17490814, "likes": {"liked": "— Large rooms and convenient location", "disliked": "— Upselling!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "My two daughters and I (ages 11 & 9) recently stayed at this property. Although the hotel is nice, we expected more from an Embassy Suites.", "title": "Will stay again!", "helpfulness": 1, "user": "InNeedofHelpPlease", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16969057}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Pros: The hotel is conveniently located to almost everything including the theme parks, restaurants and other activities. The rooms are large and clean. The breakfast was very nice with a ton of options to make everyone in the family happy.", "title": "Hey Chuck! Where were you last night?", "helpfulness": 2, "user": "irenekosto", "date": "May 9, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15857485, "likes": {"liked": "— family friendly!!", "disliked": "— no freezer- but we worked it out"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Cons: Upselling!!! First, the front desk lost our reservation for a King size room - we had to upgrade an additional $10 for two double beds. High speed internet service is $10 / day (I have recently stayed in Comfort Inns and the like where the service is free). We had several messages from the Sales Dept. trying to sell us on a future vacation package. Also, the snack options with the \"Manager's Reception\" are few and none (at least compared with other Embassy Suites) - but they had no problem trying to sell you food during the reception. The other con is that the movies are shown every other night - would have liked to have known that ahead of time.", "title": "We will be back!", "helpfulness": 2, "user": "atpatt", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15164353, "likes": {"liked": "— great deal, very clean!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "I stayed with my mother and two children ages, 4 and 7 for 6 nights at Disney. Overall I would recommend the hotel. The staff was very nice and accomodating. The shuttle buses to Disney were on time, (expect to tip the driver). They played movies on the shuttle buses for the kids. One thing to note is there is no early return on the shuttle bus from Disney. The earliest pickup was at 6:15 pm, so once we were there, we were committed to the entire day. Pizza Hut on site was a bonus! The pool was heated and lovely. Breakfast was really good, but on the busy weekend they ran out of everything including coffee and bowls. The staff just could not keep up with the volume. The housekeeping was good, except one day they just made the beds and did not vacuum or clean. I think the housekeeper must have been distracted halfway through. Having a refrigerator, microwave and 3 sinks made a big difference. My kids loved the squirrel and the little black kitten by the pool. No movies at the pool, I have been calling for the last several months and they keep saying the projector is broken. Hmm I would defintely stay again.", "title": "Good Value Near Disney", "helpfulness": 2, "user": "Austinrunnergirl", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 23065637, "likes": {"liked": "— Not expensive, convenient, nice", "disliked": "— Crowded Breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "If you are using a GPS - note that this hotel is 8100 Lake Street - not avenue. I booked through expedia and called and told them to update it (Expedia/TripAdvisor are same company)", "title": "If Self Drive --Double Check the Address !!!", "user": "dalcy3", "date": "December 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 22857158}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "I drove around at 1am on Lake Avenue.. and was super tired.. don't let this happen to you.", "title": "below par for an embassy", "user": "Bluelion137", "date": "December 8, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 22561527, "likes": {"liked": "— the pool", "disliked": "— the room and free breakfast ( that's why its free)"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The rooms are fine - no problems - comfortable.", "title": "Just Awful !!", "helpfulness": 2, "user": "SciProfessor", "date": "December 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 22350944, "likes": {"liked": "— The food service."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Breakfast is typical orlando breakfast buffet with orlando breakfast buffet 'crowd' - I managed 2 days and then had to go elsewhere... but I have to say this hotel has the friendliest short order /omelet chefs I've ever met - what a great crew", "title": "\"This is the best vacation ever!\"", "helpfulness": 3, "user": "CindyOB", "date": "November 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22056347, "likes": {"liked": "— The omlette chef!", "disliked": "— No free internet access"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 78, "average": 147, "very good": 293, "terrible": 31, "excellent": 334}, "aka": "Embassy Suites Orlando/Lake Buena Vista Hotel Orlando", "slim_ranking": 0.398176291793, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Our all-suite hotel is on the doorstep to the Walt Disney World® Resort. We offer a complimentary, scheduled shuttle to and from the Walt Disney World® Resort theme parks. With our complimentary cooked-to-order breakfast each morning, tennis courts, fitness center, and multiple on-site restaurants, we are a perfect location for your next Orlando, FL family vacation."}