{"user_rating": 4.0, "review_count": 272, "name": "Embassy Suites Bloomington", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This is an excellent hotel for business. Conference center is very comfortable. The staff go out of their way to make sure everything is perfect!! Shuttle to Mall of America and anywhere you need-great perk.", "title": "Great Conference Hotel", "user": "Ruth A", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161296735}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Nice, clean hotel. Staff is VERY friendly and helpful. Excellent food in the restaurant - enjoyed the walleye. Only 1 elevator has total ramp access - they direct you to it when you check in. Whenever you leave with rolling bag, use that elevator.", "title": "Good hotel, good location", "user": "donnaesca", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160979845}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The Good: Easy check-in and check-out, breakfast was great, geared towards business clients so not very loud during the week, easy access to freeway, restaurant and bar/lounge are good. Starbucks on sight is nice. They also offered a discount price because I am a teacher.", "title": "The Good, The Bad and The Ugly", "helpfulness": 1, "user": "bhhs0910", "date": "May 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 160977837}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The Bad: Staff not the friendliest. Not rude, just don't go out of their way to help or answer questions. Pictures make it look like a new hotel, not the case. Outside is \"dumpy\" looking but inside has been maintained better. Although breakfast was excellant, the Manager's reception left something to be desired. The free drinks was about it, maybe a few pretzels and chips.", "title": "Very Nice hotel with friendly hotel staff", "helpfulness": 1, "user": "deepcreek32", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160466741}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The Ugly: The web site says they have an airport shuttle. What it fails to say is it doesn't run all the time! We had to take a cab because our flight left in the morning too early for the shuttle to run. If this matters to you then don't book an early flight! They also advertise being close to the Mall of America. Lots of hotels closer, the airport Embassy Suites is much closer. This hotel is several miles away although by shuttle or car it is easy to get there whithin 10 minutes.", "title": "Nice hotel", "helpfulness": 1, "user": "Rhonda S", "date": "May 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160674467}, {"rating": 5.0, "title": "Great Experience!", "text": "My family stayed here for an overnight getaway. The accomadations were great. The breakfast was good. The pool was slightly chilly, but the kids enjoyed it anyhow. Got a great deal with an online code.", "user": "A TripAdvisor user", "date": "June 1, 2013", "id": 170168422}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Five of us stayed here on a girl's shopping week-end. We were very happy with everything. The staff was friendly and helpful. Their free breakfast was outstanding. We appreciated the shuttle to the Mall of America.", "title": "Very satisfied.", "helpfulness": 1, "user": "nob8", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162226987}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Everything was great! The bed was so comfortable (compare it to sleeping on a cloud!) and the room was so quiet; we couldn't hear any neighbors from our room. The hotel staff was wonderful! The best part is the view from the room to the lobby area; the hotel is so inviting when you arrive!", "title": "Fantastic Hotel!", "helpfulness": 1, "user": "Jeanne R", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162247532}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Nice property, with the typical ease of check-in/check-out, friendly staff, attractive lobby, complimentary airport and Mall of America shuttle service. Rooms and lobby clean and comfortable, although no fans in bathroom. Snack selection for evening reception not as good as in other Embassy Suites I've stayed in, but that is minor. Would recommend this property.", "title": "Great choice for Minneapolis area", "user": "Georgene B", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161397716}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stay at this Hotel every month for business. I am not the person who chose to stay at this Hotel, but I am glad we stay here. The parking is great, right outside the front door. Check-in is quick and easy. No need to move the car, we bring our bags in with us, because the elevators are just past the lobby. I always have a great night sleep, and I am impressed with the complementary hot breakfast made to order, in the morning. We use the pool and exercise room every stay. The staff are friendly and make me want to come back.", "title": "Keep Going Back", "user": "Lonnie C", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161397773}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I've stayed at this property multiple times over the years. It is a reliable stay. Good location, great breakfast, full service restaurant. My pet peeve is the uneven surfaces and stairs in the lobby area. A solid choice.", "title": "Old School Embassy Suites", "helpfulness": 1, "user": "EduardTravels", "date": "June 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 164330649}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Awesome hotel! Can't beat staying at Embassy Suites for the prices & ameneties they offer. We stayed the first weekend in May, four friends and myself. Our friend Sheri booked the hotel. The breakfast buffet in the morning was delicious - the line mvoed fast, there were enough places to sit & teh staff kept everything very clean. The managers reception from 530-730 was excellent. Food was good & drinks were better. We stayed on one of the higher floors so we wer able to look down in the \"courtyard\". We were concerned at first as there was a birthday party in the suite next to us but we didn't hear any noise. The beds were comfortable. The pool & hottub were nice. Only concern was there was some younger people messing around in the pool area. Playing on the handicap lift & they ahd brouhgt glass bottles into the pool area. Will stay here again - we plan to in the fall!", "title": "Spring Girls Weekend 2013", "helpfulness": 1, "user": "Kristine J", "date": "June 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164316673}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Fantastic Stay!!! I could not ask for more. The staff was friendly. The motel was clean and inviting. The rooms were very well maintained. I would recommend this hotel to anyone that wants a relaxing getaway!!", "title": "Weekend Getaway", "helpfulness": 1, "user": "Andrew S", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163844303}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This Embassy Suites, I believe, is one of the older ones in the Twin Cities. I have stayed here for over the last 20 years on and off. The property is well maintained and the rooms have been reasonably updated. The hotel offers comfort and a friendly staff. There is simply no issue here and parking is good. The area is quite despite being so close to I-494. There are restaurants in the area. The breakfast area is standard Embassy Suites but again well maintained and efficient. The breakfast staff is great. The hotel is clean and pleasant despite being an older model.", "title": "A Older Embassy Suite But Well Maintained and a Good One", "helpfulness": 1, "user": "kawidd", "date": "June 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163667620}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Second family reunion there in five years, and hotel hasn't disappointed. Nice, large rooms and a great lobby for gathering. Extensive breakfast and happy hour menus. Had snack in bar/restaurant and coffee from the gift shop -- both outstanding.", "title": "Extremely comfortable!", "helpfulness": 1, "user": "jeff6", "date": "June 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163519361}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at lot of Embassy Suites throughout the years. A reoccurring theme, is they need some updating. We love their managers reception and breakfast's, and they have great service. The Rooms and especially bedding needs to updated", "title": "Average", "user": "Stephen M", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 160670891}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We spent 2 nights here for a girls' birthday weekend. The property is beautiful- so much greenery. We loved the free drinks every night and free cook to order breakfast. Our room was nice and clean. My only complaint, if I have to give one, is to not charge for internet service. That's not a big deal though at all.", "title": "Great for a birthday weekend!", "user": "Laurie V", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159831514}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The edges of the carpets look like they have not been vacuumed for over a year. The bathroom could have been cleaner along the edges also. It was very loud and echoed through out the building with all the kids that were there for the weekend.", "title": "Please vacuum!", "user": "Deneen S", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 160667264}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I thought that the rate was reasonable as it included the free cocktail hour each night and cook to order breakfast. the hotel was clean and the main lobby and dining areas up to date. The restaurant was above average for a hotel brand and did a reasonable amount of business which was a good sign. The quality of the food was good and they had a great selection. I found all of the staff extremely friendly and helpful and made me feel like a welcomed guest. I will stay here again as I am in the area about 4-5 times/year.", "title": "Clean, great location and friendly staff", "user": "James M", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159254042}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We stayed at the Embassy Suites for a girls shopping trip. The location was great & easy to get to the Mall of America, local shopping and my favorite - IKEA! The young girls loved the pool & breakfast! We older girls loved having a seperate bedroom and the breakfast too!", "title": "Convenient - Great breakfast", "user": "Katrinca1213", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157082210}], "location": {"country": "United States", "city": "Bloomington"}, "stars": 3.5, "variance": {"poor": 20, "average": 50, "very good": 79, "terrible": 11, "excellent": 112}, "aka": "Embassy Suites Bloomington Hotel", "slim_ranking": 0.342105263158, "description": "The Embassy Suites Bloomington hotel near Mall of America is located close to many Bloomington MN attractions. Our complimentary shuttle provides transportation to the American Girl Store in Mall of America or Minneapolis St. Paul MSP airport just 5 miles from the hotel. Visit Nickelodeon Universe or the Water Park of America just minutes from this Bloomington, MN hotel. Unwind and refresh in our indoor pool, fitness center and whirlpool."}