{"user_rating": 4.0, "review_count": 575, "name": "Embassy Suites Hotel Los Angeles International Airport South", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The best deal at the LAX airport !! Great rooms - great breakfast - great free happy hours - great service !!! what else ?", "title": "NUMBER ONE AT LAX !!!!", "helpfulness": 2, "user": "PHIL-ADT", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106843247}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed 2 nights having arrived in LAX from London before heading to our cruise in San Pedro.", "title": "Great stopover location", "helpfulness": 2, "user": "HobartEssex", "date": "May 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 106518533}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Location is great for both, with shuttle bus from LAX. Tours to Beverly Hills & Holloywood are available.", "title": "Greatest hotel staff around LAX", "helpfulness": 1, "user": "HiltonDiamondMan", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 104963263}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "Breakfast was good, fresh and plenty available", "title": "Priced at right value", "user": "lorider11", "date": "April 20, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 104847603}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I stay in LAX airport hotels about 20 times a year, have tried all the hotels, and settled in here. The reason is the front desk staff and the happy-hour bartenders.", "title": "Excellent near-airport hotel @ LAX for the price", "user": "dooragan", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 104218789}, {"rating": 3.0, "title": "OK, but not the best", "text": "Not your typical Embassy Suites... The \"Spanish Hacienda\" look dates the place and is getting tired... The rooms feel like a cave since management has permanently locked the balcony sliding doors and painted the windows over.", "user": "Steve K", "date": "November 10, 2013", "id": 184286533}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The room was clean enough, but showing heavy wear and tear in the small-ish bathroom. So small , I guess, that they added a sink cabinet in the bedroom to help. And the ancient exhaust fan in the bathroom is waaaay overdue for replacement. You can find inexpensive models at Home Depot for $14 bucks that are far quieter than these. I could hear anytime my neighbor turned on their bathroom light and fan", "title": "Best place to stay for LAX", "user": "Cherie R", "date": "November 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 184125121}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Loud voices from the bar area carry up throughout the interior atrium until late hours at night, so using the front area of your room means putting up with a party atmosphere", "title": "Embassy Suites TLC", "user": "Edward R", "date": "November 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183604666}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "The free breakfast was decent, and the airport shuttle runs on time.", "title": "Quiet hotel close to the airport", "user": "MomLaxRef", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 183458008}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "OK place, but not great", "title": "What a pleasant surprise for an airport hotel!", "user": "Crasso", "date": "October 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183057910}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "This is a good hotel-great service, rooms are fine, street parking is easy. I stayed there for a whole week and was very satisfied. It is close to the airport, so the planes are right there, but you can't hear them in your room. Yes, it is definitely a little older but is kept up, with a friendly responsive staff that caters to your every need. Good place for families. People will always find something to complain about, I suppose. Don't worry about this place!", "title": "Ignore the bad reviews!", "helpfulness": 2, "user": "ETJ", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 103044529}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I've been coming to this property for years. Being the aviation nut that I am, this property has an ideal location with it's perfect view of the runway activity at LAX. The staff are always welcoming and pleasant. On my last visit, \"Manny,\" answered the phone, drove the shuttle to pick me up and then checked me in - - very nice guy! The suites are spacious, clean and quiet. The breakfast buffet is a perfect set up and never crowded. \"Juan,\" a staff member working the grill, always says hello - - another very nice guy! There was easy street parking right out front and a handy business center on the second floor. Just another pleasant stay which is why I keep coming back.", "title": "Always an Excellent Choice", "helpfulness": 1, "user": "N747PA", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102713121}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I arrived there late accompanied by my wife and three children after a long flight and was first greeted by a prostitute at the main entrance who I decided to ignore for the moment. Everybody was tired and we decided to check the rooms even though my wife was extremely skeptical and felt very unsafe. The place was very old and the rooms, sheets were very smelly…definitely not what I have expected when I chose Embassy suites. My wife even saw a female wig lying on the floor inside the elevator! The manager did not quite understand why we decided not to stay there even though it was like 2 am and felt it was absolutely essential to go looking for a hotel elsewhere…He even decided not to issue a refund! There is a separate charge of $25.00 for self parking so be aware. Please don’t be persuaded by the positive feedback that you might see in reference to this hotel and check all the negative feed back as I personally was fooled!!! If you are looking for a good night sleep in a clean and safe hotel this place is not for you! I Would never go back to this hotel and I feel sorry for anyone who end up there. It was a very stressful experience!!", "title": "“Old hotel, Dirty smelly rooms, and don't be surprised if you are greeted by a prostitute at the entrance!!!\"", "user": "Sam1234_11", "date": "March 27, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 101750007}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Area recommendations", "title": "Not so nice", "user": "pollypee", "date": "March 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 100366196}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Plenty of hotels in the same area a much cleaner, safer and even less expensive!!!", "title": "Good value, great food", "user": "wat'rlily", "date": "March 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99721874}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel is located so close to LAX you can see the airport. Then rooms are very nice although if you stay on the bottom floor very warm. We had maintenance in three times and still felt very warm. We had two fans blowing the whole time we were there. This is unusual and hasn't happened in the past. We have stayed in the same rooms in the past with no problem. In addition my husband thought he left his credit card while there and after calling to ask for them to check and let me know I received no telephone call with confirmation from either the general manger or the restaurant manager. Fortunately we found it but no thanks to the hotel management. We have stayed at this location many times for several nights and will do so again. I hope the level of our stay can return to five next time!", "title": "Very good but not as good as usual!", "user": "tammyu", "date": "October 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143245091}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We had to catch a flight out of LAX early so we did the \"Stay and Fly\" deal. We stayed the night before our flight at this hotel. We left our car at the hotel for a week and we took the shuttle back and forth from the hotel to LAX. The hotel has a package price for keeping your car for the week. Any days over the week are charged at $10 per day additionally. I was disappointed that we did not get one of the renovated rooms. The rooms are large with separate living room and bedroom. Ours was very dated. Also, we were supposed to have two queen beds but the beds were full sized - not queen The hotel is across from the airport so plane noise was an issue.", "title": "\"Stay and Fly\"", "user": "tammyu", "date": "October 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143070705}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "We stayed here with our 2 boys (12 and 15) for 3 nights mid Sep and 1 night in early Oct to break up the flight to and from NZ and the other states we were visiting in the US. We chose the LAX Sth rather than Nth hotel because of the sundeck - both have indoor pools and coming from winter, we wanted to be able to have some time in the sun. The courtyard leading from the indoor pool area was perfect with loungers, tables and chairs and a small grass area.", "title": "Highly recommend!", "helpfulness": 1, "user": "sp0t", "date": "October 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 142666580}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Gym next to the pool was well equipped and handy to our ground floor room.", "title": "Perfect for LAX layover for Family", "user": "SamBuzz", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 142609168}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "When arriving at LAX there is a ph nmbr to call for the free shuttle pick up,. When leaving, the shuttle departs at regular times outside the lobby.", "title": "Great Staff and Hotel", "helpfulness": 2, "user": "Nishan A", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142590116}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "On our way to Hawaii we stayed two nights in LA to visit family. The location of this Embassy Suites is perfect . The free shuttle to the hotel is run on time so no worries about missing a flight. The breakfast is included and delirious . The rooms are comfortable and very clean. My only criticisms are that the bed is too soft and they charge for parking. We can usually find a spot on the street so you can avoid the charge. We have stayed here four times and will continue when visiting LA.", "title": "Perfect for a quick stay", "user": "LauraB09", "date": "November 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 185087712}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I usually like this place. But not this time. The tub/shower DID NOT DRAIN. The internet DID NOT WORK in my room AND they charged me the $9.95 to use even though I'm a HH member too. What a ripoff!!! I was really disappointed especially since the bill came to about $170 for the night. Breakfast was pretty good but the salsa verde was a little off taste.", "title": "bathroom and internet", "user": "Asian660", "date": "November 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 185154887}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This was the first stay of a \"Hilton Honors\" trip in California. We arrived late in the evening, and I booked a hotel near the airport for car rental and travel down the coast; in other words, convenience. I booked an upscale suite. Notably, there was a large smear of some substance across one cabinet door in the bathroom. May have been cleaning solution - hard to say, but for me, if the bathroom is questionably clean, I wonder what I am sleeping on. Check in was annoying. We were tired and waiting behind another person. A party behind us was greeted by a second clerk who appeared from behind a column, never even giving a nod to us after we had been waiting to check in for 7-8 minutes. Don't they know travelers this close to a major airport are tired/weary from travel and would like to be welcomed?", "title": "Pit Stop Only", "user": "pshop", "date": "November 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 184848157}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Breakfast was horrible! Powdered eggs, wispy thin cold greasy \"strips\" of (bacon??) and hashbrowns - white, cold and swimming in cheap institutional grease. Gross!", "title": "Always hospitable", "user": "James C", "date": "November 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184748531}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "The hotel is tired and dark, circa 1980. Our room had been recently redone, but one steps out into the hallway onto some pretty tired carpeting; another pet peeve of mine, especially around children and pool play. I would not stay here again nor would I recommend this hotel for anything other than an extremely short pit stop if everything else close to the airport was booked.", "title": "Great place to stay on business", "user": "Kristin G", "date": "November 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 184548079}, {"rating": 3.0, "title": "Sleepless in LA", "text": "This was a one night stay before leaving on a longer trip throughout CA. The check in was fine and we were given one of the newly renovated rooms. Upon arrival I wanted to make use of the complimentary airport shuttle. After watching shuttles for all other hotels come by I finally called the hotel. After the phone ringing for about 3min someone finally answered and advised me the shuttle would arrive in 20 min. Or less. It did finally arrive where the driver advised me it was an as needed service. We ate dinner in the restaurant which was average and went to bed, or at least tried. The noise from inside and outside was extreme. You would think an airport hotel would have solved the problem with traffic and aircraft noise. It was loud all evening, night, and morning. The morning was even louder due to loud music coming from the ground floor. Breakast was good but overall not a hotel I would choose again.", "helpfulness": 1, "user": "EP05313", "date": "December 17, 2012", "id": 147582030}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Overall, a comfortable week at this hotel. Here on business. Here's a brief list of \"highs\" and \"lows\":", "title": "Comfortable stay; no major problems", "helpfulness": 1, "user": "AL L", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147268285}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "HIGHS", "title": "stay at hotel", "user": "Eric T", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147072811}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "- Location: close to airport and good restaurants in El Segundo.", "title": "Great place to stay - see tips below", "helpfulness": 3, "user": "ColoTravellers", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146647289}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "- Free airport shuttle; even running at 4 am!", "title": "noisy hotel", "user": "roxierowe", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 146623764}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "When I checked into my room, I noticed that the room had not been cleaned. When I mentioned this fact to the woman at the desk (Sharon), she said \"don't worry about it. They'll get around to it.\" Very snotty attitude. Had she been able to get away with it, I am sure she would have added \"you stupid man.\" I would have thought that they would \"get around to it\" PRIOR to my checking in.", "title": "Attitude is everything", "user": "motospyder", "date": "October 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 142574031}, {"rating": 2.0, "stay_parameters": "Stayed October 2012", "text": "I have stayed at this hotel several times and each time the service gets worse. There were a few other issues, but the attitude of the woman at the desk was enough for me to NEVER stay there again.", "title": "Business trip", "user": "Zel-Kel", "date": "October 10, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 1.0}, "id": 142521863}, {"rating": 1.0, "title": "dont try and change your departure date", "text": "Hotel undergoing renovation, offered room over renovation, noise and vibration unacceptable, front desk said it would stop at 7, admittedly didn't say whether that was am or pm. Anyway after an hour demanded different room and asked why they put me in that room, answer, we have to sell all rooms, so we are numbers and Hiltol can't be bothered with customer care. I got moved but I won't be back", "user": "Martin M", "date": "October 9, 2012", "id": 142428339}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "someone below has already commented on the dingy rooms and the feeling of being in a 1 start hotel when in the rooms so i wont repeat this, however I will warn you all to check your cancellation policy. As a business person sometimes I need to check out early and move on yet here I was rudely told that I had to pay a $50 cancellation fee for leaving early even though I was gving them 2 days notice. So this was not a situation of leaving now and sorry but leaving on THursday instead of Friday and telling them on Tuesday", "title": "great staff", "user": "sasham648", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142145376}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The way they told me made me think that I would never give them another dollar and I then did check out immediately. Not one more dollar to this hotel. Just poor poor customer service", "title": "Absolutely zero problems", "user": "cbce1pjb", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142064405}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "The suite was standard for Embassy Suites. Unfortunately the ironing board was badly stained and the TV in the bedroom didn't work. The front desk was not particularly responsive when told about these things.", "title": "Great location for LAX but just OK hotel", "user": "travchef", "date": "November 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 185705517}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "The nicest employee was the shuttle van driver - extremely welcoming and friendly.", "title": "Rooms remodeled since last visit", "user": "Marius40", "date": "November 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 185640189}, {"rating": 5.0, "title": "Touch of Class with Comforts of Home", "text": "OK breakfast.", "user": "ForeverVixxen", "date": "November 23, 2013", "id": 185595586}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "I have stayed here a few times in the past. I like the location in that it is not on Century Blvd with all the other hotels but off Imperial Highway just south of the airport. As with most Embassy Suites, the cocktail hour(s) and breakfast with cook to order omelets is a great selling point.", "title": "Good facilities, busy hotel", "user": "mittyLaJolla", "date": "November 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 185412452}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The staff was friendly and despite being an airport hotel you barely hear the planes. The only reason to not rate it higher is my two usual bugaboos; parking and internet. One nice thing at this location is there is plenty of free parking right outside the hotel (read the signs) otherwise you pay a pretty penny to park in the garage. I bring my own Mi-Fi card so I don't have to pay for the internet, but unless you are gold or higher you have to pay. Even the one star Travellodge around the corner has free internet. Never ceases to amaze me.", "title": "Excellent location in LA", "user": "colt07", "date": "November 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 185096042}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I needed a hotel close to LAX, I prefer suites, and I like free breakfasts. This place fit the bill perfectly. Not a particularly new place, so the style was a bit dated, but the facilities were all just fine, and the staff was very friendly and really provided excellent service. My room was a standard suite, with a large separate living area, and all-in-all about twice as big as most hotel rooms. The free cooked-to-order breakfast was great.", "title": "Great rooms, great service", "user": "Paul99501", "date": "June 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 112644258}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "My fiance, myself, and our three kids needed a getaway so we decided to head South and as usual, we stayed in this hotel. It's only about a 10-20 minute drive (depending on traffic) to Venice and Santa Monica beaches. We took our kids to the aquarium down in Long Beach (which was really awesome! and for $115 you can get a year membership for a family) and it was only a 30 minute drive.", "title": "Awesome Customer Service", "helpfulness": 1, "user": "packyourheart", "date": "June 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111683054}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "We checked into the hotel Friday afternoon and went up to our suite. The suite was situated different than the other suites I've stayed in at this hotel and it seemed smaller. The hotel is very family of five friendly as there are rooms with two full beds and a pull out bed in the couch, which makes for comfortable sleeping arrangements. The actual bed is pretty comfy and my 8 year old didn't complain about the bed in the couch. I had two complaints about the suite (and in the 10 years I've been staying in this hotel on beach trips, I'd say that's not bad) the floor in the first suite was FILTHY! All our feet were dirty from walking on the carpets, and it was really loud because we were right over the hotel bar and right over the driveway down into the parking garage.", "title": "Warm, Professional Reception and Outstanding Staff", "user": "bschwartz123", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110587018}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "In the morning I went down to the front desk to ask if we could be switched into a different suite and explained my reasons to Lupe (the woman working the front desk), she very kindly apologized, gave me a discount on the first suite, and switched us to a different room. No hassle.", "title": "The place to stay near LAX", "user": "BluesDoctor", "date": "May 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 109146753}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "You just don't find customer service like this anymore. Thank you Embassy Suites for giving us, once again, an easy, affordable family getaway.", "title": "Embassy Suites LAX South", "helpfulness": 2, "user": "TravelerJackie", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108647168}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This is a really good choice for a family as the room has double beds and a sofa bed so it can sleep 4-6 and the breakfast is wonderful, made to order and fresh. The hotel is recommended on the Los Angeles travel tip sheet on prasadandassociates.com The best thing about this hotel is that it is so close to the airport (get rest immediately after a long flight), it is close to the beaches and it is very close to a wonderful Whole Foods market and some other good places to eat.", "title": "A good choice close to the Airport", "user": "PrasadandAssociates", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146525782}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Stayed for a business trip at nearby El Segundo facility. Hotel is amazing in appearance, definitely lots of character. BUT beware, it is undergoing a full room renovation and there is construction happening during the day and you can hear the debris being thrown away out back as well as smell the paint. BUT, the hotel, IMHO, has done a nice job at keeping it to a minimum and to segment it around the hotel. They told me of the construction and put my room at the far end on the top floor. Make sure to ask for a newer room. I was on top floor (5th) and construction was then on the 3rd floor. Renovations are really great...comfortable, pleasing decor. Onsite breakfast in the morning is nice but a little slow on the specific omelet ordering...most days, skipped that and hit the buffet. Onsite restaurant was good (ordered via room service) and parking is onsite (expensive at $24 per day but underneath the hotel. You can park on street for free.", "title": "Very nice place to stay near the LAX airport", "user": "MikeGehringer", "date": "November 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145746082}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I booked a room as a hotwire deal for the night before my medicine board exam early October 2012. Upon arrival to the hotel I was shocked to learn that there was construction and it was impossible to get a room away from construction noise because construction was \"everywhere\" at the same time, per check-in staff. Moreover, construction would continue 24hrs a day, so I was told not to expect quiet at night. There was no indication of construction on the hotwire site. Hoping to make the best of the situation, I went into the room, thinking perhaps I could stay in the bedroom and study with headphones on and sleep with earplugs. 5 minutes later, however, loud knocking ensued and nearly shook the room. I got on the phone with Hotwire, and after wasting nearly an hour, was rebooked to the Hilton through another hotwire deal (wouldn't rebook me directly, and insisted I pay the cost difference).", "title": "Beware 24hr construction throughout hotel", "helpfulness": 3, "user": "LucyD7", "date": "November 4, 2012", "detail_rating": {"value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 144513405}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Agree with other reviewers about strange lack of windows and bedroom \"glass doors\" made of frosted glass and impossible to open. Felt like some sort of prison.", "title": "Nice enough for a hotel close to LAX", "user": "mzungu f", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143729348}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Embassy, you should be paying people to stay in your hotel through your construction, not the other way around. Or just have the dignity to shut down!", "title": "Good value hotel", "user": "Ian F", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143652701}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Stayed here coming and going out of LAX. Building is older but very well maintained and the staff is extremely polite and friendly. I would definitely come back again.", "title": "Older facilty but clean and very courteous staff", "user": "Mom2both", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99678518}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We recently stayed here one night before a cruise. As instructed, we called from the airport and a shuttle was there within 15 minutes to pick us up. The hotel is pretty inside and out. The staff are welcoming and professional. Our room, while dated, was very nice - spacious and comfy. Upon arrival it was warm in the room. The gentleman that helped with our luggage advised we should turn down the temperature on the thermostat as we were heading out for dinner. Unfortunately, when we returned, the room was hotter than when we left.", "title": "Nice for a Quick Stay", "user": "SCSTravelJunkie", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 99176972}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "We called the front desk and were told due to the cold temps, the hotel was set to \"heat only\" and currently did not have air conditioning. They advised that we shut off the thermostat as it had only been blowing in hot air the entire time we were gone. Not good! They offered a box fan for the room which helped after we opened the balcony doors. However, this property is directly across from the airport via a busy street. Noise and more noise. Luckily we had come in on a three time zone flight and were exhausted enough to make due.", "title": "50/50 Chance of staying in a cave", "user": "desertescapee", "date": "February 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 96676962}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The following morning we enjoyed one of the best breakfasts we've had during our travels. The lines were long but moved at a decent pace. The staff did an excellent job of keeping the tables cleared and clean.", "title": "Embassy Suites, SAX : Home Away from Home", "user": "roadandtravel", "date": "February 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 96321780}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Parking for this property is $23 per night. However, if you're willing to park on the street directly in front of the hotel, this is at no charge but spaces are very limited.", "title": "Location was not as good as expecting, but they make up for it", "user": "Rainy0", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 94537101}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We had a 12 hour layover at LAX while on our way to Tahiti so we grabbed a room to catch a nap and freshen up before the next flight. This place was great. Very clean and comfortable room. The managers special was a treat. It helped us to get a little loose before the flight. The free shuttle to LAX was the real selling point of the stay. Great driver by the way. I would stay here again if I were in the area. They also have a great staff from the registration desk to the bartenders", "title": "12 hour lay over", "helpfulness": 1, "user": "sigs99", "date": "November 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 185969956}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Excellent hotel, very clean rooms and bathrooms, has evening Happy Hour reception for free, fast in-room wireless internet ($9 / day) , good free breakfast, good dining room, business center with printers, indoor pool, excercise room. Well maintained facilities. Very close to LAX and car rentals counters, I-5, I 405. - Greg", "title": "Excellent Hotel, Very Clean Close to LAX Airport", "user": "Thelma P", "date": "November 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186034561}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Why charge for parking when you don't have space available outside the hotel. If you don't get there early, space is horrible. So, make sure you don't move your car at any time, or you will be out of luck.", "title": "Parking is horrible.", "user": "Ambra L B", "date": "November 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 1.0}, "id": 185921502}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Let me say that this is only the second time I have stayed in a hotel in El Segundo. Most of the time I just stay at my family's house that is three blocks from the Embassy but this trip the house was booked with family, so, we chose to stay at the Embassy. I had a couple issues but I will knock out the selling points first.", "title": "A mile from heaven", "user": "cuttershelper", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185788191}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Location-Thus the reason for the title of my review, the beach is about a mile west of this location. Being just due south of LAX, it is 5 minutes from arrivals to the hotel, I think they have a shuttle, I did not use it if they do. 30 minutes via 105E to 405N to Hollywood, the Getty and the California Science center(which would be 105E to 110N) where you can get up close and personal with the Space Shuttle Endeavor. Beach cities..Manhattan, Hermosa, Redondo are just minutes SW of the hotel. Venice is 15 minutes via Sepulveda to Lincoln to Washington. Disneyland, Knotts, etc are a bit east inland. Long beach, Aquarium of the Pacific (highly recommended) and the Queen Mary took us about 20 minutes via the 105E to the 405S to the 110S. Gotta go there, Long Beach is a great city to visit.", "title": "A fine hotel", "user": "cuttershelper", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185921934}], "location": {"country": "United States", "city": "El Segundo"}, "stars": 3.5, "variance": {"poor": 43, "average": 94, "very good": 198, "terrible": 20, "excellent": 220}, "aka": "Embassy Suites El Segundo", "slim_ranking": 0.6}