{"user_rating": 4.0, "review_count": 720, "name": "Embassy Suites Deerfield Beach Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "Hotel was great. Views from my room and others were great but there are some limited or non-view rooms. Spacious rooms with two bathrooms. Beach outside of property not that great but great beaches nearby. There aren't any shops/restaurants/bars really close to hotel.", "title": "Close to Meetings", "user": "Jerald D", "date": "December 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 188104657}, {"rating": 3.0, "title": "Not worth the $", "text": "I stayed here with family members for a wedding.", "helpfulness": 1, "user": "chrisy r", "date": "December 9, 2013", "id": 187207977}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Pros:", "title": "over the Top excellent", "helpfulness": 1, "user": "William M", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187238274}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The hotel's location is ideal, across the street from the beach.", "title": "Great location/Staff.... Horrible beds/AC", "user": "Gary P", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 186965878}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Rooms were spacious and clean, had a mini and fridge. My room didn't have a real balcony as it overlooked the pool. Get a corner room.", "title": "Don't accept room near elevator!", "user": "embee62", "date": "December 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 186881664}, {"rating": 3.0, "title": "It's ok but not worth the money", "text": "We had a family wedding near by,everyone stayed here", "user": "Beachlovers941", "date": "December 1, 2013", "id": 186466773}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Nickel and dime you after charging top dollar for the rooms the AC in our beach front room was so loud we did not use it ,have to pay to park your own car 18.00 per day ,have to pay for wifi really !!! Took them 6 hours to get our room ready .The staff was good place was clean but check around lots of places to stay", "title": "Heaven", "user": "Sandy R", "date": "November 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186018271}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "When we walked in the room, we saw Heaven from the balcony. Fantastic view, wonderful room with TWO bathrooms! The staff couldn't have been more pleasant and professional. Check in was a breeze, the pool was warm, the Manager's Reception was awesome as was the bar tender and all the staff. The breakfast with made to order omlettes...wow...my kind of breakfast! The beach was absolutely beautiful, although a bit short from sand to water, but just a beautiful beach with clear water. The Embassy has always been First Class wherever we've stayed and I hope to visit Deerfield Beach again.", "title": "Very Statisfied", "user": "Calixto M", "date": "November 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 186034517}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "The Happy was great and so was the complimentary breakfast. The hotel was very clean and the rooms were very nice. The bed could have been a little more comfortable, but my husband loved it. it is right across the street from the beach and had a very nice pool, even though we did not go in it. The pool is heated.", "title": "Favorite Deerfield Beach / Boca area hotel", "helpfulness": 1, "user": "Darlene C", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185921550}, {"rating": 2.0, "stay_parameters": "Stayed November 2013", "text": "The hotel is conveniently located and within walking distance of several nice restaurants. The rooms are spacious and the property is right on the ocean. The included breakfast buffet is the best in the area. I wish we were able to take advantage of the happy hour!", "title": "Hotel had lovely views of beach but customer service needs improvement", "user": "AnnJefferson238", "date": "November 24, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 185678589}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "It is \"tired\". Needs a facelift. Location is good but rooms aren't anything to write home about. There is always a problem with the reservation upon arrival. The last three years, we had to wait to move to a decent room. Why do guests have to pay for parking when they are staying at a hotel. That is ridiculous and chair rentals on the beach........", "title": "Just okay", "helpfulness": 1, "user": "Lynn B", "date": "November 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 185465693}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "My husband and I had a wonderful stay at this resort. the only reason I gave it 4 stars is the size of the beach. the beach is very small and the hotel charges you $12.00 a day for a beach lounge chair. The breakfast is OK and there were plenty of choices. We loved the managers reception with munchies and free drinks in the evening. Everyone at the resort was pleasant and helpful. the location was great. Restaurants an easy drive away you could even walk to some. My husband enjoyed walking each morning on the boardwalk in front of the hotel.", "title": "fun at the beach.", "user": "nanaellie629", "date": "November 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185365321}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "Got up to go to the bathroom in the middle of the night and the tack strip to the carpet had nails sticking which cut my foot! Besides that a great hotel. Just unacceptable that room was in sdrvice ..", "title": "Step on nails in the carpet.", "helpfulness": 1, "user": "stamps1000", "date": "November 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 185240796}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "I have been coming to Embassy Suites with the family for about 15 years, it's a great location, very clean, I like the 2 room suite with 2 bathrooms, great for a family, the breakfast and evening reception is a great perk.", "title": "pre-cruise hotel stay", "helpfulness": 1, "user": "Domenica S", "date": "November 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185155767}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Our two room suite was very spacious for a family of 5. The two bathrooms came in handy with teenage daughters. The managers reception was relaxing and enjoyable as well as the over the top breakfast.", "title": "Spacious rooms", "user": "Leah F", "date": "November 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 184843898}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We stopped patronizing this property years ago because of unfriendly, poor customer service and insane, rude holiday crowds. Decided, however, to return because there are three of us and the rooms have two bathrooms, we arrived before the holiday crush (December 18), and the rate was comparable to other suite hotels (or to booking two rooms). So...There is no Embassy Suites atrium and check-in is an island in the middle of the lobby - nice touch. Rooms are large for Embassy Suites and, as mentioned, there are two bathrooms. As HHonors Gold (and the date of arrival),we were upgraded to top floor, full ocean view. The pool area is good for sunning and there is easy access to the beach. Parking valets - yes, you pay for self or for valet parking - front desk, housekeeping, and breakfast staff were friendly and helpful. Broward County declared a boil water emergency during our stay and the hotel handled it calmly and with prompt notification; unlimited bottled water was offered and available. Yes, the hotel is showing its age. By Friday night the holiday travelers arrived and the heads down, rude, avaricious, greedy breakfast buffet crowd was as we remembered. Rooms have a refrigerator and a microwave. Bathroom lighting is poor. Overall, this property redeemed itself to us and if we can beat the crowds again we will surely return.", "title": "Our Return After Scores of Stays Elsewhere", "helpfulness": 2, "user": "DrSGPrice", "date": "December 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 188367380}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "This is an excellent hotel and for me the location was perfect for my business trip and plan to stay there on each trip. The hotel has very clean rooms a friendly staff great breakfast and a cold beer after work.", "title": "Looking forward to my next stay", "user": "James O", "date": "December 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188419890}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "I complained to the manager about the quality of my room and he literally shrugged it off. Room was old with stained carpet. I left my phone charger in the room and it took three calls to locate it. They didn't even offer to mail it to me! The view was not direct ocean. The breakfast is typical institution style food. The only thing impressive about this hotel is the lobby.", "title": "Horrible Customer Service", "user": "Trish R", "date": "December 20, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 188156613}, {"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "My room had stains all over the carpet with a view of the roof below. I spoke to the Manager about the quality of my room. He had a condescending, nonchalant attitude to the point of being rude. Before you give them your credit card, check out the room. If you think starring at a dirty roof is an oceanfront view, then this is the place for you!", "title": "Customer Service HORRIBLE", "helpfulness": 1, "user": "Patricia Z", "date": "December 20, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 188185698}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "the hotel was ok, resturant stuff was not helpful we wait for like 10 min to get are order and then another half hour for are food. and seem to me the hotel stuff was not that friendly most days. the bathroom shower had hair on the floor and the room had a funny smell to it. the beds were so uncomforable you couldn't sleep at night. It was nice of the stuff to bring a plate of cheese and wine to the room for my mom birthday.", "title": "xx", "user": "Cathy R", "date": "December 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 188185903}], "location": {"country": "United States", "city": "Deerfield Beach"}, "stars": 3.5, "variance": {"poor": 53, "average": 103, "very good": 251, "terrible": 34, "excellent": 279}, "aka": "Embassy Suites Deerfield Beach Hotel Deerfield Beach", "slim_ranking": 0.238095238095, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The only oceanfront Embassy Suites in Florida, featuring a tranquil two-mile long beach, 244 completely renovated suites, over-sized pool with Jacuzzi tub and fitness center. BT's Oceanfront, a new fine dining restaurant, and Spa950, full service-health and fitness spa, complement the tropical destination. Comfortable two-room suites have plenty of room for working or relaxing, plus wireless internet access, complimentary full cooked-to-order breakfast and two-hour Manager's Reception each evening with your choice of beverages."}