{"user_rating": 4.0, "review_count": 361, "name": "Embassy Suites Boston / Waltham", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I just stayed at the Embassy Suites hotel in Waltham and had a wonderful time. The room was clean, modern and updated. Breakfast was included, and was very good. I would highly recommend this hotel!", "title": "Embassy Suites - Excellent", "user": "KLMBedford_MA", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118089000}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed here for 3 nights in July for vacation. Short drive to Boston. Spacious rooms, quiet. Fabulous breakfast. Would highly recommend to all.", "title": "Fabulous", "helpfulness": 1, "user": "Marico810", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118035498}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Cooked to order breakfast was easy and good, except Saturday when the crowd slowed things.", "title": "Nice stay", "user": "tlccva", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 118007179}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Indoor pool area was nice.", "title": "Highly recommended hotel near Boston", "user": "musiclady17", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117791250}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Rooms are large.", "title": "Always a Great Stay", "user": "zen3344", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117749806}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I wasn't aware of the renovations when I booked the hotel on-line via the Hilton website. The main entrance is blocked, so you have to enter through the side door. No luggage carts available and there was only one person at the desk to help with anything. We checked in and were given a room on the 7th floor. The room was clean, but with outdated furniture and tv. Beds were very comfortable and we slept well...until we were woke up at 8am to hammering in the ajoining room and loud banging on the ceiling above us. It continued all day, along with a paint smell from the atrium, where they were painting the beams. The breakfast was ok, but just too expensive at $15/adult and $10 per child. We didn't eat much and my one child only ate an apple, but was still charged $10. There were a lot of families and kids running around, as there was a bat mitzvah in the lobby on Saturday night. Wifi was an $11 extra charge. All in all, this was not a relaxing stay, and I would not stay here again. In the immediate area, there is also a Hilton Gardern Inn, Courtyard Marriott and Westin hotel. I would stay in one of these instead.", "title": "Renovations - No way to avoid the noise, mess or smell.", "helpfulness": 2, "user": "Knows", "date": "March 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 99313031}, {"rating": 1.0, "stay_parameters": "Stayed March 2011", "text": "Whole family got rudely awakened by construction on the floor above us at 7am on a Sunday. Unacceptable in the hospitality industry; they need to get this right (timing of work) or else just shut down the hotel and finish the renovation. Would NOT recommend right now, and if management isn't detail-oriented enough to realize construction at 7 am may not be a loyalty-builder among guests, then you might imagine what else they might overlook.", "title": "CONSTRUCTION NIGHTMARE", "helpfulness": 3, "user": "dmwh", "date": "March 6, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 99094309}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "When I made my reservation, I was aware that the hotel was under renovation. I never dreamed that they would stick me in a room, directly under construction, with sawing hammering, and drilling going on. I complained, and got another room. I found out later, six other occupants did the same. Fine.The front desk said they would bring the new keys up, so I waited for 35 minutes. Called again, and was told he had no one to deliver the keys. So, I went down to the from desk to retrieve them. I accidentally left a robe in the first room, and asked if it can be delivered to my new one. They did, but 26 hours later. All in all, the second room was nice, although they don't know much about service. Beware until renovations are completed!", "title": "What a mess!", "helpfulness": 1, "user": "Baer09", "date": "February 21, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97493114}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We had three grandsons for the weekend and decided at the last minute to book a room at the Doubletree in nearby Waltham, MA for an overnight. We arrived at 4:00 p.m. and enjoyed every minute until we left at noontime the next day. The hotel is currently undergoing a huge renovation, but except for a temporary front entrance, it did not interfere in the least. Our primary focus was spending hours swimming in the very large and clean heated pool. There is also a good sized hot tub. There were enough children there for it to be a fun place, but not too overcrowded. There seemed to be a lot of families and groups with children there.", "title": "Great grandparent/grandsons overnight experience!", "user": "PatC330", "date": "January 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 94962557}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The restaurant had a good breakfast with many choices and was well run, clean and the help was what they should be....very helpful! (and cheerful). The front desk was especially accommodating when I had a slight misunderstanding of our package plan. The manager handled the problem very well and to the satisfaction of all. I understand that the wifi is not free; but that was not an issue for us.", "title": "Great Service!!", "helpfulness": 1, "user": "travelsoften12", "date": "December 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90231186}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We just stayed two nights at the Waltham Embassy Suites, with 4 guests and two rooms. Overall the stay was just average. The breakfast buffet was not as good as other Embassy Suites we have used (Portland Maine for example), and internet access was extra...very annoying for the cost of the room. The bathroom was low on supplies. The restaurant is pricey...but we did not eat there, so can't comment on quality. The staff was helpful, but not great. The bed was very comfortable. Overall a very average experience, not up to our expectations.", "title": "Average Value", "user": "MidMaine", "date": "November 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121033267}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "This is an average Embassy Suites hotel. It has a living room with a love seat and chair, a work desk and a flat screen tv. The bedroom area, which is pretty small, has a comfortable bed with a flat screen tv. There is also a wedbar area with a small refridgerator and a microwave. The room was clean, the bed was comfortable, the staff was friendly.", "title": "Average Embassy Suites", "user": "RondaJS", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 120891357}, {"rating": 1.0, "stay_parameters": "Stayed November 2011", "text": "As a Diamond member of Hilton Honors I spend a great deal of time in Hilton properties. This is the only Embassy Suites I have encountered that did not offer free alcholic drinks during the nightly managers receptions (they offer dry snacks and non-alcholic beveraged only). In addition during my stay the restaurant was closed...which was an inconvience.", "title": "Brilliant Hotel - Shame about the Management", "user": "kerrybda", "date": "November 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 5.0}, "id": 120887706}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I would most likely choose another Hilton property upon my return to the area.", "title": "Typical GREAT Embassy Suite", "user": "Mark W", "date": "November 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120577685}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "I stayed at this hotel for a training course and chose this hotel as it was the closest to where I needed to be. On the first day the free shuttle dropped me off at the wrong building (which is only 1/2 mile away). This continued through the week. The shuttle service is so disorganized and always late that i actually was helping the driver with where people needed to be dropped off by day 2 and I've never been to Waltham. I would book in the shuttle half an hour before I needed to be somewhere 5 minutes away just to get there on time.", "title": "Fantastic", "user": "Bjjdiego", "date": "November 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120530376}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We have just returned home after a stay here and it was great. The staff was friendly , The ambiance when walking in was great, you could tell that the hotel was taken care of. We loved the entire set up of the hotel. When we got to our room it was clean and neat and when we saw that there was a sitting room apart from the bedroom, we were pleasantly surprised especially traveling with two boys. My husband and I could sit and chat while our children slept. The manager's special was a sweet treat. The front end staff was very friendly, recognized us from the day before when we inquired about doing a tour of Boston. When we returned from the tour she asked how it was. The free breakfast bar was fantastic. They offered made to order omelette's, pancakes and french toast along with eggs, sausage , bacon and home fries. a cold bar with fresh fruit yogurt and pastries. The value of the room was great. The travel into Boston was easy and not to far. We can't wait to return.", "title": "Great Place to stay", "user": "Pam F", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117110042}, {"rating": 3.0, "title": "Good Value for Family Travel", "text": "We stayed in this hotel on a trip to Boston. Staying in the city was too expensive for our family of six. We had a great rate on this hotel, we booked through expedia for $75 per night lower than the rate on embassysuites.com or the front desk rate. The rooms are nice, the hotel is quiet with a good mix of families on vacation and business people. The breakfast was great and had many workers so the line was never long. The manager's reception was nicer than any other Embassy Suites we have used. The pool was good and there were always plenty of towels. If you cannot stay in the city of Boston, this hotel is a good alternative, it is close to the highway and the drive to the city is very easy. Just make sure you have toll money. My only criticism is that the internet is $10 for 24 hours use. There is a business center for free internet but most hotels offer free internet, even other Hilton family hotels. I would rate the hotel higher with free internet. We did not pay for the internet, I used the business center. Our kids, ages 2-13 loved this hotel.", "user": "athomemom", "date": "August 21, 2011", "id": 117049047}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Our family stayed here on a trip to Boston. We appreciated being away from the bustle and crowded conditions in downtown Boston - the lower cost was a bonus. The room was comfortable, and the amenities were plentiful and well-maintained. Most important, the customer service was outstanding. Everyone was pleasant and eager to assist, and addressed our issues (such as poor WiFi service) promptly and efficiently. We would definitely stay here again.", "title": "Pleasant Stay, Great Customer Service", "user": "HighlandParkCrew", "date": "August 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 117036706}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Stayed here for a night with my family. I have two young kids the stay was very comfortable. We had a good night's sleep and good choice of menu for breakfast. The rooms were clean. If I have to go back to this area will definitely consider to staty here again", "title": "Comfortable Stay", "user": "KK7275", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 116955757}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Roomy and clean accomodations, good and full complimentary breakfast, manager's reception, friendly staff, close proximity to Boston and its suburbs, I95 and the Mass. Pike. No negatives- highly recommended.", "title": "An excellent suite hotel", "helpfulness": 1, "user": "jodon", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116952204}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My husband and myself attended a Wedding at this hotel. The ceremoney took place in the atrium, what a beautiful setting.The reception was in the ball room with the most magnificent chandeliers I have ever seen, it made the whole room glisten. The service and food was superb! Everyone was friendly and helpful. I would stay again in a moments notice. Makes you want to get married all over again. It was a beautiful setting. Everything was perfect.", "title": "The most beautiful wedding !", "user": "myracol2003", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117512644}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at the hotel for a family wedding. The wedding was wonderful, the rooms were beautiful and very clean. Breakfast was delicious, we enjoyed the pool & the hot tub. Couldn't have asked for a better stay.", "title": "Loved it!!", "user": "Karen K", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117499497}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We went to a wedding this past weekend and everything was perfect, from the food to the service to the atsmophere. The room that we stayed in was clean and elegant. We could not have asked for more. Then the next day to have a complementary breakfast just topped our stay off. I would recommend staying at the Embassy Suites to everyone.", "title": "Wedding Reception", "user": "agnes5185", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117496604}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I have stayed here a number of times and the staff and management are excellent. It is newly remodeled and very clean. The restaurant has excellent food. The breakfast is free and has a huge selection of cooked to order as well as cold items. I have stayed here mainly for business, but have taken a few trips for pleasure and it is also a great hotel for families. You will not find another all suite hotel like this in the Boston area.", "title": "Best Hotel in West Boston for Business", "user": "smcconnell", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117424678}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Hotel was very clean with a great staff. Room was very new and bed had a great mattress. TVs in suite and bedroom were flat screen (non HD). Business center had 3 computers which functioned ALL the time; ditto for the printer. The fitness center was surprisingly large with great equipment. Managers reception was OK; morning breakfast was definitely packed. Best part of the hotel for the family was the pool and spa....quite large with several families. Final caveat for this hotel was it's proximity to the T line (Riverside and Wooland stations), Parked the car at the station and did not have to fight the traffic going into Boston.", "title": "Great hotel with perfect location", "helpfulness": 1, "user": "MarlboroDude", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117420463}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Just come back from boston after staying in the embassy suites with my parents and kids. Cannot say enough good things about it. Rooms , breakfast, service all excellent. After coming back to the hotel on the saturday evening we had a electricity blackout. We were provided with soup and rolls by a lovely employee from co kerry and ended up having a great night ..... Cannot wait to return...", "title": "Cannot wait to return", "user": "Karen O", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120048230}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "You really can't go wrong at an Embassy Suites. Embassy Suites, in Atlanta I believe, was my first real \"business\" hotel room and I was thoroughly amazed that one person could have this much of a hotel room. Embassy Suites in Waltham is equally as accommodating. It use to be a Double-Tree which converted over. Only thing I miss about the former affilitation was that Double-Tree gave a hot chocolate chip cookie upon check in. (And I always complained that they didn't carry plain milk in their little snap shop next to the reception desk.)", "title": "Only thing I miss is the Cookie", "user": "tboll01", "date": "October 31, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0}, "id": 119963575}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed the weekend of the 28th to the 30th of October. From the moment we walked in till we had the best customer service. The front staff was so friendly and check in was so quick. Everything we requested before we arrived was all ready in the room including the comfy crib for my daughter. The 29th the area had a big storm and the power went out in the hotel and surrounding areas. But even then they did everything they could to make us comfortable and still had a smile. And the bar stayed open!! Everything was great, comfy beds, clean rooms, large suites. The free buffet was great!! It was so tasty and fresh and the staff work very hard. Even when people where rude to the staff for no reason they still were polite and accommodating.", "title": "A wonderful Hotel!!!!", "user": "debbie f", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119949703}, {"rating": 4.0, "title": "Comfy, friendly", "text": "We where in the restaurant with our 7 year old son and 18month old daughter when the power went out. The staff still brought us out food and where so accommodating considering the situation. They stayed calm and even gave the kids glow sticks(which they loved)", "user": "TanteBabs", "date": "October 27, 2011", "id": 119812914}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "So if you are looking for a great hotel for a great price stay here. I will stay there every time I am in the area.", "title": "Very nice experience at this hotel", "user": "looking4hoteldeal", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119167361}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The hotel itself is located near the interstate and has all the ammendities one would expect. The rooms are clean and spacious (I had a big suite) but the service at the front desk could be friendlier. I got a great rate on an internet booking side and since it was so much cheaper than the usual rate I probably wasn't the favorit customer.", "title": "Nice place but you will need a car", "helpfulness": 1, "user": "katrin3112", "date": "December 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 90105850}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "There was some noise all through the night which I couln't locate, maybe the air conditioning but you didn't hear the highway.", "title": "Great place to stay!", "user": "curlyg8711", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 89169523}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The breakfast was not included - considering the location this would have been nice since there isn't much around.", "title": "Great Price - Great Place", "user": "Pitt1313", "date": "November 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87073551}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Since I searched the web for a good rate the value the hotel offered was good.", "title": "Less than Average", "helpfulness": 1, "user": "robind681966", "date": "November 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 85654677}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "It's a nice location for travelling around the Boston area.", "title": "Large and comfortable hotel", "user": "S4658", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 85501039}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We were looking for a suite-type of hotel just outside Boston to use on a college visit. Being Hilton Honors members, we chose the Embassy Suites in Waltham. The hotel is conveniently located, directly off of Route 95 and just a few miles north of the Mass Pike. It was a little confusing finding the entrance coming off the highway, but not too bad. The hotel is laid out like many ES properties - large atrium surrounded by the hotel's rooms. We were greeted warmly upon arrival and check-in was a breeze. We enjoyed a quick drink at the free happy hour after we checked in. Due to the rainy weather we decided to eat in, and were given a discount to the hotel's restaurant. Normally we avoid restaurants on the property, but the food here far exceeded our expectations, and the service was friendly and quick. Our room had obviously been renovated recently, and was extremely clean and in good repair. I particularly liked the wet bar area and the large bathroom. The room was quiet and the beds were comfortable. Breakfast featured made-to-order omelets and pancakes as well as buffet style eggs, bacon, cereal, fruit etc. and the food was of much higher quality than most hotel \"free\" breakfasts\". We will definitely stay in the Embassy Suites in Waltham when my husband and I travel to Boston again with our teen-age daughter.", "title": "True gem on the way to Boston", "user": "Bandlady", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118799076}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I have stayed at this hotel every year since 2008 in September for small annual meetings that I organize. This is the first time I've stayed here under the Embassy Suites brand (previously it was a Doubletree). It was upgraded during the transition and looks fabulous! The rooms are clean, roomy and very modern. I have always reserved the largest suite in order to have the 10 person dining table. This year, I stepped down to the Governer's suite because the prices have increased pretty significantly (~$400) since the change. Unfortunately, it did not have a dining table. However, Rob the general manager was so nice and accommodating and he moved me back into the large suite so I could hold my meetings. I really appreciated his efforts to help me.", "title": "Great hotel for business travel", "user": "Rhune", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118776334}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Although the hotel isn't really near the train station, you can drive about 10 minutes down 95S to the Riverside station (Newton exit) and take the train to the city from there. It has a huge parking lot and the trains come often.", "title": "Great hotel, but not for exploring Boston.", "user": "wannabefreqtraveler", "date": "September 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 118736210}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The restaurant has very good options for lunch and the food is good. I never had dinner there or used the bar. The breakfasts at Embassy Suites in general are kind of a hassle because, although they are free and some items are made to order, everything is contained in this small room and it gets really crowded and awkward carrying all your stuff around. This hotel in particular has lots of business travelers and one of the mornings I was there, you couldn't even get in the breakfast room.", "title": "excellent hotel, very very very nice place for the price.", "user": "maxrx7", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118314864}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This is a great business hotel, but too far from Boston or a T stop to make it practical for site seeing. Everything else is great though. They are doing some remodeling, but it didn't incovenience me. Good breakfast. I didn't pay for the room, so I don't know about the price or value.", "title": "Like a brand new hotel!", "user": "Brad A", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118252353}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Over the course of a year and a half I stayed at this hotel at least one weekend per month for business purposes. There were pluses and minuses but overall it is a nice hotel if you are in the area for an event or in a tournament.", "title": "Repeat Customer - Always Satisfied Overall", "user": "JenninMA", "date": "October 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 84156548}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The Positive: Amazing staff - always a friendly face at the front desk, and Betty or Betsy who you call at late at night for your wake up call is always upbeat and so kind. Rooms - they are comfortable and spacious with true \"suites' - every room I stayed in has a minimum of a \"living area\" with a couch, wing chair, tv, and either an executive desk or a dining room table with seating for 4 (I always preferred to have the table). Additionally the sleeping quarters have a locking door for privacy should you have children or guests staying in the living area (pull out sofa). Dining - there is a small bar (typical hotel prices) and a nice lounging area, a full service restaurant (I always thought $19.95 was way too steep for breakfast BUT brunch is great and the cooks are fast and cook to order (even though it is \"buffet style\") - they offer much better variety than most buffet options. Meeting rooms - vary greatly; some are small with comfortable executive chairs and others are spacious and can easily accommodate A/V needs.", "title": "Big suite good breakfast", "user": "businesstraveller2", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83270955}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Negative: TEAMS - On a Friday night there is a good chance that some youth athletic team or college team will be staying in the hotel with you - hopefully they have responsible coaches, but if not - its going to be a long night. The acoustics in the hotel are pretty terrible when it comes to trying to sleep as there is almost an atrium effect based on the design ... so if someone on a lower floor is loud (OUTSIDE of their rooms) you will hear them... word for word. No matter how many times you call the front desk - there is a good chance they will still be LITERALLY running around the hotel in circles. EVENTS - This is a very popular hotel for bar/bat mitzvah celebrations. Never schedule a business meeting or business event on a Saturday if there is one of these celebrations. The noise from DJs and yelling children intrudes literally all of the other conference rooms from about 1pm on. Closing the doors to both rooms doesn't do anything - and the kids constantly open and close the doors anyways so it only gets louder.", "title": "Very nice stay outside of the city", "helpfulness": 1, "user": "Always_Globetrotting", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 83232384}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "Stayed here over a weekend. Asked for quiet room got accessible room on 7th floor facing out. Very quiet. They are painting the hotel and our one operable window was taped over with plastic. Not a huge deal. Free breakfast (Hilton Gold) was great as was free wifi. Really liked accessible shower with spray. Not sure why they put us in accessible room - they said it was because we asked for no feathers. Still I did not mind the grab bars and the spray hose in the shower. And we had no feathers. I would stay here again especially with spouse because of two room suite. The new england clam chowder in the restaurant is to die for. It won some award. Get the bowl and no need for other dinner.", "title": "Great room and great price", "user": "kimcush59", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83201245}, {"rating": 5.0, "title": "Staff is very friendly and accommodating!", "text": "I stayed at The Doubletree in Waltham for two nights in July of this year. Check-in was quick and easy. The rooms were clean overall with a little bit of grunge in the bathroom. It was more of a dated/dingy tile than anything else. The location was just ok. I knew booking this hotel that it was a 15 minute drive to Cambridge and that was fine. However, it was in the middle of a bunch of other hotels and not much else. There were a few restaurants around, but not much else. Maybe a little more exploring of the area would have turned up something more. In any case, for $100/night (including a great hot breakfast), I don't have much to complain about. I'd definitely stay at Doubletree again without hesitation.", "user": "Traveler322", "date": "October 11, 2010", "id": 83051990}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Stayed here for two nights for a family event in the area. Our group had many rooms here. The lobby and lounge area is nice and was good place for us all to meet. I had been here a few years earlier and didn't really notice much upgrading in the rooms. They are nice and large however with two rooms each with a flat screen TV. The rooms were clean but not that comfortable. The sofa felt like you were sitting on a rock and the beds and pillows were lumpy and hard to get a good night's sleep on. It is also quite noisy from the lounge area at night, especially the rooms that were around the atrium. But if you go into the bedroom and close the door it is okay. The breakfast is very nice with delicious made to order omelets..please tip the cooks, they do a great job.", "title": "Not bad", "user": "Dreaming", "date": "December 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 122142183}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Stayed three nights over Thanksgiving. We were happy with the room and it met our top criteria - being clean and quiet (no road noise and central HVAC - no noisy window units). Price with AAA Discount was reasonable for the Boston suburbs area.", "title": "Nice Stay - clean, quiet, reasonably priced", "user": "ComfortSeeker595", "date": "December 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121871061}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The free breakfast included made-to-order omlets was outstanding. However, it was extremely crowded after 9AM (the hotel was pretty full for the holiday).", "title": "Really excellent value for money", "user": "natashadog", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121815432}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Nice pool large enough to do small laps (15-20 yards?). Nice hot tub, fitness area, and laundry area.", "title": "Great hotel, and wonderful staff", "user": "56003Traveller", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121664099}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Only disappointment was that looking out the window very very unattractive - we had a parking lot with construction materials, very few trees, and a Home Depot beyond it.", "title": "Second stay, still happy", "user": "homewench", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121249196}], "location": {"country": "United States", "city": "Waltham"}, "stars": 3.5, "variance": {"poor": 15, "average": 35, "very good": 144, "terrible": 6, "excellent": 161}, "aka": "Embassy Suites Boston / Waltham Hotel", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Welcome to Embassy Suites Boston/Waltham located in Boston’s High-Technology, Pharmaceutical, and Life Sciences Belt and corporate corridor along Route 128 and Highway 95. Our upscale hotel is just 20 minutes to downtown Boston and 25 minutes to Logan International Airport, convenient to Brandeis and Bentley Universities, Wellesley and Regis Colleges. If you’re traveling to Boston on business or vacation, enjoy spacious two-room suites, complimentary cooked-to-order breakfast and a complimentary nightly Manager’s Reception. Plan your business conference, reunion, Bar Mitztvah, or wedding in one of our nine meeting and banquet rooms which can accommodate up to 300 guests. Enlist our experienced catering and meeting staff to plan a memorable event. Our all-suite hotel provides you with more. Enjoy signature omelets at our complimentary cooked-to-order breakfast, complimentary parking, a 24-hour BusinessLink Business Center, indoor heated pool, and 24-hour fitness center."}