{"user_rating": 3.0, "review_count": 380, "name": "Embassy Suites Hotel Jacksonville - Baymeadows", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "While not the most modern of hotels with decor dating to the 80's, this place is well maintained and beautiful with a garden on the inside. My girls loved the pool and I loved the manager's reception! The staff was friendly, but not in your face; even delivering the free drinks to you on slow nights.", "title": "Fun way to relive the past", "user": "Amberrc", "date": "July 30, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 135834487}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "I went to this hotel because this is where a branch of our military houses some of the potential candidates for entrance into the service. My son was one of those candidates. The hotel is a lovely place and for the most part clean but VERY under staffed. When I turned in to go to bed that evening the cleaning staff missed something. The bed was a pull out that I was sleeping on and when I pulled it out to go to bed the bedding was wadded up in the bed but the problem with that was there were someone's clothes in the bed as well. When I called to get them to come clean it I got no where and it took them 2 1/2 hours to finally have a security guard beat on the door and shove the sheets to me and simply stated have a nice night! This room was a suite and my children and grand child were sleeping in there and I worried that maybe their beds were not clean either. That being said they did comp the room for me and apologized but the excuse was that they simply didn't have the staff to take care of the problem!", "title": "The staffing of this place needs work.", "helpfulness": 1, "user": "Judi D", "date": "July 26, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 135465588}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Location was great - St. John's towne center, beach, interstates, plenty of dining.", "title": "Good location - Cocka-roacha", "user": "Tally Baseball Family", "date": "July 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 135028106}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The hotel was a bit older - fairly good state of repair. Staff genrally was very helpful and provided usefull information.", "title": "Older Hotel but still more than acceptable", "user": "Anne M", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 134319787}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "You might not want to stay their if you are going for happy hour or the breakfast bufffet. The area for both is fairly dirty - just not to Embassy standards. During the happy hour my wifes drink had a roach in it. I didn't make a fuss - delivered it back to the bar - just pointing to the roach. The Food and Beverage manager - Juan - stopped by our table. If a normal to loud volume voise he asked if the \"cocka-roacha\" fell from the sky. That there were no roaches in the ice or the cups.... He then went on to say that you have to expect that in Florida hotels- humidity and food being the reason. He offered another free drink or a desert. Didn't take him up on it as I wasn't after something free.", "title": "Older hotel but good service", "user": "caryon1", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 134233096}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "This hotel is not up to the Hilton standards. It looks grandiose when you walk in; they have good reception from 5:30 to 7:30 and a good breakfast as well in the morning. The rooms however once you enter in are very dirty and look old. It is right to say that they are similar to the ones you will find in Motel 8. The hotel just seems very dull and depressing. I will not be staying here again after my first visit.", "title": "Not up to the standards", "user": "Trupti T", "date": "July 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 134103921}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I rented 3 rooms for family when we went down for my son's winging ceremony at the Naval base. The rooms were wonderful, breakfast delicious, and the staff very helpful. We will stay there again the next time we're in Jacksonville.", "title": "Great stay!", "user": "zadear", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133888801}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Stayed here for business, brought my husband to stay for a friend's wedding in June 2012. Loved our room, loved the breakfast, loved the ambiance. Pool needs heat and supervision-too many children and they trashed it.", "title": "Excellent Stay - Excellent Price in Jacksonville", "user": "Sue M", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133833397}, {"rating": 2.0, "stay_parameters": "Stayed July 2012", "text": "This was not good. Like it's dying...everyone is just tired and it didn't feel like anyone was staying there. Room was. Lean but very dated. Curtains in he living room leave huge gaps tO be outside hall and there was no privacy. There were no pillows on the pullout couch. When I called they said to take them off the regular bed. We asked if we could have another pillow (which wasn't offered) and they sent up a blanket. The ohone in the bedroomwas broken when i called he front desk i could hear her but she couldnt hear me I called twice...wouldnt u think shed call back when she realized there was a problem? I finally called from the living room and she said \"I was the person that couldn't hear you\". Food was GHASTLY. Bacon was a smashed together wad of burned bacon that looked like a bacon pancake. Oatmeal was a huge Pile of lukewarm mush. Pancakes and eggs were Ice cold. But worse was the fact that the plates were filthy. I mean with very visible streaks of old food. I brought it a workers attention and he just looked at me. I was so disappointed as I had this impression that embassy suites was much better than than that. Do not stay here.", "title": "Stay away", "user": "smiley1075", "date": "July 6, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 133598735}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This Embassy is showing its age and management seems to have no control. We reserved a King balcony suite with pull-out couch for 3. There were no linens/pillows on the couch or in the room for the couch at all. Balcony is useless and views a parking lot. The only place for hot water was the shower. No hot water in either sink. The breakfast was nice, but the gentleman making the omelets was visibly miserable. He was literally throwing the omelets on plates, causing egg to splatter all over the place. The pool area was a disgrace. At one point, I counted 42 children under 12 years old and only 3 adults supervising. My husband and I, along with one other adult were enjoying the hot tub, until 8 little kids jumped in all at once. Kids were running and jumping constantly. It really was a safety issue too. When we left, I stopped by the front desk and mentioned my concerns. It all fell on deaf ears. The ice machine on our floor was empty for 2 straight days. We have been loyal to the Hilton chain, but this experience was just horrible.", "title": "Where do I begin.....just terrible all around.", "helpfulness": 1, "user": "Mamie B", "date": "July 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 133270399}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "This property faces a paradox. The staff and services the hotel offers are great and what you would expect from any Embassy Suites. The hotel has a very nice indoor pool and workout area. But that's where it ends. This hotel -like many Hilton properties in the Jacksonville area - is old. It's walls, carpeting and antiquated room furniture are drabbed in light and dark earth tones. Both the room and reception eating area cleanliness was questionable.", "title": "Great hotel. (in the late 1980's)", "user": "Chase71", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 140340869}, {"rating": 1.0, "title": "Disappointment", "text": "As I stated the hotel staff are very professional. And special props to Kelli that leads the nightly reception. But the bottom line is time has just taken its toll on this hotel.", "helpfulness": 1, "user": "Kristen Z", "date": "September 3, 2012", "id": 139314331}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I just stayed at this hotel for 3 nights. I pre-paid because it was cheaper and could not check out early or I would have. The carpets are old and filthy. The bathroom was minimally clean. We received no maid service any of the days present. At night when the pool was closed, there was a layer of dirty looking foam on the surface of the pool. We chose not to use the pool or hot tub for fear of infectious diseases. Trash cans were scarce and always full. We stayed in the Executive Suiite portion of the hotel and the noise was as bad as the atrium area. Beds were uncomfortable. Crowd control was not evident as people were allowed to roam the hotel at all hours (even by the front desk) making excessive levels of noise. Security was not noticed anywhere. Parking spaces are tiny. Hope you don't drive a truck or SUV. The breakfast sausage was under- cooked each morning. The whole eating area was messy (guests this weekend were unruly). I will never return to this hotel!", "title": "Great atrium/central meeting space, bedroom suite is 2 separate rooms", "user": "jacobsen2011", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139273307}, {"rating": 1.0, "title": "Filthy rooms", "text": "Earlier reviews mentioned cleanliness so I was leery! But overall the hotel was quite good and I will stay here again.", "user": "ABSPres", "date": "August 28, 2012", "id": 138717739}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "* We appreciated the huge central atrium, with many tables and chairs around. As a working group, we were able to easily meet and work together for hours.", "title": "Very Friendly Staff and great hotel", "helpfulness": 1, "user": "1967Yankeesfan", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138589464}, {"rating": 3.0, "title": "It is a place to sleep...", "text": "I have stayed in Embassy Suites all over the country and while they are not exactly high end hotels, I have grown accustom to clean rooms. Let me preface this by saying this is the first hotel review I have ever written, I am not a complainer by nature, but I feel a need to warn others.", "helpfulness": 1, "user": "GJBenn85", "date": "August 16, 2012", "id": 137313994}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The room I was given at this particular Embassy was one of the filthiest hotel rooms I have ever stayed in. The sheets appeared dirty and were torn all over, housekeeping failed to clean up food stuck on the counter from prior guests, notes from other guests were left in the room on lamp shades. What really struck me was the condition of the bathroom, it looked like it had not been cleaned in ages. The shower had black stains, shower curtain had specs of mold, dust was stuck to the light switches, and there was a cover on the ceiling above the toilet that had a quarter inch of dust on the lip.", "title": "OMG! Please let me out of this zoo cage.", "helpfulness": 2, "user": "JodySwiss", "date": "August 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 137022412}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "When you walk into this Embassy, you get the impression it will be a nice hotel. In fact, my first thought was \"Good, this is one of the nicer atriums I have seen in an Embassy so the rooms are probably equally nice.\"", "title": "Not what I expected for Embassy Suites", "user": "Pedirn308", "date": "August 12, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 136969075}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Housekeeping really needs to be reviewed and possibly overhauled by management, they are not doing their job.", "title": "What a Dump", "helpfulness": 2, "user": "C0vertCritic", "date": "August 11, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 136924504}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I did not complain since I only stayed one night and I was tired...it proved to just be a place to sleep, and is not at all on par with what Embassy Suites has built as a brand.", "title": "Rooms furniture was kind of beat up and too Many Smoking Rooms!!", "helpfulness": 1, "user": "Scot B", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136735007}], "location": {"country": "United States", "city": "Jacksonville"}, "stars": 3.5, "variance": {"poor": 86, "average": 79, "very good": 89, "terrible": 53, "excellent": 73}, "aka": "Embassy Suites Hotel Jacksonville", "slim_ranking": 0.636363636364}