{"user_rating": 4.0, "review_count": 319, "name": "Embassy Suites Hotel Des Moines Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We had traveled to Des Moines for our daughter’s graduation. I admit I was hesitant to stay here because of the reviews but we were very impressed. The room was clean, the staff was friendly and breakfast was wonderful. I would recommend staying here", "title": "Very Impressed", "user": "patriotfamily", "date": "January 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 91346446}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "We wanted somewhere close to the Wells Fargo Arena for a concert we were attending, and this was right near by. Had a free shuttle to the concert, a wonderful free breakfast, and free drinks for happy hour! That alone has my mind made up that next time I am in Des Moines I will stay here. Great hotel, great service.", "title": "Great location, great service.", "user": "midwest_sales", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89717700}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I was on buisness travel to Des Moines in October and had a wonderful stay at the Embassy Sites Hotel. The staff was very friendly, the rooms were clean, and the breakfast was wonderful. I would definitely recommend this hotel.", "title": "Great hotel", "user": "mharvey52", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 89155963}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The hotel provided a nice two-room suite, perfect for traveling as were we with a grown son. We slept in the bedroom, and he slept on the living-room's convertible sofa, which provided satisfactory privacy for all of us. Best of all, the drinks were free for two-hours and, uniquely, were served in an attractive bar by a waitress staff. The breakfast was also free, unlimited, and excellent. The exercise facility was also free and more than adequate. (Parking, however, cost $7) The downside: the \"broadband\" internet, which while also free, was atrocious. As measured by speedtest.net, the up and download speeds were about 0.5 mb/sec (10 mb/sec would be good) and the ping (i.e. response time) was and unbelievably poor 1100 ms (good would be 60 ms). At that level of speed and response, one can barely send and receive emails and surf simple web papers. Trying to do anything else (like access complex web pages), is simply impossible. Too bad, because otherwise the facility was exceeding satisfactory.", "title": "Great hotel except for terrible internet", "user": "MacWilder", "date": "November 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 88387980}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We stayed here with an International group and from the time we made the reservation to the time the group departed we were treated with the utmost professionalism. The group remarked on the hospitality given to them by the staff and the comfort of the rooms. We will be using this property again.", "title": "Excellent Service", "user": "Jo903", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83161439}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My family (2 kids -- ages 10 and 8) stayed at the Embassy Suites on the river over the 4th of July weekend. The hotel was crowded with some sort of youth baseball tourney, which was the only real downside to our stay. Wait times for elevators was exceedingly long, often because the baseball boys were racing each other in elevators on either corner of the open atrium. Even with the crowds, though, the hotel was quiet at night, and the pool was never so crowded that our kids didn't want to swim. We went to an I-Cubs game and the stadium is an easy (and nice) walk down the river. The free breakfast is really nice, although again because of the crowds the lines were long and the buffet was often out of some items. We love embassy suites because our kids don't have to share a bed, and this hotel lived up to our expectations.", "title": "Good value, good location", "helpfulness": 1, "user": "ALTSwiss", "date": "August 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116264053}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We recently stayed in 7 rooms for a family Memorial Service over the weekend. From the coordinator who helped us reserve the rooms, to the front desk staff, to the van drivers - everyone was extremely helpful, polite, and professional. It's located right on the river overlooking a new bandstand (where there are concerts on Thursday nights in the summer) and a garden area. I had not been back to Des Moines for almost 10 years, and was amazed at the rebuilding going on. We ate dinners in the Court Avenue area, which is really jumping compared to 20 years ago when I lived there!", "title": "Lovely hotel in a Great Location", "user": "MrsThree", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115925149}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "This hotel has recently undergone a huge renovation and was really nice. I've always loved Embassy Suites because of the spacious rooms, but they were especially nice this time with so many family members in and out of the rooms. The front desk staff even managed to get us all on the 8th floor. If you go, be sure to ask for an 8th floor room facing the river. The \"Happy Hours\" and free breakfasts were as good as I remember and quite a cost saver for our large family. I would definitely stay here again!", "title": "The place to stay in downtown Des Moines", "helpfulness": 1, "user": "Beavscabin", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 115690969}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We have been staying at the Embassey Suites for three day weekends each month ths year. Make your reservations early or there will only be $400+ rooms.", "title": "Great Location", "user": "aca828", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 115354451}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The breakfast cook is a gregarious soul who keeps life interesting. All of the help have been catering.", "title": "GREAT HOTEL IN PRIME LOCATION", "user": "JstarkScotland", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114760555}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We recently stayed at this Embassy Hotel...great location. Went to Farmer's Market in the morning, walked around on the pedestrian bridges in the afternoon, went to Cub baseball game that evening and enjoyed some of the nightlife on Court Avenue. I have stayed at this hotel before and the recent room upgrades are wonderful. The bed was super comfortable. The rooms are huge and very clean. We had a waitress in the bar and also at breakfast by the name of Courtney that was very friendy and provided super service. We will use this hotel again for a weekend get away. 5 star stay all of the way around.", "title": "Great hotel to use to hang out in Des Moines", "helpfulness": 2, "user": "like2cruise", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113089307}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "My first experience with this hotel was at a Sunday breakfast. I was not a guest, but what I saw alarmed me because I was part of the conversation to choose this hotel for an upcoming convention.", "title": "Change of Mind", "user": "Elosofamoso", "date": "May 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110140719}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "What alarmed me most was the lack of any access control to the breakfast area.", "title": "Comfortable stay, excellent staff, renovated fitness room", "user": "Ariel519", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 104722042}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "People could come in from outside, eat, and leave without anyone checking to see if they", "title": "Very nice, even better when remodel is done!", "helpfulness": 1, "user": "IowaVikingsFan", "date": "March 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98793487}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "belonged there. Staff were few and far between, and tables remained dirty for too long", "title": "Not worth the stay unless you want to be nickeled & dimed!", "helpfulness": 1, "user": "Jules27410", "date": "February 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 96799451}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "If you can negotiate the downtown street projects and the one-ways that want to go the opposite way I do, then you will be successful in getting to this hotel. I always love the open floor plan of these hotels and was pleased to see an extensive remodeling project underway during my stay. The front desk staff are attentive and quick to assist. The restaurant and bar does a nice job considering the large influx of business meetings and special events that the property hosts.", "title": "Always Nice-Soon to be Nicer!", "user": "GOmaha", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117987274}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "While there is no shopping in downtown Des Moines, the hotel is within walking distance of a restaurant-bar district and is convenient for attending sporting events and concerts. I have stayed here off and on for nearly 10 years and will do so again the next time I have a personal or business trip scheduled.", "title": "Overall great but...", "user": "tagalong48", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 117541005}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Embassy Suites in Des Moines favors the business person, especially during the week. They offer a wonder Manager's reception with an open bar, complementary made to order breakfast, wonderful, comfortable rooms. However, they charge $9.95 per 24 hours to access the internet. This seems odd for a hotel that caters to the business person.", "title": "Does the job when the job is in Des Moines", "user": "Fitch7600", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117232288}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "It's a good but pretty ordinary Embassy Suites and that's good enough. The staff is pleasant, the rooms are clean, the pool is relaxing, the bar is pretty good, and the free breakfast is more than worth the price. The added bonus of this hotel is the generous shuttle policy. They are happy to take you to and from meetings, and even though the hotel is a good 15-20 minutes from the airport, they happily do airport runs as well. That alone can save you a rental car or a few $20 cab rides.", "title": "No Too Bad", "user": "Sndedit1", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116856543}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Stayed for 3 nights at the Embassy Suites Des Moines. The front desk staff was polite and efficient. Check went smoothly. The rooms have been refurbished recently and it shows- they were very comfortable. I had a view of the Capitol building which was nice. This hotel has lots and I mean lots of families in it. There were children everywhere-most fairly well behaved-though some were playing on the elevators and running up and down the halls. Luckily the bedrooms are through the living rooms so you can shut enough doors to make it quiet. Overall a nice stay.", "title": "Great Hotel, extremely luxurious", "helpfulness": 1, "user": "MSPtoDCA", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0}, "id": 116267914}], "location": {"country": "United States", "city": "Des Moines"}, "stars": 3, "variance": {"poor": 19, "average": 29, "very good": 105, "terrible": 9, "excellent": 157}, "aka": "Embassy Suites Des Moines", "slim_ranking": 0.0444444444444, "description": "Relax in the comfort of the spacious two-room suites at the Embassy Suites Des Moines Downtown. Located close to the Iowa State Capitol, explore the trendy shopping and dining opportunities of the Historic East Village. Enjoy complimentary cooked-to-order breakfast and a nightly Manager's Reception. Elegant banquet facilities are available for weddings, business meetings and other special events."}