{"user_rating": 4.0, "review_count": 406, "name": "Embassy Suites Chicago O'Hare Rosemont", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We live 4 hours away from O'Hare. For our recent Spring Break vacation with two kids (a toddler and baby), we spent the night before our outbound flight and the night of our return flight at this hotel. When traveling with the family we always try to stay at places that offer at least a one bedroom suite because the kids have an early bedtime. I booked a Park N Fly rate that covered 14 days parking even though we only needed 8 days because the total was a few dollars cheaper than the cost of the Park N Fly with 7 days parking plus paying cash for the 8th day. I picked this place based on (1) Tripadvisor reviews, (2) the availability of suites and (3) the fact that this hotel offers *real* portable cribs.", "title": "Good Choice near O'Hare & This Hotel has Real Cribs", "user": "Scotch99", "date": "March 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 14584464, "likes": {"liked": "— Having real suites with two separate rooms & availability of a real crib."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "A note on cribs: my biggest pet peeve right now is the fact that practically 90 percent of hotels that provide cribs (that I've contacted) only provide Pack N Play playpen style \"cribs\", which really are not cribs in my book. I hate using them as cribs because the pad feels uncomfortable and my back hurts having to bend all the way down to the ground to put the baby down; also, my kids don't use them for sleeping at home so they don't sleep well in them. I always call and look for places that offer real portable (usually roughly 3/4 of a full size) cribs made with either metal or wooden bars. When I called I was assured that they had the metal type of cribs. Because we were arriving later than we expected and past the baby's bedtime, I called about 30 minutes before we were due to arrive and asked for them to put the crib in our room in advance of our arrival. When we got into the room I was really disappointed to see a Pack N Play! I called downstairs and explained my understanding and expectation of having a real crib with metal bars and asked if we can get one of those cribs. Someone called me back to say they ran out of those metal cribs, and I asked/pleaded that housekeeping please doublecheck. I was happy when someone found and delivered a metal crib about 15 minutes later (so we tipped the maid). The morning of our arrival for our second night's stay I called and requested the metal crib, specifically mentioning that I understand they have both but I really would appreciate securing the metal crib. One was in our room upon arrival. So the lesson for other parents who are interested in this -- make your request very specific if you want a shot at getting a real crib vs. a Pack N Play.", "title": "Great renovated rooms", "helpfulness": 1, "user": "silverthief2", "date": "March 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14378759, "likes": {"liked": "— Nice rooms, airport shuttle, good location (also across the street from Convention Ctr.)", "disliked": "— Small lbathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008", "text": "We had another service issue (lost and found) that was resolved after many many calls over the span of a week.", "title": "Good airport location and a Gibsons in the Car Park", "user": "Farnham_Flyer", "date": "March 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14219251}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Other than that everything else was fine. Our room on both nights was clean and typical of most Embassy Suites we've visited. Each time we had a King suite and were able to fit both a toddler size Aerobed air mattress as well as the hotel provided portable crib in the bedroom. On our return we lucked out and caught the shuttle just in time so we didn't have to wait.", "title": "New favorite hotel near O'Hare", "helpfulness": 2, "user": "TravelPlanner8", "date": "February 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13317115, "likes": {"liked": "— Friendly, helpful staff", "disliked": "— Cramped restroom"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I was pleasantly surprised that the Rosemont Embassy Suites stood out from the consistent but exactly alike group of ES's where I've stayed before. My one-night stay was in suite 718, which looked like everything was brand new; immaculate carpets, towels, curtains, and bed linens. Renovation must have happened recently. The only dated things were the TVs, but they still worked fine. The room entrances are double French doors but have good curtains for privacy. As others have said, the bathroom is on the small side but not a big deal.", "title": "It was OK", "user": "beautybykati", "date": "February 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 13313722, "likes": {"liked": "— Food", "disliked": "— Room - bed and temperature"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Over all, the hotel is average for Embassy suites. The room rate was reasonable for the location and the size of the room, and the property looked reasonably clean. The guy running the bar during the manager's reception was really friendly and nice, but it seemed like they could use another hand to shorten the line a bit. I wasn't very happy about the long wait at the airport shuttle station to be picked up (more than 30 minutes), and a long wait during the check-in (only one clerk at the front desk). The room had a very slight hint of smoke although it was a non-smoking room. I had to catch relatively early in the morning, and was kind of disappointed that I had to miss complimentary breakfast. I think this hotel is nice if you want to take advantage of free drinks in the evening and free breakfast as well as if you need extra space for work etc. I would recommend cheaper alternative for someone who just need a place to sleep before catching a flight the next morning.", "title": "Typical Embassy Suite", "user": "Fortwood", "date": "October 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 46786810}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The embassy suites in Rosemont is nice, it hasn't been updated yet to the standard of the other Hilton hotels. You will still find tube TV's and dated carpet in the halls and room but overall I nice stay. Make sure when you go to park in the structure next to the hotel it will only set you back $13 if you park in the same structure and use the Embassy Stuties enterance it will set you back $20.", "title": "Very nice stay close to the Rosemont Theather", "helpfulness": 1, "user": "knauf", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 46225322}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Seems to me that this was my first stay at an Embassy Suites, and considering what a positive experience this was, I am sure that it won't be my last.", "title": "Excellent service, and a comfortable room", "user": "uc9421", "date": "August 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36979416}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Really friendly, professional, and smooth check-in process. If I had any questions about nearby attractions, the staff was quick to provide answers. Directly next to the convention center. Just a short walk.", "title": "It's as OK as the USA itself .. Big, newish-oldish, free breakfast!", "helpfulness": 1, "user": "jpmay", "date": "July 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 35479857}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Fast, tasty choices from room service.", "title": "A Nice Airport Hotel", "user": "HospitalityKid", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 33617957}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "My son and I stayed 5 nights. It was great to have our own \"space\". He slept on the sleeper sofa in the living room and I slept in the bedroom. He felt the sleeper sofa was very comfortable. I was impressed with how quiet the room was, even being close to the airport. We had the best maid service I've ever experienced. The room was spotless and the soaps were replenished daily.", "title": "Overall a great experience, with a few exceptions.", "helpfulness": 1, "user": "ketey", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 18380970, "likes": {"liked": "— The suite", "disliked": "— The beds"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The front desk staff was friendly and helpful.", "title": "Not quite up to Embassy standards", "user": "palaceguy", "date": "July 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 18101887}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Now for the exceptions:", "title": "Some Issues", "helpfulness": 1, "user": "fiftystates", "date": "June 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 17005692, "likes": {"liked": "— Spaciousness of Suite", "disliked": "— Service"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My room had two queen beds, neither of which were very comfortable. They both need new mattresses. The televisions worked great but were old-fashioned. I would have expected flat screens.", "title": "Great hotel, close to airport", "user": "tjong333", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 16679324, "likes": {"liked": "— Style and comfort of room, free breakfast", "disliked": "— Distance to downtown Chicago"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "They charge $10.94/day for internet service. I would expect it to be free of charge for a hotel of this type!", "title": "Excellent service and overall experience", "helpfulness": 1, "user": "SunnyInCleveland", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15717226, "likes": {"liked": "— Location, service and staff, room rate", "disliked": "— I'm a technology snob, so I would have liked flat screen TVs in the rooms."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Average Embassy Suites. Not too much good nor bad. We were booked into a conference suite (thank you Priceline), which meant that between our sitting area and bedroom/bathroom was conference room suited for approximately 20 people. Interesting, we thought. We soon realized this was exactly what we needed to have a party in the room, and we invited a couple of friends from Chicago to join us for the evening in the room instead of going out to dinner. We had pizza delievered and had a great time playing games/eating on the gigantic table in the conference room.", "title": "Ok, good price, would stay again", "user": "OmahaTravel", "date": "May 18, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 30248412}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Pros:", "title": "I've had better stays at Holiday Inn Express", "helpfulness": 1, "user": "CallMeCrazy-CA", "date": "January 28, 2009", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 23974299, "likes": {"liked": "— Express check out.", "disliked": "— Poor overall quality of the property - below the Embassy Suites standard."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Hotel staff was accomodating and friendly. We were booked into 1 of 2 suites that did not have a pullout. The manager moved us to another room with no questions asked. (We wanted the pullout for our friends that spent the night too).", "title": "Excellent except for the teeny tiny beds", "user": "librarychick", "date": "January 27, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23946857, "likes": {"liked": "— Size of the room, inclusion of drinks and breakfast", "disliked": "— Miniature beds"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Free drinks (as many as you want) at the manager's reception. Bar staff was exceptionally nice.", "title": "First time not happy with Embassy", "helpfulness": 1, "user": "mamie902", "date": "December 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 22932123, "likes": {"liked": "— Location", "disliked": "— Lack Of Cleanliness"}}, {"rating": 4.0, "title": "Good Hotel, Close to O'Hare", "text": "On-site resturant is expensive, but it you go to the bar it's the same food at half the price! Good food and service.", "helpfulness": 1, "user": "BillF", "date": "November 20, 2008", "id": 22046091}], "location": {"country": "United States", "city": "Rosemont"}, "stars": 3.5, "variance": {"poor": 34, "average": 70, "very good": 135, "terrible": 17, "excellent": 150}, "aka": "Embassy Suites Chicago o`Hare Rosemont Hotel Rosemont", "slim_ranking": 0.5, "description": "The Embassy Suites O'Hare Rosemont is located adjacent to the Donald E. Stephens Convention Center and five minutes from O'Hare International Airport (ORD) via our complimentary hotel shuttle (4am-12am). Located within walking distance from MBFinancial Park and Fashion Outlets of Chicago. Our hotel is a full service all suite airport hotel providing outstanding accommodations and amenities to business and leisure travelers in the Chicago and Rosemont, Illinois area. Hi-Spd Internet available in guest rooms and public area for a nominal fee. Self Parking: $25/day; Valet Parking: $28/day. We do not offer a shuttle to Allstate Arena."}