{"user_rating": 4.0, "review_count": 962, "name": "Embassy Suites Fort Lauderdale", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I can not even begin to say how much we loved this hotel!", "title": "Fantastic Pre Cruise hotel! loved it", "helpfulness": 8, "user": "dreamvacation1", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15582477, "likes": {"liked": "— how clean it was!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I own a travel agency and am always looking for nice, reasonably priced accommodations to send clients pre cruise and in terms of getting the most bang for your buck value this property by far has the competition beat hands down!", "title": "Excellent stay!", "helpfulness": 5, "user": "BettyFoolio F", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15447806, "likes": {"liked": "— Location was great, complimentary happy hour and breakfast.", "disliked": "— Nothing negative to comment."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "There are several packages you can select when booking at the Embassy Suites including a cruise package which includes transfers via a shuttle to the port. We however decided to utilize a town car service the hotel also can contract with and what a lovely way that was to start and end a cruise. For only seven dollars per person (plus tip) you can be picked up at the hotel and driven to the port in a spacious town car and the price was the same to go from the port to the airport. So much nicer than a cab or a shuttle!", "title": "Good Stay", "helpfulness": 2, "user": "caneshockey31", "date": "April 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 15085740, "likes": {"liked": "— Promixity to Port Everglades and downtown area", "disliked": "— Little busy during the weekends because of the Cruise Passengers."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Ok on to the hotel itself. The property has recently been renovated and everything is bright clean with a \"fresh look\" about it. We were in a business suite on the 12th floor which comprised of a living/dining area a separate bedroom with full bath and then an additional meeting room with a half bath. I would highly recommend getting this type of suite if you have a lot of luggage! It was great to pile our things in the separate room and not be falling all over them. The extra half bath was also a big plus.", "title": "Great hotel for precruise with teens", "helpfulness": 5, "user": "karenj4546", "date": "April 4, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 14785707, "likes": {"liked": "— convenience to shopping, pre-cruise stay, managers reception, great breakfast", "disliked": "— noise"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The suite itself is very nice; it was decorated in all new high quality fabrics and was as clean as can be. I did the \"bare foot test\" right away on all the carpeting. (Washed my feet in the bathroom and then scuffled through out the suite and returned to the bathroom to rewash my feet on the white face cloth) not a speck of dirt showed up! That alone would make me recommend the hotel! There is nothing more disturbing to me than walking on a filthy carpet. There were two large flat screen TV's one in the bedroom and one in the living area. For families traveling with children this is idea so that there is no arguing over what show to watch. Our son slept in the living room on the pull out couch and said it was quite comfortable. We took the king bed in the other room and I must say it was blissful, there was a bottom duvet or feather bed type of covering over the mattress that just made you want to snuggle up and never leave. The bed was a true king with lots of room, unlike many hotels who try to pass off a queen as a king and a double as a queen. Client comfort was defiantly a priority at the embassy suites. (Rooms are also available with two queens)", "title": "Very Nice Hotel", "helpfulness": 2, "user": "mln76", "date": "April 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14707162, "likes": {"liked": "— room size", "disliked": "— thin walls and floor"}}, {"rating": 3.0, "title": "faded glory", "text": "this hotel has such good bones, but needs a lot more care. the atrium layout is fabulous; the", "helpfulness": 1, "user": "hisim", "date": "February 22, 2011", "id": 97643496}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "rooms are huge, but they need a major facelift.", "title": "A little pricey, but a nice hotel to stay in", "helpfulness": 1, "user": "whooCalifornia", "date": "February 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 97149631}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "we saw glasses and dirty plates outside many rooms for 1 whole day. when i complained about all the glasses, they were removed, but the dishes remained.", "title": "FLEA INFESTED", "user": "pellon6604", "date": "February 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 97045743}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "the staff was pleasant, the breakfast was very good, and so was the happy hour.", "title": "Very nice hotel", "user": "dfowman", "date": "February 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 96725155}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "a hotel just needs someone managing all the time, and needs updating.", "title": "Nice Hotel", "helpfulness": 1, "user": "tfc63", "date": "February 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95799841}, {"rating": 5.0, "title": "Hotel rocks from start to finish", "text": "First let me be upfront, I used to work at this hotel a few years ago and it rocked back then too. I use this hotel for for both business and pleasure, Any of my friends in town I have them stay here. So lets start with the breakfast area, it gets really crazy at times busy, but lines move fast even for cooked to order omlets. Finding a place to eat breakfast can be tricky. If no tables avail, there is a gate that goes to restaurant and that is hidden but nice a peaceful. And breakfast is free and lots of varietys to choose. Next, This is one of the prettiest hotels and lots of character lots of charm is ideal for weddings for family gatherings they have the conference rooms and ballrooms too. The waterfall is great backdrop. You can't beat the managers reception in the afternoon with free liquor and snacks. The rooms are normal two-room suite with the micro fridge , all HD TV that ask for room facing the east above 8th floor, It's so cool to be over to watch the cruiseships, Largest cruise ship in the world actually docks at Ft. Lauderdale. There is a grocery store on each side of the hotel there's also shopping ,Ross ,dollar tree , cvs, SCUBA shop And a lot of different restaurants to choose from both sit down and fast food are within walking distance I do recommend Chuck's steakhouse though very tasty within walking distance. If you're looking for activities to do, rental car, Everglades excursion... anything you can imagine Linda the concierge is amazing at finding you good deals on all that stuff. The staff here is really friendly Rosalee a manager is just as sweet as she can be. during season (spring)time this place can get Pricey but for the most part on off-season you get great room all the extras like the free breakfast free liquor, close to everything.", "helpfulness": 1, "user": "Kevin C", "date": "February 26, 2013", "id": 153198811}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "One of my only issue this hotel is parking, there is alot of it and and even if you park it yourself your still charged. It's not really walking distance to the beach but you can jump on the bus and it takes right there in about a mile away. Has a very nice pool area well to layout. I hope this helps some of you make up your mind ,I do love this hotel I have my own family stay there as well when in town (plus I get breakfast and drinks on their dime)", "title": "Great pre-cruise hotel", "helpfulness": 1, "user": "Dan H", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153131941}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Nice sized suites. Complimentary full breakfast and cocktail/social 2 hours! The gift shop gets special mention! Reasonable prices (for a hotel) and the most eclectic variety of merchandise. Need an umbrella, duct tape? Swim suit plus the normal stuff? It probably has it. The hotel is next to several stores, restaurants,. Nice pre/post cruise hotel.", "title": "just 'meh'", "helpfulness": 2, "user": "lemonjuicer", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 153113962}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "i was unimpressed with the embassy suites. we stayed here because we were flying in and out of fort lauderdale and it was convenient given our flight times. yes, the rooms are bigger than the average hotel room but you will pay for that. if space is an issue then this hotel may be good for you. the second time we stayed there we had a room on the 12th floor with an adjacent conference room and extra bathroom.", "title": "High Quality and Great Fun", "helpfulness": 1, "user": "Liz P", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153083741}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "the room are very outdated. the bed was nice enough though with modern sheets and blankets. the bathroom looked like it may have gotten a facelift a few years ago with a new countertop but the rest of the bathroom is very old fashioned.", "title": "good but not great", "helpfulness": 1, "user": "debs0712", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153057470}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Yuck to say the least. This hotel is terrible. I was placed in SMOKING room and when I asked to switch, they said they were overbooked. Asked again the next day and the said we are still overbooked. Hmmmm. Then they said to check back early the next morning to see what could be done. They said they would send housekeeping up to \"spray\" the room but all housekeeping did was knock on the door and hand me a can of spray. That didn't really cut it for someone with asthma who had to sleep in a smoky room. Would not stay here again for business or pleasure. Embassy Suites should be ashamed of this hotel. Oh and they charge for WIFI ... rates are way too expensive for what you get.", "title": "Smelly Beyond Belief", "helpfulness": 1, "user": "jmsclanders", "date": "January 12, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 92623301}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This hotel is a great value for the money and close to everything you need pre-cruise. The staff are very friendly and helpful. We stay there every time we cruise out of Fort Lauderdale. Thanks from travelling Nova Scotians.", "title": "Terrific place to stay pre-cruise!", "user": "rlself", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92218433}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Embassy Suites is a great place to stay if you have kids b/c of the separate bedroom vs. living room area - both rooms had flat screen TVs which is nice if you want to watch TV and not bother the kids. We had gotten two rooms (one for 2 adults & child, and one for 3 adults). We lucked out too and got the rooms next to each other, which made it nice to go back-n-forth between the rooms. We also liked the open atrium lay-out, the sound of waterfalls, the many tropical plants inside - honestly we felt like we were at a Caribbean resort and not Ft. Lauderdale ... maybe it was the Koi fish pond.", "title": "Great place for families", "helpfulness": 2, "user": "amc1990", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 91639977}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "COMPLIMENTARY HOT BREAKFAST", "title": "Great pre-cruise hotel...great service", "helpfulness": 1, "user": "akersjr", "date": "January 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 91443663}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Average food but definitely better than the usu. free continental breakfast. They had pastries, bagels, cereal, oatmeal, grits, fruit (oranges & bananas), yogurt, pancakes, scrambled eggs, sausages, bacon, etc. I'd definitely recommend getting your eggs at the omelette station - they will prepare your fried egg and/or omelettes however you like it. And I'd recommend going early if you want to avoid lines.", "title": "Pre Cruise stay", "helpfulness": 2, "user": "jfd", "date": "December 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 91104791}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife & I stayed at this hotel before and after our cruise in March 2013. We arrived Friday evening and there was quite a line of other cruise passengers checking in. Long wait but finally got a room. They charge you a parking fee ($17.00) which we weren't aware prior. The rooms are fine and comes with breakfest which was enjoyable. We also stayed here on our return stay the following Saturday night. I had gotten sick on the ship on Thursday (Norovirus) and my wife got sick on Saturday morning 2:00am before we disembarked the ship. I rented a car and got to the Hotel around 10:45am but there were no rooms available. I asked the check-in people if there was anyway to get a room as my wife was ill and they said \"Everybody claims that they are sick\". My wife found a chaise lounge at the pool and I layered her with towels and she went to sleep, then we were called about an hour later. My wife then slept all afternoon and we left the next morning on an early flight home. The hotel is fine if you are taking a cruise but we noticed tons of noisy children at breakfest running around and at the pool.", "title": "Good Hotel if on a Cruise", "helpfulness": 1, "user": "Philip R", "date": "April 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157313686}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We're back from a much needed, one week, vacation at the 17th Street Embassy Suites in Fort Lauderdale, Florida. This was our second stay at this location. Last year was an over night stay prior to sail aboard the Oasis. Our check in, this time, went smoothly, not so much the first time. The hotel lobby is nicely done, the water fall and rock formation in the atrium and restaurant area very attractive. Our room on the second floor facing the atrium was quiet and clean. The sofa bed was somewhat uncomfortable, however, this was quickly rectified. The only other complaint was the lack of towel racks in the bathroom. With three of us sharing the suite...it was a challenge to find somewhere to hang all the towels and wash cloths. The evening reception a nice touch; drinks and snacks plentiful. Breakfast buffet had plenty to choose from (yummy). While the staff as a whole were pleasant and helpful, I give a special thanks to Emancia, our housekeeper; Delores on the front desk and Ian our restaurant waiter. Hopefully the towel rack situation will be addressed prior to our next visit.", "title": "Nice location - Great perks", "user": "puff04", "date": "April 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157306672}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We were pleasantly surprised by the location, size and attractiveness of this hotel. It has a beautiful lobby and indoor garden where they serve an amazing complimentary breakfast. The glass elevators whisked us to our suite in no time at all. The room consisted of a sitting room and bedroom and did not disappoint. The bed was comfortable and the room was quiet. Couldn't have asked for more.", "title": "A pleasant surprise", "user": "Dannielle44", "date": "April 10, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 157297913}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Overall, the plumbing needs to be updated. This was my second stay. First stay was okay. Second stay, the toilet did not work and it took almost 30 minutes (after 2 phone calls to front desk) for the plummer - it would have been faster for me to run out and get a plunger myself. I wrote a letter to the hotel manager, Don Friedman, who never responded to my letter. The only reason I did not rate this hotel as TERRIBLE is the check in/check out staff at the front desk were great.", "title": "Poor facilities", "helpfulness": 2, "user": "turtledv", "date": "April 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 157234748}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here prior to and following our cruise out of Port Everglades. What a treat. Although the cost was somewhat high (particularly on the return since it was spring break), the \"perks\" more than made up for it. The manager's reception at the E Spot was fantastic. Drinks were plentiful as were the snacks. Morning breakfast, although very, very crowded, was good, although on the second day the fruit was a bit suspect. The made-to-order omelets were crazy good. Rooms were large enough to share with another couple to keep cost down. Location was next to shopping and fantastic restaurants. Really a great pre-/post-cruise place to stay.", "title": "Great Location - Great Perks", "user": "Christine B", "date": "April 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157206218}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We chose this hotel for it's amenties, location to the beach and precruise shopping needs,", "title": "Fantastic precruise destination", "helpfulness": 6, "user": "jchtravel", "date": "December 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90478358}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "and it's proximity to the terminal. We worked at accumulating the necessary points for a reward stay, and on all counts, we were glad we booked.", "title": "Excellent Even Though Last Minute", "helpfulness": 4, "user": "lettucecook", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90024655}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The hotel is set in a lush and beautifully landscaped courtyard right on 17th Street. Less than 15 bucks for a cab ride from the airport. Inside the lobby it's spacious and alive with the sound of water and the flush of tropical plants. We stayed on the 11th floor and the balcony had a birds eye view of the cruise port and overlooked the Harbor Shops complex, just a block away.", "title": "A Perfect Place to Stay In Fort Lauderdale", "helpfulness": 1, "user": "travelCoram_NewYork", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89943964}, {"rating": 5.0, "title": "very nice hotel", "text": "If you're cruising, this is a great convenience. At the Publix supermarket, we picked up a 12 pack of ginger ale and some supplies we didn't want to bother trying to get through airport security. At Total Wines we got our 2 bottles of wine, and, uh...other beverage needs.", "user": "JamieFry1", "date": "December 14, 2010", "id": 89849523}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Afterward, we took a ride on the Sun Trolley down 17th Street to the beach and looped back to the hotel. You catch the Trolley at the Harbor Shops and it's a great sightseeing diversion. We planned on stopping at the beach, but it was cloudy and blustery, and didn't look like much fun.", "title": "Saved the Day", "helpfulness": 1, "user": "HotelGirl811", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88580765}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The location is ideal, the pool area is wonderful and the free breakfast and managers happy hour are really a nice touch, however it is getting a little used and abused at the Embassy. We have stayed here 3 years in a row now, but I am not sure we would go back.", "title": "Getting tired", "user": "sarah402", "date": "April 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 158156903}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I've stayed at many Embassy Suites. This one was lacking. Old furnishingsand burned out light bulbs. Overall cleanliness in my room was poor. The bright spot was the staff. Everyone from the front desk to the doormen to the breakfast staff was pleasant and helpful. The business center computers were extremely slow and cumbersome to work with.", "title": "Could be better", "helpfulness": 1, "user": "Despina28", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 158146889}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My husband and I stayed here for one night before a cruise on April 5th. This hotel met all of our expectations and then some. All of the front desk clerks were friendly and accommodating. We arrived 3 hours early and they were going to let us check in, as our room was ready. I asked upon check in if we could have a room facing the port. We were told that a room was being worked on and to check back before 3pm. Our luggage was held in a secure location while we had lunch and walked to Publix. We arrived back at the hotel at 2pm, our room was ready and another clerk checked us in and told us we had one of the best rooms at the hotel, on the diamond level. The suite we were in had a wonderful view of the port and 17th street. The suite was well appointed and very clean. Some of the reviews I had ready prior to arriving stated that the hotel was dated. The hotel had an old world charm and was beautiful. The shuttle to the port was $8/pp. and a shuttle was running all of the time, they have 10 of them. The breakfast was excellent and served more than anyone could want. The front desk staff had informed us about the managers reception and breakfast and gave us our guest cards for this upon check in.", "title": "GREAT PLACE TO STAY", "user": "AM C", "date": "April 15, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157870656}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We will stay here again prior to any cruise we take. This was the best hotel by far that we have stayed in Fort Lauderdale.", "title": "Great Place to Stay Pre-Cruise", "user": "profteedee", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157712570}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We are two couples who stayed at the Embassy Suites prior to our HAL cruise. We arrived in the late morning one day prior to our cruise and were allowed to go right to our rooms. We love the roominess offered by the hotel. Rooms were clean, very spacious (sink, mini-fridge and coffee-maker in room) with very comfortable bedding and two flat screen TVs: one in bedroom and one in sitting area (which offers a large writing desk, comfortable sofa and a few chairs. Make sure you take advantage of the Manager's Cocktail hour. Offered to all guests from around 5:30 - 7:30? p.m. Guests may order any type of wine or cocktail and can help themselves to \"munchies:\" salsa and chips, popcorn, pretzels, etc. Breakfast is outstanding - made to order omelets, fresh fruits, juices, coffee, danish, etc. We also sat by the pool in the afternoon and it seemed that a lot of guests used the pool. There is a nice area to just relax and read and/or enjoy something to drink. The hotel is very attractive with a beautiful lobby and atrium. We took a van (offered right at the door) from the hotel to the seaport (less than two miles away). Convenience, comfort and an affordable price. We will return to this hotel the next time we cruise from Fort Lauderdale. An extra tip: If you'd like to enjoy a great burger - try Gilbert's 17th Street Grill in the HarborShops located just behind the hotel. See TripAdvisor reviews. Also, if you are allowed to carry wine onto your ship, there is a Total Wines (as well as a great supermarket) in the same shopping center.", "title": "Great Hotel", "user": "Hayes39", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157619545}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Stayed here 2days before cruise .Rooms cleanish found a few things under the bed ,bed on the small size a small Queen . Great location for restaurant and supermarket for the last minute things .Outside Publix your can pick up the sunshine trolley for $2 a day will take you to the beach and shopping mall Gallery Mall not sure of the mall name. We did the public bus to sawgrass Mall $4 ,but it did take a few hours we did a taxi on the return for $50 which was great and much better my son said(by son said people on bus alittle nutty) .More on hotel breakfast was good ,very busy after 8.30 we had no problem at 7.30-8.00 .Hotel bus to cruise terminal was $8 we went about 10am and missed the rush from the hotel . The free drinks from 5.30-7.30 was great .Nice pool and outside sitting area..", "title": "Stay before cruise", "user": "ottiUk", "date": "April 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 157615504}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We've stayed at a lot of Embassy Suites and it is clearly our favorite brand when the whole family travels since you can get more than four into the room. What I like about this hotel is the location....easy to get to downtown, the beaches, the expressways, etc. What I didn't like is the cruise crowds. If you are trying to check in, as we were, on a cruise day it is pandemonium. The staff does a great job, but trying to check in at noon and already having 72 people ahead waiting was quite a surprise. Nevertheless, the staff is very good and the pool area very nice as well as all the standard Embassy Suite advantages (reception, breakfast, etc.). The worst thing about this hotel: the internet in the business center or kiosk. It was slower than the first dial up connection I ever had (no kidding). It is soooo frustrating when it takes 20-30 minutes to finally get through a flight check in process only for the connection not to be strong enough to trigger the wireless printer. Simply incredible for this day and age and something they have to fix. We had heard from another guest that they had the same experience at 3am so it wasn't just a high use issue.", "title": "Great Location and Facility", "user": "travlinfamilyof6", "date": "April 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157601065}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "Nice hotel to stay in Fort Lauderdale. The location is excellent. Minutes to beach and walking distance to most amenities like multiple restaurants, some shopping etc. it is also close to highway so you could be on your way fast. The parking is only problem with either self service or valet. We chose valet and these guys were very courteous and immediately brought the car to us. The breakfast is above average and they usually have it going another 20 minutes past 9am and manager reception is also nice with drinks and munchies. Some people on trip adviser had complained that the bathroom door opens in the bedroom. Not a biggie for us. It is a bit odd considering all the space in the suite but practically was not a bother for us. Housekeeping staff was very good and courteous and friendly and the rooms were nice and clean once they were done. We stayed there for 4 nights and we would choose this property again in a jiffy. Hopefully next time we are not traveling in a busy season and get better rates.", "title": "Can't beat the value of Embassy Suites. Better than Average property.", "helpfulness": 1, "user": "Lparsad", "date": "April 13, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 157593273}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "Huge room, nice pool, great staff. Really needs to provide wifi or Ethernet access to the web.", "title": "Nice location great photo ops", "user": "Idakop", "date": "April 12, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 157559992}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Out back steakhouse just across the street.", "title": "Disappointing", "helpfulness": 1, "user": "KeriMark", "date": "April 10, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 157331965}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This was the second time we stayed here. I love this hotel. A typical Embassy in a lot of ways. The grounds are really nice and so is the staff. A little pricy but mostly worth it. We had our dogs. Minuses charge for internt and high parking fee.", "title": "Second time", "user": "DigitalFlower", "date": "February 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95517625}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I was only there for one night to attend a nearby conference, but It was a veryt pleasant stay with a nice room - very comfortable, and nicely appointed. The thing I was most impressed by was the breakfast staff. I was late for breakfast, and almost everything was cleared away. Recognizing this and kindly inquiring of my preferences, the staff quickly and efficiently pulled together a breakfast for me. I was very grateful - and it made my whole day!", "title": "Pleasant Stay", "user": "TripQuip", "date": "January 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 95005653}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Embassy is known for their large rooms, but honestly I'd rather have a nicely decorated room than a whole suite that's outdated. All of the rooms appear to have a small balcony, which is nice to get some fresh air. The couch and chair in the living room area of my suite were so uncomfortable that I ended up just watching tv in bed. The chair at the desk was broken in two pieces.", "title": "Large Rooms, But The Whole Place Needs a Renovation", "user": "theseacret", "date": "January 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 94692068}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "The hotel itself needs many upgrades. The free breakfast really stunk, they charge a minimum of $12 per day to park, and $15 for a shuttle to the airport. I paid over $200 per night and feel I could have had a better stay for much less money within blocks of this place.", "title": "Overnite at Embassy Suites B-4 our cruise", "user": "renee462ggg", "date": "January 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 94618745}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My travel group of 6 stayed at the Embassy Suites, 17th Street in Ft lauderdale the nite before we cruised on RCL. This is the nicest E-S ever! The staff is friendly, rooms are clean and spacious, and their breakfast is super. They have a gym, pool, and best of all is within walking distance to shopping and restaurants. They are in a very safe area ,not like the one in Miami, which I will never stay at again. I would recommend this hotel to anyone needing a good nites sleep.", "title": "Great place to stay if you are cruising.", "user": "afearman", "date": "January 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94560305}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We had a very nice time at this hotel. Quite different than so many of the other reviews we'd read before our stay. We arrived after 1:00am, quite sleepy from late-night-travel after each of us worked for a full day at work. Staff was pleasant and attentive. The room was very quiet,", "title": "A different experience than the other reviews", "helpfulness": 1, "user": "jon160", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153652016}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "and we were on the 2nd floor facing the main road near the stop light. The noise from the center atrium could only be heard in the living room part of the suite. Bedroom was silent, and had dark curtains. Furniture was up to date. Room was clean and smelled OK.", "title": "Nice, but get a room away from 17th street", "helpfulness": 2, "user": "ewenix", "date": "March 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 153646774}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The hotel may be 30 years old, but if there's anything that jumped out at us, it was the Florida Style of Design, not the Mexican/Spanish/Wrought-Iron/ceramic-tile-floor style of the building.", "title": "Pre-Cruise Stay in Fort Lauderdale", "user": "Golfnut722", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153636239}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We didn't get a rental car, but there's so much within just a few blocks. We had lunch at Panera,bought snacks for our cruise at the Publix grocery store, stopped at Starbucks, and had dinner at the OutBack Steakhouse...all within 2 or 3 blocks of the hotel.", "title": "Great hotel and great location", "helpfulness": 4, "user": "Scott P", "date": "March 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 153544522}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed as part of a pre-cruise package which included transfers from the airport to the hotel, 2 nights stay, and then transfer to the ship. Based on our experience, if we sail from Fort Lauderdale again, we'd stay here. It fully met our needs and our expectations.", "title": "4 1/2 star for pre and post cruise", "helpfulness": 1, "user": "queenb034", "date": "March 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153536384}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is a typical ES property except that the parking and the internet access are both chargeable. Saw a good Hotwire rate and considered it a bargain although was a little hesitant considering a very poor review I had seen.", "title": "Comfortable stay", "user": "travguy", "date": "April 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 158578306}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "No problems though, everything was as it should have been and as we expected from many visits to ES properties elsewhere, An extra treat to enjoy the managers reception on the sunny patio,", "title": "check in", "user": "steelers2013", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158501103}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Situated on a busy road so some traffic noise can be expected.", "title": "Check In", "user": "MKing1989", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158354649}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "what a great experience there 4/18 too 4/22 the staff was curtious and very helpful ,the food and drinks were excellent.room was clean and was cleaned everyday on time.", "title": "Busy hotel", "user": "geosueh", "date": "April 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158235224}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "i would stay at this hotel anytime.", "title": "cleanliness and detail", "helpfulness": 1, "user": "jerome p", "date": "April 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158205235}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Service with a smile was constant at this hotel. We stayed here for a few days and everything was lovely. We had to visit many places in a short time so due to exhaustion we had dinner room service often. Food was great and service prompt and friendly. The room setup with dining table made this a very nice solution.", "title": "Wonderful home away form home", "helpfulness": 2, "user": "travlinlady", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13681801, "likes": {"liked": "— Helpful staff"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The location was perfect for us,no car, many walkable places for us.Comfortable beds and wonderful shower.", "title": "Wonderful updates made to the suites", "helpfulness": 6, "user": "pearljam_49", "date": "February 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13603272, "likes": {"liked": "— updated furniture in rooms", "disliked": "— paying for parking and no free WIFI"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We sat at the pool and enjoyed the sunshine.", "title": "Enjoyed the hotel, ground transportation more aggrivating than necessary", "helpfulness": 8, "user": "civilengtiger", "date": "January 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 12959110, "likes": {"liked": "— room comfort, lots of electrical outlets which were convieniently located", "disliked": "— Ground transportation to/from FLL airport; lack of a well organized hotel shuttle, questions about licensed/unlicensed taxis at FLL and hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "What a great breakfast that was included.", "title": "A good choice", "helpfulness": 5, "user": "blumen", "date": "January 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12825799, "likes": {"liked": "— The breakfast", "disliked": "— Noisy location on a VERY busy Ft. Lauderdale road"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This was our 3rd stay at Embassy Suites on 17th Street in Ft. Lauderdale. Our last trip here was in 2004, prior to the renovations.", "title": "The Hotel is using UNLICENSED Limousines.", "helpfulness": 10, "user": "Chuck1j", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12468366, "likes": {"liked": "— Close to Cruise Terminal.", "disliked": "— Conceirge use of UNLICENSED Limousines."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "This hotel is fine. It's very close to the airport and the beach, and there's a shopping center directly behind the property. The location is very convenient.", "title": "Just Fine But Not Exceptional", "user": "Criticaltraveller", "date": "July 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18257375, "likes": {"liked": "— Very convenient location; Beautiful pool area", "disliked": "— Carpet stains"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "This property has a beautiful pool area with waterfalls, a pond with koi, and a very relaxing tropical atmosphere.", "title": "great for cruise ship access", "user": "emmandmax", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17188745, "likes": {"liked": "— location,breakfast,free cocktail hour", "disliked": "— poor service for poolside lunch"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "The staff is helpful and friendly. A small bathroom problem in my suite was almost immediately taken care of by maintenance.", "title": "My stay was GREAT!!!!", "helpfulness": 1, "user": "GinaC1", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16861480, "likes": {"liked": "— The great service at the front desk, and the location"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The new fitness room is great. All the equipment appears to be brand new.", "title": "Not bad", "user": "eold2412", "date": "June 9, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 16803876, "likes": {"liked": "— location and service to the port"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "However, I can't recommend that this hotel is outstanding because the carpets in the public areas and in my suite are crying out to be cleaned. I saw stains everywhere.", "title": "Loved the beautiful remodeled Embassy Suites Lauderdale", "helpfulness": 3, "user": "sherry957", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16350737, "likes": {"liked": "— beautiful accomondation and location", "disliked": "— parking was valet or park yourself. Park yourself usually in the back but and entrance there"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We stayed here prior to a cruise. We loved the convenience of the location. It is located near a lot of shopping and restaurants.", "title": "Great Location - Great Price!", "helpfulness": 2, "user": "Christine P", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 153463400}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The courtyard area was beautiful and tranquil. In the mornings they held a free breakfast buffet in the courtyard every morning. The food was great and there were plenty of items to choose from.", "title": "Nice Hotel Conveniently Located to Cruise Ship Docks", "helpfulness": 1, "user": "SteveinSacramento", "date": "March 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153449069}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Our room had a very spacious balcony with a nice patio set.", "title": "Excellent 'pre-cruise' place to stay especially with kids", "helpfulness": 2, "user": "Rich_Holden", "date": "February 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153334125}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The only thing that kept me from giving Embassy Suites 5-stars is that I woke up with back pain from the mattress - not the best. Other than that - great place!", "title": "Would definitely stay here again!", "user": "cgemme", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153306998}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Although this seemed a little 'pricey' to us, we stayed here for one night prior to departing on our cruise to the Caribbean. It is a first class facility in every way. Great food and service and transportation to the boat docks. This hotel will not disappoint!", "title": "Great relaxing stay pre & post Cruise", "user": "6ixpack", "date": "February 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153224559}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We arrived early and were pleased with the bumped up check in. Lots to see and do in Ft. Lauderdale and as such didn't spend a lot of time around the hotel. The only criticism we had was our room faced 17th Street and the traffic was very loud all night.", "title": "Great Location, the Sun Trolley was an unexpected bonus.", "helpfulness": 2, "user": "Kim S", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 153045256}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Great size rooms, with pull out couch. Great buffet breakfast. Not your typical continental one. Very clean through out. Pool was dreamy and hot hot tub! Gold fish in pond huge! Only negative is the self park is $17 a night!", "title": "Great Family Hotel", "helpfulness": 1, "user": "Luker350", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152998597}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Three things I liked about this hotel:", "title": "Embassy Suites Fort Lauderdale - A Great Business Travel Hotel", "user": "Deanna_Watters", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 152719369}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "1. Our suite was very large – great when you are doing a share", "title": "Enjoyed our stay", "user": "ymcafl", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 152703381}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "2. The complimentary, full buffet breakfast was a nice addition", "title": "Disappointed in this Embassy Suites", "helpfulness": 1, "user": "Gary S", "date": "February 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 152554706}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We stayed here following our cruise. The hotel is beautiful, the rooms very spacious (living room and bedroom) and well maintained and decorated beautifully. The staff is very helpful and polite. The free breakfast is wonderful. The grounds and pool are lovely. They offered a very nice military rate the night we were there.", "title": "Great Hotel for post-cruise stay", "helpfulness": 2, "user": "AnnBonney", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14593743, "likes": {"liked": "— the huge rooms, the staff, the decor,", "disliked": "— restaurant poorly managed."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The only negative we encountered (and the only reason that I didn't give the hotel an excellent rating) was in the hotel restaurant. They were having staffing issues the night we were there (Easter Sunday) and were unable to serve anyone in the restaurant. However we could get the food as takeout and bring it back (I highly recommend their homemade pizza!).", "title": "Great Pre-Cruise Stay", "helpfulness": 3, "user": "McBizzle1", "date": "March 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14538884, "likes": {"liked": "— Breakfast and seperate sleeping, proximity to airport and cruise terminal"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Anyone who is looking for a place to stay pre or post cruise should check out this hotel! Highly recommended.", "title": "Generous drinks, good breakfast, very clean", "helpfulness": 2, "user": "Calderwood", "date": "March 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14377688}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Family of 5 pre-cruise. Came in on Friday afternoon and stayed only one night. Spacious rooms and plenty of space to spread out. The hotel is an old hotel that has been refurbished. All the furnishings are new. The rooms are a bit dark-we didn't care, we were only in there to sleep! A Publix grocery store is in the shopping center directly behind the hotel. Stopped there to stock up on sunscreen and toiletries we didn't want to lug on the plane with us. There are several resturants, national chain pharmacies, and boutiquie shops nearby to take up time. The kids enjoyed the pool. We all enjoyed the breakfast Saturday morning.", "title": "The Worst Service", "helpfulness": 2, "user": "fourcruises", "date": "March 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 14234711}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "If you stay here pre-cruise, be warned that the elevators get a bit overwhelmed at noon (check-out)-at least on Saturday. Guests are all trying to check-out at the same time and have large amounts of HEAVY cruise luggage. The lobby area got a bit crowded. There is a side entrance-have your cab meet you there if you're not taking the shuttle.", "title": "loved the embassy suites", "helpfulness": 4, "user": "Shakeey28", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14103011, "likes": {"liked": "— nice hotel", "disliked": "— location not on the beach"}}], "location": {"country": "United States", "city": "Fort Lauderdale"}, "stars": 3.5, "variance": {"poor": 56, "average": 157, "very good": 327, "terrible": 36, "excellent": 386}, "aka": "Embassy Suites Fort Lauderdale Hotel Fort Lauderdale", "slim_ranking": 0.255639097744, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "This property is a perfect choice for nightlife, beaches, shopping, and golf. All 361 two-room suites consist of a living room with sleeper sofa, easy chair, dining table & chairs and a separate bedroom with either one king or two double beds. Each suite is equipped with microwave, refrigerator,coffee maker, iron/ironing board, hair dryer, & 2 flat screen TV's. Also enjoy an outdoor, heated pool, fitness center and The E Spot Restaurant for a chic, casual dining experience."}