{"user_rating": 4.0, "review_count": 1113, "name": "Embassy Suites Washington-Convention Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Hubby and I visited DC for a whopping 48 hours the weekend of 1/22/10. This hotel was in a fairly central location. We walked to all the destinations we wished to visit (i.e. Verizon Center, the White House, the Capitol, Washington Monument, Crime & Punishment Museum, etc...)", "title": "Great 48 hours in DC. This Embassy Suites is in a good location.", "user": "DuffyDo", "date": "January 25, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 54346835}, {"rating": 4.0, "stay_parameters": "Stayed January 2010", "text": "The suites are large and clean. Some areas in the suites are starting to show a little wear and tear but nothing too bad. Pleanty of storage space for clothes and luggage. The complimentary breakfast was nice and not crowded. We never made it to the manager's reception but we did passby as it was taking place and it looked packed with guests.", "title": "Great", "user": "grannyluv", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 54015021}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The Concierge was very helpful in getting us reasonably priced transportation to Dulles Airport ($50 flat rate cab fare). In the lobby near the elevator bank you can find free internet ports to be used by guests (with a printer too). This service came in handy for printing our boarding passes.", "title": "Been here twice and would stay again", "user": "abelgolf", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52404479}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We would stay here again.", "title": "Great property, personalized service, family friendly, fabulous staff", "helpfulness": 2, "user": "battgirl", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52219670}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Everything was great except one bartender named Rose Nequash. Out of all the employees I came in contace she was the only one with a very bad attitude towards all the members of our group. Rose Nequash was rude to several other members that came with me. The only thing that made up for Rose's exxtream rudeness was the doorman Ron Thomas he was not only kind but truly helpful to us as this was the 1st time in Washington DC for a lot of us. I would recommend this hotel, but avoid Rose Nequash as she exhibits a very snotty and non friendly attitude towdards the African American female guest.", "title": "Great Location, friendly staff, but BEWARE OF PRICING", "user": "DRANDY", "date": "December 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 52051578}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I just finished a 3 night stay here and it is a fantastic hotel. As a Diamond I was upgraded to a corner suite which had a great view, and the quality of the breakfast and evening reception was very good also. Location was perfect, we walked everywhere for all of the sites. Great restaurants to choose from in the immediate area also, had many beers at the Capital City Brewery about 2 blocks away which also had great food and a couple of steakhouses very close. Concierge was very helpful, as was any staff I encountered. I highly recommend this hotel.", "title": "Excellent Hotel", "user": "TheWinger", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50967583}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Nice hotel - just as I expected for an Embassy Suites. Taxes are expensive... Nice area, good breakfast. Get down to the breakfast early if you are there on a weekend or holdiay when families are staying.", "title": "Thanksgiving in DC", "user": "amandah807", "date": "December 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50626406}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We could walk to the White House and all of the monuments, etc.", "title": "Excellent, friendly service and well positioned", "user": "Dawn5053", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 50508882}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Rooms were nice and clean. The bed was SO comfortable. The view was of a very close building, but I guess I wasn't planning on looking out the window all that much anyway.", "title": "Great experience. Recommend to anyone.", "user": "Thames2000", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50363992}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We stayed at the Embassy suites convention centre at the start of our holiday to the States. What a start. After waiting at Dulles airport for our limo for over 2 hours we finally arrived at the hotel in rather a stressed state. From the moment we arrived at the curbside things changed for the better. The doorman was friendly, the reception staff were welcoming and very efficient. Check in took no longer than 2-3 minutes and we were on our way to our suite. We had a large corner suite. It was spotlessly clean with every convinence you would expect. The breakfast selection was amazing!! The restaurant staff were helpful and chatty which was nice. Each day we were asked if we were enjoying our stay and if the staff could do anything more to make our stay better....our answer was no. They far exceeded our expectations of a chain hotel and would definitely recommend it to anyone visiting Washington on vacation or business.", "title": "Clean, clean, clean", "user": "MON1967", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50362893}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "From the minute we arrived, we received exceptional service at this attractive and spotless Embassy Suites. When I asked to leave my car in the entrance so I could self park, the valet was gracious and helpful. The front desk staff and managers were friendly and professional during check-in and throughout our stay. Our rooms were excellent; one of them had a great view of the Capitol and both of them were extremely well appointed with amazing beds. Try to get upgraded to an Executive Suite. The housekeepers were totally on the ball; one of the housekeeping managers chatted with us to figure out when she could make up our room around our schedule and then followed through.", "title": "Perfect choice for a family in DC", "helpfulness": 1, "user": "mac827", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49920602}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The on-site restaurant (Finn and Porter) is attractive and a step above what I have experienced in other Embassy Suites. This is where they serve your free breakfast; you can sit by a fireplace with soaring ceilings while you eat the standard but above average fare. The omelet cooks were quick and competent and we didn't have to wait, although I'm sure it gets more hectic in the summer...", "title": "Good staff, but communicating with the outside world is a chore.", "user": "abfpsych", "date": "November 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 49338028}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The cocktail hour was much better than others here have suggested. The had two beers on tap, Lite and Rolling Rock, and it was served in frosty pint glasses. I didn't try the wine but they offered more liquor choices than I have seen in other ES's. The snacks are a little lame (fresh chips, standard bland salsa, goldfish, potato chips) but I find it hard to complain about the free snacks I'm munching with my free ice cold beer. The bartender was friendly and on the ball. She had wisely pre-poured some wine to keep things moving...", "title": "Excellent service, comfortable beds, OUTSTANDING location", "helpfulness": 1, "user": "dennisfan", "date": "November 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48448860}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The pool, jacuzzi and healthclub were very clean and above average. The jacuzzi was hot and the healthclub had excellent machines and free weights. The pool is on the small side but who cares. (not our kids)", "title": "Good location, reasonable hotel.", "helpfulness": 1, "user": "squirrelpaws", "date": "November 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 48283758}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The location is close to perfect. You can get to the mall (at the Natural History Museum) in about 10 minutes. The White House is about 15 minutes and the Capitol is about 20. We walked everywhere, but I think the Metro is two blocks away. If you are taking either Boltbus or Megabus (newish excellent bus service to NYC, Boston and Philly), you will have about a 50 yard walk to the hotel; they arrive and depart in an astroturfed (?) outdoor complex between the Embassy Suites and the Grand Hyatt. They are several great restaurants within walking distance. Two rec's: Brasserie Beck for great Belgian is less than 2 blocks away and Michel Richard's renowned Central is about 6 blocks. Chinatown and 7th Avenue nightlife is about 4 blocks.", "title": "Fulfilled Our Needs Completely", "helpfulness": 2, "user": "SixOneTwo", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47715651}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "This was a very nice hotel. The bed was extremely comfortable and everything in the room appeared to be clean. The suites are very small for the price that you pay but I believe that the corner suites are larger. I had no problem with the cleanliness or comfort, but wouldn't pay 255.00 for a room like this on a regular basis.", "title": "Very clean but not worth 250 a night", "user": "ccnanny", "date": "October 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 47117152}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The Manager's reception was a little bit of a let down for this type of hotel. Chips and salsa and some party mix. That's probably the easiest thing though considering the line for free drinks was very long, go figure. The bartenders were great. Don't know how they cope with all the people they have to deal with in a 2 hour time frame.", "title": "BIGGEST SCAM IN THE WORLD, BEWARE OF THIS HOTEL", "helpfulness": 5, "user": "SCAM13", "date": "October 17, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 47115744}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Ordered from the room service menu and it was great! Very good food and service.", "title": "Nice Room but iffy service", "user": "travel53NewJersey", "date": "October 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 46876682}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The breakfast buffet was good and it was kept well stocked. Tables are hard to come by if you get there late.", "title": "Fantastic, Friendly & First Class", "user": "abeck3", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46420239}, {"rating": 4.0, "title": "Great place to stay!", "text": "The best thing about this hotel is the staff. Everyone I came in contact with was pleasant and eager to help.", "user": "anniemay1990", "date": "October 8, 2009", "id": 46256176}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3.5, "variance": {"poor": 42, "average": 115, "very good": 402, "terrible": 30, "excellent": 524}, "aka": "Embassy Suites Washington Hotel Washington Dc", "slim_ranking": 0.348837209302, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}