{"user_rating": 3.5, "review_count": 661, "name": "Embassy Suites Hotel San Francisco Airport (SFO) - Waterfront", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed there for 4D3N stay in a suite and had a fantastic experience. Great location and great service at the Hotel. Breakfast is fantastic and staff is excellent. The property requires some renovation though especially in the bathrooms. If we come back again we will choose ES Hotels SF definitely. Thank you ES team", "title": "Great Family Hotel with Excellent Staff", "user": "AKK2050", "date": "September 6, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117767898}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "Hotel was very nice with a great internal atmosphere. The people that work there try really hard to please and it showed. From breakfast to evening, the staff was very pleasant and accomodating. Front desk people were excellent amd helpful. Free shuttle to SFO (BART) was timely & efficient. I would recommend this stay to everyone who dont mind four star or less accomodations.", "title": "Very nice, economical place to stay away from the city.", "user": "Jplopez31", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 117541709}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at this hotel for six nights, as we vacationed in San Fran and the surrounding areas. This hotel's location is AWESOME. Right on the Bay, and so much fun to see the planes coming in (but not hearing them!!). It's incredibly easy to get to back to the airport, and since it is right off Hwy 101, it is easy to get to/from all the area attractions. The room itself is spacious, beds are comfortable, and everything is clean. I love the Crabtree & Evelyn products for toiletries. The hotel staff is wonderful - from the front desk, to housekeeping, to the great staff serving breakfast. Normally I am not a breakfast eater, but I did get up early for the pancakes once because I remember how good they were from our trip here two years ago. Overall, a nice hotel that we will visit again when we go to the Bay area. Only downsides to this hotel that we encountered was the parking fee of $17 (two years ago we didn't pay anything) and the fact that there was not free wi-fi in the room. (There is a business center available for use, but seems to be frequented by the teenagers surfing rather than true business).", "title": "Second time here and looking forward to the next!", "user": "WNYTravelers", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117429164}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Highly recommend this hotel for families visiting SFO!", "title": "Disappointing - not children friendly", "user": "karen7392", "date": "August 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117378303}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We were very disappointed with our stay here. After staying at the family friendly Homewood Suites in Anaheim, we were expecting a similar experience, but was disappointed. Felt too formal and business like and just didnt feel at home at all. Would be a lovely place to stay as a couple or business people, but not for families. There is no free WiFi - its very expensive AND they make you pay per device, not per room, per night!! Ridiculous compared to other places we stayed in our 3 weeks! The complimentary breakfast was quite good. It was a made to order hot breakfast which was pretty good. Crowded at breakfast, but we always found a table as there is a lovely big area to eat in.", "title": "Room to spread out and a beautiful atrium!", "user": "Steve11756", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117322987}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed in the hotel for 4 days in mid-August as part of a family vacation to the SF Bay Area and Monterrey. Family of four--two adults, 14 yr old and 11 yr old.", "title": "Worked Well for Family of 4", "helpfulness": 1, "user": "lindylous", "date": "August 24, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 117196364}, {"rating": 3.0, "stay_parameters": "Stayed July 2011", "text": "Location: As we had a rental car, being outside of the city wasn't a problem. My personal preference would be to stay downtown, but kids insisted on a pool and so we choose to stay farther out to get the combination of amenities we wanted. Hotel was a short drive (5 mins at max) from the BART station (which we used one day) and about a 40 minute drive during the heaviest traffic (Wednesday morning commute) to Fisherman's Wharf. Parking the car in the city and walking was a cheaper alternative for us in most cases than using the public transportation. Not as many outside dining options as I would have liked within walking distance and we didn't use the hotel dining room. Nice walking path along the water.", "title": "Nice view", "helpfulness": 3, "user": "Fletc404", "date": "August 22, 2011", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 117075503}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Amenities: The cooked to order breakfast was good and offered a variety of items. We also enjoyed the Manager's happy hour (but the free snacks were a little skimpy). The pool was an adequate size and the kids swam every day. My 11 year old enjoyed the atrium with koi ponds; although, I found that this made the hotel feel a bit humid and damp. We thought we had included WiFi in our room rate, but had not. Seemed expensive at $14.95 a day, so we went without. I believe we did include parking in the room rate and had no troubles finding a spot.", "title": "More Staff/Guest communication needed", "user": "Beckyone", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 4.0, "service": 2.0}, "id": 116913461}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Room: Nice size for us with a separate sleeping area. Clean and basic. We really weren't in it much. On the weekend, the hotel hosted several parties/receptions and a conference. This created a lot of noise in the atrium and hallways. The room next to ours had a small party, but it quieted down pretty quickly. Since we were close to the airport and on the bay side, there was airplane noise.", "title": "VERY ENJOYABLE STAY", "user": "956", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116867555}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Other than the breakfast, we ordered some items off the bar menu at happy hour for the kids. They didn't complain and the service was good.", "title": "Lack of accessibility understanding for wheelchair user", "helpfulness": 1, "user": "chonglh", "date": "August 14, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 1.0}, "id": 116705472}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I find it difficult to find many positives about this hotel. The location is some way from SFO and the shuttle goes to other hotels along the way. The shuttle was always crowded when we used it (note: quite a few air crews saty here so expect a packed bus)", "title": "I really didn't feel comfortable here...such a noisy place", "helpfulness": 1, "user": "dogsareforlife", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 118386269}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The hotel itself is dated. The atrium has a water fall in it and the noise echos tremendously making talking hard - as a consequence everyone speaks louder. When we arrived on the Saturday there were HUGE crowds in the central atrium - they were hosting two big weddings plus their usual manager's reception. Here I have to say that the guys running the bar during the manager's receptions were exceptional - great service and fun too. However it was not a relaxing experience due to the noise around us.", "title": "Wonderful Summer Vacation-2011", "user": "Anita W", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 118177954}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Our room was overlooking the bay and was on the 8th floow (7, 8 and 9 are for hhonors members). The suite was standard - clean but dated - and quite dark in fact. The bathroom was tiny and very old. It has been decorated and was clean but the rooms need a new bathroom. The biggest problem was the noise from the aircraft - you could hear every plane taking off - not great at 2.00am when the cargo planes are leaving SFO. No double galzing has been fitted and its a single pane of glass separating you from the outside disturbances - if you are a light sleeper this isn't a great choice.", "title": "Great stay for business travelers.", "helpfulness": 1, "user": "BMNanney", "date": "September 15, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118156508}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The noise from the atrium could be heard from the sitting room but if you went into the bedroom and shut the door is was bearable. There is a children's movie night on Saturdays and there were large amounts of children all having a good time - but you need to be aware of this if you are expecting a quiet time - I seem to recall the noise decreased after 10.30pm.", "title": "Great Airport Hotel / for Int'l Stopover or Visit", "user": "uncle-eric", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118043450}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Good points - the servers at breakfast were charming and the queues weren't bad. Selection of food was fine. I really enjoyed watching the Koi fish in the water which runs around the atrium and waterfall - lovely creatures. The business centre was very useful as was the little shop near the entrance.", "title": "What a wonderful surprise this location was", "helpfulness": 1, "user": "Carlasroka", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117997883}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We booked 2 rooms for 2 nights via Hotwire for our family of five. They were unable to give us connecting or adjoining rooms but this wasn't a big deal since our kids are older. Great breakfast. We usually spend between $50-75 for breakfasts like this for our family so it was great value. I was annoyed by the internet charge ($11.95/24 hours) but given that the room was so reasonably priced, it wasn't a big deal. There was a cable in the business center that I am guessing could be used for connecting your computer to internet. Discovered that when I went to print up boarding passes. We had a very long wait for the computers in the business center but the cable was never used in the time we were there.", "title": "Great value", "user": "fab1961", "date": "August 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116661321}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I'm sure the hotel was stunning when it was first built. The lobby is beautiful and atrium pleasant. The beds were very comfortable with new linens. The rooms were kind of dark (as older hotels often are) and light switches and phones were dirty. A complete reno of the rooms could make this hotel stunning again but we did find it very acceptable.", "title": "Great stay and would return", "user": "DisneyOrBust1", "date": "August 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116642692}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We travelled to downtown several times from this location and found it to be no problem (approximately 20 minutes). Enjoyed the outdoor space and FREE and ample parking.", "title": "Enjoyed my stay", "user": "bblueangel", "date": "August 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116480896}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "This hotel was great and better than expected for a 3.5*. We has a suite on the top floor. The room was clean and beds comfy. Only negative was sofa bed was in need of an update. The breakfast was fantastic! They handed out breakfast vouchers at check-in. Vouchers were only needed for the hot breakfast or made-to-order items. There was also a good spread of muffins, pastries, oatmeal, fresh fruit, yogurt, cereals, bagels and toast. The location of the hotel was ideal if you have a car. The hotel is literally right next to the bay and perfect for a morning or evening stroll. Staff at the hotel were friendly. The manager's reception including nachos (straight out of the bag), veggies, and beverages (non-alcoholic and select alcoholic) off a menu. There was a busy center with several computer stations and a printer for guest usage. Room internet was subject to a charge though. We had a parking package and was given a tag for the window. We didn't notice anyone checking for other parkers though. I would stay here again...", "title": "Best kept San Francisco Secret!", "user": "desertfleurs", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116456410}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I went to visit a friend who was already staying in this hotel so we shared a room. I enjoyed the free shuttle to and from the airport. The front desk receptions and all of the other staff members were kind and polite. they were helpful in questions I had about traveling on the BART and a taxi. They even went as far as calling the Taxi company to ask a price on a certain ride.", "title": "Disappointing for an Embassy Suites,but okay for one night close to SFO airport", "user": "Crabou", "date": "August 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 116427532}], "location": {"country": "United States", "city": "Burlingame"}, "stars": 3.5, "variance": {"poor": 76, "average": 116, "very good": 255, "terrible": 61, "excellent": 153}, "aka": "Embassy Suites Burlingame", "slim_ranking": 0.75, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Located directly on the waterfront along a breathtaking walking / jogging trail, the Embassy Suites San Francisco Airport- Waterfront hotel in Burlingame, CA is located just minutes from the airport and a short drive to downtown San Francisco."}