{"user_rating": 4.0, "review_count": 519, "name": "Embassy Suites Convention Center Las Vegas", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "This is my second stay in the property in year. Last year, October 2010, was a decent stay. This year was a mess.", "title": "What Happens in Vegas, Needs Fixing", "user": "DrFood", "date": "October 22, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 119600389}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Poor and rude front desk help. Disgusting managers reception. Out dated rooms. Poor response from management staff when I wrote a lengthy email to Hilton Honors folks. Asst Manager sent a generic we are sorry you were not happy response. People should be fired for things that happened, not \"talked to\" as she said would happen. Where the heck is the GM at on handling the letter to Honors?", "title": "Below average for and Embassy suites", "user": "rhartogs", "date": "October 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 1.0}, "id": 119557905}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I skipped the breakfast after the nasty managers reception food quality.", "title": "New Found Love for Embassy Suites", "user": "jill v", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119482391}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Would be a hotel of almost last resort in the future.", "title": "Truck broken into", "helpfulness": 2, "user": "larry m", "date": "October 11, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 119196948}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Rooms were fine and on par with Embassy Suites, clean, spacious, living room area a bit too dark. The breakfast as always was pretty solid. My bed was too soft. What I didn't like was the tiny over chlorinated pool, small work out center that was hard to find, and the restaurant that didn't feel like a restaurant, more like tables set up in the middle of the atrium. Though the seafood chowder and hot wings were pretty good. Aside from the lady who checked me in, most of the staff were indifferent.", "title": "Terrific stay", "helpfulness": 1, "user": "1122344", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118588772}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This is an older hotel, but is in a great location for Convention Center events. The rooms are large with separate living area and bedroom. The hotel offers a complimentary shuttle that goes to the convention center and the strip. There is a complimentary buffet breakfast in the morning and a manager's coctail receptiom in the afternoon.", "title": "Great Value for Las Vegas Conventions", "helpfulness": 1, "user": "Carib-Travel56", "date": "January 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122668007}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed here for four nights in a one-bedroom suite on the 5th floor. The room was quiet and clean with a small balcony and view of the strip, two flat screen tvs and a bar with refrigerator and microwave. The breakfast was good with several choices, including made-to-order omelets. The manager's reception included free well drinks, beer, and wine with tortilla chips/salsa one night and potato chips/dip the other night we went. The monorail station at the convention center is within walking distance.", "title": "A couple of issues but generally a good stay", "helpfulness": 1, "user": "Roman0209", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122627034}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "The issues we had were as follows:", "title": "Off the strip but good value", "helpfulness": 1, "user": "Teamhoffmann", "date": "January 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 122498290}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "1. With the concern of water such an issue in Las Vegas, it was disturbing to have to run the water for over 10 minutes just to get a lukewarm temperature. Management indicated they were waiting for a slow period to repair the heater, but I wonder if that's not just a fact of life since the heater is in the back of the hotel.", "title": "Traditional business hotel", "user": "Live2TravelWV", "date": "December 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 122068132}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "2. The fire alarm went off at 4 am one morning and 7 am the next morning. False alarm, but we were told that it's a recurring problem and really needs to be fixed.", "title": "great time in Las Vegas", "user": "judy b", "date": "December 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121802834}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed for 2 nights during cloudy, rainy weather. Room was OK, clean and spacious. Breakfast was somewhat crowded and chaotic, but had a big selection, did not try the cocktail reception. Hotel is far from the strip and you need to walk to the Convention Center to get the bus, which is about a half a mile. They have a shuttle to the CC, but it does not run very often and is \"on demand\" which is not very convenient.", "title": "OK", "user": "MrsK", "date": "September 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 118540853}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Nice large and comfy well appointed suites. Free parking, a nice little fitness room and a killer free breakfast. My only complaint is that the coffee was horrible. Quiet. A little over a mile walk to the strip. I walked it several times and felt completely safe.", "title": "Nice place", "helpfulness": 2, "user": "StellaArtoisH", "date": "September 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118389882}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I had stayed at a couple of Embassy Suites several years ago (Tahoe, Palm Springs & San Diego), and don't remember it being as dated as this location was. This place has seen it's better days. There was mold in the shower, and the drain was clogged with hair that I had to pull out to get the shower to drain before I even went in. It was the middle of the night, so I wasn't going to call & wait for maintenance to come & get more frustrated with the wait when I just wanted to sleep. So I had to wear my flipflops in the shower. (As a side note, this is the 2nd hotel in a row that this has happened -- I don't know why housekeeping doesn't seem to care about this...)", "title": "Not as good as I remember", "helpfulness": 1, "user": "YesAnotherTraveler", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118292319}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel advertises a free afternoon reception. When we asked the front desk about what type of things are offered there, he said, \"sometimes chicken, generally cheesesticks.\" We were hungry, and headed over, only to find popcorn and chips & salsa. Nothing else, a half hour into the \"reception.\"", "title": "Great Stay!", "user": "woowoochick", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118266670}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "A weird thing is that my friends had bottled water in their refrigerator, which the front desk told them was free. But I didn't have any in my refrigerator, which made me wonder if they had forgotten to clean the refrigerator out, and if the water belonged to a previous guest?", "title": "GREAT STAY", "user": "robbase75", "date": "September 17, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 118246575}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed here for one night before our reservation on the Strip began. I used Hilton Honors points, so I can't speak to the price. The cab ride from the airport was $20, including tip. Check in was super speedy, and they had a king suite available for us at 11am - we were very happy to have a room that early, especially on a Saturday.", "title": "Good hotel if you are ok being off the strip", "helpfulness": 1, "user": "Erika20", "date": "December 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 121777395}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "There is complimentary water in the lobby. The managers reception included free draft beer, wine, mixed drinks, popcorn and chips and salsa. The free made to order breakfast was just that - it included omelets made to order, sausage, bacon, scambled eggs, pancakes, pastries, coffee, juice and soda. Much bigger and nicer than most \"free\" breakfasts.", "title": "Very good hotel", "helpfulness": 1, "user": "terps1962", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121751844}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We had the 2 room king suite. The living room was very large, as was the separate bedroom (they are separated by a door.) Both rooms had a flat screen TV. There is also a wet bar with a fridge and coffee maker. The bathroom was large with a hair dryer and had nice toiletries. I was most impressed with the towels and bed linens - much higher quality than I would have expected.", "title": "Great for families - separate bedroom, great breakfast - a little tired/dated", "user": "dg_in_ca", "date": "December 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 121506528}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Overall, I think this is a solid property. The drawback is location. It is located 3 long blocks from the monorail station (about an 8 minute walk). This is great during daylight hours, but it is not an area you would want to walk after it is dark. We took a taxi to/from the strip and it ran about $12 with tip both ways.", "title": "Good for off the strip", "user": "terry l", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121456102}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "If you are ok paying a taxi, and not having a casino, I think this is a great choice.", "title": "Family place away from Vegas", "user": "Manateegirl", "date": "December 6, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 121447840}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Perhaps because Las Vegas is over-hoteled or the economy, but we got a terrific deal on a suite here, including a free buffet breakfast that included cooks making made-to-order omelets, eggs and waffles. The rooms are well taken care of. It is not convenient to the strip, but if you don't mind a 20-minute walk for exercise, it's not a problem. Our only complaint was that they held a manager's reception but the food was pretty skimpy. We were staying one night before flying out at the end of a trip to the Grand Canyon, Bryce and Zion. It was perfect for our needs.", "title": "Best value around!", "user": "opusRaleigh", "date": "September 17, 2011", "detail_rating": {"value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 118244725}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Have stayed here a few times and pleased each time. Love that bed in closed off to rest of room so if you want sleep and others are out, they don't wake you coming in. Staff friendly, helpful. Room service good. Not far from strip but to far to walk back to your room after dark. I felt most places away from strip were generally unsafe to walk around at night.", "title": "Great clean place", "helpfulness": 2, "user": "nolaqueen", "date": "September 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118181798}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This is a copy of a letter I'd sent to Hilton Honors. Hello. My name is Brian, Hilton Honors Member XXXXXXXX. I am writing this letter to withdraw my membership in Hilton Honors. I no longer wish to be a member of Hilton Honors, and will not spend another dollar with your hotels. Not that it will matter to you, but I am going to explain why that after 96 nights in less than 1 year I am doing this. My last four or five stays with you were miserable by anyone’s interpretation of the word. Since it was my most recent trip that forced my hand, I will describe it to you.", "title": "Even A Diamond Honors Member Can't Get A Break", "helpfulness": 7, "user": "Brian S", "date": "September 15, 2011", "detail_rating": {"value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 118156660}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Checked in on 09/8/2011 at the Embassy Suites on Paradise Rd in Las Vegas. I’d checked in for four nights, yet had to obtain new keys daily because they’d kept checking us out. (Room 920)", "title": "First time in Vegas", "helpfulness": 1, "user": "aquino5043", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117993608}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Found major rust stains in the bathtub, where my daughter, age 9 would have bathed. Disgusting.", "title": "Great Place A+ rating will be back!!", "user": "AllYearGymRats", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117992420}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I'm generally quite pleased with Embassy Suites properties but this one just seems to be a bit tired. It's seen better days. Our room, which was supposed to be non-smoking, smelled like smoke. Luckily we were only there for 2 nights. The breakfast buffet was great. Good, friendly service, although I'm used to the breakfast buffets at other Embassy's where you serve yourself. When I took a plate from the stack and went for some eggs, the cook politely asked me for the plate so he could serve it. I think it's their way of rationing the food. It's breakfast food, whatever. We spent most of our time out on the strip. The hotel is nice and close to the Convention Center stop on the monorail. That made it an easy trip over to the strip. I didn't deal with the front desk but they seemed to be very friendly and helpful. This isn't a bad place by any means, just a little worn out. It could use a breath of fresh air.", "title": "A Tired Embassy Suites", "user": "ardmoreflyer", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119953002}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "After reading some reviews on this hotel, I expected a nightmare. I expected my car being broken into, drunks and homeless all over the hotel, but guess what? I had a wonderful stay. The staff were very kind, and helpful. They accomodated my long extended checkout needs. The pool and spa were great and I did not encounter one homeless guy taking a bath in it! Imagine that. Breakfast was decent, the beds were great and the room was very quiet. My only negative was the TV remote was missing, but they broiught one up.", "title": "After reading some reviews, I expected a nightmare", "user": "jkskeen", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119790394}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "It is about a 10 minute walk to the convention center if you have the need for that. They also have a shuttle that goes there every hour and also they were kind enough to provide a free shuttle ride to the mall every hour as well.", "title": "Nice and quiet accommodations right off the strip", "helpfulness": 1, "user": "heatherh1313", "date": "October 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119736829}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Overall I would stay here again in a heartbeat.", "title": "Nice Place w/o the Traffic of a Casino", "helpfulness": 2, "user": "Redbear21", "date": "October 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119728969}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "We booked this hotel because we were looking for a hotel that is quiet, near the strip and has extra space for our family and we found just that. The hotel is in a nice location and is a quick cab ride away from the strip.", "title": "Second Stay", "helpfulness": 1, "user": "beetrvln", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119648532}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "For those in town to work, rather than party, this is a super hotel. It is close to the Convention Center (walking distance to South Hall, but drive to North or Central Halls!). Typical Embassy Suites -- lots of room to spread out and be comfortable. Older hotel but clean and well maintained. Manager's reception in early evening; cooked to order hot breakfast (LOVE the omelet chef -- he makes great omelets). Convenient to Las Vegas Boulevard and the strip for those who want to party in the evening. If you have children, this allows you space for them to \"spread out\", and if you are there to work, set up your computer, log on and have at it!", "title": "Very good off the strip hotel", "user": "EJPVA", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125551005}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "I spent the entire month of February in Las Vegas and stayed here. The staff was wonderful, the rooms were clean and comfortable. The breakfast was very good and the restaurant has reasonably priced food that is delicious.", "title": "Great stay!", "user": "clynnglover", "date": "February 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 125380120}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I recently stayed for six nights at the Embassy Suites in February. The front desk was polite and efficient. The hotel was clean and well maintained. While not up to the luxury of many of the hotels on Las Vegas Boulevard, the room was clean and spacious. I had a room with a handicap bathroom - avoid this type of room unless you need it. The bathroom was dimly lit and offers no surface to spread out your toiletries. I used a rental car for my trip, so I had no problem getting around the city. When I did try to use a cab, the front desk was unable to get one appear - I think this is the price of being off The Strip. Breakfast was consistently good and the manager's reception was appreciated on a couple of nights. In general, the hotel was fairly quiet. The walls are paper thin, so if your neighbor invites a few ladies over for a party - you will hear every detail. If I was traveling to Vegas for business, I would strongly consider staying here again.", "title": "Quiet Refuge from The Strip", "user": "Mark M", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 125342752}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Embassy Suites is pretty much my go-to hotel in any city I travel to. Vegas is no exception, I may even classify it as the shining star. The front desk staff bends over backwards for you, they are almost scary at how they are able to solve some pretty tricky issues! Tad and the rest of the bar staff make the Manager's reception a great time, and they manage to handle some pretty crazy surges of people. This hotel is always friendly, always clean, always just overall awesome. Free drinks, indoor pool, modest workout room, excellent cook to order breakfast...off the strip but a shuttle to get you there and no more than a $15 cab (including tip) from the farthest reaches to the strip to get you home.", "title": "It's my Vegas Home", "user": "NRAGuy4Life", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125008321}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Only suggestion, if you are looking for a quiet evening, make sure your room is not towards the front of the hotel...as the managers reception can get loud, and it's on the 3d floor in the middle of the rooms. I usually try to get the 3d floor right by the bar! :) But that is just me.", "title": "Good but comparatively pricey", "helpfulness": 1, "user": "Ron B", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124905295}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "We were in Vegas with tween kids for an event and this place was perfect. The kids can safely help themselves to the pool and the breakfast without wading through the casino. I like casinos but not with the family. All was good here we rented a car and went to a casino when the time was right.", "title": "No smoky drunken casino.", "helpfulness": 1, "user": "BeachBum92130", "date": "February 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 124129895}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I really like staying in Embassy Suites hotels. I have stayed in Embassy Suites hotels in Seattle, WA, Portland, OR, and Denver, CO. The check-in staff was nice and I got a upper floor room as requested. One thing I did notice in the lobby is you can smell the chlorine from the swimming pool but not in other places of the hotel. The room was clean and the bed was comfortable. When I arrived at the mangers reception there was only popcorn! Usually there is veggies and dip, chips and salsa, and some other things to eat. It was a few days before Christmas and maybe because there were no business travelers they didn't have the usual managers reception? The lady working at the managers reception was very nice to talk to. My husband and I slept well until we were awaken by the fire alarm at 7 am. We wanted to sleep a little longer since we were tired from traveling the day before. We did enjoy our breakfast. Since I have read about the fire alarm issues in other reviews, I'm not sure if I would stay here again.", "title": "Good place to stay but mangers reception was disappointing.", "helpfulness": 1, "user": "Candace71", "date": "January 27, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 3.0, "value": 3.0, "rooms": 4.0}, "id": 123680455}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "Unfortunately I travel to LV many times aa year. This hotel is centrally", "title": "Good hotel off strip", "helpfulness": 1, "user": "Louise40", "date": "January 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 123670839}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Located, clean and most importantly off the strip, a shuttle is available to the strip. Evening reception is good and breakfast excellent. I have stayed here for 10 years now.", "title": "Quiet, smoke-free, excellent service, comfortable rooms", "helpfulness": 3, "user": "sbmNewMexico", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123282207}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "My husband and I have stayed in several hotels on the Strip when coming here for business conventions. Because of our positive experiences with other Embassy Suites, we decided to stay here this time, and have decided this will be our first choice for future stays. We do not gamble, are both allergic to cigarette smoke, and don't care for the crowds/lights/hustlers/pace of the Strip. Las Vegas will never be a vacation destination for us. That said, for a business stay, the Embassy Suites Convention Center was perfect for our preferences. It is close to both Convention Centers (walking distance or short cab ride). It is quiet and smoke-free. The rooms are large, clean, and very comfortable, with plenty of counter space in the bathroom, a separate mini-bar with refrigerator, microwave, coffeemaker, small sink, comfortable overstuffed chair and couch in the seating area, and a table large enough to spread out a laptop and files. We liked the quality pillows and very fluffy towels. The business center has two computers and a printer, plus a separate table with common office supplies. Complimentary breakfast, as others have noted, is generous. Service was consistently capable and friendly. We'll be back.", "title": "Nice and quiet", "helpfulness": 1, "user": "aussiekiwi_boy", "date": "January 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122777753}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 3.5, "variance": {"poor": 30, "average": 90, "very good": 189, "terrible": 20, "excellent": 190}, "aka": "Embassy Suites Convention Center Las Vegas Hotel Las Vegas", "slim_ranking": 0.318518518519, "description": "The Embassy Suites Convention Center Las Vegas hotel is in prime location near the Las Vegas Convention Center, Sands Expo and close to the famous “Strip”. The location paired with the large variety of amenities make Embassy Suites Convention Center Las Vegas hotel a great choice for both leisure and business travelers. The all-suite hotel proudly offers spacious two-room suite accommodations. Each beautiful suite features a private bedroom and separate living room, dining/working table, two televisions, two telephones, Internet access, wet bar, fridge, microwave, and coffee maker. Guests are invited to a complimentary full cooked-to-order breakfast and complimentary drinks in the evening at the Manager’s Reception. The on-site Restaurant, the Fountain Grille Restaurant, serves lunch and dinner in a casual setting. Room Service is also available daily for guests. Business travelers love the convenience of the business center, meeting rooms, printing and copying service and audio/visual equipment rental available. The hotel also offers guests access to the on-site fitness center, indoor pool and sundeck. Guests of the Embassy Suites Convention Center Las Vegas hotel enjoy nearby attractions such as the Las Vegas Strip, Fashion Show Mall, Fremont Street Experience, Lake Mead, Hoover Dam and more!"}