{"user_rating": 3.5, "review_count": 849, "name": "Embassy Suites Philadelphia - Center City", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This was my greatest disappointment of the trip to Philadelphia.", "title": "Great disappointment.", "user": "Haim L", "date": "March 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 156088768}, {"rating": 4.0, "title": "Very nice", "text": "Will never return to this hotel. It is old, dusty, noisy and poorly maintained.", "user": "Pace163", "date": "March 29, 2013", "id": 156012736}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The staff tried their best, but I wouldn't call anyone late at night to drain the water from the bath...", "title": "Pretty good", "user": "gobigredone", "date": "March 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 155851544}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Stayed here with my sons over spring break. Good location for museums. We walked to Franklin Institute and museum of art. We walked to restaurant row and to the IVC. Rooms are large enough. Major drawback was that wifi was a daily fee of $16 per day.", "title": "Huge rooms may it great for large groups", "user": "RyanBonner", "date": "March 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 155840937}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I mean it was OK...but I guess I just expect a little more from a Hilton property. Every staff member we encountered was very nice and always smiling and ready to help. But there was just a lot of little things that combined to make our stay not quite perfect...nothing huge...but it all adds up I guess. We waited a solid 15 minutes to drop off our car. The happy hour is a joke...various bad food (goldfish crackers, veggies and chex mix) and the drinks are all horrid rail drinks. Also there were so many people down there you couldn't find a place to sit unless you claimed on 20 minutes before the happy hour started. The free \"made to order\" breakfast is no better than the free continental breakfast at any budget hotel. The wait for the elevator was excessive on MANY occasions. And it was so weird that when it was full...it would stop at every floor anyway...shouldn't it just express down to the main floor when there's no more room to pick up more people? The fan seemed to never stop blowing and the bedroom was really cold compared to the living room.", "title": "top-rate stay", "helpfulness": 1, "user": "rocksquawk", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155559673}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I requested the negotiate corporate rate of $129/night. The reservation was accepted and I was surprised at check out with a rate of $455/night. I could have stayed at the Four Seasons across the street for $100 less per night.", "title": "Watch your confirmed rate...", "helpfulness": 1, "user": "Reid C", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 155373788}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "We picked the hotel because of the great location near Logan Square. The best part of this hotel is the large suites - roomy with plenty of furniture. The mini kitchen is great, but not all the outlets worked and the bedroom never really got very warm, compared to the living room. The lobby is nice but the happy hour is pretty pathetic. All the hot food was gone in 15 minutes and never got replenished. Breakfast is served in the TGI Fridays restaurant attached, but it was too loud and busy to enjoy a drink in their bar the evening we checked in. Instead, we went next door to the very nice Four Seasons for drinks and appetizers.", "title": "Great location but amenities just so so", "user": "Denise G", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154757281}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This was the first time we stayed at an Embassy Suites Hotel and we were pleasantly surprised. Included in our room rate was a complimentary breakfast, evening reception and internet service. Our suite included a spacious living room, dining room, kitchen, bath and bedroom. Our balcony overlooked Logan Square. The front desk staff was very accommodating and arranged for late check-out. We would definitely recommend this hotel which is located in the heart of the downtown area, making it convenient to all the attractions.", "title": "\"An enjoyable getaway\"", "user": "Catherine B", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154755600}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We stayed here just one night, but have stayed here in the past and love this hotel. Love the weird layout of the rooms. It used to an apartment building and spend a lot of time trying to figure out where things would have gone. The managers reception is great. Especially soft pretzel night! Hotel is an easy walk from most places. Yes, parking fees are crazy, but they are just in line with all the other hotels in the area. Elevators can be a bit of a wait and you never know which way to turn to find your room! We'll be back!", "title": "Unique hotel in center city", "helpfulness": 1, "user": "wavelets", "date": "March 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 154683144}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Stayed here on Sunday, February 24th with 5 other ladies using a special groupon rate of $99 plus tax. WOW! The room we had was one of the largest suites we've ever experienced! We were in awe at the size of the room. Plus every room has a balcony! Talk about \"roomy\". The hotel only has valet parking and the price was a bit steep, but the guys who took care of us were extremely helpful and friendly. The view of the city was spectacular. The lobby had very comfortable chairs for lounging. The free breakfast buffet at TGIF's was decent. Our only complaint was the 'food' offered during happy hour; gold fish crackers and tortilla chips & salsa; something a bit more appealing would have been nice. We will DEFINITELY stay at this hotel for our next outing into downtown Philly!", "title": "Girl's Night Out", "user": "Ridley Girl", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154572693}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We recently returned from a 6 day trip to the fabulous city of Brotherly Love where we were lucky enough to stay in this wonderful hotel. Cannot fathom the oft negative reviews of this hotel - perhaps people are a little bit too fussy??", "title": "Home from home with impeccable service", "user": "jimbojetset", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156419057}, {"rating": 3.0, "title": "A bit of a disappointment", "text": "Can't find negatives to report of in any area of the hotel. The suite itself was massive with a well appointed living area, a kitchen type area with microwave oven and a Fridge, a clean and modern bathroom, a well lit dressing area and a good sized bedroom with two sumptuously comfy beds which my Girlfriend commented on being the most comfortable bed she had ever slept on as she suffers from chronic pain. The icing on the cake though were the balconies which provided a starlit view of the surrounding skyscrapers (providing you ain't scared of heights)", "helpfulness": 1, "user": "L_CLE", "date": "April 1, 2013", "id": 156304106}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Breakfasts in American Hotels often leave a lot to be desired and quite often consist of one limp donut accompanied with a cup of weak and lousy coffee - need not fear at the Embassy, oh no, in fact the breakfast here was by far the most impressive we have seen at any American hotel with a varied choice ranging from a selection of cooked breakfast items, fruits and yoghurts, a varied selection of cakes and pastries and a cook to order Omelet station.", "title": "Quite a bit less than stellar", "helpfulness": 1, "user": "MackDaddyCope", "date": "April 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 156256847}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The service from the staff employed in all capacities was faultless. From the minute we checked in to the minute we departed everyone was so friendly, warm and approachable and nothing was ever too much trouble. Special praise to both Jackie and Whitney on the front desks who catered to our requests with a smile. Also praise to the chap manning the bar who remembered my choice of beverage 'Vodka and OJ!' Speaking of the bar, another perk the hotel offers is complimentary drinks between 5-8 ( i think) where you can choose from a selection of drafts and well drinks - this is not the sort of perk you encounter in most hotels and was a pleasant surprise.", "title": "Two-day business trip.", "helpfulness": 1, "user": "Joe A", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156237915}, {"rating": 2.0, "title": "Very disappointing - not worth price!", "text": "All in all an excellent stay and one i would highly recommend to anyone looking for a reasonably priced stay in a top class hotel a mere 10 minute walk from the centre of town.", "helpfulness": 1, "user": "lmwalker32", "date": "March 31, 2013", "id": 156131008}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We got an outstanding deal for a room here to celebrate my birthday.", "title": "Very large rooms, good value, but noisy", "user": "Matt K", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 154529044}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The rooms themselves are huge, with couches, a wet bar, micro fridge, table, etc. The bedroom was nice and the room did feel upscale. The problem is that it was quite noisy. The A/C unit hidden in the wall was very loud, and kept my fiancee up all night. The mini fridge had a slipping belt and was very loud and annoying- I should have unplugged it. The ice machine was opposite my room and also irritating. There was a bachelorette party next door, and that was loud.", "title": "Always a great choice!", "user": "Matanda28", "date": "March 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154294105}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Happy hour featured free well drinks, beer and wine selections, and munchies. It gets packed on weekends with the wedding crowd. The free breakfast is upstairs from the TGI Friday's on the property. It is standard breakfast fare, and is reminiscent of a college cafeteria. I found a lot of the food selections to be not very hot, and the room was set up somewhat poorly. But, it was free. Also wifi was NOT free, but you might be able to get ATT wifi. Parking is pricy but convenient.", "title": "Great Stay", "user": "MarylandLadyBug", "date": "March 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 154114679}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I might consider staying here again, especially if you have a group \"activity\" like a guys' weekend type thing, since the rooms are huge... but I hope all the rooms do not have such a noise problem.", "title": "It has it's pluses and minuses.", "helpfulness": 1, "user": "TinaCara", "date": "March 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154103390}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I stay at this hotel whenever I visit Philadelphia, and it never disappoints! The day we were set to check-in I got very sick, and when I called to see what I could do about changing the reservation, they were more than happy to change the booking to the following weekend at no charge. Most hotels would not have been so accomodating, so I was really impressed.", "title": "Big Rooms", "user": "dugsage", "date": "March 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 154081170}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 3.5, "variance": {"poor": 63, "average": 182, "very good": 322, "terrible": 52, "excellent": 230}, "aka": "Embassy Suites Philadelphia", "slim_ranking": 0.535714285714, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "All suite, full service hotel, TGI Friday's attached to hotel, guest laundry, fitness room, valet parking available. All suites have kitchenette area, balconies with sweeping views of the city, two televisions, two phones, living, dining, work areas, separate bedroom with choice of one king or two double bed. Queen size sleep sofa in living room."}