{"user_rating": 4.0, "review_count": 327, "name": "Embassy Suites Phoenix-Scottsdale", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We stayed here 4 nights over the Christmas Holidays. The best parts of this hotel are the breakfast and the complimentary drinks at night. I should also mention the kids liked the pool because it was warm.", "title": "Very Average Hotel", "helpfulness": 3, "user": "cowboys", "date": "January 13, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 53410147}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "However if hot water is important to you when taking a shower or having your room cleaned well maybe you should stay elsewhere. Every morning we had to waste water (desert) by running the hot water (4-5 minutes) so it would warm up so you could get into the shower. My expectations for a shower is that when you turn the temp to the highest setting it should be too warm so you have to adjust it down a little. However not in this hotel as you cranked it to the hottest setting and hoped it might get up to a warm level. Also one day our room was not cleaned...we called down to the front desk at 5pm to let them know and then we went out for dinner. When we came back around 10pm the room was still not clean. Would I recommend this hotel.......No.", "title": "Spacious rooms and friendly staff", "helpfulness": 2, "user": "slkw", "date": "January 2, 2010", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 52411798}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "We stayed at the Embassy Suites over Christmas vacation. The rooms are some of the largest we have been in and the cooked to order breakfast was outstanding. When our daughters came down with stomach flu in the middle of the night and we had a housekeeping issue the night manager switched us to a clean room immediately. The pool which is on the golf course with a view of the mountains is very large and heated (the temperature was in the fifties and sixties). There is also a large outdoor hot tub.", "title": "Not up to Par", "helpfulness": 3, "user": "AtlantaGirl11", "date": "November 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 50347998}, {"rating": 5.0, "title": "THIS IS A DEFINITE PLACE TO STAY.", "text": "Compared to other Embassy Suites we've stayed in, this one was not up to Hilton's usual standards. This hotel definitely have a maintenance management problem. Our room overlooked a small roof which was filthy with bottles, cans, cigarette butts and a cigar. (See picture). We mentioned this to the desk the first day, but it was never cleaned up. There were lights out in the parking lot in the handicapped area and in other areas, Lights were out in the hanging pendants in the restaurant, and red duct tape was holding a piece of wood molding on in the lobby area. We stayed 6 days here and I don't believe our room was ever vacuumed. The room itself was very pleasant, along with the breakfast buffet each morning. There is a nice lobby/bar area but not the big, fancy atriums Embassy Suites usually have. The $15 per day room internet charge is atrocious.", "helpfulness": 1, "user": "rixter26", "date": "November 13, 2009", "id": 49090865}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Beautiful hotel, beautiful grounds. Friendly staff. Awesome happy hour/snack buffet! Great pool and hot tub. Rooms were spacious and we got two rooms across from one another. Both had amazing views! This hotel is also within walking distance to several restaurants and Paradise Hills Mall as well as a Target. Will definitely stay here again if I'm in this part of the city.", "title": "A great place to stay!", "helpfulness": 2, "user": "tracytj", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48454598}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I got this room for a deal at $59 a night. Problem is they stuck us by the elevator - room 3002 to be exact. So right now I am hearing the sound of the elevator door opening and closing with a loud bang about every 3 minutes. In short - tell them you do not want a room anywhere near the elevator! Other than that if you get the room on priceline or hotwire you can stay for a good rate.", "title": "get a room - not by the elevator", "helpfulness": 1, "user": "CVCVws", "date": "February 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 57045954}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "We stayed here for 3 nights for a conference. We chose this hotel because the conference was located here and we did not want to rent a car and drive each day to the conference. However, if you choose to rent a car, parking is free.", "title": "Good business hotel with golf course", "helpfulness": 3, "user": "Sightseeingtheworld", "date": "January 18, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 53814789}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This is the second time we've stayed here and it continues to provide great value for money. The quality of the food at breakfast is good and the manager's reception in the eveing is a nice way to end a hot, busy day. My sons enjoyed the pool and the adjacent driving range where they could purchase 100 golf balls for under twelve dollars with clubs included. The staff were all very pleasant and always keen to help.", "title": "Teenagers loved it.", "helpfulness": 2, "user": "Simba-Mark", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73266403}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The only drawback was the wifi connection was variable and we had to frequently reconnect.", "title": "Typical Embassy Suites", "helpfulness": 1, "user": "DKKT", "date": "July 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71541344}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Having said that we will definately return for a third time.", "title": "Nice Place - Great Location", "helpfulness": 2, "user": "dsmiley", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68529600}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Pros: big rooms, golf course on-site, full restaurant, stores/shopping nearby, nice fitness center, great value/price.", "title": "Awesome", "helpfulness": 2, "user": "ClashJam", "date": "June 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 68134315}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "Cons: additional high-speed internet fee - even for Hilton Honors members ($14.95 per day) unless you take your laptop to front desk area, may choose a different hotel next time based only on location.", "title": "Excellent all around", "helpfulness": 1, "user": "happymoves", "date": "March 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 58235259}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "In preparation for this years' snow-escape trip to Scottsdale, we decided to try the Embassy Suites. We were pleased with the location and its easy access to Scottsdale Road (north or south). We also found the route to the Barrett-Jackson Auto Auction was less complicated than other parts of town we had stayed at in the past 10 years. The free breakfast and manager's happy hour helped keep our meal and beverage costs down a bit and the hotel is next to a great looking golf course and plenty of shopping. The nights were quiet, the rooms were large and the beds were just firm enought for a greats' night sleep!", "title": "The Suites were Sweet", "helpfulness": 1, "user": "GOmaha", "date": "January 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94509009}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I stayed such a long time ago that I won't write a detailed review. However I wanted to post my pictures and a couple comments. I traveled on a business trip in March 08. I was there for an in the hotel conference so I didn't ravel outside the hotel too much. The hotel sits along a golf course so the pool view although small, was not too bad. I have stayed at many hotels in the Embassy Chain and this one is better than most. Rooms were nice, clean, and updated. The complimentary hot breakfast with omelet bar is always good and the evening reception with free drinks is great, especially in AZ where the reception is out on the patio... even in March! I was in Rm 6031 which was on the parking lot side, so the view was.... not so good. The Fitness Center was adequate, treadmills and decent weights. There was a free shuttle to the 5 mi radius. Front desk and all employees were very friendly and helpful - always nice when a single lady is travelling alone! I highly recommend!", "title": "Good Hotel!", "helpfulness": 1, "user": "dgadwa", "date": "January 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 93676537}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "This hotel was one of the nicest places I've stayed in. The rooms were extra clean, the beds were comfortable, and the free breakfast was delicious. I would highly recommend staying here. If I had one complaint it would be that we had numerous problems with our room keys and they couldn't solve the problem. We complained to the front desk many times, but the keys failed to work over & over again. Besides this one glitch, all of the employees were extremely friendly and I felt very welcome here. I would highly recommend this hotel!", "title": "Fantastic place to stay", "helpfulness": 1, "user": "Judee512", "date": "January 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92200573}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "The Embassy Suites Phoenix-Scottsdale is a very nice place to stay and a better than average Embassy Suites. The hotel sits adjacent to a golf course in a nice area. However it’s nowhere near the restaurants and major malls of Scottsdale.", "title": "Excellent Value", "helpfulness": 3, "user": "UCONN_Fan", "date": "January 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 91869442}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Here’s the deal:", "title": "average--good pool, poor breakfast, horrible tv's, nice bed", "helpfulness": 3, "user": "sue32846", "date": "January 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 91479529}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed at this Embassy one night during a several night vacation. The hotel is on a golf course and we requested a room with a view of the golf course and mountains in the background-it was very nice. Our room had a balcony with chairs and table so you could enjoy the view.", "title": "Nice hotel for family trip", "user": "ALJARN", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37362647}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "The rooms were large and comfortable. The outside sitting area had the usual Embassy furnishings-table/chair/sofa sleeper, kitchenette area with sink, fridge and microwave. Bathroom was two rooms-one with vanity, one with shower and commode. All rooms were clean and linens were fine.", "title": "Very nice hotel that is conveniently located.", "user": "hotpapa1219", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 36713251}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Pool area was large with large area for sitting/lounging.", "title": "Definitely Three Stars, No More, No Less", "user": "hotelsnob96", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 36068394}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Evening reception was nice-soda, alcoholic beverages and snacks. Morning breakfast bar was wonderful with an omelet bar, scrambled eggs, bacon, sausage, fresh fruit.....very nice.", "title": "Nice hotel, but not the best", "user": "stevenandrophy", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34536044}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Location is on the north side of Phoenix, easy to access from the Interstate. Overall, a good hotel.", "title": "Very beautiful on a very beautiful golf course!", "user": "NorthTexasRealEstate", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 33622284}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "After a nightmare at Day’s Inn my wife and I decided to stay at Embassy Suites. All rooms come with a separate bedroom. Our early check in was greeted with a warm and friendly smile. They had plenty of rooms (off season) and we had no problems getting a room well before the check in time of 3PM.", "title": "Elegent Style and Friendly Service", "helpfulness": 17, "user": "scott104", "date": "July 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3696666}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Our room was extremely clean. Our balcony on the 6th floor overlooking the golf course and the majestic mountains in the distance only fit two people. You can enter in the bathroom from the bedroom or the living room. The kitchenette provided us with a coffee maker, refrigerator, and a microwave. The bedroom closet included a room safe and ironing board. All the essentials you need while traveling.", "title": "Great Stay", "helpfulness": 11, "user": "eslkerry", "date": "June 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3576363}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here for 3 nights. We upgraded our room to the golf course view which was lovely. The rooms were clean and spacious, and bed comfy, although the couch had some worn places and footstool was marked. It was a good location, and close to shops and restaurants. The complimentary breakfast was great - super custom- made omelets a bonus, and the evening reception (although we only went once) was a nice touch. The front staff were helpful and willingly ran off computer printouts of driving instuctions we requested. The pool was clean, and a decent size.", "title": "Great spot", "helpfulness": 3, "user": "marbo05", "date": "October 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84842925}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "It was very busy on one day of our stay (business conference), but found our room very quiet.", "title": "We wanted to like it, but.....", "helpfulness": 2, "user": "linwhs66", "date": "October 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 84814678}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "We have stayed here in the past, so we were expecting a pleasant stay. First, the positives. The view of the golf course and mountains was gorgeous. The room was a good size and clean. The bed was good. Now the negatives. Although we requested a quiet room, we had outdoor weddings right below our room on both Saturday and Sunday nights with DJs and lots of noise. Apparentally this is somewhat common in October and November. The hotel was full and there were not enough tables at breakfast and they were out of coffee, etc. We didn't go to the free cocktails, again due to long lines and lack of seating. I don't think we will stay here again and will look elsewhere in a market full of alternatives.", "title": "Clean and quiet", "helpfulness": 1, "user": "nostink", "date": "September 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81617522}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "If I'm going to throw down $150/night for a room, I expect the wireless internet to be free; not an additional $15/day. I'm an online student and need access to internet service everywhere I go. Not to mention there was a clear lack of management. Cleaning crews struggled with cleaning. We walked by a dinner platter located outside the door of a neighboring suite for 2 days, before we finally had to call and ask someone to come pick it up. Although the view is nice, this hotel is overpriced and not well managed, and the HILTON chain needs to wake up and realize they are ripping people off!! Even Motel 6 can offer free internet, or Starbucks for crying out loud and they're not charging hundreds of dollars to stay in a stinky, unkept mess of a hotel. I would not recommend this hotel to anyone.", "title": "Hilton rips off their customers!", "helpfulness": 1, "user": "stoumbaugh", "date": "November 1, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 48293395}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "We spent 4 nights at this hotel the week of Oct. 7th while my partner attended a seminar and to visit family. The location is sort of out the way from most attractions in Phoenix, a reason the front desk used to justify the $15 per day charge for wi-fi. The rooms, while large, are rather dated and not in the best of shape. Our room (actually a 2 room suite had wallpaper that was loose and dirty carpeting. In fact, housekeeping did not vacuum the carpets for the first 3 days. While we had 2 flat panel TVs, the selection of stations was very limited.", "title": "Just so-so hotel with exhorbitant wifi charge", "helpfulness": 1, "user": "Tim&Bill", "date": "October 13, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 46800384}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Some things to beware of if you choose to stay here: The $15 a day charge for wi-fi (the rooms at one time allowed hispeed connections, but that has been discontinued; no coffee is available in the lobby after breakfast (you can buy a cup for $3.50 at the bar; the bottle of water in the room costs $4.95 per bottle (not a big bottle either); and beware if your credit card is also a debit card. They put a hold on a significant portion that can take up to 3 weeks to get released; I found it interesting that when I commented on the wi-fi charge, the person at the front desk later tracked me down and gave me an article on hotels charging for wi-fi. The basic premise is that since people now use cell phones, hotels have lost a big source of revenue from the use of in-room phones so thay make it up with wi-fi charges. When I stated that many hotel chains and mom & pop motels provide it free, the person argued with me and said he had worked in a number of hotels and they all charge for wi-fi.", "title": "Quiet my foot!", "user": "TravelLady511", "date": "October 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45765840}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 17, "average": 47, "very good": 133, "terrible": 4, "excellent": 126}, "aka": "Embassy Suites Phoenix-Scottsdale Hotel", "slim_ranking": 0.209039548023, "description": "Casual contemporary atmosphere. Each of our 270 two-room suites features a separate living and sleeping area,private balcony, galley kitchen with microwave, wet bar, refrigerator and coffee maker. Two TV's with remote controls, two phones with high speed internet. Dressing area, in-room safes. All suites have spectacular views of the golf course or surrounding community."}