{"user_rating": 4.0, "review_count": 432, "name": "Embassy Suites Atlanta - Buckhead", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "My wife, young son and I stayed at the Embassy Suites Sept 10-12. As others have stated, the hotel is very nice. Rooms are spacious, clean and comfy. Staff were all friendly, and check-in and parking were a breeze. Location could not be better for proximity to Buckhead restaurants and malls. We had a few minor annoyances during our stay, such as an elevator problem the last morning we were there, but that stuff happens and the hotel had repair personnel on the scene quick. The breakfast buffett on the weekends does get crowded but it is not unbearable. We got an Advance Purchase option for $89/night which is a great value for the Buckhead area. We recommend this hotel to anyone seeking 4-star quality at a 2-star price!!!", "title": "Great value hotel for Buckhead area!", "helpfulness": 2, "user": "KROG7", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79421349}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Checking in we were put in a room where someone had smoked. We were moved to another room. For 10 days one of the computers were not working they only had 2. could not get on facebook would not let you in. I was very happy with breakfast . Housekeeping skipped us a few times had toask for towels not sure if they were short on staff or not. We did like the fact that the hotel did offer rides within 1 mile of the hotel. Lobby was very nice. Bedding need to be updated it was a little worn.", "title": "Could have been better", "user": "nannatwo", "date": "September 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 78699333}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We live just an hour north of Atlanta and came to big city for a weekend of rest and to take in some of the attractions that Atlanta has to offer. We chose Embassy suites for it's convient location and amenities. We were not disappointed. Since our last visit, they have remodeled the rooms and they were stunning, and spotless, I might add. We will definitely be back!!", "title": "Fantastic Getaway Weekend", "helpfulness": 1, "user": "lambcountry", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77741451}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "PS...the bed was so comfortable I didn't want to leave on Sunday!!!", "title": "Buckhead...breakfast boogie at Embassy in Buckhead", "helpfulness": 1, "user": "Goldengoddess_10", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 76847272}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I love the location of this hotel because restruants and shopping are all withing walking distance. Plus, the Mata is within walking distance as well. My friends and I had a wonderful time. The view was of the lovely peachtree rd. Our room was nice and comfortable. The happy hour was just ok....could work on the snacks (they served chex mix typed snacks). Embassy suites has a great breakfast u name it they've got it (no matter whether you like hot or cold food)", "title": "Great location and great hotel!", "helpfulness": 1, "user": "RealJohnWeldon", "date": "August 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76673998}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Stayed for 5 nights in November. Pond in the lobby with huge koi. Typical Embassy Suites room layout, although the room seemed more modern in decor than many Embassy Suites. It was clean, staff helpful, etc. For the morning breakfast there was usually only one person preparing the hot food (eggs, etc). He was very effecient but this often resulted in people having to line up and wait. In other Embassy Suites it's more of a buffet set up and you only wait in line for omelets. Coffee was horrible. There were times it was very crowded and difficult to find a place to sit during breakfast and during the nightly manager's reception (bartenders were all very friendly). The business center consisted of 2 computers, a fax and a broken printer (broken the entire stay). I had an urgent email attachment to print (regarding an employment offer). The front desk staff let me forward the email to them and they printed it for me which was great. No pens in the business center. 2 computers really isn't sufficient for a hotel with over 300 rooms. Often had to wait quite a while for one to be available. Self parking with in/out availability $18 per day which is probably on the reasonable side for Atlanta. WiFi in the room $10 per day and at this point hotels really need to stop charging for WiFi in the rooms. Location was great for our purposes to see the city. Even with the somewhat negative aspects I would definitely stay here again. Got a really good rate with AAA.", "title": "Nice but could be much nicer with minor improvements.", "helpfulness": 2, "user": "Westshore", "date": "November 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 88669316}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My wife and I stayed here for a football weekend. The room had a King bedroom and separate living area with a couch. There is a TV in the living area and bedroom. The TVs are LCD but they do not have HD service in this hotel. In fact, the picture was a little snowy. Since we were interested in watching a football game in the room this was disappointing.", "title": "Comfortable Room", "helpfulness": 2, "user": "W4ATL", "date": "November 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88536147}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The bed was comfortable and HVAC quiet. There is a sink in the bathroom and another separate sink in the bedroom. There is a nice big work table for businessmen to work in the living area.", "title": "Great Location for a Conference", "user": "GoldenRetrieverKatie", "date": "November 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87608055}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "We used valet and they seemed confused that we were checking into the hotel. It took almost 2 minutes to get them to take the car so we could check in. They got the car very fast the following morning.", "title": "Horrible customer service!!", "user": "heatherinafrica", "date": "November 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 85961918}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "This hotel is about 2 blocks from a MARTA station. Another 2 blocks is Lenox Mall. There are some nice restaurants within walking distance. Try Nikko Bistro which is one block north on Peachtree St. just across the street from the hotel. They have a nice bar and excellent food. If you don't want to walk anywhere then there is a nice Ruth's Chris Steakhouse on the lobby level of this hotel.", "title": "Great Price, Great Location", "user": "Dallasmom316", "date": "October 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84535332}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I'm always worried about extraneous noise in a hotel. I thought Buckhead might be exempt from such annoyances. I was wrong. We spent a Saturday night in the ES Buckhead. There must have been 8 young adult males crammed into the room next door. The bumping and talking and door slamming went from 1am to 4am. We called the desk 3 times, and each time the security guard came and asked the \"kids\" be quiet. That worked for about 15 minutes. Next time we'll stay somewhere else.", "title": "Nice hotel but next door guests kept us up all night", "helpfulness": 1, "user": "wxjeff6", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 82508738}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I will state up front that I may have a favorable bias toward the Hilton chain; however, that being said, I also may have a bit higher expectations for this chain. I have stayed at this hotel on a couple additional occasions in addition to the 9/2010 visit.", "title": "Solid Choice, Great Location", "helpfulness": 1, "user": "gmead7", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 80988369}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "What I didn't like about this hotel: There was a minor glitch in the check in process where I was given the key card, but apparently it was not programmed correctly. This is always an annoyance as after getting through TSA, flying, MARTA and a small hike, I was ready to relax and hauling my luggage up and down a second time didn't start me off on a positive note. I really think when this happens the staff should be trained to automatically smooze the customer - a couple candy bars, some bottle water, some hhonors points - something to take the edge off the annoyance.", "title": "Busy but Quiet", "helpfulness": 2, "user": "CTripleS", "date": "September 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 80615341}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The other think I don't like about this hotel is the bedding. If you shake the sheet you will get little particles / lint flying around. I have allergies and very sensitive to air quality so this is a concern.", "title": "Just OK", "helpfulness": 1, "user": "PSBTEXAS", "date": "September 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 80359358}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The Good - As with all Embassy hotels - the manager's reception and breakfast is always a nice perk. I would love for the chain to consider some innovation with the hot breakfast - not everybody likes eggs - hot pancakes, waffles or biskets and gravy would be nice. Also, the potatoes are downright terrible (at all Embassy breakfasts). They should move toward the shredded potatoes like the hash browns at Denny's. At this specific Embassy, it would be nice if you could get water at both stations (not have to walk all the way over to the other side in order to get a glass of water).", "title": "Great location", "helpfulness": 3, "user": "JellyRolling", "date": "September 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79525193}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We got a great package deal with them called \"Staycation\".....free parking, two $25 gift certificates for food & shopping nearby + their usual full breakfast and cocktail hour, for $149/night.", "title": "Great Hotel....but", "helpfulness": 1, "user": "mamagoogoo", "date": "October 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84132469}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The only glitch was we never got our room cleaned by even 3:30 p.m. After a day of sightseeing and need to rest & shower, we had to wait till the woman came by.", "title": "Awesome Hotel, Awesome Staff, Awesome Location", "helpfulness": 1, "user": "TravelHombre", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84084908}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "After 2 days, we just took the towels & toiletries and gave up.", "title": "Oner of the Best Hotels ever!", "helpfulness": 1, "user": "Christinam901", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83213814}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Also, the toilet was not working good and it took them all day to get a maintenance guy up their to replace the mechanism.", "title": "Best Value in Buckhead", "user": "DagnyTaggert", "date": "October 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82973206}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I would go back there again despite these annoyances.", "title": "Great Value great location.", "helpfulness": 1, "user": "JudyNewtown", "date": "October 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82737886}], "location": {"country": "United States", "city": "Atlanta"}, "stars": 3.5, "variance": {"poor": 41, "average": 82, "very good": 173, "terrible": 18, "excellent": 118}, "aka": "Embassy Suites Atlanta - Buckhead Hotel Atlanta", "slim_ranking": 0.479166666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Only all suite full service hotel located in the heart of Buckhead. Newly renovated boutique style property features Ruth’s Chris Steak House. All guests receive Complimentary Cooked-to-Order Breakfast and a Manager's Reception daily. Short walk from world class shopping at Lenox Square and Phipps Plaza. Two blocks from MARTA which will transport you to all local destinations including the airport, convention center and the Georgia Aquarium. Free shuttle provided within one mile of the hotel."}