{"user_rating": 4.0, "review_count": 313, "name": "Embassy Suites Denver-International Airport", "reviews": [{"rating": 3.0, "title": "Adequate ", "text": "Stayed one night before an early morning flight. Quick check in, room was adequate, somewhat dated but everything was clean. The free cocktail hour including beer and wine which was nice. The snacks they provided were a little cheesy but were a nice touch. Kids loved the \"waterfall\" in the lobby.", "user": "trippinmama", "date": "November 20, 2013", "id": 185302094}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "My hubby and I stayed here because we wanted something close to the airport for a 6 AM flight.", "title": "Great place to stay", "user": "Connie E", "date": "November 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184621394}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The service was exceptional from all staff. The room was very clean and the bed was so comfortable!! I was very impressed.", "title": "Lovely!!!", "user": "Jettie070", "date": "November 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184410791}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "We had free snacks and drinks in the lobby area. I think it was from 5:30-7:30.", "title": "Outstanding in all aspects!!", "user": "Colette G", "date": "November 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 184377365}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "The facility has gorgeous decor. We parked our car for free while we were on a week vacation . A quick call when our baggage was being claimed and we were quickly picked up and brought back to the hotel.", "title": "Great place to stay, close to the airport", "user": "Bridgit S", "date": "November 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 184021468}, {"rating": 4.0, "title": "Excellent Hotel", "text": "This is a great property with wonderful ammenities. the cocktail reception is fun and the breakfast is amazing! the property is a safe and quiet location considering how close it is to the airport. I wold highly recommend this hotel to any traveler that needs access to DIA!", "user": "A TripAdvisor user", "date": "November 6, 2013", "id": 183862951}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I am so happy we chose Embassy Suites Hotel for our place to stay. There are so many choices but this was such a nice place. I would recommend it to everyone who is not quite sure where they want to stay. Staff, room and facility was fantastic! We will be back.", "title": "Best place to stay!", "user": "Vicky G", "date": "November 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183604485}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We love Embassy Suites but this is dreadful exception to the brilliant brand. We waited 30 minutes for the courtesy bus at the airport despite 2 phone calls. Not good after a 10 hour flight. They said they were busy when we complained! (Although in general the staff were good.) There were holes in the carpets and chairs. Heavy duvet on the bed and no blanket option. Sheets not ironed. No free WIFI. At dinner the food was average at best, certainly not great. We went to breakfast 5 mins after it opened and already the biscuits were hard/stale, the coffee was lukewarm and the potatoes actually cold. Absolutely dreadful experience.", "title": "not worthy of the brand name", "user": "merionvw", "date": "November 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 183389986}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Check in was smooth, although there was just one person behind the desk and at least four people in line. Happy hours were awesome. Good snacks and good conversation. Chris the bartender was the best!!! We were there for three days, so on the second night, he pretty much knew what we were drinking and the glass never really got empty.", "title": "Completely pleased!", "user": "jmrahlf", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 182941407}, {"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Rooms were clean and updated, although the beds were too small. Time to put in some queen beds? The only thing I was surprised and disappointed about was that there wasn't a beverage service available in the lobby. Unless I completely missed it. I like to have decaf tea before bed, and the only thing in my room was coffee and caffeinated tea. I searched, but was unable to locate any tea.", "title": "Dont Stay At Embassy Suites", "user": "jim o", "date": "October 30, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 183013558}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This was a great one night stay for our family of four the night before our flight out of DIA. As we pulled into the hotel, it sits right next to an enormous field of sunflowers. It was truly stunning at sunset! Kids love staying at Embassy Suites because of the cool interiors, glass elevators, and swimming pools. Parents love it because of the free cocktails in the evening, the free breakfast in the morning, and the swimming pool. Win-win! When we checked into our non-smoking room, you could smell that it had been smoked in at some point. The front desk staff were apologetic and quickly got us another room. I don't care what hotel you're in that says it's non-smoking, you always have someone who smokes in it anyway. Go figure. That was our only hiccup. The bar had plenty of food and drinks during happy hour, including the Shirley Temples for the kids. The pool was a huge plus because it was very shallow at the low end, 2 ft I think, so our littlest could be on her own to stand up and play. This made our job as parent's a lot easier! Breakfast was quick and easy in the morning with lots of food options. And the free shuttle to the airport was effortless (as was connecting with the shuttle at DIA for the ride back to the hotel). A great hotel gets it right in all these little areas, and made for a great stay. Now, months after our stay, our girls are still asking if we can go back to the Embassy Suites!", "title": "Great pre-flight stay, field of sunflowers!", "user": "Graham T", "date": "October 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 181513744}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "The Embassy located near the airport offers a quiet nights sleep. The check in was great, he offered dining options. The room was clean and quiet. The hospitality was okay. Breakfast in the morning was very good. The fitness room machines worked well and they had towels and water. Overall if needing to be by the airport I would stay at the Embassy Suites.", "title": "Quiet night sleep", "user": "smiller560", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181311615}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The rooms were spacious and well taken care of. We ate at the hotel restaurant for dinner twice, and it was excellent both times. The open-air lobby was great looking, but it got very noisy in the evening as the drunks in the bar got very loud, making it hard to sleep (had an early morning flight.) Great location close to the airport with many restaurants nearby. Also, it had a nice indoor pool and a real plus -- an outdoor hot tub.", "title": "Nice hotel, excellent restaurant, a little noisy", "user": "tropicana49", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 180968853}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We had an early morning flight out of Denver, so we stayed at Embassy Suites to make it easier. Rooms were nice, very clean and efficient and comfortable. The staff was super friendly and efficient although it didn't appear to be very busy as it is a new hotel. One little problem with the t.v. reception was fixed with a phone call and a few minutes of service. Nice to have a complimentary happy hour, also.", "title": "Near Denver Airport", "user": "John F", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180758679}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My wife and I spent the night here prior to embarking on a flight to California. Our room overlooked a field of sunflowers. Our room was clean, roomy comfortable, and quiet. My wife and I had some wine and I indulged in a beer at the manager's reception. We then wanted a meal, which was surprisingly good. Our server, who was also helping to preside over the manager's reception, really hustled to provide excellent service. It would be helpful if the shuttle ran more frequently during the morning rush.", "title": "Great Stay...Great Value", "user": "NewAdventurer2", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180269224}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "this hotel was amazing, though when we checked in things weren't quite ready for our room, they made it right and gave us a little bonus for our understanding. the shuttle to the airport was convenient and the driver was super. the room was cozy and clean. the managers social was a lot of fun! I would definitely stay with them again!", "title": "got their act together", "user": "willi38", "date": "October 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182696797}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stay here whenever we need to stay over near the airport. The people are very friendly and helpful and having a suite is always a treat. It makes it much quieter and comfortable. The evening happy hour is a nice amenity and we have met interesting people there.", "title": "Great Airport stopover", "user": "Marilyn M", "date": "October 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 182781664}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "The only reason why people stay at this hotel is for the proximity and shuttle service to the airport. The hotel has no idea where the shuttle is half the time. The shuttle is supposed to pick guests up every half hour at the airport. We waited one hour in the cold. When we called the hotel, they made up stuff and were snippy. Find a different airport hotel.", "title": "Airport hotel with a very tardy shuttle", "helpfulness": 1, "user": "Connie M", "date": "October 25, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 182420308}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Our family spent two nights here when we traveled to Denver for a mini-vacation. Since we had a car, I didn't mind staying a little further out to get a great hotel for a great price. The pool area at this location was perfect for my 3 year old and 6 year old. Would definitely stay here again.", "title": "Great pool area for young kids", "user": "John W", "date": "October 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182184567}, {"rating": 5.0, "title": "Embassy Suites Denver Airport", "text": "My daughter and I traveled to Denver for the weekend and the Embassy Suites staff were excellent. Room clean, staff friendly, enjoyed evening reception, breakfast great. overall great place to stay in Denver.", "user": "A TripAdvisor user", "date": "October 22, 2013", "id": 182044412}], "location": {"country": "United States", "city": "Denver"}, "stars": 3.5, "variance": {"poor": 15, "average": 45, "very good": 111, "terrible": 10, "excellent": 132}, "aka": "Embassy Suites Denver-International Airport Hotel", "slim_ranking": 0.28275862069}