{"user_rating": 4.0, "review_count": 368, "name": "Embassy Suites Los Angeles/Glendale", "reviews": [{"rating": 3.0, "title": "Brand new hotel", "text": "This is a brand new hotel, so everything is very nice, clean and new. The rooms are typical Embassy Suites with a small living room and separate bedroom. One thing that isn't typical is the fact that many of the rooms overlook the atrium. Instead of a view of the mountains or street or anything else outside, we had a view of the hallway and elevator out our windows. A big disappointment. Make sure you book a room with an outside view if you plan to stay here.", "helpfulness": 2, "user": "Calif0rnia_traveller", "date": "February 24, 2009", "id": 25110935}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The manager's reception was better than most Embassy Suites. They actually had hot pizza-type snacks. And breakfast was great.", "title": "Brand new, clean, excellent value, good location", "helpfulness": 2, "user": "Bears70", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24991710}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "The valet parking is up and running, and the attendants were very good. Make sure to call ahead for your car, though. Ours was waiting for us when we got down there, but other people were waiting.", "title": "Good staff, hotel still in progress", "helpfulness": 1, "user": "ew7788", "date": "January 31, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 24045716}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "Brand new hotel so it is extremely clean, modern, and up to date. I had a 1 bedroom suite, kids slept on the pullout sofa bed. Excellent value and free breakfast is not just bagels and coffee. Hot buffet breakfast with an egg chef for omelettes and fresh waffles. Used as location for time at Universal Studios attraction. Also near America Way shopping/restaurant district.", "title": "Excellent", "helpfulness": 1, "user": "FancyK", "date": "January 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23597668, "likes": {"liked": "— Bell guys, valet guys, front desk, and everything else", "disliked": "— nothing"}}, {"rating": 2.0, "title": "Problems at check in", "text": "Hotel is brand, brand new. The staff tried very hard to be accomodating. Very pretty hotel, spotless bathrooms. However, some of the stuff in the hotel is not ready yet. The self serve laundry was not complete, the business center was also not ready. The dining, breakfast area in the lobby was great, beautiful. The staff were all friendly and accomodating. Parking is $15/night/car. The rooms are still a work in progress. We stayed 5 nights and on the 1st night there was an exhaust fan in the bedroom that stayed on all night and blasted air into the room. It was loud and irritating. The next day they came to fix it, but when I called at 5 am they did not have any maintenance people on hand. Room service was fast. Ice machines were also not available yet, but room service was fast in delivering ice. 2 flat panel tv's. Walls were very very thin. Could easily hear what people next door were watching. About 1/2 of their rooms have windows facing interior atrium, but no windows facing out of the building. First few nights it was different, in a nice way, to face the interior atrium. However, after 5 nights it became depressing that there was no natural light in the rooms. Wet bar had a sink, microwave and small refrigerator. Overall, pretty good, but make sure to gte exterior facing room in a quiet corner.", "user": "jblair99", "date": "January 9, 2009", "id": 23415180}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "We only stayed here one night before moving to another hotel that we had previously booked months in advance in downtown L.A. But our one night at the Embassy Suites in Glendale was fantastic. The hotel is very nice and clean. We particularly liked the lobby pond with the turtles and fish. I didn't have many interactions with the staff but everyone seemed to be quite nice. The rooms were very nicely decorated. I actually thought that the rooms were some of the nicest I have seen in a hotel in a long time. Nice paint colors, nice glass shower, nice fixtures, nice carpeting, very fresh towels, etc. The beds are exceptional, I slept like a baby. We had one issue where the TV in the living space didn't work, but within a few hours the desk sent someone up to fix it. Even the parking was hassle free. Parking was rolled into the bill but it was nice to park in the underground garage and have in/out privledges. My only suggestion for the hotel would be to add at least one more set of washers and dryers for folks that want to do a quick load. We waited for hours because someone had the machines tied up doing a huge load of wash. My only other issues is that I wished we could have stayed at this hotel longer.", "title": "One Night Stay But A Real Good", "helpfulness": 1, "user": "ardmoreflyer", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119954550}, {"rating": 1.0, "stay_parameters": "Stayed October 2011", "text": "Booked this place after seeing positive reviews here, and wanting room for 4 adults, which hardly any place around here offers...", "title": "Spacious 2-room suites...sheer deception!", "helpfulness": 5, "user": "wasimmehr", "date": "October 26, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 1.0}, "id": 119738824}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I have never written a review within hours of checking in, but this one comes an hour after Checkin... And I'm darn sure my opinion will not change for the better, and it can't get much worse...", "title": "Great SURPRISE...", "helpfulness": 1, "user": "Momarsh", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119649559}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Firstly, due to change of travel plans, I had to check in a day late (already paid for 4 nights). It was a nightmare trying to get through to someone to advise regarding change of plans...in the end. Did not get through after 20 mins of trying and had to leave a message...which they did not get!!!", "title": "Great choice for families and business outside the tourist hassles", "user": "gosaka", "date": "September 29, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118720257}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Ok...so I have stayed at other Embassy Suites before, and I know what it means to have a spacious two-room suite. This one, folks, is neither spacious nor a real two-room suite... imagine a standard sized room split into half to create two corridor like rooms, with one half having a small bathroom, and the other half having the so called kitchenette...thats Embassy Glendale for you... We felt as though we were still on the Embraer 120 aircraft that we arrived into LAX on... Forget trying to feel comfortable...", "title": "hilton may be better, get the cheaper deal", "helpfulness": 1, "user": "golisw", "date": "September 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "location": 4.0, "service": 3.0}, "id": 118544941}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This was my first time staying at the ESLA, and it is a very nice hotel. I was there for business for two nights, and was upgraded to 1225, a mountain view suite right in front of the elevators on the top floor. Excellent location right off the freeway, close to BUR, Studio City, downtown LA, Zoo, Hollywood Bowl and everything you want to do while in LA.", "title": "Great place, but a couple weird flaws", "user": "KansasCityGuy", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118236394}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Staff is very pleasant, with the exception of the front desk which is mixed. I stood at the front desk to check in for about 5 minutes before being acknowledged or even eyeballed. Once in the room, which was clean and spacious, all was well. Only a couple things I would change:", "title": "Embassy Suites Glendale was great", "user": "windsurfer5230", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118170654}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "1. TVs take forever to warm up. You think they aren't working--just turn them on and sit down and wait for a couple of minutes. They should pop on. This was an issue with both flat screen TVs--not sure if it is a Direct TV issue or what.", "title": "Home away from home", "user": "Nelly65", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118156681}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "2. Elevators smell really bad. Like airport bathroom bad. A back office admin employee asked me in the garage elevator on her way home how things were with my stay and I mentioned \"great, except the elevators all have a bad smell\". She was surprised, but said she would say something. About an hour later, I returned to that elevator and it was obvious someone had sprayed it down. I was impressed she went ahead and made a call and had it fixed--albeit temporarily.", "title": "The best Embassy Suites I've ever stayed and Amazingly warm pool", "helpfulness": 1, "user": "areuready", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117805493}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "3. Breakfast average and typical for a ES--it's free and generally plentiful.", "title": "Customer Service lacking", "helpfulness": 1, "user": "davelnca", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 1.0}, "id": 117774618}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Had the family stay here for 2 nights due to construction in our house in nearby Burbank.", "title": "Rude Cook and no view", "helpfulness": 1, "user": "Ed P", "date": "September 6, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 1.0, "service": 1.0}, "id": 117770854}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The hotel was nice and I was suprised that this Embassy Suites had INTERIOR rooms with NO outside view..that was somewhat ok because we live here - not mentioned on the website.", "title": "Oasis in the middle of Glendale, CA", "user": "DonnaAnne", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117277694}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "What was NOT ok was the rude breakfast cook who referred to my wife as ( [--] and then some, in spanish) not knowing that my wife ( who is blonde with green eyes) understands spanish slang and bad words. I expressed my concern with Vincent who was great. With Glendale being a melting pot, I would suggest that the staff speak in one language and refrain form insulting their customers in a different language..Ed, Burbank [--] - looking forward to a call from the Hotel manager soon. I will also be making a corporate complaint on this- unacceptable.", "title": "Nicest Embassy Suites I've stayed", "user": "AllSpark1", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117250382}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at the Embassy Suites in Glendale for a wedding we were attending at Occidental College on July 30, 2011. What a truly lovely hotel. Our two room suite was very comfortable and spacious. The lobby is beautiful and family friendly. They have a pond in the entry that has stepping stones to walk out and view the fish. In the morning we enjoyed a full breakfast cooked to order. Our stay at the hotel really enhanced the wedding and made it seem like a vacation weekend. Thank you Embassy Suites & staff!", "title": "Good location but expected more from Embassy Suites", "helpfulness": 2, "user": "nosarian", "date": "August 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 3.0, "service": 3.0}, "id": 117109724}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Probably one of the nicest Embassy Suites I've stayed out.", "title": "Loved it! Great hotel!", "user": "dg_in_ca", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117057984}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "For our first trip to Southern California, we chose the Embassy Suites Hotel in Glendale for it's proximity to the attractions we were planning to visit.  We only had a short time to spend there, so we wanted to avoid spending too much time driving.  The attractions we were primarily focusing on were Universal Studios and Hollywood Blvd.  The Embassy has great proximity to both, as well as other tourist sites such as Warner Bros. Studios and Griffith Park.", "title": "Great breakfast!", "user": "keshla65", "date": "August 13, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116662025}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "As for the hotel itself, overall we were pleased.  The room was comfortable and the cost commensurate.  We were disappointed that the hotel charges for connecting to the Internet from the room, although in the lobby bar and restaurant the wifi is free.  This comes, I think, from this hotel being primarily marketed to the business traveler on an expense account.  This would also explain why guests must pay for parking in the hotel's parking garage.  For the vacation traveler these additional expenses are irritating, especially yhte parking.", "title": "Great Family Place for LA", "user": "DrVille", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116586658}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "A bright spot in our stay was the breakfast buffet included in the cost of the room.  It was by far the best we had experienced during our whole vacation!  Huge selection, including waffles, pancakes, eggs, bacon, sausage, cold and hot cereals, and assorted breakfast breads.  The highlight, though, was the omelet bar.  Completely unexpected and greatly appreciated!  This hotel definitely does breakfast right!", "title": "Great Location - even for getting to Downtown L.A.", "user": "toomuchtravel", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116546265}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Everyone on the staff we spoke with was very friendly and courteous.  Also helpful, with suggestions for things to see and do while in the area.", "title": "Excellent For Familys!", "user": "Johnnycatt", "date": "August 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116479175}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Overall a good experience and would recommend this hotel to those withna similar vacation itinerary.", "title": "Ahhh, slept great!", "user": "nobadservice", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116347761}], "location": {"country": "United States", "city": "Glendale"}, "stars": 3.5, "variance": {"poor": 28, "average": 39, "very good": 135, "terrible": 15, "excellent": 151}, "aka": "Embassy Suites Los Angeles/Glendale Hotel Glendale", "slim_ranking": 0.142857142857, "description": "The Embassy Suites Los Angeles – Glendale, CA hotel provides easy access to I-134, I-101 and I-5 to get you around town. Located in downtown Glendale in the north Los Angeles area, you’ll be a few short miles from Universal Studios, Burbank and Pasadena. Business travelers will appreciate our proximity to many local corporations, in addition to daily complimentary cooked-to-order breakfast and our nightly Managers Reception. Experience the warm colors, lush foliage and koi pond of our Glendale, CA hotel's atrium. Our gracious staff will introduce you to our many hotel amenities and your suite."}