{"user_rating": 4.5, "review_count": 1563, "name": "Embassy Suites Waikiki Beach Walk", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "When we first arrived at the hotel we thought all was great. My husband and I are diamond members so we were upgraded to a very nice corner suite. The view from our balcony was nice. This will most likely not last for long since Trump is building a mega resort across the street. The accomodations in the room are decent however the beds are very uncomfortable. The housekeeping team at this hotel was horrible and made our stay less than great. Each and every day of our six night stay we had issues with them. They left dirty towels in our room one day, dirty glasses for several days, and on numerous occasions we had to call housekeeping to get toiletries that were meant to be left in the room. When we called to complain we were given the runaround. In fact when we asked to speak to the GM we were told that they did not know where he was and had no way to contact him.", "title": "NIce room and property but service was horrible.", "helpfulness": 3, "user": "utaxid", "date": "May 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 15906416, "likes": {"liked": "— The view from the room", "disliked": "— The horrible housekeeping"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The area is very nice where this hotel is located but be very weary of the service at this property. We were very dissapointed with this property and will definitely not return to this property on our next trip to Hawaii.", "title": "Nice place to stay", "helpfulness": 1, "user": "BigHarleyDog", "date": "May 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15826734}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I recently stayed here for 4 nights and it is a good location, Yard House is attached on the Lewers side. The rooms are usual Embassy Suites style with separate Living Room and Bedroom, sofa bed, fridge, etc. The staff was relatively friendly, seemed more friendly to Asian guests than us white mainlanders. I have stayed at the Hilton Hawaiian Village and they have great beach access and ocean views, although the rooms are not as nice and do not include breakfast. The beach is one resort from the water, walkway between the Outrigger Reef across the street. Anyway, it's about a $30 taxi ride from the airport if you don't rent a car, and they only have valet parking, no self park.", "title": "Really good hotel, great value for the money", "helpfulness": 3, "user": "UCDJay", "date": "May 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15620469, "likes": {"liked": "— Value, Cleanliness, Location", "disliked": "— Concierge"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Not Harley friendly if you plan on renting, they will not allow you to park them at the property.", "title": "Great Hotel", "helpfulness": 4, "user": "TripGal27", "date": "April 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15514334}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I give the hotel 4 stars, and I'd add half a star after the Trump Tower construction is finished. It is a nice hotel with a friendly courteous, staff, good location, and the free amenities are a huge bonus.", "title": "Good location", "helpfulness": 4, "user": "samjoco", "date": "April 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 15244914, "likes": {"liked": "— Suite option", "disliked": "— Housekeeping"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Bad:", "title": "Great Location", "helpfulness": 1, "user": "adam_uh", "date": "June 16, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 16978523}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My stay started off to a rocky start. Trump is building a tower next door, I asked for a room on the opposite side of the construction and the front desk agent insisted it was. I asked a few times during the check in. When I got to the room I think it was as close to the construction as I could have gotten. When I went back to the fron desk, they said they had no more rooms. After 30 minutes and calling Hilton Honor's Diamond desk they finally gave me a room with two double beds in the other tower. They wouldn't give me an upgrade to a king bed, eventhough I'm a Diamond member with Hilton. The pool during the day is also loud because of the construction.", "title": "Great hotel", "helpfulness": 2, "user": "BearAndPenguin", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16827034, "likes": {"liked": "— The large suite and the breakfast.", "disliked": "— The pool was a little on the small side."}}, {"rating": 4.0, "title": "Enjoyed Embassy Suites", "text": "The Good:", "user": "Czern", "date": "June 10, 2008", "id": 16824397}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Although I had a bad experience while checking in, the good well out weighed the bad. The service was great aside from the front desk. I met Mark, Assistant General Manager, the first night there and he remembered my name the entire trip, eleven days. Every night he greeted me by name at the manager's reception. The breakfast was great every morning and the staff was very nice and helpful. The hotel's location was ideal, although not on the beach, it was just a minute or so walk, but really close to restaurants and bars.", "title": "Great value", "helpfulness": 2, "user": "Portlandmama", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16695331, "likes": {"liked": "— Clean, quiet, location, one bedroom!", "disliked": "— construction next door"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Embassy Suites was great. The building was very new and clean. The staff was friendly. The suite was large and comfortable. The breakfast and manager's reception were great. Proximity to the beach was good. If I was in Honolulu, I would definitely stay there again, however, if I was in Oahu, I would probably stay in a less crowded part of the island. Waikiki is nice but way too crowded - there are much prettier, calmer parts of the island.", "title": "One night in Paradise, but Hey we live just 5 minutes away", "helpfulness": 1, "user": "ALOHA_Kane", "date": "June 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 16629127}, {"rating": 5.0, "title": "Great hotel", "text": "Excellent hotel! From the time you arrive, you are treated great. The hotel was new and beautiful. Rooms were excellent and very well appointed. Breakfast was legendary (and complimentary). Staff was top notch and the activity desk great. I will stay there again. The only pitfalls, 1. $25/day to park and no you can't find anywhere else to park around the hotel. 2. In order to get to the beach you have to walk 2 minutes to a public beach access path or walk through another hotel. This section of Waikiki beach is very small. 3. Oceanview room got you only a glimpse of the ocean (get used to this terminology in Hawaii)", "helpfulness": 8, "user": "firsttriptohawaii", "date": "September 22, 2007", "id": 8852732}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I have to diagree with the otherwise very positive reviews posted for this hotel. I booked an \"oceanview\" room that is nothing like the picture posted on the hotel website. The front desk said that \"a lot of people have pointed that out....\". The 'oceanview' is more a view of two building sites (the Trump Tower will eventually obliterate musch of the hotel view). I was told the duty manager would call me back but he/she never did. The rooms are nicely fitted out but small compared to most Embassy Suites. But the walls are paper thin - even regular conversations can be heard. The room on one side had some kids who where very noisy. Whilst its great that the kids are having fun, i didnt really want to b e part of that experience ! The breakfast was well handled and could easily accomodate a large number of visitors.", "title": "Have to Disagree....", "helpfulness": 11, "user": "EDatEdsDiner", "date": "September 18, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8751871, "likes": {"liked": "— well organised breakfast", "disliked": "— paper thin walls !"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "I was paying $339 but got Oceanfront at the nearby Sheraton for $289 - so i cancelled my remailing 4 nights and will move to the Sheraton today.", "title": "A-M-A-Z-I-N-G! Would definitely go back!", "helpfulness": 9, "user": "EchoFifth", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8719201, "likes": {"liked": "— Overall quality of property.", "disliked": "— Size of pool."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "This hotel was part of our Northwest Airlines package trip to Hawaii. I had doubts because when I think of Embassy Suites, I don't necessarily think 'luxury.'", "title": "Very Good Hotel", "helpfulness": 7, "user": "Selina100", "date": "September 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8704448, "likes": {"liked": "— The breakfast and manager's host", "disliked": "— The people walking around the streets being so loud"}}, {"rating": 5.0, "title": "Great family hotel", "text": "This hotel was A-M-A-Z-I-N-G! First off, location, location, location. You're right in the heart of Waikiki. As short walk one way puts you right on Waikiki Beach. A short walk the other way puts on on the main shopping thoroughfare and nearby restaurants.", "helpfulness": 6, "user": "kyleigh", "date": "September 12, 2007", "id": 8698837}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This is a brand-new (rehabbed) hotel and it is great. The location was great - across the street from Waikiki Beach and adjacent to the beautiful new Beachwalk, which has restaurants and shopping. It is also just a block from Ala Moana Blvd., the main shopping street. The outdoor pool is awesome and much bigger than most Waikiki pools. The hotel is clean and nicely furnished and the rooms are spacious and comfortable (though a little smaller than other Embassy Suites properties, but this is Waikiki). The free open-air breakfast is wonderful, with many choices, high-quality food, and live entertainment. The breakfast alone will save you a bundle (and a lot of hassle) if you are traveling with family. Truly a great value for the money.", "title": "Awesome Hotel for families", "helpfulness": 3, "user": "Kids3", "date": "December 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12156510, "likes": {"liked": "— location, pool, breakfast", "disliked": "— not directly on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "We stayed at this hotel for a week and had a wonderful experience. We found this hotel to be in a great location, close to the beach, great shopping and restuarants. The rooms were very nice and clean. The full breakfast everyday was a big plus! The food was excellent. The staff at this hotel was exceptional. This hotel had everything we needed including a laundry room and gym. It is very close to the beach about a minute walk. We will be back for sure!", "title": "Awesome Hotel!!!", "helpfulness": 3, "user": "JambaCalifornia", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11489859, "likes": {"liked": "— location, staff. rooms"}}, {"rating": 4.0, "title": "Brand Spanking new and Free Deluxe Gourmet Breakfast Buffet Daily!", "text": "Just spent 8 days staying at the Embassy Suites Hotel in Waikiki........I had a heck of a time choosing a hotel, especially after reading 'trip advisor'! It was an eye opener - especially the photos... frankly after reading the review for my first two choices I changed my mind! Then a travel agent mentioned the Embassy and I started doing some research.", "helpfulness": 13, "user": "monaliza2", "date": "December 6, 2007", "id": 11286554}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Well I'd definitely give it 4 out of 5 stars. I was looking for some place that would have one or two bedrooms, as I was travelling with 3 older teen age children (1 boy, 2 girls and myself - which made sleeping arrangements a bit challenging). One think I can't understand is when booking the accomodations we could n't get a guarantee on bedding layout, nor would they give us a guarantee on having a 'lanai'? Whats with that - we got both........but the uncertainty was a bit unsettling.", "title": "Good for families or business trip, not peaceful", "helpfulness": 10, "user": "kimo767", "date": "December 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 11265932, "likes": {"liked": "— friendly staff", "disliked": "— location, nearby construction"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "At any rate lobby was impressive, open air concept.......but stifling hot because theres no airconditioning! plus taxi and valet parking in the open lobbying area made it a little noisy and", "title": "Wonderful hotel!", "helpfulness": 4, "user": "lovestotravel101", "date": "November 25, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 11055245}, {"rating": 5.0, "title": "Great vacation at the Embassy Suites Waikiki Beach Walk", "text": "We spent 5 nights and 6 days at the wonderful Embassy Suites Waikiki. We were very nicely greeted when we arrived and were given a fresh cocktail while we checked in. We had reserved a room with a partial ocean view and ended up with one in the Hula Tower on the 19th floor that had the best view of the ocean one could have. All three of our sliding glass doors in our end suite each had a balcony that looked out at the ocean. Our one bedroom suite was beautifully decorated and the housekeeping staff keep it very clean waiting very patiently each day for us to leave on our outtings. The full chef cooked breakfast each day (6:30-10) had anything one could ever want for breakfast. The pool was great, very clean and had plenty of room for everyone. There was a bar that was open every afternoon and evening at one end of the pool and there was always plenty of cold ice water for drinking if you didn't want bar service. Every afternoon the manager's special with free drinks and snacks helped relax you and get you ready for a nice evening in Waikiki. They also had live Hawaiian entertainment during the managers special hours (5:30-7). Parking was expensive at $25 a night, but since we are retired Navy we were able to park right next door at the Armed Forces Hotel for $7 a night. The front desk at Embassy actually recommended that to me when I called. We ate one night at Roys right in the hotel and it was one of the best meals of our trip. The location was terrific with so much shopping and many great restaurants close by. Also the beach was less than a block away. We really couldn't have asked for more on our vacataion to Hawaii.", "user": "Bob P", "date": "August 25, 2008", "id": 19360542}, {"rating": 4.0, "title": "Good value, but lots of construction", "text": "We had a one bedroom suite and it was nice and roomy. Decent view although the new Trump Tower being built next door has almost destroyed their view for most rooms on the West side of the hotel.", "user": "xbioman", "date": "August 25, 2008", "id": 19344946}, {"rating": 5.0, "title": "Loved the Embassy Suites!!", "text": "The down side right now is the noise. The Trump Tower crew starts work about 7:00 AM and the Outrigger next door is also undergoing rennovation. We are not late sleepers so it was not that big a deal, but it is very noisy on the West facing rooms. If you are going now, try to get an East (Diamond Head) facing room.", "user": "Hawaii6", "date": "August 25, 2008", "id": 19323708}, {"rating": 5.0, "title": "Great place to stay", "text": "The breakfast buffet is good, great selection, but the atmosphere is kind of like eating at Disneyland. Crowded, noisey, not at all relaxing.", "user": "Julia_Doug", "date": "August 6, 2008", "id": 18701192}, {"rating": 5.0, "title": "Highly Recommended", "text": "Overall though, this hotel is a very nice value given the room size, friendly staff, services and location.", "user": "gokc1", "date": "August 1, 2008", "id": 18520056}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We stayed at this new Hotel for a week. On arriving we were greeted with a drink and extremely pleasant and helpful staff. Our bags were immediately taken care of. I must say in deference to some others that the staff were great all week. We had a 2 bedroom appt and it was brand new and terrific. We did not book an ocean view because we do not stay in our room during the day. If I wanted an ocean view I would have booked a beach front property. The price was very good when you consider the Hotel standard, breakfast included, Managers drinks every day - for 2 hours (NOT WATERED DOWN AS SOMEONE SAID), free Internet, free gymnasium and fabulous location on the new Beach Walk.", "title": "Loved Hawaii and this Hotel was fab", "helpfulness": 6, "user": "Slossy", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10250186, "likes": {"liked": "— Location, Hotel standard and value for money.", "disliked": "— It gets a little windy on the 4th floor where the pool is located."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I would gladly stay again and have recommended already to many friend. I agree that it is a family friendly Hotel. And to the person who was concerned about someone not getting a newspaper, it is a HOTEL not a Newsagency. There were plenty of ABC shops on the beachwalk for this.", "title": "Great Hotel and Location!", "helpfulness": 6, "user": "bluegumbo", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10083289}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We recently spent a week at the Embassy Suites Waikiki Beach Walk from October 5 through 12. The hotel is located in the new Beach walk area connected to the main Waikiki strip. The location provides easy walking distance to the public beach, shops, and restaurants. The free breakfast is great each morning providing made to order omelets and fresh fruit. The managers reception each evening provides fresh vegetables, chili, chips, along with an open bar and live entrainment. Overall, the hotel goes out of its way to make your stay feel special. Our room had a double lanai with views of the ocean, mountains, and city.", "title": "No Class", "helpfulness": 8, "user": "hawaiiNikki", "date": "October 15, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 10083078, "likes": {"liked": "— Nice Lobby", "disliked": "— Front Desk Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007", "text": "I stayed at this hotel and I must say that based on the reviews for the most part it sounded great. The room was just okay and really not worth the asking price though. I was also really disappointed with the staff. The front desk ladies were quite uppity. I was in the lobby waiting for a taxi when a nicely dressed lady with baby went to the front desk and asked for one of the \"free\" newspapers that have coupons in them. She also asked if she could purchase one of the papers with a price on it. She was told that she could not have one as they are for hotel guests only. She was not even asked if she was a guest. She was also told she could not purchase one of the pay type papers. She was not told where to get one either. The lady at the desk was VERY snobby and her tone of voice was down right rude. I was truly embarrassed for the poor lady who asked for the paper as she had class and was polite and well spoken. She seemed taken aback by the front desk lady and you could tell she had her feelings hurt. I am not talking about the newspapers that you get from the store. This was the type that they give away free and states \"FREE\" right on the front. This clerk had no class and was down right mean. I would NEVER stay here again. The spirit of aloha my foot. Not here anyway. More like aloha where's your money now go away.", "title": "Very Disappointing, Not a Five Star Hotel", "helpfulness": 6, "user": "tsbvancouver", "date": "September 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 5.0, "cleanliness": 5.0, "rooms": 2.0, "location": 5.0}, "id": 10008258, "likes": {"liked": "— location of hotel and free long distance outgoing calls", "disliked": "— room was too small, happy hour was terribel"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We just returned from a trip to Oahu and Maui. We stayed at the Embassy Suites Waikiki Beach Walk for three nights. The service was excellent after enduring an 11 hour flight. Valet took care of the car...bellhops at the ready for your luggage...sit down check in with fresh juice.", "title": "Great value", "helpfulness": 3, "user": "BobnCarolyn", "date": "April 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15230313, "likes": {"liked": "— complimentary breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The room was very spacious and clean. While there was not much of a view from the lanai(s)...there were two...they were very private.", "title": "wonderful place to stay", "helpfulness": 1, "user": "Prieta116", "date": "April 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15080698, "likes": {"liked": "— Room", "disliked": "— the area that hotel was located at."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "We were on a family vacation with two kids so the comp. breakfast was awesome. The omelets were wonderful. We also took advantage of the evening managers reception which was nice as well...appetizers, free beverages and entertainment in the pool area.", "title": "Huge breakfasts and lots of quiet.", "helpfulness": 4, "user": "richardsullivan", "date": "April 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14949189}, {"rating": 5.0, "title": "New, clean and awesome location", "text": "The concierge was very helpful for directions and dinner recommendations.", "helpfulness": 10, "user": "KatySeattleWA", "date": "April 8, 2008", "id": 14896707}, {"rating": 5.0, "title": "Loved it...would stay there every year if we could!", "text": "The location was good...a block away from the beach and beachwalk and an ABC Store just down the block!", "helpfulness": 8, "user": "rahnjojada", "date": "April 6, 2008", "id": 14844347}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We had adjoining rooms in the Aloha tower. The rooms were spacious, extremely clean, and well-stocked. My travel partner and I had a bathroom and bedroom only, but our other companions had a wet bar in the entry, a sitting room, bedroom, and bathroom. The rooms together made a very comfortable vacation getaway. Our room overlooked Diamondhead as well as Waikiki Beach. The beds were very comfortable and the bathroom very nice.", "title": "Best family hotel in Waikiki", "helpfulness": 12, "user": "SwanDev", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8618656, "likes": {"liked": "— service and cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "After a travel agent couldn't find us a two bedroom apartment in Waikiki, (We have a 20 year old and a 19 years old and I didn't want to be cramped in one room like we have been, on our last two trips to Waikiki!!) a friend of mine mentioned Trip Advisor. What an incredible site! We came across Embassy Suites and crossed our fingers and booked it. Everything we read about the hotel was true. The staff were wonderful, so helpful and accommodating. The night before we left we had to send an important package back to Australia and they really went way beyond the call of duty to get it home for us. Even after we left there were problems with the courier and the staff took care of it. I couldn't recommend this hotel highly enough.", "title": "5 stars to Embassy", "helpfulness": 2, "user": "Ednacooke", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16580075, "likes": {"liked": "— We were treated as if we were very special!", "disliked": "— N/A"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The rooms were beautiful, the food was fantastic, the pool was awesome, as was the staff. My husband had an ear ache and the guy behind the tour desk actually took David around the corner to the doctors!!", "title": "Our least favorite part of our 11 nights in Waikiki", "helpfulness": 6, "user": "worldtripper", "date": "May 25, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 1.0, "rooms": 4.0}, "id": 16393967, "likes": {"liked": "— The suite layout", "disliked": "— Construction noise, lack of nice lobby"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We love Waikiki and this hotel will always be our home away from home. We intend to come every year.", "title": "Loved the hotel and people", "helpfulness": 2, "user": "ann1752", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16337752, "likes": {"liked": "— I like the clean room and the friendly staff", "disliked": "— There was nothing that I didn't like about this place"}}, {"rating": 3.0, "title": "Just OK", "text": "We stayed here 4 nights.", "helpfulness": 4, "user": "philly54", "date": "May 15, 2008", "id": 16059353}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Ok, first~ you drive up to check in, and drop your car off. You are in like an entrance to a parking garage, but NO! This is the \"Lobby\"! For real! You walk past the parked cars and taxis, and this is there is the check in desk is, outside, next to the parked cars. WEIRD. Outside, next to the parked cars!", "title": "All the free stuff..for Hawaii.. WOW, what a nice place", "helpfulness": 3, "user": "dcl80", "date": "May 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 15962182, "likes": {"liked": "— All the stuff you get in the room rate.. Not many extras", "disliked": "— Staff was just ok"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "stuffy.", "title": "Loved it!", "helpfulness": 5, "user": "thetractorman", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10805527, "likes": {"liked": "— Great Embassy Suites rooms and bedding", "disliked": "— Honolulu is quite crowded"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "We stayed here for a week in early October. It was a wonderful stay and the perfect location for our family. The hotel was lovely and conveniently located between the beach and the Royal Hawaiian Mall. Breakfast was excellent, especially eating in the open air cafe. We never waited long for anything and the staff was very friendly. Housekeeping was wonderful and our suite worked out great for us: me, hubby and 2 girls ages 6 and 10. Most days we did sightseeing but were back to the hotel by around 5pm. The manager's special was nice - there is live entertainment and hula every night. The appetizers aren't anything special: veggies/dip, chips/dip, chips/salsa and open bar. However, it was very relaxing for us to head down there, enjoy the music, some snacks and the kids would swim until bedtime. It worked well for us to hang out and just order some food at the hotel by the pool. A nice way to end each day. You can walk to many locations or easily catch the bus. Two negative comments: the room was advertised to have a king bed but it only had a queen. Also, be wary of the concierge. One morning the gal introduced herself at breakfast and proceeded to tell us that our plans were all wrong, would never Other than that, I can only say good things about this place. Very family friendly, very clean and well maintained and more.", "title": "Perfect for a family", "helpfulness": 1, "user": "8872traveler", "date": "November 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 21491484}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "THE SUITE: We stayed in a two bedroom suite in the Aloha Tower (closest to the beach) on the 14th floor. We chose the partial ocean view, which was great because we had views of the city, the mountains, and the ocean depending on which direction we looked. The suite was spacious and very comfortable for 4 people. We didn't hear any noise coming from the other room or from any other suite. The bed was extremely comfortable and no matter how tired/sore we were from the day before, we woke up every morning feeling rested and renewed. Very clean. Reasonably priced and well worth it!", "title": "Will never stay anywhere else!", "helpfulness": 1, "user": "WELOVEOAHU", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21473803, "likes": {"liked": "— THE BREAKFAST"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "THE BREAKFAST WAS AWESOME and was complimentary!! It filled us up for the whole day until dinnertime. Included: Fresh fruit, pancakes, sausage, eggs, hashbrown potatoes, bacon, french toast, made to order DELICIOUS omelets, bagels, muffins, cereal, yogurt. We ate breakfast at the Shore Bird at the Outrigger Reef one morning, and while the view was good the food did not even compare and cost $25.", "title": "Best Hotel Ever", "helpfulness": 1, "user": "d28872", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21453883, "likes": {"liked": "— Spaciousness, cleanliness, customer service", "disliked": "— Not easy to get to other tower for business center"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "LOCATION!! Perfect. Shopping and dining at the new Waikiki Beachwalk was actually connected to the hotel. The beach access was a block away and took us 5 min to walk there. The beach area in this location is less populated and you can rent everything you need right there and pretty much have your own private beach.", "title": "Absolutely Awesome Home Away From Home!!!!", "user": "BCadena", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21389896, "likes": {"liked": "— Nothing,everything was expectacular!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "STAFF: Friendly, helpful, provided us a wheelchair rental for grandma, kept the rooms clean and only came when we weren't there. Bell service came and got our luggage on the last day and stored it for us so we could check out but still go do things before we needed to be at the airport. The front desk arranged our taxi to the airport, a limo!", "title": "Good Value in Honolulu", "helpfulness": 1, "user": "littletm", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21306290, "likes": {"liked": "— Value, quality of breakfast, space in room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "I can't say enough about Embassy Suites Waikiki. We had an absolutely fabulous experience here! We were one of the few lucky ones to get a corner ocean view room so we had windows along two complete walls. We could see the ocean from everywhere in the room.", "title": "Couldn't have been better!", "helpfulness": 2, "user": "3sweetpeasmom", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22191508, "likes": {"liked": "— Location, cleanliness, friendly staff"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The staff was extremely helpful and pleasant. The housekeeping service was exceptional. Breakfast was delicious and a wonderful time and money saver. We had the opportunity of walking through a few other hotels in Honolulu while we were there and everytime I was SO glad we picked the Embassy Suites. I recommend it wholeheartedly!", "title": "Honest review of Embassy Suites", "helpfulness": 3, "user": "sunnyfaced", "date": "November 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 22150074, "likes": {"liked": "— The staff was very nice and a good location.", "disliked": "— The rooms and some extras were just ok, king bed two twins together, boring setting/decor/comfort."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "My husband and I went to Oahu for our honeymoon and stayed at the Embassy Suites through a hotel/air/car package and got a good rate. Embassy was clean and everyone was very nice, as most people in Hawaii are, but as a honeymoon hotel, it wasn't exactly what we had in mind. It depends what you like, but hotel seem to have a lot of families with young children. We think it is great for that purpose, especially with the free breakfast. We were fine with the average decor and offerings because we went outside the hotel a lot, for dinner, breakfast extras, etc. We like more the contemporary setting and loved the Mona Surfrider to hang out- great not having to pay to stay there- and also Halekulani and Waikiki Parc-where Nobu is located- one of the best meals we had in town. We were able to do these extras without the stress of paying too much at a hotel per night, so in that sense, Embassy was fine. It was clean, the construction wasn't the best backdrop at the pool, and sort of banal. Good rates though and good for families.", "title": "Loved the Embassy Suites !", "helpfulness": 4, "user": "Hawaii50", "date": "November 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21881435, "likes": {"liked": "— Clean, very comfortable & spacious suites", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Our family (4 adults) recently stayed at the Embassy Suites (Oct 18-27) in a Partial Oceanview 2 bedroom / 2 bathroom suite.", "title": "Family friendly", "helpfulness": 3, "user": "Canada6666", "date": "November 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21791233, "likes": {"liked": "— Clean modern rooms and great location"}}, {"rating": 5.0, "title": "Highly recommended!", "text": "This was my 6th trip to Honolulu but my first stay at Embassy Suites and I loved it. Our suite was in the Hula Tower (1523) and was extremely spacious, especially for 4 adults. We had 2 seperate bedrooms, 1 king and 2 queens each with their own ensuite bathroom. The living area was comfortable with a sofa lounge (this also folded out for a bed if required), sofa chair, dining table & chairs. We had 2 balconies, one larger off the master bedroom & living area and another off the 2nd bedroom", "user": "LisaLuOhio", "date": "November 11, 2008", "id": 21758835}, {"rating": 5.0, "title": "Highly Recommend the Embassy Suites Waikiki Beach Walk", "text": "We stayed at the Embassy Suites Waikiki Beach Walk for three nights earlier this month via the Hilton's HHonors Diamond rewards program. Our stay on Oahu was brief, followed by a more leisurely visit to Kauai, but our experience was perfect. The room was spacious, clean, and furnished very nicely with appropriate island/beach decor. We stayed in a suite, which is perfect for a family consisting of night owls and early birds! We were on the 16th floor of the Hula tower and had a decent view of the ocean. While not on the beach, the property is across the street from it and within walking distance of restaurants and shops. I barely noticed construction at the new Trump property and do not think it would detract from anyone's visit, to be honest.", "user": "Salmuabe", "date": "July 31, 2008", "id": 18445440}, {"rating": 5.0, "title": "Great Hotel", "text": "Staff at the Embassy Suites was top notch: genuinely friendly without being condescending and responsive. The activities director (an Australian gentleman) gave us some great suggestions for discovering the rest of the island and directed us to the perfect North Shore beach to hang out with sea turtles!", "user": "hellokittyluver", "date": "July 28, 2008", "id": 18328222}, {"rating": 5.0, "title": "Family friendly in a great location", "text": "The (complimentary) Evening Manager's Reception offers drinks, snacks, and entertainment (music and hula) and the breakfast buffet is impressive. Both help set this hotel apart, especially with the high prices in Waikiki Beach. I would not hesitate to recommend this property to family and friends and if we are fortunate enough to ever return, will most likely stay here.", "user": "lovetotravel00", "date": "July 26, 2008", "id": 18276587}, {"rating": 5.0, "title": "Great Hotel for Our Family", "text": "My family just returned from Waikiki Beach. Several reviews stated that noise was a factor. During our stay, the noise was not a factor. We were in the Aloha Tower. The breakfast buffet was excellent, especially the omelet bar! The evening reception served awesome mai-tais. The munchies were the same every evening, chips and salsa, veges and dip, goldfish crackers, etc.", "user": "rbross50", "date": "July 21, 2008", "id": 18084020}, {"rating": 4.0, "title": "What a pleasure!", "text": "We had a rental car for a day, and the valet service got our car out quickly each time. They let us check in early at 1:00 pm and we received our complimentary drink upon arriving and received our complimentary Hawaiian CD. It was really convenient to be next to the new Waikiki Beachwalk with all the new restaurants and stores close by. I would definitely recommend this hotel!", "user": "MochaRose", "date": "July 16, 2008", "id": 17949260}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "In dec of 2006 my girlfriend and i went to oahu for new years along with my parents. we first arrived and our first hotel was suppose to be the outrigger east, we got into our room and it was a dump, so we left and my dad found us 2 rooms joined at the embassy suites. when we first arrived they were slightly unorganized mostly because it was the around the first few weeks the hotel opened. they sent us to our room and as we were being showed around they bell-men politely said \" i hope you enjoy the rooms, you people are the first ever to sleep in the beds, to use the bathrooms, to watch the tv \" how unreal is that its like moving into a new house ... we were in awe. this hotel is by far the best hotel for waikiki, i have been to oahu every year since i was 4-5 years old and this is my best experience, it was so nice we didnt care how close to the beach we were. unreal breakfast, unreal maitis, unreal atmosphere, once you arrive you never want to go, i think anyone who goes to this hotel will be instantly pleased, im goin back this feb its just so tempting, hope you feel the same way. thanks", "title": "best hotel ive stayed in", "helpfulness": 4, "user": "jonnyinalberta", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12582557, "likes": {"liked": "— clean rooms/food service", "disliked": "— everything was perfect, not one flaw"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We always try to stay at an Embassy Suites on our vacations and the new Beach Walk Embassy did not disappoint. Located on the new Beachwalk you are just a few blocks away from the beach and main shopping on Kalakaua Ave. Kalakaua Ave reminds me of Michigan Avenue with all the shopping you could imagine.", "title": "Great Stay at the Embassy Suites Beach Walk", "helpfulness": 3, "user": "fhata", "date": "January 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12580758, "likes": {"liked": "— location", "disliked": "— traffic"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We had the most luck starting the day early, having breakfast around 7:00AM and heading out by 8:00 for our activities. The breakfast lines are small enabling you to get an omlet easily and a nice array of fruits and usual breakfast faire. Also rice and miso soup are included which was a nice touch. You have the choice of eating inside or out on the lanai on the fourth floor.", "title": "Location, location, location", "helpfulness": 6, "user": "SengaMilne", "date": "January 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12487245, "likes": {"liked": "— location", "disliked": "— Buildings around the hotel obstruct full sun on the pool area as early as we would have liked."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The rooms are new and clean with great service by the staff. Everyone was very friendly and helpful. The manager's reception was very popular with a host of drinks to choose from and nice appetizers. It gave us all time to unwind and decide where to go for dinner.", "title": "Great hotel for couples", "helpfulness": 2, "user": "JayIs", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12270996}, {"rating": 5.0, "title": "Fantastic - Ready to go back!", "text": "October 7 - 11, 2008", "helpfulness": 3, "user": "dntadventurers", "date": "October 22, 2008", "id": 21117967}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Last week, my wife and I celebrated our 40th wedding anniversary in Hawaii and 1st official honeymoon. We had the enjoyment of staying at the Embassy Suites Waikiki Beach Walk for four days. This was our 4th visit to Oahu. The 1st three were a combination of work and pleasure. Work for me and pleasure for the family. This time it was all pleasure just me and my sweety.", "title": "Good location, Great time", "helpfulness": 1, "user": "Sammk", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 21115449, "likes": {"liked": "— Breakfast buffet", "disliked": "— Pool - small in size (boring)"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We had read all the reviews on the Embassy Suites Waikiki Beach Walk subsequent to flying to Hawaii. Previously, we had stayed at the Hilton Hawaiian Village Resort and the Hyatt Regency Waikiki Beach Resort and Spa. Both were excellent hotels but our stay at the Embassy Suites Waikiki Beach Walk exceeded our expectations.", "title": "I Absolutely LOVED This Hotel!!!!!!", "helpfulness": 4, "user": "Misty9577", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21008701, "likes": {"liked": "— I loved the great size of the hotel room and the two bathrooms!", "disliked": "— We had alot of sand on the floors of our room, and the maid service could have done a little better job cleaning it up, but not a big deal!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "We flew to Hawaii from Orlando, Florida via Atlanta. An extremely long flight, 11 hours plus, with very uncomfortable seats on an older Delta 767. We intentionally planned this stay as a way to adjust to the time change and an opportunity to revisit the island of Oahu prior to our first cruise around the islands on the Pride of America. Upon our arrival we were greeted by the entire staff at the Embassy Suites as though we were family. Everything we inquired about the hotel was factual. The employees were great, very helpful and exceedingly accommodating providing nearly flawless service.", "title": "The best Hotel in waikiki", "helpfulness": 3, "user": "travelingprincess05", "date": "October 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20971834, "likes": {"liked": "— The suite 2 bathrooms for 4 women was amazing!", "disliked": "— maid service could have been a little more detailed"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We booked a one bedroom suite which was extremely spacious (including the bath room). Although it was located next to the Trump tower, it was very quiet although our ocean view was a 20 story building. The ‘living’ room had a flat screen television, as did the bedroom. The FREE breakfast was outstanding and consists of omelets’, breakfast potatoes, several assorted pastries, yogurt, eggs, bacon, sausage, pancakes, French toast, cereal, etc., and a very large selection with plenty of fresh fruit, an extra added value. The food was always plentiful and hot. Everyone was very polite; guests were patient and waited in line to get their food. Most hotel beds are satisfactory but we slept like angels on the beds at the Embassy, very comfortable bedding and pillows. The location is within walking distance of great shopping, great food and the beach, less than a block away.", "title": "Good location, good value", "helpfulness": 3, "user": "Bystedt", "date": "October 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20868950, "likes": {"liked": "— Spacious Rooms, great location", "disliked": "— Thin walls, limited breakfast"}}, {"rating": 4.0, "title": "Construction Notwithstanding, a Nice Hotel", "text": "Before I booked this place I knew 3 things from reading Trip Advisor:", "user": "ejm3", "date": "June 18, 2008", "id": 17034935}, {"rating": 4.0, "title": "Enjoyable stay - will return!", "text": "1) Construction noise (thanks Donald)", "user": "giddyup_IRL", "date": "June 17, 2008", "id": 16999429}, {"rating": 5.0, "title": "This is an awesome hotel!!", "text": "2) Lots of kids", "user": "cakp", "date": "June 16, 2008", "id": 16981238}, {"rating": 5.0, "title": "Wonderful Location", "text": "This hotel was a wonderful place to stay while on vacation with my extended family. There were 14 people in all, and no one had a bad thing to say about the hotel. (VERY unusual, especially for my mother and I ... both hotel SNOBS!)", "user": "BLove4444", "date": "July 13, 2008", "id": 17842407}, {"rating": 4.0, "title": "Lots of Aloha here!", "text": "The rooms were clean and spacious. There was a small refrigerator, coffee maker, and a microwave.", "user": "hawaiinbound", "date": "June 30, 2008", "id": 17386320}, {"rating": 4.0, "title": "Nice Hotel with Minor Inconveniences", "text": "The included breakfast was outstanding, probably the best one I have ever seen. There is everything you could possibly want to eat in the morning. Made to order omelette's, fresh fruit, breakfast potatoes, several assorted pastries, breakfast meats, etc. You can even sit outside in the sun which makes for a great start to the day.", "user": "707thecode", "date": "June 29, 2008", "id": 17330446}, {"rating": 5.0, "title": "Loved the location", "text": "The staff was extremely helpful in every way. The people in the gift shop/ store were so welcoming they treated us like we were family. They even learned some of our names. :-) Any staff we encountered or asked questions to were more than willing to give us help or opinions on activities, dining, etc.", "user": "nat148", "date": "June 25, 2008", "id": 17228201}, {"rating": 4.0, "title": "Good and Bad but mostly good", "text": "The managers reception every night was awesome. For 2 hours, you could get free cocktails and snacks in the same area breakfast was served! (Right by the pool)", "user": "slub007", "date": "June 23, 2008", "id": 17158588}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The hotel is very nice. It is in a great location for Waikiki with shopping, nightlife and the beach just steps from the hotel. The only downfall was the housekeeping and the morning paper. The house keepers must have opened our room door without knocking 5 times a day and it was weird how the news paper was left on our in room desk....meaning that a hotel employee came into the room and left it while we slept....creepy.", "title": "Almost Everything Was Perfect", "helpfulness": 1, "user": "Holidy", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21716771, "likes": {"liked": "— Location, one bedroom, free cook to order breakfast, value", "disliked": "— Staff not knocking before entering room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Only stayed there two nights, but what a hotel! Superior service, wonderful warm welcome, and outstanding breakfasts! This is a great choice if visiting Waikiki.", "title": "Outstanding Embassy Suites - great choice!", "user": "startraindd", "date": "November 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 21635311, "likes": {"liked": "— Made to feel very welcome", "disliked": "— Few rooms have ocean views"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "excellent hotel. rooms were new and clean. we had a 2br 2 bath suite. breakfast was great and breakfast setting was outdoor and excellent.", "title": "excellent", "user": "njvacationer51", "date": "November 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 21554612, "likes": {"liked": "— rooms, breakfast, location", "disliked": "— cost to park, no easy access to beach"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "only 2 bad items. $30/day to park and you had to walk through an alley to get to the beach.", "title": "Excellent Stay", "user": "BW-Lamplighter-Inn", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21547258, "likes": {"liked": "— The Rooms & Staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Will stay again for sure!", "title": "Embassy Suotes Stay Oct 2008", "user": "Bazza99", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 21543591, "likes": {"liked": "— The room was a little small but very nice and clean", "disliked": "— having to use your room keyy in the elevator"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Check-in was relaxed and efficient, our rooms were in good condition with comfortable beds and plenty of room for the three of us. It was great to have the living room available for the crib and the separate bedroom for me and my wife. It is important to note that this hotel has at least two room configurations, with the bathroom accessed either from the living room or from the bedroom. You should request whichever is appropriate for your purposes upon check-in. We elected for the bath off the bedroom so that our toddler could sleep undisturbed in the living room.", "title": "Great Family Hotel - We loved it!", "helpfulness": 16, "user": "ilovethelonghorns", "date": "August 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8350389, "likes": {"liked": "— size, decor and quiteness", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Breakfast was the typical Embassy Suites selection with cooked-to-order omelets and other standards. The distinction here is that they also offer Miso soup, salad and a few other Hawaiian and Japanese items like Haupia yogurt and Portugese sausage that are a nice and tasty complement to a standard American breakfast.", "title": "Great location, great hotel", "helpfulness": 13, "user": "Matt J", "date": "July 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8268704, "likes": {"liked": "— Great location one block from the beach", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Valet parking seemed a bit expensive at $25/day but the service was tremendous as we never waited more than a minute or two for our car. Valet and Bell Staff were plentiful, polite and quite helpful with directions and information. Also there seemed to be staff everywhere, (this is good thing) always cleaning or otherwise busy. The hotel is new and it will continue to look and feel new if the staff remain as attentive to cleaning and maintenance as they were during our stay.", "title": "A solid four star property", "helpfulness": 21, "user": "Boeing767", "date": "July 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8262630, "likes": {"liked": "— Large rooms, view, breakfast", "disliked": "— Somewhat disorganized at check-in, relatively expensive compared to other Waikiki properties"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "My only complaint, about our two stays is that upon checking in on Saturday the hotel did not have a crib available, even though we had called and requested one several weeks before our trip.. The hotel did arrange to borrow a crib from a nearby hotel , but we had to wait for an hour or so for it. Our toddler was not too happy about this after flying all day. This was not a problem on our second stay the following week.", "title": "Not your typical Embassy Suites", "helpfulness": 10, "user": "dago1", "date": "July 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8106068, "likes": {"liked": "— location and cleanliness", "disliked": "— street noise"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed here for 3 days back in August. The hotel was very clean, and the service was friendly. The breakfast buffet down on the pool deck was a nice benefit. However, if you're in the Aloha tower on the pool side, you will get some noise from the pool area and from the construction right across the street. Trump is building a hotel that will almost entirely block out the ocean view on that side. So if you can, ask for a room in the other tower.", "title": "Beware of Trump", "helpfulness": 3, "user": "The_Mystic", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12607528}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 41, "average": 111, "very good": 493, "terrible": 17, "excellent": 901}, "aka": "Embassy Suites Waikiki Beach Walk Hotel Honolulu", "slim_ranking": 0.0963855421687, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Embassy Suites Waikiki Beach Walk is ideal for family vacations, romantic escapes, social gatherings or group retreats. All of our guests enjoy spacious suite accommodations, complimentary cooked-to-order breakfast daily, and our nightly Manager’s Reception."}