{"user_rating": 3.5, "review_count": 298, "name": "Embassy Suites Hotel San Antonio Northwest / I-10", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed at this hotel a few nights during a family vacation to San Antonio. We were wanting a hotel that was centrally located to all the places we planned on visiting, and this hotel served exactly that purpose. It was clean, and the bedroom in the suite was spacious, which worked out great as we had to set up a pack & play for our 18 month old. The complimentary cooked to order/buffet breakfast the hotel offered was wonderful. The hotel staff were always very friendly and helpful. Our 10 year old son enjoyed the indoor pool in the evenings.", "title": "Overall this is a great hotel!", "helpfulness": 1, "user": "KKccB61607", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 112267009}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "A few cons:", "title": "School trip chaperone", "user": "anyajimt", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 111511788}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "1) The hotel was just off I-10, but I think it would have been difficult to get to it without a GPS.", "title": "I will stay there again.", "helpfulness": 1, "user": "jessicashsu", "date": "May 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 109240676}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "2) We reserved a non-smoking room and were given a smoking room (luckily you couldn't tell it had been smoked in except for the ashtrays laying around).", "title": "Home away from Home", "helpfulness": 1, "user": "Faith7sh", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109017119}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "3) Breakfasts were very busy, and we had a hard time getting a table. If you are traveling with small children, highchairs/booster seats are hard to come by. Our first morning there I wound up going back up to our room to get our portable highchair.", "title": "Average Hotel -- No Hot Water!", "user": "FoxTraveler", "date": "May 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 107648624}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I stayed here with some visiting family over Thanksgiving. Like most Embassy Suites, the rooms were spacious, and had recently been updated. The only updating needed for anyone with kids would be the arcade.", "title": "Good Value for The Money", "user": "bakphoenix", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122143689}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "We found it a great place for a larger group to have a couple of rooms and enjoy ourselves while not out and about. We are a group of all ages, including children, so the hotel was perfect for us. It had a pool, a bar and we could sit in the indoor courtyard while eating or having a drink and chatting.", "title": "Rooms could use an update, but overall we were pleased with this hotel.", "helpfulness": 1, "user": "barbarapitts", "date": "November 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 121006063}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "If you need a place in this part of town, and especially if you are a larger group, this may be your plac.e", "title": "Very Workable", "user": "NorthTXCouple", "date": "October 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119727042}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We thought this hotel was close to seaworld. It was 12 miles away, but took us about an hour to get there. We had to get on 4 interstates to get there. Once we finally got there everything was great. Staff was wonderful. The rooms could use an update but were very clean. The breakfast was over at 9:00 am. Since we were on vacation, we missed that. We did eat dinner there at resturant, and it was very good. We would stay there again.", "title": "Good Choice", "user": "TexieKilleen-TX", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119182111}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We spent the weekend at this Embassy Suites with the family. It was a very workable scenario. The separate room with the fold-out couch is good for the kids and provides a little privacy. It would not be particularly comfortable for adults, as the mattress is less than wonderful. I think I may like the bathroom placement of the new Embassy Suites (outside the master bedroom) better, but this was fine. Given that you get the full breakfast downstairs and that we booked in advance and got a very reasonable rate, this is a good stay, especially for families.", "title": "Clean room, good beds, but breakfast and bar need improvement", "user": "Dede2travel", "date": "September 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118611687}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Whole family enjoyed it. We where able to spread out ( kids in one area of the suite, adults in the other) and relax. Pool is great and staff us quite helpful.", "title": "Great Location, great nights sleep", "user": "GonzalesFam", "date": "September 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118507146}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Beds were comfy. Like home.", "title": "Comfortable at a fair price", "helpfulness": 1, "user": "BusinessTraveler78", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118001873}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I stayed at this hotel many times in the 1990s but this is the first time in a long while (only because I haven't been back to this part of San Antonio lately). The hotel is pretty much as I remembered it. The staff is very friendly, and the suite was comfortable. I had read a few negative reviews here on Tripadvisor regarding old-fashioned TVs and a murky swimming pool, but I found everything to be fine. The living room and bedroom both had new widescrren HDTVs and the swimming pool and hot tub were clean. The pool had saltwater in it, which I like better than chlorine. The price was very reasonable and -- in relation to the price -- my rating is excellent and I will continue to come back. This is an older property, as Embassy Suites go, the decor and furniture are a little outdated. Had the price been higher, my rating would have dropped to average/very good. But, for the rate I paid, the overall experience (the suite, the staff, the amenities, the happy hour, the free breakfasts) was excellent.", "title": "Wonderful Stay. Plan to return", "user": "TKaty", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117991135}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Nice location - better price than riverwalk. Spacious rooms, great breakfast!", "title": "Outstanding Hotel", "helpfulness": 4, "user": "Bianchikid", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117986325}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Only downside is slow elevators.", "title": "The worst Embassy Suites stay to date....", "user": "theFollands", "date": "September 10, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 117906741}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed here with another family so we could go to the Zoo and swim. We were a little disappointed about some of the amenities. The website boasts an indoor and outdoor pool, however there is only an indoor pool. We also thought there was an outdoor play area but there was not one. Overall it was a nice, inexpensive hotel. Rooms were of good size. Our friends had a major issue with their AC (bad news since both men are AC guys) that didn't get corrected and they didn't move them to another room either. The food was good, and there was a small arcade area for the kids. Get to the breakfast buffet early if you want a table!", "title": "Good family friendly hotel", "user": "blugirl1972", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116270223}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I am Hilton Gold member and an avid fan of the Hilton brand. Meeting my daughter for a getaway weekend together in San Antonio, I thought the Embassy Suites would be perfect for us. Good central location, breakfast included, and a room for each of us. The price was right as well... that should have been my first clue - you get what you pay for - and in this case, not much.", "title": "Yuck", "helpfulness": 1, "user": "txtvsales", "date": "July 21, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 2.0}, "id": 115623334}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel is so run down, from the lobby and the atrium, to the pool area, and lastly, but not leastly, the room. Why in the summer of 2011 they have TV's that are still analog box sets that are probably 19\" is beyond me. What was even funnier, you could rent $14.99 movies and watch them on these 19\" sets! But that's not all - carpet was stained and old, furniture was out of date and uncomfortable (not to mention dirty) and maid service was a joke.", "title": "Good Hotel, but not up to HIlton Norms", "helpfulness": 1, "user": "5pyrates", "date": "June 26, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114775079}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "There were also a million (okay - maybe not a million)kids running around ALL THE TIME at all hours of the night. We got a laugh walking through the pool area one evening about 10:30 and counted 14 people in the hot tub (kids and adults) - the water in the hot tub and pool were so cloudy you couldn't see through it.", "title": "Awesome, Awesome Hotel", "user": "Tlindsay75", "date": "June 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 113562742}, {"rating": 4.0, "title": "Good For Business or Pleasure - unless you must be in the middle of the action", "text": "Had a couple of drinks in the bar the first night and it was basically about 6 stools with the restaurant surrounding it. It was okay but not somewhere you would want to hang out. Had room service one time as well - must say, the food was okay (though half of my soup was on the side of the bowl and not in it).", "user": "davidmf", "date": "June 12, 2011", "id": 112945864}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 3.5, "variance": {"poor": 41, "average": 56, "very good": 88, "terrible": 20, "excellent": 93}, "aka": "Embassy Suites San Antonio", "slim_ranking": 0.383285302594}