{"user_rating": 4.5, "review_count": 313, "name": "Embassy Suites Fort Myers", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My husband and I stayed here while house hunting. It was a really nice room and in a very convenient location. Loved the breakfast and very comfy room and bed. Definately would stay here agan. Location was easy to get to and they are close to the mall.", "title": "Good Value for the Money", "user": "Creampuff77", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147063290}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "Breakfast buffet was excellent. Front desk staff was friendly. Shuttle services to the mall and grocery shopping a real plus. The drivers were very willing to help and give suggestions. Can get to the beach by public transit from the mall. I was actually able to stay there without renting a car. This is real value.", "title": "Great value, bad hot tub", "user": "owliefly", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146801755}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "However, do not use the hot tub. Got a few strange acne-like swelling on the rare areas and even a ring-worm infection after soaking and a day of stay. Thinking back, there were leaves floating on the water and the tub and pool had obvious mould-looking dirts on the walls. Soap holder in bathroom wasn't clean either. If you do not plan to use the pool area, this hotel would otherwise be a great choice.", "title": "Great hotel and great location", "helpfulness": 1, "user": "Joe Z", "date": "November 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 145583526}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "Stayed here last week for one night. Front desk staff was great, got into town around noon and was able to check in early. Room was pretty standard for a newer embassay. Very clean and well apointed. Was running late in the morning so didn't get to grab breakfast, but looked and smelled great. Location is right off the highway and very easy. J had a roim facing away from the highway and it was very quiet. Not sure if noise would be an issue on other side of hotel.", "title": "close to shopping", "user": "reppis90", "date": "November 12, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 145269546}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "We choose the hotel because it is close to the Outlet Mall. Like every Embassy it offers a great manager's reception and a good breakfast. The Wifi works well and the room were quite. Also the room were comfortable and clean, but it is maybe not the best idea to have a bright carpet in the entrance area of the suites and at the places where the people eat. You could see they try to clean it, but it did not help.", "title": "Second review--as good as the first", "user": "cbojewski", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145116018}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The Embassy Suites Fort Myers is located a few miles south of Fort Myers and the Airport in Estero Florida, just off of I-75. The property is a 10-15 min drive to the airport and offers an aiport shuttle service for those not wanting to rent a car. Parking is free and the lot is well laid out. The hotel is located across the highway from a large outlet mall (Miromar Outlets) which has a selection of restaurants, as well as walking distance to two chain restaurants and a gas station minimart.", "title": "A good reliable hotel at a reasonable price", "user": "joylama", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 151632092}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Check in at the hotel was fast and easy. Front desk staff were very friendly and courteous. The lobby is bright and airy and there wasn't long wait to speak with the front desk staff. Like most Embassy Suites, the looby leads to a large atrium with the room doors facing the atrium.", "title": "Awesome!", "helpfulness": 1, "user": "EOL7", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151060628}, {"rating": 5.0, "title": "Good accommodations with extras", "text": "The ground floor includes the restaurant which serves the typical free breakfast including hot items such as eggs, bacon, sausage, french toast, etc. as well as continental breakfast items, juices and cereal. Service was very prompt on weekdays, but the layout is not good for weekends when the line could be 15-20 mins for the omlette station, and everyone must pass that station, even if they just want the self service items. Management should create a separate line for the cook-to-order station vs. the self service stations to keep things moving.", "helpfulness": 1, "user": "a j", "date": "January 30, 2013", "id": 151045404}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "There is also a small business center and self service snack shop on the ground level. There is a pool and fitness center but I did not use these and can't comment on quality.", "title": "Top notch", "user": "bgualario", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150897959}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The rooms are two room suites with a living room that contains a sleeper sofa, desk, and TV and a bedroom with a queen bed and TV. Rooms were clean but dark with a fair amount of noise from the atrium audible from the living room area, but no noise in the bedrooms. The desk doubled as a dining table, and there is a small refrigerator and microwave set up with a bar sink opposite the bathroom. The sofa is and chair are a microfiber that feels slightly low quality, but were clean and functional. There is also a bathroom vanity in the bedroom which was a little odd, and made the room seem motel-ish.", "title": "Perfect!", "user": "VeronicaSjogren", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149951408}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "This place has it all, great breakfast, hot omellette station cooked to order for breakfast and free drinks and snacks during the managers hour around 5. Clean outdoors pool and just far enough from everything where it is not too congested. Great place to stay for spring training in Ft Myers which is what we did.", "title": "Great Place", "user": "Tropguy", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148460920}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our family (3) have visited all over Florida but have never spent any time in the Fort Myers/Naples area. We decided to home base out of the Embassy Suites in Estero for our first time to get a feel for the different areas. We visited Marcos Island, Fort Myers Beach, Sanibel Island, crossed Alligator Alley to Sawgrass Mills, the Naples Zoo, Six Mile Cypress Slough and lots more. It was in the middle of it all yet was very laid back and relaxing with it's outdoor pool. The hotel was not very busy, so the breakfast and reception were not rushed or too busy. The wait staff is the best we have ever experienced in our many, many stays in Embassy Suites. We stayed for about $100 per night, great weather of sunshine and 80 degrees before the Ontario (Canada) Christmas break so will be back for more of that in 2013!", "title": "In the Middle of it All!", "user": "UWaterlooTraveller", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148366054}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We arrived early Christmas Day hoping to be able to check in early. We were soooo happy when the person at the front desk told us our room was ready! Thank you............", "title": "Everything was perfect!", "user": "MomWifeGrammie", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148165719}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Our room was clean and smelled fresh, thank you again......", "title": "Very nice place", "user": "bpacker55", "date": "December 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147408809}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "After visiting with family, we came back to the hotel and had a couple drinks at the managers reception. Thank you...that is definately an added plus! The bartenders are definately very nice and personable.", "title": "Amazing Service - Great Hotel", "user": "AFM33", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147228651}, {"rating": 5.0, "title": "Great location, comfortable hotel", "text": "Love the location that allowed us to visit along the Gulf coast, Venice, Sanibel, Captiva, Naples, The Everglades. We even were able to take a day trip to Miami Beach. Good breakfast, (although no pastries???) with made to order omlets. The clean room, soft bedding, plentiful towels, space for us to spread out, makes this a highly recommended place to stay.", "user": "piriac", "date": "January 16, 2013", "id": 149841744}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "One thing, your front desk people were very accommodating but could use a bit of knowledge about local tourist areas. Not one of the three we asked had been to the Everglades?!? All in all we loved our stay.", "title": "Great place to stay in FL if you don't want to stay on the beach", "user": "amuench40", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149833937}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Most of the time when we are in FL we will stay on the beach. But the times that we don't we stay here. The rooms are great, service is good, great restaurant on premises and everyone is VERY nice. And it is very close to the best outlet mall we have ever shopped at. Our next trip to FL will be staying here the first 2 nights then the next 5 on the beach!", "title": "Hospitality at its best. Love Embassy!", "helpfulness": 1, "user": "Jaime E", "date": "January 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 149736138}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My whole family stayed at this hotel - my parents in their upper 50s, my younger sibling and boyfriend in their late 20s and my nephews (ages 9 and 11). The hotel catered to everyone and didn't make us feel like we were crammed in. Each person walked away feeling like this was a spectacular kick-off to vacation. The evening reception was great - the bartenders were as polite to my nephews ordering Shirley Temples as they were to those of drinking something a bit more strong... The server in the restaurant was smart, whitty, funny and laughed with us until late in the evening. Breakfast was as expected at an Embassy - delicious and something for everyone. Everyone enjoyed the pool and the hot tub and the hotel was close enough to the shopping outlets to grab some last-minute items we forgot for vacation. The staff was always warm and hospitable. All in all, it was a relaxingly fun way to begin our 10 day vacation cruise. I am a definite fan of most Embassy Suites and this property definitely did not disappoint. I don't mean to sound like a commercial, but I am always impressed by Embassy.", "title": "Life After the Pink Shell", "user": "J M", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149466738}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Had a regrettable experience at the Pink Shell on Ft Myers Beach. Solved our issue by booking into the Embassy Suites as this is a hotel we have stayed with extensively on family vacations. As expected the service, quality of the premises and amenities was fantastic!!!!", "title": "Nice And Efficent, But A Little Out Of The Way...", "helpfulness": 1, "user": "Tina G", "date": "January 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 149206181}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 5, "average": 18, "very good": 73, "terrible": 0, "excellent": 217}, "aka": "Embassy Suites Fort Myers Hotel Estero", "slim_ranking": 0.666666666667}