{"user_rating": 4.0, "review_count": 239, "name": "Emerson", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I just returned from a weekend at The Emerson. We had a great time. The Inn and rooms are beautifully decorated. Everything is clean and immaculate. Our room was the Regal Suite, complete with fireplace, flat screen TV, DVD, ipod dock, sitting area and deck. The bath was great. Whirlpool jazuzzi, jetted showers. The spa was quiet and peaceful. Treatments were expertly performed. I will definately return in the future. Perfect for a weekend away from the kiddies. Please do not confuse this with the \"Lodge\". The Emerson is an adult only Inn, The \"lodge\" some posters are referring to is a separate hotel, unrelated to The Emerson. I only can comment on the Inn, and it was wonderful in every way. The restaurant was great too. Delicious.", "title": "A lovely stay. Beautiful Accommodations, Great Spa.", "helpfulness": 1, "user": "Janine M", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51213102}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This was our second October long weekend at the Emerson, and it did not disappoint. Same fabulous suite in gorgeous foliage-viewing location with huge hot tub, Swiss shower, canopied king bed, fireplace, deck, flat screen, and METICULOUS attention to detail in and outside the room. Great spa and gym and really lovely staff. I know of no other place within a 2 hour drive of NYC that could give you the same experience. The economy must not be easy on them, and as a result their prices were slashed from 2008 to 2009 - we even got a free third night. I highly recommend the Emerson.", "title": "True luxury in the Catskills", "user": "NYLady4", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47997624}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband & i where here in Feb this year & had a great time, WHAT HAPPENED we are very much foodie people & cant believe we where in the same place the menu was terrible & so was the food & service we were served by a young girl called Jamie i think she was forgetful, rude and seemed to think she was better than any one else there and we were not the only ones to observe this we spoke to a few of the guests that night & the opinions were pretty much the same when we were here last time we had a beutiful fine dine meal for our anniversary and when we came back in October for my husbands birthday it is as though we stepped into a diner and a bad one at that! i can safely say we will never return we are still hurt with what we paid for the disgusting food!! a rip off", "title": "Disgusting Food Terrible Service", "helpfulness": 3, "user": "ldert", "date": "October 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 47642045}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband and I went here and did not have a reservation. It was Sunday during the holiday weekend and they said they had one room left in the whole hotel. Walk in rate was 249 but I suppose since it was later in the day they offered the rate of 199. We checked out the room (a \"suite\") and it was the most beautiful room I'd ever stayed in. The bathroom was larger than a London hotel: sunken jacuzzi bathtub, marble, separate shower with 4 water sources. The room was huge and beautiful with a couch and electric fire place. We spent a lot of time in the spa center. If you are staying in the hotel, you can go there and enjoy the hottub, saunas (wet and dry), yoga room (sin classes), workout room, and beautiful sitting area with tea and fresh fruit all day long for free. There were free bikes and we went bike riding around the area. This is an expensive resort but we managed to have an amazing, relaxing, surprising inexpensive trip by stearing clear of the mini bar and spa packages and restaraunt.", "title": "Luxurious and Calming -- completely amazing space!", "user": "Lynn29", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46638258}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Beautiful suite room with king bed, fireplace and jetted tub Comfortable Luxury", "title": "Elegant Upscale place to stay in catskill mountians", "user": "MichellePrinceton", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 44314883}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "I recently returned from a girl's getaway at the Emerson Resort and Spa. Though we initially had a difficult time deciding where to go, with so many options just a short drive from Manhattan, we were very happy with our choice of the Emerson. As we wanted to get the best value for our money, we chose the \"Ladies of Luxury\" package and a Royal suite at the Inn. This was the perfect all inclusive package for us, and it had everything we wanted and even some things we didn't even know we wanted as far as the treatments were concerned. (I was dubious about the full body sugar scrub but was thrilled with the results!) We had some reservations before arrival that there were going to be a lot of restrictions because of our package, but the Emerson just kept saying, \"Yes\" to every request. Alcoholic beverages are not included in the package, but that's about it. We had our choice of the full menu at every meal, all gratuities were included, and the food was terrific, especially dinner at the Phoenix. I should mention that we went mid-week, when the Inn was at low occupancy. We received serious VIP treatment, but something tells me that all the guests receive the same regardless of when they visit. To sum it up, all of the staff we encountered were extremely hospitable and efficient, the spa treatments were divine, and the facilities and accomodations were lovely, comfortable, and well maintained. It was a fantastic experience, and I would encourage anyone thinking of going to do so.", "title": "The Emerson Resort & Spa: Can I live there?", "user": "kauaiknot", "date": "February 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 24847005}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "If I had to pick one thing to complain about, I would say that the locals who have memberships to the gym and spa facilities can bring some stress in with them, and one crazy woman even walked into my shower and tried to take my robe and towel, but that in no way spoiled my overall experience. Though they should require that the members be polite to the guests.", "title": "Upscale resort near Belleayre", "user": "kwnNy", "date": "January 20, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 23732349, "likes": {"liked": "— spacious comfortable clean room and the spa", "disliked": "— thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "We go to this area frequently to ski Belleayre which is about 20 minutes from the Emerson. There are few nice places to stay in the region so this time we decided to try the Emerson. We checked into a Jr. suite in the lodge which was perfect for our family of 4. Spacious king size bedroom upstairs wtih a large modern bathroom. Downstairs is a queen pullout couch. The only downside is that my kids had to come upstairs to use the bathroom, but this was fine for 2 nights. The cost was comparable to 2 rooms at a B&B and infinitely nicer. It is private, spacious and immaculate. Plus we had use of the spa , fitness center and a very nice breakfast was included. I had a fantastic massage.", "title": "Total Relaxation at Emerson", "helpfulness": 1, "user": "mirandafitz", "date": "January 12, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23504581, "likes": {"liked": "— The Spa!", "disliked": "— Nothing, it was perfect!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "When we first saw the room there was a very loud plumbing sound that turned out to be our neighbors jacuzzi tub. Damon at the front desk offered us a beautiful room at the Inn that was gorgeous and had 2 queen beds. It would normally have gone for $550 a night. We declined but it would have been great without kids. However, if we weren't skiing in the area, I wouldn't travel all this way to pay $550. The spa and resort is lovely, but I'm not sure its worth the money if you are there only for that reason. Prices are not quite manhattan level, but close.", "title": "Almost Couldn't Have Been Better", "helpfulness": 1, "user": "ansnyc", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23077447, "likes": {"liked": "— Casual yet high-end and luxurious.", "disliked": "— If I had to pick one thing, it was only that there were no movies on demand."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "The one downside to the lodge is the noise. You can hear your neighbors plumbing and their TV and kids. As it turned out, it was quiet at night so we were not disturbed, but I could see this being a problem if you had a crying baby next door.", "title": "R&R for a Busy Citygirl", "user": "tuyettran", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23065497, "likes": {"liked": "— The room, atmosphere, and people.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "What a wonderful Place. Stayed in the Inn - luxurious. Room was comfty with a super whirlpool and shower. Breakfast was more than adequate. Service throughout the Resort", "title": "A Terrific Haven", "user": "havingfunagain", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39085442}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "was wonderful - everyone was helpful and friendly. The Shops on premises had much character and the prices were reasonable.", "title": "There was good and not so good.", "helpfulness": 2, "user": "csbtrips", "date": "July 21, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 35404901}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "After a day of tubing and hiking, a swim and steam were a perfect ending. Wanted to get a message but it was booked.", "title": "We had a lovely time - I don't where some of these other people stayed", "user": "kininel", "date": "June 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 31492449}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "And the area - just beautiful . The vistas were a sight to behold, the nearby towns had great restaurants and were also very reasonably priced.", "title": "Pricey, but unfailingly luxurious if that's what you want", "user": "altlisa", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27588411}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Definitely will go back and hope some Exclusive Offers come my way.", "title": "the worst of the worst! What a RIP-OFF", "helpfulness": 5, "user": "ccc_8", "date": "April 6, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 27506833}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Impressed with this place. Unusually for new American hotels, this place had character and charm. The staff were attentive and the restaurant/bar areas were homely and relaxing.", "title": "clean, comfortable...and characterful.", "user": "a_pinkerton", "date": "April 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 27216664}, {"rating": 1.0, "stay_parameters": "Stayed February 2009", "text": "The room, in the lodge, was a bargain at $99.00/night for a two Queen-bed room (just phoned and asked for the best rate!!). Clean, pleasantly decorated, with lovely views. What more could you want!", "title": "Horrible Employees, they have no training do they?", "helpfulness": 4, "user": "ZooWorld", "date": "March 19, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 26422769}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I stayed at the Emerson Resort on Feb, 14th 2009, and I must say I wasn't impressed. The moment I got in I wasn't appointed by ANY sort of porter, and the employees over at the Spa were talking about a party they went to the previous evening. As I went to my room I noticed that the hallways smelled like mold. It smelled like it hasn't been cleaned in months. It was dust central. When I got to the rooms it wasn't all that spectacular like the pictures made it. NOTHING like the pictures. It was somehow enhanced to look better. I recommend not going to this resort. They have no idea how to manage themselves. I asked for an extra pair of towels, took them about 20-30 minutes. For the price I am paying, i'd say that isn't good service. The employees must be the biggest issue of mine there. Only if they had GOOD Management there. WARN YOU ALL, don't stay here, the price is over the top for the quality you get.", "title": "Way overpriced, they should read the newspapers.", "helpfulness": 3, "user": "lovethelake99", "date": "March 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 26125165}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "I am curious who manages this resort...", "title": "Aweful!!!", "helpfulness": 5, "user": "PTLMT", "date": "March 5, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 25641293}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Thank you for reading my review.", "title": "The SPA treatments were amazing", "user": "saraNYC678", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 24891102}], "location": {"country": "United States", "city": "Mount Tremper"}, "variance": {"poor": 16, "average": 30, "very good": 72, "terrible": 18, "excellent": 103}, "aka": "Emerson Hotel", "slim_ranking": 0.5, "description": "Surrounded by the natural splendor of the legendary Catskill Mountains, the Emerson is a hidden treasure located a mere two hours outside Manhattan. The tranquil property offers spacious accommodations in the Adirondack-style Lodge and unique Eastern-inspired suites in the adults-only Inn. Featuring an award-winning spa, Contemporary Catskill Regional Cuisine in The Phoenix restaurant, cozy dining in the Catamount Restaurant, the shopping haven of the Country Stores and the Kaleidostore, the Emerson provides a memorable yet affordable respite from the demands of the outside world. Overlooking the Esopus Creek and one of the region’s most magnificent peaks, Mount Tremper, the Emerson is also an idyllic location for special events, including corporate retreats and destination weddings. Pets are welcome."}