{"user_rating": 5.0, "review_count": 159, "name": "Emlagh Country House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We just spent the most wonderful weekend in Emlagh House. Marion and Grainne (the owners) are fantastic hosts. Nothing was too much trouble. The bedroom was absolutly stunning (apart from being a little chilly), but it was a lovely big size with a matchingly big bathroom (with a wonderful shower). The location is excellent as the main street is literally 5 mins away by foot. We dined in 3 superb restaurants, all recommended to us by Emlagh House. The breakfast was super and we both looked forward to it each morning (worth the early start - breakfast finishes at 10am). We will definitely be back!", "title": "Because it's worth it.....", "helpfulness": 1, "user": "Sandra B", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155063616}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is the best guet house I have ever stayed inThe rooms are fitted out to six star standard with amazing sea views.Breakfast has to be had to be believed.Marion and Grainne are two hidden gems for the Irish tourist trade.It is not cheap but is truly worth every cent and more,", "title": "The best kept secret in Ireland", "helpfulness": 5, "user": "stintinO205", "date": "January 15, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 149770016}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "of 5. Stayed at the Emlagh House 2 nights of our 10 day family trip. Easily rates as the best of the trip. Easy to find too - It's located on the left, right as one enters Dingle. The house is more like a mansion. Rooms and bathrooms are huge and quiet, interior decoration nicely appointed with antiques and art work. The hostess, Marion, is there to greet you, ensure your needs are met, and was very helpful with our many questions and requests. Breakfast in the sun room each morning was great. Try the french-pressed fresh coffee and Marion's creamed eggs. Delicious combination.", "title": "Best of the trip!", "helpfulness": 1, "user": "greecube", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143237212}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I were going to Dingle for a wedding and on advice from the grooms mother we booked Emlagh, it was a very wise decision! From the moment we arrived we were well looked after and indeed before I arrived Grainne ( one of the owners ) was able to advise me on a hair salon for an appt for the morning of the wedding.", "title": "Excellent b + b in a beautiful setting", "helpfulness": 2, "user": "Dublinlass", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141155379}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Our room was large, spacious and beautifully furnished. The bathroom was well equipped and had one of the best showers I have ever had in a hotel situation! Breakfast was beautifully cooked with a good variety of options to choose from including the full Irish! A complimentary newspaper was supplied each morning.", "title": "Exceptional in every way", "helpfulness": 1, "user": "surfingtoday", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140742900}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Our family of 3 stayed here for 2 nights in July. We were traveling for nearly a month in England, Ireland, and Scotland, and this was one of our very favorite places. The house is gorgeous, with spacious and well appointed rooms, a huge bathroom, and comfy public spaces. Oh, and the artwork around the house is magnificent - lots of great local pieces. The breakfast is outstanding - I'm still dreaming of all of the wonderful options! Marion and Grainne took such nice care of us, from when I first made my reservation online to our departure.", "title": "Loved it!", "user": "mckenzie99", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168918137}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We only had 6 days in Ireland and finally narrowed down our itinerary to include Dingle, and I'm sure glad we did. We fell in love with this little town and the stunning natural surroundings. If anyone is considering a visit to the west of Ireland, I whole-heartedly recommend Dingle and The Emlagh House. I can't wait to return.", "title": "Confortable, Nicely Appointed Accommodations in Beautiful Dingle", "user": "nido6", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168440249}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Marion and Grainne Kavanagh are the perfect hosts. We stayed, not at the Emlagh Hotel, but further down the road at their lovely Water's Edge property. Our family of six, including four teenagers, was very comfortable in one of their 3 bedroom, 3 bathroom apartments with a lovely view of the bay. The apartment had all the modern amenities and was a five minute walk from town. It was a perfect home base from which we explored the beautiful Dingle peninsula.", "title": "Amazing stay at such a beautiful place", "user": "Kathy W", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168079427}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Emlagh House was absolutely wonderful. Our room was stunning and very spacious. The bathroom was larger than mine at home! Upon arriving I wouldn't allow my husband to put anything in our room until I could take pictures of how beautiful it was. Everyone that worked there was nice and helpful. Breakfast was incredible (try the French toast!) and it was held in a beautiful dining area with large windows that look out at the coast. The location was perfect, we were able to walk to great restaurants and shops, and it is just a short drive from Inch Beach. I highly recommend this B&B and hope to make it back again someday!", "title": "Simply amazing", "user": "jagmd", "date": "July 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167223038}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We just spent two wonderful nights with the Kavanaghs. What an amazing place! The interior finish is second to none and staff are incredibly friendly and accommodating. This is truly a 5 star place which you won't want to leave. Beautiful views of the harbor and only a 5 minute walk from downtown Dingle. Very comfortable beds and wonderful breakfasts. You are bathed in luxury at Emlagh House.", "title": "Exceptional Value", "user": "alynch84", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167102690}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Just returned from a 12 day tour of Ireland (three ladies enjoying hiking and luxury combined) and spent a few days in Dingle at this absolute magnificant property. The house is magnificant, rooms are spectatcular, I could have lounged in the sitting room sipping tea all day but I woudl have missed the fantastic scenery. A short walk into town yet this sits on a magnificant piece of land with an amazing view.......One of the most charming properties I have stayed at anywhere.....I will return........", "title": "Absolutely Beautiful.....", "helpfulness": 2, "user": "pammy26", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162760395}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We just completed our 4th exceptional stay at this outstanding establishment in Dingle Ireland. The house is beautiful, the service is without compare, the breakfasts are delicious and the proprietors: Grainne and Marian Kavanagh are excellent hosts. Highly recommend.", "title": "Emlagh House exceptional as usual!", "helpfulness": 1, "user": "dhavens", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162180854}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "I recently had the pleasure of spending a night at Emlagh Country House. For lovers of romance, this truly is a treat. The house is beautifully decorated and the rooms are spacious with comfortable beds. All the added little touches make the difference, from the coffee and freshly baked goods on arrival to the evening turndown service. Breakfast was delicious and the location is very convenient. Overall a wonderful find and I hope to return in the near future.", "title": "Relaxing and romantic", "user": "AMCLimerick_Ireland", "date": "May 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 161597042}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "This is a truly wonderful place to stay in Dingle...a really lively and interesting place...Emlagh House is just on the edge of the town, a short 5-10\" walk to the center, so it's quiet, with views of the harbor. It is an elegant B&B (really more like a small hotel), but in an understated, comfortable way. The breakfast, in a sunny space, is outstanding, especially the baked eggs and the \"full Irish\". My room was large and beautifully furnished with antiques, and was very reasonably priced, considering the quality.", "title": "Fantastic lodgings!!", "user": "calhounseattle", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161109521}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "But what really sets Emlagh House apart is the graciousness of the mother/daughter team who manage it...Marion and Grainne Kavanagh. They do everything possible to make your stay in Dingle memorable, and if you stay with them it certainly will be!", "title": "A gorgeous, unique, tasteful inn in a very special location is made more special by the personal touch of the family who runs it", "helpfulness": 2, "user": "Haley C", "date": "April 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158209699}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My husband, son and I stayed in the Bluebell and Iris room and were able to close the external door and make this a suite. The rooms were lovely! Thoroughly enjoyed the heated floors and towel racks, the bath salts, etc. We really felt pampered. The location was convenient to \"Dingle Town\" so we were able to walk where we wanted to go. All of the common areas were relaxing and peaceful. We were immediately relaxed by the welcoming fire in the entry lobby. Easily one of our favorites and definitely the nicest of our accommodations durng our two week stay in Ireland", "title": "PEACEFULLY, Having it All!", "user": "Theresa D", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166080405}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "What a delightful B&B. Our Primrose room was beautiful, the location of the B&B was convenient, but it was the warmth of everyone which made our stay so special. This was our favorite spot, by far, in our 11 day tour.", "title": "Wonderful place, wish we could have stayed longer!", "user": "Nancy H", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165551211}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Only stayed 1 night and was by far the best place ever stayed! Great welcome and lovley fire in the hall. Luxury all the way!!! Breakfast was yum!!! Rooms are gorgeous! Chocolate by the bed!! Lovely bath salts! I couldnt fault Emlagh. Will def be back again!!!!", "title": "Hard to leave.......", "user": "EffigyBoutique", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165001107}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Just returned from a 7-person family trip to Ireland. Three nights at Emlagh with Grainne Kavanaugh, her mother, and staff including Bea, whose baking is delicious and served with grace, was the highlight. The rooms are suites, really, comfortable and beautifully decorated with fine local art. The sitting rooms and breakfast room are very hard to leave. The library is well stocked as is the honor bar. The fireplace in the entry hall is welcoming (and necessary coming in from the soft Irish rain). We had one couple, two grandparents, and a mom with two young girls: everyone chose Emlagh House in Dingle as their favorite spot in our 10-day tour of Ireland. We'll be back as soon as we can!", "title": "Best stay in Ireland", "helpfulness": 1, "user": "nancy m", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164886871}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We were telling a dear friend about Emlagh House, and she remarked that she wasn't into bed and breakfasts - we responded that Emlagh House is to a bed and breakfast as a Shakespeare sonnet is to a jiffy-lube jingle.", "title": "A Delight", "user": "lvlawdog", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164539835}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 3, "terrible": 1, "excellent": 155}, "aka": "Emlagh Country House Hotel", "slim_ranking": 0.111111111111, "description": "Emlagh House is a gracious country house located at the entrance to Dingle town overlooking Dingle Bay & harbour. The Kavanagh family, a local family, ensures that all guests enjoy their visit to the beautiful Dingle Peninsula & share their extensive local knowledge with each guest. Grainne & Marion Kavanagh look forward to sharing this wonderful area with you & welcoming you to their multi award winning home."}