{"user_rating": 4.5, "review_count": 405, "name": "Empire Hotel Llandudno", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Stayed here on business & can't wait for my next trip. I also intend to go back for a holiday. The best things about this hotel are the wonderful decor & furnishings and the friendly, helpful staff. I met many people who were returning guests, some had been visiting for years.", "title": "Fantastic, can't wait to go back", "user": "hazelha", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82629141}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I'm surprised some reviewers criticised the breakfast as I found it excellent. There was a good selection of fruits, cereals, yoghurts, juices etc - and if a juice did run out it was only a moment before it was refilled.", "title": "The best place to stay", "user": "Chas1959", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81285587}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "An great selection from the menu, all cooked freshly to order & delivered very promptly so no worries about being late for work. Much better than buffet breakfasts where food has sat for ages.", "title": "Excellent hotel in the best location", "user": "MikeandCaroline", "date": "September 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81017330}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "While the parking is limited, it is pretty good for such a small town. Remember this is a Victorian resort, built before everyone had cars! You can always park behind someone & leave keys with reception. And if you do get blocked in, it takes about two minutes for them to move the other car so it works really well.", "title": "Beautiful hotel, centrally located with excellent food and friendly helpful staff.", "user": "LancashireLass15", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79648639}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The bar areas are extensive & range in styles from opulent traditional areas with chandeliers & leather armchairs to more modern areas with chrome & white stools. I was happy to sit on my own reading the paper with a glass of wine and always felt comfortable.", "title": "Very nice hotel. Would definitely return.", "user": "Missus_London", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78643428}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Travelled to Hotel arrived mid afternoon, left luggage at hotel. Looked around llandudno for an hour or so,had snack and returned to Hotel. We had a phone call from A respite/care service who imformed us our severly Autistic son had become ill and we would have to return from our short break to collect him. We had spent less than 2 Hours in the hotel,didn,t use any facilities . We enquired about simpathetic refund because of a unforeseen emergancy. (We gave them the Respite care telephone number and address to verify our situation) The manager has offered nothing more than £25 off the next time we book a stay. This is not going to Happen. We thought they would at least deffer the stay to another time, but alas they only want money not customer satisfaction. I would rate this hotel as 3/10 because the porter was helpful and the receptionist assisted us to the best of her ability. Our son is fine, but £103 to use the room for a couple of hours to store our bags . NOT GOOD", "title": "only interested in your money", "helpfulness": 1, "user": "MONEYPLEASE", "date": "July 16, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 71175327}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "my husband took me to this hotel for my birthday i found the reception staff very helpful and our room wa perfect. we had one evening meal in the hotel which was excellent but our big dissappointment was the breakfast each morning. very poor quality and quantity limited choice and no brown toast only white. we recently stayed in wales at a bed and breakfast which was a lot cheaper and the breakfast was twice as big.", "title": "dissappointed", "user": "neil78", "date": "July 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71123372}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My family and I had been looking forward to this mini-break for ages; Llandudno has lots to offer for the majority of people. Obviously before booking, we read up on several hotels on Trip Adviser and finally decided on the Empire. The reviews on this hotel seem really good - WHY! When we arrived at the hotel, we walked into the reception area which seemed very tired-looking and in desperate need of a coat of paint. The receptionist was very helpful, a bit too friendly and reception area itself was very untidy and dis-organised.", "title": "If you like clean rooms, DON'T stay here!", "helpfulness": 5, "user": "PlummyMummyMalvern", "date": "July 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 70395708}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "After checking in, the porter came to show us to our room which we never would have found without him. The maze of narrow, shabby, dirty corridors in this hotel is incredible. Room 52 was our first stop. When we walked in, my heart sank. We'd booked a mini suite which was supposedly big enough to sleep my daughter on a sofa bed. The room was small with low ceilings, it smelt funny and the furniture was unbelievably horrible and tatty. The carpet looked as if it hadn't been hoovered in months, the paint on the windows was peeling off, the sheet on my daughter's bed was stained, there was a coffee stain on the wall just behind the bed, some of the light switches were sticky, the toilet was covered in thick dust. I would go on, but you might think I'm being too fussy.", "title": "Best loved hotel . Returnrd after 10 years staff are the best you can meet, all the same faces", "user": "marion18", "date": "July 8, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 70191326}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Anyway, after all of that, I went downstairs to ask the receptionist to check us into another room. The only room that was available was room 56. On inspection, this room was only slightly better than the first, so we took it. Then around 3.30ish, we heard the sound that most people hate; the dreaded kitchen extractor fan! At this point, I wanted to check into another hotel. This extractor actually was switched off around 10.30, so it wasn't that bad, but staying in that room, you do get the cooking smells wafting into your room, which really wasn't nice at all.", "title": "Still a loyal customer... and yet...", "user": "Jebbers", "date": "June 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68660499}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Stayed for 5 nights on a B&B basis. Location is perfect, right at the top of the town centre, minutes from the sea front and very close to Tram station. Free parking available and although we didn't have a problem parking, they are very tight spaces and you might have to block another car in and leave your keys at reception (we scratched the car a few times getting out!!).", "title": "Nice independent hotel", "helpfulness": 1, "user": "Debbie007", "date": "August 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 74396440}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed in room 44, which was really unique and lovely, with front views of Llandudno and lovely ceiling beams, wood flooring and large ornate lighting. Nice facilities included fridge in room, sherry and DVD player. Some lovely homemade biscuits were provided on the first day, but were never replenished during the holiday (quiet disappointing for 4* hotel). Bathroom was of high quality and clean, with robes (although both slightly dirty - make up marks from previous occupants....) and lovely toiletries.", "title": "For something out-of-the-ordinary, book a room in the annexe", "user": "SusanBJennings", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73699506}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Hotel had leisure and spa facilities. Went to use the pool, but too cold. Husband happy with gym standard and I had a excellent & lovely spa treatment-beautician very nice. Very basic towels were provided in the room for gym/pool use and no water machine in gym. Free internet access at main reception (one computer) very handy.", "title": "WOW......WHAT A LOVELY HOTEL", "user": "Blueanne", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 72516236}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Breakfast was ok - lovely to have waiter service and good choice of hot breakfast (better than buffet style which often get in other hotels & could also have fish). Room nicely done and relaxing atmosphere. Disappointed by cold options, lacking in fruit options, juices often ran out, no fresh bread and often ran out of the mini pastries provided. Also shocked to find mold on my toast one morning and that did put me off eating breakfast that day (manager provided free desert in room as apology).", "title": "good old fashioned quality", "user": "coupie-10", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 72118270}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Overall nice hotel in excellent location, however feel that the hotel did lack attention to detail in some areas.", "title": "A Nice Little Break", "user": "TEEMILL", "date": "July 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71248286}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I have been visiting this hotel for many years with my own children and now my grandchildren and we all feel so comfortable here. The staff are wonderful and really helpful, nothing is ever too much trouble for any of them", "title": "Very Happy Family Holidays", "user": "mammar1", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77255203}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The public rooms are very relaxed and comfortable with plenty of room to spread out and not be on top of each other. The bedrooms are all different in size but very comfortable - none of your corporate cloned rooms, The swimming pool is great, as is the gym equipment should you feel the need to exercise! mind you as the food is excellent whether served in the lounge area or the restaurant that might be an idea, the only fault if you could call it that, is the dessert menu maybe needs varying more often!!! also maybe a little more attention to housekeeping wouldn't go amiss,", "title": "FANTASTIC HOTEL", "user": "EARLGREY500", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76467618}, {"rating": 3.0, "stay_parameters": "Stayed August 2010", "text": "The Hotel is 5 minutes from the long beautiful promenade on which you can watch a Punch and Judy show, take a boat trip, walk on the beach, and there is a little train which goes round the town or visit the Ski Run in Happy Valley which is a lovely park , you can take a tram up to the top of the Orme, maybe take the cable car back down, and all within 5 mins from the Hotel. The Welsh Mountain Zoo is exceptional value for money and Penhryn Castle (National Trust) it is just 30 minutes away is a great day out", "title": "Best Hotel in Llandudno - but could do with some competition", "user": "TheEvaluatorLondon", "date": "August 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 75634944}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Having just returned from our trip we are now looking forward to our next family visit to The Empire Hotel and Llandudno.", "title": "Best hotel in town.", "user": "Leah1974", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75411535}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Spent 2 days at the hotel with my daughter - the hotel is spotless and the the service of the staff was excellent nothing was too much trouble – the location of the hotel is also perfect – close to the Great Orme – we got the tram up the Great Orme and walked back down the views were breathtaking. There is a pub close to the tramway – the food is good and the pub itself is very welcoming. We ate at the Italian restaurant on the same road as the hotel the Bella Vista – we had home made pizza it was fantastic and the ambience in the restaurant was lovely. I will highly recommend this hotel – don’t forget to use the roof garden – most people didn’t seem to know about this so we had it to ourselves. The pool, sauna and steam room were very nice and again not overcrowded – full marks to the hotel and staff.", "title": "Very Relaxing, Enjoyable and did not want to go home!", "user": "Elm1236", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74584128}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 12, "average": 22, "very good": 79, "terrible": 10, "excellent": 282}, "aka": "Llandudno Empire Hotel", "slim_ranking": 0.21875}