{"user_rating": 4.0, "review_count": 175, "name": "Empress Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "My husband and I stayed at the Empress on Sat February 18, 2006. We were very pleased with our stay.", "title": "Fun Weekend", "helpfulness": 3, "user": "jamaicaluver", "date": "February 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4474357}, {"rating": 5.0, "title": "A Terrific Place To Stay In Asbury Park", "text": "We were aware of the night club and the fact that the hotel is gay friendly.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 16, 2005", "id": 3778139}, {"rating": 5.0, "title": "EXPERIENCE THE NEW ASBURY PARK!", "text": "When we checked in we asked if the noise from the night club would be a problem. Lauren at the front desk was extremely accommodating and moved us to a room away from the disco.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 7, 2005", "id": 3645903}, {"rating": 5.0, "title": "Hooray -- I can return to Asbury Park!", "text": "The rooms are very nice. Very clean-The bed was extremely comfortable. It was a very cold night but the heat worked great and we had great covers to keep us toasty warm.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 29, 2005", "id": 3424674}, {"rating": 4.0, "title": "Events...", "text": "We got back to our room about 12:30 and the club was indeed going strong. But it was fairly quiet in the room. We could occasionally hear the bass but it was faint and not a bother. There was what I assume was a group in the room next door and we could occasionally hear them but it wasn't enough to complain about and we both feel asleep quickly. The hotel was very quiet about 3am on. Couldn't hear anything.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 11, 2005", "id": 3350729}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My wife and I stayed here in March of 2012 while attending a Brit Floyd [Pink Floyd tribute band} show at the Paramount theater on the boardwalk. This hotel had a great location,near the beach and only about 3 blocks from the paramount theater which has been restored and is on the national historic list of properties.It is an Excellent place to see a show.The hotel was clean ,the room basic but reasonably priced . The staff very friendly and accomodating.The bedding could definitely use an upgrade though.The hotel is near everything of interest in Asbury park . This was my first return to Asbury park in about 40 years ,I was last there at about the age of 10 so I don't remember much about it back then, but I am glad to see and know they are restoring it after letting it decay for years. It was neat seeing the Old casino building[filmed in the Robert Deniro movie.. 'city by the sea. ,and the old carousel building and the Wonder Bar \" etc.,It makes me think back to what Asbury Park must have been like in it's heyday.We would return to this hotel due to it's price,cleanliness and location.", "title": "One of the better hotels in Asbury Park", "helpfulness": 2, "user": "deanroc", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154901985}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "I stayed at the Empress from January 26-27. The Empress was such a great place to stay. The front desk workers were sweethearts and the rooms were beautiful. I really appreciated the discount they gave towards the people who were apart of the Beard and Mustache comeptition. Next time I'm in Asbury Park, I will be staying at the Empress again.", "title": "So much fun", "user": "Heather B", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153531736}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Our stay at the Empress was quite pleasant. The staff was extraordinarily friendly and accommodating. We were in town for a charity event and the font desk even donated some money! I personally couldn’t have asked for much more. The rooms were nice and clean and the balcony was a nice bonus. All in all I had a great experience! Thank you!", "title": "Amazing staff", "user": "Sean M", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151098947}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "- Sean Marianetti and the Rochester Beardsmen Society", "title": "Bearded weekend in Asbury", "user": "Dantm468", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151097577}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "We showed up on fri for check in and were met by friendly accommodating staff. We were given our room keys, and headed upstairs. The rooms were spacious and the balcony view to the strip was great.There was a large group of us that came down for a Beard and mustache competition, so at some point over the weekend things were bound to get messy, Well Copious amounts of alcohol at local establishments later they were..lol", "title": "AMAZING HOTEL!", "user": "Erinbrown", "date": "January 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150892622}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Stayed over the 2013 Memorial Day weekend and all I can say is that the hospitality was by far second to none. The customer service while booking my stay as well the service received upon arrival and through the duration of my stay exceeded my expectation. I would highly recommend the Empress Hotel to anyone looking for a beach stay with a worry free process.", "title": "Great Customer Service", "user": "Victor J", "date": "May 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162411916}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "This years Memorial Day weekend stay was perfect- hotel staff, bartenders, waiters, deskman Tom and manager Kristen, the best. Thank you again for making us all feel like family. Always my number one choice at the beach.", "title": "One word-- Perfect!", "user": "creativesoul8", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162170791}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The staff were really friendly and the seafront location is excellent.", "title": "Great location", "helpfulness": 1, "user": "Isobeleast", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161986232}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We booked online and the only option was for a room with 2 double beds. When we arrived at the hotel we had the option to take a king room.", "title": "Nice, clean, funky hotel :)", "helpfulness": 1, "user": "Deborah K", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156184323}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The room was clean and we had a great view of the ocean.", "title": "Keep going back for more", "helpfulness": 1, "user": "hasta_el_cielo", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154993856}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Met up with a bunch of the girls for the evening to go to the Stone Pony for a Christmas Show. Many stay down the street at another hotel but we love to stay at the Empress. It is a short block to the Pony, across from the Boardwalk, close to the Wonder Bar and the Paramount. All a short stroll down the street. The rooms are always clean, bright and airy. Nice linens too; not scratchy! We had a room facing the ocean with a small balcony. Too bad the weather was bad the next day but the view was still really nice. The bagels the next morning were a welcome plus and the coffee is delicious! We love to stay at The Empress when we visit Asbury Park. You should too!", "title": "Always A Pleasure to stay at the Empress", "user": "Betty C", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147968770}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Fun and lovely boutique-ish hotel one block from The Stone Pony and the beach. In my opinion, BETTER than a boutique hotel, as it didn't have that overly precious aura that some have.", "title": "Fun in the sun and a room with ocean view", "user": "NYLifer", "date": "October 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143177415}, {"rating": 5.0, "title": "Second time and it was a charm!", "text": "For us, it is the perfect place to stumble to after a hard night at the Stone Pony music club.", "user": "stinkymmonk", "date": "October 7, 2012", "id": 142236439}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "It also features it's own bar and disco. We were concerned about noise, but didn't hear a peep, just the sound of the ocean waves from our balcony.", "title": "Good location!", "user": "SATraveller25", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 140405200}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "HIGHLY RECOMMEND!", "title": "Wonderful Wedding Weekend", "user": "sharon b", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140172035}, {"rating": 1.0, "stay_parameters": "Stayed July 2013", "text": "The Empress doesn't deserve this kind of management. The hotel's location can't be beat, and the fact that a pool, beach bar, and dance club are all on premises are additional points in favor of the hotel.", "title": "Great location let down by rude staff and smoky rooms", "user": "tapdancer77", "date": "July 6, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 166553362}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Unfortunately, however, the hard product is the only thing good about this hotel. They pride themselves as a TripAdvisor award winner, yet their staff and rooms fail to deliver. We arrived to find our room filled with cigarette smoke, despite this being advertised as a non smoking hotel. When we complained to the management and asked to be moved to another room, the management's response was that they were very sorry, but the previous night's guests had to be removed by the police and that there was nothing they could do as they were completely booked. Throw in rude hotel staff that shouted at us (and other guests) and bartenders at the pool bar who called us names and you have our experience at the Empress...customer service is definitely NOT job #1!", "title": "Great hotel and amazing staff", "helpfulness": 2, "user": "YLC_12", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165486585}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I've stayed at the Empress hotel at least 5 times and it's always been amazing. The beach front location is ideal...easy access to restaurants and nightlife. The pool is always so much fun and they have great happy hour specials. The rooms are spacious and clean. The staff is so friendly...my fiance lost his iphone in the club one night and the manager Doug found it and kept it safe for us. This hotel is pet friendly! I wouldn't stay anywhere else in Asbury Park...highly recommended.", "title": "Pleasantly Surprised", "user": "JDV1927", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 165118850}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at the Empress because we were going to a concert at Monmouth University and it was relatively close by. Driving into Asbury Park had us concerned... there are some abandoned buildings near the hotel and lots of construction as well.", "title": "Good for college kids and those who just want to be by the water", "user": "Pamela0610", "date": "June 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 164637993}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Stepping into the Empress was like going back in time a bit. The interior has a retro feel, but it is very clean and the staff really friendly and easy to talk to. Our room was dated but CLEAN! The bathroom was spotless, the bed very comfortable.", "title": "Stylish, hip, regal, cool & friendly", "user": "ayemgee", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162719234}, {"rating": 4.0, "title": "An eye opener!", "text": "Well appointed rooms, clean and comfortable. The HBO chanel didn't work (sound, but no picture bizarrely), but I wasn't there to watch TV so it didn't bother me. Decent continental breakfast included in the price. I stayed there because it is very handy for The Stone Pony (50 yards away).", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 11, 2004", "id": 2876012}, {"rating": 5.0, "title": "Fun at the Shore!", "text": "Points to note. On the night I stayed, this hotel had a 99% gay clientele, who were so over the top! I didn't have a clue about the reputation when I booked in. Everyone was friendly; the guy who propositioned me after 2 minutes of idle chat was over-friendly so I retired upsatirs alone. Despite its beach setting this hotel does not seem to be the ideal lodgings if you have children (6ft 3in scary looking tranvestities in the lobby)", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 16, 2004", "id": 2829333}, {"rating": 4.0, "title": "Empress Hotel.", "text": "The surrounding area is very miserable.", "helpfulness": 3, "user": "Coolerthanyou", "date": "November 5, 2004", "id": 2809086}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 11, "average": 13, "very good": 62, "terrible": 9, "excellent": 80}, "aka": "Empress Hotel Asbury Park", "slim_ranking": 0.25, "description": "Setting the standard for Asbury Park, the Empress Hotel has 101 rooms. Across the street from the Atlantic Ocean and adjacent to historic Ocean Grove, our hotel offers breathtaking views of the beach, Wesley Lake, and our oversized pool. Sunbathing or jogging, shopping or swimming, the Empress is the perfect access point for the boardwalk, beach, revitalized shopping district, and dozens of area attractions. Our poolside Tiki huts, world-class dance club, and customized professional service offer everything for a relaxing getaway or the perfect party. At the Empress Asbury Park, the royal treatment is yours."}