{"user_rating": 4.5, "review_count": 4306, "name": "Encore At Wynn Las Vegas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "A stunning hotel on the Las Vegas strip. Fantastic bars, nightclubs, Show Theatres, Restaurants, Coffee Shops , Spar and Swimming Pools gambling etc, The Hotel has an excellent Breakfast and Evening Buffet but note the price increases considerably Saturday and Sunday. Nothing is a problem to the vast amount of staff of this Hotel.", "title": "Everything and more than we could have imagined.", "user": "jeffl2503", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114765495}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I just returned from a 3 night stay at the Encore. Despite having requested a non-smoking room and getting a room on the 63rd floor which is designated as non-smoking, there were ashtrays in the room and people were walking the hallways with cigarettes in hand. Getting into bed at night meant pulling a duvet that smelled vaguely of tobacco over myself- YUCK! Down below in the hotel, people walk around puffing away in the casino, at the coffee shop, at the pool and stroll past the restaurants. I lost my appetite, got nauseous and had a perpetual headache. It is not pleasant at all.", "title": "If you are sensitive to cigarette smoke, stay elsewhere", "helpfulness": 1, "user": "erinontheroad", "date": "June 25, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 114746931}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The first room we stayed in was on the side of the pool 30 levels up and the techno music from the beach club could be heard day and all night, doof doof! The overspill from the club, means people are walking around in bikinis and stilettos, even down the street, men on meat market patrol. It's definitely meat market! The second room we stayed in on the other side of hotel was much quieter, but let's get down to the room. Both rooms had strange smell s. When the sun hits the room you can see dust all over the top of everything, the linen feels unclean and nothing is fresh. The faux leather poof (white) is filthy. The decor is very disco. This is the worst of the so called higher end of the market. Second is Venetian. Don't waste your money on this disgusting hotel that reeks .... Especially the elevators so groce!", "title": "Never again!", "helpfulness": 4, "user": "rocky2319", "date": "June 23, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114676298}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We spent days patrolling the Internet for the best place to stay. We were looking for a upscale hotel that had a great pool, cool atmosphere and great rooms/restaurants. The Encore met all those expectations and was a terric experience. Our room was spectacular, the pool was classy and not overpacked and the service was professional and friendly. We took advantage of the $40 spa passes which was a good deal. The Encore and Wynn are best suited for people looking for an upscale, low key experience that is focused more on high end service.", "title": "Relaxing, first class stay at five star resort", "helpfulness": 1, "user": "bptmark", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114611558}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Don't be fooled. Encore at Wynn does NOT offer a five star service. I stayed there for two nights with 3 girlfriends in June and we were thoroughly disappointed with the hotel:", "title": "Poor for a five-star hotel", "helpfulness": 3, "user": "itrunsdeeper", "date": "June 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 2.0}, "id": 114610486}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed for 4 nights, having previously stayed twice at Wynn. Staff are really fantastic. Service and food quality excellent- loved Society cafe, very reasonable and the breadsticks wow! Staff are knowledgeable, courteous and genuinely take pride in ensuring the highest standards throughout the property. Public areas are immaculately maintained. 5 minutes to check in- acknowledged as previous guests. It's hard to review something that I have nothing to really take issue with- I guess the rooms aren't a massive wow factor if you're used to that kind of thing and the sofa is not amazingly comfortable (unlike the beds which are just stunningly comfy).", "title": "They thought of everything you'd appreciate, then added a bit.", "user": "LauraJHodson", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114943631}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Get the red card- very easy to rack up points, I think it was 250 for a buffet for two people which was easily redeemed; just ask at the desk. So we enjoyed two free trips to the buffet during our stay- my are the deserts heavenly! We enjoy walking over to the the Fashion Show Mall across the road, very easy to get to from Wynn. Here there is a Starbucks where you can pick up a tall brewed for $1.50. Bus stop outside if you fancy a jaunt downtown or maybe take a stroll to the Bellagio Conservatory (30 mins) if you are botanically inclined. Just enjoy the calm, tranquillity and light (and a drink or 5 from the regular cocktail service- recommend a white Russian!) Encore truly is so relaxing, you feel energised and chilled at the same time. Nothing is too much trouble. I guess everything is relative and it is easy to take for granted the subtle touches that make it such a special place.", "title": "I want to live here", "user": "niall1000", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 114900934}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Loved everything about the Wynn. Decore, service was fantastic. Not in the busiest part of the strip but that suited us fine as we love to walk around the strip. highly reccommended.", "title": "Amazing Hotel", "helpfulness": 1, "user": "SMF1980", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114895548}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "My boyfriend and I stayed at the Encore in June 2011. My bf had stayed there on a previous visit and raved about this hotel - upon arrival I could absolutely understand where he weas coming from. From walking in to the lobby you are greated with the plush surroundings. Check in was straight forward and pleasant - some people commented it took a long time which I could see at 12 noon/1pm but at other times it was fine.", "title": "Absolutely best hotel on the strip! Gorgeous!", "helpfulness": 1, "user": "sian421", "date": "June 29, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 114887996}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The room (King Suite) was fantastic . The most amazing bed and a lovely big bathroom. we were on the 11th floor facing the strip. I have to say that the noise was not as bad as people make out. Ok, on weekends you can hear some bass noise from the club but its not massively loud or disturbing.", "title": "Everything & More..Service..Clubs..Restaurants... wrapped with an exquisite bow!", "user": "ylbrazeau", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114884276}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The hotel was extremely good. This was my second visit to WYNN, i got a promotional email from Wynn. I got reduced price for three nights. In addition they charge $ 20/night which included free internet. They also gave $ 50 room credit which we used for Lunch.", "title": "SUPER", "helpfulness": 2, "user": "loki_knows", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114826144}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Very neat, clean, large rooms.", "title": "Superb", "helpfulness": 3, "user": "sammowhammo", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114812653}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "One negative, there was no refrigerator for the guests' use, considering we were staying for three days with kids and aged who need to keep milk and madicines for personal use.", "title": "A lounger is 300.00 per day!!!", "helpfulness": 3, "user": "love_to_travel32825", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 2.0, "service": 2.0}, "id": 114807889}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This was my first time at Encore - we normally stay at the Wynn Tower Suites. But they sent me an invite so I did a solo trip", "title": "Fantastic Service. Fantastic Hotel.", "helpfulness": 1, "user": "McAuley2007", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 114787485}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I arrived very early & was happily surprised to get checked in without any fuss. The staff is gracious without being patronizing, helpful without being imposing, and friendly without being familiar.", "title": "Five Star all the way!!", "user": "PinkBonBon", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114773402}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I have just stayed at the Encore in Las Vegas for my birthday. We got there on Sunday June 19 and departed on Thursday 23.", "title": "It´s Ok", "user": "jimena_mv", "date": "June 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 114884224}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "In general the hotel and it’s service its ok, in fact I think we could consider staying there in the future. Never the less there are many things they can improve. Here´s our point of view.", "title": "Hospitality - I don't think so!", "helpfulness": 3, "user": "Fish7765", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 1.0, "service": 2.0}, "id": 114876646}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The line at the front desk to be able to check in is tooooo long, the same for the day we checked out. It takes you about an hour to get to the front desk.", "title": "Amazing hotel although very expensive", "helpfulness": 1, "user": "ssmith1988", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 114875787}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Our first disappointment the room, we had booked for a panoramic suite with view to the strip, well we had a panoramic view but certainly we didn´t had a view to the strip. Our room had a view to Vegas down town. But we were so tired form the flight and the one hour line to check in that we decided not to call the front desk, just in case we had to wait one more hour to finally get our room. (That if they changed our room). The decoration of the room is very beautiful, the bed is heavenly confortable, and the bathroom is perfect. The only downsides of the room were the view, the light inside the closet was out and the scale in the bathroom didn´t worked.", "title": "Great hotel meeting accomadations leave a lot to be desired", "user": "jloBethelPark", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114874346}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The casino is really quiet. And honestly I liked it to be that way during day hours, but at night. I like casinos to be a little more loud with a little more of life. On my birthday we were playing at a blackjack table up to 3 am and by the time we were done of playing black jack we were the last one´s playing in the casino. (Maybe it is because the drink ladies don’t come too often to your table.)", "title": "Great but no personal attention", "helpfulness": 1, "user": "SpaniardinIowa", "date": "June 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 2.0}, "id": 114836560}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 5, "variance": {"poor": 145, "average": 260, "very good": 818, "terrible": 138, "excellent": 2945}, "aka": "Encore At Wynn Las Vegas Hotel Las Vegas", "slim_ranking": 0.0481481481481, "description": "Encore, the new signature resort in the Wynn collection, is now taking reservations. Encore complements Wynn Las Vegas’ repertoire of accommodations, culinary offerings and leisure activities to include 11 new retail outlets, seven new cozy bars and lounges, five new signature restaurants, one ultra-chic nightclub and a European-inspired spa and salon facility. Indulge in Encore’s casually elegant approach to ambiance. Conceived as a collection of neighborhoods, the resort is designed to fill your stay with moments of discovery and evoke your sense of wonder."}