{"user_rating": 5.0, "review_count": 150, "name": "Entre Hotes", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Behind a plain grey door in a most unassuming city street there lies a real gem, namely Entre Hotes.We stayed here for two nights. Patrick welcomed us and showed us to our first floor room (which can also be reached via a lift) overlooking a beautiful rear garden. The room was of a good size with a high ceiling and two tall elegant windows. Whilst furniture was of the period, modern decor, bedcovers and paintings blended in well and gave the room a very chic appearance. The en-suite was very modern with a blue LED-lit wet room having the best power shower / wet room encountered during our holidays.", "title": "A gem behind a grey door", "helpfulness": 2, "user": "H0ppy", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118565944}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Breakfasts were great, with a wonderful choice of fresh food available. Patricia offered us eggs on the first morning and prepared two delicious omlettes - quite unexpected, as were the giant coffee cups which we initially took to be cereal bowls !", "title": "Very pleasant place to stay!", "user": "ScandiCouple", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 118263407}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The city centre is only some 10 minutes walk away (which can be via the park running parallel to the street) and a visit to the three towers gives a good introduction to the history of La Rochelle (although it also involves climbing many stairs, some very steep). A must is a visit to the aquarium, only10 years old. This is one of the largest in Europe with over 70 displays including some enormous tanks, all very realistically designed with thousands of fish on display and enjoyed in very spacious surroundings (and with all information repeated in English). The tour ends with a descent through a hot, tropical jungle with turtles sharing the boardwalks.", "title": "Wonderful b & b", "user": "Julie M", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118144846}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Good restaurants, away from the tourist traps, are only 5 minutes away - we twice visited \"Au Fil des Laisons\" in rue St-Jean-du-Perot and enjoyed good food at reasonable prices.", "title": "Lovely room", "helpfulness": 1, "user": "littleluxuries", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 115965436}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Patrick and Patricia were good hosts and we can thoroughly recommend their establishment.", "title": "Five star luxury! Tres tres chic!", "user": "Edendaleglos", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115879174}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The Entre Hotes is a very nice B&B situated a short walk away from the harbor and all the fun, restaurants, etc.", "title": "Very nice house, full of details.", "user": "ARUANO", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 138783489}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The building is a very nice old house that has been recovered very nicely. Don,t look for the nice facade in the place photos, as that is the back of the house from the - beautiful - back garden. You can feel the attention to detail in every corner of the house and rooms. The owners are very kind and ready to give you advice. The breakfast was very nice and served in a nice terrace (weather permitting), the croissants (at least in my visit) were the only thing not on pair.", "title": "Very Stylish", "user": "rufusTetbury", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138632649}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The only reason for not awarding the place with an excellent is that the wi-fi performed poorly in the rooms upstairs. I am sure the owners have tried to fix that (they even have set up two different networks) but with no success, what makes the surfing very frustrating.", "title": "Excellent", "user": "CMK05", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133491088}, {"rating": 5.0, "title": "La Rochelle,s best", "text": "Anyhow, I recommend the place.", "helpfulness": 1, "user": "Rod L", "date": "July 2, 2012", "id": 133299900}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Had two nights at this beautifully restored house. From the outside it looked somewhat of a mystery but once inside Patricia and Patrick have done an amazing job of transforming the back of the house into a place of calm and tranquility. It is very stylishly decorated in keeping with the age of the property. Everything is of the best quality from the furnishings to the breakfast. A very nice experience indeed.", "title": "Best choice ever", "user": "griffo69", "date": "July 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133260140}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "With a lift for your luggage (that can take people too) a warm welcome from the hosts, Patrick and Patricia, a room that was just delightful, airy and as described on the website, and a good breakfast (with attention to details such as freshly squeezed orange juice), we will definitely stay here again if in La Rochelle.", "title": "A delightful place to stay", "helpfulness": 1, "user": "Dublintown2012", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132116856}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Coming from Ireland, we appreciate good B&Bs and this is definitely one that won't disappoint.", "title": "Great location and stylish decor with lovely breakfast", "user": "FranceMesange", "date": "May 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129703900}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Very close proximity to the harbour (less than 10 minutes) and a lovely garden to relax in when the weather is fine.", "title": "Fantastic hospitality", "user": "Mary-Anne H", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128509883}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We spent three nights as a couple in 'La Digue' room in this Chambre d'Hotes. We picked it because it was number one on TripAdvisor and the location seemed ideal.", "title": "Very nice modern B&B in old building.", "user": "Pippa13", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119234020}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "This is a very stylish and charming place to stay and is really well positioned for sight-seeing and eating out in La Rochelle... just a few minutes stroll to the best restaurants and bars. In my opinion it is particularly suitable for couples because the room we were in was not large enough to have an active child in as well - with a baby it would be fine though. And there is no communal area....you have your room, which is on the second floor and is accessed by two flights of stairs, and then the breakfast area on the ground floor. There is a lift but it is only accessible when the hosts are around. There is a lovely garden as well which you can probably get use of but we didn't need to because we were out all day every day.", "title": "Perfect", "helpfulness": 2, "user": "oriordng", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118787603}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Making our on line booking we knew we were coming somewhere special - and how special it was! Patricia and Patrick have created a fabulous home with rooms. They have styled the rooms elegantly and with every extra you need. The breakfast was the best we had in France and served elegantly and with flair. The garden was beautiful, so well kept with white flowers and greenery. An oasis. Who would think this apartment was behind the front door? We would certainly recommend a visit to La Rochelle, and nothing could be better than staying at the stylish Entre Hotes.", "title": "Chic, calm and every detail perfect", "user": "LinLancaster", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115260212}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The hosts were very nice at this B&B. They have a beautiful garden and a dog and cat that made us miss our own pet. The room was very comfortable and breakfast was delicious!", "title": "modern convenience in an old building", "user": "lauraneidich", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110764062}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Stayed for 3 nights in February. A very nice B&B, lovely room, friendly owners and a great breakfast. We found the hot water a little intermittent and the wireless dropped out in our room.. The location was good though, a short walk from the old port.", "title": "Very nice b&B", "user": "mikeynom", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 101031392}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Very late on reviewing this so my apologies.", "title": "Amazing!", "helpfulness": 1, "user": "bristol1986", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97629362}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "This B&B is the most amazing place to stay. It is decorated beautifully, modern yet classic, stylish and sophisticated. The rooms are lovely, large and well presented. The breakfasts are wonderful, with fresh baked items daily; we had pancakes, pastries, cakes, all sorts and all hand made by the owner Patricia. I ate some much! Because it was so good!", "title": "Stylish and welcoming", "user": "Roderick41", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93722363}], "location": {"country": "France", "region": "Poitou-Charentes", "continent": "Europe"}, "variance": {"poor": 0, "average": 4, "very good": 25, "terrible": 1, "excellent": 120}, "slim_ranking": 0.0666666666667, "description": "Beguiled by the charm of La Rochelle, its archway-lined streets, its gargoyles and rich historic past, Patrick and Patricia Lebrin have chosen an 18th century home in the heart of town close by the old harbour to open a Bed & Breakfast which offers 4 roomsoverlooking a lovely garden to ensure your calm, comfort and relaxation.Breakfast is served on the ground floor in a cheerful open kitchen area or on the outdoor terrace, weather permitting."}