{"user_rating": 4.5, "review_count": 257, "name": "Erakor Island Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Excellent break! All the staff were friendly and helpful, both before (email contact to make sure everything was ready) and during the stay. Our room was spotless and made up daily. All paths and areas on the island are well maintained and well lit at night. Awesome snorkeling right off our back steps. Restaurant was reasonably priced and very clean we ate there most nights. Great Melanesian night on Thursday. Activities or something to do most nights. Absolutely loved every minute of the stay, can't wait to go back again!", "title": "Incredible Holiday", "helpfulness": 5, "user": "Sarah M", "date": "January 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123083905}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Was looking for a low key place to just hang out and found the perfect spot at Erakor. I think some of the other negative reviewers just don't get it. This island is a wonderful spot in the scenic lagoon, the natural gardens are spotlessly maintained with local guys sweeping paths and trimming edges daily. The sandy beaches near the restaurant are terrific and the other swimming spots at the other end of the island are quiet and unspoilt (take reef shoes). We stayed for 11 nights and had really good food (and yeah we do eat out a lot) in a great room with fantastic friendly staff who actually are allowed to chat with you. Waiting a while for your meal in these surrounds? Priceless. Every staff member we met (reception, bars, beach, guides, spa) was engaging and really helpful. We had a villa at the far end of the island which was secluded and nicely furnished. No TV, no air con - just fans, the sea breeze and the sound of waves and a view out past the reef to the ocean (great sunsets). So I recommend this for those tired of identikit resorts where people lay around pools in manufactured grounds and could be anywhere, and just want to relax and enjoy Vanuatu for what it is.", "title": "Island Paradise", "helpfulness": 12, "user": "GEM48", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122994019}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My family stayed over the Xmas/New year break and thoroughly enjoyed ourselves. We didn't want 5-star accommodation as we wanted to 'get back to basics' as an escape from our very 'materialised' world. Thus, the rooms we stayed in (2 and 4) were as expected - clean and spacious. My only gripe is all but one shower (out of 12 nights) were cold. The food at the resort was pricey for what you get but we took advantage of the cheaper family hour (5-6pm). We did prefer to dine at Chill and Harbour View (Chinese).", "title": "Haven for Relaxation", "helpfulness": 6, "user": "Helen B", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122855231}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The resort staff went out of their way to fix any grievances - for instance, we were situated in a room next to a very loud and noisy family (screaming/loud little kids from very early in the morning and the dad shouted rather than spoke normally) - the manager moved us to ensure we were able to relax and enjoy ourselves. Big thanks to Nathalie, Abi and Lita! Also, active attempts were being made to fix our hot water issue but this was compounded by it being the holiday season.", "title": "A Great Short Break from Sydney", "helpfulness": 5, "user": "SydneyFlash", "date": "January 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 122797396}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My husband and I, with our two sons aged 9 and 13, had the time of our lives, making use of the vast activities made available. We snorkeled the beautiful lagoon almost daily, zorbing (going down a hill in a large inflatable ball with water inside) and best of all, a scuba dive (we used Big Blue for the scuba and after seeing my 9 year old's swimming and snorkel-diving capabilities, allowed him to scuba to 5m with us (he was actually underage by two years)). We also highly recommend a visit to Cascades waterfall, the Blue Lagoon and Turtle Bay (thanks Darrin and family for that tip!). A must for everyone is to visit a local village or two - a big eye opener and awakening for those getting too complacent in this materialistic modern world.", "title": "This resort has great amenities but the rooms are a bit tired", "helpfulness": 3, "user": "rfead1", "date": "January 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122685019}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "I stayed at Erakor January 2012 with four of my girlfriends. From the moment we arrived, via a ferry which takes 10mins across the crystal blue waters of Erakor Lagoon we were welcomed by the happiest most accommodating staff...and a lovely cocktail!", "title": "You will want to go back!", "helpfulness": 5, "user": "Jaderose82", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124185921}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were informed about the resort and its facilities and shown to our Villa. It turned out Erakor are currently renovating (as it is the low season) so we were upgraded to a fantastic larger villa in the centre of the island, far enough away from the other villas that we could make noise without disturbing our fellow guests.", "title": "Fantastic resort in fantastic location", "helpfulness": 2, "user": "Pulkitron", "date": "February 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124131142}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The villa had 2 rooms which sleep 5 people plus a loft area which slept 2, a large living area with tv & dvd player (which was switched off at the wall for our stay) & a large bathroom.", "title": "Best family holiday", "helpfulness": 4, "user": "Andrew L", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123880154}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The lagoon that surround the island has some amazing reef which has lots of fish and perfect for snorkling.", "title": "Heaven on earth", "helpfulness": 5, "user": "Emu24", "date": "January 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123149614}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The restaurant overlooks the lagoon and is a nice place to enjoy a cocktail, feed the fish and watch the sun go down. The food is good, but probably a bit over priced for what it is, although the warm beef salad & cob loaf are delicious (AUD$ prices)", "title": "Time of my life", "helpfulness": 5, "user": "AussieGirlEV", "date": "January 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123084637}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I was really impressed when I arrived and expected a relaxing break but a lot of small issues added up to an average experience.", "title": "Not and isolated island", "helpfulness": 3, "user": "MBarr", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 126067859}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "We stayed in an overwater bungalow facing the main island which is tired and old. The shower barely works and the fittings within the room are basic.", "title": "Tired but idyllic", "helpfulness": 2, "user": "Lyn N", "date": "March 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 125816814}, {"rating": 5.0, "title": "My favourite place to stay on earth!", "text": "Unfortunately there was a function on the beach that night and we were kept up by the noise until the early hours. The activity on the island is loud and being so close travels across the water for an early wake up call.", "helpfulness": 4, "user": "MarionBurkimsher", "date": "March 7, 2012", "id": 125738971}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Woke up for a relaxing day on the beach but they were shortly overrun by the day trippers. There are two beach areas, surely one could be set aside for guests and one for visitors. The noise and activity makes what should be a relaxing day on the beach, impossible.", "title": "Older style property will no amenities", "helpfulness": 5, "user": "cjury", "date": "March 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 125624421}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The food and drink is reasonable and good quality, staff are excellent and they try hard.", "title": "Just what I needed . . . heavenly haven", "helpfulness": 6, "user": "brenda_beattie", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124514534}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Stayed for one of the 7 day packages over new year. Don't get me wrong, I have been coming to Vanautu for 30 years and really love the place. However this resort is in desperate need of either a qualilty downgrade or a major refurbishment.", "title": "Amazing location very average resort", "helpfulness": 9, "user": "ArnoldSydney", "date": "January 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 122613136}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The rooms are located on the foreshores and have a beautiful vista, with the aid of reef shoes one can swim and snorkel from your room. However, the rooms are just very tired, and nothing works. The shower screen in our room opened inwards, hello, how are you supposed to get in the shower? Water supply and pressure is intermittant so pick your shower times. It also leaks out, and leaves rather large puddles in the area next to the shower. Ipod docking station broken, ceiling fans noisy, kettle cord doesn't reach the plug.", "title": "A Little Piece of Heaven", "helpfulness": 4, "user": "sunshinecoast112", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122569010}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Rooms need a safe. They recommend that you dont leave any valuables in the room, but it is a fair walk to the reception. Hence we locked up the French opening doors onto the balcony every time we left the room. This is not so easy as you have to move all the furniture including the day bed and the dining table to get the doors by.", "title": "Fantastic, would love to go back", "helpfulness": 2, "user": "Looey72", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122559891}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The restaurant is overpriced and the food quality is sub standard, the waits are long. We ended up going to other resorts for our meals. On the last night, we ordered pizza which took 1.5 hours. My partner then became violently ill at around midnight. I then had to make my way to town for medication for her in the morning as we were flying out on that day. She is still not 100 %", "title": "Excellent location and amenities", "helpfulness": 1, "user": "255100PaulaI", "date": "January 5, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 122555187}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The day spa is hilarious, I don't think the staff take it too seriously, as I saw them sleeping on the massage benches as I walked past. The benches smell mouldy. We had 2 complimentary massages is our package, but didn't bother going for the second one after experiencing the first one.", "title": "Nice island but average food & average service", "helpfulness": 3, "user": "Duchies", "date": "January 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 122476300}], "location": {"country": "Vanuatu", "continent": "South Pacific", "city": "Port Vila"}, "stars": 3.5, "variance": {"poor": 6, "average": 15, "very good": 73, "terrible": 2, "excellent": 161}, "aka": "Erakor Island Hotel Port Vila", "slim_ranking": 0.265306122449, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Erakor Island Resort is a beautiful unspoiled island paradise, situated in crystal clear waters on its own private 16 acre island surrounded by white sandy beaches. All bungalows are waterfront with the lagoon just steps away from your private veranda. Enjoy the beauty of staying on a quiet tropical island with easy access to everything off the island, Erakor offers all the facilities of a major resort, but in a relaxed and secluded atmosphere."}