{"user_rating": 4.5, "review_count": 1460, "name": "Erboy Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Stayed 5 nights at the Erboy and would definitely recommend. The best things are the price and location. Our room was 1211, quite small but clean and functional. The bathroom was very small, and if you are 6ft tall or bigger you will struggle to fit in the shower. 2 free internet computers in lobby. staff friendly and helpful. Breakfast is ok, mostly Turkish cuisine though, if you are after a fry up you will be disappointed. Istanbul is a great city, 4-5 days is enough to see everything without rushing too much.", "title": "Good Value, great location.", "user": "bellmeister", "date": "January 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 52905060}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "This is the place to stay to be within walking distance of all the major historical sites in Istanbul. It is also surrounded by excellent restaurants and one of the best is right in the hotel. It is a quick walk to the bazaars and train station. The tram is also very close by and you can walk to the port and catch the ferry. The rooms are clean, quiet and about standard size for Europe. The neighborhood is safe and the staff are extremely helpful with all details and excursion planning. One of our bags came late and the hotel picked it up from the airport and delivered it to our room. What a great surprise. The hotel is linked to 5 others and we were given a discount card that we could use at the related restaurants. We found this hotel on trip advisor and were not disappointed. Have fun in this beautiful and modern city!", "title": "Location, Location, Location", "user": "tripplanner4Chicago", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52886087}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at Erboy hotel twice in 2009 (september and december), and we will be back in 2010. The hotel is well situated on a quiet street, near to the historical centre. The staff were very efficient, friendly and helpful. The room was clean and comfortable.", "title": "Excellent value for money", "user": "Deodatienne", "date": "December 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52231196}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "This is my third visit to this interesting city in two years. During my last visit I stayed in one of the new breed of \"boutique\" hotels; forget it. I TRULY suggest you be a guest of Erboy. The breakfasts are of the best quality and there is plenty of it too, not rubbish food either! Do visit as soon as you can before the city prices rise further (it's still good value there now) because of the 2010 status \"city of culture\".", "title": "FANTASTIC - Nothing too much trouble; will be returning again for sure!", "user": "phoenixhull", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52201302}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My friend had booked us a double room for neglecting to state we were just 2 female \"friends\", so a double bed had been allocated. As soon as the receptionist saw us he asked if we would prefer to swop it for a twin without us even having to ask. The en-suites are very good, showers that actually work and hairdryers too. Comfy beds and clean pillows even.", "title": "good internet site with deals;great location,healthy food;good value!", "helpfulness": 1, "user": "Badbones", "date": "December 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 51076642}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "The Erboy is located in the old city near all the major attractions. I booked the Erboy from the reviews online before a cruise to Barcelona. Upon arrival at the we were met by their driver. Since were an early arrival the rooms were not ready. The hotel guest manager Ayse Sancak sat us down in the comfortable lobby and served us Elma Cay (apple tea), provided us with maps of the area and gave good instructions on how to get to the Grand Bazaar. When we returned our rooms were ready. The rooms are small but comfortable. The hotel serves a very good breakfast. The restaurant is outstanding and we ate most of our meals there during our 4 day stay. One night in the bar we met the manager Yavuz Okumus who suggested we take the Bosphorus Ferry to the Black Sea. There is a 3 hour stay before we returned to Istanbul and we ate a delightful lunch in the village.", "title": "Great Location", "user": "RGRhodes", "date": "December 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51014132}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The staff of the Erboy were well informed and always available to help with suggestions and directions. There were 7 of us in my party before a cruise to Barcelona.", "title": "Absolutely great experience!", "user": "Betta-Milano", "date": "December 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50960814}, {"rating": 4.0, "title": "Lovely place, near to all attractions", "text": "When I return to Istanbul (hopefully soon) I will stay at the Erboy", "user": "AnnarellaTurin", "date": "November 29, 2009", "id": 50281212}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "RichardGRhodes@gmail.com", "title": "Excellent, above all the staff.", "user": "muschio", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 49746542}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "[--]", "title": "Welcoming and attentive staff, good location", "user": "Panteleon", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49700470}, {"rating": 4.0, "title": "Great Value for Money", "text": "Hotel Erboy is really a wonderful place to stay in Istanbul. I will definately stay there again when I go back! The Erboy Hotel is phenomenal in terms of location, service, food and cleanliness. The location, in the heart of Sultanhamet, and a very short walk from the Gulhane tram station, Right in the middle of everything. Rooms are basic. Breakfast was Perfect - One of the Best Breakfast;s - in all my trips", "user": "K_Mamich", "date": "November 20, 2009", "id": 49625271}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "This is a lovely friendly hotel close to all main attractions in Istanbul. The breakfast is brilliant and we did not eat again until evening. The hotel restaurant in the evening served really good food at great prices including the wine. Unfortunately on our last day my mother slipped and broke her arm. The hotel recommended which hospital we should visit and without being requested to organised a taxi to take us there. All in all a real find, who cares if the rooms are a little on the small side, they were always spotless and when in Istanbul one does not stay in ones room! Would definately recommend this lovely hotel. Congratulations to all the staff who run it.", "title": "A little gem", "user": "GloucestershireHejo", "date": "November 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48706571}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Reviews were good, but one never knows for sure. Location was excellent close to transportation, nice area. Convenience market across the street, good restaurants in hotel.", "title": "Pleasant Surprise", "helpfulness": 1, "user": "Gurumai", "date": "November 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48603190}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Walking distance from Topkapi Museum, Haya Sofia, Blue Mosque and the Grand Bazaar.", "title": "Great hotel in heart of historic Istanbul", "user": "sydneybee", "date": "October 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 48189960}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Roof top restaurants have a fantastic view of Topkapi,Haya sofia lighted are night also the bridge that unites European Istanbul and Asian Istanbul. Only drawback was air conditioner in room did not work well and we have a couple of hot days. But definitely recommend and go back to Erboy Hotel.", "title": "Happy. Recommended.", "helpfulness": 1, "user": "Mrs-Karlina", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47991923}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed at Erboy for 7 nights from October 10th to the 17th of 2009. We used the hotel shuttle services from and to the airport and it was really good and no hassle. The room and bathroom are small but very comfy and clean. I was surprised it was so quiet even though our room was facing the street. The breakfast in the morning was great and had many choices. The hotel restaurant is very very good and they offered guests a 30% discount for lunch... good deal! The hotel is in a very very good location... close to all the sites. We enjoyed walking to everywhere and only took the tram once. I would definitively recommend this hotel... the hotel staff is very nice and helpful. What a great city!!!!", "title": "Great location!", "user": "patricia_tran", "date": "October 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 47778789}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed for 2 nights in mid October. When we arrived our room was not quite ready so whilst waiting we were served with apple tea. The room was small but the bed very comfortable and the room neat and clean. The location was excellent for getting by foot or tram to the Blue Mosque, Hagia Sophia, Topkapi Palace, The Grand Bazaar etc.. We made use of the internet facilities in the foyer and enjoyed the breakfast - plenty for all tastes and would highly recommend this hotel.", "title": "Excellent value and location", "user": "Romy60", "date": "October 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 47751285}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed 4 nights at Erboy and it delivered everything we expect from a good hotel: excellent location, walking distance from main Istambul touristic points, good breakfast, large room (except for the shower cabin, that could be larger), really good restaurant, great terrace and terrific service. Ayse, our hostess at the hotel, gave us maps and explained everything about the city, with great tips that helped us to enjoy this great city. They also helped us with reservations for restaurants. I really recommend Erboy, it´s a great cost/benefit choice.", "title": "Excellent service", "user": "alalas", "date": "October 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 47660866}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed at the Erboy last week for 4 nights after checking out reviews on TA.", "title": "excellent choice", "user": "krakenish", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47562892}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The hotel was even better than expected, with a good sized room overlooking the street, bedding changed frequently & fresh towels everyday, but I wouldn't fancy a room facing the yard! a bit dark & no view at all.", "title": "Reccomended", "user": "Ovisan", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46821477}], "location": {"country": "Turkey", "continent": "Europe"}, "stars": 3, "variance": {"poor": 18, "average": 81, "very good": 561, "terrible": 3, "excellent": 797}, "slim_ranking": 0.0674418604651, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}