{"user_rating": 3.0, "review_count": 563, "name": "Erskine Bridge Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Fantastic Views from the room. We was celebrating our 23rd Anniversary and could not have asked for better. The staff were very friendly and helpful, especially as we was out for a long time one day and could not get back for our evening meal at the time booked. They fitted us in at the end. We would go back there again", "title": "Fantastic Views", "helpfulness": 5, "user": "shortbread64", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5429453}, {"rating": 4.0, "title": "Handy Airport Hotel", "text": "We stayed at the Erskine Bridge hotel as they had a good hotel / parking deal for the airport with dinner thrown in at the hotel restaurant. We were looking for a relaxing start to our holiday and on that side of things it was excellent. The girl on reception was very friendly and the hotel itself was easy enough to find.", "user": "busastep", "date": "May 16, 2007", "id": 7630281}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel is ugly - there isn't much the staff or company can do with that. the rooms are perfectly adquate for a 1 night stay. We had a nice view from the room which looked over the river and into Glasgow. The room could have done with an Iron / Ironing board but for our stay it wasn't really needed.", "title": "An Ok hotel at an excellent price", "user": "PrincessGem", "date": "April 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 7430102, "likes": {"liked": "— Meal included in room price", "disliked": "— food wasn't great"}}, {"rating": 4.0, "title": "What is wrong with American visitors?", "text": "The hotel does have free internet access, whilst we didn't use it, it seemed like a good idea.", "helpfulness": 2, "user": "Tugski", "date": "February 26, 2007", "id": 6840307}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "I was little let down by the very 'un-scottishness' of the hotel. There are 2 ways to do Scottish - tatseful and qulaity Scottish products and tacky tartan - this was neither. There were only 4 / 6 whiskies on the bar - no real selection of Scottish beers and the produce on the menu seemed like standard Bake Bros frozen food. The waitress we had was very helpful and worked hard to see we had everything we wanted. The bar staff weren't so helpful and had had no training about Whiskies etc.. so if you are a tourist from abroad looking for a more Scottish experience I would give this a wide berth. Given the proximity to the airport I would imagine having traditional scottish produce / drinks on the menu would enable them to sell more and make more money but obviously i was wrong.", "title": "Nice Anniversary Weekend", "helpfulness": 1, "user": "whimbrelboy", "date": "February 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0}, "id": 6807173}, {"rating": 2.0, "title": "Wake up Glasgow Tourist Board", "text": "The swimming pool area was great - hot tub esp good! There is a steam room and sauna also - don't look at the pics of the area as they don't do it justice. Make sure you make the most of these facilities!", "user": "Frizzle406", "date": "January 18, 2007", "id": 6615398}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "booked and paid on internet. on arrival was told i hadn't paid. got my invoice out and proved i had paid. they appologised. nice view of erskine bridge, ok meal, reasonably priced. checked out. was told i hadn't paid yet. explained that it was their mistake and it was sorted out yesterday. was told that the computer said i owed and would have to pay. said i had invoice and receipt in luggage. told to get them out so he could see. went to get them and as i approached reception again another guy shouted it was their mistake. no appology from rude guy. left car at hotel for two weeks. on return phoned for pick up, and was told 15 mins. 65 mins later phoned back and was told 5 mins, 10 minutes later they arrived. rooms ok prices ok food ok SOME of staff and transport hopeless. GREAT VIEW", "title": "great view", "user": "roosmith", "date": "December 29, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 6515747, "likes": {"liked": "— The View", "disliked": "— transport"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Stayed here for one night on their \"stay and fly\" package, it worked out pretty cheap as car parking for 4 nights was included. Its a really old circa 1970's concrete building which is in really poor repair, even the sign is missing some letters. Inside the rooms have probably got their original 1970's decor, cheap bashed around mismatched laminate furniture, wallpaper falling off and weird brown splatter marks on ceiling/lampshade. We had dinner as part of the deal and the food was horrible, fish had 16 bones in it and when we tried to tell the waitress she turned and walked away. It is convenient for the airport and there is a free shuttle bus BUT its not the cheeriest start to your holiday. Still if you stay here it will make almost anywhere else look good.", "title": "Tatty old and yeuchy Communist style hotel", "user": "SusansBackInScotland", "date": "November 11, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 6106057, "likes": {"liked": "— Proximity to airport, free parking", "disliked": "— The room and the food all horrible"}}, {"rating": 5.0, "title": "Fears Unfounded", "text": "It was with some trepidation that my wife and I entered our room at the Erkine Bridge earlier this month. Most of the reviews I read were along the lines of \"Abandon Hope...\" so we were prepared for the worst. Instead we got the best. A clean, comfortable room; a nice view; pleasant staff and a lovely meal made this pre-flight overnight stay a pleasure. The price (through Thomsons) was £70 for the room, three-course meal, 8 days parking and a free courtesy bus to the airport - excellent value.", "helpfulness": 5, "user": "maroonman", "date": "August 14, 2006", "id": 5610651}, {"rating": 1.0, "title": "Bad taste of Scotland", "text": "We stayed at this hotel for 3 nights when our tour operator changed our hotel a few days before we left home. We were forwarned by other reviews on the site and our experience was no different. Very basic rooms, a tired worn out bedspread, uncomfortable bed and to cap it all a day when room service just didn't happen and our room remained just as we left it .", "helpfulness": 2, "user": "travel-wisel", "date": "August 8, 2006", "id": 5577764}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "The food was bland and uninspiring and on one occasion really bad. The choice of dishes was poor. Scotland has amazing food but this hotel is definately not the place to sample it.", "title": "Hotel in middle of nowhere seeks pressure wash!", "helpfulness": 6, "user": "Weydonian", "date": "July 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 5480620}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 105, "average": 118, "very good": 148, "terrible": 111, "excellent": 81}, "aka": "Erskine Bridge", "slim_ranking": 1.0}