{"user_rating": 3.0, "review_count": 107, "name": "Eryl Mor Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Last year we went to a charity night for Ty Gobaith and won a meal for two in the auction. We finally used our voucher for lunch, on a very cold and snowy day. We sat in the Conservatory over looking the Pier and Menai Straits, watching the bizarre weather front coming in.", "title": "Lunch on a winters day in spring!", "user": "Rebecca R", "date": "March 31, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 156127987}, {"rating": 5.0, "title": "Restaurant", "text": "My partner had garlic prawns to start, which he enjoyed and I had soup, it did say homemade on the menu, but I felt it may not have been. We both had lasagne, which was without doubt homemade, and the portions were huge! my partner had chips to accompany his and I had a side salad, which was very well presented with potato salad and olives.", "user": "Patricia W", "date": "March 17, 2013", "id": 154865799}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We were not disappointed and would certainly recommend Eryl Mor for a satisfying lunch.", "title": "A lovely place", "user": "Deb F", "date": "March 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153694438}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Sunday lunch on a wet cold Sunday. We came across the hotel unexpectedly when it seemed as if we would not be eating! This gem proved otherwise.", "title": "Comfortable and friendly", "user": "sara h", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153673675}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The staff were absolutely fabulous!", "title": "Friendly Staff, Great Location", "user": "Kathryn H", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153547246}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We stayed at the Eryl Mor Hotel in Bangor for one night whilst visiting a family member who is at the university in Bangor.", "title": "A comfortable night", "user": "Breaking-Dawn22", "date": "February 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152193137}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Check in was straight forward, keys were handed to us and we were pointed in the right direction. This hotel is in 2 buildings .. we stayed in the building next door, It was a very nice looking hotel with great views across the sea. Unfortunately the room we was given was a family room on the ground floor at the back ... room 17, this room was adequate for an evening stay. It was clean and comfortable, a little dated and could do with a facelift .. new carpets, doors etc ... ceilings and bathroom in 'our room' could do with a lick of paint as mould/damp was showing, and the bathroom tiling could do with a regrout!! The TV was a tv/dvd ... which is what was stated on the hotel room description, as we were travelling with 2 children ages 8 and 9 they wanted to take a couple of dvds for the evening, however due to the placing of the tv .. dvds could not be put into the machine ...it was a side loader and there was a permanant shelf right next to the wall mounted tv .. hence not able to load a dvd, children were disappointed, but by the time we got back to the room at 9.30pm it was a bit late anyway!! We did not have an evening meal at the hotel, however, due to prior arrangements, the menu looked very good, and prices are what you would expect to pay. Breakfast was very nice and plentiful .. the children opted for cereal, yoghurt and melon, my husband and I had a full breakfast .. very nice indeed. My overall opinion is .. it is a nice hotel, in a nice part of Bangor, walking distance to the town centre, I would definately recommend this Hotel .. and we will more than likely stay again ... however would request a seaview room if available.", "title": "lovely location", "user": "JegeT", "date": "February 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151752158}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "This is a good hotel with friendly staff (though the waitress at breakfast was a bit stern). My room was large and clean; although it was in the annex - the house next door - it looked over the pier and the menai straits. Steps up to the front door of the annex and steps to the hotel itself could be a problem for some. Good beer! Some interesting pubs nearby.", "title": "Very Friendly Staff", "user": "Sohpar", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150705701}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "My Daughter and I stayed for 6 days in Janaury 2013. All staff were extremely friendly and were always willing to help with information and treated us more like friends than guests. The Room was very comfortable, clean and warm considering it was the middle of winter. Meals were reasonably priced and quality was good. We had rooms above us and occassionally you could hear people walking around, but nothing significant. Great views if you have a room overlooking Menai Strait. Walking distance to town centre was about 15 minutes. Would definitely stay again if we returned to Bangor and have no hesitation in recommending it to friends.", "title": "Overpriced For What It Is", "user": "KJBBucks", "date": "November 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 145850267}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Stayed here November ,2012", "title": "Great little budget hotel", "user": "debholmes23", "date": "November 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145478994}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "There is only one positive comment that I can make. The staff were very pleasant except for one surly young woman who served breakfast. She actually made me feel a nuisance. The hotel looks and is shabby. the first view of it reminded me of Norman bates house in 'Psycho'. The bedroom that I had was tiny and shabby. The bathroom was small but looked new. The only part of the hotel that did! I have a problem walking and there are absolutely no disabled facilities whatsoever! Firstly the car park', which is on the road, is at the bottom of a long flight of steps and you have to lug your luggage up them. The reception and bar areas are extremely shabby and unwelcoming. I had to climb up five flights of narrow, steep, stairs to my room which was in the first building. if you are unlucky enough to be in the building further up the hill then you have more external flights of steps to climb up and then even more narrow stairs inside. The breakfast was OK except for the surly young woman and I only paid £40 for B & B. My colleague and I took one look at the empty restaurant and went into Bangor to look for somewhere better but that was not easy! Although we eventually found a pub called the Boatyard which was acceptable with pleasant staff.", "title": "Avoid this hotel", "user": "DavidBLancs", "date": "July 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 166135119}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Booked into Eryl Mor Hotel for 2 nights but only stayed for 1, it was awful. The whole place needs refurbishing it doesn't look like it's been touched for forty years, it really is horrible, miserable and dirty looking.The bedroom we stayed in wasn't a double I'd say it was a single with a double bed in it, there was absolutely no room to pass each other and the bathroom had a nasty odour coming from it. When we went to the so called restaurant for breakfast, the waitress was wiping the table opposite us with a cloth so filthy you wouldn't wash the floor with it, and the bits went straight on to the floor, she then set the table up again placing clean cutlery onto the plastic tablecover she'd wiped with the dirty cloth.We ordered our breakfast although the episode with the cloth left me not wanting to eat it, and when it arrived I definitely didn't want to eat it - it was all deep fried (apart from the beans) even the bacon, just too greasy.Having said that,there are cereals, yogurt, fruit juice etc. if you want it. All in all it wasn't what we expected for the price we paid, it;s hotel prices for what should be rated as a 1 star bed and breakfast.", "title": "Don't stay here", "helpfulness": 1, "user": "joyce c", "date": "June 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 165696655}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "My second stay and again pleased with my stay and service. I paid 40 for one night and this inc breakfast which was just as nice as the last! I asked for a double room and i got a triple! Bar prices are reasonable and the view was beautiful!", "title": "Clean, more than i asked for!", "user": "Stephanie W", "date": "May 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160972381}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "i stayed here the night before an exam! i asked for a single room- i got a double, i got sea views, i got ensuite and i got comfortable! staff were friendly and room was clean. tastefully decorated. i had already eaten so i didnt sample the restaurant!", "title": "excellent for uni stays", "user": "Stephanie W", "date": "April 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159290985}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "i paid £35 and its right around the corner from uni! plenty of local ale houses including its own bar and restaurant! great!! wish i could of found this place sooner!", "title": "Good food", "helpfulness": 1, "user": "eliz4", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 157051724}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This hotel is a great place to stay if you want a nice view looking over the meanai pier. Lovely view in the morning and close proximity to go for an evening stroll.", "title": "Nice views!", "user": "kathy s", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 144838088}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "But there were a few downsides... the rooms (we got a single and double) were very cold. Even at night time where i wouldve thought the heating would be on. It felt very damp staying there and not very comfortable.", "title": "Great value and friendly staff", "user": "Michael M", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 144624460}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I complained the next morning and was provided with a small heater but this did not help.", "title": "Not awful but could be so much better....................", "helpfulness": 1, "user": "realbluesman", "date": "November 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 144469629}, {"rating": 1.0, "title": "Don't touch with a bargepole!", "text": "Unfortunately, our 2 nights stay was ruined by lack of sleep. The walls between each room mustve been thin because i could hear the people chatting next door which also contributed to poor sleep.", "helpfulness": 4, "user": "Colin W", "date": "November 2, 2012", "id": 144330810}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "On the other hand, breakfast was fab! good choice and service...which almost made up for the sleepless nights.", "title": "B&B not a hotel", "user": "jarry2214", "date": "October 3, 2012", "detail_rating": {"cleanliness": 1.0, "location": 4.0, "rooms": 2.0}, "id": 141928663}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 16, "average": 22, "very good": 27, "terrible": 24, "excellent": 18}, "aka": "Eryl Mor Bangor", "slim_ranking": 0.5}