{"user_rating": 4.5, "review_count": 312, "name": "Esencia", "reviews": [{"rating": 5.0, "title": "Esencia - a great place to relax", "text": "I would echo many of the positive reviews posted here. My wife and I just returned from a seven night stay at the Esencia.", "helpfulness": 17, "user": "peterm1", "date": "March 13, 2007", "id": 7154817}, {"rating": 5.0, "title": "a wonderful hotel", "text": "When you arrive (after an hour car trip from Cancun airport), you are greeted at a traditional Mayan hut, and then taken by bicycle cart down a long winding path to the hotel (the path reminded me of Survivor at night with all of the lit torches lining the way).", "helpfulness": 21, "user": "EmmaNate", "date": "February 22, 2007", "id": 6829348}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "We were greeted by Monica and Nicholas (who are both extremely friendly), and Nicholas gave us a short tour of the property.", "title": "A Very Special Experience", "helpfulness": 13, "user": "CSAL", "date": "February 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6814441}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "THE ROOM:", "title": "Esencia...simply incredible", "helpfulness": 14, "user": "McDBeantown", "date": "February 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6805893, "likes": {"liked": "— Service, grounds, cleanliness, just about everything", "disliked": "— had to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stayed in a garden room suite on the bottom floor. While we did not have a view, I didn't mind looking out into the jungle, since the property was maintained meticulously. We had a plunge pool (and outdoor shower), which was quite warm and I enjoyed sitting in it at the end of a day. I won't repeat the description of the rooms in detail that other people have posted, since I think they all have similar amenities, which are modern and luxurious. The bed was very comfortable and large, and it was great being able to plug our Ipod in and have music playing in the bedroom and bathroom. I also liked the refrigerator with free water, soda and beer all week. We watched a few movies on our large TV, and they have a selection of DVDs in the main office (no rental charge). They also have a small selection of used books and magazines in the main house in one of the side rooms, and I would suggest that they let guests know about this and perhaps suggest that people may wish to leave books they are finished with (we left ours). It would be nice if they subscribed to some magazines that people could borrow (just about all of the magazines I saw were foreign fashion magazines).", "title": "A Great Place to Relax", "helpfulness": 10, "user": "BeachbumsVirginia", "date": "February 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6766076, "likes": {"liked": "— The cleanliness of the room", "disliked": "— The fact that there is no bar or club."}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Room: We booked an ocean front room (Arbor) in the main house. Upon checking in, I looked out the doors, across the lawn, through some bushes, over the pool, through another set of bushes, and was able to glimpse the ocean - looking to the right of the outdoor massage station directly in front of our room. This to me, is not ocean view - the most important aspect of booking our room. In addition, the view from the bay window (along the side) looked out upon bushes and a chain-link fence that was attempting to cover the vacant lot next door.The rest of our room was large with a simple elegance. Bathroom was fine, nothing fancy, but the amenities were poor. Our room included a flat screen t.v. but we never turned it on and an IPOD stereo set up. Our patio was very spacious with a chase, built-in sofa, table and chairs, and hammock. Coffee was provided every morning on our patio without disturbing us.", "title": "Beautiful beach!", "helpfulness": 12, "user": "OregonSungirl", "date": "February 3, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 6733916, "likes": {"liked": "— Beach", "disliked": "— Management staff and the room we were given."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I stayed at the hotel during the second week of May for three evenings. I cannot say enough about how amazing Esencia was. We enjoy staying at several different properties during our vacations and this was the first of three and by far, the best.", "title": "Absolutely amazing", "helpfulness": 4, "user": "freqtrav88", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7841518, "likes": {"liked": "— privacy", "disliked": "— bugs"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "We enjoy staying at small hotels versus large properties. I've stayed at several other of the small luxury hotel properties (I forget the web address) and would compare it to the other favorite - Hotel Hana in Maui. From the moment you arrive, the service is terrific. We were escorted to our room (one of the garden suites outside of the main house) and given a tour of the property. Our room was minimal but perfect - all decor white, extremely comfortable bed, beautiful bathtub - large enough for two (plus an outdoor cool tub and outdoor shower), flat panel tv, great ammenities like Molton Brown products and bug spray (thank you!). To be honest, my only complaint is that the shower (in its own room) has slats on the bottom allowing for a bit of a buggy problem. I have to say that I am terrified of bugs - a bit of a wimp admittedly, most people will not care at all. Definitely use the bug spray provided and if you afraid of bugs at the bottom of the shower - just wear the flip-flops so nicely provided.", "title": "Improved and room for improvement", "helpfulness": 4, "user": "cest243", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7756704}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We were lucky enough to visit during off-season and felt like we had the entire property to ourselves practically. Although I think even when it is booked to capacity, it will not feel like it. The sense of privacy is amazing. The pools were absolutely stunning.", "title": "Pure Paradise", "helpfulness": 9, "user": "lynnie0429", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7260942, "likes": {"liked": "— the room, the view, the beach, the staff", "disliked": "— we had to go home"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The restuarant is decent - standard hotel food. We walked up the beach to a few of the surrounding properties. There is an excellent little cafe (believe the owner may have been German if I recall correctly) and it was good food, great atmosphere, a nice change from hotel food. The service was excellent in the Esencia restaurant just thought the food could use a little flavor. **You should note that breakfast is included with your rate. We were under the impression that it was just the coffee left at your door - no, be sure to go and get breakfast - it is included. They should be more clear on this. We figured it out too late.****", "title": "A memorable experience!", "helpfulness": 10, "user": "Jrankin", "date": "March 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7187514}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I really cannot say enough about what a wonderful, charming property this is. It is well worth every penny. Definitely visit if you would like a very relaxed, low-key vacation in a beautiful and private atmosphere.", "title": "Very nice, unique Hotel - 4 and a half stars", "helpfulness": 17, "user": "SFTravelMavens", "date": "March 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7156463, "likes": {"liked": "— The setting", "disliked": "— Not much of a scene"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 9, "average": 13, "very good": 42, "terrible": 7, "excellent": 241}, "aka": "Esencia Hotel", "slim_ranking": 0.158163265306, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Esencia is a 50-acre private estate, with an awe-inspiring beachfront, two swimming pools, day spa, gourmet restaurant, and an indulgent atmosphere fitting of royalty. In fact, the property and many of the buildings once served as the exclusive beach-side retreat of an actual Italian duchess. Though friendly, warm and generous, the duchess demands the very best and Esencia still benefits from her superior taste, her impeccable style and her zest for life."}