{"user_rating": 3.5, "review_count": 122, "name": "Espana Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "This hotel is not located in the slums. It is in a residential area and is very safe. Security cameras and locked gates guard this hotel. The concierge was good and the rooms were pretty nice. IT looks like they had been recently revamped.", "title": "It was a very nice hotel thats wasn't located in the slums", "user": "thefreddys", "date": "March 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 14460951, "likes": {"liked": "— Rooms were clean and helpful front desk staff", "disliked": "— The bathroom door didn't lock"}}, {"rating": 4.0, "title": "It was great for the money", "text": "We stayed for 2 nights in January and overall it was great. We paid £22 per night each including breakfast which was a real bargain. The hotel is ideally situated in a quite (but slightly rough looking) side street about 15 mins from The Coloseum and 10 mins to the nearest Metro Station. The hotel is safe and secure but the staff didn't speak english, but hey thats our problem. The hotel thoroughout is pleasantly decorated, clean and tidy and quite compact. The rooms are small but comfortable, modern and clean. What more do you want for that money and really only somewhere to sleep. There is a safe which is free to use. I would stay again for its location.The breakfast is basic but suffecient.", "user": "ianwestsussexUK", "date": "February 14, 2008", "id": 13550852}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "whatever you do... dont book this place! This place is located in the slums of Rome. It says 3 stars... but i rate it NO STARS!!! The hotel staffs are non existent. Asked for a cup of hot water.. the answer is \"no!\" The maids barely cleaned our rooms. We had teas, coffees, sodas and soups left on the tables and expected it to be tossed out by the end of the day. Lo and behold.. its still there for the next 3 days!!!!! This 3 stars hotel has no elevators therefore you have to carry your luggages up 2-3-4 flights of stairs! Not fun at all!! Even though this place is 15 minutes away from the Colloseum... i still wont recommend it. I rather walk further and stay somewhere else.", "title": "Horrible Place!!!!", "user": "missxxtammy", "date": "January 30, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 13126534, "likes": {"liked": "— Nothing"}}, {"rating": 1.0, "title": "Horrible Horrible", "text": "This was far lower than a 3star experience. The hotel employees were unconcerned about the fact we had never been to Rome before and had no ideas on directing us. The best thing about the hotel was the sign was easy to see from a distance. The stairs were unforgiving after a full day of sight seeing. There was construction on the block during the week we were there. The Balcony was non-existent. The Breakfast was not adequate and they had the nerve to say you must eat down in the basement. My major Excitement was knowing the end was near!", "user": "TravelGuyNewark", "date": "January 24, 2008", "id": 12954215}, {"rating": 1.0, "title": "Do not reserve with them!", "text": "ABSOLUTELY the worst hotel. It was rated a 3-star hotel and that was definitely a LIE.. it's more like 1/2 a star or none. The management does not know anything. When our phone line was not working, and told the mgmt, all she said was \"I don't know\". One time our safe was deactivated for some reason, and was told to call mgmt, again all she said was \"I don't know\" and hung up on us. The location of the hotel was horrible, very quiet street in scar neighborhood. The receptionist will never greet you when you walk by. Not to mention that our last night stay, they never changed our sheets but just re-made it!!! DO NOT RESERVE WITH THEM. HORRIBLE HOTEL, TERRIBLE SERVICE, BAD LOCATION!!", "helpfulness": 2, "user": "kimberlyymark", "date": "January 23, 2008", "id": 12929134}, {"rating": 4.0, "title": "Take your pick", "text": "Clean and pleasant room . Hotel located in a quiet back street which gave a surprisingly quiet location for a city centre base. Simple buffet breakfast. Conveniently located for the railway station and underground, but , given the metro closed at 9pm, it was a long walk or taxi ride of an evening to a pleasant eating area.", "helpfulness": 3, "user": "BettyandLes", "date": "August 21, 2006", "id": 5649496}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "I do completely agree with the last opinion. I am surprised to read bad things about this hotel. I've come back today from Rome and I enjoyed my time there. I found it clean, it's true that the rooms are small, but I don't need more, the supermarket is close, you have the underground (although the nearest stop, Manzoni, is closed till the end of the year), buses, trams and so on, there is no need to catch taxis if you don't want to spend much money.", "title": "I liked it", "helpfulness": 4, "user": "soniavcf", "date": "July 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5479900}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Regarding safety, I was at 4 am in the street this morning because I had to go early to the airport and I didn't feel me unsafe.", "title": "Our favourite hotel in Italy", "helpfulness": 3, "user": "Devonmom", "date": "July 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5469094}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "I recommend this hotel and I woudn't mind coming back in the future!", "title": "Dont Understand the complaints!!!", "helpfulness": 3, "user": "Poopsandboo", "date": "July 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 5467958}, {"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "I took my teenage daughter to Italy for a two week holiday and stayed at the Espana for five days. We both loved it. We never saw any criminal activity in the area and only saw beggars in the main tourist area.", "title": "Talk about out of town! Avoid this hotel with all your might", "helpfulness": 1, "user": "Catmar192", "date": "July 10, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5448556}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "OK, the hotel is in a good neighborhood, in the ancient district, 20 to 30 minutes from the Coloseum. It has some good security measures, really felt safe while there. And it was clean.", "title": "If you like walking up stairs, this is the place!", "user": "tammyandjerry", "date": "September 23, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 8863405, "likes": {"liked": "— leaving", "disliked": "— the stairs"}}, {"rating": 4.0, "title": "Lovely little hotel, good for Collesseum", "text": "However, that is the sum total of the good things I can say about it.", "helpfulness": 3, "user": "WakefieldMonkey", "date": "July 25, 2007", "id": 8231709}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The service was non-existent. If you needed something done, oh well. We had problems with our toilet the entire time we were there. They never fixed it. The air conditioner, which we would leave on in the morning when we left so as to have the room cool on our return, would, without fail, be turned off. The room itself was barely big enough to turn around in. The bed was within inches of the walls on both sides. There was only one chair in the room, the only place it would fit was under the desk or slightly pulled out, but no one could walk behind it whle someome was sitting in it.", "title": "Good place to stay", "helpfulness": 3, "user": "Georgi_dk", "date": "June 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8029457, "likes": {"liked": "— Location, pricing, cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The \"terrace\", which was a door leading out onto the roof, was just that. a door to the roof. No place to sit, no table, no chairs, no nothing,, except someones AC unit or whatever that piece of equipment was. And a railing to prevent you from falling off. Lord knows they wouldn't want a bad reputation.", "title": "Perfect!", "helpfulness": 3, "user": "Marlies84", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7276683, "likes": {"liked": "— the atmosphere of the hotel", "disliked": "— the location"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Another fun thing about this place, the reception area is in a completely different building from where our room was, so we had to walk outside to turn the key back in every time we went somewhere and came back, or when we wanted to go for coffee nad breakfast. OK, I'll give the fact that I'm american, and somewhat spoiled, but their breakfast was lousy. To be fair, it wasn't just their's, but Europe's breakfast, in general, that was somewhat lacking. But I truly think they could have done better than the instant coffee machine.", "title": "Ideal Hotel", "helpfulness": 2, "user": "AnnieDScotland", "date": "March 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7166238, "likes": {"liked": "— Very clean", "disliked": "— Unfriendly staff"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "This hotel was relatively cheap and we thought that the location was fairly good - of course you couldn't walk to every Rome attraction, but then who'd expect to be able to? After all, Rome is a huge city! But we enjoyed the short walk to the nearest hop on hop off bus stop and found that this was an excellent and economical way to view the sights.", "title": "Average hotel.", "helpfulness": 2, "user": "Sara18", "date": "February 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 6815296, "likes": {"liked": "— The location", "disliked": "— The attic room we were given!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The hotel was disappointing in that we were given a room at the very top of the building that was obviously a single room that they had squeezed twin beds into. To say it was tiny was a huge understatement! Also, I had asked for a room that could accommodate the fact that I have MS and sometimes have difficulty with stairs - however, we had to climb four flights and the hotel would not change our room as they were full.", "title": "A nice little surprise", "helpfulness": 1, "user": "Daniel_Damon", "date": "February 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6812319, "likes": {"liked": "— The clean rooms", "disliked": "— The staff"}}, {"rating": 4.0, "title": "Pleasant Surprise", "text": "The breakfast was adequate, the hotel was clean.", "helpfulness": 2, "user": "VicM", "date": "January 23, 2007", "id": 6647011}, {"rating": 5.0, "title": "Good place to stay in Rome", "text": "I just got back from a short three day vacation in Rome.The city was amazing and the hotel was a nice surprise. I invited my sister and mom to celebrate a book I've just released, but we had a tight budget, so we were lookin for something mid pricy. We payed 80 Euros per night for a triple, or actually it was a room with two double beds, but these were seperatable.", "helpfulness": 4, "user": "hypnotherapist", "date": "November 19, 2006", "id": 6152541}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The room (nr 15) was situated in a building next to the main hotel building and we even had a balcony. The room was really clean and the toilet was perfect. It was pretty quiet and we had no problem sleeping, although you could sometimes hear the neighbours watchin TV.", "title": "Short Family sight seeing break", "helpfulness": 7, "user": "Braiden", "date": "August 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5711883, "likes": {"liked": "— Cost", "disliked": "— Location"}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 2, "variance": {"poor": 15, "average": 35, "very good": 40, "terrible": 14, "excellent": 18}, "slim_ranking": 0.618333333333}