{"user_rating": 4.5, "review_count": 912, "name": "Esplanade Zagreb Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This hotel is a true gem, that has me left me flabergasted by its elegance, old world charm and attention to detail.", "title": "Regent Esplanade - Zagreb", "user": "KalordT", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119926441}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Try as they might other supposed leading hotels, could well learn a thing or three from the Regent Esplanade.", "title": "Perfect location, perfect rooms!", "user": "DanAndAssana", "date": "October 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119838894}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "If this is only a five star and if you have never been to the 7 star hotel in Dubai, then there is no need to bother - \"this is the absolute last word in 'European' style\".", "title": "A Room I Could Live In", "user": "DumbDog", "date": "October 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119727673}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The room we stayed in was large and the bed sumptuous enough to please minor and major 'royalty' alike.", "title": "Superb hotel", "user": "michael c", "date": "October 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119720162}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We typically do not like large urban hotels, but The Regent is just so beautiful: old-world on the outside and the common areas, and very modern rooms. We had a beautiful [upgraded] room with a super comfortable bed, high quality linens, fantastic amenities, super fluffy towels and free wifi (my biggest pet peeve is upscale hotels that nickel & dime you for wifi). The concierge was cordial, friendly and helpful: we only had one day in Zagreb and they did a great job planning it for us, from sightseeing to dinner. Two thumbs up!", "title": "Belle Epoque Splendor", "user": "Londonkraut", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119680092}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My husband and I along with our 2 adult children stayed here for 2 nights when we landed in Zagreb. We booked in advance based on the tripadvisor recommendations. We are so pleased we did. The hotel is quite luxurious with classical and stylish fittings. The rooms are spacious and the beds very comfortable. We had a great stay and found the staff very helpful and English was no problem. The girl that works in the health spa is brilliant. We highly recommend the deep tissue massage- the best ever. Hurts for a day but so worth it. We ate at their restaurant on the last night and it was one of our most enjoyable experiences in Croatia. We want to return to Croatia just to stay at Regent in Zagreb. Zagreb is a great city.", "title": "I know why its ranked 1!", "helpfulness": 1, "user": "starbord_traveller", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119013338}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I booked the Regent Esplanade for the last night of our vacation in Croatia and Slovenia. It was a fitting end to a fabulous 2 1/2 weeks. I had hoped the hotel would live up to the great reviews on Trip Advisor, and it surely did. We arrived in Zagreb early, in order to drop off our rental car at the agency which closed at noon. We arrived at the hotel nearly 4 hours before check-in time, but of course our room was available ... not only that but as it was my birthday we were upgraded to a Deluxe Room. The hotel is gorgeous and has a sense of history which makes it all the more special. We went sightseeing, and upon our return a waiter appeared at our room with a lovely dessert on a silver tray, complete with Happy Birthday written in chocolate! This is a hotel that goes all out to make their guests feel special. As we had a very early start the next morning we enjoyed dinner in the Bistro, rather than Zinfandel's, but the service was friendly and professional, and dinner was great. Our stay went much too quickly, but will be remembered fondly. Highly recommended!", "title": "Lives up to Expectations!", "helpfulness": 3, "user": "echoisland", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118802693}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Exactly what you'd expect out of a Regent hotel, a true 5-star hotel. Stylish, comfortable rooms, the hotel itself was gorgeous, and the staff was helpful and knowledgeable. Within short walking distance of the train station, tourist attractions, as well as lots of great restaurants and bars. Definitely worth the $$!", "title": "Esplendid!", "helpfulness": 2, "user": "smcain19", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118761376}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This year we started our summer holiday in Zagreb and to be honest we had no expectations at all, it was simply a convenient starting point. However, not only was Zagreb a great place to visit but the Regent Esplanade was simply stunning. You might think that a large 5 star luxury hotel with a gorgeous art deco interior might have been a little remote and unwelcoming but not at all, the staff were among the friendliest we've ever come across. We have to make a special mention of Radomir who went out of his way to help us make the most of our time in Zagreb and he really made our visit special. The hotel accommodation is luxurious offering superb comfort with spacious rooms and the service is perfect. The hotel location is ideal for the rail connections, botanic gardens and the city centre, all easily reached on foot. All in all - a great place to stay and we look forward to returning for a longer stay next time.", "title": "A Fabulous Hotel - Highly Recommended", "helpfulness": 2, "user": "worldecho", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118665238}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My wife and I stayed at the Regent to celebrate my wife’s 50th birthday. This is one of the best stays in Europe. The location of the hotel is excellent, as the area is full of restaurants and places to simply sit and enjoy a coffee. I look at value over cost - simply the hotel is exceptional value for the experience we encountered. We will return, guaranteed!", "title": "Luxury Plus", "helpfulness": 2, "user": "Explore88", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118600361}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed 4 nights in the Regent Esplanade Hotel in Zagreb. The facility is grand in its design and looks opulent. Many of the old furnishings and art work still exists today so if you prefer one of those modern, \"Zen-like\" hotels, this one is not quite the one for you. It \"feels\" old, though there are modern amenities and facilities.", "title": "Excellent Hotel in Zagreb", "user": "SingaporeGuy10", "date": "November 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120375972}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Reception and concierge staff were very helpful, friendly and always seem delighted to be of assistance. Clearly, they have a very good service culture in the hotel.", "title": "Worthy of its No. 1 ranking", "helpfulness": 3, "user": "rgejones", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120287478}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Breakfast was excellent. Perhaps one of the best I've had amongst the many hundreds of hotels I've stayed in.", "title": "Absolutely Wonderful", "user": "PapaOregon", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120239168}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The normal deluxe room itself is moderate sized, and some come with interconnecting doors so that families can stay together. The bed was firm and sheets were spotlessly clean. The bathroom was also very well maintained and spacious.", "title": "Great Hotel", "user": "wifsys", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120236114}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "The hotel restaurant is reputed to be one of the more \"avant garde\" and offers a \"progressive\" menu of interesting new creations. Some of them fusion cuisines. Do give it a try, but be prepared to spend a relatively large amount for a meal there.", "title": "A True Beauty", "user": "BackPacknGo", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120191900}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "location is not great but not the problem. The doormen are the only people that seem interested in you. Our 2nd night the music from a private party was BLARING until 4 + AM!!!! The next day they took half the cost off the room and it was a lousy deal. No mention was made by the hotel to expect this kind of disruption. WE were not the only clients checking out mad. Rooms were large and comfortable with free WIFI. But the staff indifference was the memory. Come on - no concierge on SAturday.???", "title": "In need of a GM", "helpfulness": 2, "user": "tennisTucsonAz", "date": "July 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 3.0}, "id": 133793660}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Regent Esplanade has to be the best hotel in Zagreb. The hotel is of the grand older style, but beautifully fitted out and maintained. We had a superior king room on a upper floor with small balconcies overlooking a park. The room was very large for a European hotel, with excellent fitout and furnishings. The hotel is close to the main railway station and only about a 10 minute walk to the Zagreb old town, so it is very conveniently located. Reception staff were especially friendly and helpful. Pricing was extremely reasonable, with the weekend nights priced well below the Monday-Friday nights. We didn't have any meals at the hotel, so can't comment on the food.", "title": "Top Hotel in Zagreb", "user": "AussieTraveller56", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133645080}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "the hotel looks nice, but avoid the restaurant. for 25 euros we got a small bowl of salad consists of wilted and soggy leafs and strange tasting sauce. one staff member was amazingly friendly and helpful (i think her name is melinda or melida). not impressed with the others. a staff wanted knocked on the door BEFORE we checked out and tried to use his key to enter our room. when i said we are not checked out yet (this is more than an hour BEFORE the check out time), he tried to push his way in because, in his words, \"i need to check the minibar\". you need to check the minibar BEFORE the guests leave the room, while one person is taking a shower inside the room? sorry, that is the opposite of classy service.", "title": "rude service... except one", "helpfulness": 3, "user": "paul l", "date": "July 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 133459089}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "It's a beautiful hotel especially if you are staying in Zagreb. It's on par w/any other 5 star hotel. It is elegant and has all the amenities you'd need. I was really impressed. Stayed here twice, once at the beginning of the trip and once at the end and the price was right! It doesn't include breakfast like all the other hotels seem to do in Croatia, but that is minor.", "title": "Amazing 5 star hotel for 3 star prices", "user": "Carpbythebeach", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133397542}, {"rating": 5.0, "title": "A very classy hotel", "text": "The Regent Esplanade lived up to all of our expectations. Close to the tram and train station made getting around easy . The free health club was well equipped , rooms very well appointed and the public areas gave a feeling of a quality hotel. It is one of those places that just does everything you would expect . We could not have asked for more.", "user": "GraemeH3", "date": "July 3, 2012", "id": 133365987}, {"rating": 4.0, "title": "Excellent choice - as long as your room isn't noisy", "text": "Stayed for 2 nights in June 2012.", "helpfulness": 1, "user": "nbologne", "date": "July 14, 2012", "id": 134378254}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Room: the first room we were given was on the 2nd floor and faced the trams and was unbearably noisy. We asked for a quiet room and were moved to the 5th floor facing the courtyard which was perfect. Overall the room is lovely although I'm not a fan of carpet floors and for a \"luxury\" hotel they should upgrade their TVs to flatscreens which has been standard even for modest hotels in Europe for quite some time. Bathroom/shower was great.", "title": "Great place to stay!", "user": "viperdog", "date": "July 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134282068}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Service: Excellent. They directed us to a currency exchange that we thought would be closed on a Sunday so we didn't have to pay the high hotel rates. They were very helpful with all our questions.", "title": "best of the best", "user": "cayman8", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134031478}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Location: Great. Walking distance to all points of interest. You can take the tram right to the hotel from the bus station. Otherwise it's about an easy 15-20 minute walk down a main street.", "title": "love Regent, love Croatia", "helpfulness": 1, "user": "SingaporeSteven", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133960318}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Other: Took a day trip to Plitvice and highly recommend. One of the highlights of all my travels. I had the bus schedule but for pretty much the same price you can book return transportation on a mini-bus with the tourist information office and not worry about trying to catch the return bus. Glad we did this option as opposed to staying in Plitvice. It was only a 2 hour bus ride one-way.", "title": "Excellent Hotel", "helpfulness": 2, "user": "shaman06", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133900817}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is one of the very few times I strongly disagree with the majority of tripadvisor reviews. This gorgeous hotel is in a wonderful location, and the rooms are beautiful, but my praise ends there. This hotel has a long history and a litany of famous guests- I assume that is why the service is so poor and the staff so indifferent to guests needs. From the moment my husband and I checked in, the staff was unpleasant and unhelpful. At one point, we asked the concierge to call a tour we were planning on attending. The concierge did so, and found that the number was disconnected. And that was that. There was no offer to help us find an alternate tour, no recommendations, no help of any kind. Also, unlike any other hotel I have encountered in Europe, Regent Esplande did not include breakfast in the price of the room. It was 20 euros per person, which is obscene even for a 5 star hotel. Perhaps I am not the right guest for this hotel- one of the famous amenities is the heated marble floors in the bathroom. While the bathroom was certainly beautiful, I think a heated floor is completely superflous, and adds nothing to the quality of my stay. I'll take friendly service and a warm atmosphere any day over such perks. To be fair- the price is very good for a 5 star hotel. (though parking was very expensive)", "title": "Overrated hotel, subpar service", "user": "chicagogirl22", "date": "October 23, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119645178}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I have kept returing to the RE and I'm happy to report that they have still not managed to disappoint me. It's still one of my favorite hotels.", "title": "Still wonderful", "helpfulness": 1, "user": "moncic", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119529710}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The only thing I would comment on is that they really need to invest in new TV sets, as it kind of ruins the otherwise premium quality of the rooms.", "title": "Best hotel in Zagreb by far ... full of history, nicely restored", "helpfulness": 1, "user": "Ivo_Dolezal", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119492414}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I was amazed by this hotel. I've tried few hotels in Zagreb before, but I have been surprised that for a similar price I can also get the splendid opulence of the Regent Esplanade. The hotel is very nice historical building located in the city center next to the main railway station. The rooms are very nice with hard wood furniture, comfortable beds, silent air conditioning and all marble bathroom.The breakfast selection is good with the key highlight being special items, which you can order for free - various types of omelets or pancakes. It should be noted that the hotel restaurant is one of the best restaurants in town, in not the best out of best. Still can't believe that I have paid less than 100 EUR per night with breakfast in this hotel.", "title": "Fabulous!", "helpfulness": 1, "user": "Temuskia", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119315287}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This hotel was special from the moment we first walked in. Each and every staff member made us feel welcome. Our room was spacious; the bed, with it's fluffy pillows, was one of the most comfortable ever; and the marble bathroom was large enough for two. The breakfast buffet was delicious....and eating it on the terrace was sublime. This hotel definitely deserves it's 5-star rating (and, by prepaying with an on-line booking company, we were able to stay here at 3-star prices).", "title": "A lot of style", "helpfulness": 1, "user": "Citrouille", "date": "October 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119065236}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This felt like a turn-of-the-century, step back in time kind of place with a decor and style that can't hardly be reproduced today. Our room was spacious and extremely comfortable. The staff were extremely friendly and the common areas outstanding. The location is also spectacular as you are only about a 10 min walk to the Old Town along wonderful, rambling parks.", "title": "Spectacular building & location", "user": "Jon P", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132882351}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "We stayed 3 nights, the room was large and very comfortable with a huge marble bathroom . Location is right near the rail station and tram stops and easy walking distance to the rest of the city.", "title": "Stylish & luxurious in a handy location", "user": "CNMCoffsHarbour", "date": "June 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132436955}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Evocative of the olden days when travelers on the orient express stayed here, this hotel is an art deco gem with all mod cons.", "title": "Superb 5 star hotel!", "user": "elninomagico", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132389047}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I stayed at this hotel for 3 nights in June 2012.", "title": "Deserves its five stars", "helpfulness": 1, "user": "mllenoy", "date": "June 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132306182}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I had read some fantastic reviews of the hotel and my expectations were in fact, exceeded.", "title": "Excellent choice", "user": "Calum_2007", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132273378}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "One of the best hotels ever. A real 5 star hotel. Hotel decoration, cleanliness, service, everything down to the smallest detail in this hotel is exceptional. And the stuff is one of the best I have ever seen in a hotel", "title": "one of the best hotels", "helpfulness": 1, "user": "emmanuela e", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133252496}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "we arrived late in the evening and the service and welcome by the staff was exceptional. They gave us a glass of wine while they took our detalis and a Zagreb Heart each as we went to the rooms. the rooms are spacious and the decor and furniture make you feel like royalty. i have been to croatia many times and this is the best hotel i have ever stayed in there. If you are ever in Zagreb stay here. From the reception area to the rooms and dining areas it is superb.", "title": "Sensational in Zagreb", "helpfulness": 2, "user": "maggic", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133218230}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "After spending 24 hours traveling by a series of delayed flights I thought I would just crash at the hotel; however, I was instantly refreshed after just entering the door. The decor and ambience makes an immediate good impression. Extremely friendly and professional staff was key to changing my mood; that invigorated me to try a late night meal before bed. I was very impressed with the recommendations of the restaurant staff and enjoyed the meal immensely. As others have mentioned, the rooms are great, especially the bathrooms with separate tub and shower. This is the only hotel I want to stay at in Zagreb!", "title": "They have earned the reputation", "helpfulness": 2, "user": "Shinjin7", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132971610}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "the hotel is one of the few truly grand hotels. I had an excellent week there, with super service and descretion. Very good food as well (breakfast, lunch and dinners) fantastic terrace and close to the centre - about 15min walk though. some rooms are small. the suties are great.", "title": "great grand hotel, good service and location", "helpfulness": 1, "user": "BEP1", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132947836}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Regent Esplanade fully deserves its five star rating at the head of the Tripadvisor list. A truly beautiful hotel - how much of this is due to the original design and how much to skilful and sensitive renovation isn't apparent - but that's why it succeeds. You'd think it had always been like that. Thoroughly professional staff, excellent food - it's all been said before but it's true. No sign of the ugly prostitutes mentioned by a previous reviewer but the quiet streets between the main town square were a little offputting after dark - but no more so than in any other capital city. Prices are reasonable for this standard - We'd suggest that you book online using the hotel's own website - there were deals for paying up front, etc. Good buffet breakfast, hot food to order. This is beginning to look like an advert but it's geniune - there really is not a single nit to be picked about this lovely hotel.", "title": "Zagreb's best!", "helpfulness": 1, "user": "Feckenhamsters", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132912004}], "location": {"country": "Croatia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 15, "average": 32, "very good": 168, "terrible": 4, "excellent": 693}, "aka": "Regent Esplanade, Zagreb Hotel Zagreb", "slim_ranking": 0.0363636363636, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Esplanade Zagreb Hotel features 208 spacious and lavishly furnished rooms and suites. Our Zagreb hotel rooms and suites feature luxurious and convenient amenities such as marble bathrooms, fluffy bathrobes and free super fast Internet access. Esplanade Zagreb accommodations provide the best of both luxury and convenience and are ideal for busy travelers and those seeking rest and relaxation."}