{"user_rating": 5.0, "review_count": 1110, "name": "Essence Hanoi Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Best service I have received at any hotel anywhere. For example I needed top up credits for my phone so the bell boy went with me to show me where to purchase same. The junior suite at $95 pn is a bargain with free breakfast, minibar and laundry. The hotel also arranged our cruise at Halong Bay very capably. Perfect location in the middle of the action but very quiet in our room. The rooms are not huge but very well appointed. I would not stay anywhere else in Hanoi. Highly recommended. PS I would normally not recommend eating at your hotel, but the restaurant here is really good for breakfast, lunch or dinner.", "title": "Simply the Best", "helpfulness": 2, "user": "Ozejim", "date": "April 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 156855841}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I think this is the newest in this small chain of hotels and there is not much else I can add to the other good reviews. We entrusted all our travel plans to them spending time in the hotel, then off to the Topas Eco Lodge and Sapa then a trip to Halong Bay. The arrangements were seamless, and whilst possibly a little more expensive than other tours (there are some real bargain basement offers around town), the quality we got for what we paid was amazing, leaving unwanted luggage safely at the hotel whilst we went off on trips, when we returned it was ready and waiting in our rooms. Accompanied to the train station for the overnight Sapa train (it can be quite confusing but the hotel guy took us to our compartment and then went off to get us cold beers) and met us when we returned. The location of the hotel is superb, in the Old Quarter and right next to bia hoi corner. The hotel happily got cheap, reliable taxi's whenever we needed them (you have to be very careful of taxi scams in Hanoi, stick to Mai Linh or Taxi Group, they are reliably metered and really cheap, most places just over a pound sterling). Breakfast was very good, great choice and they start early so you can eat before any early starts. The service is impeccable, going above and beyond any hotel we have stayed in. Sparkly clean with great modern bathroom. Can't recommend it enough.", "title": "Lives up to its reputation", "helpfulness": 2, "user": "gill35Uk", "date": "April 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156749993}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed in this hotel for 4 nights and found the staff exceptionally helpful and friendly. Due to a booking mix up our reservation was not confirmed. However the hotel manager went out of his way to sort the problem out and we stayed one night in the Elegance Diamond which was equally divine. This hotel is well located in the Old Quarter and a short walk to the Hoan Kiem Lake. Would recommend this hotel to our friends visiting Hanoi. Despite being in the centre of the Old Quarter, the hotel was very quiet inside. The breakfasts were amazing and easily satisfied my morning need for food!", "title": "Great Hotel", "helpfulness": 1, "user": "NewTravellers5962", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156741054}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Stayed for 2 nights and booked tours through the travel desk to halong bay and sapa. You will get the tours cheaper on the street but worth the extra few quid. They will literally spoon feed you and attention to detail was excellent. When arriving back from sapa they even gave us a free room for 6 hrs until our flight. Breakfast is amazing and the staff won't be bettered. Also try hanoikids for a tour of the old quarter and its free! They even refused a tip! Easy to see why essence os the #1 hotel.", "title": "Couldn't ask for better", "user": "LiamIreland100", "date": "April 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156690132}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I chose this hotel because of it's wonderful reviews on Trip Advisor and was not disappointed. Apart from the hotel booking, they also booked our 2 day, 1 night Halong Bay tour and organised a guide to take us on a walking tour of Hanoi. All correspondence by email prior to our arrival was answered promptly. We were met on arrival in Hanoi as pre arranged and driven to the hotel. On arrival at the hotel, we were treated as VIPs by the wonderful reception staff. The hotel stored and looked after our suitcases while we were on the Halong Bay tour and on our return they presented me with a birthday cake and the staff all sang Happy Birthday! Highly recommend this hotel to anyone coming to Hanoi! Apart from the exceptional staff, the rooms are clean and well appointed and the location of the hotel in the Old Quarter is very convenient. The only disappointing thing about our time in Hanoi was the weather - it was cold and wet!", "title": "Superb!", "user": "winelover045", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156684334}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The standard of the accommodation was excellent and the staff were very helpful.. Our delux room was perfect complete with laptop. The hotel is tucked away in the old quarter and Hoan Kiem Lake is just a five minute walk away. We stayed six nights but spent one night on a cruise in Halong Bay (see separate review). I would like to thank the reservation officer Ms Toan Phan who was tremendous help when booking the holiday, upgrading our rooms, booking the cruise and arranging for all transfers. Everything was arranged, quickly and with no fuss.The food at the hotel was of a very high standard but you must also eat outside sampling food from the street vendors and the wide range of restaurants. If you like beer then you should try the local fresh beer. Oh and there is a handy ATM just outside the hotel. Choose your cabs carefully as some charge much more than others. They give you a handy map at the hotel which tell you the cabs to use. There is much to see here and I would recommend the Water Puppet Theatre located at the top of the lake on the north east corner. What helped make the stay memorable was the friendly polite people of Hanoi. They would say hello as you walked past and even took photos with us.", "title": "Memorable holiday", "helpfulness": 2, "user": "Galfred", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161825695}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We are a mid 30s couple who are happy with accommodation as long as it is comfortable, but most importantly in a good location. This hotel is perfectly situated to explore the Old Quarter of Hanoi. It is only 5 minutes walk to the lake and is pretty much central to the rest of the Old Quarter's adventure and craziness. Whatsmore, it is only 10 metres away from Bia Hoi corner (International Corner to the locals) where you can grab a small plastic stool and a refreshing draught beer (or 4) for around 30 cents and watch the world go by. We were there most afternoons when the heat had beaten us and again after dinner for a nightcap before bed. Great fun and a great place to meet travellers and locals wanting to improve their English.", "title": "Both an oasis away from the craziness and a springboard to discover it.", "helpfulness": 1, "user": "mattblack", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161789509}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed in a Junior suite, which was a good size and included laptop with internet, wifi, free minibar, fruit and laundry and a bottle of Dalat red wine upon checkin. Our room was at the back of the Hotel and was very quiet. Big window but only view over rooftops (but fine because that's why it was quiet). Bed was comfortable and room was clean. Service was great throughout. Map provided was adequate and advice was given upon request. Breakfast was excellent, but can't comment on the restaurant for other meals as there were too many street food and other culinary delights to enjoy in Hanoi and we did not eat there.", "title": "Excellent service, location, and lovely rooms", "helpfulness": 1, "user": "KM8430", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161788791}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had already booked 2 nights in Halong Bay and 3 in Sapa and the hotel was happy to mind our bags. We also arranged airport pick-up and drop off and train station pick-up for a reasonable fee. All went smoothly. We were offered breakfast and a smaller room to shower after sapa train before our flight to Danang and took up the offer for $40. Well worth it after getting off the overnight train at 4:30am. The room was not as big as the Suite but still clean comfortable and had laptop. Only small window though.", "title": "Best Service", "helpfulness": 1, "user": "Craig S", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161709465}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "My wife and I loved this hotel and would stay here again due to the location, staff and comfortable room.", "title": "Unparalleled service", "helpfulness": 3, "user": "RoscoeHR", "date": "May 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161467305}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "I stay in Ha Noi with my friends sometimes.", "title": "So cute and nice hotel", "user": "Kaoru T", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156672751}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "But this hotel is the best in the hotel we stayed in the past because staff is so friendly and kindly.", "title": "Perfection", "helpfulness": 2, "user": "TravelFun249", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156657737}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Our room is Derax and extra bed but there is a moderate space and interior was wonderful.", "title": "Perfect little hotel with amazing staff", "helpfulness": 1, "user": "LondonDylan", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156575273}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "So, we could spent a great and perfect time. I would like to stay here the next time.", "title": "Great Hotel, Exceptional Service", "user": "Lilburt", "date": "April 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 156552297}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Thank you so much.", "title": "Lovely 1 night stay", "user": "Travelcat19", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156464730}, {"rating": 5.0, "title": "A Gem in the Heart of Old Hanoi", "text": "Everything here is first rate, from the warm welcome, beautiful rooms, excellent breakfast and friendly staff always making sure you're comfortable and your stay is memorable. A terrific location in the centre of the best part of a very interesting city.", "helpfulness": 1, "user": "tamblers", "date": "May 21, 2013", "id": 161453803}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had planned an overnight cruise on Halong Bay after checking out our last day intending to pick up our bags at the Essence the next day on our way to the airport. We learned at Halong Bay that the overnight cruise had been cancelled due to weather and we would be returning to Hanoi that night after a day cruise. The Essence was contacted, they were completely booked, but found us a room at another nice hotel and paid for the cab to take us there. Service above and beyond.", "title": "Excellent Hotel", "helpfulness": 1, "user": "Susan769", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161449569}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We just returned from 2 wonderful weeks in Vietnam and it all began with the Essence Hotel. This was our first trip to Asia so there were lots of unknowns and the Essence's staff helped put us at ease before we even arrived. The hotel processed our Visas and picked us up at the Hanoi Airport. It was a great relief to walk through customs and see a friendly face with a sign with our names on it. We arrived at the hotel and found more friendly faces and a perfect room. The hotel staff always made sure we were taken care of whether in the hotel or out of the hotel. A great example was when we took the night train to Sapa, the hotel had a staff member go with us in the taxi and walk us to the train car. The same person was there at 5:30 a.m. when we returned from SaPa. The restaurant at the Essence was excellent as was the restaurant at their other hotel, The Diamond. We arranged to have massages the first day we arrived and the service was so excellent we returned twice more during our stay. Our stay was so excellent that we were sad when we had to leave. This trip was focused on northern Vietnam and if all went well we would return in a couple of years and visit southern Vietnam and Thailand. It went so well that we will return as planned but will make a stop in Hanoi to stay at the Essence Hotel for a couple of days because we loved it so much! Thanks again to the wonderful staff at the Essence Hotel.", "title": "Highly recommend this hotel, everything excellent", "user": "5334david", "date": "May 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161447667}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "My wife and I stayed at the essence hotel for 3 days mid may. Hotel is faultless. The staff were extremely helpful and friendly. The restaurant was one of the highlights. Every meal we had was top class and very cheap.we didn't bother eating outside the hotel because the food quality was superb. I can see why the Essence is rated no 1 on trip advisor . Definately stay here.", "title": "Charming hotel, with very helpful staff in the best area of Hanoi!!", "helpfulness": 3, "user": "Veritaslife", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161375072}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "This was my favourite Hotel in Hanoi! I even prefer it to the Metropole Sofitel Legend in terms of helpful staff and location. Upon arrival I received a welcome card in the room and fresh fruit. The rooms are big, clean and wonderfully decorated. The beds are super comfortable. It is quiet in the rooms but the moment you step out you are right in the middle of the buzz of Hanoi. Right on the corner of the hotel is the bar to be (at least it was when I was there 3 months ago :) ) If I go back to Hanoi, this will be the hotel I will stay at!!", "title": "Stayed 2 nights, very happy!", "user": "Chatswoodestate", "date": "May 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161373198}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We have just spent 4 days here and I have nothing but good things to say about the Essence Hotel. The rooms are comfortable and well appointed, the location right in the centre of the old quarter, the breakfast spread delicious and the staff friendly and helpful. One of our party was sick for a couple of days and the staff bent over backwards to help us find a hospital and then sent up endless cups of ginger tea to the room! A lovely hotel with a friendly and caring Manager and Staff!", "title": "Deserves to Stay at No: 1!", "helpfulness": 1, "user": "sandyb_nl", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156451348}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This hotel is one of 5 that the essence group has around Hanoi. All are great. Essence is among their top end along with diamond. Both are really great - diamond having an amazing roof top terrace. Essence is very near the north end of the lake which has all the shopping and some good restos though also seems more touristy. If you stay at essence be sure to go to the fresh beer stalls located only half a block away. We have also stayed at ruby which is on the cheap end but in a very quaint little alley which makes it feel much more interesting and unique. My only critique is that essence is located in a very busy part of town. Don't stay here if you are trying to get away from everything - though you probably shouldn't go to Hanoi if that is your goal.", "title": "Great location can't beat the price", "helpfulness": 1, "user": "DanielNLaura", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 156362338}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We love Hanoi and stay here every time we go.", "title": "Stylish & Sophisticated", "user": "Adrian L", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156340076}, {"rating": 5.0, "title": "SERVICE", "text": "This excellent Boutique hotel sets the standards for all other hotels to achieve. Led by a manager proud of his establishment, the happy and smiling staff endeavour to ensure clients have all of their possible requirements met with the minimum of fuss. Rooms are modern and stylishly decorated, and as with the rest of the hotel facilities are maintained in a spotless condition. The intimate Cafe serves excellent cuisine in a manner that other places would envy, and the beer is always cold. Prices are most reasonable, necessitating reserving a table for dinner, or waiting a little longer. Tranfer arrangements from/to airport, to/from Sa Pa train are handled effortlessly, and tickets to Water Puppets arranged to suit. Nothing is a problem, and all done with a smile. What else would anyone want? A wonderful stay of 6 nights in a little oasis in a city that never sleeps.", "helpfulness": 2, "user": "Mork001", "date": "March 31, 2013", "id": 156185940}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This hotel is a gem of a hotel to stay at if you are ever in Hanoi!", "title": "Essence of boutique in the midst of the old quarter", "user": "MrPaul007", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156147171}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Essence Hotel in Hanoi provided some of the best and personal service we've encountered in all our travels. Not only was our room very comfortable and the breakfast wonderful, but the staff was extremely friendly, helpful and went out of their way to take good care of us. We arrived in Hanoi in the late afternoon, expecting to catch the night train to Sapa at 10:30pm. We immediately realized the train station was not a place we could hang out at, nor could we leave our luggage there. We went to The Essence, hoping we could stash our luggage for a few hours, since we would be staying there upon our return from Sapa. The hotel staff was more than accommodating, providing us with temporary room to shower and later a personal escort back to the train station to help us negotiate the craziness there.", "title": "Can't say enough....", "user": "TanyaTortilla", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161330913}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The restaurant was great too; I recommend the clay pot fish and the Bun Cha!", "title": "Exceptional", "user": "LM82", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161316262}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I don't think it's possible to say enough good things about this hotel! My mum and I stayed here for 2 nights before leaving for a night for a Halong Bay overnight cruise and then returned to Essence for 1 further night. We stayed in a deluxe twin which seemed like an absolute bargain at approx £50 per night.", "title": "Lovely hotel, good location, brilliant service", "user": "Kathryn A", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161156011}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The hotel is in a fantastic location right in the Old Quarter. It is a short walk from the lake and is the perfect base for exploring the bustling Old Quarter. Despite being on a very busy street, we heard no street noise in our room which made it a peaceful haven amongst the mayhem of Hanoi.", "title": "The best!", "user": "familygirlvictoria", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161142327}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Our room was a decent size, tastefully decorated and very clean. The power points were well placed and the only improvement would be to have another mirror. We heard little noise from other rooms. The air con worked well and the beds were comfortable.", "title": "A safe haven that should not be missed!", "user": "Kelvin T", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161123949}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I stayed in the Essence Hanoi with 8 other friends. We booked 5 rooms ranging from the standard single room to their largest Essence Suite.", "title": "A Charming Boutique Hotel in the heart of the old quarter", "user": "SingaporeGuy10", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 162270883}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Here are the pros:", "title": "It's ranked #1 for all the right reasons", "helpfulness": 2, "user": "Victoria B", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162264331}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "The hotel is located right in the heart of the old quarter and hence very convenient if you like to explore the older parts of Hanoi.", "title": "Sterling service genuine hospitality", "helpfulness": 3, "user": "Denise F", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 162109709}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The hotel management and front line staff are nothing short of excellent. Very helpful and responsive and ever so polite. They are always on hand to help with anything from restaurant recommendations and reservations to other logistics. The hotel staff can also arrange for day trips and tours (eg Halong Bay). I've stayed at many top notch hotels, and I must say that the reception / concierge staff are truly some of the best I've interacted with.", "title": "Efficient and Sufficient", "user": "Munster3", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 161977899}, {"rating": 5.0, "title": "Great Boutique Hotel", "text": "This is a boutique hotel, so don't expect a swimming pool or gym etc. However, what they lack in facilities and amenities, they make up in terms of the quality of the rooms. While they tend to be on the smaller side, each room is well furnished and with comfortable and clean beds. The standard of housekeeping is commendable. Some small attention to details tell me that the standards are high, given that the price you pay is very affordable for most travellers.", "helpfulness": 1, "user": "Morgans121", "date": "May 26, 2013", "id": 161844608}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Excellent location, helpful staff, yummy restaurant.", "title": "My new Hanoi hotel", "user": "claire s", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156104560}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "They organised our trip to Halong Bay which was fabulous, made recommendations.", "title": "Great Choice!", "helpfulness": 1, "user": "GA5888", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156035820}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I live in HCMC and have been to Hanoi a few times. In the past have stayed at Rising Dragon Palace and was quite happy with that - until now. Now Rising Dragon just doesn't compare.", "title": "Not a bad word to say about this hotel!", "user": "Nicola2608", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155895902}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I've found my new Hanoi Hotel.", "title": "Go ahead - add it to your list of 'must stays'", "helpfulness": 1, "user": "CynWorldTraveller", "date": "March 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155845980}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "What a great in spot in the center of the old quarter between the market and the lake. With the chaos of Hanoi streets it was reassuring to return to the tranquility and friendliness of our hotel. The staff made you feel welcome from the moment you arrive and look after you in a very caring manner. Breakfast at the hotel was fresh, beautifully presented and delicious. We booked a suite on level 7 and found it spotless and quiet.", "title": "Well deserved to be the Number 1 hotel in Hanoi", "helpfulness": 1, "user": "nusmik", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155724284}], "location": {"country": "Vietnam", "continent": "Asia"}, "variance": {"poor": 3, "average": 3, "very good": 81, "terrible": 0, "excellent": 1023}, "slim_ranking": 0.00411522633745, "description": "A member of Hanoi Elegance Group, Essence hotel ensures you an unrivaled luxury boutique experience just steps away from the Lake of the Restored Sword, nestled in the vibrancy, excitement and captivation of Hanoi’s most historic location – the Old Quarter. Rooms have open windows, very quiet yet in the center of Old Quarter. Inter-connecting room for families available. Private laptop in each room with free wifi internet, Essence Cafe opens daily."}