{"user_rating": 4.5, "review_count": 45, "name": "Estancia Rincon Chico", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The direct access to elephant seals are a must visit. Teresa, our nature guide, was extremely informative and allowed us to sneak up to the seals within 10 feet! There is also hiking and sand dune exploration on the massive property. The property is really in a remote setting so the running water is piped in from well water and the electricity is provided via wind power. In the evening there is a generator that provides more electricity to recharge camera batteries. GPS and cell phone reception do not work so if you are a city slicker do not consider booking here. However, if you love nature and want to get away from it all, this is the perfect place to recharge, experience amazing fauna, and catch up on some reading. Augustin and Maria, the owners really take care of you during the stay. One thing to note is that the property is NOT in Puerto Madryn; it is on the very southeast corner of Peninsula Valdez, which takes 2-4 hours from the airport depending on how fast you drive. I highly recommend renting a 4 wheel drive vehicle. Our compact car barely cut it on the gravel and clay roads, especially in the rain (check the treads, ours were almost bald). If you are here to see a live hunt of an Orca beaching itself to feast on a sea lion in Punta Norte, you should know that it is about a 1.5-2 hour drive each way. The closest town is Puerto Pyramides so depending on how much driving you do, you will need to refill on gas every other day. One final tip is that the Estancia that has the penguins charges $80/person (US dollars). You can see the same penguins in lesser numbers at a public area. Finally, contrary to some of the other reviews, the food is high quality homemade food. Everything from the breads to the entrees to the desserts are homemade and quite delicious.", "title": "Amazing wildlife resort in a remote setting", "helpfulness": 2, "user": "dnumgis02", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156092332}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The place is great and the owners were really fortunate to have the Pen Valdes elephant seals population to breed on their land. Oct 20’th we spent 1 night at the property , as part of our 3 weeks tour in Argentina & Chile (Patagonia mainly).", "title": "Disappointment", "helpfulness": 5, "user": "Iulia709", "date": "January 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149325212}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "After having a wonderful full day guided tour of the Peninsula , we arrived at the property (on Saturday), where the owner welcomed us. To our surprise, we found out that he is planning to take us to the beach the same evening , to see the elephant seals. We were quite surprised because we were promised by our agency that we will be having about 4 hours to spend on the beach during the following day (on Sunday), before leaving for the airport. We arrived at the beach at 7:00 pm and we were already worried about the light. It was freezing cold, since the sun was going rapidly down. The owner was putting his gloves on and we understood quite quickly why. We were having none with us, since we left the property in a rush.", "title": "Elephant Seals!", "helpfulness": 1, "user": "dailln4n4", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147067529}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We spent 1 hour there in semi-darkness but came back to the property being quite optimistic that the next day the owner will follow the initial schedule. He recommended us to visit the sand ‘dunes’ instead. Next day it was Sunday and probably he wanted to avoid to get up early for us. We were the only guests of the property during the time we spent there.", "title": "Amazing...can't stop thinking about that place!", "helpfulness": 2, "user": "YorkClan", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146837488}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We left for El Calafate with a sense of bitterness which hardly could be described. The elephant seals at Rincon Chico should have been one of the highlights of our trip. We missed it because of a guy who preferred to stay in his comfort zone. Even the property is great, we would not recommend it since you are depending too much on the mood of the owner to take you to the beach (13 km roundtrip). However, if you spend more nights there, the best thing is to just walk to the beach and eliminate this embarrassing dependency.", "title": "serene, remote, amazing", "helpfulness": 1, "user": "shulamit657", "date": "November 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146412339}], "location": {"country": "Argentina", "region": "Patagonia", "continent": "South America"}, "stars": 3, "variance": {"poor": 1, "average": 2, "very good": 7, "terrible": 1, "excellent": 34}, "aka": "Estancia Rincon Chico Hotel Puerto Madryn", "slim_ranking": 0.0952380952381}