{"user_rating": 4.5, "review_count": 143, "name": "Estancia La Portena de Areco", "reviews": [{"rating": 2.0, "title": "Lovely People-the place needs serious help", "text": "We just returned from our 2nd trip to Argentina. The Estancia La Portena has the most gracious staff, however it's ok for a day visit, NOT overnight. I appreciate the historical signifigance of this property, but it's really run down. The pool was dirty, the rooms musty, the tubs were dirty, the famous meat asada (BBQ) was just ok. All the furniture oudoors is broken or dirty. The horseback ride was barely scenic and lots of mosquitos. There is no place to get comfortable. The owners need to invest some money into the place. I was ready for rustic, not this run-down.", "helpfulness": 2, "user": "Jeanne5", "date": "February 22, 2010", "id": 56814032}, {"rating": 5.0, "title": "Go there to see historical Argentina", "text": "I visited the place in December 2009 with my girlfriend. We spent there only one night due to very intensive agenda in Argentina, but would like to return there for a relaxing atmosphere. The owners, a young couple, demonstrated extreme hospitality (including pretty Christmas gifts). This is a place to relax, eat plenty of meat, read some books on the history of Argentina in the authentic surroundings. Anti-mosquito repellent is a must, if you plan to spend a lot of time outside. Go there and see Argentina of XIX century.", "helpfulness": 1, "user": "alexey_dimitrov", "date": "February 6, 2010", "id": 55318220}, {"rating": 1.0, "title": "Give this place a wide birth, its only trading on history!", "text": "This place would never make it to my 1million places to see before I die.", "helpfulness": 6, "user": "oaklees", "date": "February 3, 2010", "id": 55074467}, {"rating": 4.0, "title": "So charming but beware of mosquitos", "text": "We (my wife and 19 & 22 yr old children) were booked in here between Christmas & new year '09. There had been servere flooding locally, so our agent called to see that they were still open. Obviously desperate for our booking they replied yes. They promised to meet us at the main road (4km dirt track to the Estancia totally under water) this did not materialise, then they said the police(? why?) would take us in then eventually turned up on horses.", "user": "wannabeafreespirit", "date": "January 2, 2010", "id": 52374335}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I am of two mind about Estancia La Portena. One the one hand, it is located on a beautiful property about an hour from Buenos Aires replete with picturesque old trees, skillful and talented gauchos, historical significance, friendly owners and terrific service staff. The experience for day trippers who come to witness life on an estancia, including horses, parilla, and gaucho games and music, is probably better than for overnight guests. Overnight guests experience the same offerings, but are subject to a property that has alot of deferred maintenance: lights that don't work, no heat in rooms, tired linens, bug invasions, and broken chairs, to name a few. On one day, the owners left for Buenos Aires while newcomers felt adrift when they arrived to find no one at the estancia who could speak English. The resident gaucho reprimanded a guest for building too big a fire in their room given the cold weather, when in fact an estancia worker had built the fire over the guest's objections. Unlike mosquitos and other aspects of life on a campo, these are not part of life in the country. The price is not low for all these negative aspects. I hope attention will be given to improving the current weaknesses so the newish owners can succeed at conducting both a tourist and agricultural business.", "title": "This could be very good with some work", "user": "vanholt", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 65434808}, {"rating": 4.0, "title": "Perfect get away from the city", "text": "My friend and I stayed there after 2 weeks of fairly intense trekking in Patagonia, and we couldn't have dreamed of a better place to land at. Easy to access from Buenos Aires, the estancia has everything you need to relax, from the swimming pool to horse riding. Fantastic welcome from the hosts and all the people here will make you feel just like at home, but prepare your stomach for a lot of delicious home-made food! You'll probably need a bit of a diet when your stay is over... The town nearby - Areco - is also full of charm and is worth paying a visit one afternoon. Would definitely come back if I come back to Argentina", "helpfulness": 1, "user": "PikLondon", "date": "May 9, 2010", "id": 63661776}, {"rating": 4.0, "title": "Lovely place!", "text": "I stayed for 2 nights at La Portena in October. As I was travelling on my own I was a bit apprehensive about spending 3 days in the countryside on my own, but the owners couldn't have been nicer or more welcoming and I was very well looked after. As all of your meals are eaten on big tables with the other guests, I was soon \"adopted\" and had a lovely time.", "helpfulness": 1, "user": "LondonJessR", "date": "April 21, 2010", "id": 62075543}, {"rating": 3.0, "title": "Great, yet not the best.", "text": "The location is just right for a short trip out of BA, and the owners arranged transport. The house is beautiful and steeped in history and very atmospheric, with nice gardens and lots of quiet sunny spots to sit and read a book. The afternoon asado and entertainment were great fun and delicious- my mouth is watering now just thinking about it!", "user": "Jubis", "date": "March 16, 2010", "id": 58753312}, {"rating": 5.0, "title": "Feeling at home...", "text": "The rooms are not luxurious but they are huge, and full of lovely old furniture and nik naks. You really do feel like you are sleeping in a bit of history, which more than makes up for the trickly shower! I had the room which has the old library above, very nice indeed. I really felt like I was staying in a private house, and my time at La Portena was one of the highlights of my trip.", "helpfulness": 1, "user": "fofisofi", "date": "March 6, 2010", "id": 57863845}], "location": {"country": "Argentina", "region": "Central Argentina", "continent": "South America"}, "variance": {"poor": 9, "average": 11, "very good": 24, "terrible": 4, "excellent": 95}, "slim_ranking": 0.333333333333, "description": "A beautiful 180-year old Argentinian “Estancia” (ranch) considered the oldest and most traditional in the area. The place where the famous writer Ricardo Güiraldes, author of the internationally-acclaimed novel “Don Segundo Sombra”, spent part of his life. The actual site where he found inspiration to write about the “gauchos” to whom he rendered tribute by making them popular. La Porteña was declared National Historic Monument for its unique Argentine Creole style with thick walls made of adobe. In 1969 the place was chosen for the making of the film version of “Don Segundo Sombra”. Chosen as ¨1,000 places to see before you die¨ by Patricia Schultz. About the Ranch: Located in the district of San Antonio de Areco, the Estancia is only 50 minutes away from Buenos Aires City. This unique typical Argentinean Estancia is considered one of the most beautiful and traditional in the country for its history, architecture and surrounding natural beauty. The main house was built in the 19th century and the park around it was designed by the French landscape professional Charles Thays. Distinguished and prestigious personalities from the world of art and culture spent pleasant seasons in “La Porteña”: Jorge Luis Borges, Carlos Gardel, Victoria Ocampo, Count Keyserling, Rabindranath Tagore, Garry Kimovich Kasparov and Pedro Figari among others, enjoyed the hospitality extended to them by the Güiraldes Family."}