{"user_rating": 4.5, "review_count": 201, "name": "Eurobuilding Hotel Boutique Buenos Aires", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Stayed here for 3 days and I can't say how much we enjoyed staying here. The staff at the front desk were very helpful and friendly and the room was very good. I really felt that they went out of their way for us to enjoy our stay with them. If I had one gripe it probably would be that the AC didn't get cold enough but stil ended up a little chilly in the mornings. We really thought the bed was very comfortable for some reason.", "title": "Great Hotel", "helpfulness": 3, "user": "RedSox28", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97528548}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "After reading other reviews, I decided to stay at this hotel. Big mistake, first time I was ever led astray on Trip Advisor. First off the hotel is right outside an 18 lane highway which is the largest in the world. Every room is noisy! Even the quiet room I was put in sounded like cars and buses were in my room. If you are used to peace and quiet and a light sleeper like me, I would not suggest this place. The rooms were fine and comfortable within the hotel, but the noisy streets outside made me wishing I had not booked it. I used a work perk site to book and could not cancel otherwise I would have walked out the first night. Breakfast is typical, yet good. Management realizes there are service issues...my clock didn't work, the sleep mattress bed wouldn't work, whatever didn't work when it was fixed, something else broke. Very frustrating experience. Rooms were very clean and that was the only thing good about this hotel.", "title": "NOISY NOISY NOISY", "helpfulness": 1, "user": "kennydog", "date": "January 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 91627148}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This hotel was great. They had very clean comfortable rooms. The only strange thing about the room is that they had a huge window into the bathroom. There was a shade but it was pretty see through. So if you are traveling with someone you don't know that well be forwarned. The staff was WONDERFUL. We asked them all kinds of questions at the front desk and they helped us every time. On the 10th floor there is a beautiful viewing room. We went up there every night to enjoy the night skyline and have a bottle of wine.", "title": "Classy Hotel", "helpfulness": 1, "user": "lahanson", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83590565}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Friendly, knowledgeable, helpful staff. Clean, spacious rooms. Relaxed atmosphere. A truly great experience.", "title": "Absolutely impecabble!", "user": "Sandy_Smile1979", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62628514}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We just had a wonderful 3 nights stay in this hotel, the rooms and bathrooms are excellent.", "title": "Great hotel", "user": "mbelmar", "date": "April 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60949389}, {"rating": 5.0, "title": "Wow! This place is super clean design. Really nice!", "text": "So I've visited this chain's hotels in Caracas before and enjoyed my time there. I'm always on business when I'm in Venezuela. But I went down to Argentina on a hunting trip recently and was lost for ideas on where to stay in BA. Luckily, I found that the Eurobuilding had recently expanded their operations to BA. So I booked a room there with my hunting buddies.", "user": "Happy_Texan_Traveler", "date": "February 1, 2010", "id": 54967170}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "It's really a stunning place inside. Really modern lobby with a water fall. Rooms are nicely sized. It's much smaller than their Caracas hotel. But I like it alot. definitely my favorite Eurobuilding I've been to yet.", "title": "good service and high standard of accommodation and breakfast.", "user": "Strommen43", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52580848}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "It's right in the middle of town. Unbeatable price for what you get. Couldn't recommend this place any hirer. It might not be in the trendiest part of town. But it's pretty close to that. And cabs are really cheap. You could see the Obelisque from my room. Right on that central ave that cuts through town.", "title": "Very good quality and kindly service", "user": "CRKatayama", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 38742485}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Seems mostly suited for business types (I know a bleary-eyed businessman when I see one). But totally great for a visit to BA too.", "title": "The Best Place to Stay In Buenos Aires!", "user": "EdZT", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30346043}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "stars": 4, "variance": {"poor": 4, "average": 11, "very good": 76, "terrible": 2, "excellent": 108}, "slim_ranking": 0.161363636364, "description": "Eurobuilding Hotel Boutique Buenos Aires offers to guests personalized and high class services. The amazing size is one of its representative features; it creates the environment to give exclusive attention to every one of its guests. Its location, in the heart of the city, is essential for comfort.It is surrounded by historical monuments and delirious performances, an aggregated value that our guests enjoy. We have the honor to guarantee our customers 100% satisfaction."}