{"user_rating": 4.5, "review_count": 1715, "name": "EuroPark Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "My daughter and I stayed for 2 nights at this chic, clean, unpretentious hotel. The neighborhood is safe day and night, close to metro stops, and walking distance to much of the action in this great city (we love to walk). Upon my early arrival, exhausted from flights, I appreciated how the manager finagled rooms so that I could check in early and shower. Our room was in the back with a lovely balcony overlooking an expansive courtyard; very quiet as I'd requested. Not a huge room, but nice art deco style, both practical and pleasing. The bathroom was large with a wonderful shower. Free wifi as well as free computer use (which I didn't find at other hotels throughout Spain).", "title": "Very pleased with EuroPark Hotel", "helpfulness": 2, "user": "Dragonfly2", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 128993358}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We didn't eat at the restaurant, but found it spacious and attractive with a bar open throughout the day.", "title": "all round good hotel", "helpfulness": 1, "user": "John B", "date": "April 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128980902}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "Restaurant tip: Romero Restaurante, around the corner at Bailen 115, is excellent: beautiful food in an intimate setting, and reasonably priced.", "title": "Hotel close to the action", "helpfulness": 1, "user": "westmoor", "date": "April 27, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 128912070}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel is modern and very clean. Beds were great, shower was spot on and staff were friendly. The location is excellent, 10 minute walk to Sagrada Familia and metro. Near enough to walk to the city centre but in a quiet area. We had a room at the front and found the road was noisy in the mornings but this is what to expect in a busy city centre. Would recommend this hotel wholeheartedly.", "title": "smart modern hotel", "helpfulness": 1, "user": "nursey14", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128550912}, {"rating": 5.0, "title": "Great Hotel, loved the Europark!", "text": "We booked this hotel based on the reviews given by others in Tripadvisor and the hotel exceeded our expectations. Staff were friendly and very helpful at all times. The hotel is very clean and centrally located. We walked to \"La Sagrada Familia\" and \"La Rambla\". Breakfast was good but we only ate at the hotel once since there is a nice cafeteria at the corner of the street and the owner is just such a nice person. If we come back to Barcelona we will definitely stay at the Europark again no doubt about it.", "user": "sebismom", "date": "April 16, 2012", "id": 128011878}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My girlfriend booked this hotel for my birthday weekend. I can't pick any fault with this hotel as the staff were very helpful with directions and tended to our needs without hesitation. The hotel was within walking distance of 2 metro stations and not far from the hustle and bustle of las ramblas. I would easily recommend this hotel to any of my friends/family should they visit this amazing city. The roof pool/lounge area is a quirky addition to a superb hotel, a spot of relaxing in the sun after a busy day sightseeing and shopping is a must. Not a lot of sun loungers but I'm not sure the hotel was busy enough so this wasn't a problem for us. This might become a problem in the summer months when the weather is better and the hotel fills up. But don't let this fact deter you from staying at this hotel as it is a pure gem!!", "title": "Lovely hotel - no faults", "user": "Chris O", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127942472}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I booked this hotel on the strength of other trip advisor reviews and was not disappointed. Staff were very helpful and friendly, the room was comfortable, in good condition and very clean. The location of this hotel was perfect for us - we prefer not to stay in the thick of a central tourist area, but don't want to be too far away from the things we want to see. Everything we wanted was within walking distance of the hotel. We really enjoyed our stay here.", "title": "Great hotel, great location", "helpfulness": 1, "user": "Tarras10", "date": "April 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127869932}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "i think the hotel was in a great location. very quite and yet very close to the main shoppibg street. the rooms were greatly designed but just a bur small. a bit i say. but that takes nothing away from a great stay. the staff was very very helpful and friendly too.", "title": "excellent stay", "user": "vanillasky1980", "date": "April 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127708490}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Europark Hotel is a very stylish, very clean, and very centrally located spot in Barcelona. The staff was extremely helpful and we will definitely be staying here again if we return to Barcelona!", "title": "Loved the Europark for Our Honeymoon", "helpfulness": 2, "user": "AliWashington_DC", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127633496}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "From the minute I arrived on Tuesday morning April 17th, I knew I made the right choice of hotels for my week long trip to Barcelona to spend some time with my son, who is studying abroad here. My room was ready for me when I arrived at 11:00 AM along with some chocolates and the friendliest staff I've ever experienced (and I travel quite a bit). Te rooms are extremely comfortable, great bed and bathroom and I was in a superior room with a balcony facing Arago on the 6th floor. Everyti e I needed directions for a restaurant or the best way to navigate the metro or a, 'How do I get here' question, I not only received easy directions with a smile but a map with a highlighted path drawn on it. I never got lost. When I purchased some French cheese at an artisans market in the Ramblas and came back to the EuroPark, the staff at the bar on the first floor gave me a knife, fork and napkin to make the snack easier to serve.From making dinner eservations to suggestions when to walk and take the metro, they were so helpful. the location of the hotel is incredible. 3 short blocks to Passieg de Gracia shopping, a 15 minute walk down Catalunya to Las Ramblas and walki g distance to Sagrada Famillia (Gaudi). There is an amazing supermarket and fruit and bread market on the next block on Arago and many restaurants and coffee places in the neighborhood. The Geronia metro stop is a block away and connects one stop up at Plassieg de Gracia which gives you a choice of most routes. I a still here till Tuesday morning, today is Sunday and I will not only miss Barcelona immensely, but the EuroPark as well. I will definitely be back to stay here again.", "title": "EuroPark equals Euphoria", "user": "CraigHolland_PaUSA", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128320525}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "I've been a bit slow in writing as I stayed here in January with my husband and some friends.", "title": "Great Hotel, Fab City.", "helpfulness": 1, "user": "NORTHY1971", "date": "April 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 128301056}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "However, I just wanted to say how great this hotel was. I'd spent many nights researching where to stay and I wasn't disappointed. (Good ole TA!)", "title": "Clean room, plenty of space", "helpfulness": 1, "user": "Rachel C", "date": "April 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 128294465}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "This hotel is in a good location near to all the shops and is very close to the metro station for easy access to the rest of the delights of Barcelona. There are a few little cafes nearby where you can pick up coffee and pastries for breakfast for less than 3 euros.", "title": "Charming Hotel In the Eixample District", "helpfulness": 1, "user": "lofa", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128149525}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel room was great. Very clean, with modern decor. Great toiletries box in the bathroom and a very well stocked, reasonably priced minibar. The bed was comfy and the pillows were good. Our friends had a room that looked out onto the main road which they found very noisy but our inside room was fine.", "title": "Great for Business Travelers", "helpfulness": 1, "user": "Sue B", "date": "April 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128136738}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "lovely hotel my husband and I stay here for a long week end. Within walking distance from metro.", "title": "Great location", "helpfulness": 1, "user": "sarah191076", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 128478658}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "lovely breakfast and nice and clean rooms would stay here again.", "title": "Contemporary and Clean", "helpfulness": 1, "user": "elbee52", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128464018}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We stayed in Barcelona in late March 2012. We found this hotel on Trip Advisor and we were not disappointed. When we checked in the man at the front desk was a bit aloof but since we stayed there for two nights and asked him for recommendations in the area for dinner he warmed up to us and gave us 2 great suggestions which we enjoyed immensely. They had a computer in the lobby with a printer which was just what we needed to print 2 pages out. We really appreciated that convenience. The rooms were very modernly furnished and it was a very comfortable stay. We would highly recommend it and would definitely stay again.", "title": "Very good service and clean rooms", "user": "LiseP", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128446598}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "A friend and I spent 3 nights at this hotel. It has nice clean rooms and very friendly and helpful staff. It is 10 min walk from La Rambla and Sagrada Familia. The hop on - hop off bus passes 5 blocks away.", "title": "Nice hotel", "user": "Mamejo", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128395689}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We were given a room with 2 beds that could be separated, which was what we asked for so check on that one. The only minus was that we were given a room with a 'wall view', it must be said that we also did get a very good price, so understandable if the rooms with a view were given to higher paying guests.", "title": "Nice hotel but location is an issue", "helpfulness": 1, "user": "travelerBobDc", "date": "April 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 128345491}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 22, "average": 89, "very good": 658, "terrible": 6, "excellent": 940}, "aka": "Europark Hotel Barcelona", "slim_ranking": 0.0343511450382, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The centrally located Hotel Europark sits nestled between the city’s famous Paseo de Gracia, Avenida Diagonal, Gran Vía, and Plaza Catalunya. It is easily accessible from all parts of the city and serviced by many lines of public transportation.Some new features of the hotel include a pool and solarium located on the terrace, a conference room, fitness center, and free WiFi. The breakfast room and bar are located on the hotel’s spacious and bright mezzanine."}