{"user_rating": 4.0, "review_count": 355, "name": "Evason Ma'In Hot Springs", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "We stayed at the resort over the Eid holidays. Was pretty crowded and there weren't enough tables for breakfast and dinner buffets. The dinner buffet in particular was overpriced at 30++ JDs with very average food. The pasta was not fresh and the rice was cold. Barbecue was the only saving grace of the buffet. We also tried the ala carte menu for lunch. Though the food was better than the dinner buffet, yet nothing stood out.", "title": "Great location but food needs to improve.", "helpfulness": 1, "user": "Sadia S", "date": "August 11, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 171731331}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "However the location is beautiful, the rooms are well furnished and clean. The staff is helpful and courteous. We used the hotel bikes and cycled around the resort. Great scenic location... if only they could improve the quality of food.", "title": "Nice escape with a few rough edges", "user": "RJCardinalli", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169409817}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We enjoyed a weekend night at the resort with an understated and quiet bedroom on the 6th floor all in dark woods and cooling shutters. Given that it was low season we expected it would be quiet and it was.", "title": "Nice hotel but overpriced", "helpfulness": 1, "user": "ShenMueFan", "date": "July 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166580161}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The food in general was good. We had the Mediterranean night buffet at dinner and it was somewhat mixed. Much of the food in fact is not Mediterranean at all (e.g Chinese fried rice, lamb kebabs, tiny burgers in a pasty brown gravy, and several other main items. There were some nice grilled chicken and succulent hammour fish on the buffet. What Med country services hot dog stir fry?. There was nothing on the dessert buffet that could be called Mediterranean with the possible exception of a well prepared crème brulee. A strawberry cheesecake type concoction was clearly made largely from packaged non-dairy whipped topping, whose primary ingredient is vegetable oil, mixed with a little gelatin---it bore no relation to cheesecake as we know it and left a nasty greasy aftertaste on the tongue. Some mini pate choux éclair were nicely done. The idea of these internationally themed evening buffets is good for family-style resorts such as those on the Dead Sea but seem out of synch with the Asian inspired minimalist design of the complex. And for JD 30++ per head the buffet needs to be truly special and was not. Others have commented to us about the ersatz Indian and Mexican themed buffets, and one can just imagine what they must be like -- the credibility of a hotel like this should be marked by authenticity and creative use of local ingredients. The bottom line is that you should offer what you can execute well. The breakfast was fine, nothing great, but adequate. We were impressed by the quality of the fresh fruit on the buffet, obviously these were all hand selected.", "title": "Lovely escape", "helpfulness": 1, "user": "LindaNZ", "date": "July 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166484302}, {"rating": 3.0, "title": "Refinement with mixed success", "text": "The spa facilities were OK. Although we did not have time for a special treatment, we found the pools generally OK. A facility advertising itself as a spa needs to offer better features. The large swimming pool was nice but was like every other swimming pool-- the warm water pool was OK, though inadequately maintained and the furniture and surround were very scruffy---the resort it cries out for special water features such as those one can find at the Zara spa at the Movenpick Dead Sea hotel just a few miles away: e.g. massaging jets of water of varying strengths and velocity. The men's changing room was converted from a set of toilet stalls and like much of the resort, could benefit from much better maintenance - it does not take much effort to retile and paint the stalls so one does not feel like he is changing in an old toilet. Still, one felt in awe of swimming in the pool while staring up at the dramatic rock landscape and imagining the Ma'in oasis must have been like 2000 years ago by earlier visitors.", "helpfulness": 1, "user": "C C", "date": "June 22, 2013", "id": 164844600}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My husband and I stayed at Evason Ma’in Hot Springs in Jordan for 2 nights. They were the most magnificent nights we had experienced.", "title": "Evason Ma’in Hot Springs, Jordan", "helpfulness": 2, "user": "Reema M", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178091302}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff was amazingly helpful. They were always there to assist in anything and everything. The most wonderful thing about the place was that all the staff members were Jordanians and the hospitality was simply outstanding. We have been around to plenty of countries around the world, but to receive the service as such was never encountered by us. One can tell that the kindness of the staff member was not just part of their jobs, but was instilled in them to comfort the customers to their maximum satisfaction!", "title": "Another Gem from the Six Senses", "helpfulness": 2, "user": "AR407145", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176928522}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We celebrated my husband’s birthday there and the hotel members went out of their way to make it not just an exceptional day for him, but a birthday that he would not forget for the rest of his life. He was surprised with a lovely birthday cake and the special song sung by the courteous employees; while sitting on the cliff panorama restaurant at the Dead Sea!", "title": "Amazing Place", "helpfulness": 1, "user": "Shiyyab", "date": "September 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176732538}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "From the reception, to the housekeeping team, to the guard and the waiters…everything was worth every single penny we had paid for. I cannot thank the staff enough and I am proud to have received this superb magnificent service by a hotel that is managed and administered by the Arabs!", "title": "Oasis in the middle of nowhere", "helpfulness": 1, "user": "eisus", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175107096}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband and I stayed at Evason Ma'In for three nights in late August and had a lovely time. We also made arrangements with the hotel in advance of our arrival for several of the leisure activities they offer and all worked out perfectly. Our activiites included: Wadi Rum, Wadi Mujib, Jerusalem and Bethany Beyond the Jordan, Madaba and Mt. Nebo.", "title": "Stunning place", "user": "Anangiulli", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172699522}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed here at the recommendation of our tour company and thought it looked ok but we were pleasantly surprised and wished we had more than one night here. It was everything a 5 star resort should be with luxurious interior design and spacious rooms. Also less than one hour from Amman.", "title": "Surprisingly good", "user": "Rachel_Whales", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180326094}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The many bar/restaurant areas made it hard to choose where to eat and breakfast was incredible. We took the hotel shuttle to the Panorama restaurant for dinner and also really enjoyed that.", "title": "....A home of calmness and kindliness", "helpfulness": 1, "user": "Andrea A", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180303548}, {"rating": 5.0, "title": "Unique location, amazing hot springs as ", "text": "Unfortunately we didn't have time to try the hot springs but we did go for a short hike above the spa area which was well worth while.", "helpfulness": 1, "user": "bigbirdandgrizzly", "date": "October 7, 2013", "id": 180110419}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "It was a bit odd having the hotel nearly empty but there was certainly a lot of space and many staff. The staff were incredibly attentive and knew what we needed before we did. Hope to make it back one day.", "title": "Stunning", "helpfulness": 1, "user": "Claire B", "date": "October 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179555593}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We visit the Evason many times in the last 5 years and it is like coming home any time we pass the entrance.", "title": "Excellent Hotel, If A Bit Out of the Way", "helpfulness": 1, "user": "Egw87", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178315424}, {"rating": 2.0, "stay_parameters": "Stayed May 2013", "text": "We only stayed here as it was part if our grand tour if Jordan..", "title": "Over priced!", "user": "Phil M", "date": "May 28, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 162074381}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We as travellers would never have booked this as its miles from anywhere and expensive for what it is, the setting is lovely, but the springs were so dirty and disappointing, the public springs were even worse, full of the locals, and disgusting.", "title": "Not sure what this hotel is trying to be - but would not stay again", "user": "Jantreg", "date": "May 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 161950953}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The one for guests of the hotel, were filthy and not inviting, in fact the water was freezing..totally pointless, unless you wanted to spend another £100 plus to get massages and better cleaner springs, but on too of the price it would be to stop here it's totally ridiculous!!", "title": "Tired and Over-rated", "user": "mbanlaby", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 161892459}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The pool also was freezing, and you couldn't get round it for the locals and about 20 screaming children!!!!", "title": "Brilliant hotel, excellent service and perfect in every way!", "helpfulness": 1, "user": "John P", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161557324}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The rooms were tired faded and not very clean, the bathroom in the morning must have been about 100 degrees, as it had massive big windows and pointless warped dirty plantation shutters...", "title": "the only spot to stay", "user": "Smarch1313", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161427023}], "location": {"country": "Jordan", "continent": "Middle East", "city": "Ma'in"}, "variance": {"poor": 24, "average": 32, "very good": 84, "terrible": 21, "excellent": 194}, "aka": "Evason Ma`In Hot Springs Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}