{"user_rating": 4.5, "review_count": 1688, "name": "Eventi - a Kimpton Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "As New York hotels go, this is far from being over-priced and it's modestly comfortable. Beyond that, there is little to recommend it.", "title": "Unremarkable", "helpfulness": 2, "user": "MacSasha", "date": "September 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 118508948}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The bed was comfortable enough, the housekeeping rather patchy (two huge palm prints remained on the window throughout) and the room lighting was rather inadequate. We had booked a suite, their most expensive option - and yet, where one would normally expect to find the complementary spring water stood two bottles priced at $5 and $7.", "title": "If you can get in at a decent price, it's worth the stay", "user": "Arachnphile", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118457915}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "While perfectly tolerable, New York City has far more interesting options which I suggest you explore if utter mediocrity is not your thing.", "title": "Girlfriend's 30th B-Day Weekend = Perfection", "user": "Yanni0324", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118421552}, {"rating": 5.0, "title": "best part of my trip!", "text": "Typical of a Kimpton, the place was somewhere between fancy and casual, somewhere between expensive and reasonable, and somewhere between upscale and average. Plusses for cleanliness, the service and staff, and the niceties (like the bedding and the pretty bathroom fixtures). Minus for a slightly high price compared to other lower Manhattan places--maybe I just picked a bad time to go. I wasn't thrilled with the location, but I was there for night-time outings to restaurants and bars (it's just a block east of Madison Square Garden).", "user": "Bikramgirl", "date": "September 21, 2011", "id": 118407131}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "This is the perfect hotel for anyone wishing to treat their girlfriend to a special weekend (birthday, engagement, etc.). Allow me to describe why:", "title": "Great value", "user": "aabg", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118392432}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We needed to be in the Chelsea area and Expedia offered a good two night rate on the Eventi. The hotel is a pretty new 24 floor tower. Our room on the 18th offered good Manhattan views and, above all, peace away from the street noise. The peace can be interrupted by fellow guests returning late and letting the room door close with a resounding bang - the doors are fitted with very effective closers (haven't they heard of soft close?). That apart, it should be possible to enjoy a good night's sleep. The Queen/Queen room was fine with very comfortable beds although the bathroom lacks a bath and in its place has a very large walk-in shower. Staff were efficient and pleasant without being outstanding. Maybe the newness of the hotel contributes to what, for us, was a lack of atmosphere and character.", "title": "Unremarkable", "helpfulness": 3, "user": "Rover10", "date": "October 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 118881411}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "For leisure travellers there is the drawback that the area around the Eventi is pretty uninspiring with streets full of wholesale garment and accessory outlets. There is a distinct lack of decent cafes and restaurants in the immediate vicinity and it is some distance to any tourist attractions of note in any direction - to put it succinctly, the Eventi is a very pleasant but not outstanding hotel in a Manhattan desert,", "title": "Incredible Stay", "user": "Lauren R", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118859626}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If you go I doubt that you will be disappointed, equally you may not be inspired.", "title": "great hospitality", "user": "beachvolleyballer123", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118763690}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Overall fantastic trip. The staff was excellent-extremely helpful and kind. The location was perfect. The bed was extremely comfortable and the shower was better than expected. The hotel and room was very clean. The accommodations could not have been better! They had a dog bed and food/water bowls in the room as they were aware we would be traveling with a dog. The view of the Empire State Building was incredible! Everything about Eventi goes far beyond expectations of a high quality hotel! Thank you for making this trip amazing!", "title": "Great Hotel & Service", "user": "Daddybobo", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118745541}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "just wanted to give this hotel and company a big thumbs up for there handling of our stay during the hurricane. The wen above and beyond to even having breakfast lunch and dinner catered in. The rooms are nice and overall it is a cool place.", "title": "Great customer service!", "user": "joetsig", "date": "September 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118700022}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Just back from a 3 night stay (Sept 15-18). What a beautiful hotel. The room was great, the staff were all very helpful and friendly and the location can't be beat (2 blocks from Penn Station and central to everything). Take a walk over the the High Line (about 4 or 5 blocks) and experience a great urban NYC path/park above the city. Walk a short distance and experience Eataly. Amazing food and dining. Jump on the subway close by and get anywhere quickly or cab it from this central spot. Wine hour on the hotel patio is great.", "title": "Eventi is excellent!", "user": "David S", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118332610}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Also, no bedbugs. Very clean. Checked all the reports/sites.", "title": "What a event to be at Eventi!", "user": "Tete C", "date": "September 19, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118327522}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Well done Eventi.", "title": "Lovely boutique hotel", "user": "Toomanytrainers", "date": "September 18, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 118256903}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "I'm a journalist and TV anchor from Buenos Aires. Due to my work, I usually travel around the world and stay in luxury hotels. This time I was in New York covering Fashion Week, but I never wanted to leave the hotel! I felt so confortable! Now back home I miss that heavenly bed! Decor and service were supreme, I enjoyed all the facilities, from the gym at early hours to the friendly happy hours at your unique terrace. I reccomend to anyone who wants to compensate the craziness of New York with the homy and warm feeling at a hotel, to stay with you guys at Eventy. Thanks to everyone, from room attendants to management, for being my home away from home. Teté Coustarot", "title": "Prime spot.", "user": "Raybwf", "date": "September 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118245479}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Great location, excellent rooms, great facilities, good gym, especially enjoyed the complimentary early morning Yoga class run by Terrance.", "title": "Simply excellent..the New New York Hotel", "helpfulness": 1, "user": "Innseeker56", "date": "September 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118227469}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This is a very nice brand new Kimpton hotel , on 6th Ave and 30th, away from the hustle and bustle of midtown NYC. We took advantage of their preview rates and booked a double queen room which was a very decent size for a family of 4. The room was on the 19th floor facing back( little to no noise from outside, just one occasion when other hotel guests in the corridor woke us up at 4 a.m) and was decorated in a contemporary elegant feel with subdued, relaxing browns. The beds were very comfortable and the view from the floor- to- ceiling windows pleasant for those who enjoy urban landscapes, as we do.The bathroom was a particular pleasure, and it was devine to step out of the marble walk-in shower into one of the robes provided.", "title": "Kimpton Comforts", "user": "fraire", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 77695955}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "All of the staff we encountered were extremely friendly. We too were conspicuously tourists but did not experience any of the coldness that one reviewer has complained of. On the contrary, I found that despite the Eventi being an upmarket hotel, we never felt out of place. A special mention to Kirk,who helped us with our bags and to the ex-Yugoslavian waiter ( I'm sorry to say that I didn't note his name) who made our 'solitary' dining room experience feel very cosy and intimate .The hotel restaurant is not in its fully operational form as yet, but we had a very good meal there and were glad to have the place all to (f)ourselves.", "title": "Sensual hotel that gets all the little details right", "user": "Catbody", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77583979}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We only made the complimentary 5 p.m wine-tasting once in our 5 night stay, and unfortunately the weather was not good enough for us to sit out on the lovely 5th floor terrace that we'd checked out on arrival. It is obviously a very appreciable touch and seems to be popular with many hotel guests.", "title": "Top Class Experience", "user": "KieranUmanee", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77420494}, {"rating": 3.0, "title": "It's about the smell...", "text": "Finally, as Kimpton in Touch members, we took advantage of the free in-room wi-fi to Skype home to France, which was most appreciated, instead of having to shout into a public payphone over the street noise.", "helpfulness": 4, "user": "GiftBizGuy", "date": "August 25, 2010", "id": 76813722}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "To sum up, this is an extremely comfortable, relatively well-placed hotel ( we used the 28th street station the most) for which we paid considerably lower prices than the rack rate. If you can get a decent price, then do not hesitate an instant, and if you are not/do not mind paying the full price, it's a great hotel too. I'm sure that it'll even be excellent once the food court and street-level huge screen terrace is up and running.", "title": "Fab Hotel - Modern Clean and Great Position", "user": "vic3b", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76677277}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Terrific new Kimpton, rooms have great wall to ceiling windows, good size for NYC, lobby is happening if not a bit loud, not the most convenient location, but good value for the dollar.", "title": "great fins in NYC", "user": "traveltoomuchToronto", "date": "December 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121388836}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I have stayed at the Eventi more than 4 times and I am never disapointed. I travel for business and I appreciate they are fast and efficient at checking me in and recognize not everyone is a tourist with loads of time. The rooms are spotless and very comfortable. I admit, I am a Kimpton member and do get some nice benefits, but I feel the staff is extremely nice to everyone regardless of status. The BEST feature about this place is that the windows are practically sound proof. For anyone who knows NYC, not hearing constant taxi honking and city sirens, if you are not used to it, is a real blessing. Sleep like baby every time.", "title": "Consistently delivers!", "user": "Cglasb", "date": "December 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121329675}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed at the Eventi the last week of November 2011. It was a very nice experience. We had a basic king-size room on the 11th floor (#1114). The room was well decorated, small but cosy and perfect for a couple. The bathroom was very nice, well lighted. Everything was super clean. We asked for a quiet room and were very pleased with the room they gave us; we almost didn't hear from the outside, and didn't hear our neighbours as well. As Kimpton Intouch members, we got a $15 gift card to use on items from the mini-bar at our arrival, which was a nice touch. The only complaint I would have, which prevents me for giving this hotel a 5-rating is service. Three times we asked for something, and were disappointed. 1) We asked for an extra comforter at the reception at 6:00pm the first night and when we were back in the room at 10:00pm it wasn't there; they forgot our request. 2) The second day we left the room at 11:00am and were back at 3:00pm to find the room undone. We had to ask the cleaning lady to come and do the room. 3) When we asked for our car at the reception (valet parking) it took them almost an hour to bring it to us. Knowing that the parking was not even a block away and that we were the only ones waiting for their car, we found that delay a little excessive. Talking about parking, the one the hotel use is a public parking under the building. They charge you $50 a day for valet, it's $22 a day when you go park your car yourself. It may be worth doing if you don't mind parking your car yourself... We did not take advantage of the wine offered between 5:00pm and 7:00pm but did enjoy coffee in the morning. Overall, we would certainly go back, the location is superb and the hotel super nice.", "title": "Very nice experience, good location", "helpfulness": 1, "user": "IsaPhD", "date": "November 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121264865}, {"rating": 4.0, "title": "Good location..price..and staff", "text": "About ten blocks from time square..but doesn't seem that far since we walked a lot ...to restaurants ..theatre or a five dollar cab ride...complimentary wine hour and sangria was a nice touch and we had two queen beds in the room...security checked us before entering each time and front desk very helpful..nice rooftop patio and bar...no complaints", "user": "yvontario", "date": "November 28, 2011", "id": 121178906}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The basics: Rooms here are small, but no smaller than an average New York City hotel room. Space is used well and the bathroom is quite spacious. The shower is huge and glorious. Room and bath could use brighter lighting. As a new hotel (only 14 months at our visit) it is clean and up to date.", "title": "Excellent ; great hotel", "user": "KREWgirl", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121132434}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We were very much looking forward to our 7 night stay after the reviews on TA (we stayed early Sept). However the hotel did not live up to expectations; hence my ramble below. Good: kimpton in touch program (free wifi; $15 minibar voucher); location (easy access to transport and Macy's/shops, good restaurant options around, convenience stores nearby, food parc downstairs with good outdoor terrace to relax & have a beer) and comfy bed. Bad: service. From the moment we arrived late in the evening the reception was not warm - it felt put on; unlike the other 4 hotels we stayed at during this trip, the eventi staff did not say hello as we came and went even on one night when we arrived home very late and there was only us and the reception person (she never even looked up). The doormen were often chatting between them as we walked through but not to us. We were there 7 nights and were fairly recognisable with a kid in tow - I did not feel welcomed here unlike all other places we stayed at. Housekeeping was poor - I requested the turn down service for the sofa bed - it didn't happen after 2 requests so I gave up. They overlooked doing the room one day and the first response to me when I queried this was to blame me that I'd left the don't disturb on (I hadn't). Toiletries were also rationed. I asked about a laundry and was told the nearest was on 23rd - there is in fact one on the same block (30th/7th). The car to the airport didn't show - did they really book it for us? The photos on the website are a little deceiving - the rooms are smaller than expected and dark. I'm still keen on the Kimpton brand although this one did not meet their usual exccellent standard and particularly the firendliness of staff.", "title": "Disappointed", "helpfulness": 2, "user": "Familygdl", "date": "September 26, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118636163}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My wife and I stayed here in early September and had a great one night stay! We were celebrating our 10th Anniversary and we were given a room upgrade. When we arrived in the room there was champagne, chocolates and a personal congratulations card from the hotel. The hotel made us feel welcome and appreciated. The rooms are very modern and clean with a high degree of comfort and design. The staff was friendly and the location was great. I stay in hotels 50+ nights a year and this was one of the best stays that I have ever had! This is one of the top 5 hotels in NYC.", "title": "Incredible Stay!", "user": "WashParkD", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118629934}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "We had lovely stay here location is great room is lovely modern big for being new york. Definitely will be going back here staff were excellent especially kirk. Only stayed 4 nights wish it was longer.", "title": "Excellent hotel", "user": "deblouise", "date": "September 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118606774}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "My wife and I stayed at the Eventi for our wedding anniversary just to see NY and stay near Times Square. One of the best hotels I have ever stayed in. A little pricey, but that is comparable to the area you are in. The service was great, the rooms were exquisite, marble shower was great. They even provided us champaign and chocolates for us to celebrate our day! We looked at other hotels, and saw complaints about elevators and possible bed bugs, but none during our visit. The exercise fascility was perfect for what I need to get done daily. Its a definate recommend.", "title": "Luxury at its finest", "user": "return06", "date": "September 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118582447}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We stayed here for a week and were extremely confortable. The hotel is new and very clean. The rooms and bathroom were spacious. We were on 27th floor and noise wasn't an issue up that high. It's 3 blocks from Penn Station which worked great for using trains from JFK and not having to spend money on taxis. And we had friends to visit in New Jersey so it was very convenient for us. Its also was close to the Empire State Building. Its about a 15 min train ride to the lower east side, greenwich village. We didn't get a chance to eat at the hotels reastaurant but we did run down to the small market/cafe that served a variety of food for breakfast, lunch & dinner. All hotel staff were extremely nice and helpful. I would definitely stay here next time I'm in New York.", "title": "Great location in New York!", "user": "jenznomi", "date": "September 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118535663}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "My recent stay at the Eventi hotel in NYC was absolutely fabulous! The hotel is centrally located and provides easy access to all areas of the city -- it was the perfect place for my travel needs.", "title": "A Stay at Eventi = A Fabulous Time in NYC!", "user": "AdventureGirl1982", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120756749}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The property is a trendy boutique hotel that combines modern and chic decor with a zen-like vibe. I found it to be both buzzing and relaxing at the same time -- plus the views of the skyline are unforgettable! I recommend a room on the 20th floor!", "title": "Great Hotel, Great Location, Great Price!", "user": "Lauren L", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120756019}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The staff at the Eventi were incredibly accommodating and efficient. Upon my departure from New York I left my cell phone in the hotel room and the security staff went to great measures to locate it and return it to me in a timely manner.", "title": "A favorite!", "helpfulness": 1, "user": "EZWriter2005", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120755930}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I highly recommend a stay at the Eventi -- you won't be disappointed.", "title": "Eventi: Experience NYC the right way", "helpfulness": 1, "user": "Natalie L", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120720142}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed at the Eventi Hotel while on business in New York, and I was so happy with the wonderful hospitality of the staff, the ambiance of the hotel, and the wine hour (this was a great surprise)! The room I stayed in was really comfortable and clean. I would recommend this hotel for anyone who is looking for a great place to stay in New York!", "title": "Love this place!", "user": "Jamie K", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120716976}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "This is a great hotel in the heart of NYC for it's price category. The hotel is geared toward the business traveler and definitely has the feel of such. I like the place and would stay again. The staff is great and they all try to make each guests stay special. A can't beat hotel for the price.", "title": "Great Hotel for it's Price Category", "user": "RussFilice", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121131132}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "If you are visiting NYC and decide to stay at Eventi, you better have a very good reason to be staying at 30th Street and 6th Avenue. It is one of the worst areas to stay in Manhattan compared to pretty much anyplace else (upper Westside, upper east side, mid-town, Times Square, the Village, lower Manhattan, you name it). We stayed there because we were in town to see a game at Madison Square Garden and though it would be easy to walk back to the hotel after the game. Wrong decision. There was no where to even have a drink after the game. The hotel operates its only bar/restaurant as a night club for kids who wait in line to get in late at night. Even if you wanted to be there, its very loud and there are no seats available. The hotel that has no interest in catering to its guests, but instead prefers the revenue from operating its night club. As far as the hotel itself goes, its fine. The rooms are a bit small, the bathroom is very nice. However, for this price you can choose one of the many beautiful areas of the city.", "title": "No reason to stay here...", "user": "prestonhalperin", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 121116551}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I'm not normally one to review places I've stayed but Eventi was worth an exception. The hotel was fabulous, from the spacious and modern rooms, the welcoming and helpful concierge and desk staff for whom nothing was too much trouble, to the bar and restaurant staff who were friendly and knowledgeable. The wine hour and complimentary coffee was a great touch and the food in the restaurant was some of the best in New York. Our sincere thanks to all the staff for a fantastic stay in New York...we will be back!", "title": "Fantastic place - would definately recommend", "helpfulness": 2, "user": "rachel_dowling_brown", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121076570}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Elegant, pleasing decor, courteous and helpful staff, great location, spacious room...everthing you need in a hotel. I would stay here any time while in NYC.", "title": "Everything you need in a hotel", "user": "auntiemame333", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121066930}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Good midtown location, very helpful staff. Clean, modern, but not austere room, very good bed, quiet. Will return here again.", "title": "Very comfortable and accommodating, good value", "user": "dgourmac", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121036838}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We enjoyed a 5 night stay last week at this new, friendly, clean Kimpton property. I never thought I would take the time to write in this venue, but I wanted to give kudos and thanks to the staff at this hotel. The concierges wear many hats there, and one in particular, Joycelynn, exemplified the service I've come to expect from Kimpton. She gave us friendly, attentive, spot-on advice, directions, and reservations. Everyone at the front desk/concierge area was good, but this women stood out!", "title": "A+ Kimpton Boutique Quality and Service!", "user": "mssking", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76588765}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "The hotel property is located near Penn Station as advertised, but access to anywhere was very easy, and the 34th St. B or D trains were a block-and-a-half away. Taxis were abundantly available.", "title": "Eventi Delivers..2nd Visit in Two Months", "user": "oojybooj", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76115940}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The rooms were comfortable, albeit on the small size you would expect for NYC. We did not have a problem with noise (9th Floor). We were on the \"back side\", but still satisfied. The rain shower and Etro toiletries were nice.", "title": "Excellent hotel & we were treated well!", "user": "stltraveler01", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75612431}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The 5th Floor features a modest workout room with excellent, new equipment. The outdoor lounge is located on this floor, too. The gratis wine tasting happened there, except when a private party took precedence (2 out of 5 nights). No worries; the wine just moved downstairs to the lobby.", "title": "EVENTI - WILL BE AWESOME HOTEL", "helpfulness": 1, "user": "iancarpy", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74994463}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Bottom line: If you are looking for Kimpton boutique quality at a great value in the heart of NYC (a few blocks away from the Empire State Bldg.), than this is your place. Speaking of value, another concierge et al named Brittanni took care of an issue for us. I was very impressed with the way she helped us out.", "title": "Another excellent Kimpton Hotel", "user": "output555", "date": "August 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 74972547}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I just returned from an amazing experience at this hotel! The ambience, warmth of the staff, and true beauty of this hotel are unsurpassed! One of the most spectacular hotels I have stayed in. I will never go anywhere else in NYC! (A special thanks to one of the staff, Doris, who made it all the more special!) HUGE thumbs up!", "title": "An extraordinary experience!", "user": "Paula5524", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74309054}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This Kimpton does not disappoint! First off, its brand new so everything is in tip top shape. The bedding was amazing. They offer more amenities than any hotel I've stayed at (I sleep with a fan at night and they delivered one to my room free of charge). Allows pets, they have food & water in the lobby waiting for them. I loved the location. In Korea Town essentially, close enough to walk to 5th ave, but not right in the hustle and bustle of Times square. Even walked to the West Village and Chinatown. I definitely WILL be back. In fact I am not sure I'd stay in a different hotel (and I've stayed in places like the Waldorf & Roosevelt).", "title": "Awesome Hotel. Perfect Location.", "user": "karalyn84", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74057957}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Swanky modern decor. The beds were amazing. Very friendly staff. We brought our pet and they rolled out the red carpet for her! The free happy hour on the 5th floor outdoor veranda was a hit with us. We would just hang out and relax there before heading out for the evening. Only downside is the neighborhood, but not a far walk or subway ride to get you where you need to go.", "title": "Loved it!", "user": "KMichigan", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 73925643}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "What a great hotel! We had a corner room on the 12th floor with ceiling to floor windows! The bed was very comfortable the room was decorated nicely, and the bathroom was beautiful. The 5th floor Terrace was great, wine and sangria were complementary from 5:00 to 6:00, it was a beautiful night to sit outside on the Terrace and take in the sky line! We would certainly go back to the Eventi, we got a great deal on the room, we just hope the prices don't go up so high that we can't afford to go back!", "title": "What a great hotel!", "user": "JoAnnandJohn", "date": "August 5, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 73880982}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Thanks for an enjoyable get away weekend!", "title": "Boutique Hotel - Unique and Clean", "user": "DiegoFlorida", "date": "August 1, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 73293950}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Stayed at the Eventi from november 20th thrue 24th. We had a wonderfull stay! Our room 1207 was super. A little on the small side but perfect for a couples get away. Room and hotel in general where super clean and well kept. Staff was friendly and helpfull. Wine hour from 5p.m. to 6p.m. was a nice touch. Hotel is close to Time Square wich we loved! We will definatly be staying at the Eventi for our next trip! We highly recomend it!", "title": "We loved Eventi!", "user": "eric_et_steph", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121034308}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The Eventi Hotel is a wonderful hotel situated in New York City. The staff there are so lovely and special which makes your stay so much more enjoyable. I got a gift when I first arrived at the Eventi hotel a \"I love New York\" T-shirt! The hotel is so clean and spotless it's amazing!!! When I first arrived at my room I was blown away by its decor being so beautifull with wall paper of New York city. The beds were so comfortable as well it seemed more than reality! Once I had explored my room I decided to explore the Hotel finding a beautifull patio. You could even go out there at certain times and get a free couple of glasses of wine whilst getting the most overwhelming view of New York City. It made my first time in New York something to remember for the rest of my life so I hope it will that effect on you as well.", "title": "\"So relaxing!\"", "user": "eric_et_steph", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121026535}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We picked this hotel for special holiday to NYC and are we glad that we did. It was a good time from the moment we walked in: snappy decor, friendly warm greetings and the room was spacious, clean, inviting. We loved our 5-night stay there and we made full use of its prime location to see all the sights that we could fit in. Our first night we went to the Empire State Building, a five minute walk away; our second night we went to Time square, a 20 minute walk away. A couple of the days we were tired and wanted a brief break in the afternoon and the hotel happened to be near enough for u to drop in, rest up and head out again. It was always a pleasure to return to the hotel at night time, and we were always welcomed back.", "title": "Great Staff, Great Location, Great Hotel", "user": "bailey876", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120914874}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Loved it. Loved it. Hope we can go back.", "title": "Excellent hotel, excellent service", "user": "VickyE2006", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120867536}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "This is a very modern, yet warm and welcoming hotel. The rooms are large and quiet and every hotel staff member we encountered was friendly and helpful. The evening wine hour was nice. This hotel exceeded all of my expectations.", "title": "Great place for a Girls weekend Getaway!", "user": "BaltimoreBetty11", "date": "November 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120836171}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The Eventi Hotel is quite new (I think they opened up in April 2010) and therefore when we booked in June we were able to take advantage of their special Grand Opening offer!", "title": "Simply amazing!!", "user": "vienna_myCapital", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 74626598}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The premises are just beautiful: the lobby is not big but features distinctive and stylish pieces of furniture; the front desk staff was friendly and professional (special thanks to Victoria); the bedroom was not very spacious either but nicely furnished, with the most confy and largest bed ever and a great view! We were offered complimentary tee & coffee in the morning, wine reception at 5pm (we just adored their veranda!), wi-fi connection at all time and a $15 voucher for the in-room minibar!! Everything was spotless clean and every single person of the staff was always nice and smiling! Last but not least, a subway station is only 5 minutes walking from there.", "title": "Rooms are Clean, but nothing extraordinary beyond that", "helpfulness": 2, "user": "am5", "date": "August 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 74544790}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "During our vacation in the US we stayed at 6 different hotels and we realized that their standards are somehow lower than the European ones, but the Eventi was no disappointment!", "title": "Would stay again", "user": "JBudai", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 74534225}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "To be very very picky, although in the heart of Manhattan, its immediate surroundings are quite ugly and dirty.", "title": "Great Hotel", "user": "Hello903", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 74497853}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I wanted to like this hotel, I really did. I was excited about staying there for months, and really excited after it opened and I saw the great reviews on Tripadvisor. But, this hotel disappointed me in nearly every way. I'll list my pros first - which are few. The rooms are clean and new. The carpet still feels very plushy beneath your tired feet and the bathroom is immaculate. The location of the hotel is also very good. Although it is not right next to all of the tourist attractions, it was a short walk to the garment district, Times Square, or the Empire State building. It also had numerous subway stops close by, with practically any subway train you'd ever need to take at one of those subway stops. I never felt like the location was dangerous or scary (as previous reviewers mentioned) and we were out on the streets at all hours. So A+ for location.", "title": "Exquisite stay in every way", "user": "sandandwater793", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74358859}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 22, "average": 94, "very good": 456, "terrible": 10, "excellent": 1106}, "slim_ranking": 0.0519187358916, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Eventi – a Kimpton Hotel redefines what it is to be a Manhattan hotel. Eventi is an experience as much as a destination. The Eventi Hotel's historic Chelsea neighborhood near the New York theater district, artful surroundings, intimate accommodations, dynamic meeting spaces and signature Kimpton hospitality combine into something extraordinary.Located near world-renowned art galleries and vibrant nightlife, Eventi puts you within easy walking distance of Penn Station, Madison Square Garden, the Empire State Building, Macy's and entertainment venues.Just steps outside our boutique Chelsea hotel you will find those special things that make Manhattan so exciting."}