{"user_rating": 4.5, "review_count": 873, "name": "Evergreen Lodge at Yosemite", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I wasn't especially looking forward to my two nights in a tent (a relatively reluctant choice when booking back in the UK - a tricky balance between options and price in Yosemite - I was on a budget and thought this expensive for a tent but better than paying more for a concrete cabin elsewhere). Well, it was wonderful. Yes, it was just a little tent but very comfy with foam mattress. but I was so happy to be paying for the excellent facilities and the beauty of the place. The cabins and tents are so nicely positioned amongst the trees - it's a wonderful set up. And the mountain top pool and hot tub warrant a big thumbs up. Plus, as a tent dweller it was nice that there were seating areas generally too. ok so the expensive dinner menu wasn't really what we wanted but there was a reasonably priced burger item - veggie and meat and both were excellent. would have been happy to have them both nights but splashed out on other item the second night and it was great. Breakfast was lovely too. locationwise - cos we had been worried about being so far out - yes it is about 40 mins out of the valley (maybe more - can't recall really) but you are likely to be doing a good deal of driving around to get the measure of yosemite anyway so the dirve from evergreen to the valley was just part of our sight seeing. And it turned out I way preferred being high up among the trees than down in the valley anyway. And we heard a bear! Having looked for them all day I suddenly realised I wasn't keen enough when I heard it somewhere outside the tent - even having already established at reception that they definitely wouldn't want to eat me!", "title": "favourite place of my californian road trip", "helpfulness": 1, "user": "AlYorks", "date": "May 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 162410577}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Fantastically located for Yosemite Park. Wonderful woodland tranquility. The lodges are relatively basic but clean, warm and cosy.", "title": "I'd definately stay here again.", "user": "doodlebug68", "date": "May 29, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 162371974}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The trading store has all you could possibly need. The onsite tavern is great with a really wide choice of beers.", "title": "A lovely place", "user": "Pokkstar", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 162346807}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The restaurant does wonderful food.", "title": "Urbanite's Adult Summer Camp", "helpfulness": 2, "user": "SarWoah", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162304710}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The staff are friendly. There are also lots of activities available though I did not avail myaelf of these.", "title": "Love it - wish we could stay forever!", "helpfulness": 1, "user": "LL334", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 162125915}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Amazing setting just outside the western gate. In reach of everything you'd want to see. Great accomodation, great staff and good for families and couples alike.", "title": "Visiting Yosemite - Stay Here", "helpfulness": 1, "user": "Carll_UK", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38893625}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Rooms are tidy & secure - no chance of critters sharing your bed!", "title": "Worth the drive, gem in the forest", "user": "ocswimmer", "date": "August 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38783251}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "One of the best places I've ever stayed, and I stayed in a tent no less. The staff we awesome, very friendly and helpful. Ate at the restaurant, for was a bit overpriced, I ordered a panini that was bland, but the service was very good. My partner and I would have stayed longer if we could have. If you staying visiting Yosemite and want to avoid the crowds, this is the place for you.", "title": "Excellent! The Best Place in Yosemite", "helpfulness": 1, "user": "morenachica", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38543443}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Me and my partner stayed at Evergreen in the Muir cabin August 12th and August 13th. I didnt expect such great customer service and the cleaniness of the cabins, they were spotless. The bed was comfortable and CLEAN! The carpet was clean and had no marks or dirty spots at all, which was impressive! The staff was every professional. The entrance to Yosmite is about 10 min car drive which is very close. After going to the valley floor of yosemite and seeing all the people and crowds and etc.. I was even more happy that I choose to stay at evergreen away from all that mess and crowds. Evergreen is the only place I'll stay now when I'm in Yosmite and when I come back.. I big thumbs up to the staff and management, they are doing it right!", "title": "A perfect Yosemite vacation for young families", "helpfulness": 1, "user": "deaks_sf", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 38003525}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at Evergreen for three nights in July and would have loved to stay longer. We have a three year old and a one year old and this place is PERFECT for young children. The attention to detail at the resort is amazing. The cabins are comfortable and the common areas are beautiful, clean, modern yet still rustic feeling. You can look at the amazing stars from various view points throughout the resort. It's a short drive to Camp Mather to enjoy the lake and pool there too. We look forward to going here again soon.", "title": "Great Stay!!", "user": "CandyMass", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 37815563}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Initially, I was worried that the Evergreen Lodge's location outside Yosemite Park would be an inconvenience. In fact, it was a blessing - far from the masses that crowd into the main Valley of Yosemite, and giving fantastic access to a range of quiet walks, trails and other parts of northern Yosemite. The lodges were exceptionally clean and comfortable, with great showers (much appreciated after a hot and sweaty day of hiking). Thankfully, there are no TVs or phones in the lodges, and the whole area is extremely quiet. My wife and I enjoyed a fantastic half-day bike, hike and waterfall swim led by a very knowledgeable guide - there are many other activities organised by the Evergreen. Finally, I must mention the excellent restaurant. While a little expensive, the meals were fine dining and provided a superb end to each evening. I would stay at the Evergreen again for longer, and use it as a very comfortable base for exploring Yosemite.", "title": "Superb lodge with great access to Yosemite", "helpfulness": 2, "user": "Ramathing", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37723806}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "My family and I have been visiting Yosemite for over 25 years. It's a great place to camp despite the crowds in the summer. As far as staying somewhere comfortable without paying a fortune, well that's been a major problem with the park for decades, until now! The Evergreen is a great place to stay as a base for exploring the Yosemite area. It's a short drive down to the valley and points from there and just down the road from the Hetch Hetchy area. During my last stay they were in the final stages of construction in the recreation area so the place had that unfinished look to it and was noisy during the day, but I'm sure that it's all quite nice now. The cabins come in an assortment of sizes, styles and locations and the rates are quite reasonable, especially when compared to what you get down in the valley and elsewhere in the park. The restaurant and bar area is pleasantly rustic and I found the food and service to be quite good. There are plenty of things to do with recreation, internet and bike rental facilities all close by. They also offer a wide spectrum of full service excursions. There are plenty of hiking trails around the lodge and a pretty sunset area with log benches. I plan to stay here again.", "title": "Finally, a Decent Place to Stay in the Yosemite Area", "user": "travelincanuck_9", "date": "August 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 37702062}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "If you like something a little more rustic but still want a more upscale, quiet, woodsy environment you'll totally enjoy the Evergreen.", "title": "Evergreen Lodge was a wonderful, peaceful experience", "helpfulness": 1, "user": "kathyPittsburghPA", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37260615}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Went to the Evergreen for 3 nights. When we booked, which was somewhat late, we were told we would have to be in 3 different cabins. They said they would move us from place to place. When we arrived, they ended up only having to move us one time which was great. The cabins were just perfect for us...clean, good beds and nice size bathroom with a strong shower. Nice little decks with chairs. We stayed in the \"new\" cabins, one which was newer than the other but both were nice. Can't vouch for the older units. Nothing fancy but well done and well kept.", "title": "Brilliant", "user": "TamsBrighton", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 37251091}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The Evergreen is 7 miles back a road that goes through a lot of the Stanislaus National Forest and while it is by proximity close to the park, you have to drive back out the 7 miles to get to the road to the park entrance which is just maybe a mile away on the main road. Advice is to go early to avoid lines...weekdays are better than weekends. So it takes about 15-20 minutes to get to the gate but we were happy not to be staying in the hotels in the Valley. If you only want to visit the Valley, and take the walks from there, I guess the Valley is a great place for you but to really see the sites, you need to drive around so you have to leave the Valley and drive anyway. The Valley is crowded with people and more cars. The Wawona, which is where we had initially booked is very far away from most places we wanted to see and the road back and forth from there is very windy.", "title": "Do not camp at Evergreen Lodge", "helpfulness": 6, "user": "Ethan045", "date": "August 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 37241739}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Six winding miles off the much-traveled road to Yosemite National Park, away from phones and TV is Evergreen Lodge. It is idyllic for time without distraction in a spectacular environment. Roll up to a historic building tucked beneath towering pines surrounded by cabins for families, friends, couples. Evergreen focuses on investing time in activity that nurtures relationships. This distraction-free time is perfect for reading, hiking, sleeping in, enjoying s'mores around a fire pity, ghost stories, croquet, massage, swimming.", "title": "Family Reunion, Romantic Getaway, Escape, Time to power down", "user": "KDrellich", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160817337}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Food is served in the bar as well as the restaurant. It is excellent. The cabins are clean, tidy and comfortable - but not the Four Seasons - just ideal for the perfect rest after the perfect day.", "title": "We loved it!", "helpfulness": 1, "user": "MBailey0330", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160750264}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Evergreen is a fantastic base for the Hetch Hetchy area of Yosemite. The lodge has great amenities for kids, including marshmallows and story telling in the evening. Lots of great hikes nearby as well. The valley floor is about an hour or more from the lodge.", "title": "Perfect place for exploring Yosemite", "helpfulness": 1, "user": "SCSLondon", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 160588755}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The cabins are high-end cabins but still cabins. The beds are comfy and clean. The surroundings are the best part of the stay here. It peaceful and pretty.", "title": "Great camping experience!", "user": "Anna B", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 160472403}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Don't miss the restaurant. The food is sustainably sourced fresh, original and yummy.", "title": "Great Little Lodge With a Fantastic Restaurant", "helpfulness": 1, "user": "Brian R", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 160120342}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This place is a great compromise if you cannot get accommodation within Yosemite - you cannot get closer to the park entrance without actually being inside! Moreover, it is probably cheaper and certainly of a very high standard.", "title": "Just perfect for our needs", "helpfulness": 1, "user": "Ian07", "date": "October 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 45977688}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed in th enew Kolana cabins - a one-bedroom cottage, ideal for a couple. The cabin was very spacious, well appointed and clean. Still signs that this is new though with the forest still to completely recover from the construction works. It exceeded our expectations.", "title": "Great cabin and friendly staff", "user": "murrayd", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 45826712}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Staff were great - very helpful and friendly. Breakfasts were good value, not cheap but filling and hearty before your day.", "title": "Excellent accomodations and services, minor accounting quirks", "user": "michael-in-mass", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45818385}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Location means you have a drive in to the park for any activities you plan - this can take up to an hour and a half for some of the remoter hikes and trails but you are ahead of the crowds who have further to come! And who wants to lie in bed with Yosemite on your doorstep!", "title": "Great amenities, but not for us.", "helpfulness": 1, "user": "ACMinFL", "date": "October 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 5.0, "rooms": 2.0}, "id": 45807804}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Did not particpate in the arranged tours or activities as much prefer to do things ourselves. There was lots on offer if this is your thing.", "title": "Lovely cabins nestled in a beautiful forest", "helpfulness": 1, "user": "Janey_Jones", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 45547403}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "If you are someone that constantly has your head buried in your iPhone so you can read about what your friends are doing on Facebook and Twitter...you can stop reading here as the Evergreen Lodge is NOT for you. However, if you are a human being looking to balance from your hectic life and reconnect with Mother Nature, keep reading. The Evergreen Lodge is truly a gem that is nestled in the middle of the forest...no TV in the room (yeah), no Wi-fi (awesome), no cell phone service (a blessing), no heavy perfume/fragrance on the sheets or towels (thank god...). Salt water pool, excellent food and food options (in the middle of nowhere) and friendly staff. It was hard to leave, and I cannot wait to go back!", "title": "A Hidden Gem, but not for everyone", "helpfulness": 2, "user": "nancy r", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161748031}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Basic log cabins with thin walls so sleeping was a problem with a family with kids in next door.cabin", "title": "thin walls", "helpfulness": 2, "user": "gilly220", "date": "May 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 161660126}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Simple accommodation, biggest problem was no mobile telephone signals and no internet to speak of and no telephone connection from cabin to reception. The restaurant was fine and the outside barb- b- q was o.k.with cosy external fireplaces and we presume guests who came in from outside who added colour to the atmosphere-, strumming banjos and wearing country outfits and beads. There was an alternative to have dinner in the main tavern. Breakfast was good and service was considerate and attentive. It was all very rustic and American western style. There were games in the evening when we were there- \"Bingo\" etc!! All very friendly.", "title": "Our New Favorite Yosemite Location", "user": "cre8dnrg", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161659378}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The day tour was exceptionally good with a superb guide but expensive.The store was comprehensive. 2 nights are enough to see all and in any event the Lodge is expensive for what it offers. The Pool area was superb. Evergreen Lodge is quite remote and a fair way from the Yosemite Village down a twisty road. Good fun if you are into a real rustic experience.", "title": "THE Accommodation For Non-Valley Yosemite Exploration!", "helpfulness": 8, "user": "StrandsDanville", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161550056}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Driving down Evergreen Road to The Evergreen Lodge you see the Cabins on the left. There's a little store, a small restaurant with indoor and outdoor dining, a saloon with music on the weekends. The cabins are studios and also 1 bedrooms w/ family room. They have their own decks are the setting is within the pines. There's also a nice pool, spa and pool dining area. The internet is spotty, but they do have a rec center that is SUPER helpful and they also offer free landline phone calls. They offer movies, books and maps, ping pong in the courtyard, s'mores every night 7-8. Very cool play areas for kids, horse shoes, bocce ball, trails. The lodge is located in a convenient location to hike day trips and come back \"home\". We hiked Carlon Falls a 3 mile easy roundtrip hike... jumped off the fallen trees and boulders into the icy water...awesome and only saw 3 people over 4 hours.", "title": "Fantastic place to stay", "helpfulness": 2, "user": "tglasby", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161463876}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Evergreen was the site of my son and daughter-in-laws wedding and the the staff, the surroundings, the cabins, the FOOD were just incredible. Would highly recommend Evergreen for a wedding, family reunion, vacation destination or any excuse at all to go!", "title": "Evergreen went above and beyond to make for an awesome wedding weekend.", "user": "Skier125", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44717639}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Lovely little cabin under the trees. Quite small but nice touches and lots of peace and quiet. Good activities if you want them, bikes for hire and lots of useful info in the rooms - we loved rainbow pools for a swim. Free internet was very very slow, not sure I buy their line about interference with the satellite signal. Lovely restaurant with fantastic food. Well stocked shop on site. Not far to Hetch Hetchy, which is a nice escape from the crowds of Yosemite. When we drove down to Yosemite valley we were very glad to be staying elsewhere. All those tents look like a refugee camp and it felt a bit hectic. Glad to drive back up to our quiet retreat! I could imagine staying here for a couple of weeks and really unwinding.", "title": "Tranquil retreat", "helpfulness": 1, "user": "Comfortluver", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44439081}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The resort is in a lovely and quiet setting close to Yosemite. The staff is friendly and the restaurant was good. However, our cabin had stained carpets, one aluminum window with a dark shade and no curtain, a small bathroom window surrounded by mold, spots on the ceiling, and a dime store ceiling fixture. The \"cabin\" shared a wall and a porch with the room next door.", "title": "A $45 dated motel room for $160", "user": "oscarsmomOccidental", "date": "September 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 4.0, "rooms": 1.0}, "id": 42319365}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I should have complained about the room before staying there. I mentioned at the time of check out that it was depressing and not a $160 a night room with its stained carpets, and that it in no way resembled the room in their brochure.. I was told \"Sorry you found it too rustic.\"", "title": "Average-- nothing special", "helpfulness": 1, "user": "abhNewEngland", "date": "September 11, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 40836359}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "I would recommend strongly seeing your room first if you decide to stay there, since they all must not be so bad or they would not still be in business.", "title": "Great escape", "helpfulness": 1, "user": "manywhere", "date": "August 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39207497}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We were here in May a great time to visit the park. This resort is off the beaten path! When driving to the place for the first time I was sure I had made a mistake ( thank-goodness for GPS Navigation). It didn't seem that any thing could be tucked back down the road so remotely. But there it was!", "title": "Peaceful Retreat", "helpfulness": 1, "user": "meltedcupcake", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 161456635}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The cabins are nicely appointed and roomy.The common recreation areas were very nicely landscaped. Would have liked to have a down comforter on the bed and magnification mirror in bathroom. It is true that there is no electronic use in rooms, which was just great for an experience like this. There was Wi-fi available in rec center. We used the jacuzzi only once after a long hike, it did tend to get crowded later. An additional one would be a great addition to the resort.", "title": "\"Glamping\" was amazing!", "helpfulness": 1, "user": "Amy H", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161201904}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "One of the guides suggested the hike to the Hetch-Hetchy resevoir which we did and it was great. We were pleasantly surprised that the food at the restaurant/tavern was so good. One would have to travel quite a distance to eat somewhere else, so we were happy that the food was above average. There is a nice general store that has a nice selection of food, drinks, snacks and sundry items.", "title": "Love this place", "helpfulness": 1, "user": "jwanderlust", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161090697}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We would definitley return and reccomend this resort.", "title": "Be prepared to be unconnected ......", "helpfulness": 3, "user": "MargiMC", "date": "May 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 161020137}, {"rating": 5.0, "title": "Wonderful place to stay!", "text": "Loved our \"glamorous camping\" experience! We booked a family tent for us as a couple because it was the only one left for our weekend stay. Great tent and sleeping set up! After a long day of hiking, this lodge was wonderful to come to! We had a delicious dinner, free s'mores, a dip in the hot tub, and got to play pool and carpet ball in the recreational center. We will definitely be back and recommend to friends. Our friends recommended to us, and we will pass it along!", "user": "Holly M", "date": "May 16, 2013", "id": 160921003}], "location": {"country": "United States"}, "variance": {"poor": 34, "average": 59, "very good": 261, "terrible": 30, "excellent": 489}, "aka": "Evergreen Lodge At Yosemite Hotel", "slim_ranking": 0.25, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}