{"user_rating": 4.5, "review_count": 4686, "name": "Excellence Playa Mujeres", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My bride ( of almost 30 yrs) and I just returned from 5 days, 4 nites at EPM. It is every bit as beautiful as the pics on their website. the accomodations were perhaps the best we've ever had. We chose the swim out unit at the pool (1st floor ) and couldnt have been happier. We stayed in the 8000 building and were close to everything. The resort is spread out a bit but easy to navigate. The staff was very friendly and eager to accomodate all of your wants. Of the 7 restaurants available, we ate at the Lobster house, the french, italian, and asian restaurants. For us, the food was outstanding, but we are not picky eaters. The buffet breakfast in the Barcelona restaurant was the largest we had ever seen, and you could get eggs, omellets, etc cooked to order. Not all of the restaurants are open every nite, but there is a posting provided when maid service comes in to turn down your bed in the evening. Drinks are plentiful and you can get any brand you want, just ask. There is nitely entertainment in the open theatre and it ranges from pretty good to extremely good. There is not a whole lot of nitelife, but the lounge is open for dancing from 11 to 1 am. On our last nite there, we shared a teppinyaki table in the Spice restaurant with 2 wonderful couples both on their honemoon. Thanks to Brinn and Hanna from Liverpool in the UK and Eric and Andrea from Alabama for making the nite a blast !!! Especially the dancing in the Alegra lounge afterwards. Towels can be a little hard to find around the pool, but the attendants will bring you some if you just ask.", "title": "The perfect getaway", "helpfulness": 20, "user": "softfade", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38700258}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "As for tipping, even though this is an all inclusive resort, we chose to tip the staff and bartenders when they served us. Its amazing to see the looks on their faces when you give them just a couple dollars, and we felt their work ethic was well worth it. If you can fit it into your schedule, you must try the couples massage... well worth it. We could find nothing to complain about, and will most certainly return to this Mexican paradise again. Please contact us if we can answer any other questions about the resort.", "title": "The Best Place on Earth", "helpfulness": 13, "user": "gingermaxwell", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38571490}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This was my second time back and we couldn't have be more pleased. The staff is very friendly, the grounds are kept immaculate and beautiful!! No other resorts around so you have plenty of beach space if you get tired of one of the 7 pools! Can't wait to go back next year!", "title": "Excellence - The Name Says It All....", "helpfulness": 26, "user": "davebryant", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38515382}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My wife and I stayed at Excellence Playa Mujeres for one week. We have stayed at the other Excellence resort at Riviera Maya and thought we would try the newer Player Mujeres resort this time. I'll keep this short as most of the other reviews I have read say it all. Everything about the resort from the initial greeting, through to the rooms, food, facilities and service were totally spot on. We did not ask for a specific room or area of the resort, we booked a spa/pool view (not swim out and not Excellence club), we were given a complementary upgrade to an Excellence club room. As you probably know, all the rooms are that same design internally and on the balcony. As far as I could see, the difference with the Excellence club rooms is the inclusion of fruit and spirits (vodka,gin,tequila,whisky,brandy) and a bottle of Champaign etc in the room, a slightly nearer location to the main area (we had room 7254) and use of the Excellence club lounge with drinks, snacks, internet etc. We really did appreciate the club room upgrade. But I must stress, as far as we are concerned there are NO 'bad' rooms at this resort. If you want a swim up room and you want some privacy, request building 2, 3 or 4.", "title": "EPM RTT Rooms beat 'em all!", "helpfulness": 28, "user": "OklahomaLakerat", "date": "August 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38494767}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We really could not fault this resort, the food is very very good, the service is excellent and the staff are friendly and speak fluent English. The pools are very clean and well maintained, the spa is top quality and rooms are amazing.", "title": "Amazing Honeymoon Location!!!", "helpfulness": 12, "user": "Jrich1204", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38370433}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This was our third trip to an Excellence Resort in 8 months..the first two were to Riviera Maya in Nov. and March.", "title": "The World of Excellence", "helpfulness": 16, "user": "gt236", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 37988694}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "THE PLUS SIDE:", "title": "Thanks for a WONDERFUL vacation, EPM!", "helpfulness": 18, "user": "wmw132s", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 37789429}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "If you want peace and quiet, there are plenty of pools around for that.", "title": "Have you ever heard the word \"EXCELLENCE\"?", "helpfulness": 24, "user": "iwannagobackMissouri", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37773476}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "If you want more activity go to the swim up bar and socialize or the Martini bar in the evening.", "title": "Perfect honeymoon thanks to this hotel.", "helpfulness": 13, "user": "lptoday", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37680475}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "If you want some physical activities there is water and beach volleyball, horse shoes, bocce, go for a bike ride...or lesser physical activity : bingo, blackjack, towel folding, touring the kitchen, Texas hold 'em. And if you want more..there is always the gym...we never made it!!", "title": "Anniversary Heaven!", "helpfulness": 11, "user": "coywife", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37575870}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "great hotel fantasic staff very helpful always willing to help food was first class glad we went now as i do not think it will be as good next december when it starts to be very popular as i think service will suffer could not find fault with any of the resturants best meals were in the french /mexican /grill /steak/sushi/ not so good in itailian excellent room roof top spa could not be used too cold beach was very good no problem getting sunbed{ a word of warning do not leave anything of value laying around in your room} as we had two bottles of perfume/aftershave taken as did other people in our block 7/8 block", "title": "great hotel", "helpfulness": 3, "user": "heatherharris", "date": "January 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12446360, "likes": {"liked": "— large roomj", "disliked": "— toilet to open to everybody in room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I always think it helps to know who is writing reviews. My boyfriend and I are in our mid - late 30's, independent urbanites. We really like nice hotels, but are also fine staying at a Hilton-like hotel if we need to.", "title": "The Excellence is Very Excellent", "helpfulness": 18, "user": "LGDC", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12423574, "likes": {"liked": "— Clean, luxurious, attentive staff, good food, beautiful"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Wow - What a trip. My boyfriend and I booked this trip at the last minute and it was worth every minute. From the moment we walked in, we were treated like royalty. The hotel is beautiful, the rooms are spectacular, the staff is fantastic and attentive, the food is delicious and were totally relaxed the entire time.", "title": "Great time at EPM", "helpfulness": 42, "user": "nbi", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12389447}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The beach was super clean, with a teensy bit of seaweed, but it is definitely not a big deal and I really thought the other reviewers really exaggerated the problem. The beach had pristine white sand and blue water - it was like a scene from a postcard. The pools were great (and heated). And, there was more food than what we knew what to do with - my boyfriend is a vegetarian and always found plenty of options.", "title": "Excellent Hotel!!", "helpfulness": 12, "user": "mattt9999", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12276194, "likes": {"liked": "— The size of the rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The pictures on the Web site actually look like the resort - there is no false advertising. We were part of the Excellence Club and loved it, however we can't rate what it was like not being part of the Excellence Club - my gut instinct says it would be fine.", "title": "Wonderful time at the new Excellence", "helpfulness": 27, "user": "Sandi&Stan", "date": "December 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 11996431, "likes": {"liked": "— Relaxing and mellow paradise", "disliked": "— Canceling activities and bus to Cancun"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "This is my first ever negative review of a hotel on Tripadvisor, and I wish I'd read this review before deciding to book! This hotel has so much potential and it kills me that they haven't gotten it together. I'm not a fussy person, but there were so many repeated, unrelated service issues which really ruined this trip for us. I actually feel like this is the first time advice I read on TripAdvisor has really let me down.", "title": "Please Read: So disappointed - much better places than this available.", "helpfulness": 8, "user": "kindelm", "date": "August 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 39117137}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The negatives:", "title": "Dream Honeymoon!", "helpfulness": 15, "user": "manilapacman", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 38922814}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "1) There is a privately owned mansion adjacent to the hotel, in which they had loud, throbbing disco clubbing music until 2am four of the nights we were there. We called the front desk, security, and even considered calling the police but the front desk said they'd take care of it. Lots of waiting by the phone, angry sleepless nights. I had ear plugs (those 30 dB hunting ones) with me, and still couldn't sleep. The music was so loud it rattled my drink glass along the nightstand. I'm not joking! We moved rooms just to get some sleep, but the other room was just as bad. Other folks were exhausted on the beach the next day too. (I heard from a groundskeeper that the owner of this very hotel also is the owner of that mansion? I'm not sure though.)", "title": "The excellence just keeps getting better!!!!!!!!", "helpfulness": 10, "user": "TravelingGirl81Texas", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38919242}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "2) After being kept up until 2am most nights, housekeeping starts crashing dishes in the hallway starting around 7:45am, every single morning. Crashing dishes, slamming doors, yelling to each other in Spanish - every single morning. I asked them to please stop - in Spanish (I speak Spanish) and they were so snippy and rude. I asked management, and they said they could move rooms again in a few days. (However, room #2 had the exact same issue as our original room.) This really made me upset, because I came to this resort for rest and was so exhausted I was nearly in tears much of the trip. I understand that it's nice to have those in room boxes in which guests can place dirty dishes, but the hotel must understand that folks are coming here to rest, and must be more considerate with making so much noise so early.", "title": "Outstanding - A Real Gem in Paradise!", "user": "Riggs0704", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38863229}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "3) The internet. Yes, I'm a desk jockey and must have access to the internet while on vacation. They assured me it would work, and when I arrived it did! Then, the internet went down - and stayed down - most of the trip. I took many desperate trips to the front desk to get help, and they were just clueless. I tipped everytime they helped - they were friendly about it but just couldn't make it work. It turned out their computer systems had specifically blocked my laptop because when I first arrived, I sent a large amount of emails I'd written on the airplane, which triggered some spam flag and blocked my machine. Ultimately, my IT-guy husband himself with their IT guy fixed their systems for them. This internet problem caused major drama for me at work. Ditto with the outside phone lines - I missed two conference calls because the front desk could not connect me.", "title": "Fantastic Resort! Do not listen to bad reviews...", "helpfulness": 28, "user": "cegmsg", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38755218}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We just returned from on week at the Excellence Playa Mujeres. Before we left, I read every trip advisory review at least 5 times. I was trying to determine whether or not it was truly worth the risk to proceed with our reservations or ask for a transfer to The Excellence Riviera Cancun, where we knew the “kinks” had been worked out. I can not say with enough enthusiasm how pleased we are that we decided to cross our fingers and hope for the best. It was AMAZING! However, before I share our experience, I must say that the more I travel, the more I realize there are two types of travelers. Neither is tied to a certain race, gender or soci-economic background. Simply put, one is either Grateful or Entitled. Those who choose to be grateful say to themselves “I am so thankful that I have the opportunity and the means to be here. The world does not revolve around me and even if I have shelled out significant amounts of money for this trip, others are still worthy of my respect and patience.” And the latter attitude is one that says “I deserve every penny that I have paid for this trip. I will demand excellence, expect perfection, and settle for nothing less, because I am entitled! And if anyone dare stand in my way of what I deserve, I’ll remind them of just how important my happiness is!”… swinging their finger in the air the entire time. That being said… the only benefit to any review is to help manage expectations. Your own personal and unique experience is completely dependant on your attitude. Two different people could share the exact same vacation, down to identical appetizers each night, and yet have vastly different experiences solely based on their perspective. I’m sorry to get on my soap box, but there have been many times while vacationing in Mexico where we’ve been so embarrassed to be an American, based on the extraordinarily self absorbed tirade of the American next to us. Were these people honestly taught by their Mama’s that they were that important?! I’ll acknowledge by nature some people have a Pollyanna personality and others a Scrooge. However both attitudes are a choice. You can have the vacation of a lifetime at the Excellence Playa Mujeres, or you can choose not to. Your choice.", "title": "Worth every penny!", "helpfulness": 50, "user": "HandR", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11987812, "likes": {"liked": "— Feeling like Royalty", "disliked": "— The Ocean"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Grounds/ Beach/ Pools: The grounds are beautifully kept. Crews are constantly grooming and adding the finishing touches. Palm trees are everywhere. They are not yet totally mature and full, simply because they were transplanted within the last year. But they are tall, majestic and very tropical. Other tropical flowering bushes and trees are beautifully places around the campus, soft lights and candle lit lanterns line the walks at night. The Beach is many peoples biggest disappointment. The sea grass in the water has altered the turquoise crystal clear waters one expects of the Caribbean. However, all of Cancun shares the same ocean and is dealing with the sea grass. It is not an issue specific to Playa Mujeres. Some took a day trip to the Isla Mujeres and rented a golf cart. Apparently, the island is far enough out that sea grass is not an issue and the water is stunning. (the Ferry is constantly on it’s way there and back, I don’t know the cost.) But even at the Excellence Riviera Maya?? , south of the Cancun hotel district, the water has sea grass. I have included a picture if the EPM staff working on removing, by hand the sea grass. Each day, all day they were out there tediously trying to perfect the water! It was still warm and beautiful, and we LOVED that there were no other hotels near us. We walked up and down the beach, without a soul in sight. I should say that if you prefer a super social beach front, lined with hundreds of sun worshiping vacationers, people selling fun trinkets and with lots of opportunities to “people watch”, the Hotel district is probably more your style. This Beautiful resort stands alone where the guests of this resort have sole access to the beach front. It is a low key and peaceful beach. The pools are stunning. The main pool (with the swim up bar) is not heated. In fact, a good way to remember it is; all of the rectangular pools are the heated ones and the curved ones are not. On a hot still day they all feel great but on a windy day the heated pool is the way to go. The wait staff is constantly milling around the pools asking if they can get you a drink from the bar or bringing by little late morning finger foods.", "title": "Relaxing and Worth the trip", "helpfulness": 18, "user": "LipperLancashire", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11935222, "likes": {"liked": "— New and ultra clean laundry", "disliked": "— Wardrobe a tad small"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Bars / Restaurants. All of the bar tenders are amazing! They will make you anything you can imagine. They will also do custom orders, like a Long Island Ice Tea with out vodka…or whatever your preference. Ask for a menu of drinks. We had some really delicious drinks that I have never heard of, that were listed on these little drink menu cards the Bar tenders had. Always try the “drink of the day”… It was something sweet and tropical and totally unique. They open first thing in the morning and stayed open really late. The 2 main bars; one in the Lobby and the other just outside, stayed open much later than the pool bars. All of the restaurants were delicious! Breakfast was the only meal not from a menu, (unless you order room service.) It was a buffet style at the 2 restaurants that were open while we were there. Each day had a few new and different hot entree options and tons of other daily options. Juan, is the wonderful omelet chef at the Barcelona restaurant. He was there each day and would make omelets or eggs to order. Lorenzo was our waiter each morning, bringing us coffee, mimosas, clearing our plates, what a gem he is! For lunch, the lobster house or the Grill overlooking the pools were fab! The Rueben or French dip were delicious and for a lighter vegetarian lunch, the “Farmers sandwich” with grilled eggplant was awesome! For dinner, the options are outstanding! The Agave was delicious Mexican food. It is Tex Mex, more like the Mexican restaurants we are accustom to, lots of flavor not bland at all!!!! The Chez Isabelle is a wonderful French restaurant, the scallops and the Crème Brule were to die for. The lobster and Curry Shrimp were incredible at the Lobster House. The Flavor Market only serves incredible Tapas and wine. We thought it was a full restaurant until we found out that Tapas is the name for a wide variety of appetizers in Spanish cuisine. They may be cold, like mixed olives and cheese, or hot, such as battered, fried sea food, or little beef or chicken kabobs. The Hot food is different each nigh and always delicious! You can order many different small tapas, and combine them for a full meal, but we just chose to go there first get a glass of wine and a few small apps and then choose another restaurant for our dinner. They do inforce the dress code and will ask you to change if you are not in thr propper attire.", "title": "A great stay, know what to expect", "helpfulness": 26, "user": "DaveandSarahYH", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11914274, "likes": {"liked": "— Staff", "disliked": "— Distance to other local attractions"}}, {"rating": 4.0, "title": "Better than expected", "text": "The Room. Stunning! The double headed tiled shower is incredible, the Jacuzzi bath is accessible from the main room and also opens onto your patio, which is great if you have the privacy of an upper level room , but lower level rooms can not use the tub with the blinds open without being seen by those outside. The bed is very comfy. Air-conditioning only works when all windows and doors are completely closed. Turn down service each night, usually when we were at dinner… they come in, turn off all the lights except two little night stand reading lamps, close the blinds, replace any towels, restock the mini bar and the snacks in the fridge, and neatly fold down the bed with chocolates on the pillows and a schedule of the following day’s activities, weather, and other hotel info. The Rooftop Terrace suite probably isn’t worth the money in the winter months, simply because the hydrospa pool is not heated and unless you hit a big heat wave, it is really too cold to use. It was nice to have the peace and quite of the rooftop just for napping, reading, or star gazing… but each room also has a nice sized patio and patio bed which function the same… we used the rooftop out of principal. ", "helpfulness": 8, "user": "jancraig", "date": "December 22, 2007", "id": 11903360}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Staff: From Housekeeping to the Bar tenders, to the wait staff, to the Activities staff (make sure you get to know Uleses who does activities!) They are all Amazing. One of the great joys of an all inclusive is that you don’t ever have to worry about the cost of a meal or drinks. You can put your wallet away and enjoy yourselves. However we decided after paying several thousand dollars on ourselves for this vacation we could afford to get a couple hundred one dollar bills to say thank you to the staff who work endless hours always with a smile, constantly going above and beyond to serve. They make next to nothing per hour and never complain. We’d give Juan a couple dollars for cheerfully and perfectly making our omelets, our waiter a couple for being so attentive, housekeeping a few for pampering us… you get the idea. You will be treated like royalty weather or not you choose to tip. But the joy you get from giving just a little back is… well, like the commercial says…Priceless! If you can, please consider bringing a few extra dollars to show your gratitude. They know they work at an all inclusive so no one expects anything, but they are so grateful even for the smallest amount. We have been to a handful of resorts, this was our first time at Excellence. We are sold, we’ll never go anywhere else! Once the word gets out, The Excellence Plays Mujeres will be the toast of Cancun!", "title": "Potential to be the best in Cancun!", "helpfulness": 25, "user": "Enachi", "date": "December 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11880490, "likes": {"liked": "— quality of food, grounds, people - both employees and other tourists", "disliked": "— noise in room - occasional poor service during lunch hours"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "we just returned home from a one week stay at the new excellence resort in playa mujeres....yes its gorgeous but the food is really bad....nothing was fresh...everything is frozen...the meat is tough and the shrimp are tiny and mushy. not worth the money unless youre gonna drink all day.", "title": "beautiful resort with bad food", "helpfulness": 3, "user": "nytraveller63", "date": "January 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 12697298, "likes": {"liked": "— beautiful room", "disliked": "— really bad food"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Just returned from possibly the best vacation ever at EPM. Up until our trip, I have been checking other user reviews here and wanted to return the favor to other Trip Advisor junkies.", "title": "Jan 8 - Jan 15", "helpfulness": 31, "user": "glamstarr", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12692224}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The hotel itself is absolutely immaculate. Although there is still construction in progress, you barely even notice. Workers are very busy keeping up the grounds all the way down to polishing the wood trim on the outside of the buildings. All of the gardening is quite fresh, so none of the plants are mature at this point.", "title": "loved the resort...can't wait to return", "helpfulness": 18, "user": "ree1161", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12668622, "likes": {"liked": "— The Rooms Were Exquisite!!! Roof Top Terrace Gorgeous", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The beach is gorgeous! We have read a lot about sea grass being a problem. The sea grass has been cleaned up and you can go out into the water to just above waist deep before getting to a roped off area where the grass begins. The water is very calm without any waves.", "title": "Excellence...working up to its name", "helpfulness": 20, "user": "angelinmichigan", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12619321, "likes": {"liked": "— Beautiful resort", "disliked": "— Inconsistency in service"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "There are many pools in the resort. Each building has its own pool or river meandering around the building. There is wait staff during the day delivering cocktails and food so you never have to leave your spot.", "title": "A Lovely 3 Star Resort", "helpfulness": 4, "user": "maddmatt212", "date": "January 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 12491587, "likes": {"liked": "— In-house entertainment surprisingly good.", "disliked": "— Having perfume stolen from the room."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We had a really nice time. There were the same little irritants that some have mentioned like the closet door didn't close, the power went off every afternoon, and the schedulled card game & bike ride had nobody show. The concierge was able to help & we did get the bike ride, which was very nice - seeing a couple jaguars in a moated area, etc.", "title": "Great bargain for these opening day special prices", "helpfulness": 12, "user": "NVLady", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11703487, "likes": {"liked": "— Great food & service", "disliked": "— Little irritants related to just opening"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Lobster House lobster stew with the (connected) filet mignon from the grill was amazing. Sign up for the hibachi at the Spice (they wait until there are 8 prople). The chef is talented & its a good video photo op.", "title": "Excellence Playa Mujeres, an average 5 star resort", "helpfulness": 21, "user": "Dnibarg", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 11690857, "likes": {"liked": "— The pools, spa, and activities", "disliked": "— The Beach, and inconsistent service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The pool seemed cold to the touch, but you get used to it really quickly & its great to grab a float & meander under restaurant with the drink of the day from the swim up bar!", "title": "Lets keep this place a secret!!!!", "helpfulness": 12, "user": "happyone200", "date": "December 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11640908}, {"rating": 5.0, "title": "the name says it all excellence......", "text": "I also recommend Cancun-Express. You can make reservations before you go & they will wait for you at the airport & pick you up at your hotel for the trip back. Don't be herded to the sides in the airport because they are just trying to sell you trips & timeshares. The cabs are outside,", "helpfulness": 21, "user": "di12383", "date": "December 17, 2007", "id": 11619319}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Where to start! This hotel is in a category all of its own. About 30 minutes drive from Cancun airport, the drive from the airport is not the most scenic, but any concerns are quickly abated when you arrive at the first of three entrance gates to the hotel. It is a large hotel, but so beautifully landscaped. The size means that you never feel crowded by other holidaymakers. Several clean beautiful swimming pools at various locations around the complex. The restaurant choice is fantastic, our favourites being The Barcelona, The Flavour Market, but also Spice and Toscana not far behind!", "title": "surpassed all expectations to make our dream wedding a day to remember", "helpfulness": 13, "user": "joannieBrightonUk", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38342643}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We had a junior Excellence Suite which was lovely with twice daily maid service, Bvlgari toiletries, mini bar restocked daily and great selection of premium drinks. Room service is available with a varied selection from which to choose and it is 24 hour.", "title": "Will definitely return to any excellence resort", "helpfulness": 12, "user": "mariamexico", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 38280981}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "There are daily activities, as stated on the website, and the nightime activities are as you would expect, themed nights for which the staff make a great effort, a very good magician (although I never would have thought this would be my cup of tea!). Several dance shows which are very well organised and a Michael Jackson Tribute show which deserved a standing ovation by all!", "title": "If your looking for a resort to get Married at, this is the place!!!", "helpfulness": 9, "user": "jennjenn73", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38252002}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The beach is lovely, the sea like a bath. There is a fair amount of seaweed washed up but a tractor clears this several times a day. Drinks are brought regularly to you on the beach and there were several days where a bbq was served for lunch. The food was gorgeous so much so that our waistlines have expanded to celebrate! Highly recommend the para sailing, the views of the coastline and colours of the water are exquisite. We also visited the Mayan Ruins at Chitczen Itza, it was a long day three hours each way, but worth the journey. Peter, went deep sea Fishing, which is a passion of his and to say he was excited when he caught a 50lb Barracuda is no understatement! Unbelievable.", "title": "Not For Me", "helpfulness": 20, "user": "2Pugbabies", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 38196994}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "And our wedding day! What can I say? If you are thinking of getting married here all I will say is that it was magical. We moved the time to 6pm from 4pm as it was so hot, that was a great decision. Our wedding coordinator was Yamina who was fabulous, professional, friendly and accomodating especially when we changed our minds on two or three occassions about various things. We opted to get married at the Gazebo rather than on the beach. It was decorated beautifully and following the ceremony we had champagne and wedding cake. They booked our wedding meal at Chez Isobel, where we were treated to our meal in a private intimate function room, which was very romantically decorated with candels and rose petals. On return to the suite later in the evening, a Just married banner was on our door, and our bed was romantically prepared with heart shaped towels and rose petals, champagne and what was left of our cake! The photographer Sebastian did us proud with some lovely photos.", "title": "Excellent Honeymoon at Excellence", "helpfulness": 19, "user": "Jschocolate", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38089440}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 5, "variance": {"poor": 69, "average": 166, "very good": 681, "terrible": 37, "excellent": 3733}, "aka": "Excellence Playa Mujeres Hotel", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Luxury adults-only resort nestled among seven swimming pools on a powdery white sand beach, in a community that boasts a spectacular Greg Norman signature golf course. This jewel of Cancun sets a new standard of luxury for all-inclusives with finely tuned amenities such as one-of-a-kind accommodations including two-story rooftop terrace suites with a private Hydro-Spa pool, meticulous service, gourmet cuisine, an exquisite spa and the signature Excellence Club."}