{"user_rating": 4.5, "review_count": 160, "name": "explora Atacama - Hotel de Larache", "reviews": [{"rating": 5.0, "title": "You need to go!!!", "text": "We have been to several luxury hotels in the past and have never experienced a hotel like this. The personal service, accomodations, food, and activities are amazing. We went during the low season (May), and many of the tours were simply just my husband and I with a guide. Our first hike was to the hot springs, where our guide told us he would have a snack waiting once we got there. We were expecting granola bars and were pleasantly surprised to find a table set up with cheeses, avacodos, proscuitto, fruits, and an assortment of beer and wine in front of a private hot spring. Another day we rode horses and came across a shepherd herding her sheep and some men making adobe bricks. We also saw the sun set over the lunar valley, which was beautiful. However, our favorite excursion was a bike ride to the salt lake, where we floated in the water ala the Dead Sea. Our guide came prepared with bathrobes, and we rode the van back to the hotel. Our room had a gorgeous view of the volcanoes in the distance, however we had very little time to spend in our room with so much to do. Dinner didn't usually start until around 8, which is common in Chile. Before dinner, we would have a drink at the bar, where we learned how to make pisco sours, and would receive appetizers. Also, tour guides would come around to help us choose our tours for the next day. Dinner was always a treat. They chose local foods that were always prepared wonderfully. Why aren't there more hotels like this? We loved it so much that we just planned a trip to go the Explora Patagonia this winter.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "August 19, 2005", "id": 3790477}, {"rating": 5.0, "title": "Luxury in the Atacama", "text": "Stayed at Explora 4 nights, wish we would have stayed longer. Rooms are rustic luxury, great tub and shower. Hotel is beautiful. Knowledgable guides. If you want an active vacation this is it. They will tailor make hikes, bike rides, horseback riding to your level. Service is some of the best we've ever had. A great all round experience.", "helpfulness": 9, "user": "litotra", "date": "August 20, 2004", "id": 2479121}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "When we first arrived at Explora Atacama I was surprised at how plain everything looked but after a little exploring realized that this is indeed a remarkable facility. Our room wasn't spacious but was plenty large enough to accommodate both of us and our luggage. The main lodge is very nice inside and very spacious. The pools looked great but we never had time to use them.", "title": "A great place for an active vacation!", "helpfulness": 12, "user": "travelman1370", "date": "September 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10021345, "likes": {"liked": "— The variety of activities.", "disliked": "— The wait to pick activities at night."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We did four walks: (1) Kari walk (walking through a desert canyon) which was very nice, especially when you're able to take a few minutes and listen to the salt crystals making a crackling sound as they cool. (2) The Cactus Walk, which was probably more interesting than Kari. There is a good deal of walking and you're at a higher altitude but the pace is easy. (3) Bike ride to the salt lagoon. This is a easy bike ride and if you get tired you can always hitch a ride in the van that follows you. When you get to the lagoon you have the opportunity to go floating, which is a lot of fun. But be warned, you must wear something on your feet when you're in the lagoon and you have to be careful of your hands, or else you'll end up with some cuts from the salt crystals. (4) The hike to the hot springs/thermal pools. You can either hike there or else they'll take you in the van as part of another trip. The hike was interesting and the hot springs are just great for soaking. Of course Explora has the best one reserved for their use! Of the outings we did, I would rank them as follows: Salt Lake bike ride number one, the Cactus Walk and the hike to the Hot Springs tied at number two, and the Kari walk as third (but still a good walk, especially good as a first walk to start your time there).", "title": "AMAZING!", "helpfulness": 1, "user": "emmanewell", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10005625, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2004", "text": "In addition to the above we rode horses four times in three days (one time was a lesson). They have some great horses there! Several things to note about horseback riding there: first, they have either English saddles or Chilean saddles, no Western saddles when we were there. Secondly, if you request it, you can get a lesson arranged either as one of your activities or it can be worked in before or after an activity. When we were there I wished I had brought a handkerchief or a bandanna to wear over my nose and mouth. The area where they give the lessons is incredibly dusty, and there are places in the desert where I wish I had one also. Another thing that I wished I had brought: a pocket camera. When we were riding in the desert we were advised not to bring our cameras due to the dust and the movement of the cameras on their straps might bother the horses or us, so we missed some of the greatest shots of the trip. One great thing I did have was a clip that REI and other places sell that clips to your cap and then to your collar to keep from losing your cap when galloping the horses. The best guide we had while riding was Rowena. From what we were told all of the guides love to go horseback riding but some of them more for their own fun than for that of the guests, so be sure to know your limits and be up-front with them about what you can and can't do and don't depend on them to set limits for you. Some of them will let you get in over your head but if you're up for it this is a great place to ride!", "title": "Summer Camp for Grownups", "helpfulness": 3, "user": "kfastuff", "date": "September 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8840848, "likes": {"liked": "— The excursions, the structure, food", "disliked": "— One or two unresponsive guides, but no dealbreakers"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "You need to know that everyone in Chile seems to eat late. Dinners are considered early if they start at 8:00pm.", "title": "Unique Experience", "helpfulness": 3, "user": "UndercoverReviewer", "date": "July 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8230397, "likes": {"liked": "— The food and activities"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Working with the guides: each night you work with a guide to pick the activities for the next day. The idea is you sit in the bar area and a guide will come up to you and help you make your selections. In my opinion this is the weakest part of the Explora Atacama experience. Guests are not taken in the order they arrive in the bar; the guides are infamous for picking and choosing who they go to. Generally, once you've worked with a guide or been on their hike you've got a good chance of them working with you pretty quickly, even if you came in after everyone else. The first night we were there we waited for an hour and ten minutes before someone worked with us, and this was after we complained to the manager twice about the delay (the guides kept going to people they had already met even though they came in after us). To make it worse we were the second couple to have shown up in the bar! It could have been worse, the first couple to show up in the bar were literally the last ones to be worked with, and they were very unhappy about the delay (remember, you're doing this before dinner, so we didn't even walk into the restaurant that night until almost 9:00). Why can't they have a simple system where you sign a list as you arrive and are taken in order?", "title": "Good experience but not exceptional", "helpfulness": 9, "user": "Frank15", "date": "March 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7236990, "likes": {"liked": "— Location", "disliked": "— Room maintenance"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2003, traveled solo", "text": "The hotel is slightly set apart from the town and is a little oasis of peace and tranquility. The hotel is one storey high and built around a courtyard. The rooms are very comfortable but a little dark because the windows arent very big. But there is a huge jacuzzi style bath and the beds are very comfortable. The food was excellent and the staff were very attentive in planning trips that suited your interests. I recommend a trip to Lake Tara - amazing lake with flamingoes surrounded by strange shaped rocks. The geysers are great fun too and the thermal pool are so natural and unspoilt - a series of waterfalls flowing in to different ponds surrounded by reeds. It's a nerve wracking drive down to them though because its very narrow and is a sheer drop to the bottom. The Valley of the Moon is a disappointment though - too touristy.", "title": "Amazing trips", "helpfulness": 3, "user": "Thumbelina2", "date": "March 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7178959, "likes": {"liked": "— The bath!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Not inexpensive, but Explora en Atacama is a terrific family destination and vacation. My two boys aged 14 and 12 participated fully in our two daily excursions and somehow managed not to notice that they watched no TV for 5 days. Explora accomodated their food preferences with grace, specially preparing foods for the lunch time and dinner meals. The other guests were entrepid and convivial travelers. Each excursion was led by one or two guides even as our group averaged about 6 people. Each evening as we returned to our charming accomodations with weary muscles and assuaged appetites, we were greeted by delightful chocolates and the prospect of more fun the follow day. The views were enchanting. I look forward to Explora en Patagonia for our next trip.", "title": "The greatest", "helpfulness": 4, "user": "CarrieATraveler", "date": "September 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5759945, "likes": {"liked": "— Rustic yet sumptuous", "disliked": "— Internet access was spotty at best"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Just returned from 5 nights at Explora Atacama. Spent time at Explora in Patagonia several years ago. The experience was very similiar - the service was excellent at both locations. Our goal was to climb Saire Cabur (6000 meter volcano). Based on our objective, they arranged six full days of excursions for us to get us accustomed to the altitude and vary our experiences. Climbed the volcano without a problem. Since we were off season - we were almost always alone with the guide and a driver on the excursions. Would highly recommend it.", "title": "Great place to stay", "helpfulness": 8, "user": "nycavidhiker", "date": "June 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 5313250}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Unlike Explora Patagonia - which is off by itself in the middle of the national park, Explora Atacama is in the town of San Pedro - so if you want a less expensive option you could easily stay at one of the other hotels in town and hire a guide independently.", "title": "Great experience", "helpfulness": 10, "user": "Marseus", "date": "January 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4360285}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Just stayed for fours nights and it was great. If we had to do it again we would have stayed two more nights since we did not have time to do everything that interested us. I would certainly now book six nights since it is a remote location.", "title": "One word................Awsome!", "helpfulness": 10, "user": "RezaDu", "date": "September 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3840316}], "location": {"country": "Chile", "region": "Atacama Region", "continent": "South America", "city": "San Pedro de Atacama"}, "stars": 4.5, "variance": {"poor": 1, "average": 8, "very good": 20, "terrible": 1, "excellent": 130}, "aka": "De Larache Hotel", "slim_ranking": 0.115384615385, "description": "Our lodge is located on a plain known as the Ayllu de Larache, once inhabited by an ancient Atacameno community. We have respected the original layout of the land and restored and maintained some of the buildings.Opened in 1998, our lodge is situated on 17 hectares (42 acres) of grounds just a few minutes' walk from the town of San Pedro de Atacama. In the area surrounding the lodge, we have maintained the ancient pathways and buildings which form a labyrinth that invites exploration.There are 50 rooms housed in three long buildings, positioned to form a central square planted with large trees for ample shade. On the fourth side of the square is the building which houses the lodge's public spaces. The views from the lodge's broad terraces enable you to enjoy Atacama's vast chain of volcanic mountains.In 2008, we set ourselves the challenge of intensifying your explora Atacama experience, remodeling the furnishings and the indoor and outdoor spaces. Now that the work is complete, we are pleased to be able to offer you new facilities and services."}