{"user_rating": 4.5, "review_count": 294, "name": "explora Patagonia - Hotel Salto Chico", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I planned a stay here at explora Patagonia for four nights but ended up extending our stay for an additional three nights (we were going to head to Puerto Varas at the Lake District). The front desk helped us rebook our flights and was extremely helpful. Since there was no sundries store on site, I had to go to them for nail filer, cotton swabs and band-aids and they were always so helpful.", "title": "Incredible Experience and unparalleled location in Torre Del Paine Park", "helpfulness": 2, "user": "wlslb", "date": "December 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89296036}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "Rosario, the hotel manager during my stay made our time there really memorable. You can ask for just about anything and she will make it happen. The hotel staff and especially the dining staff was extremely attentive and courteous. The food was really good. Breakfast had an extensive choice for those like me who like a heavy breakfast to get me started for the day as well as those who prefer a lighter fare. Lunch was always very good and when we headed out for full-day treks, our lunch was packed for us and our guides carried hot soup and freshly-baked dessert for us (as a surprise). If we were doing half days, there were always health snacks available. Between lunch and dinner, appetizers are served while we pick out what we want to do the next day. Dinner was the highlight, absolutely delicious. I am already missing the quality of food. At the end of the day, it's nice to go visit the jacuzzi and sauna and even there, the fridge is stocked with wines and there are fruits and nuts. My waistline has definitely expanded. Any how, I cannot say enough of how great our stay here. We are looking forward to returning as well as visiting the explora on Easter Island in the future.", "title": "Most Beautiful Sight in the World", "helpfulness": 2, "user": "ewilkens", "date": "November 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86365989}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "By the way, the weather varies tremendously and the wind was extremely strong during this time, so the trekking poles came in really handy!", "title": "Worth the Trip.", "helpfulness": 1, "user": "GregandRobin", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79928356}, {"rating": 1.0, "title": "Accounting Department: Disgrace to the Hotel", "text": "Explora was an experience I will never forget. What a beautifully situated hotel! Nothing compares for me. The rooms were amazing;the food excellent.", "helpfulness": 5, "user": "GerogeY", "date": "August 29, 2010", "id": 77381144}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "For people who don't hike like me....there needs to be alternatives...like boat trip on lake, visit to Grey Glacier etc.", "title": "Hold on to your hat - this place is great!", "helpfulness": 1, "user": "winetripper", "date": "May 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65540994}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Everything about explora was incredible - the jaw-dropping location in Torres del Paine, the comfortable rooms, the outstanding food & wines, the quality of the guides and hotel management, etc. Yes, it is expensive, but we felt that what we received was well worth it. We had looked at several options to do the W trek (none of which were inexpensive), and realized that we could do most of the trek from explora and also do some alternative treks (in small groups with great guides), while coming back each evening to great food and hot showers. We loved the way the guides go around and talk to each guest individually each evening, to explain the options for the next day. Torres del Paine is one of the most spectacular places we have ever visited, we are on a long trip and it is one of the highlights, truly unforgettable.", "title": "Amazing hotel in one of the most beautiful places in the world", "helpfulness": 1, "user": "TracyWT", "date": "December 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51788442}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed here as part of a trip around South America. It was probably the highlight and we stayed in some fantastic places. The hotel is in the national park, literally in the middle of nowhere. It looks directly out on the Towers, overlooking the lake. I've attached a picture, it really is that beautiful. We went in June when it's winter and not busy and it couldn't have been more perfect, we virtually had the place to ourselves. The place is expensive but worth every penny. The front rooms have picture windows onto the mountains and lake and you can even see the mountains from the bath. The rooms are comfortable rather than luxurious and every thing was perfect. The staff are amazing, knowledgeable, warm, friendly and accommodating. We had a few cloudy days but this just added to the mystique of the place. They have their own stables, we drank tea with the gauchos, went riding, walking and ate the most amazing food (we had an unforgettable picnic right by the glacier) among some of the most beautiful, remote scenery in the world. We will definitely visit the other Explora Lodges if the quality and location of this one or indicative of the others. A truly amazing experience as opposed to a place to stay, we will have amazing memories forever.", "title": "One of the most beautiful, remote, perfect places in the world......", "helpfulness": 1, "user": "Campbell554", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50470963}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "If you can afford it go here, nothing else in the park compares. Amazing location, pretty decent food and plenty of variety for your trekking and/or horseback riding. Everyone there is very nice and accommodating (perhaps too accommodating to a specific German couple). Overall, I second everyone else who has written that this is an experience not to be missed, as long as you are OK shelling out the $$$. And yes, the internet is slow, but you are in the middle of nowhere on vacation, so why are you checking email anyway?", "title": "So expensive yet SO good", "user": "jersey1977", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50453113}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My wife and I have traveled extensively in nearly every continent, and this experience was one of the best of the best.", "title": "One of the best of its kind worldwide", "helpfulness": 3, "user": "BSOfan", "date": "November 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50174298}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "We stayed for 5 days/4 nights in November, 2009, in a \"standard\" room. The interior of the room was comfortable and well-appointed, but nothing special; the view out the window was mind-blowing, with changing beauty in rain, sun, cloud, twilight (lasting to 11 pm).", "title": "Best place in Patagonia", "helpfulness": 1, "user": "meikebracht", "date": "November 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50150081}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I love the explora. The staff, food, views, guides, staff, hot tubs, drink and experience was fantastic. Whilst it does seem dear the drink is a really good quality food and drink (chilean champagne available even in the hot tub), the quality of the guides and tours make it good value.", "title": "Please can I move in", "helpfulness": 2, "user": "JennyI11", "date": "April 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7342194, "likes": {"liked": "— The hot tub!", "disliked": "— That I had to leave."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "my stay at explora was a study in god and bad. the views, grounds. staff ( with one notable exception) and proximity to the park were very good: the value for the money was extremely bad. it is a very expensive place. for the money the room, facilities and food should have been much better.", "title": "mixed feelings", "helpfulness": 5, "user": "edglickman", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 7278451, "likes": {"liked": "— the park", "disliked": "— no value for the cost"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "I had a delightful four night stay at Explora Patagonia in late January, 2007. I highly recommend the hotel.", "title": "A well run hotel and a great experience", "helpfulness": 11, "user": "OrrvilleRedRider", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7259717, "likes": {"liked": "— The privileged postion on Lake Pehoe", "disliked": "— The long transfer -- the transfer in was fine; having to do it again on the way out tiring"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My family and I had stayed at Explora Atacama in 2002, and very much enjoyed that stay. As a result, I planned for Explora Patagonia to anchor the final 4 nights of my 45 day trip to Patagonia, since I wanted to “finish strong.” I was not disappointed.", "title": "Brilliant experience", "helpfulness": 2, "user": "Frank15", "date": "March 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7237010, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Others have adequately described the hotel, its privileged postion overlooking Lago Pehoe, and somewhat long transfer to get to the hotel. I’ll limit my comments to why I liked the hotel.", "title": "Awesome - and we loved the plane ride there", "helpfulness": 6, "user": "Family.Phillips", "date": "March 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7229000, "likes": {"liked": "— The views"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007", "text": "The Explora Patagonia is a wonderful experience for so many senses. Its location in the center of Torres del Paine National Park in southern Chile is extraordinary and the views from the hotel to the lake and peaks have to be the best in all of South America. The staff is friendly, and speaks English. The food is excellent. The guide staff is outstanding and many trips around the park are offered every day. The only drawback is the cost, the hotel is extremely expensive.", "title": "Excellent Hotel Experience, Very Expensive", "helpfulness": 3, "user": "GalenaGuy", "date": "February 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6751413, "likes": {"liked": "— Guide staff and their daily expeditions", "disliked": "— The cost"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "This was the highlight of our 3 week holiday in Chile, we absolutely loved it. The views from our bedroom window were stunning and the room was by no means small. The room we thought was great, even the loo had a great view! The bed was very comfortable and everywhere was super clean.", "title": "Excellent, worth every penny!", "helpfulness": 11, "user": "Barbarasnell", "date": "December 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6505072, "likes": {"liked": "— The views and the activities", "disliked": "— Nothing to dislike"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The food was on the whole excellent, we only had one meal that was a bit so-so, but perfectly acceptable. Breakfasts were massive with eggs, bacon etc cooked to order. The only minor criticism you could have was that if you chose to eat at peak times - then the waiting staff were a tad stretched, but we had no great rush to go anywhere, so we just waited a while, watched the light changing on the mountains and went in to dine a bit later. The staff in the dining room were very friendly and did their utmost to make sure that you had everything you wanted.", "title": "Disappointing, however beautiful", "helpfulness": 14, "user": "Vancouverites", "date": "December 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6349475, "likes": {"liked": "— The view of the Torres del Paine!", "disliked": "— The food, small room, no reading light, unpredictable quality of excursions, bad service, horrible food."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The activity programme was superb. Every evening the guides would meet you to help you choose activities that suited you. Their advice was good. We did two full day treks, one to the Grey Glacier, which I think most people do. We were surprised by how many othere people we met that day, but I suppose it is part of the \"Circuit\". It was a long trek, but by no means difficult. Katarina was one of our guides this day - she is brilliant, so enthusiastic and she kept us all together really well. The next day we spent the morning walking at the edge of the park looking for wildlife, the condors were fabulous! This was followed by a BBQ lunch and then an afternoon horse ride - for beginners, which we are, but it did make you realise how good it could have been if you were more skilled, watching the wildlife from the back of a horse was a great experience.", "title": "Exceptional stay", "helpfulness": 3, "user": "sipivu", "date": "December 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6343885, "likes": {"liked": "— the attitude of the entire hotel team and of the guides", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The last day was the best, there were only three of us plus Sebastian the guide. We did the Alturus del Toro walk which takes you up and up until you have a 360° view of the park from ice fields to wonderfully coloured lakes and rivers - spectacular. The wildlife was wonderful and the flowers amazing, Sebastian was excellent, really knowledgeable and kept a great pace, manageable whilst giving you time to admire and take in all that you saw.", "title": "You really do get what you pay for …..7 stars", "helpfulness": 5, "user": "NoAlliances", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5188547}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Food was hit and miss, some delicious, some inedible. Staff mostly very kind with a few exceptions. Rooms are small. Front desk staff is nice but lazy. Staff tries too hard to get you to take their tours and don't seem to understand the concept of wanting to take it easy and take in the location. The spa is wonderful and the location is beyond compare. I can't imagine a prettier place.", "title": "Beautiful Isolation", "helpfulness": 2, "user": "reallypickylady", "date": "May 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 63456207}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We have travelled extensively and Explora Patagonia is one of the best experiences in the world. This was our second visit and we stayed for 8 days both times. That says it all and we loved every minute. We only repeated a couple of hikes and that was out of choice as we wanted to see the Grey Glacier again and also feast once more at the BBQ at the Quincho.", "title": "One of the best experiences in the world", "helpfulness": 4, "user": "BT22", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62369153}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We agree with all the superlatives of the recent reviews; it is a luxury base to explore the Patagonian wilderness in style.", "title": "Explore the rugged wilderness in luxury", "helpfulness": 6, "user": "CuriousD", "date": "April 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62317003}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The Explora Patagonia is an experience not just a hotel.", "title": "One of the most beautiful place on earht", "helpfulness": 1, "user": "supersayan4", "date": "April 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61752560}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Wow, what a place. A stunning experience in every way. The hotel is located in one of the most beautiful parts of the world. We had a stunning room with a breathtaking view of both the massive mountains, the glacial lake and the water fall, which we enjoy from one of the most comfortable beds I have ever slept in. The rooms are lovely, warm and cosy. The bathrooms are fitted with jacuzzi style baths, which is perfect after a long day's hiking or horse riding.", "title": "Best place in Patagonia-Chile", "helpfulness": 3, "user": "igaldu", "date": "March 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57997399}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "Loved every minute of it.", "title": "Great Hotel in a spectacular location at the end of the world", "user": "PasadenaCATraveller", "date": "March 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7199885}, {"rating": 4.0, "stay_parameters": "Stayed November 2003, traveled solo", "text": "Highlights:", "title": "Long drive but its worth it", "helpfulness": 1, "user": "Thumbelina2", "date": "March 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7178947, "likes": {"liked": "— The views", "disliked": "— The staff"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "- Location, location, location. The views and surroundings are too amazing to describe.", "title": "Worth every penny", "helpfulness": 6, "user": "elien", "date": "March 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7009505, "likes": {"liked": "— everything!", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2003, traveled as a couple", "text": "- Tourguides & Gauchos. All of them were highly educated, personable young people, and we greatly enjoyed our days spent with them.", "title": "the end of the earth!", "helpfulness": 2, "user": "CSB100", "date": "February 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6814536, "likes": {"liked": "— the scenery", "disliked": "— getting there"}}, {"rating": 5.0, "title": "Sod the cost just go", "text": "- Activities. In this all inclusive resort, choosing from the vast array of options is one's biggest problem. We horseback rode and hiked, had only the best experiences.", "helpfulness": 2, "user": "bothredsofakind", "date": "February 16, 2007", "id": 6802443}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "When you go to Torres del Paine National Park, you expect to be sorrounded by the fantastic nature.", "title": "This is not a hotel - it's a luxury camp base!", "helpfulness": 2, "user": "Filipa_Campilho", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56874555}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I knew I was going to have an active stay, but nothing prepared me to the overwhelming experience the Explora offered.", "title": "It does not come better than this.", "user": "Foliat", "date": "January 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54678942}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "They receive the guests with this sentence: \"this is not a hotel, it's a camp base!\"", "title": "Stay for 8 days - there's so much to see & do in Torres del Paine park!", "user": "CathySeattle", "date": "January 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54276683}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "But not a regular camp base, where you departure every morning to your trekkings, walks or rides. It's a luxury camp base, where you have great food, comfortable rooms with astonoushing views, well prepared and friendly staff and most of all, experienced guides.", "title": "Incredible lodge at the end of the world - luxurious hiking", "helpfulness": 1, "user": "JohnSFDC", "date": "January 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 53806717}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "They have a lot of different daily programmes, which cover every age & physical preparation.", "title": "Amazing", "user": "PaulSaraLondon", "date": "January 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52729084}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "If you want an active vacation, this is the place. The emphasis here is on \"active\"; while we were staying there a tour group came through with people who were not physically able to have an active vacation and I honestly don't know what they did with their time. The Explora is located way away from anything else so there are no activities available that they don't plan or supervise.", "title": "Great vacation for active people", "helpfulness": 8, "user": "travelman1370", "date": "October 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10026866, "likes": {"liked": "— The amazing view.", "disliked": "— Having to wait around to work with the guides at night to plan the next day's activities."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled with friends", "text": "The Lodge itself is very nice but the rooms are not large or even spacious. Once you get your luggage unpacked you're probably going to find that you're a bit cramped for space (if there's two of you in the room) but it doesn't matter much as you probably won't spend much time in the room. Don't scrimp, get a room that faces the lake and mountains, it's worth it.", "title": "Best vacation of my life!", "user": "w0rldwanderer", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10016845}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We were there in March and, unfortunately, almost the entire time we were there it rained and the wind howled (literally). Thankfully we had come prepared for it and had a great time hiking and once or twice almost getting blown to the ground but it was worth it.", "title": "Woderful", "user": "eclipseUK", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8607858, "likes": {"liked": "— arriving", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Things I was glad I had with me: pull-on waterproof pants (I used my ski pants); waterproof lightweight jacket, good hiking boots, sense of adventure, mittens, camera, and my motion sickness bands (wrist bands that help stop motion sickness, more on this later). Also, good hiking boots, a daypack, and the lightweight safari type pants. We were told to wear the safari type pants on the hikes instead of jeans; if your jeans get wet they aren't going to dry out but the lightweight safari pants will.", "title": "A World Apart", "helpfulness": 2, "user": "kenokids", "date": "May 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7656853, "likes": {"liked": "— Attention to detail from staff and facility", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "What I wished I had brought with me: I wish my waterproof jacket would have had a decent hood that would stay on my head in the wind; the hood was cheap so I couldn't adjust it tight enough to keep it from blowing off. I also wish I had brought a cap that covered my ears; I had to buy one at the Lodge gift shop and it was EXPENSIVE but worth the money.", "title": "Worth every penny - really!", "helpfulness": 7, "user": "Flourpower", "date": "May 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7646225, "likes": {"liked": "— the guided walks and the views", "disliked": "— er . . ."}}], "location": {"country": "Chile", "region": "Magallanes Region", "continent": "South America"}, "stars": 4.5, "variance": {"poor": 5, "average": 8, "very good": 31, "terrible": 9, "excellent": 241}, "aka": "Explora Patagonia Hotel Salto Chico", "slim_ranking": 0.1, "description": "Our lodge is located right at the heart of the extraordinary Torres del Paine National Park in central Patagonia. The varied and untouched landscapes of this area led UNESCO to declare it a biosphere reserve.Our Patagonia hotel lodge opened in 1993 on the banks of the Salto Chico waterfall. It affords an excellent view of the unique Paine Massif and two of the three impressive torres, or towers, which give the park its name.The lodge has 49 rooms and a variety of inviting spaces. Situated on a 3-hectare (7.4-acre) site, the design borrows certain organic forms from the landscape itself, adapting to it with simple elegance. It was designed to create a dialogue with its environment, putting human beings in touch with the sublimity of their surroundings.For travelers, the lodge provides the welcome surprise of comfort in a remote area; nonetheless, you are not isolated from nature, but placed “within” it."}