{"user_rating": 3.5, "review_count": 61, "name": "Eyre Square Townhouse", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The man on the reception desk was really helpful in telling us the best place to park nearby and answering various other questions we had for him. The rooms were very clean and finished to a very high standard but the one we had was a bit too small. The shower was amazing though.", "title": "Good service but a bit small", "user": "Cobweb82", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 39994730}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "For the price I think it was a good choice.", "title": "Great Location", "helpfulness": 1, "user": "surlie", "date": "July 28, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 36047439, "likes": {"liked": "— Location"}}], "location": {"country": "Ireland", "region": "Western Ireland", "continent": "Europe"}, "variance": {"poor": 8, "average": 6, "very good": 23, "terrible": 6, "excellent": 18}, "aka": "Eyre Square Townhouse Hotel Galway", "slim_ranking": 0.556756756757, "description": "In the center of picturesque Galway City, Eyre Square Townhouse is a 2-minute walk from the train and coach stations. Each room has a flat-screen TV and free Wi-Fi is available. All of the stylish rooms have comfortable beds and modern private bathrooms with a power shower. There is a computer with a free internet connection in the townhouse for guests to use. The award-winning Revive Cafe and Bistro is on site, serving fresh organic produce in relaxed surroundings. The Eyre Square Townhouse is located close to the many shops, bars and restaurants that lively Galway has to offer. The Eyre Square Townhouse includes 2 floors and there is no elevator. As this is a city center property, some street noise is to be expected. The Eyre Square Townhouse is a city centre guesthouse and all our rates are on a ROOM ONLY basis."}