{"user_rating": 4.0, "review_count": 225, "name": "Fairfield Inn Seatac Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed one night before catching a flight out of Seattle. The staff was very friendly and helpful. The Shuttle Service was fantastic. It was great not having to call for a taxi or walking. They picked us up, after checking in dropped us off at a Dave's, got us to the airport the next morning on time (3:30 AM). I didn't like the fact the vanity area was in the room and not in the bathroom. The bathroom (shower & toilet) area was very small. The hotel seemed like it needed some freshing up or something. For one night and the shuttle service, it was great for what we needed.", "title": "Excellent Shuttle Service and Staff", "user": "Crystel H", "date": "July 21, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 168408566}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I noticed in one review the person mentioned they were misleading concerning the parking, but if you've stayed much in the Seattle area, then you know a lot of places charge to park. Some of which require you to park in a garage. They do have on-site parking for their hotel guest. I can understand why they don't allow parking for cruises with the limited space they have.", "title": "Alaskan Cruise", "user": "terri k", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167942066}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We used points so I can't comment on the price.", "title": "A bit misleading", "helpfulness": 2, "user": "mish1025", "date": "July 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 167686186}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Hotel was great! Shuttle to take us to the ship port and pick up when returned. They had our room ready at 9:30 in the morning after our cruise. This was great because we were TIRED! Got great info on using the light rail train. Called to book a room before cruise and after. The man I spoke with was very nice and informative. He told me to call back with any more questions I had. I didn't book by phone but online. I did call another hotel but got a person who didn't seem to want to speak with me or answer questions. All the people I came in contact with at this hotel were great! Thank you to all at the Fairfield Inn!", "title": "Good solid experience.", "user": "kksdad431", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167328439}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Our family decided to stay at Fairfield Inn Seatac based on the fact we were driving to Seattle and then doing a cruise to Alaska. My confirmation read: Cruise Transportation, Continental breakfast for 2 guests daily, 2 way transfer, see Rate Rules, Complimentary on-site parking. It was my understanding then that I would arrive at the hotel, stay, eat breakfast free, get a free ride to the cruise terminal, go on my cruise, get a free ride back from the cruise terminal, and go about my business. When I checked in they were shocked that I had intended on leaving my car there for the week. They said that wasn't part of their package as they have limited parking (no where did I see mention of this). As they were telling me they didn't have room for my car in their parking lot, they then said that I didn't pay for a package that included parking. I suppose you're right because your website boasts \"complimentary on-site parking\" and since I got the cruise package and I didn't get the airport transportation that was a different package it was clear that I had a vehicle. Their story then changed as they said their park and cruise packages were sold out. Then in the next breathe they had some packages, but I had to pay more. It rubbed me the wrong way how the information was presented and then essentially a bait and switch happened as I was checking in. Perhaps better prepared and knowledgeable staff when booking, or more clear instructions on the website to clarify would be a resolution. No thank you in the future, I'll go with a hotel that is more upfront and clear next time.", "title": "Just okay", "user": "runningpill", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 166995086}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Stayed here the evening after our cruise and before heading home. It is a pretty standard Fairfield from the decor perspective. Clean and serviceable. Breakfast and Wifi is included.", "title": "Good hotel for after cruise", "user": "kms31671", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166905857}, {"rating": 5.0, "title": "Great value for cruisers!", "text": "There was a shuttle that not only took you to the airport, but also to surrounding restaurants...which was a nice touch.", "helpfulness": 1, "user": "ClaraBel3", "date": "July 2, 2013", "id": 166074949}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We purchased the cruise package and what a deal. They will bring you to the cruise dock and pick you up from the dock. We arrived in Seattle early one morning and called the hotel to pick us up. Christina was working the desk. She called housekeeping and got a room cleaned for us A.S.A.P. The hotel drove us to the lite rail system and picked us up when we returned. The staff is great. The hotel will also shuttle you to restaurants in the area.", "title": "Nothing special", "user": "dani42379", "date": "June 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 165547730}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This hotel has been totally remodeled! The carpet, bed and bedding, curtains, everything is new and refreshed. Now people this isn't the Four Season's, but it is very nice", "title": "Super Hospitality and Accommodations", "helpfulness": 1, "user": "Shelly D", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165261027}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "When we returned from our cruise, there was a representative from the hotel to meet us and other guests. Our shuttle was to pick us up at 9:00, but we disembarked at 8:00, as did a few other guests. The rep called for the shuttle. Some guests were going to the airport and some of us were going to the hotel. When we arrived at the hotel Christina immediately worked her magic and got six rooms cleaned for us. We were never told we couldn't check until later that afternoon. She asked us to give her a few minutes and please be patient and she would get our rooms ready. They will also be happy to shuttle", "title": "Simple & Average", "user": "JonnyBlaze777", "date": "June 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 165250823}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Loads of tourists visiting Seattle in the summer on tour buses. Was originally on the bottom floor, but the upstairs guest was noisy so I switched to the top floor. Staff is accommodating. Shuttle bus running to the airport is convenient. Don't forget to walk to Angle Lake on a nice day.", "title": "Busy Hotel with Accommodating Staff", "user": "dnumgis02", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 172120561}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed here for 3 nights. Every day the breakfast was pretty good except that the dining area was for the size of the hotel, pretty small. We must have come down everyday at the busiest time as we usually sat out in the lobby with our food and one time on the bench outside in front of the hotel. This place is busy. Lots of pre and post cruise people that were coming and going to Alaska. The rooms were nice, clean and were made up everyday very nicely. Traveling as a family we usually asked for more towels than they gave us (2 or 3 sets), once we tried to write a note, placed it on the bed with the usual daily tip, but either they can't read english, our handwriting or ignored it as we just got the same number of towels.", "title": "Busy Busy", "user": "Travlholic", "date": "August 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 170645298}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "Anyway, this was small compared to the always available coffee, tea and hot chocolate. They were very helpful in arranging a town car for our transportation and late check out. Our room on the 4th floor was basically quiet, no road noise, clean and comfortable beds. Want to recognize Stephanie as she was very professional, and knowledgeable about the area. Tip look for the luggage carts that don't have flat tires if you have a lot of baggage because it will be really hard to push. Expect that your sink, wash up area will be out in the bedroom area, only the toilet and shower/bath is behind a door.", "title": "Nice for area, low end for Marriott", "user": "David_from_Puyallup", "date": "August 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 170523939}, {"rating": 1.0, "stay_parameters": "Stayed July 2013", "text": "Nice easy place to stay for quick layovers in Seattle Airport. Loyal Marriott member but this was little substandard for them. Rooms fall more on the inn side then the suite side. Bathroom sink is basically in you bed room area. Pretty noisy too. At least the night I stayed. Lots of people in hallways talking. Doors SLAM shut rather loud.", "title": "Bad Experience", "user": "Jenvinc", "date": "July 31, 2013", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 170090402}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Also needs much better signage out front. All the hotel signs are hidden by trees. Had to go down the road to make one of two u turns since I missed the driveway the first time. Limited parking.", "title": "Basic with good service", "helpfulness": 1, "user": "laenie", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 169447600}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "We took a train from Seattle to the airport where a shuttle was supposed to take us to the hotel. Shuttle never showed up. And they never answered the phone. So my mom and I ran 2 miles with my suit case to the hotel while my siblings and dad waited with the other suitcases. They had to take another bus. It turned out that their phones were broken, which they were unaware, so that wasn't their fault. Their wifi was only good in the lobby wasn't strong in the room. Breakfast was good. But their customer service was fantastic when we told them that their phones weren't answering. They didn't make any excuses.", "title": "Broken phone", "user": "Don S", "date": "June 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 164647447}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This hotel was just a regular Fairfield hotel. The stay was nice and the front desk was very friendly. The gym was quite small but typical of a hotel like this (one treadmill, one elliptical, weights). Breakfast was good and free! All in all, I would probably stay at a different hotel in a better area that offers more to do and see.", "title": "Regular Fairfield experience", "user": "embee09", "date": "June 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 164631341}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We stayed at this hotel the night before embarking on a cruise. We usually always stay at Marriott hotels because of the quality of the rooms and the amenities. This hotel had some problems while we were there. It might just have been because it was so crowded but the hotel should really be prepared for those kinds of things.", "title": "Hotel had some problems while we were there", "user": "retired605", "date": "June 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164511476}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The free breakfast in the morning was nonexistent. We went down a good 45 minutes before breakfast was to end and there was literally nothing to eat and nothing was replenished before the end of the breakfast time.", "title": "Dated and worn", "user": "DJSpinDoctor", "date": "June 18, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "location": 3.0, "value": 2.0, "rooms": 3.0}, "id": 164440644}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We had walked to a restaurant the night before - Sharp's Roaster and Ale House - and passed many other hotels up and down International Blvd. so there are a lot of choices out there.", "title": "3 star hotel with a 5 star staff", "user": "davsuze", "date": "June 11, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "location": 4.0, "service": 5.0}, "id": 163725332}], "location": {"country": "United States", "city": "SeaTac"}, "stars": 2.5, "variance": {"poor": 14, "average": 61, "very good": 88, "terrible": 7, "excellent": 55}, "aka": "Fairfield Inn Seatac Airport Hotel Seatac", "slim_ranking": 0.411764705882, "description": "The Fairfield Inn by Marriott Seattle SeaTac Airport is located 1 mile South of Seattle Tacoma International Airport with easy access to I-5 and I-405. We offer 24-hour complimentary shuttle to and from Sea-Tac Airport. Courtesy phones are located on the 3rd floor of the parking garage. Enjoy our complimentary continental breakfast, featuring our delicious Ham, Egg and Cheddar Breakfast Quiche, Jimmy Dean breakfast sandwich and our build your own Belgian waffles. Enjoy all that Seattle has to offer; Seattle Space Needle, Pike Place Market, Mt. Rainier and the Boeing Museum of Flight, just to name a few. We are only 12 miles from Safeco Field and Centurylink Field. We do offer Park n Fly Packages."}