{"user_rating": 4.0, "review_count": 43, "name": "Fairfield Inn & Suites Anniston Oxford", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "The rooms are clean and the pool is nice. They serve snacks and beer every night in the lobby and the continental breakfast is above average. Oxford is a pretty miserable place, but the location of the Wingate is great. There is a large variety of restaurants within walking distance and a decent shopping center on the other side of I-20.", "title": "Nice Place in Oxford", "helpfulness": 1, "user": "Corpuscle", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8449495, "likes": {"liked": "— Friendly staff, great location."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "My daughter and I attended a concert in Birmingham and stayed at this Wingate. It is about an hour's drive from Birmingham and right off I-20. We got a weekend rate of $66, which is outstanding for this class of motel. I can't think of a thing that was wrong. Staff was friendly, room spotless, breakfast delicious: homemade waffles, yogurt, eggs, etc. Huge room. Will definitely go back.", "title": "Great Weekend Getaway", "helpfulness": 2, "user": "iamtravelinpam", "date": "April 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4894974}, {"rating": 4.0, "title": "Found a new favorite place to stay", "text": "We have found a new favorite motel-chain. Our first impression was at check-in. Staff was VERY personable and helpful. They even apoligized for the noise from the lawn being mowed and told us they would be finished in 5 minutes!!!!!The rooms are very well designed and comfortable with all the amenities of home (frige, microwave, coffee pot etc)and very clean.We are planning a trip out west in the fall and will stay at as many Wingate Inns as we can find.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 28, 2004", "id": 1844456}], "location": {"country": "United States", "city": "Oxford"}, "stars": 3, "variance": {"poor": 2, "average": 5, "very good": 18, "terrible": 1, "excellent": 17}, "aka": "Fairfield Inn Oxford", "slim_ranking": 0.277777777778}