{"user_rating": 4.0, "review_count": 82, "name": "Fairfield Inn Detroit Farmington Hills", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I stayed at the property on 3/22. The property was clean and the internet was free as was the yummy breakfast served in the morning. Also, in a time where many companies no longer see excellent customer service as a necessity, the staff went out of their way to make my stay comfortable. Special thanks to Izak for providing such excellent customer service.", "title": "short stay", "user": "I-muhammad", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 155490794}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I had a great time staying at this hotel. Izak made me feel welcome and as a gold member I really appreciated it. Breakfast was excellent, my only advice is to get down there early because it gets packed. The pool was clean and very warm, so the kids will love it. The hotel staff is on top of everything from making sure you have everything to taking care of noise complaints quickly and discreetly. Jarilynn was great to and provided excellent customer service.. Overall, this was a great stay and I would stay there again. This hotel is definitely a hidden gem in Farmington Hills.", "title": "Great Stay!!!", "user": "Mike_W50226", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 155465130}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I stayed here from mid Feb 2013 - Mar 2013 with my co-workers Doug F. and Erik P. We were all on an assignment for our employer and were spending a lot of time away from our homes and families. The staff made us feel welcome from the start and right at home. Sylvia (ladies first), Julian and Izak are all first class all the way!!!! As stated in Doug's earlier review, they were always to point out a good place to eat or shop. So far they've never led us astray", "title": "They treat you like family", "user": "Thomas S", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155153626}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The premises and the rooms were always clean and welcoming (hats off to housekeeping). The meals that are provided (breakfast daily and dinner Mon - Wed) are a nice perk and they are quick to refill any items that start to run low. They also have a nice fitness center and a pool available if you need to work off some calories, or just burn off some steam. As another added benefit, there are usually fresh cookies at the front desk.", "title": "Outstanding Hotel!", "user": "Oh_Piggy", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155102233}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I would definitely recommend this place to anyone who is coming in from out of town and is looking for a nice place to stay. Kudos to the management for putting together such a great team of people..", "title": "Clean, nice perks, and Great Staff", "user": "Doug F", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155016826}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "My family and I stayed at three different rooms in three hotels in Detroit in July and August. First we stayed one night at Embassy suites close to Detroit Metro airport, then Residence Inn by Marriott Troy in Madison Heights and finally Fairfield Inn and Suites in Farmington Hills", "title": "Three hotels in Detroit", "user": "screenname060309", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 173094685}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Something that was unknown to me before travelling to Detroit was that there are perhaps tens of districts and small cities in Detroit. Trip advisor does not help for those of us Europeans who do not know this and search for hotels in “Detroit” only. There are also many hotels from the same chain in each county making it all very confusing.", "title": "Great Stay - Great Staff", "helpfulness": 1, "user": "sonnyjr", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168954818}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "We stayed for one night at Embassy suites before renting a car and going to Toronto. My info from Embassy suites is therefore very limited. The hotel was old and at 4 am suddenly the fire alarm went off. No explanations to the reason and you can guess how we felt travelling from Sweden. The hotel pool is both indoor and connected to outdoor. The water in the pool was cold and not cleaned. Breakfast was good and with multiple choices. You can have your omelet made for you. Rooms were old. I loved the small garden as it was the first time in my life I saw a humming bird close to me. Our room faced ventilations and was really noisy. This hotel has free shuttles to the airport. The shuttles for all hotels are close and call the hotel after you passed through all controls because it juts takes the driver 10 minutes to come to the airport.", "title": "Would definitely return!", "user": "Carla1992", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167652200}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "After coming back from Toronto we stayed at Residence Inn for 13 nights. We had booked this hotel via Hotels.com for three weeks and though we booked with possibility of cancellation we misunderstood that we can even shorten our visit. This was due to problem with hotels.com info. This hotel is old and in desperate need of renovation. The breakfast is ok but the breakfast lady during weekdays makes very watery waffle batter and stops you from using the machine. The housekeeping is the worse I have seen in US. Despite the house manager whose name I have forgotten promised to check our two rooms, they were not cleaned by any standards. Everyday shampoos or something was missing and we had to go and ask for it. The pool is outside and cold and in contrast to the other two hotels there is no Jacuzzi. There is however a gas grill and basket field. No gyms. The price for laundry is higher than Fairfield Inn. The TVs are not working. Nine of the channels were having problems. Having a small kid made all the difference and therefore we moved. We talked several times to the manager and he could not fix it. At the end we asked for discount and he discounted one night which we thought was two low, basically meaning 3% for the two rooms we had rented. We therefore moved to Fairfield where the hotel was better and 30 dollars per night cheaper! This hotel is the only one with kitchen.", "title": "Sylvia, Sylvia, Sylvia!!!", "user": "TLCarrier", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165881614}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We checked several other hotels. One was Fairfield Inn which was much closer to where we wanted to go. Sylvia at the reception was extremely friendly and helpful. The water temperature in the pool was very pleasant, the type you just can get into without needing to warm up. There is jacuzzi and good breakfast with few more choices though not like Embassy suites. No free dinner on some nights like Residence Inn. Clean and quite rooms. This hotel is not available on hotels.com. Enough breakfast place unlike Residence Inn. None of the hotels have in room safes, which was not nice. All had very fast internet connection.", "title": "Excellent Hotel. Great Service!", "user": "Ali M", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 165361596}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The staff in this hotel were excellent and were very warm to helping my family with our needs. You would never be disappointed by staying at this hotel for pleasure or business . Quite area being off the main street but restaurants were still in walking distance.", "title": "Helping Hand", "user": "kenneth60002", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163718283}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We stayed here for two nights. Check-in was very quick. The front desk clerk was very friendly and efficient. She always had a smile for everyone. Our room on the third floor was large and well laid out. King bed with firm mattress. Sofa and chair with coffee table. Fridge and microwave. Only three drawers in the dresser because the fridge took up space. But my pet peeve again is no vanity space. I would love to see a shelf and a magnifying mirror. We've stayed in many Fairfield Inns and they all have this problem. There were two major problems and this concerns housekeeping. The blackout shade had a big tear in it that let in alot of light. Of course we didn't notice it until we got into bed and turned out the lights. Housekeeping should have noticed it. In the morning we told the front desk and they replaced the shade.The other problems was the fitted sheet. It was too small for the bed. In the middle of the night, both nights, I woke up to find the sheet pulled halfway off. It took alot of pulling and tugging to get it back on and then it was only halfway on.", "title": "Decent Place But A Few Little Things", "helpfulness": 1, "user": "fernh", "date": "May 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 162017817}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "The room could use some pictures on the walls but it's a decent place to stay for a couple of nights. I just wish Marriott would do something about the vanity space in their Fairfield Inns.", "title": "This Place Rocks!", "user": "Adamsfco", "date": "May 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 161914188}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I stood at this hotel for 20 nights. This guys are reponsible of the fact that Marriotts became my place to stay for business travel in the future. Sarah from the front desk together with another two guys which ARE INCREDIBLY awesome! This place was by far my best experience in Farmington Hills. The rooms are ultra clean and all the staff goes the extra mile to satisfy their guests. Now, breakfast is really good considering that it's included on the rate you pay for the room. KUDOS for you guys. If I ever have to go back to Farmington Hills I am so staying with you!", "title": "Just passing through", "user": "rleNewEngland", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 161704256}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We stayed on night at this busy hotel set among others. I had researched the area and liked that this hotel had favorable reviews and was near restaurants. I was expecting a basic property but was pleasantly surprised by how friendly the staff was and hotel amenities available. A nice touch when Hanna upgraded us to a king bed. It is an older property with updates.....some still in the process of some renovation, especially the carpet in our room and rear stairwells. :-( Free breakfast was more than a danish and cereal. We would stay again.", "title": "Clean room, at good price", "user": "Tippyobrien", "date": "May 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 161301071}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "This was a good hotel made great by a wonderfully cheerful, incredibly friendly and consistently helpful front desk. What would have been just another few nights stay in just another hotel in a long string of hotels is now a memorable experience thanks to the front desk, especially Sylvia. Sylvia is the type of person you want to meet in any business transaction; she is kind, confident, skilled at what she does and has just the right touch of humor and charm that makes you feel liked you are doing business with a trusted and reputable organization that has your best interest at heart. I had a great stay and if I'm ever back in the area or hear of anyone going I will recommend this hotel. Thanks again!", "title": "The front desk staff really makes this place top notch", "user": "Dan W", "date": "May 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 160883374}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Excellent service! Sylvia was extremely helpful and ensured our stay was nothing short of perfect! She went out of her way to attend to our special requests- never once losing patience. She kept a smile on her face throughout the entire stay. If I had a business, I'd want Sylvia as the face of customer service. I will be highly recommending this hotel to friends and family alike.", "title": "Very pleased!", "user": "Turk320ci", "date": "May 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160105090}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "A co-worker and I stayed at the Fairfield and service here was great!! Sylvia, one of the front desk clerks is absolutely amazing. She went above and beyond for her customers and you do not see that often.. The rooms were clean and kept up. The facilities were clean all over with breakfast and dinner served. All I have to say is Sylvia receives a 5* x's two in my book along with the hotel! Thanks for such wonderful service.", "title": "Fabulous!!", "user": "Lydsp94", "date": "April 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157396734}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I come to Farmington about once a month, I usually stay at the Courtyard hotel across orchard rd., but it was booked. The staff was nice, free dinner and breakfast, free wifi. When I got to my room and the window sounded like it was opened, but it wasn't, I thought this is going to be hard to sleep with, but ill suck it up. Then I found a dead cockroach next to the bed when I reached for my fallen charger, I touched it! They switched my room, the new room had the same issue with the window, it's very loud. Also the cable in my room wouldn't work, I tried pushing all the buttons on the control and nothing. Izak, the guy at the front desk, was extremely apologetic and helpful in both situations, he did fix the TV.. However, I'm sorry, I will not be returning to this hotel.", "title": "It's a roof.", "user": "584AndreaG584", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 157135303}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I am spending 7 days at the Fairfield Inn in Farmington Hills and I must say that I am very satisfied with everything they have to offer. While living in New Jersey, I spent six months at the Fairfield Inn in Edison. Everything was great there which is why I decided to stay at the Fairfield Inn in Farmington Michigan. Much to my surprise, here they serve hot breakfast and evening meals. I was shocked and pleased. Julian one of the employees continues to show me professionalism responding to my requests. He is always smiling and asking if everything is alright. I like that type of personal touch. It makes me feel like I am appreciated as a customer.", "title": "Hotel Assessment", "user": "robert s", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155759242}], "location": {"country": "United States", "city": "Farmington Hills"}, "stars": 3, "variance": {"poor": 5, "average": 6, "very good": 21, "terrible": 4, "excellent": 46}, "aka": "Fairfield Inn Detroit Farmington Hills Hotel Farmington Hills", "slim_ranking": 0.0909090909091}