{"user_rating": 3.5, "review_count": 58, "name": "Fairfield Inn & Suites - Hayward", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "The rooms were nice and clean; obviously from a recent renovation. The atrium in the middle of the hotel is quite pretty, with water and plants. The free breakfast was very good, and the staff made sure that there was always fresh scrambled eggs and waffle mix though the entire breakfast period. The only thing not refilled were the doughnuts. The staff was very friendly and helpful. We only heard our neighbor's television slightly, and the hallway noise was blocked by the heavy door. The fridge and microwave were a nice addition. We booked at the AAA rate, which was $75 a night...more than a good price. Oh, and it IS in the middle of an industrial area. It was a quiet and safe area, with mainly concrete office buildings. (Not heavy industry.)", "title": "Nice rooms, nice atrium, nice breakfast...", "user": "travelling_jenn", "date": "September 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 19996674}, {"rating": 4.0, "title": "Great Stay", "text": "This was our second stay the the Fairfield Inn in Hayward, CA, and I am looking forward to our next stay there. Both stays were quite pleasant. The desk personnel were very professional and friendly. The hotel itself was quite clean and smelled clean as you walked in. The rooms were very nice and well maintained. they offered a microwave and frig as well as coffee in the room. Although, there is no pool, there is a gym and sauna. The hotel is not designed for the person who expects close convienences, you need to drive to eat, but the breakfast that is offered was better than most hotels offer. Also, I must say that booking on-line was a snap.", "user": "DarleneDawn", "date": "August 19, 2008", "id": 19117479}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "If your business takes you to the East Bay hopefully you will be able to stay in a more upscale area than Hayward. But if, like me, you need to be here, the Fairfield Inn is a good option. A newish hotel with interior corridors, rooms with brand spanking new furnishings, and a nice atrium with fountains and glass elevators where you can enjoy breakfast in the morning. Just be sure to request a room on the back side (away from the highway).", "title": "Great choice for business in Hayward", "user": "heavybuddy", "date": "August 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 18988515}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "After reading some of the previous reviews, I was hesitant about staying here. However, the price ($71) was compelling. I was very pleasantly surprised. I stayed on a Sunday night; friends dropped me off, so I did not need a restaurant or other conveniences. My room was newly updated, very clean and comfortable. Free in-room wireless was flawless and I used the free \"public\" computer in the lobby to print out my boarding pass. Breakfast was much better than the normal free breakfasts, with hot choices, fruit, yogurt, etc. I requested and was given a room away from the freeway, so noise was not an issue. In the morning their van, with a very polite driver, gave me a ride to Oakland airport at the time of my choosing. In all respects, my stay was pleasant and problem-free. I would highly recommend this hotel if you are not looking for an urban location.", "title": "Pleasant stay, great value", "user": "majorswede", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 16141824}, {"rating": 1.0, "title": "It's a \"hotel\" Jim, but not as we know it - do not stay here", "text": "This lodging place (I will not call it a hotel) was chosen for us by my husband's firm for their employees who recently attended a conference at the firm's Hayward office. The lodging place is located directly next to the San Mateo bridge motorway. I mean directly next to the motorway - you could see the whites of the motorists' eyes. The lodging had a reception desk, two elevators and lodging rooms: no restaurant, no bar, no coffee shop, no vending machines, no room service, no newsstand, no bus stop and no taxi rank. There was no restaurant (fast food or otherwise) within walking distance, no mall nor strip mall nor drug store within walking distance either. The nearest BART station was five miles away, which required phoning ahead for a taxi. However, there was an ever-changing rota of gormless \"we could not care less\" young front desk staff who would benefit from immediate etiquette and hotel management training courses. There was a fridge, microwave and coffee maker in our room. Sometimes, when we had the coffee maker, the heater/fan ventilation and the shower on at the same time we could drown out the sound of the motorway. Alcatraz would probably have offered a better standard of accommodation. I do not recommend this lodging place and I would refuse to stay here on future business trips.", "user": "A TripAdvisor user", "date": "February 9, 2008", "id": 13413576}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We had a pleasant stay here for 5 nights. We selected this hotel for it's location, near our friends and close to the freeway. Yes there are no restuarants or entertainment in walking distance. so you definitely need to have a car. With that said...", "title": "Enjoyed our stay.", "helpfulness": 1, "user": "dachuns", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116628113}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The hotel is very clean and well maintained. The room good size with two queens. The staff friendly and helpful. The breakfast enough variety of choices that it didn't get boring. The coin operated washer and dryer, next to the gym, very conveninet and the dryer works well! . (You can buy detergent from the front desk.) The gym small but well equipped . (There is a scale there, which we used the weigh our luggage before heading to the airport.)", "title": "NIce Room Internet Too Slow", "user": "SkierPA", "date": "August 3, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 4.0}, "id": 116236393}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Great place if you are visitng the area and have a car. Southland Mall is near by with restuarants and shopping.", "title": "Great deal, very nice Fairfield", "user": "USx395", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80635826}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The folks here are nice and mean well, but this is 2nd time i stayed and same internet problems. Can you imagine near silicone valley and the internet connection is very primitive and slow..worse then dial up...sorry but i will have to find new hotel for my future stays in the area....", "title": "Great location for traveling to Oakland", "helpfulness": 1, "user": "can37", "date": "July 30, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 73045674}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This hotel is very clean and looks brand new. It was recently refurbished. All the rooms face inward, most overlooking an indoor courtyard. They have free breakfast including eggs and bacon. The hotel is right off the freeway, and very convenient. Highly recommend.", "title": "Great Fairfield Inn & Suites", "user": "Traveler491", "date": "June 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 68071908}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Rooms are clean, overall facility looks very clean and decent. I like the atrium and breakfast area. The only disadvange is the location. Not close to anywhere, but it is right off the free way. But if you have a car, it's not a big deal at all. Free internet inside the room, which is a huge plus.", "title": "Nice and clean, location kind of remote", "user": "SmartTravelBuddy", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 41446894}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "I did not expect that this hotel I always pass by when using the San Mateo bridge is clean and neat until I got the chance to stay in it because of an internet discount offer. This is in the category of a bed and breakfast that there are no ballrooms and function rooms that will make it busy and noisy at night. Of course anywhere in California, unless you stay downtown, you will need a car for mobility. Parking in this hotel is free. Wired Internet connection in rooms is available but you will need an ethernet cable - there is none in the room and I did not ask if they have it somewhere because I always bring mine.", "title": "Highly Recommended", "user": "kalayka", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29211703}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "My family and I stayed in this hotel in September of 2008. We were attracted to the property because of its location (accessible to the City and close to stores and highways), its value in both price and amenities, and its appearance in photos. I contacted the hotel directly to make our reservations for two rooms. Given that we had 8 in our family party and that we wanted a girls room and boys room (3 girls, 5 boys), I requested a roll-a-way for the boys room. We were told when we arrived that roll-a-ways were not permitted because of the size of the rooms. I protested and said that someone representing their hotel had already promised a roll-a-way, but I was denied. Consequenty, we had to purchase another room. We initially did not mind because the cost per night (with our AAA discount) was significantly less than anything in SF. They put our rooms in the same area in consideration of the age of our family. The rooms were smaller than expected, but they were clean and recently refurbished. I had read from other reviews about an environmental smell from new paint, carpet, etc... This was indeed true. In an attempt to offset the odor housekeeping sprayed room deoderizer which was very overpowering.", "title": "Good points and Bad points", "helpfulness": 2, "user": "4byz1grl", "date": "January 9, 2009", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23408164, "likes": {"liked": "— Location and amenities", "disliked": "— Too many problems and uncooperative management"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Our family was placed on the first floor just off the atrium area. One room was next to the work out/whirlpool room. The atrium was lovely and spacious and had a breakfast area with tables and chairs. However, in the early morning there was too much noise to sleep in. The breakfast was very good with a wide variety of food. There was sausage, eggs, waffles, instant oatmeal and pastries. We noticed that many of the hotel's clientel were business professionals and not very tolerant of the families that were there. Besides our own family there were other small families and couples as well. When we returned to hotel later in the afternoon the first day, we found ants in the bathroom of one of our rooms. We called the front desk and they took care of it immediately. This, however, was not the end of our difficulties.", "title": "Nicely Renovated Hotel", "user": "seriousworldwanderer", "date": "October 27, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 3.0, "value": 4.0, "rooms": 5.0}, "id": 21321707, "likes": {"liked": "— the friendliness of the staff", "disliked": "— being near the freeway"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Our stay was over several days and everyday brought new problems. Two rooms were cleaned thoroughly, but the third was skipped. The ants came back. Being off the atrium meant more noise earlier and earlier each day. Being off the atrium also meant that we could order pizza or chinese food in, sit and visit with friends without being disturbed. The last night or our stay, someone used the whirlpool after hours. The room located just beside the workout room could hear the motor of the whirlpool tub through the wall. It kept my husband and two sons awake for several hours. My husband called the desk two times before the situation was resolved. We could not get the management to comp the night to us, but they let us keep the room throughout the day to keep our luggage in before a late afternoon checkout.", "title": "Great Value for the bay area", "user": "atruebrit", "date": "October 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 20725408}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were visiting family in Hayward so the location was perfect for us. Easy on and off from hwy 92 and 880. The first room we stayed in was #123, which was adjacent to the breakfast area. I was worried this might be noisy in the morning but we weren't bothered by any voices or food supply noises. What was a problem was that this room shares the wall with the kitchen and the refrigerators are against the wall where the head of the bed is. The buzz of the refrigerators was too much for me - I'm a light sleeper. I was hoping it would be like a \"white noise\" but was too intense. My husband slept fine. We moved to room #206 the next night which was better other than what sounded like \"happy feet\" above us running back & forth until @ 1:00am. Otherwise the hotel was very quiet and it didn't seem there were too many people there. These were the days after Christmas. The desk people were very friendly and helpful. This hotel is atrium style with a water feature in the middle.", "title": "Nice hotel", "helpfulness": 3, "user": "Sky22", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 122471380}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "This place seems to be hidden away close to the industrial area of Hayward. I've been staying at Marriotts in the Bay Area for years and never even knew this one was here. The hotel itself is very nice. I was quite surprised that it was about a decade old, it really seemed like a new building. It is very well maintained, rooms are clean/comfortable, and the staff is pleasant. There isn't too much close by in the way of restaurants or attractions, so yes a car is advisable. But this property seems to work very well in serving as a home base for any visit to the east bay.", "title": "Great Stay", "helpfulness": 2, "user": "perpendxular78", "date": "December 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121680777}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The room was clean, front desk very accommodating. Didn't like that the room opened up into the breakfast area; no privacy in that respect. Nice, free breakfast. Convient location but unless you know your way around Hayward, you wouldn't know where a restaurant was. There is nothing within walking distance. Not sure I would stay there again.", "title": "Average room, quiet", "helpfulness": 2, "user": "barb o", "date": "December 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121623541}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Pretty standard business hotel. Typical of Fairfields which is Marriott's lowest tier brand. Pretty barebones but expected. Location is next to San Mateo bridge entrance on the East Bay so not bad if you know where you are. Don't expect this to be near SF, which seems to be a common mistake with East Bay hotels.", "title": "Average but some problems with housekeeping", "user": "milty908", "date": "October 22, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119577673}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "One problem was in the morning, the housekeeper kept knocking on the door at exactly noon to get me out of the room. Usually there's some leeway with late checkouts and I don't usually have to call down to request if I'm leaving by 12:30 or so. A couple minutes later front desk called and I also told them that I'm checking out before 12:30. It was the first time a hotel was that eager to get me out when they send the housekeeper back every 5 minutes after noon checkout time.", "title": "Great place to stay, but a car is necessary", "helpfulness": 2, "user": "RonTheTraveler", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117530039}], "location": {"country": "United States", "city": "Hayward"}, "stars": 2.5, "variance": {"poor": 7, "average": 10, "very good": 22, "terrible": 5, "excellent": 14}, "aka": "Fairfield Inn & Suites - Hayward Hotel", "slim_ranking": 0.285714285714, "description": "Fairfield Inn & Suites Hayward delivers life-enhancing services and features for comfortable and affordable getaways in the heart of California???s historic East Bay area."}