{"user_rating": 4.5, "review_count": 1163, "name": "Fairmont Waterfront", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed at the Fairmont Waterfront at the start of our tour of the Rockies. We had travelled from Toronto to Vancouver by plane and the hotel sent a limo to collect us from the airport.", "title": "Can't fault it -", "user": "slj60", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118361860}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The accomodation had been booked by the Rocky Mountaineer as part of our tour of their Journey through the Clouds Discovery Drive, RM had booked all accomodation and travel for us and everything was very good.", "title": "Don't Let Them Handle Your Luggage!", "helpfulness": 1, "user": "Bruce4730", "date": "September 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 118353931}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We arrived at the hotel and were taken up to the Gold Floor reception. It was a beautiful sunny day and our room wasn't yet ready. We sat on the terrace of the Gold Lounge and enjoyed the view sipping a glass of wine from the honesty bar.", "title": "FRIENDLY, clean, & well situated", "user": "Chuck M", "date": "September 17, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118251630}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Our room was large and spacious and very well equipped. The bed was really comfortable.", "title": "Great Experience", "user": "Cheefee", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118216747}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Gold Floor staff were lovely, very helpful attentive and charming.", "title": "excellent location", "user": "JohnSFleet_Hants_UK", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118143070}, {"rating": 5.0, "title": "Wonderful stay", "text": "l stayed at the Waterfront hotel and took part in the bee tour. The Bee Keeper was knowledgable and gave a rewarding tour, Definately would recommend it. What a wonderful hotel. The room was good and the view was spectacular.. All the employees made me feel welcome and that really made my stay..", "user": "KS_always_2011", "date": "September 15, 2011", "id": 118135282}, {"rating": 4.0, "title": "Good Option for Short Stay", "text": "We stayed 2 nights, after arriving from Australia, prior to starting a tour of the Rockies.", "user": "LilAl", "date": "September 14, 2011", "id": 118130327}, {"rating": 4.0, "title": "Fairmont Waterfront", "text": "The Fairmont Waterfront was a good, functional option for us. The hotel has a full range of facilities. In-house restaurants are of good standard. The location near the waterfront is great - some nice sea air walks to blow away the jet lag. But we wish the seaplanes didn't start buzzing around so early!", "user": "matool", "date": "September 14, 2011", "id": 118108068}, {"rating": 5.0, "title": "Could not have found a more perfect location.", "text": "Travellers note - dining on the waterfront near the hotel is expensive and of average standard (typical tourist stuff). You can walk towards downtown for better and cheaper options.", "user": "Minerva22", "date": "September 10, 2011", "id": 117919665}, {"rating": 5.0, "title": "Perfect after cruise hotel", "text": "very nice and spacious rooms, easy access from lobby to elevator and to room", "user": "biomatch", "date": "September 10, 2011", "id": 117917619}, {"rating": 5.0, "title": "quick visit, lovely stay", "text": "Sadly, I only spent one night at the Fairmont Waterfront for a business meeting, so I didn't get to enjoy much of what Vancouver has to offer. But the hotel itself was of typical high Fairmont quality, directly across the street from the cruise terminal. The room was spacious, as was the bathroom (with those very north american \"extra wide\" shower curtain rods) over the tub. The bed was very comfortable. Even though my room faced the downtown area, it was quiet, and I slept soundly. Food at the meeting facility was excellent, and multiple temptations left out throughout the day had me constantly snacking. I'll have to come back when I'm up for an actual vacation next time.", "user": "ptbooth", "date": "September 9, 2011", "id": 117866863}, {"rating": 1.0, "title": "Disappointing stay :(", "text": "My wife and I just stayed at the Fairmont Waterfront in Vancouver in preparation for an upcoming Alaskan cruise. We booked the hotel using the American Express FHR program. The hotel was quite easy to find and an easy walk from the water front rail terminal. The front desk staff were friendly and we had very little wait before we were checked in and on our way to our room. We stayed in the king waterfront room category and it was fine (clean and well maintained), but for $400 a night I was expecting more. We booked this category due to the fact that with the FHR the hotel is supposed to upgrade to the next category up if available. The view was nice of the sea planes landing and of the water. We order room service and the burger I ordered was very good my wife's chicken sandwich was dry and flavorless, but with the FHR come an $100 food credit so we ate and went on about or day. When we returned for the night the room was quite hot. We turned the air down to 60F and got ready for bed. We both awoke around 1:00 am with the room still burning up, now faced with the dilemma I calling the front desk, complaining and switching rooms at 1:00 in the morning or sucking it up and going back to bed which is what we did. All in all the stay was fine (aside from the broken air conditioning) for a $100-$150 a night hotel, but as I said this room was $400 a night!! We stayed at an all inclusive Sandels resort for $300 for our honeymoon to put this in perspective. Also the room upgrade, as I said, did not happen and around 11:00 pm we went online to the Fairmont's website and the next room catagory was still very available. Given that we booked this hotel as a \"Fine Hotel and Resort\" all of these factors and the cost for such made the stay very disappointing compared to other hotels through the FHR program. If you're coming to Vancouver stay in the Shangra-La. The rooms are 10 times more posh than the Fairmont, they honored the room upgrade, the air conditioning works, and the room was $100 cheaper!", "user": "lewis01utk", "date": "September 8, 2011", "id": 117848977}, {"rating": 5.0, "title": "It doesn't get any nicer than the Vancouver Waterfront!", "text": "We have never stayed in a hotel that made us feel so much at home everyday of our vacation. The staff recognized us by name each day, inquired about our needs, were extremely professional and warm. They made reservations for us, suggested activites, provided us with bicycles upon request, and went above and beyond our expectations. I cannot say enough nice things about our visit to Vancouver. It was, in most part, due to the quality and care of the Vancouver, Waterfront. Thank you! We will definitely be back when we come to your beautiful city again.", "user": "AnnSalem59", "date": "September 8, 2011", "id": 117847574}, {"rating": 5.0, "title": "The Best Ever", "text": "The best hotel ever, efficient and friendly, Canada at it's best. Book the Gold option rooms for superb service without being over the top. Highly recomended.", "user": "leg27", "date": "September 3, 2011", "id": 117621680}, {"rating": 5.0, "title": "Up to the rooftop!", "text": "What a great place to stay. We spent one night here before our Disney cruise to Alaska, and they were perfect. From the Disney Cruise desk right there in the lobby, to the wonderful restaurant serving FRESH, healthy food, to the friendly people everywhere in the hotel, it was just right.", "user": "jedigiraffe", "date": "September 2, 2011", "id": 117599087}, {"rating": 5.0, "title": "The most awsome experience", "text": "We stayed at the Fairmont Waterfront for 2 nights prior to going on an Alaska cruise. The cruise departure terminal is across the street. The Fairmont checked our bags (with customs) and sent them ahead to be waiting in our rooms on the ship when we arrived. This left us several hrs after checkout to go get lunch and visit some more of Vancouver prior to our 5 pm departure. What else would we have done for several hours carring luggage around if this wouldn't have been one of their services. The Staff, service in the Fairmont Waterfront was amazing, from dinner suggestions, reservations to excursions and different modes of transportation to and from different sites. The lounge & breakfast were fantastic with the terrace and the spectacular view of the harbor and mountains. One of the best experiences we have ever had. Nothing was left to chance and everthing was executed perfectly.", "user": "Ken F", "date": "September 2, 2011", "id": 117579741}, {"rating": 4.0, "title": "Wonderful hotel...beautiful city", "text": "The location of this hotel is great, and in walking distance of so many nice places. We had a beautiful view of the harbor from our room. The service, food, etc. were very good.", "user": "JuneDuke12", "date": "September 1, 2011", "id": 117548295}, {"rating": 5.0, "title": "excellent - the most comfy bed i've ever seen", "text": "This has to be one of the most beautiful cities in the world.", "user": "DKB_France", "date": "August 31, 2011", "id": 117501512}, {"rating": 5.0, "title": "Wow.... this is a super-nice hotel", "text": "Sayed 3 nights at this hotel, booked last minute with a special deal 20% off f&b.", "user": "JSS3", "date": "August 31, 2011", "id": 117492180}, {"rating": 5.0, "title": "GREAT VIEWS, SERVICE & ASSISTANCE EXCELLENT", "text": "When we checked-in, the guy at the front desk was very sorry to announce to us that we couldn't get a room with a king bed, but with 2 doubles instead. I wasn't happy, but the guy was so nice, apologetic and funny that I actually ended up being ok with it. In any case, the bed was sooo comfy it made me forget about that!", "user": "OzTrav1", "date": "August 26, 2011", "id": 117257161}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 4.5, "variance": {"poor": 32, "average": 70, "very good": 308, "terrible": 13, "excellent": 740}, "aka": "Fairmont Waterfront Hotel", "slim_ranking": 0.113402061856, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Fairmont Waterfront provides relaxed luxury on the West Coast coupled with a world-class Vancouver experience. This hotel is an urban retreat with elegant accommodation, state-of-the-art (and recently renovated) meeting facilities and breathtaking views of Vancouver’s harbour, North Shore Mountains and the sparkling city skyline. Guests can enjoy a taste of local flavour in Herons West Coast Kitchen + Bar, visit the hotel's rooftop garden and honeybee apiary to discover where the restaurant's fresh herbs and honey are sourced from, and then take advantage of the complimentary health club and outdoor heated pool overlooking the harbour. This modern hotel boasts the best location in the city, nestled on Vancouver’s harbour and directly connected to the onsite Vancouver Convention Centre and Canada Place Cruiseship terminal and offers delegates door to door service to the airport via Skytrain (rapid transit). Guests can enjoy shopping, trendy restaurants, art galleries, Gastown, Chinatown and famous Stanley Park all within steps of our doors. This Four Diamond urban retreat is world renowned for its warm and welcoming service and truly showcases the best of Vancouver."}