{"user_rating": 4.0, "review_count": 1019, "name": "Fairmont Hotel Vancouver", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Adding my voice to the chorus! This hotel is fantastic top to bottom. bed was extremely comfortable. Didn't use the spa or restaurants as my meetings started very early and ran very late.took Skytrain on my return to the airport. Boarded a block from the hotel and was at domestic departures within the hall hour! Easy peasy and $3.75 vs the $39 cab ride to the hotl", "title": "Great for business travel", "user": "yukonimj", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142141268}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Staying on The Gold Floor at the Vancouver Hotel is truly a bit of heaven. Excellent service.Fabulous food service in the morning and evening. For those with a sweet tooth cookies and petite cakes are available in the afternoon for that pick me up. I had he best facial ever at the Spa. I highly recommend the Spa which is on site.", "title": "Pure enjoyment", "user": "alugirl1947", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142025305}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The fitness room is available 24/7 and the hotel can provide workout clothing as needed.", "title": "Best birthday ever!", "user": "JEOJC", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141707278}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I have to say I am a fan of Fairmont hotels. I have been in 9 of their properties and hopefully will visit others. Overall, it was a very positive experience. The hotel is beautiful. The lobby is bustling with activity. I was ecstatic that we got a corner room #569 that looked all the way down to the water and on the other side down towards Stanley park. Loved looking down the intersection and seeing all the hustle and bustle of the city. The room was very spacious. It even had a walk in closet. I have to agree with other reviewers that the room and bathroom looked dated and a bit tired. We went to Griffins twice. The buffet is excellent. On the day of my birthday I walked in at midday without a reservation. The first table offered was at a corner with no nearby windows on a restaurant known for its ample windows. I said to the lady that it was my birthday, that I was a guest at the hotel and that I am a President club member. She replied, you need to say no more and got me a table closer to the windows. I thought this was great service! The food was excellent and when we finished they brought me a happy birthday decorated dessert. It was all so nice! I was very grateful for such a perfect way to celebrate my birthday. When we finished, we went up to the room and the staff had left another birthday dessert with a personalized note. I was in bliss! It probably is the best birthday celebration I have ever had. Afterwards, I went down to see Bo, the resident dog, and shared my happiness with him. So thank you Fairmont Vancouver for making my birthday the most memorable yet.", "title": "The Gold Floor at The Fairmont Hotel Vancouver", "user": "David H", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141697394}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "My wife and mother spent two days in Vancouver and we decided to stay on the gold floor. What a great couple days it was - from the time we arrived to our departure. the staff on the gold floor made us feel very welcome, like a home away from home. Darren and his staff were very helpful with any request we had for them. We also had the pleasure of meeting Sunny Joseph, the Hotel Manager, who was extremely gracious and made us feel that no request was too small. Keep up the good work we will be back to stay with you on our next visit to sunny Vancouver .", "title": "Lovely Hotel, Nice Staff, Rooms are dated", "user": "Chris L", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 141421442}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Stayed here for 6 days in mid-September 2012, exceptional service especially in the premium lounge.", "title": "Fairmont Gold at the Hotel Vancouver", "user": "Tom L", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141406233}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The cocktail hour Hors d'oeuvres and morning breakfast was well presented, with a varied selection daily.", "title": "Those late checkouts are an issue", "user": "Weaseler", "date": "September 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141369799}, {"rating": 1.0, "title": "Absolutely deplorable", "text": "The manager Darren Klingbeil took the time to research and makes a dinner reservation, fantastic recommendation I might add.", "helpfulness": 1, "user": "Declan O", "date": "September 26, 2012", "id": 141334356}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The fitness room was well equipped but didn't provide any headphones for the Techno Gym machines.", "title": "Stylish stay in downtown Vancouver", "user": "FransHeijmans", "date": "September 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141332094}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I rarely stay at Fairmonts, so I have no status. I was surprised when I arrived mid afternoon to check in, only to be told to go away and come back later because no rooms were available. It was a remarkable exchange - the desk clerk looked really guilty and was defensive, not apologetic, I guess because my look was incredulous - I didn't yell at him, I just looked at him. I stay in five star hotels a couple days a week for the last 30 years, and this was a strange experience.", "title": "Classy!", "user": "Linda S", "date": "September 25, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 141288909}, {"rating": 4.0, "title": "Very happy with our choice", "text": "My husband and I stayed at the Fairmont Hotel Vancouver for 2 days prior and 2 days at the end of a Rocky Mountains bus trip.We were very impressed. Our rooms were very pleasant, unfortuneately on our 2nd visit the people in the room next door were very noisey. We rang the night staff who delt with it immediately and the noise stopped. All the staff we spoke to were very professional and helpful particularly the concierge staff who went out of their way to make phone calls, find the right bus to catch, recommend restaurants etc. Breakfast was included in our package, an extensive selection, very nice. Dinner in the hotel restaurant was also delicious, prime rib just melted in our mouths. This hotel was a highlight of our holiday.", "user": "FreemoFun", "date": "July 27, 2011", "id": 115868715}, {"rating": 5.0, "title": "Always a pleasure", "text": "We love staying at the Fairmont Hotel Vancouver. The location can't be beat, the lounge is fabulous and the staff is very accommodating. The concierge helped us with both babysitting services and car rentals, both were flawless. Our room was perfect, a beautiful one-bedroom suite - until the first night some rude guest decided to smoke a cigar on our non-smoking floor. The front desk found us another room at 4am (the smell was so awful and strong that it actually woke us up in the middle of the night) and moved us and our small child no questions asked. Considering the smoke was no fault of their own they did whatever they could to make it up to us. We REALLY appreciated everything they did. Would stay here again - although we are also keen to try the new Fairmont Pacific Rim!! A great stay.", "user": "jenlikesmexico", "date": "July 27, 2011", "id": 115864441}, {"rating": 5.0, "title": "Dogs Worth gold!", "text": "I spent a week at this hotel and it was super wonderful. The bedroom was clean, tidy and very comfortable. The beds were soft, but acidentally the lady who cleaned our room sent our fom pillow to the laundry room with the linen and they couldn't find it!!! The breakfast was amazing,very plentiful and there was food to cater to everyone's needs, you could also ask for room service which was elegantly presented and delicious! There were a couple of very fancy stores in the hotel lobby. But for me, walking Beau and watching Mavis step into Louis Vuitton when she was tired of talking to the guests make my stay at this hotel an unique experience!", "user": "Travelgems_10", "date": "July 23, 2011", "id": 115699085}, {"rating": 4.0, "title": "A must see hotel!", "text": "My family and i stayed at the Hotel Vancouver for 2 nights. Our room was newly renovated and a spacious one bedroom sweet. The service was great! See Nathan at the front desk he pointed us in all the right directions and had great restaurant recommendations. The restaurant in the hotel was decent service was a bit slow. Overall we thoroughly enjoyed our time at the hotel. If you are looking for a Hotel with Charm and a lot of history this is the place to be!", "user": "travelcanuck63", "date": "July 22, 2011", "id": 115663767}, {"rating": 3.0, "title": "Grand looking but noisy", "text": "Stayed in this hotel as part of the Rocky Mountaineer Train package. The hotel looks very grand and opulent but if you are looking for a nice quiet room to get some sleep this is not the place. The room we had was nice but all night we could hear the family next door and the traffic on the street. As the hotel is old I assume the sound proofing is very inadequate and is in desperate need of upgrading. Beds not too comfortable either - too soft for my liking and seem a bit worn. Overall disappointing for the price", "user": "2wheeltraveller", "date": "July 19, 2011", "id": 115541154}, {"rating": 5.0, "title": "Only place to stay in Vancouver", "text": "The Hotel Vancouver is one of my favourite hotels in the world. The combination of character, comfort, service and location in the exciting heart of Vancouver is hard to beat. There are more luxurious hotels in Vancouver, but few with the same sense of history and elegance. Nicely added pool and workout facility. Fairmont seems to be able to have created a genuine culture of caring, pride and ownership, and at the HV, this comes together in a lovely hotel that is a pleasure to stay at whether on business or for fun. Oh, yeah. Now with the new airport Skytrain link, you are a short walk to the downtown station and then 28 minutes to the airport. Amazingly convenient and inexpensive.", "user": "Candonjan", "date": "August 4, 2011", "id": 116268181}, {"rating": 3.0, "title": "Great location but a tad stuffy", "text": "You simply can not beat the location of this downtown hotel. We did have some trouble with a breakfast not arriving for 45 minutes but they took care of it OK. Some attitude with children spoeaking at Concierge and generally ot being respected as guests.", "user": "MrTrig", "date": "August 4, 2011", "id": 116268168}, {"rating": 3.0, "title": "Wonderul Staff, Grand old hotel, especially our room", "text": "Will definately try one of the other 2 Fairmonths in Vancouver next time.", "user": "MMSANDFCS", "date": "August 3, 2011", "id": 116234739}, {"rating": 5.0, "title": "History in the midle of the City", "text": "We just returned from an extended stay at The Fairmont Hotel Vancouver.", "user": "pinotn", "date": "August 2, 2011", "id": 116186281}, {"rating": 3.0, "title": "Nice but dissapointing", "text": "Pros:", "user": "MaNg1314", "date": "August 2, 2011", "id": 116183689}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I think this hotel is a little stale and needs a good updating. Their service is excellent though and the work out facilities are great! I would stay here again. It was an excellent location and convenient to get to through public transportation. The concierge helped me to find a \"cheerful and cheap\" manicure and pedicure which was close to the hotel. The check in and check out was a breeze too which always makes me happy.", "title": "Needs an Update but still a great hotel", "user": "LizzChicago", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143116079}, {"rating": 4.0, "title": "Timeless Beauty", "text": "Its been a while since I have been to the Fairmont Hotel Vancouver. I was not disappointed.", "user": "RMGTravel", "date": "October 13, 2012", "id": 142722082}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The hotel rooms are neat and clean, could use a bit of facelift, but the amazing service makes up for any imperfections.", "title": "Classic Fairmont Style", "user": "Rick S", "date": "October 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142704438}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The staff is always there to assist - including concierge David. He and the other concierges' are always there to assist with a smile. Be sure to say hello to the two beautiful labradors in the lobby. Yes - the hotel is animal friendly.", "title": "Great Home Base in Vancouver", "user": "JGSK", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142680389}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed seven nights while attending a conference. Terrific downtown Vancouver location. We were able to walk to most locations, the Harbour, Gastown, Robson Shops. Service was impeccable. Try the High Tea in the lounge for a leisurely, pampered break in the day. The room had some updating but the bathroom is tight.", "title": "Great location", "user": "Joe C", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142654609}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "i have stayed in this hotel numerous time but have found that their rooms and service have gone downhill. here's why:", "title": "This hotel has gone downhill - dirty and dated room, bad service", "helpfulness": 7, "user": "traveller0808", "date": "May 8, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 63541650}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "-before arriving, i especially asked for an early check in. my room was not ready when i arrived", "title": "Pure luxury!", "user": "smushie", "date": "May 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63443079}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "-when i got my room, there was a half empty bottle of water by the window, behind the blinds", "title": "This hotel have lots of History in it, great location", "user": "skyone", "date": "April 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 62129013}, {"rating": 4.0, "title": "Lots of great stuff with a few caveats", "text": "-the toilet was not flushed", "user": "Senoritagringa", "date": "April 21, 2010", "id": 62089775}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "-i found quite a few hairs on the floor of the bathroom", "title": "Worst fairmont property ever stayed", "user": "versa309", "date": "April 19, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 61867144}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Stayed here after travelling from Calagry on the Rocky Mountaineer. Well appoined large room. Staff all very friendly and helpful. Piano player in the bar a nice touch - Also there are two dogs at the hotel that guests can take for walks. Would recommend to all.", "title": "First class hotel", "user": "Gorlestonpete", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142632197}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Checked in the Fairmont Hotel Vancouer a day before taking the train in the Candian Rockies. Check-in was pleasant and the room was nice and accomodating. The conceige was very good at helping us and the yellow labs were great to visit. The restaurant was good with fair pricing. We had a couple of drinks in the bar where the ambiance was wonderful. The location of the hotel was excellent. Overall a very good stay.", "title": "Pleasant Stay in Vancouver", "user": "French S", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142480761}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I am a business traveler and as such am required to book only specific properties by my company and generally only standard rooms. Because my wife was joining me for a long weekend I decided to upgrade to a room on the executive floor. I can't say enough about the outstanding quality of the service from the staff. If you just want to sleep, then stay in one of the standard rooms. But if you want first class service you must go to the 9th floor. The additional cost for the upgrade was worth it.", "title": "Our stay at the Fairmont Hotel Vancouver", "user": "michael_C123", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142426614}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Just spent 2 nights here at the beginning of our Canadian holiday.", "title": "The rest have a lot to live up to!!", "user": "Phil G", "date": "October 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142340046}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We've newer stayed in a Fairmont Hotel before but have several booked for the next 2 weeks. Everything about this hotel was excellent especially the breakfast.", "title": "Wish we could have stayed longer!", "user": "ReillyWoodTravellers", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142338709}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Though I'd been to, and in, the Hotel Vancouver before (in fact, my high school grad party was held there), I'd never stayed there. We weren't disappointed: we had a lovely room on the 12th floor with a high ceiling and plenty of space, as well as a window looking west over Robson Street and even as far as English Bay. Our four-night stay was very pleasant, and you can't beat the location -- convenient to everything both downtown and elsewhere, as it's very close to both Skytrain routes.", "title": "Vancouver's Grande Dame was Grand!", "user": "alphabetkid", "date": "August 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116496541}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Room amenities included iron, hair dryer, robes, minibar (fee), and coffee/tea (no fee). I really liked the secure feeling I got in the hotel: we had to scan our room key to use the elevator, all times of day and night.", "title": "very good location", "helpfulness": 1, "user": "LondonColombo", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116399076}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We requested a quiet room on a high floor when we reserved, and hypoallergenic pillows, and got exactly what we wanted: kudos to Fairmont, and the President's Club. Service at the front desk and the restaurant was excellent; the only employee who didn't smile at us was the resident dog, who was sacked out after a long walk. (Perhaps we should have offered him treats...) Would gladly stay there again.", "title": "Classic Hotel in Vancouver", "user": "NumberEleven11", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116383973}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Had a nice stay, large rooms, very good breakfast, wifi is very expensive. Rooms look tired and need a refurbishment. Concierge need more staff as we had to wait there far too long each time to get some informations. Loved the two dogs.", "title": "My favorite Vancouver hotel", "user": "skeletoncrew", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116350210}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We stayed for a 5 day family vacation. We typically stay more modern hotels, but this is the classic grand old hotel and we really enjoyed ourselves. We stayed in a suite which had loads of room and worked well for our two kids with a separate bedroom, the pull out sofa and a cot. Service was great, hotel was great, and location was great. As you would expect in this hotel, the concierge was very helpful. It was my wife's 40th birthday and they helped order a perfect flower arrangement. The hotel is in walking distance of everything we wanted to see and do.", "title": "A Grand Old Lady of a Hotel", "user": "GoFlyNZ", "date": "August 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116279707}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This is a great hotel. The former grand Hotel Vancouver is part of the Fairmont chain, which always does a good job.", "title": "Will absolutely return", "user": "Reaperducer", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46257740}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I originally had reservations at the Four Seasons across the street, but found a special online for this hotel. I'm glad I did. It was great. The room was huge, the service great, and the location perfect. Even though I could never get the pillows arranged just right, the bed was comfy enough that it didn't matter and I slept great.", "title": "I Love Fairmonts!", "user": "sperry17", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45400669}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Here's a hint -- before you make your reservation, sign up for the Presidents Club. That way you don't have to wait in line to check in or out (there's a separate desk around the corner from main check in) and the internet is free.", "title": "Watch for extras!", "user": "Paddy53", "date": "September 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 44923279}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "Usually when I travel for business I stay in super-cheap places. I'm glad I stayed here this time. I didn't realize the importance of having a proper desk to do my work and a separate space to sit and read and relax. My productivity was much higher than when I multi-purpose the bed like I normally do.", "title": "Still Vancouver's Grand Hotel", "user": "EDM_Stowaway", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39521491}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The hotel has a pair of dogs for when you get lonely, but don't count on using them. They seemed to be booked all the time and when they weren't they looked dog tired from all the love and affection they get from the guests. But the dogs are cute and well behaved and if you're lonely they're a lot cheaper than a hooker and won't cut you if you don't give them a tip.", "title": "Elegant Hotel, Great Location", "user": "saucyredhead", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39019895}, {"rating": 5.0, "title": "Hotel Vancouver - Excellent!", "text": "Great suites, amazing views and professional staff. You will not be disappointed!", "user": "Kryptonite-Dove", "date": "March 5, 2010", "id": 57770190}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "Situated in the center of the Downtown area the location is perfect for bars, food and shopping with one of Vancouver's biggest malls (The Pacific Center) across the street.", "title": "can't beat the location", "user": "jasonzegreat", "date": "February 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 57078839}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Recreationally you are about a 10 min walk from the cost and around 20 mins from Stanley Park.", "title": "Great dog friendly hotel in downtown Vancouver", "user": "RStokes", "date": "February 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55401573}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Expect rain in the winter months and a more temperate climate in spring and summer.", "title": "Great hotel ... the kids loved it", "helpfulness": 1, "user": "Wootten00", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 54371662}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Didn't really care that the room decor was out dated. The bed is extremely comfortable, bathroom was clean and luxurious, and most of all it's right in the centre of downtown Vancouver!", "title": "Great position but overrated", "user": "TheJeppos", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 52155094}, {"rating": 4.0, "title": "My favourite hotel in Canada", "text": "I have stayed in this hotel on a regular basis for the last five years. it has become a home from home and the staff on the gold floor are like a second family. Nothing is too much trouble and their understanding of being a hotelier is outstanding. I was stranded here during the ash cloud disruption last year and the hotel offered a discount because we had not anticipated such a long stay.", "user": "GerryMal", "date": "July 30, 2011", "id": 116017914}, {"rating": 4.0, "title": "A piece of History - conveniently located downtown", "text": "This hotel is well worth a visit - service, location and cosseting!", "user": "Tessa-is-Black", "date": "July 28, 2011", "id": 115931329}, {"rating": 4.0, "title": "Classic", "text": "This hotel is conveniently located in the downtown business area... only a short walk to the harbour and the seawall walking trail. This hotel has been around for quite some time but still is a gem! The room is clean, the beds are comfy and the interior is posh!", "user": "fletch250", "date": "July 28, 2011", "id": 115924449}, {"rating": 5.0, "title": "Vancouver", "text": "A beautiful grand hotel in a prime location in downtown Vancouver. We stayed on the Gold Floor which includes a private lounge, breakfast, canapes in the evening and more. Everything served was delicious. Service was very good on all levels. The room was nice but the bathroom for this level could be a little bigger and a bit more updated. Overall the room was nice and the bed was comfortable. Not an inexpensive hotel but no Fairmont is. We would and will likely stay again.", "user": "SarasotaB", "date": "July 28, 2011", "id": 115920149}, {"rating": 4.0, "title": "Beautiful Hotel, Great Location, Great service, poor soundproofing?", "text": "Awesome city. Lot's to check out there. Great eats, entertainment and beautiful sites surround this city. The Fairmont was indeed well appointed and right downtown near all the action.Vancouver is a very large city which surpised me.", "user": "slbe", "date": "July 27, 2011", "id": 115869984}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Fairmont Hotel Vancouver is a uniquely elegant hotel, and one of the former Canadian Pacific hotel masterpieces. The hotel was excellent, rooms clean, and everything as expected. Although the hotel's standard rates are high, the hotel website offers a number of reasonable rates. If you want a unique hotel experience in Vancouver, try the Fairmont.", "title": "Elegant Hotel", "user": "ColumbiaTrekkers", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51900052}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed there in August 2009. It was a really nice hotel but i have no idea how much it cost. It was part of the Rocky Mountaineer Gold Leaf package which included a free night there. We were in room 657 on 6th floor. The room did have an incredibly small window but was a really large room with really good air con and comfortable bed.", "title": "Really Nice Hotel in great location!", "user": "knutsford1", "date": "December 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51726895}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The Swimming pool was ok but the photos do flatter the reality.", "title": "Expensive but worth it", "user": "wucie", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48712556}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Remember to take your room key and dressing gown when you go to the swimming pool. The changing rooms are very nice with lockers with towels. The gym is ok with a few running machines but nothing spectacular", "title": "Beautiful Place!!! Can't wait to visit again.", "user": "redfrog512", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46858275}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "There is a small area to sit outside amongst the skyscrapers which is nice with great views.", "title": "A truly 'grand' hotel", "user": "chocolate_teapot", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 46781436}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 4, "variance": {"poor": 49, "average": 113, "very good": 322, "terrible": 22, "excellent": 513}, "aka": "Fairmont Vancouver", "slim_ranking": 0.329896907216, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The Fairmont Hotel Vancouver is centrally located, close to Robson street shopping and many cultural offerings. The lobby features designer shops, including the flagship Louis Vuitton boutique, Gucci, Omega, and St. John. The hotel has a state-of-the-art health club, indoor pool and Absolute Spa, a Vancouver day spa. Vancouver's landmark hotel, the castle in the heart of the city is rich in history, vibrant and cosmopolitan."}