{"user_rating": 4.5, "review_count": 110, "name": "Fairfield Inn Washington Dulles Airport South/Chantilly", "reviews": [{"rating": 4.0, "title": "Liked the Fairfield", "text": "Even though I am a Marriott rewards member, I had not stayed in a Fairfield beore. After this stay I will look for more Fairfields. I picked this one only because it was the only Marriott with rooms available and one of the few hotels in the entire area with availability. Book early if you are staying in the Dulles area during the week!", "helpfulness": 2, "user": "VAbird", "date": "July 19, 2006", "id": 5488517}, {"rating": 4.0, "title": "Nice clean place", "text": "There are restaurants within walking distance, luckily, because traffic on 50 can be horrid during rush hours.", "helpfulness": 5, "user": "Ann L", "date": "June 21, 2005", "id": 3589643}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We arrived at Dulles at 11:45pm, this is a huge airport and had to ask for directions to find where to call the hotel shuttle. Language barrier with front desk staff but did figure out were he said to wait. The hotel knew we were coming in late so when I called they were prepared for our arrival. The shuttle driver was very nice and we had a great chat on the way to the hotel. It took us about 20 minutes which seemed like a long time since it was so close by mapquest. The driver even volunteered to take us to the grocery store or CVS pharmacy down the road before we go to the hotel if we needed anything. Even though we were his last pick up before he could head home. When we got to the hotel the desk just handed up the keys, signed one form and up to the room--all this while he was trying to deal with an unfriendly women who wanted a room for dirt cheap. Even was offering her a discount but she still wasnt happy about it.", "title": "One night stay", "helpfulness": 1, "user": "1cutemom", "date": "April 26, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 7438775, "likes": {"liked": "— Location to hotel and free shuttle", "disliked": "— thin walls between rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Our room was okay. Nothing special, beds were very hard and not too comfortable but we only needed them for 8 hrs. The walls were very thin so at 1am I could hear the gal next door (which may have been the one at the counter) talking on and on and on loudly on the phone. The hot water was a bit scarce in the morning.", "title": "Less expensive, good choice", "user": "aj1a", "date": "April 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7414170, "likes": {"liked": "— Location and price"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "The hotel did offer a continental breakfast which worked out well for us but nothing to rave about, cereal, juice, microwave breakfast sandwiches, granola bars, apples etc.", "title": "A nice, clean hotel", "helpfulness": 4, "user": "beachbumchris", "date": "April 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7330773, "likes": {"liked": "— Very clean, newer hotel.", "disliked": "— Airplane noise."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "This was not one of my favorite hotels but it worked out well for us since we got in so late and the shuttle was offered until 12am. I was affraid they would cut us off since it was so close to midnight but they were great and didnt act like it was a big deal. This is a hotel with the basics but nice and clean.", "title": "Quiet quality at an airport hotel", "helpfulness": 5, "user": "LorelaiLii", "date": "October 3, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 5905413}, {"rating": 4.0, "title": "Great little stopover hotel", "text": "While it may not be the newest or fanciest, this hotel suited its purposes for me. It was a good location (few miles from the airport), it was clean, and it was reasonably priced. Just arriving back from China and not being able to catch a flight back to Boston because of the April vaca rush, I booked this hotel as a layover. For $69/night I was able to get free wireless, comp breakfast (didn't eat because shuttle to airport was so early), comp airport transfer, and as another reviewer mentioned, a 'goodie' bag for staying with them.", "helpfulness": 2, "user": "SARA43", "date": "August 24, 2006", "id": 5703721}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Great locations! In walking distance to restaurants and stores. Staff was very nice and friendly and our room was comfortable and clean. There is shuttle bus that takes you within 5-10 miles radius (maybe longer).", "title": "Great Location", "helpfulness": 1, "user": "MsLibrarian", "date": "May 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16512822, "likes": {"liked": "— Internet, shuttle bus"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "This is an excellent hotel for the price. They are nearly done with a renovation, and the new style is modern but colorful. the beds and pillows and linens are very comfy. I loved the breakfast. Lots of variety. The coffee is also coffee house quality. Their complimentary coffee service in the lobby stays hot all day long. The free shuttle service is easy and friendly. It's a quick trip to the airport. If you stay on the 3rd floor (top floor) and don't have the a/c or fan on, you'll hear some airplane traffic at times. But I love watching planes, so it was fun for me. Free wi-fi in every room worked like a gem. Also all free printing. This is a really rare perk. Staff were friendly and really helpful. I'll stay there again with no question.", "title": "Wonderful hotel, great value", "helpfulness": 1, "user": "iw8forsno", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 16180759, "likes": {"liked": "— newly renovated with new beds and feather pillows....lots of them!", "disliked": "— towels could've been better quality"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Professional and courteous staff were helpful in any way possible.", "title": "Great for the money!", "user": "HyperTyper79", "date": "November 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10790484, "likes": {"liked": "— The cleanliness, the pool and whirlpool, and the awesome breakfast buffett!", "disliked": "— The not-so-comfy bed situation."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "Above average breakfast buffett.", "title": "Awesome experience at the Fairfiled Inn", "user": "VAMomof2", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7605699, "likes": {"liked": "— The awesome staff", "disliked": "— Airplaned"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Very clean rooms with larger than average bathrooms.", "title": "Quiet, but close to Dulles", "helpfulness": 2, "user": "JackKerowack", "date": "May 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7597520, "likes": {"liked": "— adjacent shopping center", "disliked": "— lack of a fridge in the room"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 6, "average": 11, "very good": 32, "terrible": 1, "excellent": 60}, "aka": "Fairfield Inn Washington Dulles Airport South/Chantilly Hotel Chantilly", "slim_ranking": 0.5, "description": "Relax in the refreshing comfort of Fairfield Inn & Suites Marriott in Chantilly, Virginia. Close to 4 major highways and under 5 miles from Washington International Airport at Dulles, Fairfield Inn & Suites Chantilly has great dining, shopping, tourist and entertainment venues. You may also request a free shuttle during most hours from IAD and points within a 3-mile radius including The National Air & Space Museum Udvar-Hazy Center. Business travelers find the right blend of efficient guest services, complimentary FAX/copy and WiFi, ample parking, same-day valet dry cleaning and fitness options. Leisure guests adore the proximity to famous sights and easy access to the Nation’s Capital. Complimentary Breakfast, Guest Workstation, Fitness Room, Indoor Pool, Jacuzzi, Laundry/Dry Cleaner Services and Guest Operated Laundry."}