{"user_rating": 4.0, "review_count": 1176, "name": "Fairmont Scottsdale", "reviews": [{"rating": 5.0, "title": "Exquisite perfection! ", "text": "This resort was perfection defined! Beautiful, clean, friendly and accomodating staff.", "user": "MidwestFella", "date": "August 14, 2006", "id": 5609282}, {"rating": 1.0, "title": "downhill", "text": "What's best was that we stayed for only $108.00 a night with breakfast included for 2. This package was booked directly thru the Fairmont 800 reservation number, after joining the Presidents Club and becoming eligible for the offer. Stayed 3 nights - the 1st breakfast was $67.00, the 2nd $54 and the 3rd $47.00. This rate booked a standard Fairmont room, but at check in we were upgraded to a Deluxe room without even asking. Also, if you stay on a weekend night, the breakfast is a fabulous buffet spread served fountain side on the terrace!!", "user": "aark", "date": "August 7, 2006", "id": 5574594}, {"rating": 5.0, "title": "Perfect for a Getaway!", "text": "In addition to the breakfasts being removed from the bill (for 2 adults and 2 children, rather than for just the 2 adults as the offer read), the kids each received a $10 gift certificate to be used at the Princess Shop and a $5 certificate for a fishing pole rental.", "user": "Lovelle", "date": "August 7, 2006", "id": 5573845}, {"rating": 5.0, "title": "Fabulous in almost every way", "text": "By the time you take the $108 paid per night, for 3 nights (totals $324), minus the breakfasts provided gratis ($168 total) and the gift certificates ($30 total) this left us paying a total of $126 for a 3 night stay which equates to $42 per night to be staying in a place as luxurious as the Princess!", "user": "kek", "date": "August 5, 2006", "id": 5560872}, {"rating": 5.0, "title": "Princess Fit For A King", "text": "Hotel provided top notch personal products (soaps, shampoos, etc.), a Saturday night \"Dive In\" at the main pool. Floats were provided and after the sun set, the movie Madagascar was shown on a huge movie screen set up near the pool with full stereo sound! Fishing was fun, and hotel provided badminton, a putting green, volleyball, basketball, croquet, bocce ball and lawn bowling.", "user": "Billy_Notts", "date": "August 2, 2006", "id": 5543109}, {"rating": 5.0, "title": "Look no further", "text": "If you're looking for luxury in the Scottsdale area, look no further. The Princess has everything from shops on the property to a centrally located pool. I stayed in one of their condo suites seperate from the main building. If you're a couple looking to get away from everything and everyone, the suites are fantastic. Enormous living room with fireplace, couch, dining table, and tv. The bedroom was huge with private balcony. And the bathroom was so big it was almost the size of the bedroom. Oh, almost forgot. The location is perfect. Right down the street from TPC Scottsdale (golfers) and shopping on the main drag is a 1 minute car ride away.", "user": "Dornoch22", "date": "August 2, 2006", "id": 5540267}, {"rating": 5.0, "title": "Another great experience with some reccomendations", "text": "We stayed at the Fairmont Princess July 10 - 12 to celebrate our 2nd wedding anniversary. We are long time locals, and have visited this resort numerous times over the years, but this was the first time we stayed as overnight guests. The resort is lovely, the staff was very friendly and helpful.", "user": "lfelix", "date": "July 15, 2006", "id": 5467602}, {"rating": 5.0, "title": "Wonderful Service!", "text": "The resort has multiple pools, a complimentary fitness area as well as another fitness area that is part of the spa. If you wish to use the spa facilites you pay $49/day to use the spa facilites, the fee is waived if you have a spa service that day. there is a kids program, and also a teens room. They also have a grassy lawn with crochet, badmitton, volleyball, and other games. They have a catch a release pond loaded with fish. You rent the pole for $5. And of course, there are several lovely pools. The pools were never crowded at all. We visited during the week, I expect they would be more crowded on the weekend. Many of the resort guests were participants in varous conventions, so we felt like we had the resort to our selves.", "user": "kell113", "date": "July 13, 2006", "id": 5464017}, {"rating": 4.0, "title": "Not to be faulted", "text": "We booked the basic room, and after reading some of the reviews here, were concerned we should have upgraded to a casita room. I was glad we did not. The casita section is newer, but the casita section was a bit isolated and a short walk to the main resort. The pool at the casita area is very small, and felt crowded. The casita pool did have better complimentary amenities, water as well as lemonade and tea, as well as reading materials. The main pools are much larger, and only have drinking water. They do have poolside food and beverage service though. At the casita pool, you have to order through in-room dining. I did not like how the casita rooms patios were not covered. The standard room is NOT oversized, but was plenty of room for us. The room configuration is a bit unusual, the bathroom, closet and dressing area are at the front door, then there is a long hall way that leads into the bedroom and wet bar area and balcony. The room was very clean, and in good repair. The bathroom was roomy, dual sinks, separate tub/shower. I disagree with the other reviewer about the shower size. We were both able to fit in it just fine :) Our bathroom had a double set of towels on the towel racks and then a 2nd double set of towels folded in a nice basket. Our room had a lovely veiw of the lagoon and lawn area. In the evening we had a great view of the city lights. I beleive they gave us an upgraded view room.", "user": "Flipje67", "date": "July 9, 2006", "id": 5443165}, {"rating": 3.0, "title": "Not 5 Stars in My Opinion", "text": "The food is good, but pricy, as to be expected. Our favorite meal was breakfast at LV Bistro. We also did room sevice a few times, and also the poolside menu.", "user": "A TripAdvisor user", "date": "July 8, 2006", "id": 5440996}, {"rating": 5.0, "title": "Impressive", "text": "Stayed here for a conference. Aside from the oppressive heat, we have absolutlely no complaints. The grounds are well-cared for, the rooms are clean, spacoius, and well laid out. The food ranged from very good in the Bistro to outstanding in La Hacienda. The staff was courteous and helpful. Basically, a very, very nice place to stay. It must be great in January.", "user": "JaneRussel", "date": "July 7, 2006", "id": 5435758}, {"rating": 5.0, "title": "Wonderful!", "text": "My boyfriend and I stayed at the FSP for a weekend getaway and could not have been happier with the resort! We were upgraded to a larger room with a view of the pond for the sole reason that the manager at check-in did not like the view of the room we were originally suppose to get. The room she gave us was wonderful!!! The best part of the room was the bathroom; it had an extremely large/deep bathtub with a separate shower, and plenty of counter space and mirrors.", "user": "AZ3", "date": "July 6, 2006", "id": 5434407}, {"rating": 4.0, "title": "Beautiful, with a few quirks", "text": "The location of the resort is pulled way off the small main road it is on and felt very safe and secure. Scottsdale itself, by the way, is a very upscale and safe.", "user": "J-Phil", "date": "July 4, 2006", "id": 5422410}, {"rating": 5.0, "title": "Beautiful Oasis", "text": "I used expedia and booked a room for about $200 that came with a $100 food&beverage credit per night. I would recommend this deal to anyone who can find it! The food was very nice. We ate at the LV Bistro each day for breakfast, and both times had wonderful food and service! We also sampled the pool café food for a quick lunch, which as we expected was not as nice as the Bistro, but was good (especially since it was pool food). For dinner one night we dined at the La Hacienda for a treat (because of the food credit). My boyfriend loved the food here, as for me, it was way too spicy even though the waiter told me it was not a spicy entrée… I can not blame him for this however because I am sure he did not think it was spicy; I just do not handle spicy well! They had a large selection of margaritas, which by the way are very strong (way too strong for me but not for my boyfriend, who once again love it!).", "user": "rjkj", "date": "June 4, 2006", "id": 5297372}, {"rating": 5.0, "title": "Perfect Princess Phor Phamilies", "text": "Sadly I was unable to use the pools but they looked great. Although the main pool was busy, the pool that is located next to the pool with the slide at night was not at all busy.", "user": "A TripAdvisor user", "date": "June 3, 2006", "id": 5295302}, {"rating": 4.0, "title": "Not Hip but Excellent Service", "text": "I stayed at the Fairmont with three of my girlfriends for a spa weekend. While the casita (a large room with two beds, a sitting area, and a huge bathroom) was not fancy (for Fairmont standards), the property was great and the service exemplary. They brought a minifridge and microwave to our room free of charge. And were more than helpful with restaurant reservations, directions, etc. We spent time at the main pool, where servers brought around complimentary water and mini smoothies. We ate excellent fish tacos at the pool restaurant. Kudos for having lap swimming lanes in one of the pools, as well.", "user": "tvlbug", "date": "September 1, 2006", "id": 5731894}, {"rating": 5.0, "title": "Had a Fabulous Time", "text": "We spend an entire day at the spa on-site. While extremely pricey ($270 for a massage with gratuity) - we milked it - enjoying the hot tubs, steam room, inhalation room, private pool with cabanas and misters, complimentary snacks, etc. It was extremely relaxing and luxurious.", "user": "HeyNow6", "date": "August 28, 2006", "id": 5715111}, {"rating": 5.0, "title": "Couldn't ask for more!", "text": "We got a great price online, but I wouldn't pay the normal rates.", "user": "NJ_Traveler_07052", "date": "August 26, 2006", "id": 5710442}, {"rating": 3.0, "title": "Overall a nice place to stay", "text": "The hotel also seemed very family oriented which is great if you have kids; I personally enjoyed the kid free pool at the spa....", "user": "Tarheels1960", "date": "August 21, 2006", "id": 5688473}, {"rating": 5.0, "title": "Top Rate Resort", "text": "My husband and I stayed at this wonderful five star resort. We had a wonderful time! We especially enjoyed the swimming pools late in the night. It could not have been better. The service was excellent and the staff was very helpful. We had dinner at La Hacienda. I have never had anything so good before. Our room was great and the bathroom was brilliant, very clean and tidy. We will stay there again next summer, we are going to make it one of our annual trips.", "user": "Tonia B", "date": "August 21, 2006", "id": 5652966}], "location": {}, "stars": 5, "variance": {"poor": 57, "average": 121, "very good": 331, "terrible": 44, "excellent": 623}, "aka": "Fairmont Scottsdale Hotel Scottsdale", "slim_ranking": 0.316455696203, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}