{"user_rating": 4.5, "review_count": 437, "name": "Fairlawns Hotel And Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My husband and I attended a joint silver wedding/50th birthday party celebration at Fairlawns and also stayed overnight. First impressions DO count, and ours were good after being greeted by a very pleasant young lady at Reception who was very efficient and helpful. The function ran like clockwork, the food was hot and delicious, and our every need was attended to. I managed to throw a glass of champagne over myself (startled by one of the screaming balloons homed in on me) and was immediately attended to by a waiter with a clean napkin or two (thank you). We found the room clean and comfortable with everything we needed for a nights stay. Can't comment on the breakfast as we didn't make it! Well done Fairlawns - excellent function and accommodation.", "title": "Professional, efficient & friendly service", "helpfulness": 2, "user": "jeremiah3", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 52602504}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "me and my husband stayed her on the 20th dec for my birthday. on arrival the reception staff were really friendly and helpfull. our room was really nicely decorated and we requested champagne and chocolates in our room which were georgous we had a spa treatment which was great. the food is so so nice the best i have had. and the breakfast was georgous. i will def be raturing very soon. thankyou to all and a happy new year to u and ur staff x", "title": "everything perfect", "helpfulness": 2, "user": "workingmumx2", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52544734}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Went to Fairlawns with a friend to celebrate our birthdays. Booked one of the packages which turned out to be perfect. I had to contact the hotel a couple of times to add bits on and change a few things and they were most helpful each time. We pick a different spa hotel every year but we will certainly keep this one on the top of our list to return to. The food was excellent, the service superb and the staff very friendly.", "title": "A Real Treat", "helpfulness": 1, "user": "worcestershiretracey", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51591588}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Sorry guys but i wasnt that impressed. Most of the staff were miserable, maybe they just had a bad day/night? Shame. Especially as the drinks were so expensive! Spa wasnt too bad tho.", "title": "Not much cop", "user": "missing_stuff", "date": "December 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 50948098}, {"rating": 5.0, "stay_parameters": "Stayed October 2009", "text": "Wow!", "title": "Fantastic spa break - only problem.....wish we could have stayed longer!", "user": "truthfulme", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47680927}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My wife and I stayed the weekend of 20th Feb 2010 on a D,B&B basis. We wanted to go somewhere which was different as we were fed up with bland Corporate hotels in general. Overall, we had a very nice time and would recommend it to others. We liked the restaurant and service in particular and found that there was a genuine desire to offer a good service all round. Whilst the service wasn’t perfect for one reason or other, the staff were always trying to provide a high level of service. It was also nice to be able to communicate and understand with the staff in English and strike up a rapport with them. The manager in particular was very charming and it was obvious that others followed his example. Despite the relatively young staff there manners were impeccable and worthy of note.", "title": "Enjoyable Weekend Stay", "helpfulness": 1, "user": "golfing_guru", "date": "February 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56687754}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The food was of a very high standard, though the set menu was slightly limited especially when staying there for 2 days. The atmosphere in the restaurant and bar was very good. We noticed several local parties enjoying themselves which probably confirms our assumption that the restaurant has a good reputation locally. The bar area and restaurant were warm and inviting. Most diners were dressed smart or smart casual so the atmosphere was quite nice.", "title": "Excellent service, food, spa and bedrooms.", "user": "yeovil81", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 55475890}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We used the spa on one of the days and thought it was quite good.", "title": "Hospitality,delicious food, facilities and comfort to a very high standard", "helpfulness": 1, "user": "oratory", "date": "February 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54951439}, {"rating": 5.0, "stay_parameters": "Stayed January 2010", "text": "The swimming pool was particularly good and large enough to cater for several swimmers without crashing into each other. No lanes were cordoned off for private child swimming lessons etc which you quite often see at other pools.", "title": "Lovely Spa and Hotel!", "helpfulness": 1, "user": "priz54", "date": "January 27, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54503091}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The steam room (x2), sauna (x2) and foot spas were all working though some of the knobs and signs needed to be repaired/replaced. The foot spa for example, was great but it took us 10 mins and lots of water to work out how to use it after others had given up !! A new sign is desperately needed and a bit of TLC in other places.", "title": "Excessive food prices leave bitter taste...", "user": "LeeDJones", "date": "January 26, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54429675}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We've just come back from a dinner, bed and breakfast break at Fairlawns. Very relaxing and enjoyable. Staff were very friendly, and seemed like they care. The meal was incredible- hope they look after that chef! The room had everything you could want apart from a little fridge/mini bar. We slept very well. The breakfast was just what you'd hope for. Plenty of free parking. The spa was well equipped, but we'd left it too late to book treatments. Next time we will definitely book some. The smell of essential oils wafted down the corridor, heavenly! Parts of the hotel seemed a little old fashioned and dated (still clean and well presented), i'm sure it's all part of the continung improvements they are planning to make over the coming years. Value for money was excellent, can't wait to go back!", "title": "wonderful weekend away, great value for money- we'll be back :)", "user": "SARobinson", "date": "June 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 68093819}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Booked this hotel spa as a last minute break and was delighted with what we got. The hotel was clean and tidy and the rooms were very well presented. The staff were extremely friendly and went out of their way to help.", "title": "Lovely getaway and excellent value for money!", "user": "Plenktrip", "date": "June 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 67876858}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "We took a deal that included dinner, bed, breakfast in bed, lunch and a treatment in the spa. Having looked at other similar deals at different spa's we were expecting a reasonable quality but fairlawns provided so much more!", "title": "Fantastic facilites and wonderful staff", "user": "DevonWilma", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66650528}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The food was super! A four course dinner of fantastic food, there were small suppliments of a few pounds for certain menu items but it was well worth it. The restaurant staff were very polite and service was excellent. Breakfast was bought to our room at the time of our choice and we enjoyed it in bed. A very tasty continental selection.", "title": "Wedding reception", "user": "patandjanet", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66354224}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Probably the only complaint was that our lunch was scheduled in in the last slot of the day and some of the food had run out. The staff did their best to refill some of the missing items but then closed the lunch bar well before the end of our alloted time. This ment that we missed out on some of the different foods and weren't very full when we finished. But this is a pretty small complaint considering our overall stay. Oh and the bedroom was very hot at night. There is aircon which helped but it is a mit noisy.", "title": "Best choice so far", "user": "Skidtrim", "date": "May 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64002636}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Myself and 3 friends have just been away on a 1 night spa break. The whole experience was very enjoyable. The staff were very friendly and helpful, the rooms were spacious and decorated to a high standard and the spa itself was lovely and varied in the layout. All of the food was of a high quality and the grazing bar really added to the overall experience. A thoroughly enjoyable time and I would recommend it to anybody. I could not fault it.", "title": "Relaxing Break Away", "user": "Nightnurse61", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62094114}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Lets get to my complaint first and then we can turn to all the positive points about this excellent hotel.", "title": "excellent hotel in many ways but disappointed with room provided", "user": "mark666", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 59801200}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "When I booked I requested a king size bed and it was confirmed accordingly . Unfortunately due to a plumbing emergency at home we arrived about 2 and half hours late and only just in time for our dinner reservation . Our friends were already in the bar so we rushed upstairs dumped everything , quick wash and brush up then downstairs. When we got back to the room at about 11 p.m we discovered that the bed was in fact 2 single beds pushed together. Fair enough we could have complained but after excellent meal and wine we didnt feel like all the hassle which would be involved. In the morning we checked out with our friends and the wife didnt want to make a scene in front of them.", "title": "We go back every year", "user": "MrsCrackers", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58809293}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Thats off my chest now the good points", "title": "Hotel with that hard to find 'certain something'.", "user": "haywa_s", "date": "March 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58523156}, {"rating": 5.0, "stay_parameters": "Stayed February 2010", "text": "Excellent ,polite,cheerful ,efficient staff in all areas of the hotel . Nicely furnished bar and restaurant food first rate , compliments to the chef.", "title": "Brilliant stay, highly recommended", "user": "ArielWestMidlands", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57881647}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 4, "average": 24, "very good": 82, "terrible": 1, "excellent": 326}, "aka": "Fairlawns Hotel And Aldridge", "slim_ranking": 1.0, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "An award-winning restaurant, adult fitness club, luxurious spa and landscaped grounds complement this family run hotel situated to the north of Birmingham, close to Walsall, Sutton and Lichfield. Bedrooms all offer modern facilities including free internet, power showers and digital flat screen television; superior rooms are comfort cooled. Free parking has controlled entry / exit barriers and video surveillance.Private meeting rooms complete facilities which combine to create an ideal venue for business or pleasure."}