{"user_rating": 4.0, "review_count": 62, "name": "Fairfield Inn & Suites Oklahoma City NW Expressway/Warr Acres", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This is a newer hotel in a busy part of OKC, but it's not near many of the tourist attractions or airport; still, it's a great option if you need to be in this part of the city. Very clean; great staff; easy access. Room was small, but everything was tip-top.", "title": "Nice newer hotel", "helpfulness": 2, "user": "Twoprofs", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 90840301}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I liked the location best. Close to the highway and lots of eating places around it. Their fitness room was too small and no stationary bike.", "title": "Comfortable, Clean and Good Area of Town", "helpfulness": 1, "user": "StairsOnly", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 80926148}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "This was my second recent stay at a Fairfield Inn. I stayed at the recommendation of a co-worker and would have been pleased with both stays except for the housekeeping. This time the room was barely touched when I checked in; it was not vacumed or just hit and miss, there were finger prints on the closet door and streaks and grease on the end table. The bathroom floor and tub definitely needed work. I was so tired that I wiped things down myself and let it go. The daily housekeeping was just as lacking. I keep reminding myself that it is an inexpensive property but that doesn't excuse the complete inattention to the details. I believe I gave Fairfield a chance and then another- both times I was disappointed with cleanliness. It's a shame because the staff was extremely pleasant, the room itsself was decent and I would have liked to stay again. I don't find the same problems with area Courtyards or Hampton Inn so I guess it's time to return to them.", "title": "Nice property but housekeeping services need work", "user": "lillah19", "date": "August 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 77034598}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This is a great hotel! It is easy to find, about 20 minutes from downtown. Check in was fast. The front desk staff was very friendly. Our room was clean and nicely decorated. The room had a fridge/micro. There is a pool and hot tub, which are open 24 hours. There is also a gym. It looked nice, but we didn't use it. There was an excellent breakfast, and was more than your average free breakfast. The hotel was quiet, even though we were told the hotel was busy. We got this hotel through priceline, but we would have been happy if we had paid more. We would stay here again.", "title": "Great Hotel!", "helpfulness": 1, "user": "MrsS08", "date": "June 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 66561153}], "location": {"country": "United States", "city": "Oklahoma City"}, "stars": 2.5, "variance": {"poor": 2, "average": 10, "very good": 30, "terrible": 1, "excellent": 19}, "aka": "Fairfield Inn & Suites Oklahoma City Nw Expressway/Warr Acres Hotel", "slim_ranking": 0.308823529412}