{"user_rating": 4.0, "review_count": 47, "name": "Fairfield Inn & Suites Muskogee", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "After driving all day, we were looking for a comfortable and clean place to lay our heads. We were very pleased with our reception and with the value. We were upgraded to a suite and were also please with our accommodations. They were spacious and clean and very well decorated. Everything in the suite operated correctly and well. The drapes are not blackout drapes, so if light is an issue, you may want to make adjustments. Will definitely return.", "title": "Great Place to Stay", "user": "Gram0123", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142324889}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Recently stayed here for work for two nights. 1st night of stay, the air unit was not working when I got to my room, staff at hotel came and fixed (bad battery on thermostat). My room also had a noticeable \"day laborer\" odor about it that was excacerbated by the air not working. and the smell didn't seem to go away after the air got working. Breakfast was pretty decent. The staff was very helpful. Have stayed here before and was a little disappointed due to the room odor, as this is a otherwise pretty nice place. Hopefully, this was just a one-time thing with the room odor, as my previous stays here for both work and family went very well, despite the issues from this stay, will still consider staying. Hotel is pretty close to pretty much anything you would want to do in Muskogee", "title": "Okay stay", "user": "Bill F", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 140118025}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "After being on the road with a 4 year old this hotel was a welcome sight. The lobby is big and open, the rooms are bright and clean. THe bed was very comfortable, and we had plenty of pillows which was great. The front desk staff was attentive, and nice. THe breakfast in the morning was wonderful, I enjoyed the breakfast sandwich.", "title": "Overnight stop", "user": "momaflippen", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134523371}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "The only downside is that the pool is very small, 2 adults and 4 kids pretty much filled it up.", "title": "Nice people pleasent stay", "user": "jenhal", "date": "July 5, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 133546148}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Over all I would go out of my way to stay there again", "title": "More than Expected", "user": "lonestargal360", "date": "July 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133399962}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stayed here for 5 days for a business trip. The room was very clean and neat. The A/C worked wonderfully considering it was over 100 degrees most days!The breakfast was satisfying! I will stay here again the next time I am in Muskogee!", "title": "Great Stay!", "user": "Nick F", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133277746}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We spent 1 nite at this nice, new property. It was clean and quiet. Breakfast was good with a good selection of items. Staff was very friendly and the desk clerk who was working that evening was very helpful and attentive. There is an IHop within walking distance of the hotel. This hotel was great.", "title": "Nice hotel", "user": "sanrOb1472", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129601170}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "One of the nicest Fairfields I have ever stayed in. I spend about 150 nights a year in hotels and this property ranks high on my list, especially for a lower end hotel. Spent six weeks at this location.", "title": "Above average Fairfield", "helpfulness": 1, "user": "kritter56", "date": "April 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 127586998}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The facility was clean and surprisingly quiet. Yes, like most hotels you could occasionally hear someone in the hall or talking loud in the room next door, but in this case it was inconsiderate guests not the hotel.", "title": "Our stay in Muskogee", "user": "stacymsski2", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127189728}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Good selection of items for free breakfast, but would like to have seen a little more fresh fruit like bananas.", "title": "What happened?", "helpfulness": 1, "user": "Sunbather08", "date": "September 13, 2011", "detail_rating": {"location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 118087862}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Upon arrival I was told I didn't have a reservation. After traveling 8hours I was exhausted.", "title": "new hotel needs organization", "user": "delia74137", "date": "August 31, 2011", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 117477739}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "and just wanted to sleep. Waited while desk clerk took 15 minutes to make a reservation. I finally walked out and went next door to the Hampton. Not once did she show me any", "title": "Best place in Muskogee", "user": "rowed65", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 115921884}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "consideration. Customer service training is needed at this hotel. Will never try to stay there again", "title": "Good (not great -yet) property, maybe a little overpriced", "user": "4Faulks", "date": "June 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 114814147}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Newest and cleanest property in Muskogee. Convenient location near main highway intersection, with restaurants nearby. Continental breakfast buffet included. Although this is a Marriott property, it doesn't serve Starbucks coffee (like the rest of the city). IHOP shares the same parking lot. I don't always stay in Muskogee, but when I do, I stay here.", "title": "Awesome service!", "user": "SheronD", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107512194}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Our family of 4 ended up spending one night at this hotel, which was an unplanned stop. I generally try to do a little research in advance and look for the best rates, but had to call from the road to make this reservation.", "title": "Best Hotel, best Marriott I've Visited", "user": "MommaMiddie", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104961955}, {"rating": 4.0, "title": "Good place to stop after a long days drive", "text": "You know that feeling, you have a long cross country drive ahead and you have been in the car all day. You now enter an unfamiliar town ready to call it quits for the evening. All you want is a clean safe place to sleep and maybe grab something to eat before heading out on the next leg of your journey. You also know that this search for refuge can be fraught with peril. Old worn musty rooms with broken furniture and mysterious growths in the bathroom. In these situations you can't even count on consistency from many of the national chains as some might be brand new or were last remodeled a couple of decades ago...", "user": "FirstClass59", "date": "March 30, 2013", "id": 156097547}, {"rating": 5.0, "title": "A Caring Staff is Seen in the Quality of the Facility", "text": "Well if you find you yourself in Muskogee OK at the end of the day the Fairfield inn by Marriott is a place to the stop for a restful night. It is located off the main road but set far enough back to eliminate vehicle noise. The parking lot is well lit and the lobby modern and welcoming. The staff is attentive and friendly . The room was of average size, CLEAN, and functional. The room had a flat panel TV, microwave and refrigerator. The bed was comfortable. The room was very quiet except some water pipe noises that lasted briefly around five AM. They serve an adequate breakfast in the morning. Another benefit of this property is that there is a 24 hr IHOP a short walk across the parking lot. This is not a luxury property with a lot of amenities , but if you looking for a clean safe place to sleep I highly recommend it.", "user": "wslawrence", "date": "March 3, 2013", "id": 153624117}, {"rating": 3.0, "title": "Average", "text": "There are a lot of choices in this price range these days, oftentimes less expensive versions of a major hotel chain, as in this case, the Marriott Hotels chain. Many times, however, the quality is lost as the price goes down. That is not the case in this Fairfield Inn.", "user": "sweet222", "date": "January 23, 2013", "id": 150334532}, {"rating": 5.0, "title": "One of my best sleeps ever~", "text": "The hotel is very clean, well-organized, well-equipped, and state-of-the-art, and I think that is because of the quality of the staff. From the moment you approach the desk to check in to the time you drop off the door card on your way out of the door, the staff is there to answer any need. It may have been best seen in the breakfast. What a wonderful selection! Most breakfast buffets are fairly predictable, and this one was predictable to some extent. The selection was fairly standard with the waffle-maker, bagels and cream cheese, a variety of cereals, juices, muffins, and cold products, coffee, and what you have come to expect. The difference was in the quality of the items. The blueberry muffins could have come from an exclusive bakery. The coffee was good, strong, and very hot. There were Jimmy Dean sausage or bacon, egg and cheese biscuits that were very good. Nothing was underdone, bought \"on the cheap\", or missing. The eating area was brightly lit, clean, and there was an ever-present friendly server anxious to serve.", "user": "DownhereinTX", "date": "November 15, 2012", "id": 145444599}, {"rating": 4.0, "title": "Unexpectedly Amazing!", "text": "The rooms were sizable, well-equipped, clean, and offered high quality bedding and linens. What's not to like when you can actually get a good night's sleep on a hotel mattress?", "user": "Aaron T", "date": "October 22, 2012", "id": 143452457}], "location": {"country": "United States", "city": "Muskogee"}, "stars": 2.5, "variance": {"poor": 1, "average": 6, "very good": 16, "terrible": 6, "excellent": 18}, "aka": "Fairfield Inn & Suites Muskogee Hotel", "slim_ranking": 0.235294117647}