{"user_rating": 4.0, "review_count": 60, "name": "Fairfield Inn and Suites Elizabethtown", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We wanted to be close to Loretto for our Bourbon Trail tour, so I booked Elizabethtown after reading some not so great reviews about other places. I upgraded to a suite because I knew we had a long day driving. What a great place. What we thought would be a sleepy little town was bustling with activity. Great check-in experience; everyone was very accommodating. We changed our room because we found out we would be located on the railroad side of the hotel. A good choice, the trains come through at all hours and we would not have been happy on the train side of the hotel. Great location off the highway, within walking distance to a few restaurants. The room was great, roomy and quiet. The breakfast was very good. Definitely a top shelf Fairfield. My only complaint was the towels. As with previous Fairfield Inns, their towels are really paper thin and in need of upgrading. Overall, a great experience and would stay there again.", "title": "Great stay", "user": "jpad108", "date": "January 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23255366, "likes": {"liked": "— everything, really", "disliked": "— the towels"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Stayed for a week. was upgraded to a suite during check-in. The others in my group had regular rooms and told me they did not have micro or frig. I had one in the suite. Hotel has age but is clean and very close to many restaurants. B-fast was continental with biscuits/gravy, micro. Jummy dean sandwich, and make your own waffles.", "title": "Clean and comfortable", "user": "C55", "date": "November 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 21953997, "likes": {"liked": "— Close to eateries", "disliked": "— No wifi in room; hard wired very small wire in room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I was in town to visit my family and was astounded by the fabulous service I received at the Fairfield. Their staff was one of the friendliest I have ever encountered and the rooms were great! I would encourage all travelers to try this property out if your are on that stretch of I-65! Kudos to the entire staff esp. management who did a great job with their team! You rarely ever see managers working so hands on! Great stay!", "title": "Greatest Visit to Date!!!", "user": "Silasdogg", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18111953, "likes": {"liked": "— Staff", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Great Hotel!", "text": "Pros:", "user": "BSpeaker", "date": "May 16, 2008", "id": 16093340}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "- Very friendly staff", "title": "Overall above average but needs some updating", "user": "FL2007", "date": "April 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 15365273, "likes": {"liked": "— Quiet location and convenience of restaurants.", "disliked": "— Quality of bed and bath linens"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We must have gotten the same room as a previous reviewer since the drawers in our dresser kept opening automatically too! Or maybe the hotel is built on a slant! Fairly clean although we found a box of beef jerky under the bed. Towels were noticably thin and mattresses soft. Breakfast area was stocked and clean and front desk seemed to keep things orderly too. Pool very small but kids enjoyed it....got loud and crowded quickly. Exercise room had empty water tank in the am. We had a room facing the back of the hotel and did notice the train rumbling by a few times. No horn blows but would wake lighter sleepers. Our tv was newer \"thin\" kind. We asked to be near another party upon reservations and with check in (which was around 5pm) and we were put at the other end of the hall from them. Felt bad for the people between us hearing the kids run back and forth between the rooms in the evening. Tons of options at this exit so for the $100 we paid for the night, I'd think there would be a better value elsewhere.", "title": "Nothing special with a few issues", "user": "ttoo", "date": "January 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 122732809}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is our third stay at this particular hotel. Our athletic team stays here when in the area for a sporting competition. The previous stays have been fine. This time, things just weren't up to par. Front desk staff not as friendly as in past stays. Not rude but more mechanical and going through the motions. Room was just ok. Several annoyances. A dresser drawer would not stay shut. Kept sliding open and you had to watch not to run into it. Furniture a little worn. Beds just ok. TV old box type. Towels a little on the thin side. No microwave or refrigerator. It was extremely hot outside during our stay so the AC was cranking the entire time which gave the hotel common areas and our room a kind of musty, damp smell. Free breakfast was fine and predictable. Cereals, boxed pastries, coffee, milk, juices...... Located just off I-65. Several fast food and sitdown chain restaurants nearby. For the $120/night we paid (and this was a group rate), I expected much more than we received from this visit.", "title": "Slipped a Bit Since Last Stay", "user": "KYSunnyOne", "date": "December 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121559292}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I have stayed here several times while traveling or here for both business and to visit family. It is enough removed fromthe highways to be quiet yet it is convenient to many eating establishments.", "title": "I would always stay at this property when spending a night in E'town.", "user": "jmichaelbarry", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117992453}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This was a very convenient stopover location for our road trip. The hotel is located at the end of a street, away from the highway noise and bright lights. Staff was pleasant & helpful with suggestions for dinner, aside from the chain restaurants located at this exit. Also right across the street from a supermarket. We will definitely stay here again on the next trip!", "title": "Convenient & Quiet", "user": "FleischD", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117376878}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Stayed overnight at this hotel on our way to Alabama for a family reunion. We had no reservations. The night clerk, Maurice, was very professional and gave us a very nice room. His warmth and kindness made us feel very welcome. I definetly would come back and stay at this hotel again. I hope Maurice read this review and keeps up the good work. Thanks.", "title": "Nice Hotel", "user": "bjc79", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116780715}, {"rating": 4.0, "title": "Fairfield Inn and Suites", "text": "Spacious room with comfortable bed and roomy bathroom. T", "user": "MaryB95", "date": "February 22, 2010", "id": 56765808}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The hotel offers comfortable rooms and a reasonable breakfast. It is located off the highway in a dense cluster of hotels and chain restaurants, which is very convenient if you want a quick dinner. If you stay, consider going to the one nearby attraction: the Schmidt Museum of Coca-Cola memorabilia -- it's lots of fun and located a couple of minutes away.", "title": "Typical chain hotel; convenient to highway and restaurants", "user": "Wanderlust777", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 47952843}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "I used points to stay that this Fairfield Inn for a trip to Mammoth Cave. It's a bit out of the way for that purpose, but the experience was outstanding.", "title": "Very clean, nice room, well serviced", "user": "LynneInMichigan", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36961912}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "My adult daughter and I shared a room, so we choose the two-double bed option. This was not a suite (we didn't request one). The room also had a flat-screen TV, comfortable desk, and reading chair with floor lamp.", "title": "Bad enough to switch hotels", "user": "TravelingMom71", "date": "July 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 36355762}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "We both felt comfortable in the room and had plenty of space for spreading out all of our stuff. The hotel also has reasonably priced guest laundry -- this was important to us since we did the Wild Cave tour at Mammoth Cave and came back covered from head to toe in dirt.", "title": "Poor service due to poor management", "user": "mevantes", "date": "May 18, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 30220224}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We stayed here for 1 night for a weekend conference. The hotel was off the main drag surrounded by other hotels and casual dining restaurants. The rooms were small, 1 king-sized bed sandwiched between night stands, facing a dresser with a small alcove to the side. The bathroom was pretty standard and everything was pretty clean. The complimentary continental breakfast was unusually varied and tasty. With options like microwavable breakfast sandwiches, freshly made Belgian waffles, a small yogurt bar, fruit cups, baked goods, a small selection of cereals, 8 or more varieties of tea, and a selection of coffees and syrups. The staff here were outstanding. When we arrived and our room was not available, they quickly found us a clean and ready room. They apologized several times, but it was unnecessary as we only waited a few keyboard strokes from them to find us a room. The staff at breakfast was also wonderfully helpful and attentive. Angie, one of the staff, quickly swept through the room, checking on hotel guests, restocking breakfast items and wiping up crumbs.", "title": "Excellent staff and breakfast", "user": "sideponytail", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 102483124}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We selected this hotel at the last minute in the middle of our breeders cup weekend, as the hotel we planned on staying in for two nights was not suitable.", "title": "Great location, friendly hotel, comfortable rooms, but next to the train tracks.", "user": "loreebee2", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 86324549}, {"rating": 3.0, "stay_parameters": "Stayed November 2010", "text": "We were very pleasantly surprised. Upon our late arrival, our room was held for us, we checked in quickly and we were able to enjoy a quick dip in the indoor pool and hot tub, which are open until 11pm.", "title": "The hotel is situated in a bank of hotels...", "user": "jmac248", "date": "August 22, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 76249251}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The beds were clean, comfortable and the room was a nice size. We didn't hear any noise from adjoining rooms. However, the railroad tracks are behind this hotel. The train passed about 3-4 times per night. There were NO disturbing train whistles, but if you are a light sleeper, you will hear the train go by.", "title": "Enjoyable Stay. No Complaints.", "user": "KYSunnyOne", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 72607642}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The breakfast was really good, offering bagels, cereal, fruit, oatmeal, yogurt, granola, walnuts, hard boiled eggs, and various items in the refrigerator, such as jimmy dean sausage and eggs.", "title": "Nice remodeled hotel, good value, questionable bedding", "user": "sellinrain", "date": "February 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 57080229}], "location": {"country": "United States", "city": "Elizabethtown"}, "stars": 2.5, "variance": {"poor": 3, "average": 9, "very good": 17, "terrible": 5, "excellent": 26}, "aka": "Fairfield Inn And Suites Elizabethtown Hotel Elizabethtown", "slim_ranking": 0.263157894737}