{"user_rating": 4.0, "review_count": 99, "name": "Fairfield Inn & Suites Rancho Cordova", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "This is a well maintained but older Fairfield Inn in an area of Rancho Cordova just south of Zinfandel Drive. The lobby is pleasant and there is a large area for seating. The rooms were designed when Fairfield had a slightly larger footprint for rooms. My room was clean and quiet. Ask for an odd numbered room because these rooms are not up against the freeway which runs right by the property. The service at the front desk is friendly however they fail to recognize Marriott's Gold Members with any particular greeting or small gift. The breakfast is pretty standard selcetion of breads, bagels and waffles with a few add on items that re prepared off site. The one staff person that manages the breakfast area does a very good job of keeping the area well stocked. There is also a business center with two computers, free of charge, and a small pool and spa.", "title": "Friendly Older Fairfield Inn", "helpfulness": 1, "user": "DCSacramento", "date": "April 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 102590842}, {"rating": 1.0, "stay_parameters": "Stayed October 2010", "text": "The worse hotel ive ever stayed at! The gm was rude the associates were rude. They are unaware how to operate a hotel. They dnt kno how to take a payment. We wer cheking out and paying with two cards and 2 weeks later we still have to call them and follow and ask why only one card got charged. When we cheked in the gm argude with us over the tiniest issue. When we got to our room there where hairs on the sheets. They obviously hadnt been changed. I calld down at 630 to get new sheets and was told that only the one associate was there and her coworker could bring them up in 30 min aftr his lunch. After 2 hrs of no sheets i go down stairs and one associate is in the bussiness center and another is outside smoking. Still no sheets for an hour. I wouldnt go to this hotel if i were paid!", "title": "DO NOT STAY HERE!!!!!! Horrible rude incompetent", "helpfulness": 2, "user": "Bellman707", "date": "November 3, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 85866849}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "best place for night stay before heading to Lake Tahoe. Not overly priced. good staff. serves complimentary breakfast", "title": "best place for night stay before heading to Lake Tahoe", "user": "bikramdas", "date": "October 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83768833}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed here using our Marriott points. The staff was very friendly and helpful, Good location and the rooms were Clean, Quiet and Comfortable. The breakfast was not fancy but adaquate. Definately would stay there again.", "title": "Good Hotel, Good Location, Good value", "user": "wheath4", "date": "October 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81971012}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here for 1 night while we were visiting Sacramento. The hotel is right off the interstate and close to a shopping center and a Light Rail stop. Our room on the top floor was huge and very clean. The free continental breakfast was pretty good as well. Front desk staff were friendly and courteous.", "title": "Great price for a great stay", "user": "felix190", "date": "September 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78784708}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We were actually from the general area and very familiar with it, but due to a death in the family we needed to find a place to stay to lighten the load on the houses. Too many people coming into town (El Dorado Hills) and we had our 17 and 22 year old daughters with us.", "title": "Best rate before you head up the hill", "helpfulness": 1, "user": "bjsr", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53886568}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "We opted to just get a place to free up bathroom time. And take some of the rush/pressure off. (we had the only girls).", "title": "Clean, easy & friendly", "helpfulness": 1, "user": "BPM2427", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 51254357}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We planned to use our marriott points for a few nights, but working our way down the hill from EDH. All the others were far more expensive. Location, Location....", "title": "Much improved under Marriott banner", "user": "Buddy-Bear", "date": "November 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 48250540}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Yes, we did have to drive farthur each day, but that was OK. WE saved money.", "title": "Near the highway", "user": "Family4Vancouver_BC", "date": "September 3, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 39638590}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "We saved time by having our own bathroom. :}", "title": "Mediocre ... at best", "user": "FI_Flyer", "date": "October 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 20578581}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My husband and I stayed here with our kids along with our families and their children. The hotel has a nice continental breakfast daily, and we all enjoyed making our own fresh waffles. The hotel staff were both accomadating and friendly, even the maids. Our room was nice and big. Was always clean (as the maids always did a great job). Quiet, eventhough close by the freeway. We felt extremely safe in this hotel and at this location. The beds and pillows were heavenly soft and comfortable that we actually missed this hotel when we left haha. The only minor problem was the pool was a little small but we didnt care as everything else was wonderful to our satisfaction! We cant wait to stay here again when we're in town visiting family.", "title": "Family friendly Hotel!", "helpfulness": 1, "user": "thaijasmine", "date": "July 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71961534}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I have already stayed here twice this summer and will definitely stay here again. Stayed in a King room. Price was great. Room was clean and spacious. Bed and pillows were comfortable. Staff was courteous. My room faced the freeway, but I didn't hear any road noise. Breakfast options included waffles, oatmeal, yogurt, fruit, bagels, coffee, juices, etc.", "title": "Best Fairfield I have ever stayed in.", "helpfulness": 1, "user": "wjreview", "date": "June 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67806848}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We stayed here for one night to break the drive from Crescent City to Los Angeles. The hotel was a very good deal at under $60 a night on a Saturday. The rooms were very clean and large and the beds comfortable. The pool was ok and the jacuzzi way too hot but still relaxing. There was free wireless and the breakfast was delicious and very filling. The only negative part of our stay was that the showerhead was broken and the water would come out in uneven streams. Since we were there only one night, we didn't bother to ask to get it fixed.", "title": "A good place to stay near Sacramento", "user": "Asiunka", "date": "June 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 66987969}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "This is a terrific hotel if you need somewhere to stay whilst travelling along route 50 eg going from San Francisco to Tahoe. It is exceptionally good value for money (less than $60 a night) for what you get. Large, clean, spacious room and bathroom; good continental buffet breakfast included (juice, coffee, eggs, cereals, toast, fruit, etc); friendly staff; free internet access in business centre off the lobby. There is no restaurant in the hotel, but they give you a list of nearby restaurants (all of which require a drive). Comfortable bed and good room furnishings.", "title": "Terrific value for money if you need to stop off travelling between the Coast and the Sierras", "user": "Airlineconsultant", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 61717760}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Only negative is that the thermostat on the room fan heater broke during my stay meaning the fan would automatically turn on every 5/10 mins throughout the night; this necessitated me moving room but the front desk staff were very helpful about this.", "title": "Forget the Reviews prior to 2009", "user": "casadequatro", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57295732}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We were visiting Sacramento and Placerville so Rancho Cordova is a good midpoint. The pros of this place: location (right off Zinfindel exit), $69/night for Sat and Sun nights and breakfast included in rate. The cons: too close to the freeway and breakfast selection.", "title": "Decent place to stay", "user": "Judy T.", "date": "March 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 14532619, "likes": {"liked": "— Price and location", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The lobby is clean and well-kept. The staff even decorated for Easter. Check-in was smooth. Unfortunately we got a room facing the freeway so we can hear car whizzing by during the day. Since we didn't plan to spend much time in the room, we didn't ask to be moved. The room is in average condition. The bedding looked new-ish but you can see wear and tear in the bathroom. We liked that a microwave and mini-fridge is provided. The complimentary breakfast in appreciated but was limited. Cook yourself waffles, cereal, danishes, bread, instant oatmeal, yougurt and Jimmy Dean breakfast sandwiches are provided. There is apple and orange juice, milk (some were past the expiration date) and coffee (not good).", "title": "Name change - now the Fairfield Inn & Suites Rancho Cordova", "helpfulness": 2, "user": "RichTo", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 8738482, "likes": {"liked": "— Free wired & wireless Internet access", "disliked": "— Hooker in adjoining room"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The location is a short driving distance to restaurants. It is about 15 minutes from downtown Sacramento and 30 minutes from Placerville. There is a Hampton Inn & Suites right next door that we may try next time if the rates are similar.", "title": "The Worst Customer Service", "helpfulness": 3, "user": "MeSeattle", "date": "September 6, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8666886, "likes": {"liked": "— convinient to freeway", "disliked": "— customer service at front desk"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "The Wingate Inn Rancho Cordova is now known as the (Marriott) Fairfield Inn & Suites Rancho Cordova.", "title": "nice quiet room", "helpfulness": 1, "user": "Jillybeanpink", "date": "July 14, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8114470}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "The name change was effective Saturday, September 15, 2007.", "title": "Great Hotel for any affair", "helpfulness": 1, "user": "jmclean123", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7720870}], "location": {"country": "United States", "city": "Rancho Cordova"}, "stars": 2.5, "variance": {"poor": 2, "average": 8, "very good": 38, "terrible": 5, "excellent": 46}, "aka": "Fairfield Inn & Suites Rancho Cordova Hotel", "slim_ranking": 0.277777777778, "description": "Welcome to the Fairfield Inn & Suites Rancho Cordova, a select-service Marriott hotel catering to the needs of leisure and business travelers visiting Rancho Cordova, Sacramento and nearby medical facilities including the Sacramento VA Medical Center, Kaiser Hospital and Mercy San Juan. We are located near office buildings, business parks, recreational and educational sites including CSU Sacramento, Sacramento State Aquatic Center and the Cordova Restaurant & Casino. We are the perfect choice when attending sporting competitions, retreats and family reunions. Be sure to stay with us each year for the Blue Angels Air Show! You will enjoy easy access to these destinations and other points of interest including the grounds of Folsom Lake and the Prairie City State Vehicular Recreation Area when you stay at the Fairfield Inn & Suites Rancho Cordova hotel. Guests at the Fairfield Inn & Suites Rancho Cordova enjoy amenities, services and conveniences including complimentary on-site parking, coffee in the lobby, the fastest wired and wireless Internet service in the area provided by Sure West, and a complimentary deluxe continental breakfast each morning. We are a pet-friendly hotel (fee applies) so you are free to bring the entire family. Our staff is available 24/7 to assist with anything you may need and ensure you have the most enjoyable stay!"}