{"user_rating": 4.0, "review_count": 1390, "name": "Fairmont The Queen Elizabeth", "reviews": [{"rating": 4.0, "title": "Very comfortable and great location", "text": "I usually stay in the old city but, for business, this location was much more convenient. I was only recommended to this hotel because of its locatation really. Admittedly I stayed in the Gold section but I was really comfortable and can only speak very highly of Eric, the manager there. My room was lovely and my entire stay was great. Perfect for a lady travelling alone.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 11, 2005", "id": 3178931}, {"rating": 3.0, "title": "The Queen E is still noting to write home about", "text": "I read some of the recent reviews which indicated that the Queen Elizabeth was rising like a phoenix from the ashes of some pretty rough years. Well, it's not there yet.", "helpfulness": 8, "user": "YYZSolly", "date": "January 26, 2005", "id": 3088750}, {"rating": 4.0, "title": "Excellent service & great location", "text": "I'm in a suite - admittedly, a JUNIOR suite, but it's TINY. I'm not a big guy (around 5' 10\" and 160 pounds) but some of the corners are tought to navigate and the bathroom is really snug.", "helpfulness": 2, "user": "Kim-Nashville", "date": "January 26, 2005", "id": 3088742}, {"rating": 4.0, "title": "Great location for winter shopping", "text": "The room is fine, no huge complaints, but I've had MUCH nicer standard rooms at several other Montreal hotels.", "helpfulness": 4, "user": "denisottawa", "date": "January 20, 2005", "id": 3021399}, {"rating": 4.0, "title": "Loved it", "text": "My advice: go to Hotel Vogue or Le Germain for a great place at what is still a reasonable rate.", "helpfulness": 2, "user": "gggaut", "date": "January 20, 2005", "id": 3019840}, {"rating": 3.0, "title": "Gave away our room?!", "text": "We were met by a supercilious French-accented woman at the front desk on December 28, 2004, who told us that the discounted rooms were all gone. Instead of paying the $149 of my *guaranteed reservation* -- we were going to have to pay $199. I asked to talk to a manager. The woman walked away and shortly returned, saying we could have a renovated room (usually $199) for $149. I should say so! I've never heard of a hotel trying to raise the rate of a credit-card-guaranteed reservation. Not what I wanted to hear after a nine-hour drive. They say that French speakers look down on English speakers in Montreal. I don't know if this is true, but the woman at the desk made me think so.", "helpfulness": 7, "user": "DisneyWorlders", "date": "January 6, 2005", "id": 2981944}, {"rating": 4.0, "title": "Very Nice Stay...", "text": "The room was charming with a separate alcove with a desk. Housekeeping was so fabulous. The spacious room gleamed. Triple sheeting on the beds. Extremely fluffy towels and robes. Elegant toiletries -- generously refreshed. My husband was annoyed that they wanted $13 a day to use the highspeed Internet hookup in the room. I was disappointed that all the rooms for 4 in the hotel had double beds. Queen beds are so much more comfortable. Otherwise, the room was very, very nice.", "helpfulness": 3, "user": "BBora", "date": "December 27, 2004", "id": 2947033}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "The Fairmont Queen Elizabeth was a lovely hotel. The Lobby was out of this world. The hotel is an excellent location nearby to almost everything you need, even the nightlife. However the rooms were disappointing they were clean but very small and certainly not worth the amount we paid. In fact we paid considerably less in Ottawa for a 3* hotel and it was far more luxurious than the Fairmont. Service was friendly but they allocated us a room that was already occupied. They did allocate us another room after we had disturbed the current occupant and then kindly charged us for the service a day or so after we checked out of the hotel. Again they did refund the charge after we complained. A nice hotel but I'm sure there are others of the same standard that are more value for money and less hassle in Montreal.", "title": "Nice but not worth the price", "helpfulness": 6, "user": "Usham", "date": "August 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 3779603}, {"rating": 5.0, "title": "Great Hotel and Location", "text": "Centrally located on Rene Levesque Bl. and right atop the train and shopping underground. Breakfast was an easy pleasure by taking the hotel elevator all the way down. Endless wonderful, coffee and pastry shops as far as the eye could see. Staff was always friendly and courteous. Room was clean and quiet with a great view. Somewhat small but large enough for 2. Parking garage staff was always friendly and never had to wait for our car. Montreal is a great city and the Queen Elizabeth Hotel is a great venue from which to explore the city.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 7, 2005", "id": 3744398}, {"rating": 3.0, "title": "Decent hotel", "text": "For those of you who don't know, this hotel is a Montreal landmark that has been there for more than 35 years, it was a CN Hotel managed by Hilton for a long time, Fairmont took it over within the last 5 years. The location of the hotel is very convenient for walking around downtown and old Montreal. The hotel is not particularly attractive from the outside. I understand that 2/3rds of the floors have been updated and those rooms cost more. I stayed in an older room which was ok, not great, bed was comfortable, bathroom was fine and clean, very nice view of the large church adjacent. Depending on the rate you can get, this is a good choice of hotel. There are some new boutique style hotels in Old Monteal that are very nice, but pricy. Also, this hotel is very convenient to the underground city and central train station and metro stations, you don't have to go outside at all if you don't want to. I ate at the Beaver Club restaurant in the hotel, it was one of the best meals I have ever had and I have eaten at some very nice places. The fixed price 6 course meal paired with regional wines was absolutely fantastic, with impeccable service, incredible local ingredients were used mostly and I cannot praise the Beaver club enough, absolutely first class, you cannot get better food anywhere. Prices are high, but for a treat, well worth it.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 8, 2005", "id": 3648871}, {"rating": 1.0, "title": "Lots of problems.", "text": "I've never stayed at a Fairmont property before, but have admired many from afar (Empress Hotel in Victoria, Chateau Lake Louise, Banff Springs, Palliser in Calgary, Frontenac in Quebec City, Hotel Vancouver). I was genuinely looking forward to my four night stay at the Queen Elizabeth, and imagined luxurious accomodations and pleasant, courteous staff.", "helpfulness": 18, "user": "ersatz", "date": "July 7, 2005", "id": 3646141}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "How wrong I was.", "title": "Avoid in general, especially on Grand Prix weekend", "helpfulness": 6, "user": "Greg_London", "date": "July 5, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 4.0}, "id": 3638332}, {"rating": 4.0, "title": "wrong room????, but lovely", "text": "When we got there we got to our room tried from a long trip (we call them road trips this one we travled from Georgia to Montreal)we saw there were ash trys in the bathroom! so i thought the french people love to smoke! So i tallked to the front desk and they said they messed up (expedia dident) so we got a room smaller by a foot in another side fo the hotel but the view was MUCH better.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 12, 2005", "id": 3468047}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "The Breakfast Buffet is to die for with butler like peropl with the best hot tea ever, and it is connected underground to everything! al in al it was the best hotel iv'e ever stayed at i would defently suggest it, My son loved it!!", "title": "Perfect Location!", "helpfulness": 8, "user": "gchu4mkay", "date": "April 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3325588}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "P.S. the picture is ot the view in our second room", "title": "Good experience", "helpfulness": 9, "user": "Antonia39", "date": "March 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3298770}, {"rating": 2.0, "stay_parameters": "Stayed December 2004", "text": "This was our first trip to Montreal for a quick getaway. The location of the Fairmont could not be better. Underground access to the train and the underground city. The airport shuttle left us right in front of the hotel. Shopping, restaurants and tours were in comfortable walking distance. The staff was extremely pleasant, accomodating and knowledgeable. The interior, elegantly decorated. If you want elegance, service, access and convenience, the Fairmont Queen Elizabeth is the place to stay!", "title": "Not in good weather", "helpfulness": 6, "user": "sledxl", "date": "March 19, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3287841}, {"rating": 4.0, "title": "loved the Queen Elizabeth!", "text": "We just returned from our first trip to Montreal, and our experience at Fairmont The Queen Elizabeth was overall quite positive. The staff (with the exception of one grumpy maid) was unfailingly polite and helpful. Three days into our stay, we requested a room change as we had some talkative, night-owl neighbors, and an even nicer room was found for us immediately even though the hotel was sold out. For location, this hotel cannot be beat. Directly beneath is the fabulous Underground City, the central train station, the Metro, and links to just about anywhere you want to go in the city. We liked the hotel restaurants, but also enjoyed the many less pricey dining opportunities in the Underground City. We would definitely stay at this hotel again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 16, 2005", "id": 3195418}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 4, "variance": {"poor": 104, "average": 232, "very good": 517, "terrible": 42, "excellent": 495}, "aka": "Fairmont The Queen Elizabeth Hotel Montreal", "slim_ranking": 0.294117647059, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "At the center of Montreal's vibrant cultural and commercial district sits the city's grandest and most gracious hotel - Fairmont The Queen Elizabeth. Located above the train station (Via Rail & AMTRAK) and connected to the extensive underground city of thousands of boutiques, restaurants and cafes, and within walking distance of sports and cultural attractions, this Montreal hotel reflects the city’s distinct elegance and charm."}