{"user_rating": 3.5, "review_count": 1307, "name": "Fairmont Jasper Park Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "5 star service from the moment you arrive. Valet parking. Loads to do. Excellent gym and pool. Great rooms. The golf course is one of the best in the world for the views. The service in the pro shop was superb, they got me a tee time with 3 great local members who were very friendly.", "title": "Quality!", "user": "Stickmanden", "date": "June 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162914171}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "On a recent tour of the Canadian Rockies we looked forward to our time at the famous Jasper Park Lodge. My wife and I were disappointed.", "title": "Not up to snuff", "helpfulness": 1, "user": "reh148", "date": "June 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 162906233}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had made our reservations several months ahead of time. When we arrived we were placed on the second floor of a old motel unit with no view. When I inquired, the desk clerk admitted. \"oh, the convention people got all the good rooms.\"", "title": "Fairmont Lodge Jaspar", "user": "Philwhill", "date": "June 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 162904990}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Our room (235) was bleak; the balcony featured two chairs which desperately needed painting and a table which should have gone in the trash. The balcony had not been swept in some time. The wood around the windows was rotting.", "title": "I amazing views from your door", "user": "Sandra B", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162700956}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "The grounds needed attention. Most garden plots were laden with weeds, many areas of grass had not been mowed in some time. Paving stones were loose or missing on most walk ways.", "title": "Disappointing", "user": "Caz293", "date": "June 1, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 162630932}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Describing the Jasper Park as a lodge is about right as the layout especially the cabins and rooms mean you really feel like you are not in a hotel as such. We've stayed in other Fairmont's before in Banff and Lake Louise but this is not as nice. I don't agree with some of the comments on here that it doesn't deserve the Fairmont name it just needs a bit of TLC and perhaps better procedures. I think some of the cheaper rooms must be in need of some repair but ours was fine. Skiline.co.uk who booked it for us gave a choice of room types and we went for the mid priced option which seems to be the way forward. Some of the reviews give the impression that the cheaper rooms may be the ones in need of some work. In terms of its setting its a stunning place and the skiing at Marmot Basin was fantastic.", "title": "Very nice but not as good as other Fairmont's", "user": "Susan G", "date": "August 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117497074}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I thought this was the place to be in Jasper and wondered why it did not get good ratings in tripadvisor. Now I know, and feel very complex about that.", "title": "Wish I could give the higher rating...", "user": "Cattledogs", "date": "August 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 2.0, "service": 5.0}, "id": 117329786}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The ground was amazing. Nicely maintained, and every staff seems to work very hard to keep it that way and to be very friendly. I also learned that the golf course was designed with the care for wildlife. Golf courses are usually full of chemicals, and I hope Fairmont keep it wildlife friendly.", "title": "The best Fairmont setting we've experience for a beautiful, peaceful, and relaxing holiday.", "helpfulness": 1, "user": "Elizabeth G", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117201872}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We got the Lakefront Suite, \"a premier accomodation in the Lodge.\" We checked in about 5pm, and was given the room right away. When we got there, the room was not ready. It was quite upsetting to wait outside with the luggeges for a room required over $500/night (our rates were not that high). I asked the cleaning manager - who came to help the staff and was upset that the room had been given before it was cleaned - whether we should go back to the main house. She said that the whole crew could get the room ready in 5 minutes. So we waited outside in a light rain. Then the repair staff came with a plunger (tactfuly hiding it). Oh great....", "title": "So Beautiful", "user": "EdmontonMom97", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117152654}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "They certainly cleaned up the room well and we went in. Unlike a photo inthe website, the room was dark and old. It was quite large with a fireplace, but the carpet seemed to be old, and the large table had a huge scratch on it. The suite has the update bathroom with a glass enclosed shower and the separate deep tub. although the bathroom was tastfully desinged, I was not happy to find large molds in the corners of shower stall.", "title": "Beautiful Scenery but dated and not up to Fairmont standards", "helpfulness": 2, "user": "Helaine L", "date": "August 21, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0}, "id": 117054544}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This was our first stay at a Fairmont in some time, and while it was nice, we left a little disappointed. There are positives - the beautiful location, good facilities and friendly and enthusiastic staff. But we felt that the hotel promised more than it delivered. In part, we were influenced by the Fairmont bedroom, which was rather more like a small, tarted up, motel room than the luxurious room we expected. Food on the Emerald patio was good, but no more than that.", "title": "Nice, but doesn't quite deliver on its promise", "user": "Timor", "date": "June 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 162619687}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel chain has become a no go for me. This particular hotel was desperately tired, dirty, charmless and in desperate need for modernisation. We stayed in one of their premier rooms. for $1000 a night, i do expect to get a clean room. For the price, I expect four seasons quality. Instead one gets a deep sense of being taken advantage of. Fairmont clearly have hotel in wonderful natural locations and use that as an excuse to be pathetically lazy.", "title": "Fairmont once again disappoints", "helpfulness": 2, "user": "Andrew B", "date": "May 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 162342247}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Had not stayed here for some years but decided to stay based on a web promotion. I thought I was requesting a \"cabin\" which to me meant one of the cabins on the lake with a sitting room. Instead we were placed in what is basically a hotel room along a corridor, just like an off-highway motel. There were children on one side, and a party on the other side, which went on until midnight. Rooms could use some updating but there were some nice touches - lots of towels, Keurig coffee maker, proper kettle, proper cups and glasses and even creamers in the refrigerator. Did not use the restaurant as it is very price-y. Did have coffee in the Emerald Lounge and that was nice - good service. All in all a bit of a disappointing visit but would return if I could afford a better room!", "title": "Not what it used to be", "user": "bonbon41", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 162297213}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "for the over the top prices you will have to pay to stay here its not worth it, the so called cabin we were staying in was no more that 4 hotel rooms in one little building called a cabin. The room was dark and dingy the curtains were falling off and were a nasty brown color, the bed was not made very neatly even though it was comfortable it was small for a room for 2 adults it was maybe a twin size bed. The bathroom was dirty the floor had old cracked tiles and pink insulation on the floor from who nos where, the lights was dim and there was no vent fan so the steam had no where to go and the wall paper was peeling off the walls, the room it self was not easily temperature controlled and no AC the windows screens were broken so if opened the bugs had free access to the room, the main doors were old and crapy did not feel safe at all, the floor were a gross green color and uneven floor boards that made so much noise when you walk on them you neighbours hear every move you make. the food was good but over priced, the only saving grace for this place was the service that was amazing but still not worth the $700(we only stayed as it was payed for us ) a night when you can stay in town for the same the same quality for $130 a night and not have to drive every time you wanna go somewhere in town. save you money and use it for the tramway or the ice fields and you will still see the same beauty that jasper national park is.", "title": "Not worth the money", "helpfulness": 2, "user": "james f", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 162051440}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We have stayed at the JPL before and had a great experience, but after this stay, we may make different choices in the future.", "title": "One problem after another", "helpfulness": 1, "user": "RunerChickie", "date": "May 27, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 162048195}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We booked our deluxe room through a website where we got 50% off the overnight price. We thought this would be our one lash out for our holiday and were a little disappointed with the rooms. We too were greeted with over zealous bell and valet guys and felt like we should be out of our car before we had a chance to unbuckle our seat belts. There is no doubting that the hotel is set in magnificent surroundings, but it would not be worth paying full price if you stay in the deluxe room. They are out dated and our room had a door between our room and our neighbours, which wasn't very sound proof. I could not believe that access to the internet was not standard in the rooms.", "title": "Dont pay full price", "helpfulness": 10, "user": "Kyrastef", "date": "September 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 8670629, "likes": {"liked": "— The bed", "disliked": "— The price!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "All the staff were very nice but far too over the top! I suppose if you paid full price you might want this???", "title": "Up close and personal with nature...", "helpfulness": 2, "user": "RLS_ATL", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8511880, "likes": {"liked": "— Relaxing ambience", "disliked": "— Some rooms are in need of modernisation"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The bed was very comfy though!", "title": "Extremely Overrated", "helpfulness": 5, "user": "JohnSocal", "date": "August 25, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8501708, "likes": {"liked": "— Nothing", "disliked": "— Service"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The Fairmont Jasper Park Lodge (JPL) blends in well with the serenity of its surroundings. The majority of \"rooms\" are located in small cabin-like lodges.", "title": "Best bedding in the world", "helpfulness": 2, "user": "funtravelfun1", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8498428, "likes": {"liked": "— bedding, view", "disliked": "— expensive"}}, {"rating": 3.0, "title": "Not worth the money", "text": "We had two rooms, one of which was an original room in need of updating - but spacious; the other room was newer but slightly smaller. The accommodation is quite basic with no air conditioning or high speed internet (available in the main lodge). Don't let this discourage you from staying at the JPL, since the weather rarely becomes warm enough to warrant a/c.", "helpfulness": 3, "user": "LRizzuto", "date": "August 22, 2007", "id": 8470648}, {"rating": 3.0, "title": "Five star location but three star accomodation", "text": "We stayed here as part of our tour of the Rocky Mountaineer Journey Through the Clouds Discovery Drive which was generally very good.", "user": "slj60", "date": "September 20, 2011", "id": 118363328}, {"rating": 3.0, "title": "a bit dissapointing", "text": "This was the second Fairmont hotel we stayed at and out of all the five we stayed in during the tour, was the one that was in most upgrading.", "user": "surgeon71", "date": "September 18, 2011", "id": 118282892}, {"rating": 4.0, "title": "Grand Old Resort", "text": "Before we arrived the hotel contacted me via email asking if they could book any tours, or make any reservations for us which I thought was good. We had a welcome note in our room on arrival with some chocolates which were lovely.", "user": "edward19", "date": "September 17, 2011", "id": 118236228}, {"rating": 5.0, "title": "Peaceful Destination and Amazing Pool", "text": "We were very lucky with the Junior Suite cabin we were given because it was directly on the lake and therefore had a beautiful view. The cabin itself however, whilst comfortable was in need of an ungrade. The bathroom was very small and the bath over the shower had poor water pressure. The only airconditioning in the room was a stand alone unit on the floor and I'm not sure if the hot water could function without the heating on because we noticed hot air coming out of the heating vents which made the room hot.", "user": "Chernyfam", "date": "September 16, 2011", "id": 118208979}, {"rating": 1.0, "title": "Great if you are on school camp, a backpacker or on a budget bus tour.", "text": "I agree with other posters that this hotel does have a feel of a holiday camp about it but that is the layout of cabins around the extensive grounds. The grounds are very well maintained and there are some very pleasant walks and places to stop and sit around the lake. You will see lots of wildlife while staying here and that adds to the enjoyment.", "user": "Winnie999", "date": "September 15, 2011", "id": 118177084}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "For a Fairmont property, this should not be considered 5 star, but is still a very beautiful place to stay. These are \"cabin\" rooms, very roomy, with fireplace and additional sitting room, but probably not what most 5 star travelers are expecting. The cabins surround the lake and you are truly in touch with nature. We ate at the Emerald Lake dining room, al fresco and it was very nice. Driving around and parking here is rather tricky as the roads are all one-way. Service was great though, but for the cost, I'm not sure it was worth it.", "title": "A beautiful, secluded place to stay", "user": "Murphy5708", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163577080}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We recently stayed here for one night - the worst Fairmont experience I have ever had. While the Lodge itself is very nice - the cabins and surrounding sidewalks/patios are a disaster and certainly not up to Fairmont standards. On a relatively warm day with no wind - our room was a toasty 83 degrees - not fun. It took 3 calls to the Lodge to get a maintenance man to our unit. He essentially said that the \"heat\" was turned off but that as the heating units were located in the floors there was nothing he could do. Hmmmmm. And it was not just us - there were at least 30 others with us - around 15 cabins that had the same experience. And the surrounding brick/concrete patios? A disaster - cracks, missing concrete and so forth. And the exterior room sidings were scratched and in need of repair. We will not return..........", "title": "Hot Cabins", "helpfulness": 1, "user": "JD1946", "date": "June 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 163483816}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed in one of the older cabins/rooms and it clearly needs renovation. The location is fantastic set on a truly beautiful lake. The Lodge is a $20 taxi fare (each way) from Jasper. The Lodge has a free shuttle service but that only runs during the day with the last one being at 6pm. It didn't really matter as the township of Jasper is very small.", "title": "A bit old but great location", "user": "SydneyTraveller_2008", "date": "June 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 163191520}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The golf course is the best I have seen and is clearly the winner at Canada's No. 1 golf course. I strongly recommend (if you are even the slightest bit interested in golf) you play. The Pro Shop staff were fantastic and whilst I did not see bears on the day I played - bears are often sighted on the course.", "title": "Lake-view cabin feeling", "user": "CeBfromToronto", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163180115}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "A great location and I would return, even if the rooms need modernising (which they have started).", "title": "Pretty good lodgings at an Amazing golf course", "helpfulness": 1, "user": "the_seahawkfisher", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 163093588}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "From the moment you arrive at Jasper Lodge you are made so welcome by the staff who are so friendly and make you feel so welcome .I stayed in a cabin overlooking the lake which was great. This type of accommodation is also very suitable for people with children as there is plenty of room in the cabins .In the main part of the lodge there are 2 roaring fires which makes its very welcoming with very comfortable lounges. There are several restaurants so you can have a choice. The meal in the dining room was outstanding with quality food and service.Room very comfortable. The lodge is situated 3.5 klms out of Jasper and gives you the feeling of really being in a national Park surrounded by the Elks that I saw just coming into the lodge. There is a shuttle bus goes into town from the lodge several times a day.I hope to return again one day.", "title": "Outstanding Lodge", "user": "66Jackie", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180537138}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "As a very comfortable base for touring the local area, JPL is great. Its stunning location on Lake Beauvert and outdoor heated pool are superb. We were 'sold' an upgrade to a lakeside suite on checkin and would recommend that move to others. With a separate sitting room and dining table, the view directly over the lake to Whistler mountain made us smile every day. We lit the wood fire a couple of evenings - for the effect.", "title": "Stunning location and an overall good experience", "user": "27kwai", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180537070}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Little extras like being able to use the fridge (without the common overpriced and unwanted pre-stocked drinks on trembler devices) were helpful. But not having a hand shower to wash hair without taking a full shower were niggles. Our main criticism would be the tired carpets (gripper rod showing at the front door and at the bathroom) and slightly erratic room service (turndown service on just half the nights). And the plumbing was a tad noisy - when used either in our room or the room above.", "title": "Dashes the dream holiday", "user": "DifromBrisbane", "date": "October 10, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 180524879}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The wildlife in the grounds was amazing. And using the 92deg outdoor pool with frost in the air and stars in the sky was out of this world.", "title": "Beautiful View of Lake and Quiet Hotel", "user": "KellyAnn294", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180509750}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The Fairmont hotel chain is really let down by this property. It is in dire need of renovation as it reminds me of a cheap motel. The experience was poor from the outset, we had requested a king room and was initially provided a queen room. That sorted out with a quick shift to a king room, we found ourselves in a room with a shabby appearance, a telephone that didn't wok properly and air conditioning that couldn't be adjusted. We couldn't get room service to answer and after two calls to reception someone turned up to our room to take the order. By the way all the rooms are in separate buildings spread out across the property which on a miserable wet day is just awful. We did try to eat on the lodge but the food presentation was disgusting to say the least - burnt fries with the skin still on it and the fish was as hard as a rock and when we complained we were told that this is how they cook in Canada. This excuse was rubbish as the oil hadn't been changed for a considerable amount of time, the staff were too lazy to skin the fries and the fish was just hard - all signs of a bad chef. Overall we noticed a lot of staff standing around doing nothing and making no attempt to even look busy.", "title": "Beautiful Location-Little attention to details", "user": "Lacework", "date": "October 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 180331481}, {"rating": 2.0, "stay_parameters": "Stayed October 2013", "text": "I stayed at this property for a night in 2005 and decided to try again this time round. I love Jasper National Park and it's raw and unblemished beauty. Unfortunately there aren't many good hotels to choose from. I had some reservations about coming back to this hotel and having read all the bad reviews of this facility, I was quite anxious about my two night stay.", "title": "How the mighty has fallen ...", "user": "SingaporeGuy10", "date": "October 13, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 180751776}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "In short - nothing seems to have changed! It's old, dated, not well maintained and desperately in need of a major refurbishment. For the high prices that the hotel charges, customers deserve much better!", "title": "Wonderful Lodge", "user": "CherBear123", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180644780}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "First the positives - lovely and unspoilt surrounding, beautiful landscaping and the views of the mountains are unparalleled.", "title": "Always excellent with great service!", "user": "Stinger55", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180617148}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Everything else is downhill all the way. The so-called lakefront suite which I selected (costing some CAD$700 ++ per night) was old, dusty and looked very worn out. The carpets were stained and dirty. There were a number of scratches on the wooden furniture. Overall it just feels like a cheap chalet but at a very high price.", "title": "An excellent lodge in an outstanding location", "helpfulness": 1, "user": "TheCritic2000", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180596617}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The front desk service was average but the concierge closed by 8:00 pm! As it was thanksgiving weekend I could see that the staff were struggling everywhere.", "title": "Fairmont Jasper", "user": "Waterfalls609", "date": "October 11, 2013", "detail_rating": {"sleep": 1.0, "location": 4.0, "value": 1.0, "rooms": 1.0}, "id": 180540774}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This was probably the 10th or 12th time we've stayed at JPL, and it never disappoints. (My profession holds an annual conference at the Lodge.) This time, it has just been decorated for Christmas, following the Christmas in November events earlier in the month, so the setting was particularly beautiful, with swags, wreaths, an enormous Christmas tree in the Great Hall, and lots of lights on buildings and grounds. The JPL is a resort-style Fairmont property, a collection of small buildings with multiple rooms, situated all over a large property, and a main building for restaurants, administration, shopping, etc. We had a lakefront room in a building that housed about six rooms. We had a lovely view of Lac Beauvert, on which the winter ice was just beginning to form. As in most Fairmont properties, the room was nicely appointed, with nice amenities such as kettle, coffeemaker, hair dryer, etc. The bed was very comfortable and the toiletries above average quality. The one thing I can fault the Lodge for is the soundproofing: as others have commented here, it's poor between cabins. For two of our three nights we shared a wall with a family in the next room which had at least two toddlers and an infant -- their presence was evident (blessedly, primarily during daylight hours). We also heard a good deal of noise from the bathroom fan of the adjoining room. Otherwise, the stay was great -- a wonderful respite from the city. JPL may not be the best choice for those with mobility issues as some of the cabins are quite far-flung and particularly during winter months paths and roads can be snowy/icy. That said, though, the snow that fell while we were there was cleared quickly from the main pedestrian path. Parking, in some areas on site, can be quite removed from cabin areas as well. November in Jasper is shoulder season, so there's often not a lot going on in the town, and many of the restaurants are closed. But getting away to the Lodge is a real treat that shouldn't be missed, and offers solitude, luxury, excellent service, and gorgeous surroundings.", "title": "The Great Canadian Lodge experience", "helpfulness": 3, "user": "alphabetkid", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11055993, "likes": {"liked": "— Luxury in a specacular setting", "disliked": "— Soundproofing could be upgraded"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We have just returned here after 15 years and were not sorry. Quite the opposite, as the weather was perfect this time. I have read the negative reports with interest as we did not encounter the issues of price or bell boys as we had the hotel included in our Tauck tour price. I was glad we did when we ate at the Edith Cavell restaurant at £75 a head, which I can't honestly say was worth it, but the Moose's Nook the next night was half the price and twice as good - in fact we had the boar bacon wrapped bison which was cooked to perfection and one of the best meals we have ever had. We had just come from the gorgeous Chateau Lake Louise which is one of my favourite hotels in the world and there is no comparison with the rooms there as JPL is totally different. No a/c. Old and dark, but the surrounding scenery makes up for all that as how long do you spend in a room? The beds were very comfy and the bathroom was clean and functional. We found all the staff to be friendly and helpful. We booked a trip to Maligne Lake (which is a must if you want more scenery!), and a horse ride. Some of our group played golf which I gather is very expensive but exclusive. We enjoyed the walks around the lake. Despite the fact that it's old and expensive we still love the place and have vowed to return, but only as part of another Tauck tour!", "title": "Fantastic food", "helpfulness": 2, "user": "Pearl65", "date": "October 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10249373, "likes": {"liked": "— Setting", "disliked": "— No air con"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Booked thru Amex Platinum, and upon arriving Lodge said they did not have our reservation. We called Amex to verify and they gave me my confirmation number from the lodge, but the lodge insisted no reservation was made. No problem though (thank goodness) because they did have some extra rooms. Upon check in there were 2 other couples checking in and they were both having the same problem checking in as us, so it seems to me that the Fairmont's computer system may be faulty, because we all had confirmation numbers. So do yourself a favor and call ahead to double check your reservation before you leave home. We were given the best rate at $149/night and for $50 more were \"upgraded\" to their best suites before you can get a cottage. The \"suites\" were overlooking the lake, and they were well equipped. Wood buring fireplace, large sitting area with tv and bar, and nice table and chairs for room service or dining in. The bedroom was pleasant with wood shuttered walls to close off the area, and another tv in a cabinet. Bathroom was marble with seperate tub and shower. Double sinks which were a plus. There was also a small area with fridge, microwave and coffee/tea bar. We thought for the price we paid it was ok. The staff always seemed to go above and beyond to help you while you were in the common areas. Here are my pros and cons:", "title": "Not bad, but not worth the price if paying full price", "helpfulness": 4, "user": "Homergirl", "date": "October 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10079409, "likes": {"liked": "— location, location,location", "disliked": "— rooms not well insulated AT ALL"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007", "text": "Pros:", "title": "Fairmont - Help Them or Divorce", "helpfulness": 11, "user": "wlb1204", "date": "October 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 10044378}, {"rating": 1.0, "title": "What a rip off!!!!!!!!!!", "text": "Being there in the \"off season\" for the bargains. Staff were great. Lounge area was nice to have a cocktail or lunch/snack. The shops and restaurant downstairs was great as well. Outdoor pool looked great although we did not go in, and the workout area adequate. The Sushi restaurant is a hidden gem in this restaurant, but be forwarned if you like sushi to call ahead as it only sits 16, and they have nothing else besides sushi (no soup,salad or desserts). Location was lovely, what a beautiful part of the world to explore. Jasper in general was a terrific town with no snootyness. Loved the wood burning fireplace, and the patio to enjoy the sunset or views. Room was spacious and was clean.", "helpfulness": 10, "user": "rnaman", "date": "September 16, 2007", "id": 8726642}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "We have stayed at this hotel several times and each time it seems to get a little better. This last weekend we staying in a Lakefront suite and enjoyed the beautiful view of Lac Beauvert each morning.", "title": "Amazing Hotel in an Amazing Location", "user": "gary w", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180071022}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The staff are friendly and accommodating, helping every chance they get. We got so comfortable with the staff, that we even hired a babysitter, Carol from the concierge desk who did a wonderful job with our 2 year old daughter.", "title": "In need of a refurb", "user": "rojaan1", "date": "October 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 180003895}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "With the boathouse, the kids club, the outdoor pool, the games room and miles and miles of hiking trails there is never a shortage of things to do as see.", "title": "Best in Jasper", "user": "James L", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179986938}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We were there as part of a corporate retreat and as the meeting planner I was dealt with in a very professional and courteous manner. The catering staff was spectacular and our Sunday morning brunch was top notch as always.", "title": "Over Rated", "helpfulness": 1, "user": "sbarnsley", "date": "October 6, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 179979628}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Thanks for the amazing weekend. The family, my coworkers and I appreciate it.", "title": "Beautiful setting but overpriced", "user": "Lesa G", "date": "October 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 179966938}, {"rating": 5.0, "title": "So peaceful place", "text": "Stayed 1 night @Jr Suite Lakeview King. The room is very clean and when we arrive he window was opened so the air so fresh. The service also super, during the turn down service I mentioned use to have Chocolate, the lady quickly came back brought us a bunch. That night we ordered room service and food was very tasteful. Will definitely go back and stay longer.", "user": "1965shkid", "date": "October 9, 2013", "id": 180281057}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I think this property is trying to become a four star, but they have a ways to go and I sincerely wish them well. We used the JPL as our base for three days of hiking and chose it for its setting and the availability of the Athabasca cottage, the smallest of their signature cottages as it was just my wife and I. We wanted the cottage for its privacy, its location, and anticipated luxury considering its $800+ per night price tag. It was a big disappointment on two levels: it needs a lot of upgrading and doesn't even come close the fine line between shabby and chic. It's the former all the way and misses the charm quotient by a mile. Secondly, there was a sizable masonry construction project, complete with masonry power saws, going full tilt daily on the bank of rooms right next door. The cottage should have never been put on the available list to begin with, and at the very least management owed us a phone call prior to arrival. At this point I need to give management a nod, because when I complained to the night manager he had us moved the next day to a lakefront suite which was fine. He said for our troubles (we couldn't unpack, but they did move our bags while we hiked the first day), the hotel was taking $100 a night off the suite, but honestly I believe that was the original price of the suite to begin with. Whatever...at least it was quiet. Another gripe is the parking situation. If you drive your own car or have a rental car here, good luck finding a spot near your room. The availability of parking spaces near the rooms is totally inadequate. JPL will remind you that their valet is free and will bring your car to your building. They are correct and that scenario isn't too bad in the morning. However, it you're returning from an evening out and there are no spaces in front of your room, you must take your car to the main lodge, give it to the valet, and hop a golf cart to be driven back to your room...and that is a pain in the rear, especially if the weather is foul or you're unlucky enough to get some inebriated conventioneers with lit cigarettes in hand as your cart buddies! We saw many cars parked on the side of the road in front of room units because the guests didn't want to hassle with the inconvenience. I did it myself a couple nights although you'll receive a warning sticker that they have the right to tow your car. Our first night, since we arrived late, we just wanted a quick bite to eat and chose the Emerald Lounge because we thought it would be quick and we'd get a decent sandwich or something. We were wrong on both counts. The place was really understaffed (though they tried hard) and the food was marginal. It didn't help that there was a gaggle of convention folks smoking up a storm right outside a corner double door, and each time someone entered or exited that particular door into the dining room, a purple foul haze greeted the diners. We never ate at the hotel again, and enjoyed the many good establishments in Jasper. The one he JPL has going for it is its location. It is stunning, and the surrounding view is remarkable. It's a quick and easy drive to downtown Jasper, and the Park and countless trails are at your door step. We will be back...for the hiking, but will stay elsewhere next time.", "title": "A beautiful property in need of bettering itself...", "user": "MLP50", "date": "October 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 180231326}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "The setting and scenery are spectacular and our experience with the golf staff and at the golf course was outstanding but for the price of accommodation, there are a few problems that need to be addressed. The hotel has wonderful amenities and a lovely spa, which I have enjoyed on a previous stay. The staff are friendly and accommodating. Our room was clean and comfortable, but the furnishings were old and ordinary. The bathroom tiles looked shabby and stained in the corners and it was poorly ventilated. We didn't have a bar fridge (there was a cabinet and label for one) and the coffee maker didn't work. It was replaced with a working model, but the housekeeping staff didn't leave us any coffee (only decaf which we don't drink). We couldn't access the wifi even after given the address. We booked 2 rooms as we were traveling with friends (driving up separately) and were told at curb-side check-in that they hadn't arrived. We were assigned a room and given a key, only to find that our friends had indeed checked in an hour earlier with the front desk and were given the room that we were given. We had to return to the main hotel and lobby to get another room assignment and key. It was surprising that there was no communication between the curb side check-in and the front desk.", "title": "More Attention to Details to Justify Prices", "user": "Lynn R", "date": "October 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 180210648}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Unless using valet parking, parking can be difficult. There don't seem to be enough spaces and often when a parking space is found it can be quite a distance from the room. There are loading areas, though, where luggage, etc. can be dropped off.", "title": "Great as usual", "helpfulness": 1, "user": "Richard F", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180196326}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "This is a lovely setting, but it's very pricey and it was a splurge for us. We have stayed in less pricy accommodations that were just as good, or better than our stay here. I feel that the management needs to step it up a notch to match the accommodation experience with the fantastic setting.", "title": "Love the surrounding but not the lodge", "user": "smallman", "date": "October 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 180170124}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I've used your site for years so it's about time I contributed. Last December I took two of my children - boys aged 11 and 17 - to Canada for their first white Christmas. I had stayed at the Jasper Park Lodge on a previous visit and thought it would be ideal. I was right. The range of activities was extensive and exciting for the kids; the slopes at Marmot Basin were just as good for the experienced snowboarder as for the first-time skier, and the hotel and staff, particularly the concierges, were welcoming, friendly and cheerful. The food is spectacularly good, particularly breakfast (with doggybags encouraged for skiers) although dinner was a bit pricey. The Christmas Day feast, Yule Log ceremony, and skating, were everything snow-starved Aussies could hope for. But what makes me want to return again and again is the wonderfully laid-back but friendly attitude of the staff.", "title": "A perfect Christmas", "helpfulness": 2, "user": "mumdoc", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8469934, "likes": {"liked": "— the staff", "disliked": "— the price of food"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Strongly recommended.", "title": "Nice but very overpriced", "helpfulness": 6, "user": "bevier", "date": "August 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 8450859}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This place is OK but on arrival we were greeted by over friendly, tip wanting bell boys who were very OTT. On booking in we were offered to become members of the presidents club which was free and enabled you to use the internet in the main lodge, there is no internet in the rooms that we were in. The grounds are lovely and there are Elk grazing around the blocks. The problem I had with this place is that at the price they were charging you had to pay for everything else above the room. A pizza delivered to your room would cost about Can$40 with all the charges and then a tip on the top. If you wanted ice you had to pay extra and the charges in the restaurants was over the top. It felt as if everything you may want was going to be expensive and after paying £210 per night you should be offered something free. We wanted to hire a bike to ride around the beutiful lake but at Can$20 per hour we decided not to bother. The room was lovely with its own small verandah that you could sit out on and watch the golf carts whizz by. I would not stay at this hotel again until the sort out the extra costs.", "title": "Ideal for Retirees", "helpfulness": 3, "user": "travlalotNy", "date": "August 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 8448135}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My family (3pax) was on a 2 week holiday, starting from Lake Louise. We liked what the Jasper website promised so we decided to pamper ourselves with a luxurious lake-view suite(more than CAD700/night!!). Unfortunately, the website looks a lot more elegant and exclusive than it promised. When we checked in, we realised that most of our 'neighbours' seemed to be in their 60s, 70s. There's also a pathway 'disrupting' our lakeview, so it's not value for money since we are paying more. It's too commercialised. There are lots of rooms available nearer the date and also might get a good 30%off. We love Jasper, but wish we had stayed elsewhere that would give us a more luxurious feel. Among all the 5hotels/lodges we stayed throughout the stay, this turned out to be the most disappointing, and what irony!!", "title": "Part of the Triple Crown", "helpfulness": 7, "user": "exmarsa", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8445992, "likes": {"liked": "— Cosy lodgelike feeling", "disliked": "— Overpriced (but you know that in advance)"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Just returned from a week in the Canadian Rockies and stayed at all three Fairmont properties. Let's get the obvious issue out of the way first: yes, they are ridiculously priced. If one is going to dwell on price, may I suggest that you stay elsewhere or camp. The reason to stay at these properties is for their historic value and unrivaled locations. That said, this is probably the least spectacular of the properties. Don't book a room online. Speak to someone who can explain the differences between the rooms, their setting and cost. Our party booked rooms at two different price levels (a 50% difference). Both were comfortable and clean. The pricier rooms were larger with a small sitting area and closer to the lake (but with no view). The units are spread out (no high rises here). You may not find parking near your room, but at least they don't hit you for a $30 a day parking fee(as in Lake Louise and Banff). We drove around and around looking for the room and parking, only to realize afterwards that we were but a two minute walk from the main lodge. There is no air conditioning here, and on a hot day the rooms can heat up. But who is going to spend the day in their room in Jasper? At night, we slept comfortably with the windows open. An important tip here: join the Fairmont President's club. It costs nothing to join and you will not have to go check in. Your key and a map will be waiting for you curbside as you drive up to the main lodge. Staff was mostly helpful and friendly, with the noticeable exception of one server at breakfast who appeared uninterested and overwhelmed when we ordered breakfast a la carte instead of partaking in the buffet. At $25 a head, the buffet is a waste unless you are a big eater. It was actually cheaper to order coffee, bacon and eggs and toast a la carte - assuming you are willing to wait to get get it. Dinner was expensive, but actually quite good. The menus here hightlight items that are \"organic, local and sustainable.\" The venison was excellent and the tenderest I have ever eaten, albeit not very gamey. The BC salmon was also well prepared. All the Fairmont properties seemed to try hard to offer healthy meals - a pleasant surprise. One complaint: the concierge had no clue what restaurants were available at their Lake Louise property. In any event, there is a dining reservation desk with more knowledgeable personnel, so no real harm done. Overall, the cosiest of the three properties.", "title": "Great Family Spot", "helpfulness": 3, "user": "CaliSouthernBelle", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8400600, "likes": {"liked": "— Beautiful surroundings", "disliked": "— Remote location (long trip)"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Right on the heels of a three day stay at Chateau Lake Louise, my wife and I stayed at Jasper Park Lodge. I thought things were going to improve when I got a text from a customer service rep a few days prior wishing to make my stay enjoyable, we spoke and he blocked a room that he saidi was his personal favourite. What he failed to mention was that there was major excavation going on literally right outside our front door all three days with a front end loader going back and forth on metal slats that has never been lubricated, making it impossible for us to either work or sleep. The pillows were woefully lacking and when I requested replacements, there was a big issue. Our friends staying in the lodge went without hot water twice. While the grounds are beautiful, overall, a big disappointment meaning the end of our stay at Fairmont hotels.", "title": "Second disappointment", "user": "GeoffL", "date": "June 19, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 164472002}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We began our recent trip to the Canadian Rockies at the Fairmont Jasper Park Lodge and it couldn't have started any better. The property is meticulously manicured and the colorful Adirondack chairs are the perfect spot to sit and enjoy the beautiful mountain scenery.", "title": "A wonderful start to vacation", "user": "60763Lovetotravel", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164443763}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The staff was top-notch, especially the front desk and the concierge. Dinner at Cavell's was wonderful, but a bit too expensive. Overall, a great experience.", "title": "Truly special!", "user": "JSeils", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164253128}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "This is one of those unique properties with a magnificent, rustic setting. The staff were all exceptional but the real star here is the lakeside setting, comfortable log cabin rooms offering terraces or decks. Though not lakeside, we had a nice view of Lake Beaufort from our deck. The only negative was the extremely small and tight bathroom. Despite this, we loved our two night stay at this truly special hotel!", "title": "Spa Review", "user": "Bastion123", "date": "June 13, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 163917228}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I decided to check out the spa at the Jasper Park Lodge since it was my first visit to the property since the spa had opened. I have experienced quite few of the Fairmont spas, the Willow Stream spa and the regular hotel spas, from all over North America do I was curious how this one would rate.", "title": "Let down by meal experience", "helpfulness": 1, "user": "bentwhit", "date": "June 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163730803}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "What a lovely place this is. On our very short list of places we would return to. I would call it a cross between a National Park Lodge and a top of the line resort. The combination of low-key with elegant finish perfectly fit the bill for us. Completely unlike the high rise Fairmonts in Banff (think \"The Shining\") or Lake Louise (think Bellagio - Las Vegas - crossed with San Quentin). The Jasper property is a perfect place to relax and worth every penny. The one drawback is the service which suffers from the same amateurishness that plagues most summer resorts with a need for large numbers of temp employees.", "title": "How to chill out", "helpfulness": 1, "user": "martin66", "date": "August 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8397744}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "We stayed 3 nights at JPL on business. This was the third year in a row and most likely the last. The beds in the Fairmont rooms are extremely hard and uncomfortable. To eat your meals there is also very expensive; never mind the accommodation. The scenery, of course, is outstanding with the mountains, lakes and wildlife right close by. Time to try somewhere else in Jasper.", "title": "Hard beds and expensive!!", "helpfulness": 3, "user": "Mindy53", "date": "August 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8357809, "likes": {"liked": "— Beautiful scenery", "disliked": "— Hard beds"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Transferred to our Fairmont Room (standard room) by golf cart - standard for all guests! The Fairmont JPL is set in fantastic grounds, very well maintained. When arriving at out room we were greeted with a double bed, when we had asked for two separate beds (mother and 17 year old son!). Luckily, we were then upgraded to a Deluxe Room with Sitting Area (with two double beds!). This had a lake view (superb) and had recently been refurbished, with a brand new bathroom suite. On the first night we sampled in-room dining, which could not have been more exquisite. Yes, it's expensive - but then that's the Fairmont brand. Based on our experience, you truly get what you pay for.", "title": "Fantastic In-Room Dining!", "helpfulness": 2, "user": "Genius12", "date": "August 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8356479, "likes": {"liked": "— Room, View, Location, Quality", "disliked": "— Cost"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We booked this hotel with some trepidation after reading the reviews. However, we got a good last-minute rate and decided to take a risk for one night. We were quite pleasantly surprised. Check-in was a breeze - we are Fairmont club members, and were met at the curb by a friendly bellman who checked us in. We were upgraded to a lakefront suite - a pleasant surprise as we had not booked one. The room had a very comfortable King bed and the bathroom had been recently renovated. There was a small adjoining wood-panelled sitting room which afforded a wonderful view of the water. We had drinks on the patio - overpriced but romantic. We did not eat in the restaurant. Be warned that, like most hotels in the area, there is no a/c - it can get hot in the middle of summer, but cools down at night. I would recommend this property if you can get a decent rate.", "title": "Pleasantly surprised", "helpfulness": 2, "user": "BigBree", "date": "August 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8281110, "likes": {"liked": "— grounds,location", "disliked": "— expensive"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I just returned from a 2 night stay in a Lakefront Suite and it was the most over-priced hotel I have stayed in anywhere in the world. 900 dollars a night did not include breakfast or golf or even the use of a canoe. The setting is lovely (simliar to Banff and Canmore though) but the hotel itself is very average. On the first evening we ate in the Emerald lounge where the service was extremely slow (1 hour for food) and in the Meadows restaurant on the second night where both the food and service were mixed at best. The 900 dollar room was small and had no separate bedroom - shutters around the bed provide little privacy. No aircon.", "title": "Massively over-priced", "helpfulness": 4, "user": "CjMacca", "date": "July 24, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 8227039, "likes": {"liked": "— Location", "disliked": "— Everything else"}}, {"rating": 4.0, "title": "A big surprise", "text": "This was our 4th hotel, and the one I was most concerned about, it was our only hotel. How wrong I was.", "user": "Uktravellerabroad976", "date": "September 14, 2011", "id": 118134887}, {"rating": 2.0, "title": "Not for International Tourists", "text": "The service was fantastic, the spa amazing, the food lovely.", "user": "LilAl", "date": "September 14, 2011", "id": 118129629}, {"rating": 5.0, "title": "Beautiful but expensive", "text": "The only issue was the long walk back to our suite. However all in all a great hotel", "user": "Andrea W", "date": "September 13, 2011", "id": 118044393}, {"rating": 3.0, "title": "Breathtaking Views - mediocre stay!", "text": "This review is from the perspective of international travellers on tour through the spectacular Rockies. If this is you - Jasper Park Lodge is not a good option. You're much better off to stay at one of the accommodations in town.", "user": "lsj321", "date": "September 12, 2011", "id": 118021652}, {"rating": 4.0, "title": "Great memories", "text": "The Lodge is 15 min from town by car. The hotel shuttle service is infrequent and doesn't run in the evening, designed to make you eat at the Lodge.", "user": "SkyRattlers", "date": "September 12, 2011", "id": 118009774}, {"rating": 4.0, "title": "Highly recommend", "text": "Our accomodations were a spacious two room suite and bath, in what resembled a cabin. Our cabin had a large TV, Wi Fi, and coffee maker. We were directly on a gorgeous emerald lake and a very short walk to the main lodge and restaurant. There were many outdoor activities to choose from. We chose canoeing on the lake and a walk in to town. The walk was a little longer than we had anticipated, however transportation is readily available.", "user": "JuneDuke12", "date": "September 12, 2011", "id": 118006611}, {"rating": 5.0, "title": "Wish it was more than a nights stay!", "text": "Only stayed one night but would recommend this facililty to anyone who would like to tour the beautiful area around Japser, Alberta. It was great to rent a canoe and explore iclose to the hotel...took a drive up to Edith Cavel - highly recommended for spectacular scenery. Staff were pleasant and helpful... meals wonderful. Dinner with live music was a treat...and a chance to dance.", "user": "Liilgal78", "date": "September 12, 2011", "id": 118002510}, {"rating": 4.0, "title": "Beautiful setting in Jasper", "text": "If time allowed next time plan to stay a little longer... Weather was also best it could be- sunny and no rain in sight.", "user": "mustangsally010", "date": "September 12, 2011", "id": 117998688}, {"rating": 5.0, "title": "Old World Charm.", "text": "The Jasper Park Lodge is a beautiful lodge nestled in the Rocky Mountains of Alberta. We have stayed over the years in a number of the cabins, this time we were in a smaller interior cabin due to the lodge being fully booked. We would have preferred a lake view room, but it was our own fault for not booking sooner, our trip was last minute. Nevertheless, the room was fine, we had deer right outside our room early in the morning. We saw elk on a walk around the golf course and around Lake Beauvert. We ordered room service one morning and the food was fast and tasty. There was a cosy fire lit outside the Lodge one evening and we enjoyed a nice conversation with hotel staff and other guests. The Jasper town site to us is a far preferred destination over the busier and more developed Banff. We visit 2 - 3 times per year and have stayed at various places but our favourite place to stay in Jasper is at Jasper Park Lodge,.", "user": "joolesb", "date": "September 12, 2011", "id": 117969520}, {"rating": 2.0, "title": "Poor quality room and very overpriced", "text": "Our stay at Jasper Park Lodge was in one of the beautiful log cabins.", "user": "PWortley", "date": "September 7, 2011", "id": 117805779}], "location": {"country": "Canada"}, "stars": 4, "variance": {"poor": 206, "average": 273, "very good": 334, "terrible": 94, "excellent": 400}, "aka": "Fairmont Jasper Park Hotel Jasper", "slim_ranking": 0.352941176471, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Surrounded by snow-capped peaks and sparkling lakes, The Fairmont Jasper Park Lodge welcomes you to the Grand Rocky Mountain Lodge Experience. The charming cabins and rustic elegance make it the embodiment of peace, tranquility and natural beauty. Having the #1 Golf Resort in Canada, as rated by readers of SCOREGolf magazine, a luxury Spa, spectacular outdoor adventure opportunities, uncrowded ski slopes and fine cuisine, The Fairmont Jasper Park Lodge is more than a vacation...it's a life experience."}