{"user_rating": 3.5, "review_count": 899, "name": "Far View Lodge", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I was a little apprehensive after reading some of the other reviews, but we found our Kiva room at the Far View Lodge very clean and well maintained. The room was a bit rustic and the walls were on the thin side, I didn't hear any voices but coughs and sneezes could be heard. I was careful not to play the radio/cd player very loud but I didn't hear them from the other rooms. Our view was fantastic, topped off by seeing a bull elk the last morning of our stay. The biggest downside of our room was that the refrigerator froze all of our food. I would agree with the other reviews of the Metate room, the service was disorganized and extremely slow, I could only put up with it one night, the thought of going back was too much for me. The food itself wasn't bad. Unfortunately the Metate room was the only food option for dinner because the Far View Terrace had closed early for the season without any explanation that we could find. We did have a good lunch at the Spruce Tree Cafe.", "title": "Can't beat the location", "helpfulness": 1, "user": "chandlertravelers", "date": "October 11, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 10069159, "likes": {"liked": "— Location", "disliked": "— Dining options"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "A nice location spoiled by sub-par accomodations and lousy customer service sums up our opinion of this place. Because the next closest motel/hotel other than campgrounds is so far away and there is such a huge demand to stay within the park, we feel that management believes they don't have to try in the least bit to please their guests.", "title": "Another bad experience", "helpfulness": 3, "user": "4evertravlin", "date": "October 9, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 10059862, "likes": {"liked": "— Location", "disliked": "— Uncomfortable beds, poor customer service"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "We had read the numerous bad reviews so our expectations were not high. We knew the rooms were basic motel style with no TV. After all, we were there to see the sites; all we needed was a comfortable place to relax at the end of the day. Interestingly, their website tries to present the Lodge as an upscale hotel. Our stay occured a few weeks ago midweek in mid Sept. The crowds at Mesa Verde park were small; at times we were the only people at some sites. There were only a few other cars parked near our building at Far View Lodge. Unfortunately we did not have a good experience like the last few reviewers or we were unlucky to get a very uncomfortable standard room.", "title": "Typical National Park Lodging", "helpfulness": 1, "user": "moexplorer", "date": "October 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10046210, "likes": {"liked": "— Solitude inside Mesa Verde National Park", "disliked": "— Water saving shower head"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "After a full morning hiking the Fiery Furnace at Arches National Park and then traveling for over three hours we arrived at Far View around 7 p.m. We had booked a standard room with two queen beds for two nights. Upon checking into our room in the rear of the property we observed that the beds looked small for supposedly queen size so we decided to call the front desk to see if they had made an error. That's when we discovered that the phone didn't work. We go back to the front desk where we are told that they are aware that some of the phones in that cluster of rooms don't work. They also acknowledged that the beds are \"mini queens\" - whatever that means. They send a maintenance worker to see about the phone. He arrives very promptly. It turns out that the phone button that says to dial 0 for front desk doesn't work so he gives us a different extension to call that connects to the desk. Maybe I'm being picky but I would expect that the correct extension should be written on the phone in case of emergency.", "title": "Far View Lodge and Metate Restaurant were great for a Nat'l Park!!", "helpfulness": 5, "user": "Gwenster", "date": "October 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10044584, "likes": {"liked": "— The fact that it had a gourmet restaurant right on site", "disliked": "— Small bath tub"}}, {"rating": 3.0, "title": "Aramark gets one right", "text": "Next problem: the small queen beds are very uncomfortable. We are not large people but one of us keeps falling to the center of the bed because the mattress is saggy. After finally falling asleep around 10:30 p.m. a bus load of noisy tourists checks into the rooms all around us. Ten minutes later someone from the room next door is pounding on our door and asks us to call the front desk because THEIR phone doesn't work. I realize that the Lodge has no control over when a bus arrives but they do have control over their phone maintenance and where they assign rooms. Why would you place an independent guest in the middle of a tour group? Also, by the middle of the night, after a restless night because of the uncomfortable bed, the mattress pad has dislodged and is a lumpy ball under the sheets.", "helpfulness": 3, "user": "TexasTrails", "date": "September 28, 2007", "id": 10015221}, {"rating": 4.0, "title": "Reserve a Kiva Room", "text": "I also have a review for Mesa Verde's Morefield Campground, which provides some background on how we ended up at Far View Lodge.", "helpfulness": 1, "user": "Muriel12", "date": "June 7, 2008", "id": 16758687}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We booked our room the morning of the day of arrival. We arrived at the lodge right at the posted check-in time, but we were told the room would not be ready for at least another 30 minutes. No problem--there's plenty to do in the park.", "title": "Bad service, OK room", "user": "Bobbie_and_John_Z", "date": "June 2, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 16615587, "likes": {"liked": "— In the park", "disliked": "— Inept staff"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We returned another hour later and were given the key to the room. When I had made the reservation, I had plenty of options, but the staff member advised me to get the \"updated\" Kiva room. I recall it was less than $20 more than the \"not-so-updated\" rooms, so I went with it.", "title": "Convenience was worth it", "helpfulness": 2, "user": "carnbravila", "date": "January 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 12673555, "likes": {"liked": "— Convenience", "disliked": "— Size, lack of A/C, and lack of advertised view"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room was nicely renovated, and included a small but nice balcony that overlooked an expansive mesa. Two small chairs were included on the balcony. We had an amazing evening watching the wildilfe. Best moment of the trip was watching a female deer chase away a coyote that was pestering her young 'un.", "title": "Beautiful, but NOISY", "helpfulness": 3, "user": "AustinTX78745", "date": "January 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 12341260, "likes": {"liked": "— Beauty of Kiva room", "disliked": "— Lack of privacy"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2004, traveled with family", "text": "The room includes binoculars for lodge usage. (Be aware of fee if you leave the property with them.)", "title": "It is where you should stay in this park", "helpfulness": 2, "user": "travel035", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12011813, "likes": {"liked": "— Clean, comfy accomodations smack dab in the middle of the park", "disliked": "— Nothing, all is goo"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "After reading some of the negative reviews for Far View Lodge, we were pleasantly surprised (or we have lower standards). The rooms were simple and functional, but clean, althought the bathrooms (expecially showers) are dated and need a little renovation. But the rooms are typical of most National Park Service lodges that are operated by Aramark Services. The views of the park and canyons and valleys outside the park are spectacular, especially at sunset. Stars at night are awesome. Food at the Metate Room in the main lodge building is actually quite good, but the service is very slow (but polite). There is a good range of entrees ranging from burger platter (about $9) to filet mignon (about $32). Not a good place for kids to eat though (the Far View Terrace is best for them). Expect to wait 45 minutes to an hour for a table and longer in peak season. Nice bar upstairs to wait in. Wireless internet available in main lodge building only (none available in rooms).", "title": "Far View Lodge Lets You Experience Mesa Verde Up Close", "helpfulness": 2, "user": "billgo", "date": "September 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8726631, "likes": {"liked": "— location in park and views from room", "disliked": "— shower stall in bathroom very small and worn."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Don't bother to book your Kiva room early, I booked ours over 6 months in advance and the view I ended up with was the building in front of us. However we did notice a PRIVATE tour group getting off the buses and going to the group of rooms with alll of the best views. Maybe you should just book your travel via a private tour group as they seem to get preferential bookings. Kiva rooms are smaller then pictured. The bedding is nice ( no rodent droppings noted ). The view from the lounge is terrrific and there is free Wi Fi.", "title": "don't bother to book early", "user": "troublesBayArea", "date": "September 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 8690461, "likes": {"liked": "— Free WI Fi", "disliked": "— the view from our Kiva Room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Stayed in a Kiva Room with air conditioning which certainly came in handy in the 90 degree plus weather. Everything in the room worked reasonably well and the room itself was fairly nice for a park, especially with the balcony and view. The main dining room, the Metate, served surprisingly good food and also had a very nice view as well. However, the Far View Terrace for breakfast was terrible but you could get a limited selection but decent breakfast at the campground store, The park itself was also very interesting.", "title": "Fiarly nice for a National Park", "helpfulness": 1, "user": "carlybaby1", "date": "September 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8656670, "likes": {"liked": "— Air conditioning , balcony and view", "disliked": "— Very basic furnishings"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We wanted to stay on park property to maximize our stay at Mesa Verde, and we aren't campers. I was pleasantly surprised by our accommodations. We knew there wouldn't be internet access or television, and that was fine with us because we were there for nature and to get away from everything else. We had a King Kiva, and the view from our deck was fabulous -- expansive vistas and not a building in sight. Two of the three mornings we saw deer below our balcony.", "title": "Glad we stayed in the park", "helpfulness": 1, "user": "indenver", "date": "September 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8656454, "likes": {"liked": "— the location", "disliked": "— air conditioning broken"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The shower was just a stall, so it was a bit cramped. But the furnishings and bedding seemed new, and the room was large. The air conditioning didn't work, but my husband loved sleeping with crickets chirping and the breeze blowing the curtains. We weren't offer any discount for the broken AC, however. They clearly knew it was broken because someone had unplugged a lamp and brought in a fan.", "title": "Stay here for the view", "helpfulness": 1, "user": "swami12", "date": "August 20, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 8460795, "likes": {"liked": "— View, food in restaurant", "disliked": "— First room was dirty"}}, {"rating": 4.0, "title": "Great place - small but clean and inviting", "text": "We love staying at properties within national parks, though sometimes the room may be a little basic. We enjoyed our Kiva room at Far View. We were there about a week before the lodge closed for the season, so it was quiet, but the first night we could hear some conversational sounds from the adjacent room. Other than the room, and especially the bathroom, being a little small, we really enjoyed our stay here. The dining room was elegant and they did a great job catering to special meal requests that my wife and I made.", "helpfulness": 1, "user": "dilipB", "date": "November 4, 2007", "id": 10578211}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I do find it strange that some people complain about a lack of TV in their room - it's a bonus!", "title": "Come for the views and location", "helpfulness": 1, "user": "DaveHarry", "date": "October 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10255053, "likes": {"liked": "— views", "disliked": "— breakfasts are extra"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The hotel is in the middle of a spectacular National Park, has amazing views from practically everywhere, wildlife all around (and outside you door at times) and easy access to some of the world's best preserved and fascinating ancient ruins.", "title": "It was awesome!!!", "helpfulness": 3, "user": "NCDee", "date": "October 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10223068, "likes": {"liked": "— Elk Bugling", "disliked": "— Room Coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "OK the rooms are basic but they are clean, large and - apart from the TV - well appointed. The offer genuine peace and quiet and, as our room did, amazing views from your balcony (NB unlike other reviewers I would say most if not all the rooms wil have views).", "title": "Wonderful Views and Even Better Service !!!", "helpfulness": 1, "user": "ewtotel", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10175293, "likes": {"liked": "— The staff", "disliked": "— nothing!"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Most of the staff we met were on working-holiday visas from all corners of the world and, as such, lack the typical efficiency of American staff but more than made for this by their brightness and enthusiasm.", "title": "Not what it looks like", "helpfulness": 6, "user": "luke8ball", "date": "October 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 10173070, "likes": {"liked": "— nothing", "disliked": "— everything"}}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 109, "average": 215, "very good": 357, "terrible": 53, "excellent": 165}, "aka": "Far View Hotel Mesa Verde National Park", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 3.5, "rooms": 3.0, "location": 5.0}, "description": "Only lodging within the Park, it is open April through October."}