{"user_rating": 4.5, "review_count": 130, "name": "Fat Duck Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "I have never used \"fun\" as the adjective for an inn or hotel, until now. Manager Richard makes the place hop. Richard will likely contact you a few days before arrival and then again on day of arrival to narrow down your specific plans....he wants to be sure to be there to welcome you! He will offer to carry your bags, then invites you to the kitchen for general information and a (large) glass of Walla Walla wine. He has lots of opinions to share and is glad to hear yours, too. We stayed in the room on the second floor, which was huge. The bed was comfortable and there was a sofa and a chair for relaxing. We enjoyed our wine on the nicely landscaped patio. We were traveling with another couple and took part in the winemaker's dinner offered most Saturday nights. This was excellent. They seat a maximum of 20 people so book ahead. You do not need to be a guest of the Inn to book. Most of the dinner patrons were non-Inn guests. Fun play to stay while in Walla Walla.", "title": "Fun bed n breakfast inn", "helpfulness": 1, "user": "msanta", "date": "July 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 134999798}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "What a wonderful experience! The Fat Duck Inn is beautiful, the Widgeon Suite is tastefully decorated and comfortable. Richard, the manager, is attentive, caring and helpful. He made perfect winery suggestions and made sure we had directions. After tasting, we spent time on the patio, sipping wine and getting to know our inn-mates. Breakfast was delicious - I wish I could have tried it all! My friend and I have made several trips to Walla Walla and stayed in some of the larger hotels downtown. The Duck tops them all!!", "title": "Wine tasting + Fat Duck Inn = Perfect getaway", "helpfulness": 1, "user": "Kris0917", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134790255}, {"rating": 5.0, "title": "Walla Walla wine getaway!", "text": "Thank you Richard and Alexa for the perfect getaway! We will be back again and again!", "helpfulness": 1, "user": "kelly c", "date": "July 18, 2012", "id": 134775123}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We just finished our second trip to the Fat Duck Inn and once again had a lovely stay! Richard was there to greet us with a glass of wine on check in and the hospitality was flawless throughout our stay. Beautiful home- a comfortable home away from home.We had great success with Richard's restaraunt and winery tips as well. The charming patio was a beautiful place to unwind at the end of a day of winetasting. Highly recommend a trip to The Fat Duck Inn'", "title": "First time in Walla Walla", "helpfulness": 1, "user": "956Cheryl", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134661232}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We just returned from a memorable weekend in Walla Walla. We absolutely loved staying at the Fat Duck Inn. It was immaculate and very comfortable. We stayed in the Pintail Suite which was very roomy. We walked to town each night for dinner which took less than 10 minutes. The neighborhood is quiet and felt very safe. We weren't sure of what to expect and had the best time. We will definitely stay at the Fat Duck Inn again and can't wait to return. All of the people we met were so knowledgable about their wine and very friendly. Richard was very helpful. We too would have liked to have tried their wine dinner. Lots of people in town were raving about it. The restaurants we ate at were amazing. Our favorites were Saffron and Whitehouse-Crawford.", "title": "Great wine weekend at the Duck!", "helpfulness": 1, "user": "DBCSeattle", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134525470}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "On a recent college visit we were lucky enough to stay at the Fat Duck while visiting the local college, Whitman. Prior to our arrival Richard the manager was very kind and checked in over a series of phone calls. The Inn is lovey, and very comfortable. It was nice that it did not have that hoovering inn keeper approach. We were able to just treat the Inn as a home away from home, with tons of extras; Richard gave us rides to and from our college visit, breakfast was prepared and laid out in the kitchen, and the dinner - it was over the top wonderful. The food and the company were equally enjoyed.", "title": "Whitman Visit -", "helpfulness": 1, "user": "tp p", "date": "April 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128817129}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Selfishly I am hoping my daughter picks and is accepted at the college so that we can enjoy many more trips with a stay at the Fat Duck.", "title": "Awesome Weekend", "user": "Ryan H", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128365228}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Thank you Richard and the entire team at the Fat Duck - we really enjoyed our stay,", "title": "Everything I could have wanted and more!", "user": "Jeremy D", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128029231}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Tess & Jess", "title": "The Fabulous Fat Duck Inn", "user": "patriciadelfs", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128008199}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We had a great time this weekend staying at the Fat Duck Inn. We were there to celebrate our friends 50th birthday. Richard was a great host and made us feel welcome from the second we arrived to when we left. The food was wonderful for breakfast - what a great spread of fruit, pastires and of course the wonderful bread pudding!!! Thanks Richard and the Fat Duck for a very fun weekend in sunny Walla Walla.", "title": "You have to stay at this B & B when in Walla Walla......", "user": "Jehesbeth", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127498673}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our son got married in Walla Walla so we elected to stay at the Fat Duck based on a referral. From the time we arrived to the time we left, it could not have been more impersonal and cold. It is well worth your investment and time to stay somewhere else. From the first time we met the manager Richard, it became apparent that we were not welcome or listened to. We stayed 3 nights in the Widgeon room providing the management and ownership ample opportunity to demonstrate the acclaimed friendliness-it never occurred. Both were cold and removed, offering a meager breakfast, dirty accomadations and a stuck up attitude that made leaving the best part of our stay.", "title": "Go somewhere else!!!", "user": "ajneighbors", "date": "July 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 134005073}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We have stayed at many bed and breakfasts and can honestly say this was one of the best experiences we've ever had. The manager, Richard, went out of his way to make us feel so welcome during our stay, yet at the same time gave us space to enjoy the Chubby Duck. Alexa, the owner, was gracious enough to take the time to introduce herself before we had our wine paired dinner. The wine was provided by Couvillion Winery. Jill and her husband Craig (GO COUGS!!!) produce some fabulous wine that accompanied an absolute mind blowing 5 course dinner by Chef Rich. Being very spoiled foodies, sometimes we are hard to surprise but I think the word \"wow\" was uttered frequently. The yummy breakfast covered every food group one could possibly think of, the \"crack\" pudding, if available, is not to be missed and the coffee was made just to our liking every single morning. Overall, great experience and look forward to staying at the Fat Duck the next time we're in Walla Walla.", "title": "The perfect getaway...", "helpfulness": 2, "user": "2Cougs", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131446895}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Richard, the manager, made us feel right at home. Breakfast is superb, including pastries baked by the gourmet chef (who apparently does wonders for the weekend dinners...we were here on a Monday night and missed that) homemade bread pudding and quiche, fresh fruit, good coffee: quite the spread. The room was comfortable and quiet, and offered plenty of space to stash our stuff. We walked a few short blocks from here to dinner. Wonderful stay, can't say enough good about it. As we left, we were already making plans to come again.", "title": "Comfortable, quiet...and delicious", "helpfulness": 1, "user": "stopandseeroses", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131304423}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "A friend and I took our first trip to Walla Walla over Memorial Day weekend and the Fat Duck was a terrific home base for our wine tasting trip. Within 5 minutes of arrival, Richard helped us to our room and put a glass of wine in our hands. This was a really nice welcome - especially since we arrived after check in time, and we found the same generous hospitality from Richard and Maria throughout our stay. The breakfast was a simple choice of granolas, pastries, quiche, yogurt and fruit, which was just perfect for us as we headed out quickly each day. The front porch was my favorite spot for morning coffee. All in all, a great spot and fantastic people that I'll certainly return to on my next visit to Walla Walla!", "title": "Friendly and comfortable", "user": "Christy B", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131234357}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "What can I say about my stay at the Fat Duck Inn in Walla Wallla, Washington….Room comfort wonderful, breakfast awesome, dog friendly incredible, wine makers dinner excellent, Fat Duck Inn manager Richard, Priceless! What a wonderful experience we had at the Fat Duck Inn. They treat you like family but better. Richard wants to make your stay perfect and he is so fun and friendly you feel like you’ve been friends forever. The owner Alexa can by to say hello and brought her frenchie Frieda to play with my frenchie George. They have a very nice, fully fenced in patio so George could roam around and explore why we sat and enjoyed some wine. I would highly recommend a visit here!", "title": "Excellent experience at Fat Duck Inn", "user": "Karen D", "date": "June 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 131231142}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I was here in May 2012 with a group of friends, and we used the Fat Duck Inn as the base for our Walla Walla wine weekend. It was a fabulous choice! The rooms were spacious and comfortable, the breakfast was great, and the sunny patio was a great place to drink wine and chat.", "title": "Spacious, comfortable, elegant place to base your wine trip", "helpfulness": 1, "user": "Lawrence W", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130129483}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "The manager, Richard, was wonderful - attentive but not overbearing, and always had a suggestion or a tip for us in our exploring. Fat Duck Inn has agreements with quite a few local wineries to waive tasting fees - which adds up fast over the course of a weekend!", "title": "Comfy base for Walla Walla activities", "helpfulness": 1, "user": "Scot O", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129945999}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We didn't stay for the paired wine dinner, but we wish we had. It looked fabulous, and the wine host that night, the Amavi team, were incredibly nice and gracious to us, even tho' we had reservations elsewhere.", "title": "Great setting for a B&B nice stay", "helpfulness": 1, "user": "Celice C", "date": "May 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129873538}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I can't recommed this as your base of operations for your wine trip highly enough!", "title": "Fat Duck is Fantastic!", "helpfulness": 1, "user": "Ruby T", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129489457}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Short Review: This place will probably make most people happy. It is cozy, quiet, sharply maintained and central.", "title": "Richard is Amazing!!!", "user": "nikirevo", "date": "May 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129292848}], "location": {"country": "United States", "city": "Walla Walla"}, "variance": {"poor": 4, "average": 3, "very good": 12, "terrible": 1, "excellent": 110}, "slim_ranking": 0.263157894737, "description": "The Fat Duck Inn is a remodeled Craftsman gem in the heart of the Washington Wine Country. Chef-Owner serves superb gourmet dinners. Located on one of Walla Walla's historic tree-lined streets, moments from downtown & Whitman College."}