{"review_count": 30, "slim_ranking": 22.0, "name": "Feathers Hotel Restaurant", "reviews": [{"rating": 1.0, "stay_parameters": "Visited December 2012", "text": "After visiting the Feathers last night following a recommendation from friends who had visited earlier in the year and the B&B we stayed in, we were disappointed with a few things during our visit. The first was the 45 minute wait for our food, we had arrived whilst the restaurant was fairly quiet, so expected to be served swiftly. The second disappointment was that as three of the four meals were being delivered to the table we were advised that the fourth meal (turkey, bacon & leek penne pasta dish) would be served without leeks as they had run out... However the meal wouldn't be charged for. Unfortunately when the dish arrived at the table the creamy sauce had split during cooking and left a dreadful oily scum over the whole dish. Another of the dishes ordered was a cheese omelette, it's usually good to have cheese in it!!!! The vegetables served with the other 2 dishes were microwaved and overcooked. As we were off to see the Thursford Christmas Spectacular, we didn't have time to send the dish back or complain. Other tables around ours were also sending food back to the kitchen. Definitely won't be returning.", "title": "Disappointed...", "user": "claris74", "date": "December 7, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 146948487}, {"rating": 4.0, "stay_parameters": "Visited November 2012", "text": "We have visited The Feathers a number of times over the years but visited for the first time in a while at the end of November.", "title": "Tasty meal with efficient service!", "user": "WillowBee77", "date": "December 3, 2012", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 146715536}, {"rating": 3.0, "stay_parameters": "Visited October 2012", "text": "It was very busy but there were enough staff in all areas to ensure that the waiting times were kept to a minimum. The prices like almost everywhere in North Norfolk are probably a little on the high side but the quality and standard was good.", "title": "Nice Meal", "helpfulness": 1, "user": "kimives", "date": "October 31, 2012", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 144179778}, {"rating": 4.0, "stay_parameters": "Visited June 2012", "text": "I had one of the specials - beef burrito (I think) which has nice bits of real steak mince in it and was served with a nice side salad and spicy potato wedges. My wife and family all enjoyed their mains which ranged from minute steak to the beef and ale pie.", "title": "good value", "user": "BRIDGET S", "date": "June 10, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 131666915}, {"rating": 4.0, "title": "Great all round pub", "text": "The menu is varied, the atmosphere is friendly and the staff are efficient. It's certainly a good place to have a solid, decent meal and a pint with family and / or friends. I would not go here if you want a gourmet experience or a particularly romantic meal.", "user": "Cooker66", "date": "May 9, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 129657999}, {"rating": 3.0, "stay_parameters": "Visited April 2012", "text": "My partner and I visited the Feathers Hotel on Tuesday 10 April for a late lunch. The staff were all very friendly and efficient, and our lunch was quickly served.", "title": "A little disappointing", "user": "KeithR61", "date": "April 17, 2012", "detail_rating": {"value": 2.0, "service": 5.0}, "id": 128043128}, {"rating": 4.0, "title": "uncomplicated", "text": "I had lasagne, which came with very nice chips, peas and a salad for £9.50. All in all a very pleasant meal.", "user": "rebecca t", "date": "April 8, 2012", "id": 127456158}, {"rating": 4.0, "stay_parameters": "Visited March 2012", "text": "However, my partner ordered a cheese ploughmans, which also cost £9.50, but when it arrived she was disappointed that only a small bread roll of the kind usually served with soup was provided - no baguette or French stick as is usually the case with the ploughmans. The cheese portion was not too generous either, and she felt that the ingredients were rather box standard and did not appear too special.", "title": "main courses cooked to high standards", "helpfulness": 1, "user": "Tim S", "date": "April 2, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 127146082}, {"rating": 5.0, "stay_parameters": "Visited February 2012", "text": "Therefore, we felt this was poor value for money as The Feathers Hotel in Holt, Norfolk should not be charging London prices for simple pub fayer.", "title": "Wonderful food with great service", "helpfulness": 2, "user": "Mercedes2010", "date": "March 6, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 125691993}, {"rating": 3.0, "title": "Good value decent pub grub", "text": "We looked for somewhere in Holt where we could get a no frills meal in a pleasant and homely atmosphere on a Friday evening. This hotel / pub filled the spec very well. There was a friendly and pleasant atmosphere with a mix of those staying at the hotel, locals and casual visitors to the town like ourselves. We chose to have fish and chips with either a pint or glass of house wine for £12 each. Could not fault this for value and the quality was more than acceptable. Not a haute cuisine experience, but a good place for a casual meal in pleasant surroundings.", "helpfulness": 1, "user": "ChrisRugby", "date": "April 3, 2013", "id": 156517679}, {"rating": 4.0, "title": "Decent bar", "text": "Good quality hotel and bar. The restaurant food is up to standard and well priced, locals as well as tourists eat and drink here and its well placed for taking a breather after shopping in Holts boutiques and galleries", "helpfulness": 1, "user": "78juicy", "date": "March 24, 2013", "id": 155542566}, {"rating": 3.0, "stay_parameters": "Visited February 2013", "text": "We enjoyed our stay and the food was well presented, all served with a smile. Rooms need sorting out and was dated and of various styles which was let down by poor quality of toiletries/toilet paper. The grey lino in bathroom and suite also needed updating with a poor functioning shower. There was nice white sheets and pillowcases and bed was comfy. The valentine meal was good but they could of put a red rose on the table or even a few red hearts on the menu card - or some red balloons somewhere. The whole place was void of romance! I thought I had come on the wrong weekend. Overall a nice experience.", "title": "Friendly Staff and good food", "user": "pinkthatch", "date": "February 21, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 152709280}, {"rating": 3.0, "title": "Reliable value for money dining with room for improvement", "text": "Quick service and decent food. Lack of customers however is not conducive to good atmosphere, can be a bit vacuous. Real ale choice could also be improved (have not seen winter warmer ales for some years).", "user": "Nigel S", "date": "December 31, 2012", "id": 148458517}, {"rating": 4.0, "stay_parameters": "Visited December 2012", "text": "We had xmas lunch in the restaurant. Food was good, atmosphere nice but the actual bar itself is amazing and well worth a visit. The specials menu was full of nice options and the puddings were as hot and sticky as you wanted them to be. Eating here is recommended but do book a table. Good selection of beers too.", "title": "Great Restaurant. Real Charisma", "user": "beesbeesbees", "date": "December 30, 2012", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 148392716}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 2, "average": 9, "very good": 12, "terrible": 2, "excellent": 5}}