{"user_rating": 4.5, "review_count": 93, "name": "Federal Pointe Inn, an Ascend Hotel Collection Member", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "My experience completely aligns with reviewer LoriL3020. Our room was very clean and there was not one bug in sight as mentioned by another reviewer. I am very particular and obsessive about cleanliness and I didn't find one issue. My only suggestion is the bathroom could use better lighting over the mirror.", "title": "Clean and Good for value", "helpfulness": 1, "user": "MarthaSays", "date": "August 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 174030878}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We booked this room because it was in town at an acceptable price with a bonus sitting area. There are only a few hotels in the center city area. Our room was ready at the time promised and the reception lady walked us up to the room telling the history of the hotel which was once a school. Very charming - and so was the room! We were surprised when we opened the door. The room was a perfect blend of old style (12' ceilings and large windows etc.) with new (bedding, tvs, and an updated and modern, spacious bathroom) that really set the mood for a Gettysburg stay. Very pretty. The tall ceilings made the room seem larger. Our room was clean and bed and bedding were comfortable. We checked for bed bugs, as per normal. They had a big mini-fridge as well as tvs in both the sleeping area and sitting area. Parking was free. It was a few blocks walk to many restaurants and other places in town. We ate dinner at the Italian restaurant 1 1/2 blocks towards town on the left. It was a good experience for our family. Some of the touristy locations are further south from the hotel so bring walking shoes. No breakfast at the hotel but there is a restaurant next door. We choose to bring our own breakfast which was fine with us because we wanted a good start at the Military Park. We had a room on the 3rd floor and didn't hear a thing during our stay save a few motorcycles in the night which was probably heard all over town. We drove in that day, stayed the night and left late the next afternoon. We wished we'd stayed two nights to get a full Gettysburg experience and overall we were glad we chose this hotel.", "title": "Charming room for a good price within walking distance to restaurants", "user": "LoriL3020", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173699168}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This is a beautiful renovation of the Meade School in Gettysburg. 3 blocks from center square and close to good restaurants. It is really nice to be close yet far enough away. It is very quiet at night promoting a good rest. Bathrooms are very nicely done with tile and marble.", "title": "You get to sleep in school!", "user": "Ralph L", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173223224}, {"rating": 5.0, "title": "Classy spot away from the tourist area", "text": "Stayed at The Federal Pointe Inn for one night and we're glad we did. Much of Gettysburg is very touristy and this was actually a good location - only a couple short blocks to the center of town and away from the crowds in the southern part of town. The inn is a former school and its amazing what the owners have done with the renovation. We had a beautiful corner room on the second floor with furniture, carpeting and drapes that would rival some of the nicest hotels in any city. Plus, the bathroom was well lighted and modern.", "user": "Frank B", "date": "August 11, 2013", "id": 171713102}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "There's only 18 rooms so it's kind of between a B&B (with no breakfast) and a hotel. The lack of breakfast was no big deal. There's a Keurig in the room and there are several restaurants within walking distance. So, if you want a step up from the typical tourist places and don't want a B&B, this is the place! We really liked it.", "title": "Great location but...", "helpfulness": 3, "user": "wrestlerUMCP", "date": "August 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 170635152}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Great place! Many thanks to the new owner for making the investment to save this property and share it with others.", "title": "LOVED my stay - and - can you tell me what kind of mattresses those are?", "helpfulness": 1, "user": "Gemutlichkeit", "date": "September 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177952485}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Clean rooms. Even though the original classrooms were cut in half to make 2 hotel rooms each, each individual hotel room is still ample. And, includes fridges/micros and sitting chairs. A bit cramped if you were 2 in a room, perhaps. (I was just 1 on this trip.)", "title": "Good. With a sense of the Gettysburg flavour", "user": "ustraveller11", "date": "September 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 177790079}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I agree with another poster that the bed was THE most comfortable thing I have slept on lately. I even ripped my sheets off in the morning looking for a label on the mattress, but, I couldn't find one (I'm guessing mine was sadly on the underside). (Owners, can you message me with what type of mattress it was?)", "title": "History at it's finest", "user": "purplegirl32", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177718678}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Good location - away from the cluster of downtown, but, close enough to easily walk to anything downtown. And, comes with its own parking lot, which is great.", "title": "Great customer service!", "user": "Phoebesbeela", "date": "September 17, 2013", "detail_rating": {"service": 5.0}, "id": 177500610}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Down side - I tend to get cold very easily. And, I was there in early May, when the nights still dipped down into the upper 40s / low 50s. The rooms are heated only by electric baseboard heaters. And, when they first walk you to the room, the AC has been on high for quite some time before you get there. So you just spend more electricity over-riding all that AC to get the room to a normal temperature. I get it - all hotels do this because somehow the room FEELS more clean if it's cold and dry, versus warm and moist. I get it. But with the electric baseboards, it just takes a long time to counter-act, and then, at 3:00 am, you are too warm and have to stumble over to the floor to shut the thing off. A bit inconvenient, but, I'm sure there were insane limitations in their remodel.", "title": "Nice New Boutique Hotel", "helpfulness": 1, "user": "WilmaQF", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177060109}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Enjoyed two nights at this new and unique hotel. The 18 room hotel is in an old school. The rooms are very large with modern, granite showers. The location is 3 blocks off the main square,within walking distance. The side of the square where the hotel is located is much quieter than some of the other areas, but there are fewer shops and restaurants nearby. There is easy parking behind the hotel. Each room has free wireless and it's own Keurig machine. A good location for a visit to the battlefields.", "title": "Nice, new hotel", "user": "Jahardy", "date": "September 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 176377663}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Very good location at one end of the business district so restaurants & shops all walkable.", "title": "Almost there! Only little things between 4 stars & 5.", "user": "tlevien", "date": "September 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 176372146}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The restoration of this historic building was well done and recent (has only been a hotel for 13 months, the evening desk clerk informed us, having previously been a school since the 1800s.)", "title": "Wonderful", "helpfulness": 1, "user": "wigsy", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 175165708}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Beautiful shower, high ceilings, Keurig in the room for coffee, as other reviewers mention. Desk clerk showing us to the room was a nice touch. A couple of little things missing to make it perfect like towel bars by the sink and outlets to charge my phone on the nightstand-not biggies, but the little things needed to move from 4 to 5 stars.", "title": "Superior accomedations", "user": "Sue F", "date": "August 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174823180}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our family stayed here for 4 nights in late August. The room was beautiful very spacious. Also our room had an extra sitting room which was perfect for reading or watching TV. The old school is nicely restored and the walls in both the rooms and hallways have prints of paintings depicting the battle of Gettysburg and the Civil War. We found the Federal Pointe to be an excellent place to stay while in Gettysburg only about a short 3 minute walk into Lincoln Square.", "title": "Comfort, Charm and Style", "user": "Carter M", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174501486}, {"rating": 5.0, "title": "\"Great Place To Stay\"", "text": "We just stayed at the Federal Pointe Inn for one night. We loved this place! The room was clean and quite large enough for our family of 4. The bathroom was nicely done in marble. The staff was very friendly and helpful and made us feel \"at home.\" They also gave us the background of the hotel. It is an old school converted into a hotel and not much impresses my husband but he enjoyed walking around the hotel looking at the Civil War paintings and at how the hotel is decorated. We would definitely stay here again! Also loved the kitty out front!", "helpfulness": 1, "user": "SoccerMom178", "date": "August 2, 2013", "id": 170513181}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "PA from Virginia", "title": "An Entomologist's Dream", "helpfulness": 8, "user": "civil-warrior", "date": "July 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 170016815}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I selected to stay at this hotel during the 150th battle anniversary because it was the only one available at the time I booked with a decent price and cancellation policy. And being newly renovated, I thought it would be perfect. When I booked ( a year in advance), I asked for a quiet room and one with no bug history. At check-in, I repeated these concerns. I was given a room which had the hotel's HVAC unit just outside the window so all I ever heard was the hum of the HVAC unit. I can't say I heard guests next door nor road traffic because if there was any, the HVAC unit hummed drowned it out. So they did not accommodate my request for a quiet room. As for bugs, this room was full of them - lady bugs, carpenter ants, earwings, centipedes (both large and small), millipedes, fireflies, and carpet beetles. Luckily, most of them were dead. After housekeeping came by the next day, the dead bug skeletons remained so obviously they don't clean up the rooms well - also attested by the coatings of dust found throughout the room and by the garbage I saw behind the dresser. The next day I left a note for housekeeping to please clean up the dead bugs. They did not! So I'm wondering if they ever do? How long have these dead bugs been here? So I cleaned them up. It was much nicer to be in room without bugs. So they also did not honor my request for a room with a bug-free history. Now it's possible that the bugs came in because the room was cool and the HVAC unit was hot and/or blew them in. The windows, in particular the screens were gross and dirty. Filled with spider webs and more dead bugs and just disgusting. I kept the curtains drawn my entire stay because the view of the HVAC unit and the dirty screens were just too disgusting to look at.", "title": "Strange place, not quite centre of town", "helpfulness": 2, "user": "TheDunsBuns", "date": "July 29, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 169693515}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The rooms do indeed have high ceilings but the problem is lighting. Lights on the ceiling are not bright enough for people height. There are some lamps but do not provide enough light either. The toiletries have some funky fragrances that someone with allergies will not want to try, so bring your own. I was in a king room with a very odd layout, somewhat roomy but not in the right places. The bed was a king but the box spring was two twins so it got lumpy fast. One nice touch was two small bottle of waters provided each day. I did see a tea machine in the lobby but never saw a single scone. The lobby is small and not welcoming but the first floor hallway did have chairs where guests could sit and relax and talk.", "title": "You will be glad you chose this Hotel!", "user": "Ron L", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169510392}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "While newly renovated, it was not entirely renovated for instance the walls and windowsills were not renovated, very old. Some of the furnishings were chipped so either they were inexpensive or supposed to be providing some sort of \"look\". The shower is granite which is beautiful but the soap holder shelf was too high for me to reach, the granite got slippery from using the soap, and there was no handrail - a great way to slip and fall. There are no full length mirrors which was a big disappointment.", "title": "Cool place to stay", "user": "Beach_Lovers91011", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168648516}], "location": {"country": "United States", "city": "Gettysburg"}, "stars": 3, "variance": {"poor": 2, "average": 3, "very good": 22, "terrible": 1, "excellent": 65}, "slim_ranking": 0.103448275862}