{"user_rating": 4.5, "review_count": 119, "name": "Feirs Park Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I am a well-seasoned business traveler, having spent nearly the last twenty years working at a Washington, D.C. litigation firm. On first blush, Feir's Park Hotel in Buenos Aires provides a more than adequate accommodation at a reasonable price. The rooms are actually large two room suites with average size bathrooms and balconies. There is also a very nice series of roof-top decks that include an outdoor swimming pool. The largely multi-lingual staff was, without exception, friendly and helpful -- from the bell staff, to the cleaning staff, to the front desk and the room service personnel. The quality of the room service food (ordered twice) was good.", "title": "Above and beyond the call", "helpfulness": 6, "user": "traveller987", "date": "March 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7202806, "likes": {"liked": "— See review", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "Old fashioned English Inn as a 5 Star hotel!", "text": "I would recommend the hotel to anyone on these bases alone, but an incident that occurred during our stay leads me to unequivocally recommend the hotel. My wife, cat and I recently re-located to Buenos Aires for a year and reserved a week long stay at Feir's Park while we completed our search for an apartment. Unfortunately, my wife became seriously ill one evening during our stay. My call to the front desk at 3:30am was greeted by a swift response that an ambulance would be summoned immediately. My wife and I proceeded to the lobby and were met by front desk and security personnel. Their response was one of genuine concern. The ambulance arrived several minutes later. The man from the front desk immediately provided keys to a second room on the first floor where medical attention was provided to my wife by the emergency medical technicians. The gentleman from the front desk stayed with us to help translate for the EMT's. My wife's condition required her to be taken to the hospital. One of the hotel's security personnel was dispatched with us in the ambulance to the hospital, with the assurance that the hotel would pick up the costs of not only the ambulance but also the treatment provided. As my wife and I speak very little Spanish, this was a great aid in navigating the emergency room at the hospital and admission process.", "helpfulness": 7, "user": "Portia1972", "date": "June 17, 2004", "id": 2201359}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "stars": 3.5, "variance": {"poor": 2, "average": 9, "very good": 50, "terrible": 4, "excellent": 54}, "aka": "Feirs Park Buenos Aires", "slim_ranking": 0.206818181818}