{"user_rating": 2.5, "review_count": 88, "name": "Felixstowe Beach Holiday Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "I was absolutely dreading our stay after reading the reviews. We got a last minute deal and checked the reviews after booking. But we enjoyed every minute and I really feel a lot of complaints are unfair. We stayed for three nights in a silver caravan (yc 07) and was dreading opening the door, I needn't have worried. Check in was friendly and fast. The caravan was spotlessly clean with no nasty smells, sheets were like new. Ok, so a few minor marks on furniture and carpets, but that's what happens when you have families going in one after another and this was no worse than any other caravan I have stayed in. Plenty of crockery and completely clean. Little bathroom very clean.", "title": "Thoroughly enjoyed our stay", "helpfulness": 2, "user": "Nicks_gal", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 176471984}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Everything worked fine and we were happy.", "title": "Great hospitality", "helpfulness": 3, "user": "S_friendl", "date": "September 8, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 176379881}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Staff were really great..Glen in reception, Gavin in Felix club, Jake in the bar and the entertainment team worked their socks off and the kids loved the entertainment.", "title": "Entertainment staff", "helpfulness": 3, "user": "Krispipe", "date": "September 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175267902}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Derek the 'handyman/engineer' was really kind when he fixed our sons stabilizers for him. Seriously, nothing was too much trouble for these guys.", "title": "Overpriced and neglected", "helpfulness": 2, "user": "Michael T", "date": "August 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 174929929}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It's a small park, and the downpoints are the smell and noise from the docks but that is no fault of the park just it's situation. It is a short walk down to the lovely seafront.", "title": "GOOD FAMILY HOLIDAY", "helpfulness": 1, "user": "Steve P", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 174296051}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I have just returned from a week stay at this caravan park (Saturday 10 - 17 August). My daughter had visited twice before and we decided to go with her and her husband to help out with the two children (3 year old and 5 month old baby). She phoned in for a late booking and managed to get two 6 berth silver caravans so we could sometimes have the children with us.", "title": "Filthy caravan - not fit for purpose", "helpfulness": 3, "user": "JandASKent", "date": "August 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 172765545}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We first booked her in and helped her settle in. The caravan was basic but clean and ok for her family. We then went to settle ourselves in. The caravan floor was absolutely filthy. Covered in stains which would have been there months. We also had no hot water. We went straight to reception to report this and were told someone would be with us shortly. We waited in Saturday evening but unfortunately nobody came. Sunday morning we nipped over to use my daughter's shower - not ideal. We then completed the card in the pack to report problems and handed it into reception at 9.00am Sunday.", "title": "Great staff, great location, basic but you get what you pay for", "helpfulness": 1, "user": "Inflatables", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 172062107}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Someone came straight away to fix the gas problem, replace light bulb, give a remote control for telly, show us how to light fire (a dozen clicks 'til it sparks!) and how to lock door (lots of force as the lock was dodgy). We were told the carpets were a housekeeping problem which they would sort. When we came back from the beach on Sunday nothing had been done hence another evening in my daughter's van.", "title": "Caravan needs urgent tlc", "helpfulness": 1, "user": "sarayoung1", "date": "August 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 171834904}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "9.00am Monday morning we went to Reception and once again reported the filthy carpets. We were told they would try to get them deep cleaned on Monday but as it was changeover day it might not be possible so they would be done first thing Tuesday. Spent Monday and Tuesday on the beach and the rest of the time in my daughter's van. When nothing was done by 3.00pm Tuesday we went to Reception and asked for someone to come and have a look.", "title": "DON'T BOTHER!", "helpfulness": 1, "user": "Hayley C", "date": "August 11, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 171709667}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The team member Ritchie, who we had also spoken to on Saturday and Monday came and agreed the caravan was not fit for purpose, was indeed very dirty and he also would not let children play on the carpet. He did apologise and said the floors would be shampooed on Wednesday. I said it was a little late to be sorry and I felt I was being fobbed off. He said he couldn't move us as the two vacant vans on site had gas problems.", "title": "Great lifeguards", "helpfulness": 1, "user": "LarryC20132013", "date": "August 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 171624567}, {"rating": 3.0, "title": "Wouldn't return but caravan lovely", "text": "First of all we booked at very short notice, literally the day before! We wanted a nice caravan near a beach with a pool. We opted for the half board flexi-dine so I could really relax and this was a great idea and really good value for money. We had a gold plus for 4 nights. Reception staff pleasant, kids loved the crazy golf, playground and go karts. Please could there be more picnic tables in the playground as there was only one for parents to sit on! Also some swings for older children would.be great.", "user": "mummymayhem73", "date": "August 27, 2013", "id": 174243363}, {"rating": 3.0, "title": "Lovely week - But could have been better.", "text": "Entertainment was the usual thing and not my cup of tea though my 5 yr old loved it. unfortunately as others have said, you're subjected to very loud, intrusive music at breakfast and dinner!", "user": "tarkanlouise", "date": "August 24, 2013", "id": 173862071}, {"rating": 2.0, "title": "Felixstowe Holiday Park", "text": "The food was ok. The staff worked very hard.", "user": "Suzanne S", "date": "August 24, 2013", "id": 173848203}, {"rating": 3.0, "title": "Not bad but a bit disappointing shop staff rude", "text": "Now for the reason of only giving a low score for overall and location. Well basically there is nothing to see/do in the local area without having to drive a good 1.5 hours out! We may as well have driven home again!", "user": "Mel30swanley", "date": "August 19, 2013", "id": 173092377}, {"rating": 1.0, "title": "Disgusting noisy park!", "text": "We made do as we were only there for 4 nights, but had we been there longer we would have got very bored!", "user": "hamm10", "date": "August 18, 2013", "id": 172869100}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Just back from a great holiday at Felixstowe beach.We booked last year for the same week this year and met up with some friends that we met last year.It was so lovely to spend the week with them again.The only person missing was the fabulous and very pretty Ryan Higgins who we had such a good time with last year.I heard his name mentioned quite a few times in the week we were there and know he is greatly missed.You only have to read Tripadvisor to see how many people love him and enjoy his company.When we arrived we were greated by Richie who is such a nice man, it is always lovely to see him.He always makes sure he does all he can to make your stay a good one.", "title": "Great Holiday", "user": "Alison C", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171001569}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "The entertainment team seems to be ever changing.Jade was there from when we were there last in April and remembered us and it was nice to see her again.There was also Luke who worked really well alongside Jade, they seemed to make a good team.The other girl that was there briefly was Bethan who seemed nice but she was then about to leave.She was replaced by someone called Sarah who also seemed nice but unfortunately we didnt get to know her much as we didnt get to see the entertainment team during the day as they had to rehearse.Bex who stood in for the entertainment team for the days activities was very nice and got on well with the kids.She also sang one evening and had a fab voice.I think Jade and Luke made a better team than last time we were there and interacted with the kids more as a result.", "title": "Run down park rude un-welcoming staff", "helpfulness": 1, "user": "Vcoombes", "date": "August 5, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 170792865}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "There arent many staff there from last time but did reconnise one of the lifeguards who reconnised us also and always spoke.Pool was nice and warm and lifeguards friendly.", "title": "Lovely week", "user": "Carrie P", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 167593861}, {"rating": 1.0, "stay_parameters": "Stayed June 2013", "text": "Bar staff were pleasant enough, still miss Rachel from last year who is lovely.", "title": "A filthy hovel with rude staff!!!", "helpfulness": 3, "user": "Evil-em", "date": "July 13, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 167367448}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Caravan was plenty good enough for us and was clean.We were missing a clothes airer but i rang richie on reception and one was delivered in minutes and also our tv reception needed attention and again the man was there instantly to sort it.", "title": "Brilliant holiday park!", "helpfulness": 1, "user": "Bethradamd", "date": "July 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 166772652}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 12, "average": 16, "very good": 17, "terrible": 29, "excellent": 14}, "aka": "Felixstowe Beach Holiday Park Suffolk", "slim_ranking": 1.0, "description": "Felixstowe Beach regularly appears in the top 3 for customer satisfaction, but great service is just part of its special appeal. On the park you’ll find a great indoor pool complete with water slide for children of all ages! The entertainment venue is perfect for live shows and cabarets"}