{"user_rating": 4.0, "review_count": 131, "name": "Fellini Inn Rome", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "stayed her e for two nights. Young man at reception welcoming and helpful. He pointed out where to go and highlighted it all on a map. Nothing appeared too much trouble. Breakfast adequate. Rooms clean, warm and very nice bathroom. The hotel is so near to all main attractions.", "title": "great location, very helpful freindly staff", "user": "BournemouthBobs", "date": "March 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100729690}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "would definitely recommend for a trip to Rome if on a budget.", "title": "Great Value!", "user": "renrod", "date": "January 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 94319419}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My husband and I recently returned from Italy. We stayed at the Fellini Inn January 2-4, 2011. We stayed in one of their apartments in a building right next door to their main lobby. The hotel was in an excellent location. It is a 5 minute walk to the Trevi Fountain and about 8 minutes to the Metro Station in Berberi Square. It is around the corner from many restaurants and places to get gelato! Overall it was pretty clean. The bathroom was a bit clausterphobic but it wasn't anything we couldn't deal with. Breakfast was included in the price and we ate it both days. It was good and enough to get us going for the day. They offer wireless internet. My husband was able to pick it up on his phone. The staff at this hotel was AMAZING! Very friendly, helpful and willing to answer any questions. Our luggage was lost on the way to Rome so we were without it for a day and a half. The hotel staff was very helpful in getting it back to us before we left Rome for Florence. I would stay here again when visiting Rome.", "title": "Central, friendly, beautiful little roof terrasse - what else could you want!", "user": "WanderLustig55", "date": "January 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93813379}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My daughter and I had a great time at the Fellini, nice group of travellers, very friendly office. And yes, a good breakfast (rolls,croissant, cereal, yoghurt...). Even TV - though we thought there are better things to watch in Rome than TV. I would stay at the Fellini Inn again anytime!", "title": "A great find!", "user": "sandraij", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84468713}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Before I go into my praise speech of Fellini Inn, I should state that if you are a large person or have physical challenges this hotel is not for you, as it does have a flight of stairs, and the elevator and bathroom is small. Having said that; this is a newly remodeled hotel with well designed bathrooms, clean, with a terrace breakfast location, and a very charming and helpful general manager by the name of Jean Paul. Location is within walking distance to every possible place in Rome; the closest being the Trevi fountain. Our room was located on the second floor, with window opening to our street; good air conditioning system when needed, tile floors, very functional bathroom with great shower pressure, hair dryer and ample room for toiletry. They also arrange limo service to the airport for a flat fee; efficient and well priced; better then taking a cab. We did not use it, but I noticed that they also assist you with tours, etc. We would definitely stay there again.", "title": "Will definitely stay again!", "user": "dawnstew", "date": "June 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 67348122}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Gotta admit this is in the best location! Walked daily to Trevi and Spanish Steps and watched the world go by. The hotel is tiny and typical of historic Rome so don't expect a room any bigger than the bed itself. Strongly suggest getting a room on the level immediately above ground. The lift is tiny (one person plus one bag at a time) and access to it is from this floor...not ground. Mobilty impared freindly this aint! Newly renovated (on this floor at least) and sparkingly bathroom and super comfortable bed. Super clean and enjoyed the 5th floor terrace with free wifi up there....great way to get away from the madding crowd.", "title": "Top location, cannot be beat!", "user": "zacstar", "date": "November 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120810339}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Stayed at the Fellini Hotel in Rome for a few days at the end of last month. We were looking for a reasonably priced and well located hotel in Rome, near the Trevi Fountain. The Fellini Inn fit the bill and the reviews on TA were mostly positive. So, off we went - one thing that was important to me was that the hotel have an elevator since I have RA and can't do many stairs. On the reviews, it is stated that there are \"a couple\" small steps to go up to the elevator.....that is definitely an understatement. When you leave the lobby, you go down 2 stairs....ok, all is good so far. Then you go up 4 large steps to a landing.....I am still doing well with this. Then you go up FIFTEEN large steps to the elevator! At this point I am NOT doing so well. Then the elevator is so small - it is one person and a bag only at one time. Not a problem. After going up and down multiple times, we finally got all our bags to the room. (The desk clerk had told us \"so sorry, it is the bellboy's day off\") The room is miniscule...a large bed and wardrobe and there is literally no where to put your bags. But, it is spotlessly clean so we are good to stay there. Now breakfast is also included in the price - it is in the building next door - maybe 10 steps away. Again, not a problem. However, no matter what time you go......they only have 8 seats on the ground floor level and they are always full. The waitress tells us we will have to go upstairs.....I take a look at the stairs (MANY MANY stairs) and I know it is a no-go for me. This happened each day...we ended up going to a cafe at the bottom of the road - good food but expensive...a couple of pastries, a coffee and a hot tea = 25 euros. On the second day there, we were sleeping in (jet lag) and wake up to lots of noise, loud talking, etc. And no water. A pipe had broken in the road....by the time it was fixed and water pumped up to the roof....then the wait for the water to heat up for showers, it was 1:00pm by the time we could start on our day. But I don't blame the hotel for this - no one can predict a broken pipe. On the day of checkout we go to the desk and \"so sorry the bellboy is not in today\".....at this point, I don't think there even is a bellboy as we have never seen one in the days we are there. So, for a central location and a very clean hotel, the Fellini Inn cannot be beat but with the steps, the miniscule elevator, no bellboy, and no breakfast unless you can hike many steps, we wouldn't stay there again. For anyone with no physical challenges who doesn't mind a tiny room, I would say it is one of the better buys in Rome where all hotels are super expensive.", "title": "Nice hotel but.......", "user": "CindieH", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 120754716}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Booked well ahead for 10th Anniversary - got a nice but small room. Very clean but VERY NOISY!!", "title": "Noisy and small for price go around corner for quieter room...", "user": "mabram", "date": "October 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 119797560}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Go elsewhere: way overpriced for room, breakfast and service. Superb location, but there are many hotels around here and close to Barberini Metro.", "title": "Excellent location", "user": "L G", "date": "October 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119496597}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Excellent location just minutes walk from Trevi Fountain & Spanish Steps. We had a small, basic but clean room which suited us as we didn't want to pay for a fancy hotel as we were only in Rome for 3 nights but wanted to be in the centre of Rome. Staff were very friendly and helpful.", "title": "Fantastic location near Trevi Fountain", "helpfulness": 1, "user": "Damian1974", "date": "October 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 119320290}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Located five minutes walk from Trevi Fountain, less than ten minutes to the Spanish Steps this was a nice boutique hotel with very pleasant and helpful front desk staff. They made good restaurant and sightseeing recommendations, and were extremely helpful in translating my cell phone messages that were in Italian. Rooms were small, but that was expected given its prime location.", "title": "Great location, boutique hotel", "user": "ChanUSA", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115827534}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Free internet access but it was not available in all hotel rooms so internet can be accessed in the lobby.", "title": "Great B&B in the heart of Rome", "helpfulness": 3, "user": "yang_kat", "date": "July 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115168668}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We loved this little B&B. The service was outstanding, and everyone was helpful and kind. The complimentary breakfast is tasty and has a wide selection of foods. The rooms are clean but a tad \"cozy.\" It's a great location because it's slightly \"off the beaten path\" and not way touristy but still close enough to walk to many famous sites such as the Trevi Fountain. The doner kebab place two steps away from the hotel is also a plus!", "title": "Great value in city center", "helpfulness": 1, "user": "AM0_ITALIA", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 104933852}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We loved our stay at the Fellini. The staff was very friendly and accommodating. Our room was clean and featured a big window that opened out onto the street. The internet worked perfectly on the fifth floor and there is a beautiful little breakfast terrace. Breakfast was very Italian, featuring fresh pastries, sliced meats, and cappuccino. The best part, by far, was the location. The hotel is within walking distance of every sight in the city center. Trevi is little more than a block away. Wonderful place... we will return.", "title": "Great location, clean rooms, great value", "helpfulness": 1, "user": "honeybee313", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104855198}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We spent three nights at the Fellini Inn during our recent trip to Rome. We arrived at 10 AM on our day of check in after an overnight flight from the US. Our room was not ready, but we were able to leave our luggage with them and went out to explore Rome until our room was ready at noon.", "title": "Great place for a couple to stay.", "user": "jimmybonez", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 102241617}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Our room was booked last minute so we did receive a good rate. However, the room was tiny. There’s not much room to turn and spread your personable belonging. The bathroom was clean with shower, toilet, sink and of course the bidet. We used it more as a personal feet soaker in Italy after a long day walk around in the city. Just fill it up with some hot water (water can hot quickly which is a good sign) and sit on the toilet to soak your feet. It’s the best thing you can do when you get back to your hotel. There wasn’t much free hotel toiletry provided. You can have full control of AC in this room as long as you leave the key in the electric key control slot. I am used to this from all the Asian hotels I have stayed. The best part of this hotel is their bed. Their bed is very comfortable. As soon as my friend hit her head on the pillow I didn’t hear a peep out of her until the next morning. It was comfortable without waking up with a sore back. When we commented on that to the hotel front desk staff they simply indicated that this is one of the proud factors at Fellini Inn.", "title": "Too bad they were booked the next day...", "user": "CBRRyder", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119251786}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Fellini Inn staff helped by arranging a car to pick me up from the airport after an extremely long flight. Best 40Euro I spent. The thought of catching the train and then a cab in a city I had never been in before was daunting. The driver was waiting at the airport and took me straight to the Inn. I was checked in promptly and given a room on the first floor. While the room was tiny - it was beautifully clean and the bathroom exquisite. Only problem being there really wasn't much room to place my large suitcase and it ended up on the floor at the end of my bed which didn't leave a lot of room to move - minor hassle... It had a safe and fridge - fantastic - would have been great to have a small kettle to make a coffee or tea though. Only fault with the room was I was on the first floor right above the entrance which meant that I heard the door bang every time someone came in or out. Otherwise it was perfect. Didn't have wireless from my room but they kindly gave me a cable to plug into which gave me good internet service. Emanuella was fantastic and helped me book my tours and plan my time in Rome with a walking map on which she highlighted all the sites for me. Breakfast at the cafe next door was superb and very welcome. Highly recommend to any traveller wanting a central location in Rome - literally only a stones through from Trevi Fountain and easy to find your way back to.", "title": "Perfect Location in Rome", "user": "Zilzi", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 118975587}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Amazing location within a short walk to everything--just a few minutes to places like the Metro and Trevi Fountain. Very quaint and charming, a mixture of historic and modern architecture (old building remodeled). The staff spoke English very well and were EXTREMELY helpful, much more so than what my friends experienced at a traditional and higher-end hotel. Safe neighborhood. Clean accomodations, plenty roomy for one person (I stayed in one of the apartments). Terrific price--it would be quite difficult to find a better deal for what you get. Reading some of the other reviews, and thin walls and/or traffic noise were absolutely not an issue to me while staying there. The bed was comfortable. The room and hotel were in nice condition; not 100% perfect, but I considered this aspect to be part of the \"old world charm\" of the inn. The breakfast was simple but tasty--unlimited seconds means you can definitely get enough to eat. My friends paid just over three times more than I did to stay in a nearby upscale hotel, yet their hotel wasn't that much nicer and their room was actually smaller than mine; they were definitely jealous of my accommodations at the Fellini Inn!", "title": "Charming B&B in the heart of the city!", "helpfulness": 1, "user": "Al W", "date": "September 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117792006}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The location is great as it is within a five minute walk to the Trevi Fountain, and a five - ten minute walk to the Spanish Steps. It is also really close to the tube station.", "title": "Great Location, Okay Service", "helpfulness": 1, "user": "Kate M", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 2.0}, "id": 116938271}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I have mixed feelings about my stay here. We checked in at the front desk with Andreas, who was absolutely fantastic! We were very happy and surprised to see how large our attic-terrace room was(the only room on the top floor). We had a huge terrace all to ourselves!", "title": "Great location, nice staff!", "helpfulness": 2, "user": "Louise2186", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 116573423}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 5, "average": 19, "very good": 62, "terrible": 5, "excellent": 40}, "aka": "Fellini Inn Rome Hotel Rome", "slim_ranking": 0.363485477178}