{"user_rating": 4.5, "review_count": 38, "name": "Fforest Camp", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Our 2nd year running, and probably not our last either.", "title": "still fab in 2009", "user": "JMuk", "date": "July 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34815322}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Love it. Perfect mix of posh camping and the great outdoors. We have had a GEO Dome both times. All the comforts of a hotel room but in a tent. I almost don't want to rave about it too much so there's always a space for me when we book, so DONT GO THERE. They get it absolutely right, everything from the fresh coffee that comes in your kitchen pack, to the fab breakfast served in the lodge, to the friendly and very welcoming managers. It's a shame that they don't always do the group dinner thing every weekend (depends how many people staying) because that would be a great weekend thing, but I understand why they don't do it during the quieter times.", "title": "Great Domes", "user": "Jon2604", "date": "November 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 3.0, "cleanliness": 3.0, "rooms": 4.0, "location": 5.0}, "id": 21825797, "likes": {"liked": "— The location", "disliked": "— could do even more recycling"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I'm guessing if you've already checked out the Fforest website and you're checking it out here then you're already interested in camping in a beautiful part of Wales, right in the middle of the countryside, close to the beach? If so, then you can't go wrong.", "title": "Amazing!", "user": "City_TripperLondon", "date": "September 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20498867}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 3, "average": 2, "very good": 8, "terrible": 0, "excellent": 25}, "aka": "Fforest Camp Hotel", "slim_ranking": 0.4, "description": "Staying at fforest is an experience more like staying in a hotel than a tent,a hotel with woodland corridors and canvas rooms.No TV, no mini bar, no trouser press:Sleeping, living and eating under canvas. With beauty, birdsong and cold-at-night. We offer a selection of accommodation types from traditional tunnel tents to Scandinavian Katas and geodesic domes. NEW for 2013 we have the fforest campshack - two bell tents with a communal living and dining area, complete with woodburning stove. Ideal for larger groups or two families to share, the campshack sleeps up to 8. If you don't do canvas then we also offer 4 crog lofts - boutique split level living in a converted farm building. Our accommodation has featured on BBC and S4C and in a national Visit Wales TV & cinema ad campaign."}