{"user_rating": 4.5, "review_count": 1807, "name": "Fiesta Americana Grand Coral Beach Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "FACGB is a wonderful hotel. We just returned last night.I was careful to read all the reviews both before and after I made my reservation. I am so glad we chose the FACGB. It was super. I have no complaints. From the check in to the check out everything went perfectly. We did not do the Grand Club nor did we stay in one of the huge suites. We had the Ocean View Mini Suite. This was perfect for us. Upon our arrival we were greeted by a wonderful staff and led to our room where there was a bottle of champagne (our anniversary) awaiting us. The food was great the pool was warm..the pool bar(s) were great. I will stay there again and I highly recommend this fabulous hotel to anyone.", "title": "Heaven on Earth", "helpfulness": 4, "user": "ennaejb", "date": "July 29, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 2329714}, {"rating": 5.0, "title": "Absolutely love it!!", "text": "This is our 3rd visit to FAGCB. Went the first time with my husband's company. Have returned every year since. Words cannot explain how beautiful the hotel and helpful the staff are. The beach is nice and calm if you have children. The rooms are a great size. The location couldn't be better. The hotel is alittle pricey however it is in walking distance to many area restaurants which I highly recommend. It is definately safe to walk around. Have never seen or heard of any crime.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 28, 2004", "id": 2327420}, {"rating": 5.0, "title": "Great vacations!!!!!", "text": "My 5 year old daughter told me she never wants to back to Disney- wants to go to Mexico every year!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 27, 2004", "id": 2323955}, {"rating": 5.0, "title": "Outstanding As Usual", "text": "This year she went to the kids club every day where I literally had to drag her out. Jessica in the kid's club was unbelievably patient and kind with all of the children.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 27, 2004", "id": 2323921}, {"rating": 5.0, "title": "Great Hotel.. BUT.........", "text": "The food is free for kids 12 and under provided you order a meal. We did purchase a meal plan with breakfast and lunch or dinner. Were a bit disappointed because no one told you that seafood was not permitted on this plan. This should have been told to us before we purchased the plan, however it still worked out OK. The breakfast buffet is $20 (and worth it).", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 26, 2004", "id": 2322691}, {"rating": 5.0, "title": "Best Hotel Ever!", "text": "I just got back from a great stay at the Fiesta Americana Grand Coral Beach in Cancun, Mexico. It is the absolute best hotel I have ever stayed at. I cannot say enough great things about this hotel. The rooms are nice and spacious. Great customer service. Food is excellent and reasonably priced. The pool is gorgeous and extremely clean. The private beach is great and clean as well. I will definitely go back and will use Fiesta Americana in other locations as well. What a wonderful experience!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 10, 2004", "id": 2438268}, {"rating": 4.0, "title": "A few problems but overall very nice", "text": "My family (myself, husband and 2 kids) just returned from our vacation to Cancun. My kids are ages 14 & 9. When we arranged our vacation through AAA our travel agent advised that this hotel required that we book 2 rooms because my son was 14 so he was considered an \"adult\" for booking purposes. I was ok with that figuring the extra space & 2 bathrooms would be nice. Upon check in however, we could not get 2 adjoining rooms or even 2 rooms on the same floor although this had been requested on our booking. The check in clerk said there were no adjoining rooms available even after I offered to upgrade to the club level. She (Carmen) was totally unhelpful. When I asked to speak with a manager she simply replied that none were available however she kept going into the back office (offering no explanation for her disappearance). Also, although we were checking in around 4:30 they only had one room available and we were told we would have to check back for the 2nd room. Overall the check in process took 45 minutes with a net result of 1 room immediately and they would call when the 2nd room on a different floor was ready. I finally relented on the floor situation as I did not want to spend alot of my vacation time arguing with the hotel clerk and as it turned out my sister was planning on joining us and she stayed in the other room with the kids. If this was not the case however, I would have found the 2 rooms on different floors to be unacceptable.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 9, 2004", "id": 2430845}, {"rating": 5.0, "title": "Fiesta Americana Grand Coral Beach-AMAZING!", "text": "That was the downside of staying at this hotel. On the positive side the beach and the pool were beautiful. The pool water was a little on the warm side at the end of the day but we found it overall to be great. The pool bar was nice (although not cheap). We also really enjoyed the breakfast buffet and the food at Isla Contoy. We also tried the Coral Cafe. The service there was really slow and the rest of us had finished eating while my daughter was still waiting for her order from the kids menu. Tired of waiting we finally got up to leave and told the waiter we were going to the market down the street to get my daughter a snack. They then apologized and did not charge us for our dinner. With this exception, the service overall was really good.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 6, 2004", "id": 2427336}, {"rating": 5.0, "title": "Great place for a fantastic vacation", "text": "We did not have any issues with the maid service. We stayed in room 372 and found that they cleaned our room everyday while we were at breakfast. Also, there were a few nights were the maid came by and asked if we needed more towels. We had a problem with the toilet in 1 room and when we called they came immediately to fix it.", "user": "A TripAdvisor user", "date": "August 5, 2004", "id": 2421363}, {"rating": 2.0, "title": "Go South Instead", "text": "We used the fitness center everyday ($7.50 pp ea. day or $28 for the week). They also provided coffee, juice and fruit there. My daughter had her hair braided at one of the gazebos near the pool. It costs $25 for the front or $60 for the entire head.", "helpfulness": 7, "user": "tmynatt", "date": "August 4, 2004", "id": 2381913}, {"rating": 5.0, "title": "A Frank Apraisal of The FAGCB", "text": "My wife, son and I just returned from a week's vacation at the Fiesta Americana Grand Coral Beach two days ago. I wanted to share our comments while the memories are still fresh. First and foremost, the hotel property including the pool, beaches, public areas and resturants are absolutely striking. I have travelled all over the World and found this stretch of beach to be one of the most beautiful anywhere.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 2, 2004", "id": 2361914}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The junior suites are comfortable, clean and more than adequate for most families or couples. Even my wife who is a neat freak had no issues with the cleanliness of our room or any areas of the hotel. And the views of the pool, beach area and Carribean from our balcony were absolutely breath taking.", "title": "Loved it!", "helpfulness": 2, "user": "SParr", "date": "July 30, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 2346210}, {"rating": 4.0, "title": "Fiesta Americana Coral Beach", "text": "If I could play devil's advocate for a minute and point out some minor negatives:", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 29, 2004", "id": 2333155}, {"rating": 5.0, "title": "The ONLY place to stay", "text": "The pool is way too warm as mentioned by other travelers. It is almost hot in some areas and therefore not as refreshing as it could be.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 29, 2004", "id": 2331052}, {"rating": 4.0, "title": "Nice Place With A Few Faults", "text": "There seemed to be no rhyme or reason to housekeeping's policy of towels or wash clothes. Some days we got four large towels, two hand towels and three wash clothes while other days we got 2 / 0 and 2 respectively. A quick call to the front desk and I had a handful of towels in five minutes...no exaggeration.", "helpfulness": 5, "user": "BigMcC10", "date": "July 29, 2004", "id": 2329754}, {"rating": 4.0, "title": "wonderful vacation", "text": "My family of 7 just returned from 7 nights at FAGCB ON 08-09-04. We read all the reviews and finally decided on FAGCB rather than the JW Marriot largely due to the serene beach. This was a big concern for us as we have 5 children ages 13, 11,9,6 and 5. The beach at the FAGCB is somewhat protected and there is no surf at all.", "helpfulness": 17, "user": "hrfuchs", "date": "August 29, 2004", "id": 2500408}, {"rating": 2.0, "title": "Service does not live up to the word Grand in FAGCB", "text": "Upon arrival , the bell staff was very courteous and warm. My wife didn't want to part sight with her new Brighton luggage and the staff practically had to rip it from her arms as it appeared they could not bear to see her carrying her own luggage. They also did their best to learn our family name and continued to use it throughout our stay. Check in was fast and easy. We upgraded to the Grand Club which for us was a mistake. We had 2 rooms and at $80 per night for each room it was not a good fit for our family.This was due largely in part as we could not eat $160 in snacks or drinks. Also we heard a group of 20 somethings at the pool say how easy it was to walk into the Grand Club and eat and drink without having to pay for the service, \"They don't even ask what room you are in\" , we heard them say. They were right, they dont ask you for your name or room #when you arrive. For those who pay for this service, its a bummer. We cancelled the service after the first night without any problems.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 23, 2004", "id": 2488227}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "We ate only in the Hotel's breakfast cafe. They had a wonderful buffet for $24 per adult. Kids under 12 eat free at the buffet and at all hotel restaurants (off of the kids menu) this was a nice treat, especially for the buffet which was a nice way to start the day. The staff at the restaurant buffet was extremely courteous and always made sure we had anything we needed. They host even went and looked for our 5 year old son's swim goggles which he lost in the lobby and somehow returned with them, even after we could't find them.", "title": "Flawless Stay", "helpfulness": 9, "user": "Steve421", "date": "August 14, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2449330}, {"rating": 4.0, "title": "Not quite a 5 star property(yet)", "text": "I read complaints about the pool being too warm. These are probably the same people who would complain that a pool in Alaska is too cold. You're in the Carribean, the weather is hot and humid, hence a warm pool. It was not as bad as remarked, but it was on the warm side. If you want to cool off, walk 15 yards to the beach and dive in. The ocean is nothing short of incredible. The pool does show its age with cracked and missing mossaic tiles. My 11 yr old cut his foot on one of these and this was not his fault.", "helpfulness": 7, "user": "mkmd1", "date": "August 14, 2004", "id": 2448315}, {"rating": 5.0, "title": "Absolutely Beautiful!!", "text": "They have two swim up bars at the pool which are way understaffed. The waiters/bartenders are very nice and courteous but way overworked which can lead to delays in drink and food orders. Also, they close the swim ups at 6 pm which both my wife and I as well as our new poolside friends agreed was way too early. They close the pools at 8 PM which is too early in our opinion. There were nights we would have liked to enjoy the pool until later.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 11, 2004", "id": 2442073}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 5, "variance": {"poor": 56, "average": 91, "very good": 353, "terrible": 40, "excellent": 1267}, "aka": "Fiesta Americana Grand Coral Beach Cancun Resort And Spa", "slim_ranking": 0.0520231213873, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "This luxury hotel rises majestically in the heart of Cancun’s entertainment district. The 602-rooms present with all the class of a fine European hotel, combined with the warm and gracious service that has made us famous. Our full-service spa, invite you to enjoy the endless relaxation and adventure. Fine cuisine is available in our nine restaurants and bars. Guests may also use the large outdoor pool along with a children’s club."}