{"user_rating": 4.0, "review_count": 355, "name": "Fiesta Americana Villas Acapulco", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We had room 934 we had a great ocean view from our balcony. the room was very nice we had a safe that would fit a laptop, strong WiFi signal. refrigerator. the resort has 2 real nice pools we never had to go with out a chair then walking down to the beach there are several places you can rent chairs, table and a umbrellas for less that 50 Pesos. The location is in the center of lots of restaurants. cabs and busses right out front readily available next time I am in Acapulco I will stay here again", "title": "Perfect Location", "helpfulness": 1, "user": "Paul C", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154536793}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Located right in the heart of Acapulco's \"Zona Dorada\" so it's fairly well located. I went there on business but it was a mexican holiday, my goodness it got crowded! I stayed on the north side of the hotel and it was very noisy, even with headphones and an episode of Seinfeld on a loop. They moved me to the top floor and to the south side and it was beautiful. Rooms are maintained, comfortable beds, good AC and everything you need for a long stay. Beach access a bit complicated but a nice stretch of beach.", "title": "Nice but Noisy", "helpfulness": 1, "user": "tony e", "date": "March 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 154534127}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This was my 9th year staying at the Fiesta Americana in Acapulco and, as usual, the service and staff were both outstanding (front desk, pool, housekeeping, etc). Book a room on one of the upper floors on the side facing the pool so that you can see the best sunset in Mexico each day. Some people do not like the music played at the bars along the Condesa, but it is really only an issue on weekends. This is by far the best hotel on the Condesa, and close to everything. Acapulco gets a lot of unfair negative press in the USA and elsewhere, but overall the city is safe, and you cannot find a safer place to stay than the Fiesta. Each room has a modern safe for valuables, and there is outstanding security in the hotel. I cannot wait to go back next year. This is my second home in sunny Acapulco. They treat repeat American guests very well. My only gripe is the timeshare people (who do not bother regular guests or try to sell you if decline a tour) and the people they bring to the hotel, but it is not a big deal, and the hotel does need to bring in revenue.", "title": "My 9th year staying here & still outstanding service & staff", "helpfulness": 3, "user": "NYCACAPULCOFAN", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153311570}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "There are perhaps 1-2 other hotels located on the bay that are in the category of the FA but none get higher check marks in all the categories above.", "title": "Best hotel on the strip", "helpfulness": 2, "user": "truck2chief", "date": "February 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153256282}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "From the front desk to house keeping to the pool side and beach front service the Fiesta Americana has set a high level of excellence.", "title": "Three star rooms with five star \"views\"", "helpfulness": 2, "user": "lovetravel45068", "date": "February 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 153211690}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "A very good option on Acapulco. Very good location and infraestructure; only the suites has full view to the ocean, you can ask for a partial view on a Junior Suite. A very nice hotel but be careful aboute the time share offers!!!! They will offer you a little discount on the fare rate but them you will have to spent like 3 hours of your time with this guys. Firstable you will have to share your breakfast with a lady who extracts all the info she can in order to set up a selling strategy. Them you will be force to make a detail tour to all the hotel and finally some \"financial advisor\" will make you a proposal in order to be a part of their tmi share; if you say no, they sent you another guy and if you say no to him, they preactically kick you out of the place!!! Very rude!", "title": "Very good infraestructure...run away from timeshared!!!", "helpfulness": 3, "user": "Arturo M", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144669183}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I took my boyfriend there as a birthday gift. As soon as we arrived to the lobby, a guy took us into an office and in a very polite way, offered a free breakfast if we accepted to hear about the new vacation plan they were selling. They asked us if we were married (very unconfortable) and if we worked, if we had credit cards, etc.", "title": "Spoiled Surprise", "helpfulness": 2, "user": "moongirltete", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 142596488}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "That night we went out to celebrate, we came back late and while we were sleeping like babies, the guys from the vacation plan were calling us to go downstairs for the breakfast!!! So annoying!! We didn't answer, but as the elevators are right in front of the desks, they approached as soon as we were preparing to go to the beach. The insisted that the next day we could still have the breakfast, same story.", "title": "Nice place, but definitely mold issues", "helpfulness": 1, "user": "WinterinIllinois", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 142570556}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We went to the \"interview\", the guy sitted to have breakfast with us and gave us 25 minutes to eat (the most!!). It was really unconfortable to be asked if we were planning to get married, when, how much do we earn, etc etc!!! It turned out to be a 3 hour talk, and after lots of negatives, they finally let us go. We wasted out last day inside their offices surrounded by unconfortable questions. STAY AWAY of any Fiesta Americana or Fiesta Inn, specially if you're planning to be \"romantic\"!", "title": "Great short break", "helpfulness": 2, "user": "Bobby B", "date": "September 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141407735}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel is clean and all the food was fine. But it is a family or elderly people hotel. The rooms are average, ours had an old deformed matress :S", "title": "In general everything was OK", "helpfulness": 2, "user": "EsperanzaHirsh", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138429671}, {"rating": 4.0, "title": "Great hotel and a guide reccomendation", "text": "We stayed here and had a fabulous time. Great views, clean, safe, lots of families having a great time. It's awesome that you can bring your own liquor / food and save money!", "helpfulness": 5, "user": "Kathleen D", "date": "July 29, 2012", "id": 135745950}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We also had an excellent guide to take us around the city--Sebastian! He is polite, professional, speaks excellent English, and charges extremely reasonable prices--the same as a regular taxi. If you want a guaranteed safe ride from the airport, and a great guide to see some interesting areas of the city--he's your man! He has a ton of historical knowledge and facts. He is very accomodating and designs tours around your needs. Email him at: acapulcofor_all@yahoo.com. I am happy to see an enterprising small-business man doing well.", "title": "Super comfortable and pleasant", "helpfulness": 1, "user": "greensmartie", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135720901}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "- great location", "title": "Great Location but many but´s............", "helpfulness": 11, "user": "Norman V", "date": "July 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 133330077}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "- awesome rooms! comfortable, clean, bright, good view, comes with a kitchenette (very useful)! we've stayed in more than 20 different hotels around mexico and this was great.", "title": "Very nice hotel!!", "helpfulness": 4, "user": "Andrea Lucia G", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132103556}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "- service is exceptional", "title": "Very good, Acapulco Very safe. beach front. in the middle of the action.", "helpfulness": 1, "user": "Albert L", "date": "June 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131290244}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This was my third time staying at this Hotel and I enjoy it more each time, Its central location make it convenient to plenty of restaurants and easy access to beach. The Buffet breakfast is very good, Staff is always ready to help and assist in anyway.I highly recommends this hotel", "title": "Great Return Stay", "helpfulness": 1, "user": "hobohank", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153183463}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "My family and I visited this property and we had a great time there, the hotel is very traditional, it is located in the heart of the night life of Acapulco, the beach is incredibly beautiful, the pool area is big and very nice, the staff is very friendly, if you are a member of the Vacation Club you have free internet, if you have a car you can park it at the hotel's parking lot and the fee will be refunded for having dinner in one of the restaurants of the hotel. If you want to rent an umbrella to the hotel at the beach the money will be also refunded for drinks or food. In general, the hotel is very nice and its location is great. the rooms located in front of the bungee jump are noisier because of the night clubs. If you want to have a great time in \"Gold\" Acapulco stay there it's a good option.", "title": "Excellent Place for Families.", "helpfulness": 3, "user": "Rocco2006", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150987262}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Very cleanly (cleaning staff took about 4 hrs to clean our room - thoroughly!), not too many elevators for the high rise building (only 4 for entire building), semi crowded pool on weekends, and adjacent bars don't close till 5am (so yes, very loud nights). Also, yes we were offered the same time share deal, but if you travel - we all how to respond to this - NO THANK YOU!!!", "title": "Noise concerns, but overall great hotel", "helpfulness": 3, "user": "Erick P", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 149207557}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family and I stayed there in a suite, and the suite was great. Unfortunately, 2 of our rooms faced the bars, and yes it was def. a bit loud. Luckily we're fairly heavy sleepers, so it didn't affect us too much.", "title": "Nice but your almost directly across the street from the loudest nightclub on earth.", "user": "keysmank", "date": "December 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 147454822}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "On another note, only one of the valet was friendly enough to help us change our flat tire. Thank you Daniel!!! He was great. Found a jack, and helped me change the tire for our mini-van. I loved him after the whole experience, considering my rental never came with a jack! :( Wish i had better things to say about the other valet staff...", "title": "Great Hotel, Great View, Great Location, Great Price", "helpfulness": 10, "user": "Jordan N", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146592777}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 4, "variance": {"poor": 16, "average": 46, "very good": 133, "terrible": 23, "excellent": 137}, "aka": "Fiesta Americana Villas Acapulco Hotel", "slim_ranking": 0.0284090909091}