{"user_rating": 5.0, "review_count": 181, "name": "Finca Es Castell", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here in August for a week. Before we booked this finca i had done much research into where we wanted to stay while in Majorca. We were not disapointed, the finca is so tranquil and so so stuning to look at. James and his team are truly experienced at making you feel welcome. We were given a tour and had the routine of the hotel explaned to us. We booked at very short notice and i think we had the last room . We was told this was one of the smaller rooms, however it was more than adequate and quite charming. no complaints at all. Breakfast was lovely and plenty of it , and we liked the flexi way you take your chosen brakfast items and sit where ever you like. Evening dinner was served on the terrace, which is very nice , the food was of really great no complaints at all and the view while dining was one not to be missed. Al in all we had no cmplaqints only praise for James and his team. Would recomend anyone stay there, but you do need transport., amazing scenary , lush surroundings,quiet and tranquel, but not stuffy.", "title": "Not Disapointed", "helpfulness": 2, "user": "UkSand", "date": "September 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80176579}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I came in search of tranquility and relaxation and found it here. Es Castell is set in beautiful surroundings and I didn't leave the finca but spent my time reading in the hammoc under the olive trees, relaxing by the swimming pool, taking walks in the surrounding olive groves. The food was great, lovely sallads at lunch time and dinners were served on the star lit roof terrace with beautiful mountain views. Special touches and attentative service made this a memorable stay. I hope to come back.", "title": "A very special place", "helpfulness": 1, "user": "aolo_10", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78580600}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I don't have much to add to the other reviews here other than to heartily recommend Es Castell to anyone looking for hassle-free relaxation in the Majorcan sun with the added bonus of incredible food and hospitality from James and the team. The food really is excellent, locally sourced fish and lamb from the estate cooked to perfection. Lunch is a simple affair of the best kind - great platters of cheese, fruit and ham. Divine. The biggest decision of the day revolves around shall I have my nap over there in the hammock or by the pool? The Finca is in a very peaceful rural location, with the beach about 30 minutes away by car. A dunk in the pool every so often took the edge of the Spanish sun and we didn't move until day 4 and even that required a massive effort. Leave your shoes, your woes and your diet at home and let Es Castell do it's magic. Bliss.", "title": "Charming hosts, a totally relaxing and magical experience", "helpfulness": 2, "user": "Expensivehotelhabit", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77643043}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our third stay at Es Castell was, again, very relaxing and charming. James and Paola and their staff have maintained the warmth and hospitality we have come to expect. Breakfasts and dinners continue to be of very good quality and the service is attentive. James always finds time to have a chat and to recommend places of interest to visit. My wife and I are made to feel at home here and we shall encounter withdrawal symptoms if we don't visit on a regular basis! So, yes, another visit will be on the cards.", "title": "Another relaxing stay", "helpfulness": 2, "user": "rgejones", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77532874}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Just over a year since our first stay, and Es Castell remains marvellous. it's one of the few places we have returned to, and we will again. Our room had a fantastc view, and was comfortable and cool. The only sound you can hear is the tinkling of goats' bells. James and his staff are 100% helpful, yet never obtrusive. Dinner on the roof top terrace in the balmy evening air is the memory that gets me through the dismal English winter!", "title": "Still marvellous, tranquil, rustic yet comfortable,", "helpfulness": 2, "user": "Hampshirehog9", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76978499}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We had such a lovely time at Es Castell. The hotel is charming, very well cared for and in a beautiful setting. James and his staff are friendly, attentive and helpful, nothing seems too much trouble. The atmosphere is so relaxing!", "title": "Rustic charm with comfort and a touch of luxury", "helpfulness": 1, "user": "samuelpsmith", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 76013839}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "This hotel is such a find. My husband first went with friends not long after James and Paola started running the place and he's raved about it since but it's taken him 7 years to take me there! I made him promise we'd go back every year from now on. The atmosphere, the views, the rooms, the food, the service, everything about this place is spot on, perfect for shutting yourself away from the busy world around you and soaking up some sunshine. Thank you James and Paola. Love Katy and Tom x", "title": "A wonderful hideaway, we'll definitely be back.", "helpfulness": 1, "user": "KatyBuxton", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72376127}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This is a fantastic place to stay in Mallorca. Beautiful, ancient farmhouse in the foothills of the mountains with an amazing garden and pool, excellent food, friendly and heipful hosts and an atmosphere of peace and tranquility. Can't wait to go back.", "title": "Absolutely perfect - peace and tranquility in a wonderful setting", "helpfulness": 1, "user": "CathB67", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70680060}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Perhaps there's a guest accommodation somewhere on the planet that is the equivalent of Finca Es Castell, but there can be none better. Certainly none more peaceful, calming, serene. Beautifully situated in Majorca's rural interior in the limestone Tramuntana foothills amidst acres of citrus, olive and almond trees, just breathing the air fragrant with rosemary and eucalyptus is instantly calming. Listen. In the far distance, sheep are tinkling their bells. Curlews, thrushes and warblers singing their songs. This is a whole other Majorca, not far in miles but still a different world from the high rises and crowded beaches along the coast. Finca Es Castell takes perfect advantage of this setting -- idyllic begins to describe it, but not thoroughly enough -- as you walk thru its courtyard paved with stones put in place in the XI century. Also from another time, an old stone olive press -- an almazara -- stands at the center. Everywhere you look is a postcard-perfect tableau. It's almost like this place is a part of nature. It belongs.", "title": "Finding tranquility amidst the olive trees in Majorca's interior", "helpfulness": 2, "user": "KeskaSay", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67691708}, {"rating": 5.0, "title": "friendly hosts in calm environment", "text": "It was April and the Majorca spring was about to ... spring. Our flight from London was a late one, so it was nearly midnight by the time my wife and I made our way in the dark from Palma de Mallorca airport to Finca Es Castell. James Hiscock, the affable English ex-pat owner, had offered to drive down to the nearby village of Binibona and lead us to our destination, but we (amazingly) managed on our own. He was up and waiting for us, and after getting us settled in our room, brought a lovely light supper and a bottle of wine from his cellar. Our internal stress switch suddenly reset itself to the off position. And it stayed off for the duration of our visit, much too brief because we were off to Barcelona after just three days.", "helpfulness": 1, "user": "GabieK", "date": "June 9, 2010", "id": 66969314}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We found Finca Es Castell to be the perfect antidote to our typically hectic lives. After our first short break there in 2008, we knew that a return visit would be exactly how we'd choose to punctuate every busy year.", "title": "Perfect setting, perfect hosts, the perfect antidote to a busy life", "helpfulness": 1, "user": "TimReid69", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66286335}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "From the moment you arrive to the moment you reluctantly leave, this special place envelopes you in its calm, peaceful, authentic charm. The setting is magical - rural mediterranean at its best. James and Paola are the perfect hosts - friendly, attentive but always unobtrusive. The food is exquisite. The rooms are charming, comfortable and full of character.", "title": "worth a 40-year wait", "helpfulness": 1, "user": "keithandjanetcooper", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66274378}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "If you're looking for an indulgent escape from the real world, the whole Es Castell experience is the perfect tonic.", "title": "An authentic oasis of peace and nature, great food and excellent hosts", "helpfulness": 1, "user": "CordobaBasel", "date": "May 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65592033}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We were married in 1967 and spent our honeymoon in a high(ish) rise hotel in a big(ish) resort in Majorca. we intended to return to the island many times, but finally made it for our 40th anniversary. older and wiser, we chose Es Castell and were rewarded with a wonderful holiday in this exquisite, peaceful retreat. The house is beautiful, with every little nook and cranny of quirky Mallorcan architecture retained. The gardens and pool, nestling under a gentle mountain, are a joy, with views to lift the heart. Breakfasting in the shade on the stone terrace, or dining on the roof terrace listening to birds and goat bells, the food and attention is superb. And if you should become bored with paradise, there are delightful trips in the Mallorcan countryside.", "title": "A perfect hideaway in the hills", "helpfulness": 1, "user": "dg_clarkson", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65516991}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Nothing too much trouble.", "title": "Blissful relaxation, scenery, food and, well, just bliss", "helpfulness": 1, "user": "MalindiBristol", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65413024}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "James & family were excellent hosts, the food was delicious, the pool & gardens were lovely and the rooms were great. They were very accommodating when we arrived late and offered us cheese, cold meats & bread and cool beer by the pool. The location is stunning, and quiet but yet not 'cut-off', you can visit the local towns easily if you have a car. Would love to go back!", "title": "Beautiful, relaxed atmosphere", "helpfulness": 1, "user": "zzzLondon", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 65357303}, {"rating": 5.0, "title": "Truely beautiful", "text": "Authentic, genuine, charming, relaxing, inspiring and very welcoming. This place sets the standard of the type of accomodation I am looking for when travelling with my family (including young children). We had some beautiful walks in the neigbourhood and fantastic dinners, lunches and breakfasts. Come and see for yourself.", "helpfulness": 2, "user": "KarmaKompas", "date": "May 15, 2010", "id": 64197984}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Before our short four night visit to Majorca earlier this month, I researched non stop looking for the perfect getaway. We were arriving on 6 April, my wife's birthday, so I didn't want things to go wrong.", "title": "We cannot wait to go back", "helpfulness": 2, "user": "EuropeBlueSky", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61984382}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We wanted total peace, magnificent mountain views, a hillside finca that was isolated, incredibly old, but still offering quality hotel service. We so much wanted good food, congenial hosts that were helpful and generous of spirit , hotel guests that did not feel that a good time can only be had with endless pints of ale and hotel staff that were delightful.", "title": "When we are planning our annual holidays, Es Castell is always considered first, not if but when!", "helpfulness": 1, "user": "chesterYorkshire", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52088422}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We were visiting Majorca, so that was obviously a pipe dream - or was it? Sadly I have to tell you that we found the perfect spot. Why sadly? Well I'm torn between keeping the Finca Es Castell a secret, or letting the cat out of the bag. However, as others have already let the cat out of the bag, I guess I will just have to join them.", "title": "Just Magical - a taste of heaven", "helpfulness": 3, "user": "Rudi72", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39673369}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 0, "average": 0, "very good": 8, "terrible": 1, "excellent": 172}, "aka": "Finca Es Castell Hotel", "slim_ranking": 1.0}