{"user_rating": 5.0, "review_count": 123, "name": "Finca Son Jorbo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We chose this place on the strength of other reviews and we were not disappointed.", "title": "fab fab place!", "user": "Canischio", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85948714}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We went during the October half term week and we can honestly say we had a wonderful time there (helped by the gorgeous weather).", "title": "A superb place to stay!", "user": "EastSussexSid", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85543965}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The owners, Martin and Annie, couldn't do more to make you feel welcome and pampered right from the start. They even took it upon themselves to send me back to the UK the drawerful of clothes I left behind..:-(", "title": "Fantastic place to stay", "user": "christraveller16", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84257695}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We LOVED the apartment we stayed in and it was an ideal solution: B&B service but all the advantages and freedom provided by a mini apartment (it meant we could unwind in the evening, cook ourselves a light supper and had plenty of space to unwind, unlike your traditional room in a hotel).", "title": "Magical Mallorca", "user": "maverickHome", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82428753}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The finca is a wonderful farm, very tastefully decorated and furnished and it's set in beautiful countryside. It's a shame we couldn't make use of the stunning swimming pool (it was a bit on the chilly side) but it must be fantastic to use in the summer .", "title": "Deserves its top ratings", "user": "Sebastian1978", "date": "October 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81786914}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Very good value for money, Annie & Martin were always very helpful and had good recommendations, we would recommend everybody to enjoy a recovery time at finca son jorbo, thx so much for everything! Severin & Manuela", "title": "Enjoy a wunderfull time at finca son jorbo!", "user": "Severin1981", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115577105}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We have become disillusioned with package holidays and felt there must be somewhere that wasn't filled with tacky Irish bars, no matter what you paid there was no escape and I am please to say there is - Finca Son Jorbo.", "title": "Excellent", "helpfulness": 1, "user": "IanSue72", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115422487}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We knew there must be such places and the Finca is exactly what we wanted, it met all our expectations. The house is an old Majorcan country house that has been beautifully restored and has four individually designed apartments. Our aparatment (Azul) had a large lounge, four poster bed, large bathroom and private outside terrace where we spent many an evening with a glass of wine watching the stars. In the morning you could look forward to a leisurely breakfast on the patio.", "title": "a wee slice of heaven...", "user": "RaeBroon", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115244046}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The owners, Martin and Annie, were very welcoming and friendly and had thought of everything, there was even cool boxes and umbrellas for the beach and nothing was to much trouble - we can't wait to go back and have already booked for next year.", "title": "Perfect in every way!", "user": "judithLeeds", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114858309}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The surrounding area is unspoiled, the local town has made little concession to tourists, menus are in Spanish and very little English is spoken. Go a little farther afield and there are some beautiful old towns which have escaped the ravages of tourism, long may they stay thus. Nowhere is very far away and the best beach on Majorca, in my opinion, Le Franc, is 30 minutes car drive away.", "title": "Every thing we hoped for and more", "user": "ChesterKesi", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114608875}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This is the place to stay if you wish to rejuvenate during vacation. My girlfriend (now fiance) and I went to Majorca to rock climb, wine taste, and chill during the winter holidays and Finca Son Jorbo was the perfect place to stay. Annie and Martin have a gorgeous property in Porreres, which is the town between Palma and Manacor. They strive to meet your every need and they do so and more. My girlfriend was looking for a recommendation on a place to have a Christmas picnic and Annie recommended Cap de Ses Salines, the southern most point of the island. It was the perfect recommendation to the point where I decided to propose to her. Our room, the Azul room was more of a suite than a room with a full equipped kitchenette and sitting area both inside and outside. Thank you Annie and Martin for suggesting the ideal location for an engagement as well as a perfect stay on our vacation!", "title": "A Most Suitable Place to Get Engaged", "helpfulness": 1, "user": "dnumgis02", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122711108}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My wife & I took a holiday during non-seasonal, mid-November at Son Jorbo, which was recommended to us. Our hosts were hospitable & helpful, and their converted farmhouse proved better than most 4* hotels. The area was peaceful - no children allowed, only cats, 10 at the last count - and the appartments were pleasant, artistic and well-designed reflecting the character of the farm. They were clean and well-equipped, should you want to self-cater. Breakfast, which was sizeable, included fresh fruit & bread, home-made preserves and local cheeses, as well as cereals & yoghurts. Eggs with your ham were also an option. No need to worry about another meal 'til the evening! Practically, a car is useful here - it's about half-hour drive from the airport - tho' there are local buses about 20 mins walk away. Also, this venue would be difficult to manage for SOME people with mobility difficulties because of the varying levels within appartments and public areas. We thoroughly enjoyed our stay, and have it in mind to return in the not-too-distant future.", "title": "Hidden Gem", "user": "Dave R", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121050584}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This is a wonderful country villa for adults to chill out in. Annie and Martin have created 4 apartments, all so well appointed that we found nothing lacking from ours. We stayed in azul which is so very well designed! The four poster was more comfortable than at home... The public areas are so inviting, yet cool in the heat of the day, even the pool has natural shade. The pc for internet access was a boon for keeping in touch and the library and games well used. Breakfast was a delight, particularly for this picky veggie and was served with loving attention to detail. Porreres is just 5 minutes on the bike (we were totally car-free) and is charming and unspoiled for meals etc with enough for the visitor. Annie and Martin are superb hosts.", "title": "Fandabbydosy", "helpfulness": 1, "user": "Colin B", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119568004}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My partner and I have been to Finca Son Jorbo twice. Both times have been excellent. Super, comfortable, clean rooms, great hosts and lovely b'fast.", "title": "Brrilliant", "user": "Guy B", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118334493}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Quiet, relaxing and beautiful.", "title": "Want a kids free relaxing break - this is definitely it!", "user": "Sara G", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118310195}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We had a very relaxing, peaceful stay at this beautiful place in Majorca.It is an ideal ,central location for visiting other parts of the island.", "title": "PERFECT !", "helpfulness": 1, "user": "louise03755", "date": "June 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113609841}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Annie and Martin are generous, kind hosts and nothing was too much trouble.", "title": "Great escape for a relaxing time!", "user": "JulieandJohnRedditch", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113222178}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We enjoyed a fun evening with other guests on their romantic patio and had the best tapas ever! All freshly cooked.", "title": "Delightful rustic elegance!!", "user": "frankversailles_KY", "date": "April 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105779223}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Thankyou so much. We will be back!!", "title": "GREAT, GREAT, great place to stay!!!!", "user": "stimela", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104535236}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Excellent accommodation with perfect hosts. The nicely equipped kitchen and facilities provided gave you the option to either cater for yourself or just simply enjoy the local cuisine. Annie and Martin provide an excellent breakfast out on the patio, Martin even made us a pancake.", "title": "Finca Son Jorbo is a Mallorcan pearl !!", "helpfulness": 2, "user": "shawshots", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89729138}], "location": {"country": "Spain", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 122}, "aka": "Finca Son Jorbo Porreres, Spain - Majorca", "slim_ranking": 0.5, "description": "As the owners of Finca Son Jorbo, we have tried to create the sort of place where we would like to stay. We believe that we offer more than just a bed and breakfast. Rather than having only a bedroom, our 4 stylish apartment suites each have a bedroom, a sitting room, a bathroom, a kitchen and a private terrace, giving you plenty of space to make yourself at home. Finca Son Jorbo is a traditional 17th century Mallorcan house in a rural location with views over the local countryside. The house and gardens offer a peaceful and informal place for grown-ups to unwind and relax without children. Our central location enables you to get to almost anywhere in Mallorca within 1 hour, making it the ideal base from which to explore the whole island."}