{"user_rating": 4.5, "review_count": 416, "name": "Fishmore Hall", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We are fairly frequent visitors to Ludlow as it is ideally situated halfway between north and south Wales for family 'get togethers'. In the past we have always stayed at The Feathers Hotel in the centre of Ludlow but as Fishmore Hall was promoting itself on the KGB deal network we decided to give it a try and we booked two rooms for two nights in August. We weren't disappointed. The hotel is beautiful; our superior rooms were spacious and well appointed. The beds are huge as are the walk-in showers. Bathrooms offer thick towels, dressing gowns and Molton Brown toiletries as standard. There are excellent tea/coffee making facilities along with a mini bar full of local produce. Bottles of water are complimentary. There is a lift to all floors. The views from the bedrooms across the Shropshire countryside are breath-taking. The staff were unobtrusive and very friendly. Check in/out were both swift and smooth. Breakfast was delicious and leisurely offering an extensive menu that would cater for most tastes.", "title": "Beautiful luxury!", "helpfulness": 1, "user": "Eurostarer", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117035497}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We dined one evening in the hotel. It is here we had our only negative experience. Due to various dietary requirements of our party we opted to dine from the simpler bar menu. Whilst the food was delicious and the service attentive, we were segregated from the other diners who were dining from the a la carte menu. Our dinner bill was in excess of £80 for three people so we clearly weren't eating bar snacks and there was ample space within the dining room conservatory.", "title": "Fantastic Fishmore Hall", "helpfulness": 3, "user": "Sam_Young", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116715248}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The hotel has its own car park. Fishmore Hall is situated about two miles outside of Ludlow so a car is needed.", "title": "Midweek dinner, B&B deal is highly recommended", "user": "WalesNewlyweds", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116481502}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We shall certainly return to Fishmore Hall and I recommend it to anyone looking for a peaceful and relaxing break in Ludlow.", "title": "Excellent hotel in lovely setting", "user": "FAinslie", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116335932}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "My Wife and I decided to spend our 3rd wedding anniversary in the lovely Fishmore Hall.", "title": "WONDERFUL", "user": "GwynandLesley", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116099922}, {"rating": 3.0, "title": "Pleasant enough restaurant", "text": "Came here on the weekend. The restaurant is pleasant enough with friendly service, but unfortunately it does have to compete with some of the best restaurants in the area (with similar prices). Some dishes work brilliantly and the pre dessert of strawberry soup with tarragon ice cream is fantastic, however, some of the dishes seem to have ingredients which don't marry particularly well. Having said this, the accompanying wines were brilliant. All in all, a nice evening.", "user": "R0za", "date": "June 10, 2012", "id": 131655540}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We have just returned from a lovely 2 night B&B basis through a KGB deal. Although we upgraded the room it was still a fab offer. Our check in was perfect and we certainly felt expected by the friendly efficient lady on reception. Our room (24) on the top floor was a good size ,clean and thoughtfully decorated. The bathroom was large with a double ended bath, separate shower and Molton Brown toiletries. It was clear that the emphasis was on the comfort of the guests and all the staff were so helpful, nothing was too much trouble. The food was great in the beautiful garden room. We went for the tasting menu and although some of the ingredients were a little challenging for me (lamb sweetbreads, frogs legs and the snails should remain firmly in the garden, not on the plate!) the quality and presentation of each dish was tremendous; the beetroot carpaccio was outstanding. Service was good. We would certainly visit this hotel again.Well done to all.", "title": "Lovely place to stay", "user": "ToscaPeterborough", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131569293}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed here over the Jubilee weekend for a family wedding, thoroughly enjoyable the experience, there are not enough superlatives to describe our stay. Credit to the staff and management, well done.", "title": "Family Wedding", "helpfulness": 1, "user": "Chris T", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131540267}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Enjoyable mid-week stay at this country hotel just outside Ludlow. Friendly and efficient staff, comfortable bed and good bathroom.", "title": "Comfortable hotel with excellent restaurant", "user": "GSWLondon", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131485538}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Dinner in their restaurant overlooking the fields met with our high expectations. Choose from their Imaginative menu whilst sipping drinks in the lounge. The delicious meal was cooked with flair and sourced from local providers.", "title": "Creme de la Creme (minus the apostrophes)", "helpfulness": 2, "user": "zebbidy", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131420432}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Fishmore Hall hotel is a charming English country house hotel just outside Ludlow in Shropshire.", "title": "Quiet, Comfortable and Relaxing", "user": "OldVillain", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132455900}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Although just off a country road, the atmosphere is quiet and relaxed. It's a place to go for a quiet, relaxing weekend or to use as a base to tour the area.", "title": "Overall a lovely weekend which needs a bit of tweaking to make it amazing", "user": "Dianebg", "date": "June 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132444990}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The hotel has been refurbished to a clean, \"modern\" and high-quality standard. The rooms are sizeable and well appointed, with all that you could want for an enjoyable stay.", "title": "Wow!", "helpfulness": 2, "user": "ChilledLiverpool", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132303995}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The bed was so comfortable that I was asleep in minutes and only woke when my alarm sounded.", "title": "Doesn't live up to its hype.", "user": "KLN234", "date": "June 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 132298418}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "It's lovely to wake up to the quiet sounds of the country with birds singing, cows lowing and bees buzzing.", "title": "this is how all hotels should be", "user": "leedsUKLesley", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132167204}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The hotel is understandably popular with weddings, so probably worth checking there isn't one when you book!", "title": "Unfortunate smell", "helpfulness": 1, "user": "Harris_stratford", "date": "June 4, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 5.0}, "id": 131263116}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Myself and my partner stayed in this delightful Hotel last night. WOW! We did initially worry because of the Jubilee weekend that we'd not get in on the Tuesday night but 4 rooms were left and we picked a superior room. The moment we walked in we were greeted by a lovely Receptionist, shown to our room which was stunning. Molten Brownies bits in the bathroom (which looked brand new) to a mini fridge, which we didn't use and we even had a maid come in during dinner to turn down our bedding! A lovely touch. We were shown immediately to the lounge for pre dinner nibbles after we'd wound down after our journey, with wine and pre dinner nibbles. We were then shown to our table a little while later. The waiters and waitresses were charming and attentive, topping up wine, putting napkins over your knees. I am also pleased we were not there on a wedding evening. The food, well what can I say, totally lives up to expection, and was utterly gorgeous as was breakfast the next morning in the sun room. Without a doubt I would 100% recommend this place and it's just such a romantic setting in beautiful Shropshire Countryside. We will definitely be back. Thanks again for making our stay so perfect.", "title": "Really enjoyable experience", "user": "galloise43", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131115619}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I recently went for a meal at Fishmore hall in their fine dining restaurant. The food itself was lovely, and the staff were excellent. However, the whole experience was ruined by the strong smell of sewage and drains throughout the hotel and restaurant, which made our meal difficult to enjoy. This needs urgent attention before it puts off more customers.", "title": "A beautiful hotel with excellent staff!", "user": "Sunchaser56", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130929512}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "We booked a two night stay with a Groupon deal and upgraded to a superior room which overlooked the front of hotel. We were greeted warmly and shown our room which was spacious, clean and very comfortable. We spoilt ourselves on the first night and tried the tasting menu. It was absolutely delicious with everything cooked to perfection. On the second evening we opted for the two course dinner and again it was excellent. Service was friendly and attentive without being obtrusive. We shall be visiting Fishmore Hall again in the future.", "title": "Excellent fine dining experience", "user": "Dunedain", "date": "October 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 119368742}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Went on a kgb 2 night break, so a little apprehensive re a possible 'second class client' reception. Needn't have worried...from the moment we arrived the welcome was warm and the atmosphere both reasonably stylish and relaxed.. The building has some slightly awkward areas (a view of the kitchen enroute to reception), but clearly real thought has gone into the general decor and our room was a peaceful haven where everything worked and was well positioned. Nice to have bedside lamps with auxiliary spots for reading. Very good beds and linen.", "title": "Fishmore Hall - little gem", "user": "lowrollerUK", "date": "October 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119307607}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Did have a problem with our dinner on the first night...it simply took an age to arrive. However, the cost of the meal was waived with no fuss. Breakfast was a truly scrumptious time both mornings with a terrific choice of cooked to order options, and service from the mostly young staff was prompt and pleasant. The conservatory restaurant, which can feel a bit hard-edged at night, is a joyful room in daylight with expansive views over the countryside. We really felt wanted as guests, and we really felt delighted to come back to this little country house as our base.", "title": "Friendly Fishmore", "user": "ronax57", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119191065}, {"rating": 5.0, "title": "Superb hotel but a little disappointed", "text": "Our second visit to this Hotel was a package celebrating the Ludlow Food Festival (worth a visit in itself). The hotel was excellent with comfortable rooms, friendly welcoming staff and excellent food and wine.", "helpfulness": 3, "user": "Katembelou", "date": "September 22, 2011", "id": 118452283}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Ideally placed for a visit to the amazing town entree in Ludlow, this excellent hotel comes highly recommended.", "title": "bit disappointed", "user": "normskidabble", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 118267591}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed for two nights mid week on a KGB offer. Our standard room was very well appointed and very comfortable, with a side view over the garden and fields beyond. The only problem was that we found the room (8) very hot even and eventually had to ask for a fan as the window will only open a few inches. Something to bear in mind for summer stays (if we get one of course).", "title": "A lovely place to stay", "user": "seelybee", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 132597485}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Breakfast was very good, plenty of choice and beautifully cooked. The service was rather minimal, a surprise in a hotel of this type, but otherwise all the staff were all extremely friendly and helpful.", "title": "Great Hotel and brilliant food", "user": "Lisa S", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132522902}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "However, it did not change our opinion of a well-run hotel with cheery staff and an excellent breakfast in the morning before departure. I can highly recommend it and the Dinner menu looked wonderful.", "title": "Pick your time carefully", "helpfulness": 1, "user": "NigelFerrier", "date": "May 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130527223}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We would return for sure!", "title": "fishmore hall for the disabled visitor", "helpfulness": 3, "user": "david m", "date": "May 24, 2012", "detail_rating": {"value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130519947}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We were at Fishmore Hall last autumn and enjoyed our stay tremendously then. Again, we were not disappointed this time. We upgraded to an executive room overlooking the car park. were shown our room which was spacious, clean and airy with comfortable beds and contemporary furnishings. Standards were maintained with great attention to detail and the quality of service and dining was excellent. At dinner, we chose the set menu rather than the taster menu which we (over)-indulged ourselves in the last time. I had the wood pigeon as a starter with monkfish risotto as the main course while my other half started with the quail and had lamb for the main. Needless to say, the meal was delicious!", "title": "Just as enjoyable second time round!", "helpfulness": 1, "user": "Dunedain", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133248201}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Out in the car park there was a whiff of sewage when the wind blew in the wrong direction. A minor point perhaps but one that may spoil your enjoyment if you were out in the garden having a drink when summer decides to make an appearance.", "title": "Great Wedding Venue", "helpfulness": 1, "user": "Hucclecotecouple", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 133156739}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This is a great place for wedding reception. However, if you are staying there as a guest the day before or during the reception - well - don't. This place is clearly geared up for weddings and parties - my son and daughter in law recently had their reception there and they took over the hotel . Rooms were let out the £100 per room B & B - just about the right price. No reduction for single occupancy though - very naughty. They quote up to £250 per room in their brochure which is frankly crazy. The rooms are an average size - nice bathroom comfy beds. The breakfast the first day was great, the second day left a little to be desired. We had a family lunch which was great quality but pricey and not really substantial. The reception food again was very good if a little nouvelle (small portions). The service (mostly eastern european) was nothing short of excellent throughout and attention to detail was perfect. All in all a great place for a wedding reception - lovely setting, great service, nice rooms, good quality food but - negotiate and if its hot check the dining room much of which is under glass.", "title": "Luxurious Ludlow", "user": "lahinch97", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133155142}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We stayed here on a two night KGB deal 25-27 June. I have wanted to stay at this hotel for a few years but only jst got round to doing so! Our stay totally exceeded all my expectations of Fishmore Hall from the minute we arrived. The staff were all lovely and attentive and we didnt feel that we were treated any differently to ful price paying guests. We have stayed at many outique hotels around the country and this is definately one of the best. We were upgraded to a superior room (room 5). This was a lovely room which looked out of the front of the hotel, as other reviews have stated we did find the hotel very warm - even though there was no heating on - so the windows in both the bedroom and bathroom which opened fully were good to create a draft. The bathroom had a lovely big walk in rain shower and was very spacious. The bed was large and comfortable and we especially liked the decent sized glasses and mugs in the room - too often hotels have tiny ones! The fridge and mini bar were a great touch and we loved the weather forecast for the next day which was left in your room each evening as part of the turn down service. Breakfast was lovely and there was plenty of choice, the quality of the ingredients was obvious. We loved the whole ambience of the hotel and enjoyed relaxing in the lounge on the rainy afternoon playing Trivial Pursuit and sampling different drinks off the extensive menu ncluding coctails! The champagne we received as part of our deal was delious too. We didnt eat in the restaurant as preferred to walk into Ludlow itself. We ate in The Unicorn on Corve st one evening which we would definatey recommend. All in all we had a lovely relaxing stay, we were very impreesed with this hotel and the staff knowledge, attentive and friendly without being over the top. We would definately stay again and recommend to friends and family.", "title": "A one off I hope !", "user": "Peter D", "date": "June 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0}, "id": 133065447}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We went with great anticipation to this well reviewed establishment. There was a long delay before anyone served us drinks in the garden ( although we had made our presence known in the bar) We were then ushered into the lounge for a further wait perhaps another 30 minutes. Asked a rather harassed looking front of house what the problem was and he said \"problems with the till\" when we finally sat down it was another thirty minutes before the starter arrived", "title": "Stylish and comfortable", "user": "EBWilford", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132908565}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I really enjoyed our stay at this hotel, we picked it due to a special offer in the resturant and decided to make a night of it with friends and stay over so not to worry about having the odd glass of wine too.", "title": "Food Heaven and Fab Service", "user": "MisseySWorcester", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117872783}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "From the momement we checked in I was impressed with the hotel the rooms they were very nice and modern and a nice colour theme, they had nice touches on the refreshment tray in the room. Fab wet room shower which was very nice!", "title": "Great place and we would love to go back", "user": "Baggie57", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117689075}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We ate in the resturant for dinner we had the taster menu and it was supurb no complaints from our table it was really wonderful food.", "title": "over 40 mins for breakfast to arrive", "user": "John H", "date": "September 1, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 2.0, "service": 1.0}, "id": 117531430}, {"rating": 5.0, "title": "good experience,will be going back in couple of weeks", "text": "Breakfast in the morning was really good plenty of options - it didnt think I would find room to eat it after the feast of the dinner the night before but it was so yummy!!", "user": "patandfred", "date": "August 28, 2011", "id": 117349425}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Would I recomend a stay - yes as and as an indulgent treat book in for evening dinner too it was fab.", "title": "Fabulous stay, coming back next year", "user": "Karen V", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117184621}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed at Fishmore Hall four years ago and when we saw a discount offer recently we were keen to revisit. We asked for the same room but were told it wasn't available on the offer as it was an executive room. When we arrived we were given the key to the room we requested. Nice one!", "title": "Another lovely stay", "helpfulness": 1, "user": "Hamie", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130511087}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Everything else was as good as 4 years ago and represented incredible value for money on the deal we had. The only exception was the use of sliced bread for toast. Previously they were serving local artisan bread. Food was great, room wonderful, staff friendly and helpful and the area stunning. We will return. Please keep the offers coming.", "title": "Gorgeous small hotel", "user": "Maria C", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130483168}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Well worth the trip and highly recommended!", "title": "Great place for weddings", "user": "farmgirl02", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130447421}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Very friendly helpful staff, stunning surroundings, fantastic room and bathroom, lovely breakfast, lots of parking and reasonably priced!", "title": "WE WILL RETURN", "helpfulness": 1, "user": "notsomuch", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130149339}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My only negative point is that our window was painted shut and it would have been nice to have been able to open it to get some fresh air. I mentioned this to the receptionist when we checked out and she was apologetic and said it shouldn't be like that and she would get it sorted. If only all hotels were like that!!!", "title": "Wow!!", "helpfulness": 1, "user": "Bouff", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130144431}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed at Fishmore Hall on a kgb 2 night deal and we were really impressed. The situation of the hotel is fabulous. We were allocated Room 1 which was in an annexe at the side of the hotel and we had a lounge, bedroom with the biggest and most comfortable bed I have slept in and the most luxurious walk in shower/bathroom. Breakfast was delicious, served in a lovely conservatory overlooking Clee Hill, with cereals, meats, a basket of toast/croissants and danish pastries and a lovely full english. One day I had porridge with whisky and brown sugar which was also delicious. The waiters in the dining room were a joy and very efficient. We walked into Ludlow one evening which was about a mile and the keyring even had a torch on so we could find our way back! Would love to go back, but for longer than 2 nights, and would have no hesitation in recommending the hotel.", "title": "Fabulous location", "user": "jeanniejeannie", "date": "September 17, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118240067}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We spent last weekend at Fishmore Hall. The staff were very welcoming and the bedrooms very clean and comfortable. The food was outstanding and the wines were very reasonably priced. We chose Fishmore Hall for an annual walking holiday for 10 friends and we were given a private room for dining on both nights. The hotel even sent me a book of Ludlow walks prior to the weekend so we could plan our walks. I would return without hesitation and would recomment it to friends.", "title": "Outstanding food and very welcoming staff", "user": "VeniceLoverBristol", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118207345}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "As previous guests at this hotel, we are sent special offers and this one was for an all inclusive “Wine Dinner package”. A room for 2 for 1 night, and a 6 course meal in Forelles restaurant, with canapes, all wines, coffee and petit fours, full English breakfast and VAT with two tickets to the first day of the Ludlow Festival included.", "title": "A Sophisticated Dining Experience", "user": "BernieJMold", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 118155862}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Wine Dinner Evening - sophisticated and fun experience, fabulous food and wine - you must try it!!.", "title": "Beautiful building;shame about the service", "helpfulness": 1, "user": "sarahliv", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 117937626}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Room - Modern 'boutique' hotel style, comfortable and well equipped.", "title": "We loved the stay", "user": "Sheena W", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117929424}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 40, "very good": 102, "terrible": 10, "excellent": 254}, "aka": "Fishmore Hall Hotel", "slim_ranking": 0.111111111111, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}