{"user_rating": 4.5, "review_count": 63, "name": "Fitch Claremont Vineyard Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I just returned from two nights at the Fitch Claremont B&B. We really enjoyed our stay. The rooms were clean, well-accommodated, and comfortable. The house itself and the surrounding vineyard are really nice. Breakfast was phenomenal. We've stayed at many B&Bs and it was one of the best we've had. They even serve some of their wine with breakfast which was an extra special treat. The hosts, Warren and Nora, are extremely pleasant, friendly, and helpful. On our last day, Warren gave us a tour of the vineyards and an overview of his winemaking. We got to sample some of the wine as well. All in all, a very relaxing and enjoyable stay. This hotel is a great location if you're visiting Foxwoods or Mohegan Sun. There are a few restaurants locally, but not a lot. You may have to drive a bit to find more variety.", "title": "Enjoyable stay and terrific food", "user": "pbelardo", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35926699}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My wife and I wanted to get away to celebrate our anniversary, with no agenda other than to relax. Coming to this b&b was the perfect solution. It is located within reasonable driving distance to area vineyards on the CT wine trail, if you like wine, and also not far to Mystic, and a host of other attractions.", "title": "Completely relaxing, gracious hosts, enhanced if you love wine!", "helpfulness": 1, "user": "harvo1", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32462409}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Our room was nicely decorated in a somewhat-Victorian kind of way, with a comfortable four-poster bed. Our windows overlooked the vineyard which the property sits on. The room has a small TV and there is a decent sized DVD collection so you can watch movies in your room. There is also plenty of reading material, from magazines to books. We got the Claremont room which has a whirlpool tub, which was enjoyable, but most easily accomodates one at a time. There is also a gas fireplace, which is nice for ambience but also does heat the room up after awhile. There is also a room a/c and ceiling fan. The room comes with a complimentary bottle of wine.", "title": "Quaint and Charming Bed&Breakfast", "user": "whitechoklit", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30766958}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Nora and Warren were our gracious hosts. Warren served the delicious breakfast, which it seemed both Nora and Warren helped prepare. One morning was baked peach pancakes (like flat popovers) with light french fries and fluffy scrambled eggs and crispy bacon. There was also a small fruit platter, nicely presented, and a light pastry, filled with a custard and fruit. The other morning one of the main courses was a delicious french toast. All breakfasts are served with a bottle of wine to help yourself, orange juice, and choice of hot beverage. You eat in a sunny room overlooking the vineyard, with a variety of colorful plants decorating the room.", "title": "beautiful country B&B", "user": "amdjfm", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28316112}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "One day we joined another couple to have a get a tour of their vineyard (which is experimental, which means they're not a big commercial winery). We got a look at some of the vines, then went underground to taste some of the wines being aged, and good an inside look at some of the considerations going into whether to produce a wine. We learned a lot of things they don't tell you on the big winery tours.", "title": "Great time was had by all!", "user": "seets", "date": "March 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 26306299}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "What a wonderful experience we had at Fitch Claremont. We were so comfortable and the atmosphere was homey and pleasant. After a day at Mohegan Sun, we were so glad to be able to unwind at Fitch. The innkeepers were gracious and the breakfast was delicious. The place was immaculate. It was such a pleasure to stay there. It was a home away from home. In addition, we met some fun and nice people who were also staying at the inn. We had a wonderful time.", "title": "One of the best B&B's we have stayed at.", "helpfulness": 2, "user": "kittycat001", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86298177}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Our stay at the B&B was fabulous. Our room, The Waterman, was perfect. We loved the fact that it had a gas fireplace and it's own bathroom. The room lacked nothing, everything we needed for our stay was readily available. The complimentary wine, Olivia White, was superb. Our host Nora, was very gracious and the breakfasts were delicious.", "title": "A very warm, charming and hospitable stay.", "helpfulness": 1, "user": "mimi1231", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84963640}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The vineyard grounds were lovely and we loved it's proximity to the sights we came to enjoy. The whole B&B was tastefully decorated and it had a homey feel.", "title": "A Pleasant Surprise", "user": "eliza6", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 67212703}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We would highly recommend it to anyone going to the Casino's or the Mystic area. We hope to visit again in the future.", "title": "Throatee!", "user": "ginwayne", "date": "June 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 67124036}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "When visting friends and relatives my husband prefers to stay in a near-by B&B, We weren't sure what to expect in Bozrah, CT and were pleasantlly surprised by the Fitch Claremont. We only spent one night, wish we could have stayed longer.", "title": "Very quaint, warm and cozy B&B!", "user": "jschages", "date": "May 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 65220058}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "What a wonderful gem of a bed and breakfast. This was our first stay at a B&B and could not have been more welcomed and received. From the minute Nora met us at the door until a warm handshake with Warren at the end of our stay, we experienced the charm of the Fitch Claremont.", "title": "A Home Away from Home", "user": "Bgiants", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115729236}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We originally were trying to book a room in the area to attend a concert and were so glad that the area hotels overpriced themselves for a weekend stay. Deciding to try this B&B turned into a desire to return to the area just to stay here again. The delicious homemade breakfasts, the great tasting wines, beautiful views of the vineyard, and warmth of the hosts made us experience the hospitality and quality that travelers 200 years ago must have experienced moving through New England.", "title": "Awesome", "helpfulness": 1, "user": "Whatevahsw", "date": "February 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96713292}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The room we stayed in was very well kept, comfortable and had excellent views of the vineyard. The hosts were always preparing meals, harvesting fresh fruits and vegetables, or tending to the guest rooms. They try hard to make your stay comfortable, such as having the rooms air conditioner on before we arrived during a significant heat wave or welcoming you to breakfast each morning.", "title": "Wonderful, wonderful B&B!!", "helpfulness": 2, "user": "AaronW26", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91296564}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Thank You Nora and Warren for making us feel at home! We hope to return soon.", "title": "Beautiful, welcoming stay...made us feel like home :-)", "helpfulness": 2, "user": "NJ_Adventurer", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89210693}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "This place is a treasure. Probably the best breakfasts we've ever had at a B&B. Gourmet food, gracious hosts, reasonably priced and highly convenient to the CT Wine Trail and the two casinos.", "title": "Fitch was homey, clean, comfortable and a friendly place to stay.", "helpfulness": 1, "user": "netzell", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87165136}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "When my husband & I planned this weekend away, we were looking for total relaxation with some entertainment mixed in. Well, not only were we not disappointed but this was like staying with your favorite relatives! Nora's breakfasts were beyond delicious and set us up for missing one meal a day, there was so much! Warren's graciousness in showing us his wine making skills and letting us taste a few wines in the process made a sunny morning exceptionally interesting. At one point my husband asked if they had any chairs so we could sit out on the patio (they have picnic tables but he has a bad back). Warren immediately set up two chairs for us and that became my morning rendezvous with my tea and book. We stayed in the Claremont room. The room itself is well appointed with a beautiful four-poster bed and fireplace overlooking the vineyard. l loved reading my book (see a theme emerging?) late at night in the rocking chair right by the fireplace while sipping a glass of their wine (complimentary bottle was left in our room each day). Nora gave us some great suggestions on other local wineries to visit during the day (no rivalry here).", "title": "Comfy cozy, home away from home", "user": "Dublinshar", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60525380}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "As far as location, it is right off the highway and easy access to the casinos and Mystic. We took the ferry from Orient Point and landed on their doorstep 20 minutes off the boat. Arriving at the house before 1pm, we thought we would be too early to check in but Nora was extremely gracious, dropped what she was doing and set us up in our room immediately. She also worked around our schedule for breakfast (yes, we were the only ones there so it was probably easier) but we got to sleep in late on Saturday and have early breakfast the day we were leaving. If you are looking for good home cooking, a comfortable room and a relaxing, romantic atmosphere at, may I add, a very reasonable price, don’t look any further. We will definitely visit again as soon as we get a chance.", "title": "What a Surprise!!!", "user": "michaeld1978", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56586242}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I wanted to surprise Shannon for her birthday with a place out of the way, quite and cozy. I went on line and found the Fitch Claremont Bed and Breakfast. With our love for wine it sounded like the prefect place for our romantic getaway. We pulled in to the driveway on a cold and snow covered February afternoon. She had no idea where we were going and smiled once she saw the inn and the vineyard. Once inside we were warmly greeted by Nora Strong. She showed us to our room and by her suggestion we had the Claremont Room. This room was so nice with the whirlpool tub, the fireplace and the cleanness of it. The first morning we had one of the best breakfasts I have ever had. Only to be followed by the second morning with another out of this world breakfast. Warren took us for a tour of the wine making. He is so proud of his craft. And he should be the number of awards he has won for his wine and his knowledge of wine making is second to none. He treated us to some wine still ageing in oak barrels. The only down side to the inn is the fact we could not stay longer. I wanted to surprise Shannon but the surprise was on me to find such a gem of a place and the wonderful innkeepers.", "title": "Excellent Bed & Breakfast", "user": "greensubmarine", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52139699}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband and I stayed here for our wedding weekend. We stayed in the Lathrop room, which was spacious with a comfortable bed that was equipped with first rate linens, which was great to sink into after the craziness of our wedding day!", "title": "Perfect", "user": "cipofan", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45848365}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Breakfast was served in a lovely dining room with lots of windows to enjoy the summer sunshine, and the food and service were both wonderful. The communal dining experience enabled us to meet the other folks staying at the inn who were all very nice. I highly recommend this inn, and my husband and I will probably stay here again when we are in town to visit our family.", "title": "Unparalleled charm and French Toast!", "user": "blossomgirlNC", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45545547}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 2, "very good": 9, "terrible": 2, "excellent": 50}, "slim_ranking": 0.333333333333, "description": "A four room unique B&B on the Old Fitch Farm Vineyard. We work hard to provide to the traveling public a home away, with all the things we would expected, if we were to stay. See our many reviews, and you too will come back time and again."}