{"user_rating": 4.0, "review_count": 493, "name": "Fiume Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This hotel is situated in a neighborhood so you are able to really get a feeling of \"down home\" Italy, as opposed to being in the tourist district. Front staff is very knowledgeable about bus transport. We worked with Ramon and Alessandro and they were incredible. They offer airport service for 15 Euro a person. Breakfast is an incredible spread. Only problem was that someone wanted to toss glass bottles every night around midnight for 15 minutes or so. Shutting the window fixed the problem.", "title": "Great Service, Location, Staff", "helpfulness": 1, "user": "NMonte", "date": "November 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 87036627}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The hotel is in a neighborhood so the restaurants around it are not touristy... a big plus.. better and cheaper food. But need to walk about 20 mins to center of all the sites. One of the front staff people gave us wrong directions and information just about every time. The other front staff was great, accurate, and informative. Great value for the money, very good breakfast, only downside was the room smelled like a dead animal in the ventilation system. We changed rooms and still smelled it. Smell disipated as the stay wore on but very unnerving..", "title": "nice local hotel, nonamerican", "helpfulness": 1, "user": "my3kidsmom", "date": "November 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 85591246}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Nice, chic boutique hotel. It is located away from the main attractions, but if you want to walk, it is only a 30 minute walk to the Spanish steps and about 20 minutes or less to Via Veneto. There are a lot of nice restaurants right round the hotel for dinner as well as little supermarkets.", "title": "Nice", "user": "Ranmalie", "date": "October 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82581845}, {"rating": 5.0, "title": "Exellent stay", "text": "The room was clean and comfortable and much more spacious than I expected for an European hotel! We travel with a lot of luggage and still we were not tripping over luggage in the room!! The lighting in the room was very dim, to create ambience and a sense of romance! However, it would have been nice to have an option for a little brighter lighting!", "user": "birkheim", "date": "September 27, 2010", "id": 81183415}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Nice buffet breakfast with hot and cold items.", "title": "Overbooked the first night but then wonderful", "helpfulness": 1, "user": "jemei", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 80902350}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed here for a long weekend with my partner for a sightseeing trip. The hotel is not centrally located within Rome to give the best base to start from however this did not cause a problem whatsoever. Less than five minutes walk from the nearest tube station (which is the best way of getting about). Hotel provides an adequate continental breakfast with some hot food options, which is more than enough to get you through to lunchtime. The quality of the room we were provided with was exellent however a little on the small side so make sure you're tidy! We only had a shower which was a dissapointment as a long hard day walking deserved a soak in the bath, maybe this was the norm for a standard room? We found the room extremely hot (even with the air conditioning on) during the night time but not too unbareable.", "title": "Would definately stay here again!", "user": "Odr997", "date": "May 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 106445207}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I stayed in the hotel for three nights over Easter, with my husband. The hotel is very well decorated and squeaky clean. The service is very good, and the staff friendly and helpful. I had a few issues with my booking but everything went smoothly much to my relief. The location of the hotel is definitely not close to the main attractions but who like to live away from crowded areas and yet be within easy approach of the main attractions, this is it. I loved the breakfast spread, there is not so much of variety if not staying in a 5 star, the highlight was the freshly squeezed orange juice - best start to the morning! Also, as we are not meat eaters we had hot omlette for breakfast on request! Overall loved the hotel and the people!", "title": "Nice and warm", "user": "FlaneurR", "date": "April 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 105856644}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed here some years ago when it was a 2* hotel and the recent paint job does not make it a 4*.There is no tea or coffee maker in room.Room was small and cramped,Bathroom shower quite unbelievable,flooded bathroom everytime used.", "title": "Over Rater", "helpfulness": 1, "user": "Kalimantsi", "date": "March 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 102272409}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "If later than 9am for breakfast ,bread and buffet were in short supply and beware of low arches.Lighting in bedroom almost nonexistant.", "title": "Loved Hotel Fiume!!!", "helpfulness": 1, "user": "KMart3307", "date": "March 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 100769238}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Location wise ,handy for bus transport to main station and if fit ,within walking distance of most locations of interest.Shortcut through villa borghese to piazza del poppolo and work back through all the landmarks", "title": "Great Stay at Fiume", "helpfulness": 1, "user": "AtlantaJack", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100143984}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "A word that describes Hotel Fiume best is peaceful. I stayed here in April for an extended weekend when travelling together with my mum and we shared a room with twin bed. The room was very tidy with modern decor, but was very small. I had read similar comments from other travellers before our trip, so I was prepared for it and since it wasn't our intention to spend much time inside the room anyway, it didn't bother us that much. Although the hotel is rated four*, there were no special amenities in the room (slippers, bathrobes, mineral water), but the price of the room was very decent too, so it makes up for it.", "title": "Neat hotel in tranquil neighbourhood", "helpfulness": 2, "user": "Losviages", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 113509802}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Our room was on the first floor and had a street view, but luckily no noise passed through the windows nor from the corridor. The bed, albeit a bit narrow for two, was really comfortable and that's something I highly value after a long day of walking around in Rome. Breakfast was well varied and tasty too, I was happy to notice they even served dark bread. The hotel itself is small (boutique style?) and had an almost etheric ambience, I hardly met any other hotel guests, except during breakfast and really, it was incredibly quiet there.", "title": "Amazing Hotel!!!", "helpfulness": 1, "user": "daniellelouise32", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112966674}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Hotel Fiume is located a bit off the center, but in a tranquil and neat neighbourhood with a couple of nice and cheap Trattorias right behind the hotel corner. Upon our arrival to Rome, we walked to the hotel from Termini (we had very little lugagge), so it's a walkable distance away from the center (or at least from Termini), but it's still best to use public transportation to save your feet. The nearest metro station is actually rather far from the hotel, but busses run nearby, you just need to figure out which one goes where :)", "title": "Very modern hotel with clean and big rooms", "user": "Raul110070", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 110803304}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "In essence, I do recommend Hotel Fiume. Just be prepared to spend some time each day walking to the bus stop or metro station and back + the time spend travelling in a bus or metro. Could I choose again, I might choose a hotel even closer to \"the center\", just to save some time, but on the upside, the local restaurants and cafes were significantly cheaper in this part of Rome and since I like to start my days jogging, the nearby Villa Borghese park offered good running grounds too.", "title": "Great choice when visiting Rome", "helpfulness": 2, "user": "FashionD", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 109640985}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I stayed here with a friend for 2 nights in January and it was the most enjoyable stay I've ever had in a hotel. The hotel its self is located in a very good area but is a bit tricky to get to for the first time, I suggest taxi from Termani. Once you get use to the public transport there is nor problem what-so ever. The room we got was huge with two beds and a large bathroom. The room was very comfortable, modern and stylishly designed with free wi-fi. We got breakfast each morning in the hotel which was very good, just your normal European breakfast but tasty. The hotel staff were a pleasure to deal with and helped us out when trying to figure out which buses to get. If i was returning to Rome I would not hesitate to stay here again for one second. I highly recommend it, and may I say I am very picky about hotels but Hotel Fiume is fabulous. Also I highly advise a trip to the ice cram shop on the same block as the hotel, without a doubt the nicest ice cream I have ever tasted!!", "title": "A very impressive Hotel", "helpfulness": 1, "user": "China50", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 107555156}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The inside of the hotel was fantastic: small but very clean rooms with very", "title": "Perfect 4-star hotel in a nice neighborhood", "helpfulness": 1, "user": "TravellerFrequent", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99845679}, {"rating": 4.0, "title": "Nice", "text": "comfortable beds. The staff was super friendly, from the reception to the", "user": "Andreas_Spinoulas", "date": "March 1, 2011", "id": 98485391}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "cleaning personnel (it is one of the few times I left a tip for the cleaning", "title": "Lovely little hotel!", "helpfulness": 1, "user": "butterflytrish73", "date": "February 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 95495560}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "stafff while leaving). Prior to our arrival, I received an email from the hotel", "title": "Excellent Hotel", "user": "tomkat04", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 91283250}, {"rating": 4.0, "title": "Good enough", "text": "explaining how to get there from the aiport which was very helpful. The hotel is", "user": "Teos_mom_28", "date": "December 14, 2010", "id": 89802322}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 21, "average": 41, "very good": 218, "terrible": 3, "excellent": 210}, "aka": "Fiume Hotel Rome", "slim_ranking": 0.0755905511811, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Small hotel with multilingual staff, modern amenities, breakfast room; located near the Piazza Fiume, shops & restaurants nearby."}