{"user_rating": 3.0, "review_count": 505, "name": "Flagship Resort", "reviews": [{"rating": 5.0, "title": "Great Rooms Great Location", "text": "I had a great time at this resort. The room accommodations were very clean and upscale. The resort has great ocean views and has a wonderful staff.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 5, 2006", "id": 4416113}, {"rating": 4.0, "title": "It was GREAT!!!!", "text": "I stayed at this hotel and the service was great, I had no complaints the two days that I stayed. The room was clean, bathroom was clean, and the service was above excellent, they wanted to come in on both days and change the sheets and clean the room, they called several times to do this, that I had to say I'll call them back when I leave the room. We were on the 25 floor and the veiw was breathtaking at night and at sunrise. I was really scared to stay here after hearing the terrible reviews, but to my surprise it was nothing like what I read. I also never had a problem coming up and downstairs the elevator was always open on the lobby floor to take me right to the suite. I had no problem getting a cab to take me to any of the casinos...its not far at all, and on a nice day you could walk. I would definitely stay there again. Try it for yourself, don't go by what these horrible reveiws say. they were also really nice about checking out later than 11:00am. Another thing, the room that I stayed in was exactly like the room with the double beds and sofa/kitchenette...that I saw on the internet.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "January 31, 2006", "id": 4404054}, {"rating": 2.0, "title": "Disappointed with Flagship", "text": "In Nov. 05, my sister and I stayed at the Flagship Resort in Atlantic City. They had a special package for around $99 + tax, room charge, etc.", "helpfulness": 11, "user": "ashrat", "date": "January 25, 2006", "id": 4386669}, {"rating": 1.0, "title": "Scary!", "text": "Now, I had been to Flagship for a timeshare tour and it looked great. Well, it seems (since I didn't ask when booking) that the regular rooms don't look anything like those on the timeshare presentation. Yes, with this package the room we got was equipped with living/dining room area and kitchenette with appliances/untensils, but it was quite old in look/style. The room could use new everything, especially carpet - which is what really caused the room to look bad. The carpet had stains and the balcony door wasn't secure - not that anyone could climb to the 30th floor to get us. The heat didn't work well (a bit noisy), but we were only there one night, so it did the job for when we were in the room.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 23, 2006", "id": 4371740}, {"rating": 3.0, "title": "Ok for one night", "text": "The Flagship is definitely not where you want to stay if you're looking to be close to other casinos, beach, or within walking distance to them. You would want to have a car to get around. Or, if you're open to paying about $8.00 - $10.00 or so for one-way trips to/from other casinos you're fine. But, be prepared to wait a bit for a taxi to come to this resort, since it's a bit off the beaten path for taxi's to sit and wait around.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 23, 2006", "id": 4370765}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "My boyfiend and I stayed at the Flagship with another couple on Saturday, March 25th. We decided on the Flagship because it was $210/night while other hotels were more than $400/night. The staff were very nice. We were on the 27th floor with a great view of the beach and other hotels in the distance. We had a 1 bedroom suite with a pull out couch, kitchenette and balcony. The decor seemed to be 1980ish, but it was clean and served our purpose. We checked out the pool and there were activities posted there, but we didn't partake in any. Like I said we were there just to sleep. We did have dinner in the restaurant. The food was not that great but the windows overlooked the beach. The hotel is not within walking distance to any casinos so we took a cab that was waiting outside. They do offer a free shuttle to the Sands, but we didn't want to be on a schedule. The surrounding area is not that nice. All in all it's not bad for the price even if you have to take a cab to the casinos. Feel free to email me with any questions.", "title": "Can't beat the price", "helpfulness": 8, "user": "steph44w", "date": "April 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4831572}, {"rating": 2.0, "title": "You get what you pay for", "text": "We decided to make last-minute reservations in Atlantic City on Presidents' Day weekend. Normally, we book well in advance and get a decent rate at the Sheraton Convention Center, but being it was only a few days before, the Sheraton and all the other better hotels were $300-$400 for one night. We decided to try the Flagship for $159 for the night. Well . . . we got what we paid for. It was off the boardwalk. When we got there at first it looked like a hotel for the homeless, with people hanging out all over the place and we both did not feel all that safe. Check in was fine, and the room was clean. It had an efficiency set up (which we did not need). Anyway, we were on the 18th floor which had a nice view. We went to a show at the Taj then gambled and got back to the room at about 2 AM. Well, we got absolutely NO SLEEP. The pipes in the ceiling over the tub banged ALL NIGHT LONG! At 9 AM we rushed, took a shower and ran out. I went to the counter to check out and told the desk about the banging pipes and the response was, \"we'll have to have maintenance look at that.\" Not an apology nothing! I never left someplace so tired in my life.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "March 17, 2006", "id": 4629641}, {"rating": 4.0, "title": "The best kept secret of AC!", "text": "Again, the staff were friendly, but I would never stay there again.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "February 27, 2006", "id": 4523154}, {"rating": 4.0, "title": "Better Than Expected", "text": "I don't want to sound like a broken record, but I also read the negative reviews and was VERY reluctant to stay at the Flagship, but probably for the same reason as everyone else (it was the cheapest) I decided to try it out. I stayed with two of my girlfriends, so as females we were nervous about the surrounding neighborhood. We were PLEASANTLY surprised. The room was adorable, cute little terrace, the view was GORGEOUS! I would recommend this hotel to people who are just staying a night, who are content with a \"decent\" room, and who want a nice place to hang your coat at a VERY inexpensive rate. We were offered $75 off our price if we took the timeshare tour. This is my only negative, bc we were up at 10 and they hadn't spoken to us for about a half hour when we decided to screw it and go back upstairs. BUT, we were told the timeshare and the hotel are two separate entities, so if you want to save the money, be prepared to spend upwards of an hour and a half there. Other than that, this was not the scary ghetto I had imagined as described by previous writers. AC in general is amidst surrounding \"slummy\" areas, so it really wasn't much different than that surrounding Borgata, Tropicana, or any other high priced casinos.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "February 20, 2006", "id": 4473585}, {"rating": 5.0, "title": "An unexpected surprise!!", "text": "Like a previous reviewer, after reading some of the posted reviews we were also a little wary about what we would see when we checked in. I am happy to report that our stay was an entirely positive experience. Parking was easy (and free). The staff was nice and were always helpful. They never tried to pitch a condo sale. The restaurant on the 7th floor was fine, with a fantastic view of the boardwalk and ocean. Lunch was decent, exactly what you'd expect (and a good bloody mary to boot). The location is no worse than any other hotel in Atlantic City...and better than many. The neighborhood looks like it has been revitalized, with some expensive duplexes sprouting all around the hotel. The room was big. Strange odor which we assumed was some kind of cleaning agent, but otherwise no complaints. Just don't dirty the dishes--$50 fee if you don't clean them! I reserve the right to complain if for some inexplicable reason we don't get our security deposit back. But overall, I would gladly recommend the Flagship to anyone interested in staying in a good hotel in Atlantic City at a reasonable rate.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 14, 2006", "id": 4459796}, {"rating": 2.0, "title": "Needs Personality", "text": "It's been years since I've stayed at the Flagship and this time it was not good. I am known to be a friendly person, but not everyone that is employed by the flagship is grateful to have a job and that's sad.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "November 16, 2005", "id": 4122097}, {"rating": 1.0, "title": "Hated the Suite", "text": "The pool area was excellent,the staff was friendly, and helpful. Unfortunately I could not say that about the staff at the front service desk or the bellmen.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 14, 2005", "id": 4110578}, {"rating": 1.0, "title": "Utter Crap.", "text": "Our room was a nice size, the view was lovely, but the vents were full with dust as well as the walls, by the heating control.", "helpfulness": 8, "user": "5cense", "date": "November 9, 2005", "id": 4102209}, {"rating": 4.0, "title": "A Nice Time, Could Even Take the Kids!", "text": "My husband and I stayed one night on 11/12/05. We were there to see Alan Jackson's concert. Only place to find since everything else was booked. The rooms were smelly and dirty. They only thing that was ok was the towels looked clean!!!!!!!!! What I saw on the internet was not what we got. All night all we heard was flushing toilets and showers running. Never go there again!!!!!!!!!!!1", "helpfulness": 5, "user": "jjcraftery", "date": "November 3, 2005", "id": 4082596}, {"rating": 4.0, "title": "Enjoyed the stay and view", "text": "Even if it was cheap it would be complete crap... and it wasn't cheap. It's in an inconvenient and downright scary location, nowhere near the casinos but with great views of crack houses, abandoned lots, and surreal projects that no one lives in. The place smelled and felt dingy and horrid. Stifling. Used. Run down. Putrid. Unless you are purposely going for the slummy feel, I wouldn't recommend it.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4050591}, {"rating": 1.0, "title": "the worse place I have stayed at in years", "text": "Please do not recommend this hotel, it was dirty and smelled terrible. I don't know how they can charge money to stay here.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4013730}, {"rating": 4.0, "title": "Wonderful View", "text": "I stayed at the Flagship Resort for three nights in early September. After reading some of the posted reviews, I wondered if I had made a mistake in making a reservation there, but my experience was quite positive. I was there with an old friend for a \"girls getaway.\" I requested and received a remodeled room with a wonderful view. I could lie in bed at night and watch the changing light patterns on a casino at the marina. I awoke to the sight of fishing and pleasure boats heading out to the ocean for the day. With the balcony door slightly open, I could hear the sound of the surf hitting the jetty below. The neighborhood is in the process of a facelift and when completed will be quite charming. There are many rundown blocks between the Flagship and the casinos and we did not walk in these areas. The Flagship shuttle to the Sands proved convenient and dependable and we used it several times. The jitney stops a half block away and was also a convenient alternative. Our room was large and of modern decor. The only problem we encountered was a practically clogged toilet on arrival. I called maintenance and ten minutes later someone was there to fix it. We had no further problem. The entire staff is friendly and efficient. Would I stay there again? Definitely.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 9, 2005", "id": 4003094}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Extremely friendly, always helpful staff, and the 1 bedroomed suite was scrupulously clean and comfortable. Yes there were a few little signs of wear, but it didn’t detract from anything. We had a bedroom with comfy firm bed, TV and huge wardrobe, main room with mini kitchen, breakfast bar, comfortable sofa and another TV, large balcony with great views of the marina and the north shore and a spacious bathroom with terrific shower. Only one small niggle…why are the bathtowels always so small in the US? But there were plenty of them, and linen and towels were changed halfway through the week. Kitchen had microwave, 2 hotplates, toaster, coffee maker and fridge, plenty for making breakfast each morning, which was all we needed. We also spent some time every day enjoying the 7th floor pool and sunbathing terrace.", "title": "Great Staff make it very friendly", "helpfulness": 13, "user": "Vegasfan_uk", "date": "September 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3937209}, {"rating": 4.0, "title": "enjoyed our stay", "text": "Oh, I forgot to add, if you do stay at the Flagship, make sure you go to the Thursday evening casino night...its $15 which includes a buffet, and its great fun!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 23, 2005", "id": 3933211}, {"rating": 1.0, "title": "Horrible Hotel / Never Stay Aain", "text": "The security staff and hotel staff are the croupiers, and make it so much fun...special mention here to Roger (the Dodger), Head of Security who was hilarious.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3931860}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 81, "average": 117, "very good": 147, "terrible": 95, "excellent": 65}, "aka": "Flagship Hotel", "slim_ranking": 0.344262295082}