{"user_rating": 3.5, "review_count": 9465, "name": "Flamingo Las Vegas Hotel & Casino", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed at the Flamingo from 4/28 to 5/3. We have been staying at the Flamingo for about 15 years. They really cleaned it up in the last few years. We had a nice room overlooking the front of Ceasar's. I told them that I only wanted a room close to the elavator. Check-in was very nice because I am Platinum. The other line looked long. On Sunday 4/28 the place was packed. My only complaint was that the Valet parking was full when we arrived and had to park ourselves on the top floor of the garage and walk. I did notice the Airport Shuttle droping off people 2 blocks away. They had a very long walk. The room was very clean. I like the new fake wood floors. The main reason we aways stay here is the pool. The BEST pool in Vegas. It was full. You must get there at 8am if you want a good lounge chair and location. My wife has to be in the shade and that is the best pool in Vegas if you want shade. If you want to bake in the sun it is like all the other pools.They still have the very annoying time share people in the lobby. I quess the hotel makes a lot off it but they should know how everyone hates it. Also they have shops with very rude and annoying people trying to get you in. One guy don't know how close he got to be belted. All in all The Flamingo has come a long way in the last few years. It was getting shabby for a while. Still the best location on the Strip. Great Job ! We'll be back.", "title": "Flamingo Getting Better", "user": "DavyGGG", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159623925}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "We stayed 5 nights for a family wedding and holiday. We had a mini suite with great view of the Bellagio fountains. Room was good size for the money and nice to have given the extended stay. The wedding Chappell and reception were really well done. We liked the bars and gambling. Restaurant choice was limited but plenty in nearby hotels. The go pool party day we had was great fun. Unique.", "title": "Wonderful hotel and location", "user": "Pepperp0t", "date": "May 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 159622432}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This was our second stay at the Flamingo. We joined the Total Rewards club last year so this year we booked directly with the hotel and with our rewards card got a great deal! Worth signing up for if you like to save a little money. The rooms were clean and ours was updated. We vacationed with our kids and family so we used the family pool this time. Its a little small and the other family pools with kid friendly slides were closed. We stayed from Tuesday till Thursday and we were told that those pools were open weekends. So kids were kinda bummed. Water was only 3 1/2 deep. So they got bored with that kinda fast.", "title": "Great Location on the strip!", "user": "djwinter04", "date": "May 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159585907}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "We picked the Flamingo lunch buffet for our first eating out....my family and I were kinda dissapointed in it. Paid $19.99 each and food wasn't that great. We had higher expectations at that price for a lunch.", "title": "Good deal, perfect location", "user": "TXsandals", "date": "May 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 159581530}, {"rating": 3.0, "title": "Flamingo Just SoSo", "text": "Went to the Flamingo from Oct 19 through the 22nd. We had made arrangements about one month in advance and had reserved a standard room. We have heard quite a bit about \"GO\" rooms but decided to wait till we got there to decide.", "helpfulness": 5, "user": "Beth G", "date": "November 1, 2007", "id": 10517462}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "When I got there I waited in line for 20 minutes. There were some couples there from Harrarh's as they had to close a floor or two. I decided to go for the \"GO\" room and was charged an extra $75 dollars but I thought let see what it's like. Check-in goes quickly and I'm off to my room on the 25th floor. I get to the floor and I can't find the room it was like a maze. After 10 minutes I finally find the right hallway but there's a sign that says \"Do Not Enter \" construction personnel only. So I call on the phone and I am given directions, which were wrong and I spend another 15 minutes looking for my room. Frustrated I decide to go back down stairs and have to wait 15 minutes for help. A very nice clerk realizes I am frustrated and irritated so she shows me to my room and she gets confused but we finally take another elevator and go to the other end of the hallway that said do not enter. These \"GO\" rooms had just been released 2 hours ago. The heavy smell of the carpet glue was overwhelming but I go into the room anyways hoping it's not as bad in the room. Wrong, I have a headache already. I decide to go back downstairs and switch back to a standard room. Oh, by the way, the \"GO\" room was very nice and would of been worth the extra money.", "title": "Loved the Go rooms at the Flamingo Hilton", "helpfulness": 2, "user": "bri90154", "date": "November 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10507143, "likes": {"liked": "— The Go Rooms", "disliked": "— Room was lacking a mini bar"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Finally, 1 hour later I'm in a standard room that looks like it's from 1980's but clean with plenty of towels so I stay. It was comparable to Motel 6. In the hallway were 3 room service trays on the floor with dried food.", "title": "Absolutely perfect!", "helpfulness": 15, "user": "Mistyflip", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10489280, "likes": {"liked": "— Location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "The next morning my daughter and I decide to go to the \"Tropical Breeze\" cafe for breakfast and it was OK. We had the regular egg breakfast nothing special.", "title": "Flamingo, always a great stay", "helpfulness": 9, "user": "Gerry-ped.", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10462352, "likes": {"liked": "— great location,", "disliked": "— no coffee pot in room"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "We visited the tropical gardens right across the hall from the cafe and walked around looking at the ponds and birds. Nice area but it hasn't been maintained.", "title": "Will never stay there again.", "helpfulness": 5, "user": "tazmoto", "date": "October 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 10454098}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "After choosing the Flamingo because of the reviews I've read here, I must tell you how disappointed we were with our stay over Memorial Day. Although we were in a \"non-smoking\" room, cigarette smoke kept coming in through our bathroom vent so the entire room smelled. The carpeting was new but already worn in spots, there was mold in the bathroom grout, there was a pubic hair on the bathroom floor when we got there and its' location never moved the entire three nights we stayed, it took over an hour to get something sent up to our room from housekeeping, some of the elevators weren't working, etc. etc. etc...I can always lower my expectations for a value price, but the holiday rates were almost as high as some other (nicer, cleaner and newer) casinos. I've learned my lesson. \"Recently renovated\" is my new mantra!", "title": "The old girl needs a facelift...", "helpfulness": 13, "user": "kaysilver", "date": "June 2, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3520540}, {"rating": 4.0, "title": "The Flaming Flamingo", "text": "I stayed at the Flamingo with my fiance from May 23 to May 27. I must admit I was a bit hesitant to book the Flamingo, because, I have always stayed at the MGM Grand in the past. But I must admit we were very pleased with the Flamingo. The room we got was on the 26th Floor our view was of Caesar's Palace and the Bellagio Hotel. Our room was spacious and very clean and updated. Room service was spectacular. The POOL was MAGNIFICENT. Clean and water was nice. The surroundings was beautifully kept and well maintained. We dined at Margaritaville and their burgers were very good. For the price we paid you can't beat it. Also, another thing to consider is that it's on the center of The Strip and it is one on the Monorail Stops. I will defintely stay at the Flamingo again. I bought the BUGSY DVD when I got back to New York. It explains how the Flamingo came about.", "helpfulness": 15, "user": "donchina18", "date": "June 1, 2005", "id": 3516404}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "We stayed at the Flamingo for 3 nights early May, and we were very pleasantly surprised. Used the airport checkin, where there were no lines at all. It is a bit hard to locate, though! Our room overlooked the pool, which was very pleasant - we could watch all the weddings going on - all at the same time! The room was spotless, and cleaned promptly each day.", "title": "Good hotel for price - location excellent", "helpfulness": 14, "user": "hjd", "date": "June 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3515872}, {"rating": 4.0, "title": "Great Location & Clean", "text": "Only ate at the buffet which was very good, and the cafe which was a little expensive for breakfast, I thought.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 31, 2005", "id": 3514425}, {"rating": 4.0, "title": "Location, location, location", "text": "All in all the Flamingo was a good choice for me. I liked the fact that it was a little smaller than some of the other hotels, and therefore easier to find your way around. Like another reviewer said, hough, find a lift closest to your room, and go to it every time! The location of the Flamingo is second to none, particularly for first timers like me! I would definitely stay there again.", "helpfulness": 11, "user": "DMHappyTravel", "date": "May 31, 2005", "id": 3513766}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Stayed at the Flamingo again. Diamond check in was very smooth and I was given a Go room mini-suite. It was very nice and had a view of the strip facing west towards Caesar's. Wife tried the Flamingo spa and won't be going back. The massage was only okay and the spa was not very clean (moldy). We had a very nice stay and the customer service was very good throughout the property but the food choices and coffee are not up to par. Room service was not very good either this trip. These are things that matter to me and mine so that is why we likely won’t return. Love the Go rooms and the DVD/MP3 player with HD tv. Great location and the casino was fun.", "title": "Flamingo Fun weekend", "helpfulness": 6, "user": "vegasdragon", "date": "November 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10849083}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "We booked this hotel due to the great rate and it's great location. I had heard from other forum users that we would end up with the bad room locations because of we booked with Expedia (a third party) and not directly with the hotel. I was never able to find this out.", "title": "Birthday Getaway", "helpfulness": 6, "user": "2manyjules", "date": "November 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10851444, "likes": {"liked": "— The cool Go Room & it's location", "disliked": "— construction mess"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled with family", "text": "My son & daughter upgraded me from a deluxe room to a strip view go room. This room was awesome and did not disappoint. The bed was comfortable, the view amazing and bathroom incredible. I loved the little tv in the mirror! The room looks just like the pictures on their website.", "title": "Adequate Hotel, Great Value and Location", "helpfulness": 3, "user": "richardallman", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10783060, "likes": {"liked": "— Location", "disliked": "— Luxury"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I loved the Gilcrest & Soames bathroom amenities and the maid was not shy about leaving extra. My friend had the deluxe strip view room and she also received these amenities.", "title": "Good . . . . . . .", "helpfulness": 5, "user": "Waverunner", "date": "November 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10774996, "likes": {"liked": "— Great location", "disliked": "— Small bathroom, Noise"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "It is obvious though that this hotel is going through a remodel. Some of the hallways were torn up with paint chips and such laying around.", "title": "A little beat up, but an unbeatable value", "helpfulness": 7, "user": "ChicagoBearsFan650", "date": "November 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10752394, "likes": {"liked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Spent four nights and found this hotel to be in a fantastic location and very central. As you would imagine, restaurants and food are abundant in Vegas and there are plenty of options close by. As the hotels in Vegas have so many rooms (3000+), you are just a number - but we found all staff friendly and helpful. Fantastic views of the strip if you have a room at the front of the hotel. Rooms are clean, a little dusty in places but overall very comfortable. Price wise, this hotel is fantastic value due to its location.", "title": "Great location", "user": "whereisned", "date": "May 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 159573971}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We stayed at the Flamingo from Apr 28 to May 2. Did not start out well as we got in at 11:00 pm and probably didn't get checked in for 45 min due to line up and very few people working. We had been standing in lines all day as we came from Nanaimo, BC, Canada so definitely would recommend this hotel work on this. Other than that the rooms were very nice and the service was A1. Margaritaville casino and restaurant were very good. The pools and grounds were very well maintained and everyone in the casinos seemed to be having a very good time. Do not know if I would stay here again due to the check-in.", "title": "Flamingo - be prepared to stand in line for check-in", "helpfulness": 1, "user": "Patricia B", "date": "May 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159556721}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "stay at the Flamingo April 22-25, we book a Go room, and had reward cards. Check in was only appox 20 mins due to the rewards card line the other line was really long, my guess would be a good hour plus to check in has only 2-3 people working. Great room. We had a car and always self park, no big deal has we found parking on the 5 or 6 level you take the elevator to the 3rd floor and enter into the Flamingo. Dont even have to go outside, This is our 2nd stay at the Flaming and we will be back again.", "title": "Flamingo again", "user": "Karla L", "date": "May 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 159528720}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Have stayed at the Flamingo previously with no incident, but not this time.", "title": "Beware! bogus charges, nasty front desk manager", "helpfulness": 2, "user": "aschulz2087", "date": "May 2, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159490536}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Booked back in December for 5 nights, before the resort fee was introduced. Upon check-in, tipped the clerk $20 asking about complimentary upgrades but was forced to pay extra for a Go room upgrade, didn't get the tip back either. Was told it would only be $30 extra total for the upgrade but was charged $85 extra plus tax upon check-out.", "title": "Flavor from Flamingo !", "helpfulness": 2, "user": "jajubabu", "date": "May 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159482643}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "I experienced a lot of problems gaining access to the property. I am physcially disabled and use a motorized scooter.", "title": "Flamingo is not ADA accessable", "helpfulness": 1, "user": "golddigger007", "date": "October 15, 2008", "detail_rating": {"cleanliness": 2.0, "location": 5.0, "value": 1.0}, "id": 20895222, "likes": {"liked": "— Nothing", "disliked": "— The place IS NOT ADA compliant -- people in wheelchairs cannot access the casino & showroom."}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "First off, I found that I could not enter the property from Las Vegas Blvd because there are no \"wheelchair\" accessable doors that open automatically. I did not like having to rely upon the \"kindness of strangers\" every time I wanted to enter or leave the casino/hotel.", "title": "Knock out, but not in a good way", "helpfulness": 2, "user": "chefchic", "date": "October 14, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 20870728, "likes": {"liked": "— checking out", "disliked": "— getting hit in the head by the vent in the shower"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I tried to attend the George Wallace show at the Flamingo's showroom but I was unable to do this because the showroom is not accessible to people in wheelchairs. The showroom does not have any ramps for wheelchairs (exterior and interior access) and it does not have an elevator. I had already purchased my ticket from the Flamingo's box office before I discovered this problem. The only \"access\" for people in wheelchairs is through the kitchen to the main floor. The final insult is that I was \"asked\" to pay for a main floor seat -- after I had paid for a balcony seat.", "title": "\"We loved the Flamingo\"", "helpfulness": 5, "user": "willltamm", "date": "October 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20859555, "likes": {"liked": "— Location", "disliked": "— No complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "So to recap, handicapped folks going to the Flamingo's showroom cannot reach the balcony (aka cheap seats) due to the lack of ramps and elevators but the Flamingo would be more than happy to escort you through the kitchen to its expensive main floor seats. However, these are seats you still would have to physcially walk to since the aisles on the main floor are too narrow for a wheelchair or scooter.", "title": "Loved the Flamingo GO Deluxe room", "helpfulness": 4, "user": "mazafratz", "date": "October 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20857521, "likes": {"liked": "— The luxurious suite", "disliked": "— not the greatest restaurants"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008", "text": "This place isn't even trying to be ADA compliant. I don't know if the rooms are in compliance because I didn't check in there. I went to another hotel where I could open the doors myself.", "title": "Not worth it...", "helpfulness": 4, "user": "Backpackr217", "date": "October 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 20853943}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Stayed in a Go Luxury Strip View Room for 4 nights. Second time at the Flamingo and still can't fault it. Rooms are lovely and had a great view of the Bellagio Fountains. Didn't eat at the hotel so can't comment on the food. Pool area was pretty packed every day, but we always managed to find a couple of lounges.", "title": "Second time just as good as the first", "helpfulness": 3, "user": "tarynsmum", "date": "October 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21047306}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Hotel is in a great location and after walking thru a lot of other casinos, we all agreed that the Flamingo is nice and bright inside, unlike some of the others which were so dark and dingy.", "title": "Get the GO room!", "helpfulness": 7, "user": "MNHoneymooner", "date": "October 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21032786, "likes": {"liked": "— Loved the room decor.", "disliked": "— Our room was only cleaned once in the four days we were there."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Highly recommended, especially for the great price!", "title": "Had a ok stay.", "helpfulness": 3, "user": "haakonks", "date": "October 20, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 21017787}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I was just in LV from this past Thursday through yesterday. I went with a group of about a dozen gals and most of us stayed at the Flamingo in the new GO rooms. Which were awesome. So cute - there were four of us in each room and I felt like we had enough space for all our stuff and to get ready, etc. The beds were really comfortable (pillowtop mattresses). The bathrooms were nice - although if you are a very modest, private person, you may be a little uncomfortable. The door and one wall are a frosted glass; you can't really see anything but outlines of people in there, but they are also not very soundproof. The shower had two extra jets about halfway down and they were great.", "title": "Outdated rooms, old property, good location", "helpfulness": 2, "user": "Karch72", "date": "October 19, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 21015266}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "There are stereos in the rooms that are iPod compatible and I thought I would just need to bring my USB cord, but that didn't work. Of the three GO rooms that we had, only one of them had the cord that went with the stereo. On our last night there, I realized our alarm clock was also compatible and there was a cord to attach it.", "title": "Great Time in Vegas", "helpfulness": 2, "user": "patnrick", "date": "October 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 21013360, "likes": {"liked": "— location", "disliked": "— crowded pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Stayed in June for 4 nights, using the hot deals on the Flam's website, upgraded ourselves to a GO room which had views of the Bellagio fountains as a bonus!", "title": "centre strip - great place", "helpfulness": 6, "user": "rjh27973", "date": "October 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20927795, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Rooms are cool and trendy, pink lights in the bathroom and inset TV over the sink make for a fun room, which cheers you up after a long flight from the UK. We stayed the year before at the Signature and even though the room was amazing I'd pick the GO rooms at the Flamingo just due to the location and fun feel of the place.", "title": "birthday beauty", "helpfulness": 3, "user": "alanBridgwater", "date": "October 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20912779, "likes": {"liked": "— the bed, the view,the staff.", "disliked": "— the carpets and sometimes trays left by rooms a long time"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Pool is superb, slides, waterfalls, plenty of loungers but it does get a little crowded, only thing missing was the lazy river like the MGM has but no worry.", "title": "Just reviewing the pool", "user": "Ladiedy", "date": "October 15, 2008", "detail_rating": {"cleanliness": 2.0, "location": 4.0, "value": 2.0}, "id": 20913181}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Gambled a little on the slots and made some profit to pay for breakfasts from the coffee shop. Ate at Margaritaville on the first night - huge nachos are enough for 3! but found it a touch noisy to talk as well as enjoy.", "title": "Great hotel great location", "helpfulness": 4, "user": "lakesbrkr", "date": "October 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20912948, "likes": {"liked": "— Location", "disliked": "— Leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Also can recommend taking advantage of the Mandalay bay's deal on buffet+aquarium - buffet was superb and the aquarium was the equal of the London Aquarium next to the London Eye!", "title": "Great Time", "user": "fullermel", "date": "October 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 20905056, "likes": {"liked": "— Location", "disliked": "— Bed Spreads"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had a great view of the strip- could watch the Bellagio fountain from our window- although the room had great sound insulation, so we couldn't hear the music very well.", "title": "Great Room, OK hotel", "helpfulness": 2, "user": "BerryGirlLA", "date": "October 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 5.0, "location": 2.0}, "id": 20808312, "likes": {"liked": "— Great GO Room!", "disliked": "— Hotel seemed run down, many things were closed due to Off season"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The pool area was lovely- really spacious and clean. And the menagerie with the birds was beautiful.", "title": "Great location but not so great hotel", "helpfulness": 2, "user": "Yaeneth", "date": "October 8, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 20737518}, {"rating": 3.0, "stay_parameters": "Stayed September 2008", "text": "We would definitely stay here again. It's a great location!", "title": "another good experience", "helpfulness": 4, "user": "lttt", "date": "October 7, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 20705456}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Stayed over the March break week, and decided to pick this hotel because of the low price. Was a little scared after reading the reviews of the non renovated rooms which we had booked, but the price for the renovated rooms(go rooms) was to pricey. Arrived at 11:30pm and once we got out of the cab the bell hoped informed us that their was a long line up to check in so we should maybe get something to eat or get a drink at the bar and come back in an hour or two. Took his advise and came back to check in later at which point they gave us an upgrade free of charge to a corner king room 21043 non renovated tower. The room was the last door down two hallways from the elevator but once we saw the room we had no complaints about the long walk. The room was more of a mini suite, large sitting area and a king size bed with floor to ceiling windows which looked out onto the pool and habitat area. the furnishings thru out were okay no stains or tears. The bathroom was normal size and came with the typical ammenties. The food at the hotel was okay, ate at the buffet for both dinner and breakfast and have to say the breakfast was the best out of both, just remember that the food stations continue on both sides of the wall. As for dinner at the buffet, skip it definately not worth the price trust me, im not a picky eater ( i eat at taco bell, burger king etc) but the selection and the quality was just bad. The other restaurant that we ate at which is located just by the buffet called tropical brezzes was good , the wait to get in was sometimes long, but the food was good and the portions were large, the food arrived fast but the service could have been better on each occasion we were their. Just be warned that the prices on all the food and beverages in the hotel are over priced $4.50 for a coffee. Also ate at the outdoor grill at the pool , good food just very pricey hotdog and bag of chips $8.00 , also the drinks at the pool area will run you $10.00 each for a frozen cocktails. The casino it self is small and comfortable with good drink service but the machines are very tight, and the tables areas are usually crowded but the seats are comfy. As for the location of the hotel can't beat it , right in the middle of the stripe, the sidewalk out front can get very crowded and the deuce bus stop is located just a step out side the entrance to the casino. Definately worth staying here, the pool and habitat area are amazing, just get to the pool early or you wont get a lounger or a spot close to the pool. Highly recommend this hotel, had a great time and all the staff we met during our 5 day stay were all friendly and helpful, any questions just ask.", "title": "In the Middle of it all", "helpfulness": 3, "user": "elco1994l", "date": "April 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27780368}, {"rating": 5.0, "title": "Flamingo Las Vegas", "text": "I continue to return to this Hotel because it gives me value for my money. It may not be ultra sheik, but it is a great place to gamble, sleep and eat. Speaking of eating...MARGARITAVILLE.... a must for me because it's fun and the food is good.", "helpfulness": 2, "user": "M2Biker", "date": "April 10, 2009", "id": 27779881}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The Flamingo Hotel is the perfect location for the Vegas Strip. Having been to Vegas 4 previous times and stayed at the Bellagio and MGM the Flamingo is not as grand but worth the money that we spent.", "title": "Perfect Location, Value for Money", "helpfulness": 3, "user": "Sarahmason12", "date": "April 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 27770979}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We ate at the Margretaville which was pleasant but didnt eat at the other restaurants in the Flamingo.", "title": "Vegas Baby!!!", "helpfulness": 3, "user": "Brooke5000", "date": "April 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27743992}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The positives for this hotel are:", "title": "What is up with the bad reviews? The Flamingo is fine!", "helpfulness": 6, "user": "OttoCal", "date": "April 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27665237}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We all traveled to Las Vegas for a 40th Birthday party- a group of about 20 including parents and teens. This was our first stay at the Flamingo, and we all loved it! Beautiful updated \"Go Room\", but some chose the older rooms and they were fine (a little less expensive). We had wonderful service in the hotel and casino and even the pool staff were helpful. The only down-side was not as many restaurants as other casinos- but the location made walking to other casinos and restaurants easy. We could even see the Ballagio Fountains from our room- Great show!", "title": "Beautiful and well kept!", "helpfulness": 2, "user": "iwannag0there", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62023617}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The location of the Flamingto is perfect, especially for first time visitors to Vegas. It is conveniently located in the middle of the Strip with access to some of the larger casinos and nightlife. Everything is within walking distance or the Monorail is behind the Flamingo. Labor Day weekend I spent 3 days at the Flamingo and had a horrible experience with my room. This time the Flamingo met my expectations. I was assigned a GO Room and had the choice of a Strip view or pool view. I choose the Strip view, what a mistake, take the pool view. The Strip view is very noisey at night with music coming from Club Pure across the street and noise and music coming from a bar below the hotel rooms. I was on the 17th floor and the noise went on until 3 or 4 a.m. There was also issues with children running in the halls at 10:30 p.m. and large parties going on in the rooms until 4 a.m. But, this is Vegas and you know the saying. Everyone was very friendly and tried to make my stay a wonderful experience. The casino could use some updating, but it was clean and the staff friendly. Cocktail waitresses are plentiful and eager to get you a refreshment. Don't expect to go to the bar and get a bottle of water if you are not gambling - it costs $3. The buffet is a very good value. The Tropical Breeze restaurant is also a good value and you get a lot of food for the money. While in Vegas I would recommend one show that is at the Imperial Palace. The Divas of Las Vegas, female impersonators do a fantastic job and it is very entertaining.", "title": "Perfect Location on Strip", "helpfulness": 1, "user": "barbara_2000", "date": "April 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 61943629}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "We visit LV 1-2 times per year. Nice and convenient casino however, not for a person that would like to sleep at night. We stayed for '2' nights... 1st night - nice & quiet- 2nd Night extremely noisy - was woke up twice by loud partiers. Finally, someone (person in another room) not the hotel staff told partiers to quiet down at 4am in the morning. Ate at the Steak 46 - service VERY slow (they were not that busy-not sure what would have happened if they were)- waited 30 minutes for the check, food OK- but, not great and should be for the price..Would not eat at Steak 46 again and not to sure we would stay at the Flamingo again!", "title": "Nice Location- Noisy Rooms", "user": "LOPtrav", "date": "April 18, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 61847129}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Stayed there last weekend and was apprehensive due to some of the previous reviews. Didn't upgrade (as the person I shared with - Stag Do - didn't want to) and our room, although basic, was perfectly adequate. It was on the fifth floor, overlooking the roof of the hotel but aside from the view it was reasonably clean and everything worked, e.g. shower, hair dryer, tv (hardly used), AC, etc.", "title": "Location wins, everything else pretty good too!", "helpfulness": 2, "user": "Danny B", "date": "April 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 61841181}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The location of the hotel is why we booked there and I think you'd be hard pressed to be better loacted within the Strip (other than pay a lot more at Bellagio or Caesar's). The casino and general layout of the hotel was fine too, good pool area, fairly spacious, good choice of shows / eateries, etc. Probably the one downside was some of the queues for check-in but we avoided this by eating and checking in later - the Friday & Saturday check-in looked pretty bad though, but, hey, if you're turning up on those days you should expect a longer queue, right? Check-out by key drop was very convenient.", "title": "good hotel", "helpfulness": 3, "user": "P&DNewt", "date": "April 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61829353}, {"rating": 2.0, "title": "Forget the Flamingo!", "text": "I was somewhat surprised that this hotel had been so highly rated. The furnishings were very shabby (and I saw three different rooms on different floors--all about the same) and there was a pervasive musty smell throughout the hotel. I would never stay there again. Rooms facing the Strip were noisy (Tues-Sat until 4:30 AM), which might be OK if you are in Vegas to party, but not if you are working as I was. I specifically requested a quiet room and had to be changed to one facing the pool--which is a quieter location. If you are non-smoker, the heavy smoke in the casinos does take some time to get used to. On the plus side, I found every staff member of the hotel with whom I came in contact to be very pleasant and accomodating. The grounds were nice--as was the pool area. We did not use the pool--it was very crowded, but people seemed to be having a good time. The hotel is located in a convenient spot on the Strip, if that is important to you. If you are looking for quiet at night--I suggest staying off the Strip and driving to the casinos you want to visit--all had free self parking, which is very convenient.", "helpfulness": 7, "user": "ReneeWashingtonDC", "date": "May 25, 2005", "id": 3499554}, {"rating": 3.0, "title": "not happy with management", "text": "I chose to stay at the Flamingo because of the location and their pool looked great on the website. It was a nice resort however the day after we arrived we were informed, by message on phone, part of the pool would be closed for the next 2 days for a private party. Knowing how crowed the pool gets I called to speak with a manager and was told he was busy but to come to the front desk. I went to the front desk and was told, after approximately 15 minutes, that the manager was too busy to speak with us but would call us the next day. Of course, that call never came. I felt I should've been notified before 1 day of the closing in case I chose to stay somewhere else. Not handled very professionally. Otherwise, great resort.", "helpfulness": 11, "user": "delton", "date": "May 25, 2005", "id": 3499501}, {"rating": 5.0, "title": "Flamingo: Great Value and Location", "text": "We had a great time at the Flamingo in late April. If you play, they send generous offers such as $60 per night for three nights and the location can't be beat, across from Caesar's, and near Bellagio, Paris and Bally's!", "helpfulness": 7, "user": "ski6973", "date": "May 23, 2005", "id": 3495619}, {"rating": 4.0, "title": "Thanks for the memories!!", "text": "The pool is lovely, beautifully landscaped, with many, many lounges that do, however, get packed on hot days. Comps accumulate because of the shared \"Connection Card\" with Caesars, Ballys and Paris. Our room was redone and just fine but we don't spend a lot of time in our room (they're not too good about upgrading you to a view of the strip if that's important to you though). Restaurants are ordinary but we had a rental car and went to many different places. If you want a great, convenient, location at a reasonable price, this is a great property. (The egress and ingress are also very convenient as you don't have to walk through a huge entranceway to reach the hotel like many of the other properties.)", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 23, 2005", "id": 3495571}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "I read reviews from this sight on the Flamingo Hotel for 4 months in advance of our trip. I was a little apprehensive but did all the things that other reviewers recommended. I checked in at the airport which was at 12:30pm and so crowded. It was about a half hour wait in line but was able to get a room key immediatly. I was simply polite and requested a non-smoking renovated room. I was pleasantly surprised to get room #22126 that had a FULL view of Caesars Palace and its fountains. It was clean, quiet and somewhat close to the elevators. Room service was good and efficient. I was never approached by time share peddlars and enjoyed the wild life habitat immensely. Since I was in class everyday, I couldn't take advantage of the pool but it didn't look over crowded even though the temperature averaged about 96 degrees the six days I was there. I found the slots to be tight everywhere on the strip but I played so much at all the \"Connection Card\" properties that they comped all my meals. I requested a late check out but they had two groups of conventioneers arriving and couldn't even give me an extra hour. They were apologetic about it, though, and I felt that she was sincere and would have allowed me to check out late if there were less demanding circumstances. I cannot think of a single negative thing to say about this hotel and its staff and will gladly stay here again.", "title": "Wear your walking shoes", "helpfulness": 3, "user": "20PCTIPPA", "date": "May 23, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3495508}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Stayed Apr. 18 -23. About our tenth time at the Flamingo. Check in was easy. We always get the regular room. The furniture is a little worn but very clean. I cannot see paying more for the GO room. The reason we stay here is for the pool. The best pool in Vegas. This year we went to the pool, the same way we always do ,and we were told that it cost Fifteen Dollars, They have a new \"Go Pool\". It cost Fifteen Dollars for Men. Women are free. We did not see what the pool looked like. I don't krow what goes on in the Go Pool but whatever it is only men have to pay for it. We were told to walk around to the regular pool. We waited on a long line, showed our room keys and were given Wrist Bands to wear. The pool was still great ( a little cold) but the hot tubs were fine. Plenty of lounge chairs and plenty of sun or shade. I still don't know what the Go Pool was all about. Still a great Hotel for what you pay.", "title": "Still Nice for the Price", "user": "DavyGGG", "date": "April 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62273853}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Great pool, first class room service, every encounter with every member of the staff was impeccable, nice room, great price, and right in the middle of all the action on the strip. There is no better deal to be had in Vegas!", "title": "Best deal in Vegas!", "helpfulness": 1, "user": "Trailwise", "date": "April 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62236216}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My husband and I are not picky on hotels, just a comfortable bed and a clean room will do. After waiting 45 minutes to check in, we arrived at the room to find food still on the carpet from the last guests as well as a plugged bathroom sink. Called Maintanence at 11:15 p.m., who said someone would be up within 30 minutes. Called back at 12:30 a.m. and was told I was 6th in line and to \"be patient.\" Called back at 2:00 a.m. and was told rudely that it was not my turn and I would have to wait. Asked if we could change rooms and was told they were full. Asked to talk to his manager and he transfered me to the automated menu system. I called the front desk and asked for a manager and got Tony...who sent up keys to a new room. This sink drained......slowly...but it drained. There was hair on the CEILING of the bathroom, not sure how that happens?? The outlet by the sink was loose and almost fell off everytime I plugged in my blow dryer. The AC in the room wouldn't stay below 72....good thing though, as there are no blankets provided in the rooms. Out of the total of 18 lightbulbs above the beds, 10 of them were burnt out. The green and pink neon lights in the bathroom were burnt out. The shower spray went out of the shower and onto the floor. We were never provided a bathmat for outside of the shower either. The wait for the elevator could be long especially in the morning and at check out times. There was room service items left in the hallway our entire 5 day stay that were never picked up as well as a piece of cake on the carpet. The first room we were in was 15077 and the second room was 15105....FYI. The beds were super comfy. The view was good of the garden and pool area. The food at Margaritaville was fantastic as was the entertainment there with the hula girls. The location of the hotel is perfect being in the middle of the strip and a monorail stop. All in all, we will NEVER stay here again, even if it was free! The customer service is totally lacking and they made you feel put out for asking for anything. For the price of the GO room you would be better off to get a suite at the Stratosphere for less money and spend the extra on cabs to go down the strip!", "title": "Will NEVER stay here again!", "user": "neesue", "date": "April 22, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 62195481}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We had a late arrival and contacted the hotel to let them know. We arrived at 1:30 AM, the folowing day, and was told that our rooms were not ready. They \"upgraded\" us to a suite, in the old section. Upon walking walking into the suite, we noticed the bathtub guts sitting on the toilet tank, almost as if the drain was pulled out of the tub to do maintenance. Husband put guts back in. The next couple of days, we realized that the towels were being changed out, but no other housekeepiong was being done. A few nights in, I noticed a black spot on the wall moving. It was a cockroach, and there must have been a family of them because we killed a couple more. We received no results upon mentioning these situations to the front desk. We have stayed in less well known hotel in the past, and have always been satisfied, at least they were clean and kept that way.", "title": "Now I know what a roach motel is................", "helpfulness": 1, "user": "Suzanne136", "date": "April 21, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 1.0}, "id": 62052999}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We stayed at the Flamingo in a GO Deluxe room on the first stop of our USA trip. The room had enough space so that we weren't tripping over our 4 suitcases and 4 hand luggage bags. Flamingo is opposite Ballys and Paris and very convenient to the main Vegas strip. We had a great view of the Bellagio fountains from our room. Make a point of walking around the gardens to see the pink flamingos and fish. The pool area is huge although not as big as some of the newer casinos. We like to get value for money and also to be comfortable and Flamingo fitted the bill perfectly.", "title": "Great location, great room, comfortable beds", "helpfulness": 1, "user": "Geeitsabigworld", "date": "April 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62037713}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My husband & I went on our 8th trip over Easter weekend. We deceided to try the FLamingo because we had never stayed here before and they had a great rate that weekend. After reading many reviews, we opted to book a Go Room & paid an extra $20 for a strip view.", "title": "We had a woderful stay at a Las Vegas icon!", "helpfulness": 4, "user": "ArizonaMary", "date": "April 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61625057}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Upon our arrival about 8 pm, we found a long line at check-in. We only waited about 20 minutes & to our surprise, had found out that we had been upgraded, at no extra charge, to a mini suite! The suite was a dream for us, we never could have afforded such a nice room.", "title": "Greatness", "helpfulness": 1, "user": "ksautter", "date": "April 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61316264}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "The pool had just been open for the season. It was nice but I was surprised that it was not heated. I enjoyed it once my body became numb to the icy water. :-) There were a few kids there, but not many. I suspect that would change in the summertime though.", "title": "It's really gone down hill", "helpfulness": 1, "user": "jll23", "date": "April 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 61256190}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We chose not to see any shows & opted to gamble instead. We did eat at one place inside the Flamingo though. We took advantage of the $2 burger & Fires special at \"The Burger Joint\" that goes from Midnight until 6am. The service was good & the food was okay...but for $2 what could I expect right?", "title": "Our worst Hotel experience EVER!", "user": "GUESTRAC", "date": "April 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 61170055}, {"rating": 3.0, "title": "Disappointed", "text": "The grounds at the Flamingo are beautiful & we would love to stay here again.", "user": "GJB292", "date": "April 12, 2010", "id": 61113372}, {"rating": 4.0, "title": "Great friendly atmosphere", "text": "We stayed at the Flamingo from April 15th through the 20th. We used the check in at the airport, the check in was quick but the employee did not offer us anything including the coupon book or any specials or anything that was going on at the hotel or in Vegas. We did use the shuttle service for $11.50 round trip, but I guess you can get the same service by going directly to the shutlle service itself for $9.50 round trip.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 9, 2006", "id": 5044874}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The room we got faced the parking lot and ramp of the Imperial next door - horrible view, so ask for a room with a more attractive view. The room was ok - not great - needs some upgrading but the price per night was reflective of the room that we got - about $95 per night average.", "title": "Really enjoyed the Flamingo!!", "helpfulness": 12, "user": "Dapplemoose", "date": "May 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5044614}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Having said all this, I truly like and enjoy the atmosphere of the Flamingo - the casino, the pool area, the tropical gardens. The key advantage is its location - tremendous - close to just about everything on the strip. Also easy access to the Monorail - which is however not that cheap.", "title": "Best Location at Great Rates", "helpfulness": 11, "user": "lovetotravel1704", "date": "May 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 5043599}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "I understand that the Flamingo will be undergoing a $300 million renovation shortly - so a very good place will be great once again. We will definitely stay there again.", "title": "Needs an upgrade", "helpfulness": 6, "user": "CamandKay", "date": "May 7, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 5040224}, {"rating": 4.0, "title": "I wiil go back !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "text": "Myself and a coworker stayed 3 nights at the Flamingo the first week of May! The weather was over 100degrees and the Flamingo was perfect. We were upgraded at check-in to an executive suite on the top floor overlooking Caesars and the strip. We had floor to ceiling windows that made up the entire outer wall! What a view! The staff were all very helpful and kind. We spent two afternoons at the pool with yummy pina coladas in hand. The wait staff at the pool were somewhat slow but the tropical environment made the wait worthwhile. The location on the strip is perfect and although I didn't win any big jackpots, I held my own on slots. We took advantage of the valet parking at many hotels during our visit and received the best, timely service with the Flamingo. Fun crew with great service! I will definately return for a stay at the Flamingo. Its budget friendly and a good stay!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 6, 2006", "id": 5038713}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "This is the third year that I've stayed at the Flamingo for a convention and everything was what I expected it to be. I stayed in a standard room again, and they've changed things up a bit. The furniture is new, and they've replaced the comforters by double-sheeting the blanket and putting a suede thing at the foot of the bed. (I stayed in a Renaissance hotel in DC last week that did the same thing, come to think of it.) I think it's nicer because the comforter ends up on the floor anyway, and we've all seen those lab tests of hotel comforters on TV.... I had a problem with the air conditioning in my room - it wouldn't shut off, and my room was about 60 degrees all night - nice at first, but by about 5am, I decided I didn't like it anymore. I called customer service after breakfast and they sent someone over to fix the thermostat in about 10 minutes. The room was spotless, room service trays were promptly picked up in the hall, service was responsive and friendly. I can't ask for more than that. Margaritaville was great fun, and the food was also good. Check-in this year was great - there was no line when I arrived at 11 PM. The last two years, arriving on the same weekday at the same time, it took about 45 minutes to get checked in and the line was huge. The clerk said it doesn't happen often, but I wasn't going to complain. One tip if you park in the garage - there is a walkway on the third floor of the garage that takes you to the lobby, so you don't have to dodge cabs getting from the garage to the lobby. It's a shorter walk, too.", "title": "Very pleased with the Flamingo", "helpfulness": 5, "user": "Snarky", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28119709}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We stayed at the Flamingo April 3rd through April 7th. We had a group of 26 people attending Las Vegas for the National Bowling Tournament and I had no complaints from anyone in our group. The \"GO\" rooms were absolutely fantastic. Housekeeping was great, we never had a problem with our room not being cleaned. Our casino host, Lich Tran, provided everything that we could have possibly ask for. We dealt with Lich from the very beginning stages of making our reservations and he went above and beyond the call of duty to make sure our stay was the best. He made arrangements for our travel to and from the airport as well as the Cashman Center where the bowling tournament was held. As far as we are concerned, we would highly recommend staying at the Flamingo and if you use a host, Lich is the person to assist you.", "title": "Our experience at the Flamingo was great!!!", "helpfulness": 6, "user": "Havingfun09", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0}, "id": 28114603}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Danny B. Williams", "title": "Ups and Downs", "helpfulness": 5, "user": "Tripnastic", "date": "April 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 28053684}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Claudia B. Capps", "title": "Definitely Recommend the Flamingo", "helpfulness": 6, "user": "Ziparoo", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28044659}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Wilson, NC", "title": "Worst Experience Ever... I'll never stay at this hotel again...", "helpfulness": 3, "user": "ginicheang", "date": "April 14, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 27976491}, {"rating": 5.0, "title": "The Falmingo was Great", "text": "When we first arrived at the Flamingo, we encountered the dreaded long check-in line. Yes, we read the reviews before hand and knew of the danger, but we figured, at the price we paid, we'll take our chances. It turns out that the stories were somewhat exagerated. It took us less than a half hour to get to the front counter. OK. Maybe some of you can't wait that long, but it really did move fairly quickly. When we got to the desk, we encountered our next review nightmare, the desk clerk. Contrary to numerous negative reviews, this individual (Brenda) was very friendly and helpful. (Some of you reviewers need to be a little less critical.) We asked for an upgrade and recieved one with absolutely no problem. We were able to check in to our room immediately (11:00 AM) and it was great. No issues to report here. I don't know where some of you people stayed to write such negative reviews prior to this, but it certainly wasn't in this room. Yes, the view included a partial view of the IP parking garage and the back of Harrah's and the Venetian, but what hotel room has a perfect view? On the plus side (you can ignore the percieved negative), the view included the mountains in the distance and the Flamingo Pool and Garden. I thought it was perfect. Our 10 day stay was truly a pleasure. The staff was great. The bed was made, we had clean towels, and the room was cleaned every day. OK. We had one little problem. My key card stopped working on the second day. We went to the front desk and it was immediately taken care of. The individual that took care of this was extrememly apologetic. If that's the worst thing to happen on a vacation, I'll take it . I would highly recommend the Flamingo for it's price, it's location on the strip, and especially for it's friendly staff.", "helpfulness": 9, "user": "Duffer5209", "date": "April 13, 2009", "id": 27940641}, {"rating": 2.0, "stay_parameters": "Stayed April 2009", "text": "My stay at the Flamingo was the worst hotel experience ever!!! We arrived at check-in at 12am. It took 90 minutes to finally reach the front desk where we were informed that they did not have any rooms with two beds or non-smoking. We had reserved both. When we exited the elevators on the fifth floor we were greeted with the worst vomit smell ever. When we turned the corner there was a passed out girl surrounded by pools of vomit. There was a hotel employee standing there with her. My husband left our room 30 minutes later and she was still there along with the piles of vomit. At 11am the next morning,,,, yes the vomit was still there but this time covered with a towel. When we arrived at our room with our two young children (we were in Vegas for a family wedding) we found pills lying on the floor. I then decided I needed to examine every square inch of the room to make sure there weren't any other pills lying around.. When I looked under the bed I actually found an old sandwich, cigarette butts and probably 10 years worth of filth. The pool was horrendous. There was beer bottles in the bottom of the pool and leaves, sticks and muck. The area surrounding the pool was covered with old food, glasses and garbage. It was awful. We checked out and moved to a different hotel and for $20 more had clean, beautiful accomodations. The positive aspects of the hotel are the central location, the breakfast buffett (it was delicious) and the wildlife area. The flamingo area seemed to be very well taken care of. I would never ever go back to the Flamingo.", "title": "Stay away from the Flamingo", "helpfulness": 7, "user": "JLK123", "date": "April 13, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 27920999}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I had read all of the reviews for the Flamingo and thought \"I'm not going to be in the hotel all that much, so it doesn't matter\". Boy was I wrong.....it matters.", "title": "Just a little more will get you a much better hotel...MUCH BETTER!", "helpfulness": 4, "user": "TeresaSmith", "date": "April 13, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 27914255}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Where to start......let's see. Well, when we first arrived to the hotel we had to stand in line for a little over 2 hours just to get checked in and this was about 10am. The line only got worse the closer it got to 4pm (check-in time) and they still only had 2 people waiting on everyone. We booked our stay through Vegas.com. I printed off the confirmation paper and read it word from word. I called the Flamingo the day before we left for Vegas to confirm our stay and to see if there was anything else we would need to check in. They told me that I was in the computer so all I would need is my ID. Then we got there and they said we had to give them $200. I have stayed at many hotels and I completely understand they need a credit card to hold incase anything happens, but the Flamingo actually charges your card right then and there. If you use cash you get it back when you check out. If you use a card, then you won't get the $$$ back for 3-5 days after check out. I wasn't very happy about this seeing as I had just asked them the day before and this was never mentioned. That $200 came out of our vacation/spending money. Not a good surprise!", "title": "Terrible housekeeping", "helpfulness": 3, "user": "legcracker", "date": "April 12, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 27874279}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "The first night we were there we decide to eat dinner at the buffet. After standing there for ever we finally got seated and there seemed to be crumbs on my seat, so I went to brush them off and it turns out they were small pieces of a dinner plate someone before us had busted. A couple of the pieces stuck in my hand and instantly it started bleeding. I told the guy that was getting our drink and he said \"yeah, I know its okay. Just keep brushing them off\" and walked away. Didn't care at all. Let me tell you....the buffet is not worth the $22 - $25 a person. Everything tasted old and nasty. Later that night we were so sick.", "title": "This will be my 7th stay at the Flamingo and my 9th in Las vegas", "helpfulness": 2, "user": "jackslondon", "date": "April 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27839731}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "My wife and I are devoted Flamingo fans. We have stayed there for at least 7 visits. The pool is a major reason for our enthusiasm. No other pool has the tropical feel. Check out the Stratosphere pool in comparison, there is none. It is on top of the building, with no shade and about 5 palm trees.", "title": "Loud background music at the pool", "helpfulness": 12, "user": "Vegasfan72", "date": "May 6, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5038533}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Previous visits had the normal frustrations of finding a seat and seeing people save 7 or 10 chairs for their buddies at 0700 and not have them show up until 1100 if at all. But chairs were available. We used to enjoy the relaxing environment, enhanced by musical background of a tropical nature. Unfortunately this time our ears were assaulted by speakers blaring at level 9 or 10 with 70's rock and roll. This was very uncomfortable and irritating. We did ask that it be turned down but nothing was done. The garden area should be a place to relax and enjoy the wonderful natural surrounding, if I want to hear loud music I will go to a bar or the Harrah's outdoor pavilion.", "title": "Can't beat the location - wonderful weekend getaway", "helpfulness": 10, "user": "strssr99", "date": "May 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5034427}, {"rating": 5.0, "title": "Love, Love, Love the Flamingo!!!", "text": "Also there should be a tighter security to insure that only Flamingo guests use the pool. We saw many people enter without having to show room keys and others who got dropped off or picked up.", "helpfulness": 35, "user": "Julie9409", "date": "May 1, 2006", "id": 5025504}, {"rating": 5.0, "title": "beautiful hotel.", "text": "This was our 7th trip to Vegas, for my 40th birthday. Since my husband was only able to get 3 days off work, and a weekend at that, it made it imperative to be able to fit everything in we wanted to see and do. The Flamingo fit the bill perfectly. The major thing working for this property is Location, location, location. Easily one of the best locations in town for heading off to the various (strip) sights. From now on we will stay in this specific area as it was an easy walk to either end of the Strip. Check-in at the airport was quick and convenient. Rooms were roomy and clean. Bathroom was a bit on the smaller side but was sufficient. Employees are generally friendly and smiling, with the lone exception of a check-out clerk who clearly was in need of an attitude adjustment. (Or perhaps she didn't have her morning coffee yet.) Gardens, wildlife exhibits, and pool are beautiful, especially for a quiet, romantic stroll in the evening. Elevators are plentiful, and we never had to wait long for one.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 1, 2006", "id": 5025424}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "On the other end of the spectrum - the things we did not enjoy: Food choices are limited. Buffet is mediocre, at best. Skip eating here - for the price there are much better choices close-by. There is no food court, which would be a welcome addition. Slots were not the greatest. A couple small wins, but nothing to speak of. Casino can be a bit smokey - although we are not smokers, we have several family members who do smoke and I think we tolerate it better than most non-smokers, but in certain areas it was unbearable here due to lower ceilings. Their billing/accounting system must have some bugs in it to work out, as when I booked online it clearly stated it would charge my credit card for the first night, but they did not. Caused quite a bit of confusion at check-out as we were only expecting to be billed for 2 nights, not 3. And they kept trying to charge my sister for a 4 night stay instead of 3 nights.", "title": "The Flamingo Gets the Job Done", "helpfulness": 21, "user": "scotrk", "date": "April 30, 2006", "detail_rating": {"cleanliness": 3.0, "rooms": 3.0, "value": 4.0}, "id": 5022542}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Last minute trip. Couldn't get in at the Bellagio so I stayed at the Flamingo and must say the location is GREAT. Unique place. Room was fine with nothing really wrong or great. Busy week do to NCAA playoffs. Room was nice size and clean but nothing exciting. Gave it 3 stars but it should b a 3.5", "title": "vegas again !!!", "helpfulness": 1, "user": "hoods4u", "date": "May 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 159468383}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Next time I make it back to Vegas, you will find me at the Flamingo! The pool was fantastic and drink prices were reasonable pool side. My room was clean, bright, with an outstanding view of the Bellagio fountains equipped with a fabulous bathroom. The staff made me feel like royalty from check in to check out. Easy access to the strip from all exits, and hey who doesn't associate a flamingo with a tropical paradise? The Flamingo is the place to stay", "title": "The Flamingo made it easy to check in and out, no hidden fees, and the service was amazing! Clean and affordable with easy acces", "helpfulness": 1, "user": "316Sid", "date": "May 2, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 159457814}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We paid extra for a luxury room with a view and it was well worth it. Beautiful view of the sun hitting the mountains in the morning and awesome place to watch Bellagio fountain regularly. Check in clerk was so nice and searched until he found the room we thought we would enjoy the most. Electronic controlled curtains, nice jetted shower, tv in mirror in bathroom along with big tv in room; although rarely turned it on. Pools were very nice but had to go early since they were packed. Staff at pool very accommodating as were most of hotel staff. Restaurants, cafe, store all easy access and nice to have within arms reach. We had stayed years ago but the nice upgrades added to the enjoyment. We enjoy this location on the strip so it was a good choice for us.", "title": "Nice updates", "helpfulness": 2, "user": "SusanEugene", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159452114}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed in a FAB Deluxe Queen Twin room on the 12th floor overlooking Caesars / Belagio from 23 Dec to 6th Jan. The main reason we chose this hotel was for location so we had no expectation of facilities or amenities.", "title": "Two week stay at Christmas", "user": "liznpete", "date": "May 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 159450274}, {"rating": 2.0, "stay_parameters": "Stayed April 2013", "text": "Excellant for the location right in the middle of the strip and for the time of year we got a great price with resort fees included.", "title": "Horrible Customer Service", "user": "Ben702", "date": "May 2, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 159410843}, {"rating": 2.0, "stay_parameters": "Stayed May 2013", "text": "Waiting at check in on a Tuesday at 5pm it took over 1 hour then our room was not ready . We proceeded to drop our bags with the bell boy and waited a further 10 mins to be served.", "title": "Poor service all round", "helpfulness": 1, "user": "AUSSIEAGENT84", "date": "May 2, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 159405690}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We ended up having dinner at the Mexican grill waited and waited to be seated their to .", "title": "awesome pool!", "user": "brendas182", "date": "May 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159404757}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We eventually got our room at", "title": "$20 Check-In Sandwich Works", "helpfulness": 2, "user": "BigBadBlight", "date": "May 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159400002}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "7.30 pm.", "title": "Bad Room Maintenance", "user": "haisvu", "date": "May 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 159392180}, {"rating": 3.0, "title": "Served the purpose", "text": "We woke and we for breakfast we have 1 option java shop where they had 1 person working it took 30 minutes to get 2 coffees and 2 bagels.", "user": "Custer01", "date": "May 1, 2013", "id": 159391047}, {"rating": 5.0, "title": "Outstanding, will stay again", "text": "We stayed here the 15 thru the 17 of May 2005. During our 7 night 4 hotel ( Plaza-Downtown, Paris, Mirage) stay in Vegas, this hotel rate number 1. We were on the 17th floor overlooking the pool. The pool was terrific. Loved the feel of being in the in the islands. And unlike the Mirage, our 2 rated hotel, we were never crowed and loved the idea of an adults only pool. During our stay at the Paris, rate 4, the pool was closed one day and there are no trees or flower only concrete. We found check in fast Sunday at around 4pm. Room was neat and clean and elevators seemed to be right there when you pressed for them.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "May 23, 2005", "id": 3494539}, {"rating": 5.0, "title": "Flamingo Is My Choice", "text": "I can say enough good thing about this place, we absolutely recommend this place. We will come back", "helpfulness": 14, "user": "A TripAdvisor user", "date": "May 23, 2005", "id": 3494414}, {"rating": 4.0, "title": "Going back next year!", "text": "With it's comfortable rooms, friendly and helpful staff, and central location The Flamingo will be my choice for hotels in Vegas from here on out.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 23, 2005", "id": 3494159}, {"rating": 4.0, "title": "Loved Vegas and the Flamingo", "text": "The room was very comfortable and had been remodeled the previous year in 2004. Admittedly, not as extravagant as some of the other hotels on the strip, but nice all the same.", "helpfulness": 30, "user": "A TripAdvisor user", "date": "May 23, 2005", "id": 3493563}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "The location was the best. The hotel has everything right there, and if it isnt close enough to walk to, the hotel has a monorail station! Walk to Caesar's, Bally's, Paris, The Mirage, and Imperial Palace; Or if, like me, you prefer a smaller casino you have O'Sheas and Barbary Coast on either side.", "title": "Great Hotel", "helpfulness": 14, "user": "CarlandJoanne", "date": "May 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3488093}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "Stayed at the hotel for a week starting 5/14/05. My wife wanted a hotel on the strip with a good pool. Check in was quick with an extremely helpful clerk who got us a room with a good view of the Bellagio fountains. The room was clean, as was the most of the rest of the hotel. The furniture was worn and chipped. The mattress was a couple of years past being replaced. The gym was extra, local phone calls were $1.00 for 20 minutes, $.10 per minute thereafter (I call to Russia for $.03 per minute, I haven't seen rates like these since the 80's), we used our cellphone for all calls. Bottled water left in the room was $3.50?!", "title": "Old School Hotel Awaiting Implosion!", "helpfulness": 14, "user": "juanvaldez001", "date": "May 19, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3484599}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "Internet service was a joke, $10 a day for wired internet (that's $70 for a week, I only pay $50 a month for my cable modem at home), and $.35 per minute wireless. We just did without internet for the week on principal. $5 a day wired would not be out of line, and since the rooms are already wired I'm sure they would make more by reducing the price and increasing the volume, but \"stupid is as stupid does\". Along the same lines there wasn't a single premium channel on the TV (HBO, Showtime, etc.). This is almost a given in the cheapest hotel, but not the Flamingo, pay per view or basic cable only.", "title": "Could do better", "helpfulness": 6, "user": "hardwareman", "date": "May 18, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 3.0}, "id": 3483879}, {"rating": 4.0, "title": "Pleasantly Surprised", "text": "Maid service was generally good, but it took 3 days to get a box of tissue replaced. The room was noisey, and the frat boys next door and in the hallways were a bit much our first night. Where was security? The shower was awful. I understand the requirement for low flow shower heads, but these were the worst. Not enough flow to rinse the soap off. Better showerheads are available, just not at the Flamingo.", "helpfulness": 13, "user": "srfc6787", "date": "May 17, 2005", "id": 3479391}, {"rating": 4.0, "title": "flamingo great", "text": "The only 24/7 food service in the hotel was a sit down cafe (coffe shop doesn't open till 6 a.m., and doesn't service sandwiches (pre-made get them early before they go stale) until 10 a.m. We went across the street to Bally's to get a fresh sandwich in the mornings (Johnny's Deli, don't go to NOSH at Bally's as they only service breakfast in the morning despite advertising as a sandwich shop). We skipped the buffet having eaten there in the past and being unimpressed.", "helpfulness": 10, "user": "mrs piggy", "date": "May 14, 2005", "id": 3472292}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "As noted in the first paragraph, the hotel was chosen for being on the strip, and the pool. A couple of days in we received a voice mail telling us the Lagoon Pool (2/3 of the pool area) was going to be closed for 2 days for a private party. Since the water slide pool was already closed, this left only the small upper pool available. We were told we could walk a block to the Paris and use their pool!? I cannot say we were happy with the way this was handled.", "title": "Great all-around experience", "helpfulness": 11, "user": "bobnu75", "date": "May 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3470382}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Stayed at the Flamingo 10/7-10/11/08. Hotel is very average. It's worn, dated, but our room was clean and we had no problems. The mid-strip location is great. Coffee at the coffee bars was not very good. Pizza was awful.", "title": "Not great, but not bad", "helpfulness": 4, "user": "Gabrielle C", "date": "October 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 21005553, "likes": {"liked": "— The live flamingos in the back of the hotel were very neat.", "disliked": "— The Donny and Marie ads being played outside... annoying!!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We did speak to some folks in the elevator who were on the 11th floor and said there were ants in their room. We saw no signs of that on 22nd floor.", "title": "Loved IT", "helpfulness": 4, "user": "Kirst456", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21000234, "likes": {"liked": "— Cool \"Go\" Rooms", "disliked": "— If I was here to sunbathe the pool is quite small"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Overall, the price was right - we paid $40 per night for two nights and had two nights comped. I wouldn't pay much more than that to stay here.", "title": "Lacking in customer service.", "helpfulness": 5, "user": "Helig29", "date": "October 17, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 20971237, "likes": {"liked": "— Location", "disliked": "— Customer Service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Hi", "title": "Flamingo was great", "helpfulness": 4, "user": "cpcoleman", "date": "October 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20945876, "likes": {"liked": "— Bed and view from room.", "disliked": "— Shower head."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Myself (34) and husband (30th Birthday surprise)have just returned from 4 nights in Vegas staying at the flamingo \"Go\" room . It was excellent the room was better than expected and the staff were friendly and helpful. The location was amazing exactly in the centre stip, from here we walked to all other resorts although don't bother with Cirus Circus it run down and cheap looking thank god I didn't book here! I would have been really upset. I have read on here that the hotel isn't important as you don't spend much time in it, but I disagree after walking, gambling and eating the buffets it was fabulous to come back to beautiful room have a shower and sink into the most comfortable bed ever....and not be distrubed by noise. As novices to gambling we watched and played the electronic blackjack regulary winning $40 and one of the best afternoons was spent at the tropicanna on the $5 blackjack table with a typical America guy from California, a lady from Texas and a Lady from Manchester UK. It was great fun and not the least bit intimidating, my husband only played with $40 dollars but it lasted for about 3 hours!! Its the taking part that counts! Another cool place is Bills Gambling Hall the Blackjack tables are great fun and they show you how to play.. again not intimidating. We loved visiting the mega resorts and they are amazing, we had a great time and recommened it to others. Viva las vegas baby !", "title": "WONDERFUL!", "helpfulness": 6, "user": "cc41283", "date": "October 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20940743, "likes": {"liked": "— Our hotel room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Before staying at the Flamingo I didnt know what to expect. The prices were very low, and I knew it wasn't considered one of the \"luxury\" strip properties. This being said, I was a little nervous about what to expect. Almost immediatly upon arrival my worries subsided. The lobby was very nice, check-in was easy for a Saturday ( only had to wait about 10 min). We asked for an upgrade and they gave us a room in there newer tower. The room was quite a hike from the elevator.. but the downstairs entrance to the elevators was very close to the casino and pool. The room was large and very clean. The bathroom was nothing outstanding but certainly nice enough. One thing is that dont provide you with many bathroom products, so bring your own. Room service was tasty and brought up very fast considering the times we ordered. Also prices were low on the menu compared to other strip properties I have stayed at.", "title": "Possible the best value in Vegas.", "helpfulness": 31, "user": "icem2829", "date": "May 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5181621}, {"rating": 1.0, "title": "Disappointed at the Flamingo Hotel", "text": "I knew the Flamingo pool was considered one of the best in Vegas, and it certainly met my expectations. As with all nice pools in Vegas, chairs can be hard to find, especially in the desired spots. After searching for a while we were always able to find two together. One thing about this pool that made it better for me then other hotels was the price and service of poolside drinks. They were fast in coming and priced relativley well, cetrainly for beer.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 18, 2006", "id": 5148184}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The Flamingo casino area is a bit strange, it is broken up into a small area near the lobby, and then a larger area over near the strip entrance. We played most of our Blackjack in the smaller area near the lobby. The tables seemed less crowded and quieter. Drink service in the casino was the best I have ever seen . They are almost TOO fast at bringing your drinks.", "title": "Loved the Flamingo!!", "helpfulness": 12, "user": "glweston214", "date": "May 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5146986}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The best part of the Flamingo is the price. I have stayed at around 6 or 7 other strip hotels and found little difference in quality, but at around half the price. Not just the room prices, but food and the shops also. I will certainly visit the Flamingo many more times in my life. It was a great experience.", "title": "Still great!", "helpfulness": 7, "user": "kaz4679", "date": "May 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5071628}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I was disappointed at my stay at the Flamingo. For the price of the hotel, I expected more. The hotel rooms need a renovation. My biggest complaint was the staff. They were not friendly at all and it was difficult to get anyone to answer our questions. For example, we had a difficult time navigating through the hotel and asked a staff member situated near the casino for directions to the South Entrance. He replied, \"I don't know, go ask the front desk.\" We looked at the long line of customers waiting to check in at the front desk and decided not to wait in the long line simply to get directions. We opted to ask another hotel guest for directions and received help that way. We also asked for a 1 hour late check-out to which they were not accomodating. I will never stay there again.", "title": "Great place, great location", "helpfulness": 13, "user": "sbowen0823", "date": "May 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5068753}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We arrived to find out that our reservation for a \"king room\" was not availabe, but for an additional $30 a night, we could have an upgrade. We were very glad we took the upgrade - it was there 'GO ROOM\". We had a great view of the strip and loved all the special amenities that the room offered (especially the built-in TV in the bathroom mirror.) The hotel room was so \"cool\" and modern - it really stuck with the pink flamingo theme.! We tried the breakfast and dinner buffets and enjoyed both. The location was perfect and was exactly what we were looking for on the Vegas strip. We would definitely stay here again! (Also, we would definitely recommend their \"Bugsy's Tour of Las Vegas\" - it gives you a good overview and history of the strip area that normally gets overlooked.)", "title": "Great hotel/casino on the strip! Great value!", "helpfulness": 5, "user": "nachoDallas", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 27824116}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had to pay to move rooms after my husband got off the elevator to find a man attacking a woman in the middle of the hallway in the middle of the day! The man was on top of her choking her and she was screaming for help. My husband is a former Army Ranger and when he tried to help the woman, the man didn't stop. My husband had to punch the man in the face to get him off. Security & police came and arrested the man. I didn't feel safe being three rooms down from this man's room. We had to pay to move to a new room! Not to mention - you will have to wait at least an hour to check-in. When you do check-in, you will then be notified that there is a $100 a day secruity deposit that is automatically deducted from your credit card each day you stay. Be sure to budget for this. Went with four other couples and none of them were aware of this either. Room was a dump. Looked NOTHING like the pictures. No blanket on bed, only sheets. Shower did not work. Light bulbs out. T.V. came on and off by itself. Walls of rooms are paper thin. Could hear everything neighbors said & did. (Yes, everything) Asked for non-smoking. Neighbors smoked and so our room filled with smoke every night. Pool is open to people off the street and neighboring condos. Chairs in the sun are gone by 9:00. Pool slide was closed entire week. The Flamingos are pretty. Buffet was good. Will never stay here again.", "title": "What a joke!", "helpfulness": 2, "user": "JanIndiana", "date": "April 11, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 27820068}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Had I read all of the negative reviews before I booked the Flamingo, I would not have stayed there, but the trip actually turned out well.", "title": "A decent review for the Flamingo", "helpfulness": 6, "user": "ESandberg", "date": "April 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27818994}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Because of the negative reviews, I requested an upgrade at check-in that was away from the elevators; the going rate for the weekend was $25 and was worth it. Check out the virtual tours to decide if you will like the style of the GO room (it will definitely be a personal preference and not worth reviewing). What I can tell you is the amenities are comfortable and clean.", "title": "Third time at the Flamingo and they still have it!", "user": "windycityfoodie", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 27797252}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "-Bed and linens were very comfortable (pillow top).", "title": "DINNER BUFFET", "helpfulness": 2, "user": "sueanne21", "date": "April 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 27784544}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "First it was my birthday and I decided to use my comp room at the Flamingo and will suggest that you never use your comps or pay for any type of room at this property. The room was directly off the elevator accross the hall from the vending/ice machine. The room was a free upgrade to a strip view but the bathroom was the worst I have seen in a hotel ever, the light fixture were rusted, the shower head was hanging out the wall and the bath tub had green stains in it. The room looked dingy as all the furniture seem to have been there since the first day it opened. So I went back downstairs and asked to me moved, I was told \"NO\" because they were sold out, I asked to meet with the manager and was told to wait, then after waiting a good 15mins no manager came and I was told that we can switch your room now. (But they was sold out). The new room was at the end of the hallway, pass the houskeeping room and around the corner,and had burn stains in the carpet (supposingly a non-smoking room) while walking there you see food on the floor and the elevator had a scary feeling as it was all scratched up with no music. The garbage cans in the garage was always overflowing with garbage. I have to say Imperial Palace beats the Flamingo by 100% and I have stayed at Harrah's property many times and this has to be one of the worst hotels on the strip.", "title": "Worst Harrah's Property In Vegas", "user": "jr876", "date": "April 12, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 5.0, "rooms": 1.0, "location": 5.0}, "id": 61051640}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "If considering to stay don't stay in room:15116 & 8156. We need to all tell Harrah's to spend some of the money they are getting and fix this place up.. OH. There is no coffee maker so don't plan on making coffee in the room and they are limited on towels in the room.", "title": "Way better than expected!", "helpfulness": 3, "user": "Eyeluv2Travel", "date": "April 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 61036419}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Based on trip advisor reviews, I was very skeptical going in, but was pleasantly surprised about staying at this hotel for a week from April 2-9, 2010.", "title": "Average Hotel, but so Great!", "helpfulness": 2, "user": "JustChic", "date": "April 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 61004668}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Check in: was very late on a Friday evening, and very fast, although lines were long throughout the week, it's hit or miss depending on when you check in. The earlier the better - as your preference of room may not be available... Long check in lines are expected in Vegas, but ours took about 10 minutes.", "title": "I recommend staying at The Flamingo", "helpfulness": 1, "user": "1greatscott", "date": "April 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60966907}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Rooms: We were in a king deluxe smoking room for the 1st night. It was facing the north strip, and the room was clean (although smelled like smoke), and was nicely kept. The 2nd night we got a deluxe double bed which was also very clean, and faced the south strip. Room again was clean, maid service daily was very good. Typical 3 star room, older carpets, and furnishings, but clean, and spacious. Way better than most of the reviews on here state... was happy, and was there for a week. Didn't see any bugs, or anything alarming... Did not see a GO room, so could not compare, but if you're accustomed to 3* travel, this will be ok for you!", "title": "Don't sweat the small stuff--Flamingo is all good!", "helpfulness": 4, "user": "julierickbleu", "date": "April 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60951759}, {"rating": 4.0, "title": "Flamingo Las Vegas", "text": "We stayed at the Flamingo Las Vegas for my birthday during September. The hotel is in a great location. Check-in was a breeze and the staff I found was friendly. We stayed on the 8th floor above a small bar downstairs. I little noisy at times but not too loud. The room was pretty big with a comfortable chair.. We could watch the weddings going on during the day. Getting in and out of the parking deck was easy and we were close to a t store for cokes and beer. My husband doesn't like to walk but I was able to talk him into visiting 11 casinos within the strip area. The tram really made that easy. It was clean and I felt very safe. We also rented a car for the 4 days for less than a 100.00 from car rentals.com.. We ate the Margarettaville restaurant right outside of the hotel and it was very good both times.. The service was good and it was fun to people watch.. Overall I had a blast and will continue to stay at the Flamingo.... I am not sure about the good rates now that Harrah's has taken over. Well see in April.", "user": "PaigemLeach", "date": "October 31, 2006", "id": 6030368}, {"rating": 4.0, "title": "Never accept a conference room", "text": "My husband and his brother along with his wife stayed at the Flamingo October 11-15. We arrived in Las Vegas at 10 p.m. and the airport check-in was closed so we had no option but to check in at the hotel, which went quickly. However we were told there were no non-smoking rooms available but we could stay in a nice conference room. Don’t ever let them give you a conference room. It is a room with a Murphy bed (which means the horrible bed pulls out from the wall) then the rest of the room is a giant table with about eight giant leather chairs. All the bathroom amenities were small and the room I have no doubt had smokers during their conferences. The hotel would not give us another room but the next day comped us each a buffet meal. The buffet meal at the Flamingo is not good; do not waste your money and comping the meal is no compensation. That was the end of the disappointment.", "user": "Pinkbee", "date": "October 30, 2006", "id": 6030360}, {"rating": 2.0, "title": "Not as good as before", "text": "The next morning the staff changed us to a beautiful 12th floor room that was clean and had the most comfortable bed. We loved the pool area and the location of the Flamingo. The staff was friendly and accommodating. I would stay there again.", "user": "sdtripper", "date": "October 25, 2006", "id": 6010145}, {"rating": 2.0, "title": "Location great", "text": "Our favorite places to eat were the buffet at the Bellagio for lunch, the Paris for breakfast is a must it is an amazing buffet and the line is long but it goes quickly. Off the strip you should go to Rosemary’s, we printed out a lunch coupon and it was so worth the $25 each way taxi drive, you will not be disappointed The best restaurant we had ever been too, all four of us loved our meals and service. Search Rosemary’s website for details.", "user": "RexT", "date": "October 22, 2006", "id": 5984458}, {"rating": 4.0, "title": "Flamingo - a good value", "text": "We recommend the free shuttle service from Harrah’s to the Rio for black jack gaming and entertainment. We also saw the show Mama Mia’s we girls loved it; however the guys tolerated it, but you can buy your half price tickets for the day of the show at the half-price ticket stand next to the M&M store, great value and so glad we did, we had ninth row seats for $60 and the person sitting next to us had bought $110 tickets on-line, all the seats are good, wait to buy your tickets at the half-price ticket counter, which opens at 11:00, get there at 10:00 to wait in line that morning.", "user": "jimny", "date": "October 21, 2006", "id": 5980835}, {"rating": 4.0, "title": "What I expected", "text": "We arrived in LV Oct 2nd and stayed 4 nights. Took advantage of the Airport Check -in, which is great. You can then catch a taxi and go right up to your room. No waiting in line at the hotel. We booked a GO Room which has just been renovated and if you like modern, then you'll love a GO room. Didn't think I'd take advantage of the TV in the bathroom but when your in the glassed in shower you can't help but watch the sports game you've just betted on downstairs. There was a little construction noise early in the morning, but I just stuck in a pair of ear plugs and fell right back to sleep. The noise didn't wake my husband up at all. Pool was nice, but didn't spend nearly the time I thought I would there. Wasn't overcrowed at all, but October isn't their busy time.", "user": "Shannon76", "date": "October 18, 2006", "id": 5969586}, {"rating": 4.0, "title": "Great value on the centre of the strip", "text": "Casino was fine, nothing fancy. Won a bit on the slots, and at the blackjack table. Had a really good massage at the spa, and we really enjoyed the George Wallace show the hotel has to offer.", "user": "Melviz", "date": "October 17, 2006", "id": 5965142}, {"rating": 3.0, "title": "Great Location", "text": "This hotel has a great location, and it's not the newest or the fanciest of the strip hotels, but my room was great, and for the price it was a good value. It was exactly what I expected it to be. If you want Belliago standards, stay at the Belliago.", "user": "cjap31", "date": "October 16, 2006", "id": 5961153}, {"rating": 3.0, "title": "A little disappointing", "text": "Saw the LOVE show, really really good. And also Lance Burton. He wasn't bad, but my least favorite of all the shows we saw. Had a excellent dinner at Smith and Wolensky's Steak house. Pricey, but worth it.", "user": "LesleyJ", "date": "October 14, 2006", "id": 5955551}, {"rating": 5.0, "title": "Flamingo Hotel", "text": "Also as a side note, if your going to get a tattoo in Vegas, I got one at Pricz Tattoos. They are off the strip, and was really happy with the outcome.", "user": "MelissaLynn74", "date": "October 14, 2006", "id": 5955212}, {"rating": 4.0, "title": "We Loved the Flamingo", "text": "We have a very positive review of the Flamingo, I guess everyone has their own experience. We arrived Oct 29 to Nov 3rd and checked in at the Airport. We had requested an upgrade if possible ahead of time since we were celebrating our 25th anniversary. At the airport we were told there were no strip view/non smoking rooms avail that day but they could offer us the exective level 28th floor room that was renovated and larger than usual but looked at the garden. We paid alittle extra nightly for this and were not disappointed. We arrived at our room to find a beautiful room, new furniture..floor to ceiling windows separate couch chair and coffee table at the window. My wife also had a dressing table and chair that she used. We had a Coffee Maker, blow dryer, amenities replenished everyday. On our first night we even were surprised to have turn down service when we returned late at night with chocolates on our pillow. Also and newspaper each morning. The last night we were there we decided to try the buffet and couldn't beleive the seafood selection, and almost any kind of meat, sushi, vegetables available. My wife and I have nothing bad to say about the food infact we are real critics of buffets and are cautious before recommending any of them if they aren't worthy. Another thing we also liked were the sub sandwiches and chips sold on your way out to the pool. We had these for lunch on 3 different days, fresh meats piled high and selling for $7 each. We usually split one. We give the Flamingo a big thumbs up and will stay here again and again.", "user": "luvthesun", "date": "November 5, 2006", "id": 6060317}, {"rating": 4.0, "title": "FANTASTIC LOCATION", "text": "Loved the Flamingo Hotel a fabulous location and the tour bus stops immediately outside. We were on the 28th floor and the views were fantastic and there was never a wait for the lifts. The staff were more than helpful only fault is the breakfast in the restaurant was not to good there are better places to eat but overall would stay there again..", "user": "vatican", "date": "November 4, 2006", "id": 6056433}, {"rating": 4.0, "title": "Married at the Flamingo -- Spectacular!!!", "text": "We stayed at the Flamingo Oct 14-20th and were married there on the 16th. We checked in at the airport which was pretty quick and easy, and I recommend, because we often saw long lines at check in at the hotel. The ONLY bad experience we had was when we first got there, we were told where the elevators were, took them up, and figured...\"Hey we're almost there!\". Wrong. We ended up walking down about 10 verrrry long corriders while hauling about 150 pounds in luggage (yes Continental weighed it and charged us for it) after a verrrry long flight and long rental car experience. SO, make sure you find the correct elevator bank, because we sure didn't. It will be a life saver. After that now laughable experience, everything was absolutely perfect. We had a mini-suite on the top floor that was huge, clean, and had a magnificent view of the pool/garden area. Floor to ceiling windows, couch, 4 chairs, good size bathroom, and LOTS of open space. Didn't have a fridge but we rented one for $10 a day, and they brough it up within 20 minutes of me calling for it. Had a welcome note from the wedding staff awaiting us and with further wedding day instructions. Wedding staff were extremely friendly and accomodating. Wedding cermony was absolutely perfect...we were married in the indoor chapel, very private and intimate as we hoped. Photos were waaay beyond our expectations (although we did shell out some good money to get all those great photos). We had our reception dinner at Ventuno...excellent!! Great food, better service. We were a little hesitant at first after dealing with them via phone/email, they seemed a little unorganized and unreliable, but boy did they come through in the clutch and provide great service (cake was one of the best i've ever had). Room service was great (try the Juevos Rancheros for breakfast). Champagne bruch at Paradise Garden Buffet was really good...food was decent, but the view and ambience were great. Pool was as good as expected. Try the jacuzzi's that are kind of isolated behind main pool, they were so relaxing. Gambling was good, plenty of cocktail waitresses to bring strong drinks, even when you're playing pennies and nickels. Margaritaville was as good as expected (try the flavored shots). We would recommend any young couples stay here (we're in our late 20's), even more if you're looking for a great wedding destination. We would do it all over again in a heartbeat. Plus, like everybody else says, you damn sure can't beat the location, location, location.", "user": "scottyriggs99", "date": "November 4, 2006", "id": 6053906}, {"rating": 1.0, "title": "Dump>>>> Beware do not stay here>>", "text": "This has to be the worst hotel I have ever stayed in.. the rooms have had no updating in 10 years, even the bedding is terrible. The furniture was banged up, the beds were uncomfortable and the bathroom was one step up from you find in 3rd world country. Also, the air in the hotel, even on a non-smoking room is so bad, I had a sore throat from the poor ventilation. My view was the roof of the lower building with garbage sitting on it. Don't bother staying here, stay off the strip if price is a concern or sleep in your car... I probably will be cleaner.", "user": "Mssnash", "date": "November 2, 2006", "id": 6045655}, {"rating": 3.0, "title": "Enjoyed the Flamingo", "text": "Our third trip to Vegas this year and our first time at the Flamingo. We enjoyed the hotel; was just fine for the money. Staff was very courteous and helpful and we had no problems at all. Restaurant was great~~good food and good service. Always love staying mid-Strip and never get tired of the people, music, lights ~~ everything is just fun fun fun ! It was extremely busy and so there were times when it took a bit of time to find slot machines side by side so my husband and myself could sit together. The \"Drink Girls\" came around often and were courteous! All in All .. great hotel if you don't want to spend a ton of money (as most of us spend little time in the room anyway).", "user": "STUCKONSALTSPRING", "date": "October 31, 2006", "id": 6034614}, {"rating": 4.0, "title": "Loved the Flamingo", "text": "Having Seen the Flamingo mentioned on a TV program we booked to stay here during our west coast tour of America. We were not disappointed. We were able to check in and out using a machine which was really quick and convenient. Our room although a long walk from reception was large and clean with nice big windows. The location of the Flamingo is a real bonus, right on the strip in the middle of everything. The buffet although extra was huge with lots of choice. Parking was free and easy. Our favourite part of the Flamingo was the pool, which was a nice place to get over the night before, although we were not keen on the animals being kept there as a tourist attraction. That goes for Las Vegas in general though, particularly the lions and tigers in some of the hotels. Anyway I am digressing. We would recommend the Flamingo to anyone visiting Las Vegas and would definitely stay here again.", "user": "happymeghappy", "date": "November 9, 2006", "id": 6090198}, {"rating": 3.0, "title": "no longer a great value", "text": "We checked in at the airport for a five night stay on October 26th. This is our third stay at Flamingo in the last twelve months. Free upgrades seem to be a thing of the past as this time, they wanted $20 extra per night for a view of the strip.", "user": "happytails", "date": "November 8, 2006", "id": 6088014}, {"rating": 4.0, "title": "The Flamingo was great", "text": "Never noticed construction crews or noise. Upon entering the room we found an ashtray full of cigarettes, dirty soap in bathroom, dirty glasses & trash in the garbage cans. this was in spite of the clean sheets and otherwise clean-looking room. Maids promptly came up to remedy the situation and apologized the 30 minutes they were cleaning. Our room was smaller than the last two times and the furniture was a bit more 80s than 90s, but the view of caesar's was nice.", "user": "conniehh", "date": "November 8, 2006", "id": 6087012}, {"rating": 3.0, "title": "Meh...", "text": "Noticed the hotel was a bit shabbier overall than in May or last October.", "user": "GeorgiePeach", "date": "November 6, 2006", "id": 6078946}, {"rating": 4.0, "title": "The most comfortable bed of our recent trip to the USA", "text": "As always, Java Coast by the pool serves up healthy fresh food and we took advantage of the convenience and location.", "user": "Chris C", "date": "November 5, 2006", "id": 6060456}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We choose to stay at the Flamingo after staying off the Strip at the Gold Coast Casino last year(which was FANTANTIC). For whatever reason my cousin who booked the trip and got an good rate of $70 a night was not made aware of the $100 per night damage deposit. We are not clueless and have paid deposits at other hotels but never way more the the actual room cost or at least paid a flat rate. Luckily we had a very nice clerk (Benjamin)who only charged us a straight $100 for the entire stay. It did kind of left a negative feeling for the rest of the trip, but regardless we moved on.", "title": "It was 50/50", "helpfulness": 3, "user": "Cfire4", "date": "November 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 10730303, "likes": {"liked": "— Location Location Location", "disliked": "— Bathroom and somewhat hidden costs"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Our room was Deluxe Queen in the north tower. The room itself was clean, average... 3 star. The one problem was the shower. It had the stream of a cheap garden hose and the soap was like chalk. We spent an afternoon at the pool and I do agree with other reviewers that is does have the light scent of the zoo. We ate breakfast everyday at the Tropical Breeze cafe(24hr) the prices and the quality of the food were good. Margaritaville is a definate must. Between the food, drinks, atmosphere and the crazy erupting Volcano it was a good time.", "title": "The Flamingo is great for the price!", "helpfulness": 3, "user": "TheTravelersFour", "date": "November 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10716806, "likes": {"liked": "— The GO rooms are fun as they are different ( high tech)."}}, {"rating": 2.0, "title": "You can do better for theprice", "text": "Overall I would not stay here again, but if you are looking for a decent stay on the strip for not to much $$$ the Flamingo is the best bet. Location is definately the number one reason to stay here.", "helpfulness": 1, "user": "57Lulu", "date": "November 9, 2007", "id": 10710147}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed at the Flaming for two nights. We stayed in one of their GO rooms with a view of the strip. We have no complaints and will stay there again. We have been to Vegas numerous times and the staff at the Flamingo are by far the friendliest and the most accommodating staff we have incurred to date.", "title": "Great Time, Great Location", "helpfulness": 2, "user": "aemma5478", "date": "November 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10677220, "likes": {"liked": "— It was right in the middle of the strip", "disliked": "— The Vantuno restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The only complaint we have with the Flamingo is they allow young women to meet their male \"escorts\" there. On our last night in Vegas, my husband was a little uncomfortable walking by the back bar, where they like to hang out, as they were approaching male customers as they walked by.", "title": "Awesome stay", "helpfulness": 4, "user": "UMgirl", "date": "November 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10599594, "likes": {"liked": "— The room and staff", "disliked": "— Didn't have a view of the strip"}}, {"rating": 1.0, "title": "Take pause, be advised", "text": "Think you reserved a room to meet your specifications. Think again. Rooms are dolled out on a first come first serve basis. Your room preferences are regarded as only that - preferences. And all those reviews about the smells in the pool area. They're true -- it smells like a zoo. Want a clean room? Don't come here: dirty carpets, mould around the shower, feces on the toilet, littered hallways, filthy elevators. Also, bathtub didn't drain and toilet didn't flush properly. Bed bugs? I don't know but I had bites of some sort in the morning. And, how about internet service at $13.00 a day. No kidding! Even at that I couldn't access it due to problems with the hotel's server. After promising to come to fix it, no one ever showed up.", "helpfulness": 7, "user": "lv2travel2gether", "date": "October 29, 2007", "id": 10431179}, {"rating": 4.0, "title": "Great hotel", "text": "So, take pause and be advised. Enjoy your holiday.", "helpfulness": 4, "user": "philpics", "date": "October 28, 2007", "id": 10391285}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "We stayed as a family of nine in four 'Go' rooms at the time a supplement of $25 was applicable but worth every penny. Directly opposite Ceasars Palace and views of 'The Strip' were magnificent. Very quiet, very comfortable and a resort within itself. Sun at this time of the year is only directly on the pool between 10am and 2pm. Be prepared for BIG and at times frenetic and transient. You won't get Ritz style service but centrally located and good value for money. Stay Monday to Thursday for the best deals. ( It wasn't mentioned when booked that the view of the 'Strip' would be extra). So maybe better to book direct.", "title": "Perfect stay on the strip", "helpfulness": 3, "user": "IndyStuart", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10335763, "likes": {"liked": "— location", "disliked": "— pink"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We had a party of 14 adults in 7 rooms (5 GO rooms and 2 Std) for 3 nights. Our check-in went very smooth for Saturday 1pm. A couple rooms ready and the others were no later than 4pm. My fiance' and I along with two other couples were given rooms on the 25th floor. Our room overlooked the Bellagio fountains and was a very clean GO room. We ate at the buffet one morning and had lunch in the cafe one day. Both experiences were fine. The food and service were right what we expected for the price. We held court each evening at the Island Bar in the lobby area near the shops. Perfect small bar that fit our group of Buffet fans to a T. Did I mention that the hotel threw a street party on the north side of the hotel all day Sat 10/20 with Tommy Rocker and the Conched Out Band doing a live 6 hour show. Over the top good promotion! Last but certainly not least I'd like to say that the staff at this hotel were very warm, friendly and helpful. We had a lot of people in our group that are 'picky' when it comes to lodging etc.", "title": "Good Stay In A Go Room", "helpfulness": 5, "user": "PeterFraser", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10323746, "likes": {"liked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I never heard of one single complaint from any oif our 7 couples.", "title": "Fair room for a fair price", "helpfulness": 6, "user": "MadokaRN", "date": "October 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 10291662, "likes": {"liked": "— Location and pool", "disliked": "— worn out"}}, {"rating": 4.0, "title": "Great Value", "text": "My sister and I stayed at the Flamingo in early May for two nights on our way to the Grand Canyon. The front desk was terrific and extremely accomodating. We had gotten a great AAA rate and on our arrival asked for an upgraded room so we could see the Bellagio fountains. We were on the 21st floor directly across from Caesar's Palace Fountains and the Bellagio to the left. Great full length windows were well worth the little extra for the view both during the day and it was magnificent at night.", "helpfulness": 8, "user": "montmemories", "date": "May 13, 2006", "id": 5066409}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "The room was nice, clean, and the best part is location, location, location. It's right in the heart of all the more expensive hotels. Easy walking distance to the Bellagio, Caesar's, Venetian, Mirage, Treasure Island, etc. Casino was nice but a little smokey....newer hotels have high ceilings and better circulation.", "title": "Run away!", "helpfulness": 16, "user": "dhardin", "date": "May 13, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 5065922}, {"rating": 5.0, "title": "Great value, great location.", "text": "Flamingo grounds were very nice. Parking easy. All in all would definitely recommend.", "helpfulness": 23, "user": "jsmack83", "date": "May 13, 2006", "id": 5065180}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Don't miss the \"O\" show at the Bellagio. Fantastic!! Need to book ASAP however.", "title": "Great hotel", "helpfulness": 12, "user": "David50", "date": "May 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5064977}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Out of a 6-night stay, we had 3 maintenance problems, no housekeeping the first day we were there, and terrible service when we placed a request. There was blood on the comforter when we arrived, and it took multiple phone calls to get it replaced. It took multiple phone calls to get anything done. Several of the elevators were out of order for all or part of our stay. Seems like maintenance is not a big priority for the Flamingo.", "title": "Good value, superb location.", "helpfulness": 12, "user": "HJH-MK", "date": "May 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5057256}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 3.5, "variance": {"poor": 1346, "average": 2281, "very good": 3364, "terrible": 1004, "excellent": 1470}, "aka": "Flamingo Las Vegas Hotel", "slim_ranking": 0.492592592593, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "From the newly designed GO Rooms to a wealth of dining and entertainment choices, Flamingo proves \"fabulous is forever.\" With classic Las Vegas style and flair, it continues to be one of the Strip’s most-visited resort destinations. Outside, guests enjoy acres of waterfalls, winding pools and lush foliage at the Lagoon Pool and Wildlife Habitat. For adults, the GO Pool is the destination for an afternoon of relaxation. Inside, enjoy performances ranging star siblings Donny & Marie to comedians George Wallace and Vinnie Favorito. Afternoon frivolity is found at Nathan Burton’s Comedy Magic while adult fun is staged nightly at X Burlesque, the Topless Review. Diners can enjoy go tropical at Jimmy Buffett’s Margaritaville or simply go all out at the Paradise Garden Buffet. Flamingo is also the home of the world's first Margaritaville Casino, a Parrothead paradise straight out of a Jimmy Buffett album. For those on the go, the new Flamingo Food Court hosts a variety of eateries from the all-American menu at Johnny Rockets to a taste of the Orient at Pan Asian Express."}