{"user_rating": 4.5, "review_count": 4147, "name": "Floridays Resort Orlando", "reviews": [{"rating": 1.0, "title": "Floridays not so consumer oriented!", "text": "After my last visit to Floridays, I filled out the survey they emailed. Based on my comments the General Manager Rod OConner emailed & called me. He seemed so concerned regarding my negative comments. He offered me a gift certificate for 3day/2night stay. Surprise they wouldn't accept it! Completely booked! Not so, I checked their web site,(beforehand), they had availability @ a very resonable rate of $114.08. It was a week day rate. Not a weekend. NOPE...resort full. I feel the certificate is a scam just to quiet a guest who wasn't happy with the resort. I called the resort numerous times trying to use the certificate, leaving messages for the guest services manager, Elizabeth & faxing the certificate. Finally called the front desk & Wayne walked down to her office & transfered my call. Really to be told \"NO\". I feel they were ignoring my calls. We can afford to stay anywhere & there are much better resorts in the area. We are still going away but definately not staying @ Floidays!", "helpfulness": 11, "user": "mssee", "date": "August 8, 2012", "id": 136685597}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I love the resort! Great staff, great facilities. We booked 2 rooms for a family of 7, but when we got there we realized we could had booked just one and it would accommodate very comfortably us all. We stayed at building F, very quiet and nice.", "title": "Amazing staying!!", "user": "Khadine F", "date": "August 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136648967}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I would definitely go back there!", "title": "A-mazing! Can't stop going back!", "helpfulness": 1, "user": "Freefablaus", "date": "August 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136603391}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This resort along with its staff is just amazing, we're going back for our 5th year in a row in nov, we liked it that much the first two years that my husband and I got married there the 3rd year. The food is always nice, the staff are friendly, you don't get shoved out when it's time to go. We like the fact you get free shuttles to the parks which means we don't feel like we have to hire a car. You have a supermarket around the corner along with an outlet mall and other shops and food places. It's lovely to have two pools and the condo's are wonderful. The space you have in them is great, we've never stayed anywhere so spacious before and the kitchen area is soooo big and nice to have while self catering! We love it that much were even thinking of buying one of the apartments! Defiantly situated on a better part of international drive :D", "title": "Excellent", "helpfulness": 1, "user": "rdillon999", "date": "August 8, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 136554038}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Will be returning again and again :)", "title": "Good....but not the best.", "helpfulness": 6, "user": "PaoloCarlucci", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 136526127}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed for 5 nights and had a wonderful relaxing time. The kids played in the pool and some times we gave them money to play the game machines.", "title": "A relaxing place to be", "user": "BigH Z", "date": "August 6, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 136431735}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed in a three bedroom and it was quite comfortable.", "title": "Great stay!", "user": "IrishEyes928", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136397093}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "There are five buildings and each have 6 floors.", "title": "Only a brief one night stay!", "user": "nodoe1110", "date": "August 6, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 136395566}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Food shopping is around the corner with stores in that plaza.", "title": "The Best Family Resort I've Been to in Orlando Fl.", "user": "tammy g", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136371004}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Of course a car is needed to drive along International Drive to get to attractions and tons of stores and restaurants. Approx 15 minutes from hotel.", "title": "It very good??? for the price", "helpfulness": 1, "user": "Cesario0", "date": "August 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136350730}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "First, let me start by saying that my family stayed at the adjacent property (The Fountains) 2 years ago and absolutely loved it. I recall construction and admiring the Floridays property and so when I came back at the end of July 2012 we decided to stay there (especially given The Fountains was an extra $100 night). Overall, the hotel met our needs. We are a family of four and our 2 children (10 & 8) wanted a place where we had the amenities like home (kitchen, in-room washer dryer, separate bedrooms, etc.) plus pools, etc. to use whenever needed. We stayed for a week. The suite was well decorated but admittedly there were some issues with cleanliness. For starters, the decor (plants, bathroom/light fixtures, etc.) was notably covered with dust (my best estimate is that they hadn't been wiped in weeks) and when we reached for the frying pan the first night (it was stored in the oven) it was filled with grease (presumably from the previous tenant) that we had to immediately dump in the sink and clean in order to cook food via our late arrival. There are currently 6 buildings on the premises and we were housed in the last one (F) that literally took us 3 minutes to drive to after entering the premises given the maze required to get there and the MANY speed bumps throughout. Finally,the oven in our room heated unsatisfactorily (wanted to enjoy 2 pizzas late at night after returning from the parks) and the in-room safe indicated low battery and was inoperable. Mind you, the customer service we did use was GREAT, but we really don't like people coming in and out of our room for safety/security reasons and hence we just endured these 2 inconveniences. The negatives aside, I think this is a fine hotel for families. It's location on south I-Drive is great - it is the part that is not as highly commercialized as properties north of the convention center. It's an easy commute to groceries (Publix is less than a 1/4 mile away - albeit it closes at 10 if you are arriving to the area late or coming back from the parks late - then there is a 7-eleven and Walgreens up the road) and honestly its location avoids much of the heavier traffic areas in Orlando. The grounds are well maintained and safe. It has one main pool and a smaller less frequented one in the back that are nice - but no where as big/nice as the Fountains next door(although on the weekends they have a woman who entertains families and kids at the pool with games and prizes and she was a VERY enjoyable aspect of our vacation). The concierge was helpful although I was a bit put off that I had to spend $5 to use their business center computer for a few minutes so that I could print out my family's boarding pass. WiFi was good in the room and around the premises (MUCH better than the Fountains was!). If you are looking for something that is conveniently close to the Convention Center, Sea World (5 min) and the Disney parks (15 min) and Universal (20 min or so depending on I-4 traffic), and that has the amenities of home without breaking the bank, I would recommend the Floridays. It was ranked #1 by TripAdvisor at the time of my booking. It does deserve high marks, but I am surprised by how high its ranking is among the competitive properties/hundreds of hotels in the area (if I could afford it and needed to come to FL again, I would probably investigate the Fountains first).", "title": "Very good - depending on your needs & plans", "helpfulness": 3, "user": "g8rpsych", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136337724}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed in a 2 bedroom suite with full kitchen, 2 bathrooms, jacuzzi and shower in the master bedroom and balcony, sofa bed in living room. The kitchen had everything you could possibly need including a blender, coffee maker etc. We had an amazing stay at a price that did not break the bank. Service is outstanding. Jessie the concierge is amazing and very helpful. The rooms are very clean. We take a vacation every year with the kids and this was far and away the best hotel we have stayed in in terms of amenities, cleanliness and affordability. Will definitely stay there again. They have a shuttle that goes to the theme parks but we had a rental car through expedia. Beds were very comfortable. Pool is very clean and did not appear too crowded. They do have a cafe - selection for breakfast was somewhat limited but we usually prefer to cook while on vacation so no problem. Wal Mart not far away from hotel. There is a publix and walgreens across the street for grocery shopping etc. Hotel about 15 mins from disney.", "title": "had a wonderful stay 2 adults and 3 children", "helpfulness": 2, "user": "makonkary", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136251568}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This was our second stay at Floridays, and know we will rebook for future trips to the Orlando area. We were traveling with adult children and small grandchildren. They 3 bedrooms and 2 baths provided us all the comfort we needed. The hotel is close to a Publix and a CVS so we were able to save money by eating some meals in the room. They provided us a pack and play and high chair at no additional cost. The young kids loved the pool because of the zero entrance and fun water play. We actually ordered room service a couple of times and it was good with a reasonable price.", "title": "A Great Experience and Great For The Entire Family", "helpfulness": 2, "user": "Barb R", "date": "August 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 136177727}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My first time in Orlando and i couldn't choose a better hotel, the service was great the rooms were clean and the service was excellent,staff was extremely friendly and helpful, next time in disney i will stay in floridays inn..", "title": "Outstanding family vacation, Great service.", "helpfulness": 1, "user": "oscar l", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136176429}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I am amidst a 9 day stay at The Floridays Resort Orlando. We have a 3 bedroom villa in the \"B\" Building, which over looks the main pool. We are a family of 5 with a child who has significant special needs.", "title": "Wonderful resort, conference center, and staff!", "helpfulness": 1, "user": "NebraskaShannon", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136169707}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "First trip to Florida - 2 adults and 2 children. Suites were spacious. Location was very good. The children loved the pool at the end of a long, hot day. Good value for money and highly recommended. We would definitely stay again.", "title": "Fabulous Floridays", "user": "MadJack2012", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136514207}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed for 7 nights and had a great time. The room was awesome and spacious. The pool was a bit small for the size of the hotel and was quit crowded at times. The pool bar was excellent and the food is very good. The only negative comment is that we thought by staying here we would recieve quick que tickets for Sea World. This is not the case. The advertisement online is decieving so if you think you will be getting this you won't be.", "title": "Great Resort", "helpfulness": 2, "user": "Glenn K", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136503376}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We (myself husband and two children aged 16 and 21) have recently returned from a two week stay at Floridays. My son had booked this for my husband's 50th birthday celebrations. First impressions were disappointing, room a bit dark and being on level two discovered a balcony with a very high wall and absolutely covered in bugs, I was afraid to open the door to step outside.no view whatsoever. The front bedroom heard every noise of people coming out of the elevator.", "title": "Mixed views", "helpfulness": 2, "user": "Logues595", "date": "August 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 136475242}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Myself and our son went to reception requesting a change of room and was told there was no other rooms available but then managed to find a room only turning out to be the exact same room only on a different building, again a walled balcony and right beside the elevator. My son explained that we had booked this for his father’s 50th birthday and was extremely disappointed. No additional surprises for 50th birthday as mentioned on previous reviews, thought something could have been done to acknowledge celebration as has happened on previous hotels we would have stayed in. We then requested even a change of room for the following day even only to be informed that there would be an additional charge for this, stating that we thought we had paid enough we would not be willing to pay out any more. We decided that we had to make the most of our holiday and not let this spoil it.", "title": "A Great Place to stay in Orlando", "user": "findnsecure", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136444839}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "The cleanliness of the room left a lot to be desired with dust thick on top of the fridge and along the head boards and spiders webs on the lights above the dining table.", "title": "Excellent Resort -- Cleaning Staff not so much!", "helpfulness": 1, "user": "CrinaJ", "date": "August 7, 2012", "detail_rating": {"cleanliness": 1.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136441627}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 77, "average": 235, "very good": 913, "terrible": 37, "excellent": 2885}, "aka": "Floridays Resort Orlando Hotel Orlando", "slim_ranking": 0.0273556231003, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Named TripAdvisor's #1 Family hotel in the U.S. in 2013, Floridays Resort Orlando is a luxury, all-suite condominium-style Orlando resort, located in the heart of the action near Lake Buena Vista on International Drive, just a few miles from attractions and steps away from sensational shopping and dining. Our spacious 2- and 3-Bedroom Grand Suites are perfect for families looking for spacious accommodations, with 2 full baths, master suite with en suite bathroom, full kitchen (for a self-catering experience), dining and living room area, and balcony or patio. Scheduled theme park shuttles included. WiFi throughout the property and in every suite. Consistently in the top 5 on TripAdvisor, the guest experience is unparalleled in the Orlando hotel market."}