{"user_rating": 3.5, "review_count": 174, "name": "Flower Garden Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2005", "text": "For a recent 4 day stay in Rome we booked the Flower Garden Hotel. The location was great, but not much else was. The first room we were given was the smallest hotel room I had ever seen. The staff gave us another (larger) room, but the beds were very uncomfortable and the room was shabby. The staff was polite, and the breakfast was ok, but on the whole, this place has nothing special to recommend it.", "title": "Did not like the Flower Garden", "helpfulness": 4, "user": "jsrmck", "date": "November 1, 2005", "detail_rating": {"value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4079840}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "Hotel has a great location, convenient to train station, buses, restaurants. Note: A short walk down the street is a small supermarket that is great for inexpensive wines, beer, food, great deli counter. Found the Flower Garden breakfast to be more than adequate to get you through the first half of the day. Room was very clean, it was small, but we used it only as a sleeper. One problem I did have was the noise from the hall which easily comes through the thin walls. If not for ignorant, noisy guests the thin wall noise problem would be minimized. I found the staff to be smiling and more than willing to help in any way they could. My ultimate measure of value is if I feel I get what I paid for, at the Flower Garden I got what I paid for, a solid 3 star. I was very satisfied!", "title": "solid 3 stars", "helpfulness": 10, "user": "tony838", "date": "March 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4579136}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "We weren't expecting much from the Flower Garden hotel, and we weren't disappointed. It's true that it's clean and the staff are friendly, so that's great. The room was teensy weensy, but had most of what we needed. We were happy to have our own bathroom, but after trying to maneuver around in the world's tiniest shower stall for three days, we were relieved to move on! It's true about the huge, fluffy towels, though - those were super. The breakfast was pretty unmemorable - it had one type of cereal, hard-boiled eggs, rolls/croissants and cheese or jam spreads. I think that was it. Same every day. We thought the location was great, though - close to Termini, but also walking distance to all the big sites. We never took public transport; just walked six or seven hours a day - it was fantastic. And the FG provided a clean, safe place to lay our weary heads at the end of the day, which is really all we needed.", "title": "Hmmm....it was okay", "helpfulness": 9, "user": "TRIPTravelTailor", "date": "February 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4472733}, {"rating": 3.0, "title": "A budget hotel as expected but great location", "text": "The Flower Garden is everything one would expect from a budget hotel. For the price we paid we expected a clean room, working bathroom, a convenient location, and received exactly that. The hotel is within just a short walking distance from the Rome Termini train station where my bf and I were able to hop on a train to Florence just for the day. If you are looking for a luxurious hotel with all the amenities then the Flower Garden would not be your cup of tea. For those adventurous travelers who expect little more than a clean place to sleep for the night at a bargain price, then the Flower Garden may just work for you.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 15, 2006", "id": 4461787}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "We have just returned from a 6 day break at the Flower Garden in Central Rome.We had heard a few things about the hotel on this site prior to our visit and were wary!", "title": "Another true review", "helpfulness": 7, "user": "MikeJHUD", "date": "January 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4372207}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "Breakfast is an average continental spread with bread, cheeses, fruit, danish pastries, boiled eggs etc. To be honest Ive had worse B&Bs in the UK!", "title": "Great Location", "helpfulness": 7, "user": "ValCart", "date": "November 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4105524}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 26, "average": 58, "very good": 51, "terrible": 12, "excellent": 27}, "aka": "Flower Garden Rome", "slim_ranking": 0.417322834646}