{"user_rating": 3.5, "review_count": 108, "name": "Footprints", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Footprints could be a great resort and my friend assures me it was on their first stay a few fears ago but now unfortunately they need to lift their game. The first thing i noticed as we approached our 2 x1 shack were all the cobwebs. There was a pile of dirty sheets and towels dumped on the doorstep waiting for housekeeping, not a good look. The interior was spacious enough modern but not clean enough for my liking.When we arrived the bathroom window was open allowing flying insects(flies seem to be a huge problem perhaps due to the bins?) to enter as there was no screen. The airconditioner worked well although the whole place could have done with a good dust as the fans etc were covered in it.As other people have mentioned there is a problem with the barbeques being dirty .the general housekeeping is lacking I doubt the bathrooms have seen bleach for a while but to be fair overall the accomodation could be great with a few of these problems rectified. The staff were friendly and tried very hard to please . I must agree the Cafe food was very average and the corner store overpriced.The kitchen also lacks an oven but has a handy little dishwasher and good washer/dryer in the laundry. Make sure you pack your own pillow , they sound as if they are filled with plastic.", "title": "beach shack will i be back?", "helpfulness": 1, "user": "SunnyPerth_10", "date": "January 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 122654357}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "On the positive the resort has a nice family atmosphere I enjoyed the pool area and I'm hoping that they will take a little notice of the online comments and clean up a little as we will probaly return next year.", "title": "\"A Dirty Room\"", "user": "lisag2012", "date": "January 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 122511149}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We returned for a second time to Footprints, we didnt think much of our 2 incidents on our first trip (cochroach on our cafe pizza and a bbq that wouldnt work) as we put it down to bad luck. However we returned for 2 nights over new year to be suprised with the hygience and condition of the accomadation. We first noticed out toilet was not cleaned, urine remained on the rim of the toilet from past guests. There was broken glass all over the patio deck as well as a large number of smoke butts, we have 3 young children so this was of concern to us. We opened the dishwasher to find it full of smelly and dirty dishes. The entire unit had a very strong tobaco smell. We found numerous smoke butts and smokes under the couch. We made a complaint to management and the best they could do was a $50 discount on one night which we did not find acceptable. There were cobwebs over everything and the bbq was so dirty it was unable to be used. I am looking to take this further but feel as though it will go unheard as it lies with management and they seem to be the problem.", "title": "Lovely spot,very relaxing", "helpfulness": 2, "user": "Our_USA_trip", "date": "December 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121940055}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Our second visit here in a Townhouse.We find it very quiet and relaxing.Its just far enough away from Perth to make you feel your on a holiday.The beds are fantastic,the unit big & comfortable enough for everyone.The restaurant has improved immensely no doubt helped by Jack of all trades Dave who always seems to be around the place.Drinks are very affordable and the beach a short stroll away. Only a few negatives , there is never enough washing up liquid and rubbish bags.The kitchen needs a few extra essentials and the TVs are a bit cheap but still watchable.", "title": "Great resort that with a little fine tuning could be excellent.", "user": "SunandSurf82", "date": "December 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121936827}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Yes there are spiders webs and kangaroo poo around the place but this is a remote town in a Fauna setting and wildlife abounds. This is what makes it so great. You feel like your in a old beach shack town but staying in lovely units.We will definitely be back!", "title": "Fantastic Getaway", "user": "my3girls68", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121874240}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Great Beach shacks positioned about 800metres from Preston Beach.", "title": "Great beach shacks near the beach with great facilities and relaxed feel. Leave the caravan at home and ENJOY!!!!!", "helpfulness": 1, "user": "zedmeister", "date": "March 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 125969410}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "", "title": "Great place to stay when you want to get away from it all", "helpfulness": 1, "user": "Top_Gun_H6", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124947515}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "The shacks are set in a garden setting and are mostly double story with a room downstairs featuring two double bunks and a bedroom upstairs with a queen size bedroom, with adjacent bathroom. The downstairs also has a toilet within the laundry area, which has a washing machine/dryer. The shacks have a kitchen with hotplate and microwave but no oven. There is also a full size fridge freezer and a BBQ on the back balcony which faces into a grassed landscaped area.", "title": "Beautiful", "user": "Micoverheinz", "date": "February 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 124942643}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "", "title": "Back Again", "user": "engss", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124468653}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "There is a swimming pool with cafe on site with reasonable prices plus a petrol station with grog shop and snacks out near the front of the property.", "title": "Needs maintenance", "helpfulness": 2, "user": "Patricia246", "date": "February 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124466388}, {"rating": 4.0, "title": "Will be back", "text": "Spent a night with hubby and two kids in a townhouse... and loved it. The townhouse was roomy, spotless, linen fresh and the showers hot. The kids loved the pool. The resort was peaceful and family friendly. Bubbly helpful staff made the stay even more enjoyable. Wish we could have stayed longer!!", "user": "sazzle73", "date": "February 12, 2012", "id": 124464683}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Second stay at the Resort. Cleanliness still not quite up to the standard one would expect. Quite a few basic utensils and crockery were missing but staff quickly attended to these shortcomings. With the hot weather, the airconditioning located in the Living area did not penetrate into the upper bedroom and made for sleeping discomfort.", "title": "Can Still Improve", "user": "emem", "date": "February 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 124324060}, {"rating": 4.0, "title": "We will be back :-)", "text": "Very good location and setting and still offerring excellent potential if managed more professionally.", "helpfulness": 1, "user": "Robyn H", "date": "January 22, 2012", "id": 123470568}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I guess the problem lies with the fact that no competition exists from other resorts in the vicinity", "title": "Don't stay here!", "helpfulness": 1, "user": "eyes1976", "date": "January 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 123290936}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We just spent the weekend at Footprints with friends and had such a good time. We found the staff to be friendly and helpful at all times. Our kids had a ball playing in the pool and getting around on their scooters and having fun on the tennis courts. We were happy with the accommodation as the rooms were clean and everything in working order. Our six year old had such a good time that she wanted to stay another night, so yes we will be back and next time stay a little longer. :-)", "title": "\"biggest whinges to biggest appreciators\"", "helpfulness": 2, "user": "gonz350", "date": "January 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 122868472}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "First thoughts of the resort were OK, nice relaxing place, with relaxed atmosphere. Last thoughts however were the complete opposite. Staff use the pool area and bar as their own personal party area once the pool closes for visitors. As the pool is very close to the beach hut, all this is in full sight (and hearing) of customers staying near the pool. On this particular night the staff party started at 7pm, and gradually more and more staff turned up, drinking, partying, playing loud music until 2am in the morning without a care for the people staying in the resort at the time. We were kept awake all night by Michael jackson songs on repeat at full volume. Even worse was when we went to the pool for a swim in the morning it looked no one had bothered to clean up so the pool area was littered with empty glasses, bottles and cigarrette butts strewn acorss the ppol area, obviusly while the workers nursed their sore heads. This has to be the most unprofessional managment of a resort I have come across. Hopefully for the people invested in this place the drinks weren't \"on the house\" for staff becuase there was certainly a lot of drinks consumed at the pool bar. Maybe thats why they supply to each beach shack one packet of washing up liquid and cut scourers in half to last you for a week, so they can invest their profit over the bar rather than for visitors. A word to potential investors....beware!!!!", "title": "Unprofessional Run Resort", "helpfulness": 1, "user": "Paul M", "date": "December 15, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 121754133}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I went to Footprints last weekend, the resort was beautiful, very relaxing. The gardens were exceptional and it was nice to relax at the pool and get some lunch at the cafe. I had my niece with me, she was beside herself spending most of the day in the pool and mingling with other children staying at the resort.", "title": "Great Escape Location", "user": "Chris D", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121175047}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The beach was a short walk away and it was nice to go for a nature walk through the golf coarse and along Preston Lake. There were kangaroos laying around everywhere and wild flowers and trees were out in bloom.", "title": "Great stay in a great location", "helpfulness": 1, "user": "davo292", "date": "November 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120734379}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "If you are looking for a cheap getaway which is in easy reach of Perth I highly recommend it. It only took me an hour to get there as I live in the souther suburbs and the beachshacks were very neat and tidy.", "title": "What a pleasure", "user": "Charlie T", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120684922}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "As a family of four we stayed two nights in a 2 bedroom 2 bathroom townhouse. Accommodation had everything that we required. Pool was lovely and well kept. Short walk to the beach. Lovely relaxing place. We will definitely return!", "title": "Brilliant facility", "helpfulness": 1, "user": "Nola B", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120607469}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Preston Beach"}, "stars": 4, "variance": {"poor": 6, "average": 20, "very good": 40, "terrible": 10, "excellent": 32}, "slim_ranking": 1.0}