{"user_rating": 3.5, "review_count": 300, "name": "Fort Rajwada", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed her for two nights, staff very helpful, food good, layout and set up of grounds very pleasant. We were given a darker room on the ground floor, but asked to be moved to one with good daylight which they did. Beds hard, like so many other Indian hotels. Their wireless would not work on my iPad.", "title": "A lovely place to stay", "user": "LesleySnz", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 152447939}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Staying in hotel for 10 days on work. The hotel is really overpriced. I have been trying to get a bottle of water. But the hotel seems to have decided to fleece us. If you have a choice, go for gateway or rangmahal. Better and cheaper", "title": "overpriced", "user": "subashjohn", "date": "February 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 152224994}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Having read a large number of previous reviews, thought this hotel might not be VfM. Quite the contrary, this is a beautiful hotel with wonderful, helpful and friendly staff and great facilities. The food and the menu were of a high standard and in our view good VfM. Yes it is cheaper in town but nowhere near as relaxed or as good. It is a couple of km out of town, but taxis are close and if you have your own driver the distance is no problem.", "title": "Lovely, friendly, relaxing hotel", "helpfulness": 1, "user": "JMikeP", "date": "February 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 151863315}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Only slight drawbacks were bedroom window looking out on to a blank wall, and slow welcome on first arrival.", "title": "An oasis in the desert", "user": "Simone W", "date": "January 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 151022608}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Highly recommended hotel that is well worth the money. Good VfM.", "title": "photos look better than actual hotel", "user": "nirajsomaiya", "date": "January 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150628853}, {"rating": 3.0, "title": "Artificial palace in the middle of the desert", "text": "It looks good when you arrive. The front part and lobby featuring haveli style, some chattris on the roof top, small squares of garden here and there and cooling fountains in the courtyards.", "helpfulness": 2, "user": "Travellersfromswitzerland", "date": "March 9, 2013", "id": 154096963}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The rooms, however, do not reflect this royal style, are a bit old and cheap with a bathroom needing visibly a refurbishment ( room 403). They are also quite dark which probably was desirable in order to protect from the summer heat. My room was big, had a big bed, sofa, a puff, chairs, safe and cattle. There was no bathrobe neither slippers which are offered only to Deluxe rooms.", "title": "Living like Royals", "user": "Sneha_996", "date": "March 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 153827317}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The air conditioning in my room was practically inexistant. There is no possibility of adjusting temperature neither the level, hence the air conditioning box was just turning the air with hardly any cooling effect. Maybe the temperature is being set centrally depending on the seasons (?). As a result, my room was staying much warmer than the outside temperature, but i could not sleep with open widows being located on the ground floor.", "title": "Lovely accomodations, friendly staff.", "user": "Barbara W", "date": "February 28, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 153380130}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Majority of the plugs in my room were not working or were in a very bad shape, but eventually you will find some good ones by pulling off lamp plugs.", "title": "Nice Hotel", "user": "Pravesh315", "date": "February 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153281435}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "There is definitelly a problem with mobile and WiFi coverage. The mobile network appears and disappears so you cannot stay connected 24 h. WiFi connection is complex with password system that you get from the reception. However, even with help of IT specialist of the hotel, we were not able to establish connection on my IPad.", "title": "excellent place ...!! with a very good staff ...!!", "user": "Kunal L", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152752883}, {"rating": 5.0, "title": "Very pretty hotel, best decorated hotel", "text": "The Fort Rajwada is the second best hotel in Jalsaimer. It is indeed well maintained for a 12 year old hotel and we enjoyed our stay here. The check in process was swift. Staff are professional. Located just 2km away from the city, this beautifully decorated hotel is situated at a nice quiet surrounding and occupy a large area. The lobby is very beautifully decorated and is most impressive when lit up at night. The welcome included a garland and a cold drink while we checked in. Our room located on the second floor face the pool. The staff especially Sushant was very helpful and friendly. There were tea making facilities and complimentary water, a bowl of fruit and cookies. The robe, slippers and toiletries provided were a nice touch. The room is spacious, clean and comfortable. There are nice paintings and decorations in the room, at the lovely bar and throughout the hotel. We enjoyed walking around to enjoy them. Breakfast the next morning consisted of a buffet spread of poha, boiled eggs, sausages, uttapam with sambhar and fresh fruits. We also had lunch at the hotel restaurant, soup was great. There is a puppet show, acrobatics and stalls selling souvenirs in the evening but the occupancy was low during our stay so there was no audience. They charge for internet and wifi.", "user": "WBin", "date": "January 24, 2013", "id": 150503412}, {"rating": 5.0, "title": "Great Hotel", "text": "We were at this hotel for 4 Days.", "user": "satishnj", "date": "January 23, 2013", "id": 150388148}, {"rating": 4.0, "title": "Nice comfortable stay", "text": "Rooms are big. Hotel lay out is great.", "user": "Arpit M", "date": "January 23, 2013", "id": 150358083}, {"rating": 4.0, "title": "Very Good Property in Jaisalmer", "text": "Wonderful staff. Food is very good. Hotel looks like Haveli/ Fort. Very good live show. Clean rooms. Away from main road. Very active place by overseas tours.", "user": "Ketandave", "date": "January 21, 2013", "id": 150156123}, {"rating": 3.0, "title": "Good Property but bad attitude of staff", "text": "The property is located just outside the main city on a link road connecting Jaisalmer with Jodhpur and Bikaner. Its closer to railway station, not more than 10 mins drive. Rooms are of decent size and adequately furnished. Food in the restaurant is good but a little overpriced, breakfast was nice.The evening program comprising some folk music and dance as well as acrobatics was nice. The hotel had minimal occupancy when we visited the place. Check-in and check-out process was short and swift. The look and feel of the whole proeprty is nice and they also have a roof-top bar where one can enjoy sunset with a couple of drinks.", "user": "shwetajindal76", "date": "January 18, 2013", "id": 149963905}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "i stayed at this hotel with my family for 3 nights.the property was as expected, the hotel had a nice restaurant, bar and a spa by the pool too. the room was a normal sized room, nothing really special about it. the biggest setback of this hotel is the attitude of Mr.Mishra, who is in charge of the reception. Mr Mishra is more interested in calculating(his profits or whatever) rather than attending to us customers. His attitude was very cold and he was not too interested in our queries. he was in charge til the evening and it was a relief to see someone else(who in fact was very professional and nice) from the evening onwards!", "title": "Decent property,unprofessional Mr. Mishra", "user": "Raj S", "date": "January 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 149723262}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Overblown architecture for what is a quite basic room and bath Service levels are good particularly in the restaurants. I was not aware that dinners (excellent buffets with great service) were part of the deal and included in the room price till an obliging steward at the resaurant drew my attention Perhaps it was my fault that I didn't pay close attention to the desk person when I was checking in. But I did find it bizarre that they insist (and staff will hound you to sign) on charging Rs 80 for a bucket of ice! Quite far out of town which is not a bad thing given you have peace and quiet.", "title": "Ok", "user": "moth123", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148902508}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The Property is located far far from the city, no navigational signs and not even known to local transport infrastructure like Taxis and Auto drivers. Place is unfortunately not appealing either externally or internally. Upkeep and maintenance seems to be totally missing. Staff untrained/ indifferent and lacks basic knowledge of the product. Front office staff seems OVER CONFIDENT about the quality of the product and services. A very tired and outdated property both in terms of structure and technology. Shockingly the General Manger of the property does not seem to be interested in knowing the facts from his guests and does not return calls even if called on his mobile or messages sent through staff in case of complaints. Rooms are poorly maintained/ equipped with many things NOT FUNCTIONAL. . Thou called a SPA but massage could not be booked for two days for the reasons best known to the management. Morning breakfast claimed to be part of the room rent is Stale, not palatable and serving staff inattentive to your basic needs such as tea, coffee, bread Butter etc. Not a place definitely for a business traveler and god only knows what happens to leisure travelers. God bless those who choose this place.", "title": "“So Called Resort in a lost Place”", "user": "ram p", "date": "January 5, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 148872663}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We did not stay in this property. But we visited this property and also had a chance to roam through it. Well maintained, though heavy on ethnic aspect. The restaurant experience was very good. We did not use the buffet and instead asked for maharaja thalis (Rajasthani Thali). They were very good (probably the best we had in Rajasthan). Very efficient service and the staff were very eager to give us additional helpings and even make minor changes. Strongly recommend the thalis here (avoid the buffet as it was a pan-india buffet with nothing special to speak for it).", "title": "Very Good restaurant", "user": "Kumar M", "date": "January 1, 2013", "detail_rating": {"value": 5.0, "location": 3.0, "service": 5.0}, "id": 148503775}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Fort Rajwada, Jaisalmer according to me is 1 of d best Hotels in Jaisalmer !!!!! Huge & traditionally styled fort type look of the entrance ( d scene of d entrance is shown in d TV serial Balika Vadhu, as told ) Picture Perfect & big swimming pool. Classic Ambiance & neatly Decorated hotel & rooms.Excellent food though prices on a little higher side. A little away from d city though, must be 2-3 km odd far. Service very nice & staff very friendly.", "title": "Amazing Property & Incredibly Classy !!!!", "user": "KRUNAL123", "date": "December 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147490495}], "location": {"country": "India", "region": "Rajasthan", "continent": "Asia", "city": "Jaisalmer"}, "stars": 3.5, "variance": {"poor": 37, "average": 52, "very good": 119, "terrible": 31, "excellent": 61}, "aka": "Fort Rajwada Jaisalmer", "slim_ranking": 0.4}