{"user_rating": 4.5, "review_count": 725, "name": "Foscari Palace", "reviews": [{"rating": 5.0, "title": "La Dolce Vita at the Foscari Palace", "text": "We went to Venice for a short break over Valentine's Day and booked the Foscari Palace largely because of the excellent reviews of it online. We were not disappointed. I am happy to recommend it too.", "helpfulness": 10, "user": "dglambeth", "date": "February 17, 2007", "id": 6804372}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Our Superior Double was sumptuous, with balconies at both tall shuttered windows, and luxurious white marble shower room. The service on the front desk was cheerful and impressive - they even managed to book us a table at the legendary Osteria da Fiore for Valentine's Day. The breakfast buffet served up each morning was excellent.", "title": "Great Welcome", "helpfulness": 5, "user": "Tess57", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6782941, "likes": {"liked": "— The hotel was small and charming with really friendly staff.", "disliked": "— No complaints about this hotel - the location would not be great if you walking was a problem."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Access all over the city was easy and water taxis drop you right off at the hotel's dock on the Grand Canal. There's a boat stop right beside the hotel but we walked everywhere as nothing's far. In less than ten minutes, you're walking over the Rialto or into St Mark's Square, and the hotel's just off Cannaregio's Strada Nova which is full of shops and restaurants, both cheap ones and fancy ones.", "title": "Fantastic", "helpfulness": 3, "user": "Australian_in_London", "date": "February 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6778585}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "What a wonderful hotel! Stayed last June and returned February", "title": "Fabulous Four Star Foscari", "helpfulness": 5, "user": "Hertshopeful", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6749748, "likes": {"liked": "— large rooms with fluffy dressing gowns", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "2007, two consistantly great stays. The staff are really on the ball,", "title": "Couldn't ask for anything better!", "helpfulness": 6, "user": "Teeka09", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6749246}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This is a lovely small hotel, well-located on the Grand Canal. We stayed for 3 nights in early November. Our room was very clean, quiet, and well-furnished, though I wouldn't bother to pay up for the junior suite next time--we didn't make much use of the sitting area and it was too cold for the little terrace. The breakfast was very good, with plenty of variety offered, and the front desk staff were polite and helpful. One of them recommended a wonderful osteria right in the neighborhood--Osteria Enoteca Giorgio. Ristorante Da Gianni right down the street was also very good, though crowded. The hotel's complimentary Bellinis and hors d-oevres accompanied by harp music made for a festive start to our Saturday night. All in all a delightful stay.", "title": "Enjoyed the Foscari Palace", "helpfulness": 4, "user": "WHTraveler", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7302493, "likes": {"liked": "— Cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "My wife, seven year old son and myself stayed at the Foscari Place the last week in February. We stayed a total of four nights. We booked the Gonzaga Suite and it was well worth the extra money. The room itself is stunning. The view is what we all dream of when we think of Venice. The room was very large and had a seperate area with the bathroom off of it. There is a whirlpool tub and a shower. We used the tub almost everyday. (It does work, you just have to give it time.)", "title": "Highly recommend the Foscari Place", "helpfulness": 5, "user": "N.Ston.Trav.", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7288255, "likes": {"liked": "— Everything."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We found the staff to be very helpful. They always greeted my son by first name. The breakfast was very good. The location is excellent, not far from St. Marks. We would often go to the Rialto Market across the canal. The staff helped us with restaurant recomendations, tours and boat trips.", "title": "Classy hotel, fantastic location", "helpfulness": 3, "user": "darren2000", "date": "April 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7282915, "likes": {"liked": "— Cleanliness", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "This was our favorite hotel on our trip and you will not be disappointed. Go up to the roof top, the view is great and we had it all to ourselves.", "title": "Agree that the service is frosty at this hotel", "helpfulness": 3, "user": "JoeyP17", "date": "April 2, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7272111, "likes": {"liked": "— Rooms", "disliked": "— Service"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Stayed at the Foscari for 2 days in april and was pleasantly surprised by this classy little number. Quite a small hotel but in a great location right on the Grand canal and just off a very lively street with great restuarants, stalls and shops.", "title": "Mature reflection", "helpfulness": 4, "user": "geoffwCreaton", "date": "March 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7260424, "likes": {"liked": "— exceptional quality", "disliked": "— paying for tea and coffee in the room"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I have been putting off writing this review because I really wanted to love the Foscari Palace. There were some great things to be sure, but overall our experience was very so-so.", "title": "A bit dissapointed", "helpfulness": 17, "user": "corar", "date": "March 11, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 7012737, "likes": {"liked": "— The view", "disliked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stayed at the Foscari for three nights in Feb. It was our honeymoon so we splurged for the Gonzaga Suite, and spent a lot of money on it. So naturally, among the good things was the room itself, the fantastic balconies and the view. Also a plus is the location which many others have commented on, and the cocktail party.", "title": "Best Weekend Ever!", "helpfulness": 4, "user": "purple_sweetie1", "date": "March 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6928345, "likes": {"liked": "— Clean, friendly staff, Location", "disliked": "— ?? No Faults!!"}}, {"rating": 5.0, "title": "Stay at the wonderful Foscari Palace.", "text": "Here come the minuses, and let me preface this by saying that Venice was the last stop on our honeymoon, and we had been absolutely spoiled in our first two hotel choices. Nonetheless, this was more expensive than either of those, so I would expect this to be on par. Our first problem was the service, which was at best, cold, and at worst, really frustrating. On a few occassions we asked for advice on how to get somewhere, or whether reservations would be needed, and always we were met with indifference. When we needed an extra pillow, we were treated as if we had asked for the most difficult thing in the world. As others mentioned, the jacuzzi bath did not work, so i expected that, but one night we lost hot water altogether- not even at a time you would expect many to be using it- and again we were treated as if were out of line to inquire when the water may be working again. The bed was uncomfortable, and not because it was a typically firmer european mattress, but rather, it felt just like a very cheap motel mattress. The beds (twins adjoined) would slide across the floor every time you got up or down. My husband and I would wake in the morning with a foot gap between our beds (which was funny but annoying) Finally, the worst part was breakfast. I understand that Italians dont eat hot breakfast like americans, but that wasnt the problem at all- I had come to love having a caprese or other simple breakfast. Here, the hot selections were fine, but the items you would expect to be good in italy were not. I had the worst mozerella here, the meats were very tough, and the breads were subpar. One morning, after giving up on those items, i just had some cereal. After i dumped milk on it and in my coffee, I began to smell something- the milk was completely soured!! Luckily, there was another pitcher of milk out, but my suspicion is that the urn that held the milk was not refrigerated the night before. It was unpleasant to say the least.", "helpfulness": 8, "user": "Jane8855", "date": "February 28, 2007", "id": 6856353}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "So basically, i would say that this is a decent hotel. I don't think it deserves the raves it recieves on this board, and in the future I might try another location. It is not like this was the worst experience ever, it's just that those special touches you expect at this price level were not there (ie- in every other hotel we stayed at in Italy, the concierge would leave something special in our room to congratulate us, here my husband spent 50 euro to get a bottle of bad bubbly). Perhaps it was our fault for traveling after carnevale? In any case, I wish I could rave along with the others, but it just wasn't great for us.", "title": "Cannot fault", "helpfulness": 3, "user": "poohface", "date": "February 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6840128, "likes": {"liked": "— Location", "disliked": "— Rooms were small"}}, {"rating": 4.0, "title": "Nice new find", "text": "If you need any more info, please contact me!", "helpfulness": 3, "user": "American_in_Italy", "date": "February 18, 2007", "id": 6807400}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "This hotel has surpassed expectations. Actually it looks much better, than on a site of hotel. A smell of fresh lilies, which filled our room (together with an atmosphere of the Grand Canal) will not transfer any photos. Superb!", "title": "Luxury Venetian", "helpfulness": 4, "user": "Aion", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7254242}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We stayed at this hotel last year and I did not give it a good review. I didn't read the response of management or the couple from England until someone asked me for a recommendation of a hotel in Venice. I wish I could recommend this place because it is a beautiful, clean hotel but the staff behind the front desk were cold and rude. I need to clarify that we took no food from the hotel and am not sure why they thought we did. We asked for the name of a good place to eat and how to book a water taxi. I don't consider those questions unreasonable. We are not difficult to please and we loved our hotels in Rome and Florence and have recommended them both to others. This is a nice hotel and is in a convenient location but am not sure why it gets so many raves on this board. I also don't think it's \"weird\" to complain about frosty service.", "title": "In response to the management at Foscari Palace", "helpfulness": 3, "user": "ohioFindlay", "date": "March 30, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 7252477, "likes": {"liked": "— clean", "disliked": "— poor service"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "A fine hotel, well situated and with very helpful staff. I would recommend this hotel without hesitation.", "title": "Enjoyable stay", "helpfulness": 2, "user": "cambridgeboy", "date": "March 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7245499}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Really enjoyed our stay here. Seemed to have been recently refurbished. Good standard, perfect position, staff very friendly. The roof terrace was lovely with views over the Grand Canal. You could cross the canal by gondola right outside the hotel for just 50 cents. We would highly recommend this hotel, we booked 3 superior rooms but would definitely say 304 was the best with its small balcony and side view of the canal.", "title": "Loved the Foscari", "helpfulness": 4, "user": "lfg23", "date": "March 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 7227061, "likes": {"liked": "— Location", "disliked": "— Charge for coffee and tea in the bedroom!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We'been here the first weekend of March, we booked a room with a view on the grand canal, but where upgraded to The Foscare Suite with 6 windows and 2 balcony's at the grand canal. And there was a seperate sitting-room with large tv-screen. Also a cocktailparty with music and free drinks. The service was really ok and friendly. We would surely recommend this hotel.", "title": "Very good hotel!!!!!", "helpfulness": 1, "user": "TheNetherlandsAnky", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7217860}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 23, "average": 36, "very good": 164, "terrible": 14, "excellent": 488}, "aka": "Foscari Palace Hotel Venice", "slim_ranking": 0.296587926509, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}