{"user_rating": 3.5, "review_count": 171, "name": "Foster's West Bay", "reviews": [{"rating": 4.0, "title": "Relaxed in Sky Cabana 4", "text": "We stayed in off-season in September 2006, in a brand new Sky Cabana 4.", "helpfulness": 3, "user": "nicolulu", "date": "March 30, 2007", "id": 7251569}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "PROS:", "title": "Stay somewhere else!", "user": "Heeter", "date": "March 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7187537, "likes": {"liked": "— location", "disliked": "— mosquitoes, \"hidden\" charges"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Cabana $ had a stunning view of the water, it was directly on the beach. The front balcony had a great 2 person hammock that we lived in. Everything inside the cabana was new(new bathroom, new floors..", "title": "Treehouse Terrors", "helpfulness": 5, "user": "mow2000", "date": "March 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 6928515, "likes": {"liked": "— location", "disliked": "— Toilet, location, bed"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "etc. )so it was well maintained and we didnt have the problems others are listing. The view from the rooftop balcony on the cabana was amazing and we were provided 2 lounger chairs. At night we had a gorgeous view of the stars. GREAT snorkeling a 2 minute walk up the beach and a dive shop at the base of our cabana stairs, literally. Bring your own snorkeling gear and save some $$ since you will want to snorkel evreyday, there is so much to see.", "title": "Nice people, nice place", "user": "alpal30", "date": "March 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6925801}, {"rating": 1.0, "title": "Rip-Off Dump!", "text": "-I didnt want to spend the time taking a dive class so we walked up the beach toward West Bay and found a Snuba outfit (its like scuba diving without the class but you are attached to a long oxygen hose that leads up to a floating tank above you. you can go down 15-20 feet I think...). It was great and effortless BUT I would caution anyone who doesnt know anything about diving to trust the young man who led us on our tour, ask for a more experienced person, or someone", "helpfulness": 8, "user": "BobboNewMexico", "date": "February 5, 2007", "id": 6746251}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "My friend and I stayed at Fosters for 7 nights last week and had an amazing experience in West Bay. Foster's is rustic but very clean and our bed was so comfortable that we slept 9-10 hours most nights. We didn't miss that we had no TV in our room because we could relax on the beach with a book or read in the hammock on our porch. We could walk out the door and be at the beach in seconds. The beach is well maintained by Foster and every morning it is raked. The water is calm and perfect for just floating about and cooling off. When we were rested there were many activities to choose from and all within a short walk of Fosters. If you want to dive there is a dive shop right on the site. Anemone is the name and they are a great group of instructors that focus on small groups. We also booked a day of sailing right from West Bay and you can also get a massage from Edgar right on the beach. There are tons of things to do once you feel like doing them. If you just want to relax Fosters is a great place to unplug. I've only been back in Chicago for 24 hours but am trying to figure out when I can get back to my hammock and the sounds of the beach.", "title": "Foster's is an island gem", "user": "LizzChicago", "date": "January 11, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23461766, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Fosters West Bay has now become an annual tradition. This year was our third year in a row that we've been staying with Foster. Each time we arrive, it feels like we've come home again. We get big hugs all around! This special island getaway has been carved right out of the jungle and sits tucked away on the perfectly secluded stretch of Roatan's best beach. I love awakening to the sounds of several red macaws as they fly overhead, squawking, finally to perch themselves on a branch right beside your ocean view porch. I've traveled to many far-away lands but nothing comes close to this magical paradise. We've stayed in three different units and they've all been great! Our favorite is the Lower Roundhouse. You can rent the individual rooms but if you have enough people you can all stay in the entire lower level with one large common area-full kitchen, dining area and living room. There are three separate rooms closed off with their own small fridges and bathrooms (my shower could fit 10 peope in it). With 5 of us sharing the entire lower level, I think it cost us approx. $300 per peson for the week. You can't beat that! As others have mentioned there is great food and nightlife only steps from the resort but the food at Fosters is great as well. Don't miss Lobster night or the famous Monkey La La! One important note: We are divers and spend most mornings diving without ever enjoying the other island activities. Every year Foster's son Ray has tried to entice us with a snorkeling trip to Cayos Cochinos but the first two years we declined due to diving. I kept saying to him, \"What don't you understand about this? We are divers. We certainly won't lose a full day of diving just to snorkel.\" However, this year I was unable to dive so we took him up on his offer. I cannot emphasize enough how foolish I felt that we had turned him down the first two years. This was a one of a kind trip! As we approached the second island of the Cayos chain where we were scheduled to eat lunch, I thought I had died and gone to heaven. My jaw hit the ground. I was speechless. The beauty of this place was intoxicating. The island is called Cacahuate. It's a tiny crescent shaped island, where only 100 Garifuna villagers live. They prepared a lunch of fresh grilled snapper, grilled plaintains and rice and beans. Of all the wonderful moments on Roatan over the past three years, this for sure was the hightlight! Ray's Xtreme Charters to Cayos Cochinos is an absolute must!", "title": "Foster's West Bay-My Favorite Escape!", "helpfulness": 3, "user": "scubachicknick", "date": "July 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 18201451, "likes": {"liked": "— Loctaion of the beach and hands-on involvemnt of owner and his family.", "disliked": "— I loved everything!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband and I stayed at 2 hotels while in Roatan (Paradise Beach Club and Fosters). At Fosters we stayed in Sky Cabana #4 and loved it! The hammock on the front porch is incredibly comfortable. Watch out though...I laid down on it just to check it out and ended up taking a 3-hr nap! The room was clean and neat. There were little island nuances such as unfinished tile in the bathroom and if you leave any food item out, it will be quickly covered with tiny little ants that appear out of nowhere (this was the case at both hotels)...but there is a refrigerator in the room, so no big deal. Foster was building a dive shop when we were there, so there was hammering during the day, but the dive shop will be a huge plus for the next trip. Foster has his own dock with a tower/platform that is good for grabbing some midday sun, watching the sunset, or jumping/diving.", "title": "Fosters - rustic, but friendly!", "helpfulness": 2, "user": "CaliforniaKate", "date": "July 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18042012, "likes": {"liked": "— Friendly staff, location", "disliked": "— Sand fleas on the beach"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Ray (Foster’s son) offers the best day trips on his Extreme Charter boat. The snorkel day trip to Cayos Cochinos is a must! Whether you stay at Fosters or anywhere else in West Bay or West End (a quick 5-minute, $3 boat ride), be sure to eat at Bite on the Beach next to Fosters. They offer incredible fusion Thai food.", "title": "Great Place", "user": "touchofgrey", "date": "June 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 17169118, "likes": {"liked": "— location", "disliked": "— some units are better than others"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We are advanced open water certified divers and dove with both Bananarama and Las Rocas. Las Rocas gets FOUR BIG THUMBS DOWN! They were rude, their equipment was shoddy, the staff loudly complained about having to do any work (such as carrying empty tanks back up the hill to their dive shop) and they never had enough weights on hand for all the divers on their 2 tiny boats. As a result they would lie about how much weight they gave out (weights are not marked). This made our first dive miserable. The shop manager seemed very friendly and helpful. Unfortunately, she seemed unaware of how unprofessional her staff were. Bananarama dive staff were fantastic. We enjoyed the dives with them immensely. They went above and beyond to make sure that each of their dives was special.", "title": "Island Hospitality and Charm", "helpfulness": 2, "user": "ileana75", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15735382, "likes": {"liked": "— Staff, beach", "disliked": "— No pool, but beach is right there!"}}, {"rating": 2.0, "title": "beware of bedbugs", "text": "In spite of lots of little problems we enjoyed Foster's. In a place like Roatan on expects little glitches and things not working perfectly. I must warn fellow travellers though that the tree house and possibly other rooms are infested with bedbugs. You can see their marks on the matress (black lines- I thought they were mildew when we were there). We put our suitcases on the floor, they crawled in and we brought them home. My couch is out on the street now and aside from replacing it, this is turning out to be a costly and disgusting nightmare. If you go, I suggest washing and drying EVERYTHING that was in your bag before bringing it into the house, and then leaving your bag in a hot car for a few days. We loved the tree house, but I thought I would try to prevent others from bringing home nasty souvenirs like we did.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 28, 2006", "id": 5407067}, {"rating": 5.0, "title": "Incredible Experience", "text": "We planned to stay at Foster's to ring in the new year and what a great choice that was!! I had gotten to the hotel early as I had been traveling and was meeting my boyfriend on Roatan (he was flying in from Ohio). I arrived at the hotel and was greeted by the extra nice owner, Mr. Foster, who showed me to our room, but casually mentioned that the TREEHOUSE also just happened to be available. Are you kidding me? He stated that it was the only one on the island. One look up the vast spiral stair case heading 50 feet up the huge Mango tree and I was sold. It was very cool. The rustic room was complete with indoor plumbing (sink, toilet, shower (on the porch)), a refrigerator, bottled water, linens, etc. The toilet is only separated by a curtain and the shower is more of a pipe of cool water that runs out onto the porch. So the key is to shower at night under the stars so noone can much you. But what an experience to wake up in the tree to the sounds of birds and have views out to the beautiful beach and Carribean sea. And I really can't say enough how nice and helpful Mr. Foster and sons were. I was given a personal tour to some other parts of the island owned by the family...other special places are contained here, but I was sworn to say no more. The were pleased to explain any and all possible activities going on and figure ways for you to get there. One of the sons is now offering fishing charters. We went on this and got a whole lot more than a fishing charter. We fished plus got a tour and went snorkling. I might add that the beach is beautiful (minus sandflies - spray!) and Gimbalina Park (sp?) was excellent and within walking distance of the resort. At Gimbalina, we played with monkeys, and parrots, ate traditional Honduran food and learned much about the history and cultures of Honduras. In sum, Roatan and Fosters was a great place to ring in the new year!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 19, 2006", "id": 5181983}, {"rating": 1.0, "title": "What a Dump", "text": "Should add that we only ate breakfast once at the resort, which was fine. The restaurant is leased out by the family and it just did not interest us much, but it offered a lot of good drink options and more great views to the sea! Would highly recommend Boucannier's (?) french restaurant in West End.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 17, 2006", "id": 4466819}, {"rating": 5.0, "title": "Great Place - Great Owner", "text": "First the good points: Beautiful white sand beach just steps away from you room. We were a little disappointed because the waves are small and you don't get the ocean sounds. People were nice if you could find them.", "helpfulness": 8, "user": "travelagent007", "date": "January 31, 2006", "id": 4400180}, {"rating": 2.0, "title": "cockroach & sandflea heavn", "text": "Bad points: Lack of services and amenities, no one around for help. This is not a 3, 4, or 5 star resort. No office, they were in the process of rebuilding. Noisy, a lot of bugs, swamp and garbage dump in back, alot of people on beach when cruise ships are in town, and that was the only time chairs were cleaned and put out. We stayed in the A-frame building. It does have a good location, if you enjoy listening to construction sounds, sawing, hammering, and chipping of rocks. The stairs in the loft were a joke. If you have to go to the bathroom in the middle of the night you take your life in your own hands, but the flood lights across the compound brighten up the inside so you don't need any lights on. There is a sliding glass door to no where. There isn't a deck so do not have too many monkey la las and get drunk and fall out. The faucet is tricky, you just have to figure out how to turn it off. Too much thinking for me. The bats in the rafters were alot of fun, just don't sit under them because they do their business upside down. You can feed them bananas. Actually they were a pleasant distraction. This place is in need of alot of repairs, so if you book a room check to see if they are finish with construction. Take all of your own toiletries, hair dryer, shampoo, conditioner etc. They did provide soap. Take alot of bug spray. There were more bugs on the island than on the mainland. If you get tired of the sun, sea, and bugs, take a few days and go to Copan, you won't be sorry. It is an inexpensive trip if you go by the bus, Hedman Alas. Good places to eat were Bite on the Beach, breakfast buffet at Henry Morgans. If you go exploring the island go to 6 Huts. There is alot of price gouging on the island so check around to get the best prices on your activities. This island is not cheap. I thought I was in Hawaii, but not as nice.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "December 30, 2005", "id": 4312713}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Fosters West Bay was wonderful. It is rustic and like you are camping in Foster's back yard. The people at Fosters, from Foster himself to Dru to Leslie to the people at the bar/restraunt are the nicest people we have ever met on holidays. They couldn't have done more for us. Always ready with a quick smile and a helping hand. Our family had a wonderful time and just can't wait to get back. The food is more than reasonably priced and also good - the banana pancakes for breakfast just can't be passed over - they are wonderful. The accomodations are rustic but we don't stay at the big corporate hotels and would rather support local people and Foster certainly fits that bill. Again, wonderful place, most definate a great beach. Used Octopus Dive right next to Fosters and things worked out well there as well. Will be back and can't wait.", "title": "Wow - what a place - loved it", "helpfulness": 3, "user": "AlbertaErnie", "date": "March 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14054976, "likes": {"liked": "— Rustic setting, Foster, Dru, Leslie and staff", "disliked": "— some bug issues - but no big deal"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I just want to say to all the other people that are complaining about Fosters, Did you do your research before you made your reservations? Fosters and roatan in general is exactly what I expected. It is not a Hilton nor a Marriot. What it is, is a rustic island retreat that caters to its guests. Everyone there was hospitable. Foster was up every morning with his sons raking the sand and then drinking coconut milk fresh from the coconut. I asked him about it and we made a date the next morning to have some. Before I left he had one of his employees go and cut a coconut from the tree cut the top off and put a straw in it and served it to me. With my past experiences, I can gaurantee the GM of a Hilton wont have coconut milk with me or anyone else, unless of course, you are a big fish. They are Wonderful hosts, If I had a question it was answered. If I had a problem, it was fixed. So if you want a Hilton go to one if you want a true island experience well then, Fosters if for you.", "title": "Upset people?", "helpfulness": 7, "user": "Br00x", "date": "January 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12537939, "likes": {"liked": "— The people", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Keep in mind Roatan is a developing Island. As well as most of the resorts on the island. The people from Honduras and the people who have moved to the island are \"Laid Back\" the is no reason to be in a hurry unless you are late to catch the sunset.", "title": "Stay at Fosters!", "helpfulness": 5, "user": "reneewilkins", "date": "December 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12052065, "likes": {"liked": "— The balconies and the view", "disliked": "— The tub mat was not changed regularly, and it got pretty dirty with all the sand."}}, {"rating": 4.0, "title": "what a adventure/fosters treehouse", "text": "I spent my honeymoon at Foster's West Bay in Sky Cabana #4. I enjoyed sunsets from the balcony, and watching the resident humming bird in the tree. We were there for two weeks and very much enjoyed our stay. Foster, his sons, and Leslie are all gracious hosts, eager to please. Foster is a native islander and he keeps the feeling of his resort authentic. The scuba diving was fantastic. We made lots of friends during our two week stay. If you are looking for a relaxing vacation, Foster's is an excellent choice.", "helpfulness": 2, "user": "tiedeman", "date": "June 19, 2007", "id": 7938460}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We ate out several times and Bite on the Beach (next door at Las Rocas) was one of our favorites. We loved the sundried tomato parmesan fish. We also liked Roatan Rick's in West End. Oh, and if you have a chance, go over to Blue Bahia (Sandy Bay), besides good food, you can take a look at their beautiful macaws and toucans. You can get a good meal at a good price at Blue Parrot, too. (also Sandy Bay). Of course you have to try the restaurant at Foster's too. The have many good selections...the fish and rice was probably my favorite there.", "title": "We loved Foster's", "user": "Robey", "date": "June 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7828812, "likes": {"liked": "— Location", "disliked": "— Nothing"}}], "location": {"country": "Honduras", "continent": "Central America"}, "variance": {"poor": 17, "average": 15, "very good": 61, "terrible": 23, "excellent": 55}, "aka": "Foster`s West Bay Hotel West Bay", "slim_ranking": 0.909090909091}