{"user_rating": 4.5, "review_count": 79, "name": "Fountain Guest House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My husband and myself have just returned from an enjoyable stay here - we booked a night in response to the other reviewer's comments and we weren't disappointed. It's a wonderful place! We had never visited Ripon before and decided on the Fountain Guest House due to it's location as well as favourable reviews - it's only a few minutes walk from the Market Square. On street parking near the Fountain - we parked without problems even though it was Saturday morning.", "title": "Fantastic B & B, friendly hosts and wonderful breakfast!", "helpfulness": 5, "user": "Psychicchic", "date": "January 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4395557}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "We had the de-luxe double bedded room, priced at £65, including a full English breakfast for the two of us. It was worth every penny. Sumptuous comfortable surroundings, the decor and furniture in keeping with the era of the property, all thoughtfully planned.A large airy, yet warm room with central heating. Plenty of bedding and a King sized comfortable bed. Choice of bright crystal chandelier or the intimate lighting from the bedside table lamps. Extra touches of bottled mineral water, speciality teas and regular tea, coffee and biscuits on the Courtesy Tray in our room. Original grand Victorian fireplace with large mirror is a stunning feature of the room. Colour television too. The room was so nice we decided to spend the entire evening in these romantic surroundings with a private botle of champagne! Nice modern shower,fluffy red towels and complimentary toiletries. Everything we needed for a lovely self indulgent evening.", "title": "Excellent Bed & Breakfast", "helpfulness": 2, "user": "Millard D", "date": "September 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3931701}, {"rating": 4.0, "title": "Very Nice B& B", "text": "Breakfast was faultless, at a time of our choosing (within reason!)Choice of menu all perfectly cooked and presented. Fresh filter coffee served in cafetiere. Clean laundered table linen and napkins and extra touches of doilies, speciality preserves,pot of butter. Was asked if we required more coffee, toast etc but we'd already had ample!", "helpfulness": 6, "user": "Olushola O", "date": "August 22, 2005", "id": 3795822}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Ripon is a great base for seeing the likes of Fountains Abbey, Studley and other attractions in the York area.", "title": "Small & Friendly", "user": "Wirralmember", "date": "June 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 16813213, "likes": {"liked": "— Friendly welcome, relaxed feel", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "York is great but can be overcrowded, a bit on the pricey side and parking is a pain, Ripon is laid back and relaxed, with a good choice of pubs and restaurants for all tastes around the market square. The Minster is beautiful, and theres a real market town feel to the place rather than being a tourist trap.", "title": "a fantastic friendly place", "user": "jerry123Mansfield", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14879328, "likes": {"liked": "— cleanliness, fiendliness"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Fountain House is in a great spot just off the A61 (easy to find), but only a 5 minute walk into town.", "title": "Exceptional Guest House", "user": "bryan4134", "date": "October 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10024032, "likes": {"liked": "— Huge well appointed rooms, welcoming proprietors, convenient location, beautiful town."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The owner is friendly and attentive without being in your face, and he cooks a great breakfast. The family room is enormous with nice touches, like the soap/shampoo miniatures in the bathroom and local biscuits with the tea/coffee. The only suggestion I would make is getting a visa facility. We only realised while we were there (our fault) that they only take cash/cheque, but thats certainly not a grumble, and we wouldn't hesitate to recommend the place.", "title": "Had a lovely time", "user": "Nat_Steve", "date": "September 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8723976, "likes": {"liked": "— The room's space and orginal features", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "from arrival to departure we felt valued guests. we would not hesitate to recomend this hotel.breakfast was superb and nothing was to much trouble even catering for my wifes need for fruit tea and lemon juice.well be back soon, thanks for having us", "title": "all that it says on the bottle!", "user": "jamesgandolfini", "date": "September 7, 2007", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 8669414, "likes": {"liked": "— quiet location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This little B & B was clean with a good English BK. Our room were simple but clean. This location was close to market square. The staff was friendly and helpful! I would recommend this B & B.", "title": "Very Nice B & B", "helpfulness": 1, "user": "Jkrebbs", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 8524642}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We booked two rooms - a family room for three and a twin room for grandparents. They have three rooms and the largest was already taken. Our room - a large double with an extra bed, was comfortable. My parents were in a twin room, which was rather small. The two beds are placed in an L-shape and so may be more suitable for friends or children sharing. The owners are terribly friendly and easy going. Overall good value for money in a low-key kind of way. Not sure what else Ripon has to offer, but this was fine, if rather ordinary!", "title": "Small and friendly", "helpfulness": 1, "user": "LLSL", "date": "August 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 8450925, "likes": {"liked": "— Homeliness, friendly atmosphere", "disliked": "— Small twin room"}}, {"rating": 5.0, "title": "A very enjoyable stay", "text": "We have just returned from a wonderful weekend in Ripon. Our stay at Fountains House was excellent. The service was friendly and efficient. The host was able to recommend several good places to eat and interesting places to visit. The facilities were very comfortable and clean. We will be returning soon and will not hesitate to recommend to our friends.", "helpfulness": 1, "user": "hhmSurrey", "date": "May 22, 2007", "id": 7670480}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Stayed for 2 nights at Fountain Guest house. Large bedroom with kingsized bed which was spotlessly clean as was the bathroom. Great breakfast in the morning. Scott our host was very friendly and offered lots of helpful advice on restaurants and attractions in and around Ripon", "title": "Friendly Guest House", "helpfulness": 2, "user": "Tyderi", "date": "August 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 5718787, "likes": {"liked": "— Good accommodation, friendly helpful host"}}, {"rating": 5.0, "title": "Perfect.", "text": "The walk to town takes about 10 minutes.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 9, 2006", "id": 4953900}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 20, "terrible": 1, "excellent": 57}, "slim_ranking": 0.5, "description": "Fountain Guest House is a beautiful Victorian terrace situated less than 10 minutes walk from Ripon’s market place, cathedral and city centre. Many of the period features remain in the house including its high ceilings and sweeping staircase. The three en-suite bedrooms are elegantly decorated with period pieces. The River Ure is on our doorstep providing an ideal location for countryside walks."}