{"user_rating": 4.0, "review_count": 920, "name": "Four Points by Sheraton Midtown - Times Square", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I wish every hotels web site would have a price list like this hotel. When making a reservation you get a lot of choices og price. Read the terms carefully and you might get a bargain.", "title": "a possible bargain", "user": "pfdk", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120883919}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Hotel location is close to the airport express bus stop at 42th (arriving) and 41th (departing).", "title": "Excellent location matched by excellent service", "helpfulness": 2, "user": "travelador", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 120746008}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Standing in front of the hotel, it looks like a tourist class hotel. It is not. The ground floor is not very inviting with a small reception, a very small bar and a Bistro hidden in the back, behind the reception. However the staff in the reception is very helpfull, the bar has a good assortment and the bartender is very good and the Bistro serve very good food at resonable price. This is very important since there is very few restaurants in the area unless you just want a quick bite, then you have a maximum of 100 meters between the joints.", "title": "A big Sheraton disappointment! Not like an SPG Property at all!", "helpfulness": 2, "user": "LIbbewdc", "date": "November 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 120663052}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The rooms is spacious with a good view and with every amenity you might need.", "title": "Power outage nightmare!", "user": "Jane60811", "date": "November 13, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 120537682}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Officially the hotel has a 3 star rating (tourist class). I will not hasitate but give this hotel a 4 star rating (first calss).", "title": "Great Deal on this Hotel", "user": "LVJ1980", "date": "November 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120495841}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We had a great stay at Four Points. The check in process was easy, quick and perfect, and the people working to check us in were polite and professional. The room was small, but it had absolutely everything we needed. It was very clean and up to date as well. The bed was quite warm and comfy. The hotel is situated near all the great spots in Midtown Manhattan; we only had to walk from 8th over to 7th to be in the middle of all the action. Great stay for a great price!", "title": "Great room in Midtown!", "user": "VacationCrazy47", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121095419}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel was very clean, convenient, and most of the staff extremely friendly. The room was fantastic and the bed was very comfortable. My husband loved the large shower. We walked everywhere we needed to get to because of the fantastic location. The view wasn't bad. Loved the complimentary beverages in the morning, and the restaraunt was small but comfy. We only ate breakfast there but it was very good, reasonably priced, and was well portioned. Didn't l;ike having to go down to the lower level for ice and soda. There was one bottle of complimentary water inthe room. No store or place to buy amenities, but we didn't need any so I don't know if the hotel offerred anything. We got there early on our checkin day and checked our bags, which included an open shopping bag with a gift we had just purchased. When we checked out we needed to also check our bags as we had a full day of activities before leaving - the clerk would not check the open bag!! so we had to lug the bag around all day. We were not happy. Next to the hotel are 2 more hotels to the west and to the east a parking area, a liquor store, a chinese food place, and 2 'adult' stores. I was not very comfortable walking down that street as there was often people loitering. We usually crossed the street then walked down. the Port Authority if directly across the street - very convenient if that is how you are getting in and out of the city. We walked from grand central. We would stay there again.", "title": "solid place, would stay again", "user": "Toni-lynn M", "date": "November 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121077340}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My wife and I stayed there a couple nights before thanksgiving. It was business/pleasure trip to NYC. I used to live in NYC before and I am very familiar with the subway system, I picked a location close to Times Square/ Port Authority subway station so it would be most convenient for me to travel for my work around the city.", "title": "Great Location, Friendly Staff", "user": "mehtap3", "date": "November 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121004778}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "There is a parking garage right next door which is offers space at a discounted rate for guests of the hotel, its expensive but its still cheaper than other NYC rates.", "title": "Perfect stay", "user": "Kevin S", "date": "November 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120991291}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We had reward points from SPG so we used those, but the check in was hassle free, the staff extremely helpful and friendly and we loved our stay there.", "title": "great times off times square", "user": "leftyj1001", "date": "November 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120934395}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Nice new clean room with an extremely comfortable bed. Friendly personnel and good housekeeping. A free bottle of mineral water every day. The tap is a bit of a design flaw but is manageable. Not a big room, but acceptable for Manhattan and the price level. Breakfast in the restaurant is to order, not a buffet. Reasonable price and good quality.", "title": "good hotel", "user": "CM002", "date": "February 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 55891984}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The street is not nice, with a parole office and porn shops, but it seemed fairly safe and is close to Times Square, Hells Kitchen, Penn Station and many subway lines.", "title": "Surprisingly nice stay!", "user": "SanukSanuk", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55427319}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I got a good deal on the Starwood website, so thought this was very good value for money overall.", "title": "It's not the Four Seasons, but it is Starwood comfortable", "helpfulness": 1, "user": "TXStevePen", "date": "February 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 55317810}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I was somewhat concerned about staying here given some of the reviews, but I'm glad I gave this property a try. My three-night stay during a recent business trip was excellent. The room was clean, comfortable, and surprisingly quiet. The staff were friendly and helpful. The location was convenient to most of my meetings and restaurants. I really appreciate the free bottles of water that were replenished daily. I didn't use the free wireless Internet as I have my own portable connection, so I can't speak to the quality of the connection.", "title": "Decent Hotel-local both good and bad", "user": "NPEMDAD", "date": "February 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 55111730}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "As has been said, this is not a luxurious property, but I found it to be an excellent value. Despite the small room, I actually prefer it over the Westin Times Square, which I don't like because it's in the middle of the Times Square circus.This property is also nicer than the Four Points Chelsea which is not as conveniently located.", "title": "Clean & friendly.", "helpfulness": 1, "user": "VBads", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54286974}, {"rating": 3.0, "stay_parameters": "Stayed November 2011", "text": "We stayed in room 605 for the Thanksgiving weekend. 1) The TV was not working, could NOT even find the outlet to figure why pressing the button on the remote and TV wasn't working... 2) The outlet in the bathroom did NOT work... 3) the outlets under the TV, only two of three worked... 4) The room faced some shop and the noise across was louder than the heater... 5)The strings to the blinds were broken so the sheer stayed closed, however, the privacy/light blocking blind wasn't rolling down... 6) For a Starwood, there was no parking, nearest was a garage two blocks away, and you pass two sex shops before getting to the hotel...", "title": "Disappointed in Starwood after this Four Points.", "user": "DarkTryst201", "date": "November 28, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 121173564}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Just really disappointed in this hotel and its location; shames the other Starwood hotels...", "title": "A surprising bargain in manhattan", "user": "Alan17584", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121144992}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We were very pleased with this hotel. Very convenient location, helpful staff, very comfy and accommodating restaurant. The lobby and check in area are very small but the rooms were a nice size. Our room was clean and nicely appointed.", "title": "Just ok.", "user": "allyphant", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121133352}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I arrived at the Four Points after a 24 hours long flights and 1 hour shuttle ride in from the airport at around 11.45 am on a Wednesday morning. I was really looking forward to a shower but was disappointed to learn that the hotel's computer systems were down and they were unable to let me do an early check in (it didn't matter if I was a SPG member or not). All I needed was a quick shower and I was prepared to leave my bags at the hotel and come back later on to check in. I wasn't told if there was full occupancy or not, but it seemed like they could not provide me with a solution till 3pm. It was a good thing another friend of mine checked in at a nearby hotel and I took a shower at her place.", "title": "Very happy", "user": "lmcruz07", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121129634}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "As for the stay itself, the bed was comfortable, the rooms were clean and were a good size. Honestly, it was quite a comfortable and pleasant stay all round save for the initial impression.", "title": "Clean, Clean, Clean", "user": "skiwithapro", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121129429}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "The hotel was recently remodeled I believe. The room was small but had all the amenities needed. The Sheraton beds are the best!! The staff was quite helpful & friendly. The food in the restaurant was also wonderful. The one negative is that the shower head is placed too high. Standing on my tipee toes I still had difficulty moving it. I am 5'4\".", "title": "I love the Sheraton Hotels", "user": "FormerNewYorkerCa", "date": "October 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47063327}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The hotel front staff weren't very friendly, but for the price and location it was a great place to stay. The room was cleaned and very comfortable. I would stay there again and would reccomend to friends.", "title": "Got a great deal", "user": "lorirk123", "date": "October 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 46935491}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Good location close to Bus terminal with buses from Newark airport for only 25 $ roundtrip, nice rooms with excellent beds, friendly staff. We stayed here 5 adults and 1 child in 2 rooms. Loved it.", "title": "Friendly staff", "user": "USlover", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46787208}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The only thing is the pornstores on the way to the hotel, but it was ok anyway,not much action going on around them anyway.", "title": "Efficient and comfortable in good location", "user": "deejay21", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46592460}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "I spent my 1st and last night at this hotel in NYC. I found it to be clean and service", "title": "Only OK!", "user": "karaseksrus", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 46181837}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "This is the second time I've stayed here. I am a frequent NYC business traveller and always stay at the Startwood Brand hotels because I am a gold level member. Because the rates at this Four Points are so reasonable, I decided to try them out. I am very pleased.", "title": "Wonderful Service...above and beyond expectations", "user": "dcrum2", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54104115}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "In particular, on the last day of my trip, I was in a great rush to catch a train at Penn Station (about 7 blocks and one avenue away). I was rushing back to my room to pick up my bags and run to the train station. I had about 10-15 minutes and it was going to be REALLY close. Alex, one of the bell men offered to run with me and carry my roller bag so that I didn't have to. We huffed and puffed all the way to Penn and I made my train! It was a miracle. But, more importantly, Alex and the folks at Four Points went ABOVE AND BEYOND my expectations. For this reason and many others (the beds are really comfortable and the rooms are sized nicely and beautifully renovated) I HIGHLY RECOMMEND this hotel to any friend or fellow business traveller.", "title": "Great remodel", "user": "WestWildwood", "date": "January 20, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 53967611}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The rooms are small as to be expected in NYC, but nicely appointed following the recent remodel. The king size bed did fill most of the room, but was very comfortable and welcome come the end of long days site-seeing. Street sounds were still audible from the 22nd floor, but not enough to wake you.", "title": "Goood little hidden spot", "helpfulness": 2, "user": "7Luvs2Travel77", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 53866274}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I would agree that the neighborhood could be better, the \"adult\" shops are pretty sleezy", "title": "good location but....", "user": "AlixD62", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 53363078}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "and the lighting on 40th near the hotel could be better. Nearby 9th Ave. had some great restaurants that we did not even get a chance to explore given our time contstraints.", "title": "noise location", "user": "markupolo", "date": "January 3, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 52486323}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We're just back from a 3-night stay at this hotel. We were lucky enough to have a room on the 20th floor so noise wasn't a problem at all (sign up to be a SPG member, it's free and you're more likely to get a room high up). From the 20th floor we had a nice enough view with no noise. The bed was the most comfortable bed I slept in and I already miss it! The room was a good size, neither small nor big and very clean.", "title": "Fantastic stay", "user": "Lamperose", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48027609}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "There's also a computer downstairs but the internet connection is quite slow. The complimentary bottle of water was a nice touch.", "title": "Comfy beds! The neighborhood is not that seedy, but it is noisy, so bring your ear plugs!", "helpfulness": 1, "user": "lisampls", "date": "October 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 47981424}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "In terms of the area, I knew that some reviews said that it was a shabby area. My husband didn't. I didn't tell him until we left, that every single day we passed the Parole office and two adult stores and he was actually surprised and never noticed them! I really don't think that the neighbourhood is that bad. OK it's not like in the upper west side but for the price we paid for the hotel ($440 all taxes included for 3 nights) it was really good value for money with a great room with virtually most of the metro stations within 2 to 10 minutes walk.", "title": "Above average hotel in great location", "user": "lisafinz", "date": "October 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 47808398}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Ooh and we also went on the roof, 34th floor, great view on Jersey, and the times square area!", "title": "Small, clean enough. Didn't like the neighborhood at all.", "user": "JaybirdNC", "date": "October 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 47455387}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "My boyfriend and I came for an event at that Marriott Marquis, but they were booked on Wednesday and Thursday, so we had to look for alternate lodging where we could use our SPG points. The closest available hotel was the Four Points Midtown.", "title": "Worth considering if you can get it cheap", "user": "ChessAdvisor", "date": "October 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 47212941}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I stayed there during one of the busiest weekends in the winter - the first weekend in December. I can't speak on the price because I used Starwood points but the hotel was decent and the online pricing for the same weekend there were much cheaper than others in the area. I typically always stay at the Westin Times Square but I was not expecting the same level of sophistication and service at a 4 Points. It is a lower, more budget-friendly hotel and that is what I was expecting. Check-in was easy: lobby is very small but efficient and we were checked in within 5 minutes. Very friendly staff and they were very helpful in getting us in comfortably and quickly. We were placed on the 23rd floor (room 2306). I think that the floor is for Starwood Preferred Members (as the sign indicated when you got off the elevator) but the room was very well appointed, much nicer than I anticipated. The location is not super ideal - just far enough from the theaters to think about it - but decent considering the hotels right in the Square were going for $600 and up for the same weekend. It was not that big of a deal being a few blocks off Times Square. We ate at the Gotham Bistro in the hotel for breakfast (check restaurant.com - they have gift certificates for the location) and the food was decent, not great. Two of the employees at the restaurant got into a little argument which caused a little bit of commotion but the staff recovered quickly and got us our order fairly efficiently. Concierge was very helpful as well. All in all, better than expected service from a modestly priced hotel in a fairly convenient area. In NYC, that is saying alot!", "title": "Good hotel and met my expectations", "user": "shida_girlBoston_MA", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121555336}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Just come back from a shopping trip to NY.The hotel was comfortable and very clean. Staff were helpful. It is a very good location for shopping and for Times square. The bus station is just across the road if you are traveling to the outlet shopping malls. I would definately stay here again.", "title": "Good location", "user": "SueGPeacehaven", "date": "December 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121549606}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "In the 300 block of West 42nd, the hotel is right next door to the New York State Board of Parole. The parolees are coming & going!!!", "title": "Good hotel; bad neighborhood", "user": "Harriett R", "date": "December 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 121395737}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "It's a Four Points, so you don't expect the moon and stars, but this hotel is clean and well maintained, with efficient and friendly staff and good rooms. It's at the top end of the range of the brand, and better than many Sheratons I have stayed at. You're not staying on the greatest block, but it's about as convenient as you can get. I will stay there again with pleasure. The front desk staff in particular get a mention - super nice and a genuine welcome every time you come back to the hotel.", "title": "Great Central Hotel", "user": "Ian_M_T", "date": "December 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121330223}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Stayed here for a short trip to NYC to watch the Macy's Thanksgiving Parade. Staff was very helpful and friendly. We arrived on Tuesday am after a red eye flight. Got to the hotel at about 8am hoping to just drop our bags off. Instead, they had a room ready for us so we were able to check in. Its across from the Bus depot so the subway stop there is a major one that allows for a lot of options. Some previous comments talk about it being next to the Parole Building. We found this to be no problem as we walked back to hotel all hours of day. If anything there is a line outside the building around 7:30 till it opens at around 8am. Also, avoid going up to 9th ave. The room was adequate size and we had a view of the Empire State Building. Cleaning staff jumps right on cleaning the room early so by the time we went to the room for a \"pit stop\" it had been cleaned. No complaints and no cons with the room or hotel.", "title": "Close to Major Attractions", "user": "captaincomment", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121211101}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Now really we are here and in the room right now. I did see a few reviews after we booked and at that time I wasnt concerned. Well I should have been and its too late now. We are here to celebrate New Years Eve and seeing the ball drop. I think they reel you in by using the words Times Square and thats is creative advertising. It is near times square, like two blocks up and two blocks over. I dont even know where to start with this damn place.", "title": "What the [--]?", "user": "MrsAriaT", "date": "December 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 1.0}, "id": 52234091}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I hope that this 400.00 a night rate is because it's New Years Eve. It cant be because of location because even though we are on a street its like an alley street.", "title": "Great Value and Location", "user": "kw2405", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52011162}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "I have never been to a hotel and seen a room this small. Its like a 10X13. It doesnt have a closet! did you hear me? It doesnt have a real closet. It has an armoire in the corner of the room. No microvewave or frig.", "title": "Nice 2 night stay at the four points", "user": "george00", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51075868}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "They have 33 floors and one vending machine and an ice machine that has both snacks and pop in the same machine and its in the basement. So yes you may have to go down 33 floors to get a fricking bucket of ice.", "title": "OK but Not Great", "user": "lizzie03", "date": "December 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 50530240}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The curtains dont close all the way. We basically have to keep the lights out because even with the shade down which is not a solid material you can see in the room. If we can see out then people can see in. the actual curtains are made not to even draw to the middle of the window.", "title": "not bad", "helpfulness": 1, "user": "jojo56", "date": "November 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 1.0, "service": 4.0, "rooms": 3.0}, "id": 49519662}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We booked with the re-opening deal of $115 per night. That in itself, made the stay great, but we were plesantly surprised with the size of the room and the great view. We could see Times Square from our room. Our room was very clean and the beds were great.", "title": "Great value /totally safe area", "helpfulness": 1, "user": "amsenny", "date": "October 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 45956625}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "I see some reviews mention the adult stores on the streets. Yes, they were there, however I never once felt unsafe. I loved the fact that Times Square was a block away. The Port Authority Bus Terminal was across the street which was kind of handy because there were lots of affordable resturants and shops.", "title": "Fatal Errors", "user": "Travel Richly", "date": "October 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 45913832}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Not a bad deal. This hotels grand re-opening deal allowed my family to extend our vacation and I will stay here again!", "title": "clean, reasonable, convenient, but nothing exceptional.", "helpfulness": 1, "user": "ezelion", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 45328113}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "For all of the good things one can say about this relatively new hotel (eg, incredibly comfortable beds, smart design for such small rooms, friendly staff), there are a couple of major problems that make it impossible to stay here again.", "title": "Clean Hotel, Location is both Good and Bad", "helpfulness": 1, "user": "Andrew Y", "date": "September 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 45088664}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "First is the air-conditioning. As previous reviewers have noted, when the cool (or hot) air kicked in, the sound was so loud that I was awakened every 5-10 minutes during the night. There is NO option to keep the fan on when the cool or warm air is also desired (which would at least keep the noise at a constant level). How could a new hotel adopt such an antiquated system? And why does using the TV remote turn the a/c off??", "title": "GREAT HOTEL", "helpfulness": 1, "user": "missyschmid82", "date": "September 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 43684010}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I stayed here twice during October--once for Columbus Day weekend with my wife and a second time by myself for the World Series. I used Starwood points each time and, when I requested an upgrade based upon my platinum status, I was given a suite on the top floor (on my second visit). The rooms are quite nice and everything is brand new. The staff was friendly and helpful. The only downside of the hotel, as others have noted, is its location amidst porn shops across from Port Authority. If you can tolerate the half-block walk back to a mainstream neighborhood, the hotel is a good choice.", "title": "Clean and New in Red Light District", "helpfulness": 2, "user": "DCRE", "date": "November 13, 2009", "detail_rating": {"cleanliness": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 49136852}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "About me. Starwood Gold member and used points for two nights at this hotel. Rate I found on line was $315 per night which I felt was high for a Four Points property.", "title": "It's all relative in NYC.....", "helpfulness": 5, "user": "Joski69", "date": "November 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49011995}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Arrived just after 6 a.m. after a redeye from the west coast. Room availability at that hour is always a coin toss but they typically willl check you in when you are part of their \"program.\" In this case hotel was completely sold out the night before. Seeing I was in a jam, the front desk clerk offered me a key to a room that had been vacated but not yet cleaned so I could change into a suit for me meeting. The clerk that came on shortly after, asked for my cell # and called me by 9:20 a.m. with a clean room ready for my use. I've been to 5 star hotels that do not offer that kind of service. Bellman and conierge were also helpful, friendly and cordial each time I encountered them. I cannot say enough about the staff at this hotel.", "title": "lousy location makes this one to avoid", "helpfulness": 1, "user": "jchicago", "date": "November 4, 2009", "detail_rating": {"value": 2.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 48509184}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Location - I had 25th floor at the back of the hotel facing the Westin at 51st and 8th. Noise was absolutely zero. I'm a little confused about the noise complaints from buses in and out of the port authority. There is some traffic in front of the hotel but I saw few buses and anything was rarely moving fast enough to make any noise due to proximity to traffic light and traffic. Perhaps it is louder on lower floors and/or facing another direction. I'm not sure what people expect in NY but there is nothing unsafe about this location. There is one or two adult bookstores on the block but never did I encounter anyone loitering and feel uncomfortable at any of the day or late night. Well located to attractions, dining, subway and Times Square. Best to walk 1/2 block to 8th or 9th to get a cab. They were not easy to find in front of the hotel. FInally, this place is great if you are traveling in or out of Newark airport. Very close to the tunnel and you can get a one way charter bus on Coach USA for $15. Door to door in under 40 minutes.", "title": "Great location", "user": "Shanti10", "date": "November 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 48247658}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Rooms - nice decor with minimalist approach to decorating. Beds were very comfortable and clean. Flat screen tv, clock radio with mp3 connection, plenty of outlets to plug things in. Bathroom lacks counter space as do most in Manhattan. Strangest thing to me was having the turn water pressure all of the way on to get hot water. The flat bottom sink would splash everywhere so use caution if you are fully dressed. Great glass shower with good pressure and lots of space. In room safe, iron and ironing board all in good working order. Two free bottles of water per day and wired/wireless internet included throughout the hotel. Yes - the room is small as most are in NYC. If you sit at the desk across from the bed, another person cannot pass behind you. You just dont get square footage in the city so I dont factor this as a negative.", "title": "Good Location, Loud, Slow Internet", "user": "DogsLoveSalsa", "date": "October 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 48196444}], "location": {"country": "United States", "city": "New York City"}, "stars": 3.5, "variance": {"poor": 46, "average": 160, "very good": 411, "terrible": 17, "excellent": 286}, "aka": "4 Points By Sheraton Midtown - Times Square", "slim_ranking": 0.455981941309, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Four Points by Sheraton Midtown - Times Square hotel is in the heart of Manhattan near Port Authority, Hell's Kitchen, Central Park, and Broadway theaters. Our hotel has free wifi and a rooftop bar"}