{"user_rating": 4.5, "review_count": 511, "name": "Four Seasons Hotel Prague", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The Four Seasons is a lovely hotel. It is in a good central location (although Prague is not big so most hotels are reasonably located) near the Charles bridge. The service is wonderful and they have perfected the art of knowing who you are without even asking! I had a room in the older part of the hotel (dating back to the late 1800s) which had high ceilings and a genuine Bohemian chandelier - a really delightful spacious room with all the facilities you would expect in a top hotel. The bar is equally welcoming and cosy. I did not make it to the gym but apparently that was small but first rate. So there is nothing to fault it. The issue is simply one of price. There are a lot of good hotels where you are paying 100-200 euros a night. So if you are going to pay 375 euros a night (including continental breakfast) it gives some pause for thought. Incidentals are similarly priced. 75cl bottle of water $10. I was here on business. If I come back with my family I would like to stay here but I will be seeking a cheaper option. Other people may well feel you get what you pay for. I am glad I had the chance to stay here on someone else's dime!", "title": "Wonderful but expensive hotel", "helpfulness": 1, "user": "Kingmaker", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171551703}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Me and my husband traveled to Prague for the first time in July 2013 and I did a lot of research on hotels. Four Seasons was a no brainer. Located just minutes away from all major attractions and right on the banks of Vltava. Service was just as expected from 5 star hotel, from a Mercedes limousine waiting at airport to flowers and wine in our room.", "title": "Excellent", "user": "Verochka71", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171540709}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "If you stay in Prague this is the hotel to stay at. Wonderful rooms, great restaurant and fantastic staff. We were in Prague for a conference during the hottest week of the Summer. All my clients and colleagues staying at other hotels were very jealous of where I was staying. The lobby was air conditioned, the staff we are friendly as you can imagine and they were ever so helpful in all respects duing my stay.", "title": "This is the place to stay in Prague", "user": "MH2012_13", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171326589}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Amazing hotel in the heart of Prague. My husband and I loved our room, the food and the service! We arrived tired and ready to relax. The room was amazing! We also loved breakfast on the terrace overlooking the river and the city.", "title": "Amazing hotel", "user": "Caroline D", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171171285}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife visited Prague to celebrate our 50th Wedding Anniversary and booked into The Four Seasons. Unbeknown to us a relative had advised the hotel, ahead of our trip, of the reason for our stay so it was a great surprise to find a bottle of bubbly and a cake appropriately decorated for the occasion in our room on our arrival. Well done Four Seasons, that was an extremely thoughtful gesture which was very much appreciated.", "title": "Great Place for a Special Occasion", "user": "HampshireRoamer_11", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171072717}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We had connecting rooms and when we arrived, we found the staff had drawn in the children's bathtub to welcome them to Prague. A tray of sweets awaited them in their room along with booklets of fairy tales.", "title": "Amazing Start to Our Vacation", "user": "Kim G", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170748909}, {"rating": 5.0, "title": "Excelent! Only one caveat", "text": "The staff at The Four Seasons doesn't miss a trick. Everything we wanted, even those things we hadn't known we wanted, was taken care of for us immediately and efficiently. The hotel arranged for transfer to and from the airport. We were checked in quickly. Our rooms were absolutely gorgeous with little thoughtful plusses like adaptor plugs so all our electronics could be easily charged. The bathrooms were large and lovely with wonderful toiletries.", "helpfulness": 1, "user": "Jose Maria F", "date": "August 3, 2013", "id": 170546344}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Breakfast was included with our rooms and it was quite varied and delicious. The staff at Cotto Crudo were always helpful and we enjoyed the food the times we ate there.", "title": "Outstanding hotel and great location", "helpfulness": 3, "user": "Michaelbirmingham4", "date": "July 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168016629}, {"rating": 5.0, "title": "A Dream come true..", "text": "The hotel itself is perfectly located just a block from the Charles Bridge. You're a ten minute walk from Old Town Square and a ten/fifteen minute walk from Prague Castle. We didn't have to take the metro anywhere, but there were two stations very close as well.", "helpfulness": 1, "user": "monteiros", "date": "July 17, 2013", "id": 167943640}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel was a quiet, luxurious place to return at the end of a day sightseeing. The public areas were as lovely as the rooms were.", "title": "not great staff, told us breakfast was included, but found out it wasnt. Crummy gym. specatacular suite with river view", "user": "Ann F", "date": "July 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167942806}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This hotel was in a great location and was very much a Four Seasons through and through. We stayed in a river-view room, which was very beautiful. One thing to note is that the hotel is in very old buildings but has very little of an old feel (basically feels brand new). This could be a plus for some, but if you are looking for something more charming, this might not fit the bill. The food on premises was good and the service was also quite helpful.", "title": "Very nice hotel", "user": "TravelingRoger", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164946649}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Excellency by all means...superb staff, fantastic localisation, one of the best Four Seasons that we ever stayed – the concierge is a must in this establishment. To try to find one complain, the continental breakfast is quite expensive, could be included in the hotel rates.", "title": "Amazing stay in Prague", "user": "JEMGomes", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164055274}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I liked profesional services, very nice equipped room with nice view. The food was very delicious and the presentation of the food was really awsome. Location is in the city centre. There are lots of bars, monuments and green areas around this hotel. The prices are little bit higher but I can recommend this hotel...", "title": "super service", "user": "David R", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163939678}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We arrived in Prague just in time to witness the worse flooding in 70 years. And, the Four Seasons has the perfect river front location! You can walk everywhere to all the main tourist attractions, exclusive designer stores, and the tourist-souvenir shops. The staff is extremely competent without being aloof, stand-offish. The rooms are nice appointed. The restaurant is excellent and we did not think it was expensive for the quality of the food and service received. Despite the rains, we had a wonderful time in a special city in a special hotel.", "title": "Rain and the Perfect Retreat", "user": "eli123499443", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163824898}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed here for two nights on a stopover checkin went well and we were told that we had a two category upgrade to a newly renovated room i asked if this was a river view room and he said no and started a spiel on an upgrade package but stopped mid way thru when he released he had no rooms available seems like a program sell.", "title": "Good four seasons service", "user": "RobertMPerth", "date": "June 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163460270}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Very cosy rooms, somewhat on the smaller size, but its ok from a city hotel. Location is just perfect and because of the nice, old buildings around the hotel, even the view is good - even if not facing the river and the castle district.", "title": "Four Seasons Prague", "helpfulness": 3, "user": "budgee", "date": "March 17, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14348505, "likes": {"liked": "— Location, and the amazing Four Seasons beds", "disliked": "— Staff - especially at Front Desk and Concierge"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "Service was not as excellent as hoped for, the girls at the Front Desk managed not to smile during the whole check-in process even though at the end we really focused and tried to make jokes...", "title": "Excellent business hotel", "helpfulness": 1, "user": "TripAnorak", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 13698628}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We were 4 friends for a long weekend in Prague, asked for two connecting rooms upon reservation but did not get it unfortunately, at least we got two rooms next to each other when double-checking upon arrival. After arriving to our room (on quite maze-like corridors) we just recognized that one of the rooms had a connecting door and the room next to us was empty during our whole stay...", "title": "Everything you expect", "helpfulness": 2, "user": "picky-mann", "date": "February 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13654809, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Concierge was simply stupid, sorry to say that, but really, they did not understand our questions, were unable to book restaurants, give us useful info on city tours...", "title": "Beautiful property, nice room, surly service", "user": "thefoureyedpanda", "date": "January 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 13095022, "likes": {"liked": "— Location and room", "disliked": "— Service"}}, {"rating": 5.0, "title": "wonderfull location", "text": "Also check-out was miserable, it took us almost half an hour, had to ask for Manager to validate a special discount what we got on parking.", "user": "calleywell", "date": "January 28, 2008", "id": 13066445}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Really a good hotel in Prague that will not let you down if you want excellent service! You are made to feel welcome everywhere you go and the front desk/concierge staff are some of the nicest people I have ever encountered. The only thing holding me back from giving it a five star rating are the rooms. I was expecting really comfortable beds and a larger area but was disappointed because the quality of the room was on par with a good Marriott in the states. The location of the hotel is superb as far as walking distance to the St Charles Bridge and old town. I would definitely recommend this hotel if you can afford to splurge and get a larger room. BTW- I booked a Deluxe Room (450 sq ft)", "title": "Fabulous Service!", "user": "Addison_texasWendyw", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10800960, "likes": {"liked": "— the service", "disliked": "— the small feeling of the rooms"}}, {"rating": 4.0, "title": "Great location & helpful staff", "text": "Stayed at the Four Seasons in part due to my husband's conference being there during the last week of September. We found it to be an excellent location and within walking distance of everything we needed. I cannot see renting a car unless you want to get outside the city as everything is an easy walk from this location.", "helpfulness": 3, "user": "ngl", "date": "October 28, 2007", "id": 10408435}, {"rating": 5.0, "stay_parameters": "Stayed March 2005, traveled as a couple", "text": "The rooms themselves were very nice and good sized, especially by European standards. We traveled around Europe before arriving in Prague and had laundry to do and they did an excellent, fast job with them. It was not cheap but if you need it, you need it!!", "title": "The most luxurios with a big disappointment", "helpfulness": 3, "user": "tonintonin", "date": "July 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8212230, "likes": {"liked": "— The Allegro restaurant."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The Concierge was extremely helpful providing us with dinner recommendations each evening that turned out to be great. They also arranged a private walking tour for us that really gave us a great overview of the city. Two friends that we were traveling with wanted to attend a hockey game at the local arena and they arranged that as well. They really did a great job.", "title": "Please beware of these THIEVES", "helpfulness": 20, "user": "walburgerz", "date": "July 19, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8193462}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We did not eat in the restaurant on site except for breakfast and found it to be good for that purpose (although a bit pricey - like most hotel restaurants). The view was incredible from the restaurant.", "title": "Georgeous and in a superb location", "helpfulness": 2, "user": "JD #25", "date": "July 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8192348, "likes": {"liked": "— Four Seasons consistency", "disliked": "— lacked an ATM"}}, {"rating": 5.0, "title": "perfect place", "text": "The location is central--providing easy access to different parts of town.", "helpfulness": 5, "user": "newworker", "date": "July 6, 2007", "id": 8068807}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The service is first-rate. We found that the concierge recommendations were good. The rooms are tasteful, and very comfortable.", "title": "Great location, superb service", "helpfulness": 6, "user": "havaneserule", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8023566, "likes": {"liked": "— Very luxurious; extra large corner room; superb service", "disliked": "— Business center only has 2 computers which are often being used"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "If you have nice weather, lunch on the terrace is a real treat. You can enjoy a view of the river; the food is among the best we had in Prague. Czech food, though good, can be quite heavy, so lighter 4-seasons fare was a treat.", "title": "Location, Location, Location", "helpfulness": 9, "user": "cmvWestSussex", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7711334, "likes": {"liked": "— location and service", "disliked": "— no iron /ironing board"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Upon arrival in Prague, a 4 Seasons mercedes whisked us in luxurious comfort, including chilled water, to the hotel. Although our room wasn't ready at arrival, we were treated to drinks on the lovely deck", "title": "Excellent", "helpfulness": 4, "user": "Gougy", "date": "May 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7703332, "likes": {"liked": "— I liked that there were no dislikes:)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "overlooking the castle and river. Once settled in, we ordered room service and dined on fabulous czech cuisine (the potato soup was sublime). Our large, corner room was well appointed and quite. The location is perfect for exploring Prague by foot and by boat. The Charles bridge and Old Town are both within a few blocks walk. After 4 fabulous days, our 4 Seasons driver not only delivered us to the train station, he brought us and our luggage to the exact spot where the 1st class wagon would be arriving. As novice rail travelers, this", "title": "Full marks to the Four Seasons Prague", "helpfulness": 5, "user": "Abyss4", "date": "May 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7645147, "likes": {"liked": "— overall quality & views", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "stayed here for a weekend in jan. hotel was smaller than usual four seasons without very much in the way of public areas - 1 restaurant, a small bar to the side (whole place smoking, no non-smoking to speak of) and no lounge area. receptionists were very nice and helpful.....concierge on the other hand, very poor. for 6 weeks prior to arrival we emailed the concierge for restaurant and activity ideas - finally 2 days before they sent some info. when i arrived the confirmation notes they had for me (5), 2 of them were wrong. i had arranged a car to pick me up from the airport, didn't turn up; cars were booked for restaurants and theatres but concierge didn't know about them when i arrived. arrived at restaurant for brunch on sunday ---- table was booked for 11pm AND the restaurant doesn't do brunch. the hotel was in very central location and perfect for getting around in the centre - could not fault the position. the room (deluxe double) was standard four seasons fare but my room (top floor) had only a very small window so was quite dark.", "title": "not the usual four seasons standard", "helpfulness": 3, "user": "gascony", "date": "January 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 13045072}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I was surprised to read the previous comment about the FOUR SEASONS PRAGUE---everyone has their own subjective guidelines and expectations, I suppose.", "title": "Intimate and lovely", "helpfulness": 2, "user": "pursuit", "date": "January 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12784887, "likes": {"liked": "— location, service"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stay at the Four Seasons whenever there is one in the cities we visit and thought that this one was lovely.", "title": "Extremely disappointing waste of money", "helpfulness": 6, "user": "gef-atl", "date": "December 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 11994740, "likes": {"liked": "— Convenience to all destinations", "disliked": "— Value and amenities for the price"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Much smaller than others, less opulent (especially compared with the Gresham in Budapest). I guess I do agree that it is not your typical Four Seasons five star hotel, but I think that it does reflect the character of the city of Prague--simple, elegant, friendly.", "title": "Spectacular Service Beautiful Property", "helpfulness": 1, "user": "BelleCo", "date": "November 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11141729, "likes": {"liked": "— Total Luxury", "disliked": "— Can't think of a thing."}}, {"rating": 5.0, "title": "Superb Location", "text": "Our room was perfect, definitely not too small, with a beautiful view of the Charles Bridge and the Vltava. Beautiful fresh flowers in the lobby every day. While there was no coffee maker in the rooms, as with all Four Seasons hotels, there was complimentary coffee/croissants/baguettes every morning in the lobby.", "helpfulness": 1, "user": "voyagersLondon", "date": "November 26, 2007", "id": 11067901}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We loved our stay at the Four Seasons! It just doesn't get any better than this! The hotel was upscale and elegant and the service was top notch and impeccable. A real gem! The only place to stay in Prague!", "title": "Perfect stay! The hotel was top of the line in every way!", "helpfulness": 1, "user": "Sspector", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167728936}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The room was gorgeous, huge bathroom and well lit. The staff can't do enough for their guests. The restaurant is superb. This Four Seasons is a true five-star hotel. We were there for a business meeting. The catered events were awesome, including breakfasts and cocktail receptions.", "title": "Fabulous experience", "user": "bcraig2", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167669245}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I stayed in the hotel just one night while on business in Prague. My room was an attic room (7th floor), but more than spacious for one person, beautifully furnished with a huge bathroom. As soon as you enter the room you feel at home.", "title": "The way it should be", "user": "anlo", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 167184433}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The staff were more than attentive; when I went out for a short walk in the evening and came back to the hotel, the bellboy asked me: \"Hallo Ms. ......, welcome back, did you have a nice walk through Prague\". That he remembered my name was really remarkable, and I was no VIP guest, just a normal business traveller. No matter what kind of room you have booked, they treat you in a very respectful and friendly manner. The same applies to the waiters in the restaurant. They have a beautiful terrace looking onto the river where they also serve small snacks in the evening. Breakfast was good as well.", "title": "Unforgettable Hotel experience.", "user": "puriktan", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167073395}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The only small problem was the noise. It was a very hot evening in Prague, and the whole city seemed to be partying. Obviously this also meant a great demand for police and ambulance vehicles that all moved along the street on which the hotel is situated. Since I had a room facing the street the signal horns were a bit disturbing. If I were to choose this hotel for a very special private trip I would definitely book a room not directly facing the street (although they do have double-glazed windows but I can imagine it is difficult to install windows of the highest sound-proofing class because of the irregular window shapes in the attic).", "title": "Just short of perfect", "helpfulness": 1, "user": "ilangelo", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 165016566}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 5, "variance": {"poor": 5, "average": 22, "very good": 85, "terrible": 4, "excellent": 395}, "aka": "4 Seasons Hotel Prague", "slim_ranking": 0.0357142857143, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 4.5, "location": 5.0}}