{"user_rating": 5.0, "review_count": 585, "name": "Four Seasons Hotel Firenze", "reviews": [{"rating": 5.0, "title": "Fabulous New Four Seasons", "text": "We had a wonderful stay at the Four Seasons Florence. The staff were kind and excellent and when we arrived they gave us a double room upgrade. We also received free breakfast every day (I think both were due to fact we had booked through a preferred partner).", "user": "MissLondon", "date": "August 11, 2009", "id": 37391986}, {"rating": 5.0, "title": "Elegant Addition to Florence's Hotel Choices", "text": "We stayed at the palazzo side of the hotel and I would definitely recommend that over the conventino unless you want to be in a very quiet part of the hotel. The palazzo side has all the restaurants, bar etc and has more of a buzz to it while the conventino side is quite quiet and a 3-4 minute walk from the palazzo (on the other side of the gardens).", "user": "BrynMawrBK", "date": "August 2, 2009", "id": 36507518}, {"rating": 2.0, "title": "Well allow me to disagree", "text": "Our room was very large, had very high ceilings and was beautifully appointed overlooking the gardens (premier room). There was also a huge marble bathroom which is always very nice to have. I would avoid having a room on the ground floor (there are some overlooking the street and they seem to have bars on them which would make it kind of like staying in a cage) though I dont think most rooms with a street view would be a disaster since its on a relatively quiet road.", "user": "travellingKoalas", "date": "July 24, 2009", "id": 35704758}, {"rating": 4.0, "title": "Feeling Guest with a capital G!", "text": "The hotel itself was beautiful and they did an excellent job restoring a historic palace while also giving it a hip and modern feel. You do feel as you are staying in a museum.", "user": "zandkreek", "date": "July 13, 2009", "id": 34600147}, {"rating": 4.0, "title": "beautiful hotel, but charges for it", "text": "We found the service excellent - when we arrived we had an avis rental car that we needed to return and when we asked the concierge how to get to the car rental place he told us not to worry about it and delt with returning the car for us with no fee! They also did not charge to take our bags (luggage) to our room as one person commented.", "user": "sj01", "date": "June 18, 2009", "id": 32600759}, {"rating": 5.0, "title": "Worthy of the Four Seasons Brand Name", "text": "After reading reviews below, I decided to brave the risks of staying in a Four Seasons that occasionally runs out of complimentary poolside ice cream and book a 2 night stay. I did not regret it. Reviews on tripadvisor encouraged me to request a room in the main building -- yes there are 2 buildings/2 entrances on the property. The main building is much more centrally located and closer to the restaurant/bar/pool/workout center/etc.", "user": "HessMug", "date": "August 29, 2009", "id": 39178419}, {"rating": 3.0, "title": "Cipollini's private estate", "text": "The hotel itself is about 7 blocks from the duomo in the center of Florence. It's also a short walk from the David. The grounds are extremely large for the location and it feels wonderfully quaint and removed. My room looked out over the garden and a piano player was stationed on the lawn at night. He was a pretty good pianist as far as I could tell -- playing several Elton John songs in succession -- although I don't consider myself someone worthy of evaluating a pianist. Despite his apparent mastery of the keys, he could be easily muted by closing the bedroom window. The air conditioning in the room worked well and kept me from dying of heat stroke. Free wifi helped me manage my fantasy baseball team into the playoffs.", "user": "bulldog61", "date": "August 28, 2009", "id": 39073554}, {"rating": 4.0, "title": "So much potential but....", "text": "I had one of the best pasta/fish dishes during my week in Italy one night while eating in the restaurant there. The concierge services were utilized and appreciated. I had so much interaction with the concierge desk that my girlfriend accused me of having a thing for one of the women working there. I think she was right.", "user": "Less_is_more2", "date": "August 18, 2009", "id": 38050732}, {"rating": 4.0, "title": "didn't want to leave, but very $$$", "text": "The hotel is expensive, of course, but it delivers reliably and luxuriously.", "user": "triptriptripper22", "date": "August 15, 2009", "id": 37716789}, {"rating": 2.0, "title": "No hot water at the Four Seasons!", "text": "Yes, yes, Yes it is has beautiful rooms, grand gardens but it reflects the personality of Patrllizio Cipollini. His service level is the best that I have witnessed. While sitting in the bar area and trying to draw the attention of someone we watched his party of friends and his hotel manager attract all the attention. While sitting for lunch outside the beautiful Al; Fresco Il Nuovo Ristorante he was the spotlight as other waited for their lunch. I failed to mention all of us were their long before his arrival. And they did run out of ice cream as he was brisked away by several of his top aides.", "user": "Aarti74", "date": "August 12, 2009", "id": 37484962}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This stunning property has everything you could ask for. Nestled in close to the center of the city, this hotel allowes access to beautiful cathedrals, timeless museums, and restaurants that are to die for. The concierge is more then willing to take out a map and point you in the right direction after making you a reservation. Or you can stay on property and enjoy the tranquility of this hidden gem. Sitting on 5 acres of land, this property has two seperate buildings with rooms, beautiful gardens, a swimming pool, and a brand new spa and gym with more then enough amenities. The food is amazing, the staff is well groomed, and the management team is world-class. You will often see the Hotel Manager and the General Manager walking the property greeting guests. I cant wait to go back and never wanted to leave.", "title": "A Hotel Fit for World-class Travelers", "helpfulness": 2, "user": "RJMUTTON", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32461318}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "RJ Mutton", "title": "Four Seasons Florentine Perfection", "helpfulness": 1, "user": "LostInZurich", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31411588}, {"rating": 5.0, "title": "A little oasis!", "text": "I wrote a glowing review upon returning from Florence following our four day trip and failed to post it... suffice it to say that time has not dulled my memory of this wonderful Four Seasons property in a wonderful location just a short stroll away from the Duomo and all the sites. The hotel's private park is a true treasure in a city of treasures. Although the pool was under repair during our visit, the fitness room was of professional quality and the pool promised the same level of enjoyment. The dining, both in the excellent hotel restaurant and in-room, was excellent, and the service of the highest standard. The room, as one would expect in such a location, was palatial and unlike any other accommodation we have experienced.", "helpfulness": 3, "user": "FMP", "date": "May 29, 2009", "id": 31071278}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "All the charm and beauty of the old building, with all the extras youd expect from a fourseasons hotel. We were upgraded to a Junior Suite with a balcony, which was beautiful although I'm sure we would have been just as happy in the standard room. We had cocktails & dinner outside which I would definatly reccomend. The somelier twice reccomended wines that were cheaper than those we asked about & both botlles were delicious. Dinner was exceptional and the service completely made the evening. My husband ordered a pasta course which I decided to skip - only when they brought out his ravioli they also brought a mini version for me \"in case the lady wanted to try it\" !!", "title": "It has to be the best hotel in the world !", "user": "chicago314", "date": "April 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29038551}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "When we were leaving for pisa airport - the front desk looked up the price for a car (270 Euros) and when we decided to opt instead for the direct train from Santa Maria Novella (5 Euros ea - its clean and efficient & I would definatly use it again) they printed off timings, organised a cab to the station and armed us with a couple of cold bottles of mineral water for the journey!", "title": "Amazing hotel, amazing food", "helpfulness": 1, "user": "Fairmont123", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28628789}, {"rating": 5.0, "title": "stay here. probably the best hotel in italy and one of the top in eurpoe", "text": "We stayed here for three nights last week and the hotel was perfect. Outstanding conceirge, hotel staff, door man, everyone was great. Great food. Its only a ten to fifteen minute walk from the main part of town and to be honest, being away from all the noise and husslers is a nice break. The grounds were gorgous. wish we had stayed there the whole trip an not waisted time in Rome.", "user": "scottsdaletraveler", "date": "September 14, 2009", "id": 41474158}, {"rating": 5.0, "title": "The perfect place to burn money", "text": "Pros: It's a Four Seasons", "user": "lovethefoodbiz", "date": "September 13, 2009", "id": 41411511}, {"rating": 5.0, "title": "Absolutely one of the best hotels in the World", "text": "Cons: This property is a little stuffy compared to other Four Seasons.", "user": "Pieterkn", "date": "September 11, 2009", "id": 40922908}, {"rating": 5.0, "title": "Amazing!", "text": "Air conditioning rating (1 = poor 10 = great) = 10", "user": "CharleyToronto", "date": "September 10, 2009", "id": 40624496}, {"rating": 5.0, "title": "The best luxury hotel ever", "text": "We stayed for two nights while on our four city tour of Italy. It was expensive and worth it. We asked the Four Seasons to book a private driving tour of the Chianti region. They set us up with an English speaking driver in a Mercedes Benz E Class sedan. This tour included lunch and private wine tastings. It was one of the trip highlights. The Four Seasons also booked our reservations for Michelangelo's David. We ate dinner at the Four Seasons once and we ate breakfast twice. All meals were at the Il Palagio restaurant outside on the patio. The food and service were both excellent. The room was exquisitely maintained. The pool was clean and refreshing. The gardens were beautiful. There were a couple of service hiccups that were rectified quickly so I won't dwell on them. Overall, we were very pleased with our stay.", "user": "styleandfashion888", "date": "September 10, 2009", "id": 40584821}], "location": {}, "stars": 5, "variance": {"poor": 7, "average": 15, "very good": 45, "terrible": 3, "excellent": 515}, "aka": "4 Seasons Hotel Firenze", "slim_ranking": 0.00649350649351, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Welcome to Four Seasons Hotel Firenze. An enchanted city sanctuary in the midst of Florence, where an art-filled Renaissance palazzo and conventino frame a centuries-old private park. Relax amidst original frescoes and sculptured reliefs, graced by sunlight and airy garden vistas. Sip espresso under majestic trees, lounge by the open-air pool or bask in Italian spa secrets. Wonders of the Uffizi and Duomo are a stroll away. Tuscan hill towns beckon."}