{"user_rating": 3.5, "review_count": 1161, "name": "Four Queens Hotel and Casino", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at the 4 Queens from Thursday, Aug 31 through Monday, Sept 4. We loved it. This is an older hotel and lacks the glitz of the strip hotels. But it is inexpensive and has its own type of charm.", "title": "Good Value for Price", "helpfulness": 9, "user": "Sassycruiser", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5804209, "likes": {"liked": "— Price", "disliked": "— No Pool/Hot Tub"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The staff was very friendly - never heard a cross word from anyone. It was extremely busy and everyone was very friendly.", "title": "The only good thing was the food", "helpfulness": 3, "user": "mrs.bolivar", "date": "September 5, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5772542, "likes": {"liked": "— Great Food", "disliked": "— Uncomfortable rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The room was very clean and the cleaning service was always prompt.", "title": "Would not recommend", "helpfulness": 4, "user": "circusisintown", "date": "September 5, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5771747, "likes": {"liked": "— Location on Fremont Street", "disliked": "— Awful accomodations"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "No complaints - will book here next time we do Vegas.", "title": "Not good", "helpfulness": 1, "user": "mikelam", "date": "July 22, 2006", "detail_rating": {"cleanliness": 1.0, "front_desk": 4.0, "location": 5.0, "value": 1.0, "rooms": 1.0}, "id": 5498579}, {"rating": 3.0, "title": "Satisfactory Room for the Price, Great Location", "text": "We reserved a non-smoking room. My husband is allergic to cigarette smoke. Upon arrival we were told that there were no non smoking rooms left but there was one smoking room available that had recently been remodeled. They would move us to nonsmoking the following morning. The first room had nice decor, was a comfy room overall, but it still smelled of stale cigarette smoke. We would have happily stayed in that room if the smell had not been there.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "July 17, 2006", "id": 5476020}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "I really enjoyed my stay at the Four Queens. My husband plays there from time to time, but not really that much, and we got three nights free and the fourth for $24 by calling and asking what we could get on his player's card. The staff were nice and efficient, the dealers at the blackjack tables were particularly friendly (they swung my husband a free meal at Magnolia's, about a $50 value, despite play that was lower than required for that comp).", "title": "Good Value, Nice Staff", "helpfulness": 15, "user": "JB_L", "date": "July 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5469821}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The rooms are at about a 2-1/2 star level, clean, few have views worth looking at, and are some of the only rooms in Vegas with coffee makers. Having a 1/2 price ticket booth in the lobby is a plus and is centrally located downtown. I'm looking forward to my next stay here.", "title": "4-Queens & Downtown has it all!!!", "helpfulness": 15, "user": "cartert2", "date": "July 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5440453}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We stayed the first two nights of our trip on the strip at the Aladdin. Then stayed two nights at the 4-Queens. Upon arrival I felt as if I were home. The stress of the crowds and walking that accompanies the strip were gone. We arrived earlier than check-in time. They gave us a room anyway. We were put on the 6th floor next to the elevators. With a view of the roof but, who goes to Vegas to look out the hotel window! Unlike some reviewers that states problem with noise. We had two quite nights. The room was a bit small but, clean and comfortable. Maid service, like the rest of the staff was excellent! As for no doorman or bellhops. I did not receive these services at the Aladdin either and the room price was much higher. Gambling in all the downtown casinos was more favorable. If your looking for a posh hotel, stay on the strip. Just make sure to bring plenty of $$$. If your looking to beat the stress and the crowds make the smart choice. Stay downtown at the 4-Queens!!! We seen Gordie Brown next door at the Golden Nugget. Excellent show! The best of the 4 we seen. Proving the 4-Queens and downtown has it all!!!", "title": "A room is just a place to sleep", "helpfulness": 10, "user": "MrsOtter", "date": "June 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 5361956}, {"rating": 5.0, "title": "Great place to stay!", "text": "We stayed with another couple over Memorial Day weekend, so we chose 4Q because of the price. We ended up on the 10th floor with a perfect view of the top of the Fremont Street Experience. As this is an older hotel, the windows aren't sealed as well as newer hotels....we could hear the very early morning street cleanup as well as music rolling from the casinos floors through the windows. The beds were clean but not entirely comfortable, the floors were not filthy but worn, and the bathroom was small. The shower was very small...needless to say, a hotel room is just a place to sleep and that is exactly what we got. Nothing more, nothing less.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 17, 2006", "id": 5356473}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We returned from Las Vegas June 2 after staying 3 nights at the Four Queens. I loved staying on Fremont St. and the hotel was great. The rooms were nice and clean and they included irons, coffeemakers and a hair dryer. The staff was friendly and the service was good. My fiancee and I spent most of our gambling time at the Four Queens. We did look at other places nearby but for nickel video poker the Four Queens is the place to play. The waitresses brought us drinks regularly (all you have to do is give them a nice tip and they keep coming back). Another pleasant surprise was the comps. We came home withe duffel bags, t-shirts etc. We were also treated to a few free meals at Magnolia's Veranda. Next time I plan to go back I will stay at the Four Queens again.", "title": "No Problems at Four Queens", "helpfulness": 7, "user": "dotnchuck", "date": "June 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 5339201}, {"rating": 4.0, "title": "first trip to vegas", "text": "My wife and my first vacation without kids-ever! Stayed at 4 queens through an mlt deal. Was really affordable and a lot of fun. Having stayed downtown and since then, on the strip, i'll take downtown every time! The Queens was lively, friendly, and the room was clean. The front desk was very helpful even making sure we had a ride to the airport when we had to leave. Didn't win any money but hit lots of quads and had a great time. if you like to gamble, this is the location. We never ate at the Queens, but everything else was great. Not only will I stay there again I'll be there in January.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "November 16, 2005", "id": 4122351}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "This was a nice hotel. The check-in was very quick and the staff was very nice. The only complaint I had was the rank smell the room had. It smelled so bad we had to Febreeze it several times to get the stench out.", "title": "Nice Hotel", "helpfulness": 15, "user": "Yaeneth", "date": "November 6, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 2.0, "service": 4.0}, "id": 4089942}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "Overall, a good place to stay for the price and it's right on the Fremont experience which was amazing.", "title": "Best in the West!!", "helpfulness": 9, "user": "alfrae", "date": "October 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4020586}, {"rating": 2.0, "title": "Ok for 29 bucks...", "text": "We have been staying at the Four Queens for quite a few years now and we love it, wouldn't stay anywhere else!!", "helpfulness": 31, "user": "A TripAdvisor user", "date": "October 10, 2005", "id": 4003961}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Stayed here in room 819 on a Tuesday night booked directly through the hotel website for 29 bucks. Check in was less than a minute. Casino is easy to navigate and elevators for both towers easy to find. No security whatsoever checking keys at the elevators. Room was smaller than average motel 6. Bed was similar to sleeping on the floor in comfort level. TV had about 6 or 7 channels. I ended up watching the hotels ammenity channel over and over because the goon and his wife featured were funny to watch. They were SO excited to be at this hotel, it was comical. The worst part of this room was the bathroom. It was the smallest I have ever had. The missing shower tile had been placed on the toilet tank, probably by a guest years previous. The shower drain backed up in less than a minute so you would be mid calf deep in water. The water temp and pressure sucked big time. If you turned the temp up to a decent level, the plumbing behind the wall would vibrate VERY LOUDLY. This would continue to get progressively worse until the knob was backed off enough to give you a nice refreshing ARCTIC BLAST. It would cycle like that throughout the shower. I would not stay again, regardless of the 29 dollar Tuesday. As a side note, the Chicago Brewing Company located inside the casino has excellent pizzas and beer.", "title": "Four Queens-Great place to experience Fremont Street", "helpfulness": 15, "user": "Vickie712", "date": "October 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3987950}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "There's absolutely nothing wrong with the Four Queens. I'm just more of a Strip kind of person.", "title": "Nice change for a night", "helpfulness": 8, "user": "hitraveler76", "date": "June 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5305064}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "But we spent one night at the Four Queens to get the \"downtown experience.\" It was fun. Excellant location right on Fremont Street.", "title": "Great view", "helpfulness": 13, "user": "babs53", "date": "April 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4939595}, {"rating": 4.0, "title": "pleasantly surprised", "text": "The man at the front desk was very pleasant and helpful. We didn't really enjoy lugging our bags through the casino, but that's probably not uncommon. The room was very clean, maybe a little smokey but it gave an old-time Vegas feel. The shower was the absolute best I've ever had ... I must have stayed in there for 30 minutes.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4739487}, {"rating": 4.0, "title": "Very Pleasantly surprised!", "text": "Overall, the Four Queens is a great deal if you don't mind staying off the Strip. We got one night for $35. Its right in the middle of the downtown action.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "February 25, 2006", "id": 4519689}, {"rating": 4.0, "title": "I'll stay again", "text": "My husband and I just returned from a weekend at the Four Queens. We had a room at the top with a wonderful view of the mountains!! We awoke every morning to music floating up from the Freemont Experience. A older hotel, but very comfortable.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "December 13, 2005", "id": 4237971}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 3, "variance": {"poor": 95, "average": 248, "very good": 481, "terrible": 70, "excellent": 267}, "aka": "4 Queens Hotel And Casino", "slim_ranking": 0.451851851852, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}