{"user_rating": 4.5, "review_count": 694, "name": "Four Seasons Hotel Singapore", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "From courteous staff to the most tasty Indian food we have tasted, cleanliness and hygeine to the best quality, we completely loved this property.. I am a vegetarial and my Husband a non-veg it was a delight for both, chef also served special food for my 4.5 years old son.... who thoroughly enjoyed the stay. L'oc'citane toiletries, best ambience and beautiful rooms made our stay highly comfortable. we completely loved it and would highly recomment this.", "title": "Even though i am not a foodie, i have tasted best Indian, food in this hotel, attention to detail, cleanliness -bestest", "user": "MonikaBhardwajBatra", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174237558}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband and I traveled to Singapore last week and stayed at the four seasons for 5 days. From the moment we arrived, we were greeted with warmth and courtesy that was unparalleled the entire trip. Now, it is one thing to get what you pay for in service and efficiency, but what set this property apart from most other hotels we have stayed at, including other Four Seasons, was the friendliness and the attention to detail. The smiles made all the difference! This property did not fall short in any way. The waiters even remembered what dishes I had hoped to try the day before, and made certain they would be available for the day I left! Absolutely delighted and hope to come again. Thank you. -Aishath Nasir Boskma", "title": "Most courteous and warm experience we had!", "user": "tententen", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173993574}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Worth mentioning that I never write reviews but I can not stay quiet about how we felt about this hotel, where we felt it was our home away from home. The Four Seasons team went out of their way to provide us with personal service and ensure we enjoyed our stay. Even before our trip to Singapore Nicolai was coordinating the reservation with us to ensure our stay would be perfect, and if it wasnt because of her we almost canceled our booking. Thank you so much Nicolai! We truly appreciate all your hard work. Check in (at midnight) with Aysha was fast and easy, she offered us a seat while she took care of everything and even walked with us up to the room. From day 1 to day 8 they personalized everything and left a lasting memory for our family. Day One we arrived to our room the table was set up with place mats for each of our children with juice, goodies, and cookies spelling out W-E-L-C-O-M-E, as well as bath goodies in the bathroom specifically for the kids. On the last night as we were checking out they told us Happy Birthday for my son (I thought his birthday was the next day, until I realized it just passed midnight so in reality it really was his birthday). It meant a lot to us that they knew his birthday! A few of their team even gathered in the lobby and sang a quick Happy Bday to my son in the lobby and gave each of my children a small toy! Last but not least the doormen always had a smile on their face and greeted us everytime we walked in and out of the hotel. Young at the concierge was also very helpful with the map and tips on where to go. The comfort of the room was another factor and I could basically go on forever talking about it especially the bedding, but in 4 words this was our home away from home!", "title": "Should be #1 hotel in Singapore -- Home Sweet Home!!", "helpfulness": 1, "user": "AlzaabiFamily", "date": "August 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173218653}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed at the Four Seasons for 2 night...upon arriving was greeted by Sachi....asked for a room in a quiet location...was told that there was a special if i wanted to upgrade....said yes and was given a corner premier room on the couples floor...best room ive stayed in so far..loved the fruit basket and tea with the turndown service....best breakfast selection as well....will be back in Singapore in three months and might try the suite this time...thanks Sachi for the nice upgrade and the tip on the best time to visit Japan", "title": "Four Seasons for me from now on...", "user": "Anovianto", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173156269}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Easy to reach. In the middle of the town. Marina is NOT far away. Service is impeccable. You immediately feel home when You arrive. Help is readily available. Sleep quality is very high. Do not miss. In summary, in a bustling city like Singapore it is a pleasure to be helped personally.", "title": "If You want to feel home in a hectic town this is Your address.", "helpfulness": 2, "user": "Sahnur A", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 172743373}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "My husband and I was checking in to celebrate our honeymoon. Upon arrival, we're being greet by name and wish by the staff on our honeymoon. We feel special and warm on the marvelous staff. We're being upgrade to the couple floor and the room was so romantic feel. We like so much on the small little snacks that place in the room.", "title": "Fantastic room and service", "helpfulness": 1, "user": "lamkf", "date": "August 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172493981}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "This was our first stay in a Four Seasons hotel but we know there's no turning back now! Everything was above and beyond making us feel like very valued customers for whom nothing was too much trouble! The pool and gym are worth a special mention as we were amazed by the standard of the facilities. We were so impressed with this hotel overall that we cancelled the original hotel we had booked for our next stay in Hong Kong to change to the Four Seasons instead!", "title": "Beyond expectations!", "helpfulness": 1, "user": "Manuela M", "date": "August 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172450263}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This is our second time at Four Seasons Singapore. Last year I posted an enthusiastic reception and, this year, our second stay was even better than the first - thing that I thought impossible. Please, notice that on our second visit we came with my parents and a couple of good friends of ours. They all were completely overwhelmed by the perfection of the service provided by Four Seasons Hotel Singapore. I will say again that this is the most elegant hotel in Singapore, everything is so beautifully appointed that one would just hope to live there. But what makes really the difference between Four Seasons Singapore and all the other 5 star hotels is service.", "title": "The perfect hotel.", "helpfulness": 1, "user": "Stefania_P_11_11", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172326035}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "What we experienced at Four Seasons Singapore was not only the most perfect, attentive, exquisite, luxurious service imaginable but it was love, passion, and care provided by the most extraordinary people and professionals who truly love what they're doing and act with genuine respect and caring for their guests. Our sincere gratitude and congratulations go to Mr. Antoine Chahwan, who runs that hotel impeccably and our deep thank you to al the wonderful people who made our stay a truly unforgettable experience: Mr. Zoltan Nyiri, for his outstanding professionalism, the whole team of One Ninety Restaurant - Chef Nicholas Owen, our beloved Mogun, Mark and Justine - Chef Alan Chan of the gorgeous Jian-Nan Chun (the best pecking duck in Sigapore!) Mr. Gavinson and all the bell men. We will never forget our stay at Four Seasons Singapore and this is because all of you.", "title": "Wonderful experience", "user": "RobertZ813", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172234885}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Stayed 4 nights in August. Room excellent, and bed was the best I have ever had in a hotel. Staff very helpful and friendly. Concierge found a discount to the Aquarium, booked tickets and printed them out, saving us much time in line! Only small issue was the high cost of breakfast. But would stay here again without question and would recommend this property.", "title": "Bad Experience for a Luxurious City.", "user": "99Babak", "date": "August 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 172202897}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My family of 5 recently stayed at the Four Seasons Hotel. Nothing was too much trouble. The staff were extremely helpful, the rooms were in excellent condition, the gym and tennis courts well maintained. From the complimentary tea/coffee and pastries each morning to the turn down service each night, everything was five star. We would definitely come back and stay at this hotel again. The staff should be complimented on the level of service they provided.", "title": "Nothing Too Much Trouble", "user": "Reegan S", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171958078}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I stayed for four nights at Four Seasons Hotel. The attention, needs and detail were indeed very well taken care of. When we were on the first night, I decided to book another three more nights in this hotel on the Executive Suite. It really make me feel so comfortable.", "title": "Great place to stay", "user": "Alexkaikeong", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171823244}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "when you enter the hotel immediately you see all the staff trying to make themselves look busy.", "title": "never ending check in", "user": "jb8765", "date": "August 11, 2013", "detail_rating": {"value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 171744863}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "we used to come to four seasons because they have a special welcome for kids. they anything but ignored them.", "title": "A perfect stay", "user": "AngelinaAustralia", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171584570}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "we had a reservation, parents and 3 kids in 2 rooms. we tried to check in into 2 rooms, but they could not find reasonable rooms for us to stay. it took them like couple of hours of asking us to wait while they are working in the computer \"moving other guests\" to finally offer rooms near by.", "title": "First visit to Four Seasons Hotel and hugely impressed!", "helpfulness": 1, "user": "Steve K", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171541786}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "this was a lovely hotel with very friendly and courtous staff . Lovely selection of food for breakfast .Excellent service at the pool .Would certainly return to tis hotel ..", "title": "Lovely hotel excellent location within alking distance of orchard road", "user": "maturecoupleIreland", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118212342}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed here about seven years ago, and it looks like they haven't spent much money on upgrading the hotel since then. The room was reasonably sized but is quite dated now and doesn't feel special. The cafe/ restaurant is a bit bland. Likewise the 'club' space is very gloomy and has poor facilities. The only saving grace for the stay was the gym, which has a lot of up to date Life Cycle machines and a good range of free weights.", "title": "Needs upgrading", "user": "w0nderer", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 118048821}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed on the third night free deal.", "title": "Throughly Enjoyed It", "helpfulness": 1, "user": "Lokim", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117812447}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The location is terrific: one street back from Orchard Road (OR). Access to OR is via an air-conditioned walkway through the Hilton Hotel. It is quiet, surrounded by tree-lined paths and on a hill.", "title": "Pricey and Average", "helpfulness": 1, "user": "Ozwings", "date": "September 1, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 1.0, "service": 2.0}, "id": 117532208}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "The rooms are sizable (deluxe) and well designed - a good size desk, excellent lighting (for reading) throughout, well designed bathroom and very quiet. We were on a non-smoking floor, no children, no noise and no disruptions by staff - the rooms were not cleaned until after midday. Moreover, there was nothing out of place or in need of repair; even the aircon was quiet!", "title": "Nice hotel, but expensive", "user": "TravelingMan999", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117511734}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed there for 3 days for visiting. We arrived late and were tired so not ok for complaining but one of our room had a strong smell (like if an animal had stayed there!).", "title": "Not up to the standard of a Four Seasons!", "helpfulness": 2, "user": "jeanadam", "date": "August 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 116975278}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Breakfast is not good and it is in a dark place.", "title": "Traditionally Lovely Four Seasons in a Great Location", "helpfulness": 1, "user": "kikicole", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116952842}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Concierge was not good, we had the feeling we were annoying her with too many questions. We did ask for a nice peking duck restaurant and it came out to be a bad advice she gave us while after we realized they have a good chinese restaurant in the Hotel.", "title": "Excellent leisure or business hotel", "helpfulness": 1, "user": "TLHD", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116846598}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We wanted to rest around the pool after a full day of walking in the city but we decided not to, the pool is ugly! Absolutely not like on their website!", "title": "Incredibly consistent", "user": "BeenthereAfewtimes", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 116842936}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We will not come back to this hotel if back in Singapore.", "title": "Great Hotel!", "user": "DSS-Bombay", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116747967}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "A completely top notch experience. From the time you enter the property until you leave, every single person strives to make you feel like a valued guest. We recently stayed four nights with our infant son. The hotel furnished a crib and high chair for the room and even a small toiletries kit for him with baby wash, lotion and a diaper.", "title": "Unbelievable Service", "user": "badwaiter", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175186692}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The room was spacious and immaculately cleaned every day. The gym has a nice selection of modern machines and weights, steam room, lap pool as well as a family pool on the rooftop deck. There was never any problem being able to get on a machine.", "title": "World's Top Hospitality!!", "helpfulness": 2, "user": "CL041192", "date": "August 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174826290}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We availed ourselves to the room service a few times as travelling with an infant can be unpredictable. The quality of the offerings was excellent and we were surprised to see a burrata cheese salad imported all the way to singapore. Quite delicious.", "title": "Absolutely out of this world!", "user": "Shawn T", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174653097}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Finally, I will give you an example of the excellent and friendly service you can expect here. One morning at breakfast, my wife was speaking with our server and said how much she enjoyed the traditional Sinapore breakfast of kaya toast. She asked where she might buy some of the jam that is used on the toast. The server told us that any grocery store would have it but said the best jam was locally made and on offer in her local market. As we were eating breakfast, she brought some kaya toast for us from the kitchen. The next day, she brought the jam from her local market for us. It really made for a nice expereince and we completely appreciated the personalized and friendly treatment. We can't wait to head back.", "title": "Excellent! Excellent! Can't wait to go back", "user": "Rabbit R", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174505971}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "My boyfriend n I have chosen four seasons in Singapore to celebrate our 1st year anniversary and we were glad that we made a brilliant choice!", "title": "Perfect stay. Outstanding service", "user": "Oculis", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174453461}, {"rating": 5.0, "title": "Excellent", "text": "I found the four seasons in Singapore to be an excellent choice of hotel. The facilities were brilliant and the staff very helpful. Being off the hustle and bustle of Orchard Rd was also a good choice. One down side is the fact that a number of larger and nicer hotels seems to be charging for Wifi access.. Surely at top prices this service could be free?. All in all highly recommended", "user": "B_Travel_7", "date": "August 29, 2011", "id": 117386409}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I have stayed in this Four Seasons for 2 nights only, and I wish I had spent there more time to enjoy all the luxuries this hotel lavishes on its guests: swimming pool, tennis courts and so on.", "title": "Superlative Business Hotel", "helpfulness": 1, "user": "Giallo_Rossa_Roma", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117354418}, {"rating": 2.0, "stay_parameters": "Stayed August 2011", "text": "The room was fantastic. I booked a standard normal room, and was amazed how spacious it was. The furniture and all the details were so tasteful and impeccable in all respects.", "title": "Been Better....", "helpfulness": 2, "user": "Firsyclass", "date": "August 27, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 117316063}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The bed and the linen were some of the best I have seen in a long time (and I am a frequent business traveler).", "title": "Excellent Service", "user": "80Newt", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117228299}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Service was impeccable, extremely warm and professional, and delighted to accommodate even some non-standard requests.", "title": "Quality Hotel in a very good location", "user": "Rudolf S", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117012191}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel met and exceeded expectations in every area. Excellent location in the heart of shopping and dining, yet a quick taxi ride to Sentosa Island and other attractions. Room service was amazing every single time we ordered (and we ordered quite a lot), and all requests were met with graciousness and efficiency.", "title": "Five Star Experience", "user": "ilona06", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118663818}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Great hotel- comfortable rooms, good room service, very pleasant and accommodating staff. I would stay here again and look forward to it.", "title": "Great hotel", "user": "Evanston_Jeff", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118582105}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "I had a most excellent suite here for a few days. It was quite impressive actually.", "title": "Excellent Suites", "user": "joesmoe00", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118519028}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The service in the hotel was excellent, however do be advised that a single beer can cost around $25 USD from room service.", "title": "Stay at Regent Four Seasons - Singapore", "user": "SkidMalta", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118317778}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The internet was acceptably fast, skype would disconnect every few minutes though.", "title": "sept 2011", "user": "DavidofTeddington", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118260228}], "location": {"country": "Singapore", "continent": "Asia"}, "stars": 5, "variance": {"poor": 20, "average": 40, "very good": 173, "terrible": 5, "excellent": 456}, "aka": "4 Seasons Hotel Singapore", "slim_ranking": 0.0347222222222, "description": "Nestled in the exclusive tree-lined enclave of Orchard Boulevard, Four Seasons Hotel Singapore is just steps away from the shopping, entertainment and business belt of Orchard Road and a short jog away from the tranquil Botanic Gardens. Located a convenient 25 minutes from the airport and a 15-minute ride away from Suntec City Convention Centre and the Marina Bay area, the Hotel’s ideal location allows the perfect mix of business and leisure. Despite its boutique size the Hotel offers a wide range of facilities – some 6,000 square metres is dedicated to wellness and fitness and a total of 1,565 square metres is allocated for meeting and function events accommodating from 10 to 450 persons in its 2 Ballrooms, 4 Board Rooms and 4 smaller meeting spaces. Recent awards and honours include Travel & Leisure’s World’s Best Awards and Condé Nast Traveler’s Reader’s Choice Awards."}