{"user_rating": 3.5, "review_count": 231, "name": "Four Points by Sheraton Geelong", "reviews": [{"rating": 5.0, "title": "Best Geelong hotel -- by far", "text": "Over the last twelve months I have stayed in the Four Points by Sheraton Geelong on ten occasions, most recently on 9th. August 2005. It is a classy hotel, by far the best in Geelong. Its prominent position on the Geelong foreshore provides great views from its restaurant and many of its guest rooms, particularly from the higher of its seven floors. Corio Bay is literally across the road, where there are many recreational facilities and lovely walks. The Geelong CBD is only two blocks away and at the rear of the hotel is an entrance to one of Geelong's major shopping complexes. The reception desk is sometimes busy, as the hotel is the venue for many conferences and meetings, but check-in and check-out waits are usually short. Staff at the front desk are efficient and pleasant. Concierge car parking is the norm, and is best used. Voracious parking meters line the roadways on all sides of the hotel and allow only 3 hours parking. They operate from 8.00am until 8.00pm and chancing your luck with the parking inspectors is not a wise move. Rooms are small but adequate, with balconies. Guest rooms are always well appointed and presented, and are available as singles, doubles or twins. Bedding is excellent and a choice of pillows is available. Very effective air conditioning with individual controls is fitted in each room. Each room has internet facilities for guests' laptops or through the TV. A number of excellent and well regarded local restaurants are within easy walking distance of the hotel, but its own Waterfront Restaurant should not be overlooked. It serves distinctive, well cooked meals. Its waiting staff are well trained, and always pleasant. This same restaurant is used for the hotel's buffet breakfast, serving any number of juices, cereals, fruits or cooked meals. Cooks will prepare special cooked meals on request. My one grumble about breakfast is the \"stewed\" coffee, which always tastes stale and is sometimes not hot enough. It is freshly prepared but is then stored in metal urns, altering taste and temperature.", "user": "wasamaid", "date": "August 10, 2005", "id": 3752835}, {"rating": 5.0, "title": "Superb", "text": "But under the Sheraton banner the Four Points Geelong is an excellent hotel, in terms of service, facilities and location.", "user": "aliandmark", "date": "April 29, 2005", "id": 3425376}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My partner and i stayed here on xmas eve for one night under their summer package deal.", "title": "Bad experience", "helpfulness": 1, "user": "qprjames", "date": "December 26, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 11971298}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Upon check-in i was not greeted by any kind of 'valet-parking' service. instead i just had to leave the keys at reception, whilst leaving the car on the forecourt. This wasnt a big issue. except when i returned to the lobby area over 45 minutes later, the car hadnt moved and was blocking quite a few cars. This wasnt helped by having small kids running round the car, whom could of quite easily have damaged the car (its was a brand new BMW 5 series worth over $100,000) so you can imagine i was slightly nervous about the situation.", "title": "Nice but lousy service", "user": "chabby73", "date": "December 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 11708561, "likes": {"liked": "— The quality of the rooms", "disliked": "— The service"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I was looking forward to my 'complimentary'coffee and apple pie upon check-in after a fairly long drive. Unfortunately they had run out of apple pie and all they had left were cakes containing nuts, and seeing as i'm ellergic to nuts and my partner does not eat nuts this was not an option!", "title": "Keep away!!", "helpfulness": 2, "user": "sausages71", "date": "December 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 11703331, "likes": {"liked": "— The day i left"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "As regards the bedroom :", "title": "Convenient for Great Ocean Road.", "helpfulness": 1, "user": "nic1047", "date": "November 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10711627, "likes": {"liked": "— Staff", "disliked": "— Slightly tired decor in my room."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The bathroom had a stench of vomit which had obviously been cleaned up a few days prior, but you could still smell it which was slightly offputting when having to use the bathroom.", "title": "Nice indoor pool", "helpfulness": 1, "user": "Epollene", "date": "June 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7857938, "likes": {"liked": "— Good indoor pool"}}, {"rating": 4.0, "title": "Good solid hotel", "text": "The four point sheraton hotel at Geelong fits in line with any of the four points sheraton we've stayed at throughout the world.", "user": "Trekkersocal", "date": "April 24, 2007", "id": 7429836}, {"rating": 5.0, "title": "Best view of Bay!", "text": "The rooms are well appointed, clean, we had two doubles with a nice view of geelong harbor. The bathrooms are clean with bathtubs and all the amenities. internet access is available", "user": "ltamb", "date": "March 1, 2007", "id": 6893709}, {"rating": 4.0, "title": "Enjoyable Stay", "text": "in the rooms but unlike the US, you do have to pay for the access. The lobby does however have 2 computers which if you ask them they will give you 15 minutes complimentary access time (they aren't really checking but just wanting to make sure people aren't spending hours on the computer terminal, if you do go over the amount they charge 2AUD/15 minutes or something like that). There is a beautiful swimming pool, conference room facilities, as well as a small exercise room with a few walking machines, ellipticals, etc.", "user": "Janie M", "date": "February 6, 2007", "id": 6749458}, {"rating": 3.0, "title": "Mediocre, nothing fantastic", "text": "The location is convenient though the night we stayed there was a party going on across the road in some hotel so the noise was loud until around midnight. Otherwise, there is a nice restaurant in the hotel with a buffet (we didn't try it but did look at it and it seemed nice and reasonably priced for hotels). within walking distance, there are a few malls, shopping centres, as well as", "user": "See-to-believe", "date": "January 8, 2007", "id": 6563886}, {"rating": 4.0, "title": "Very nice!", "text": "restaurants near the harbor/wharf area.", "user": "mingmin26", "date": "August 31, 2006", "id": 5730323}], "location": {}, "stars": 3.5, "variance": {"poor": 18, "average": 41, "very good": 98, "terrible": 21, "excellent": 53}, "aka": "Four Points By Sheraton Geelong Hotel Geelong", "slim_ranking": 0.434782608696, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "A great night’s sleep in a comfy bed, amazing views of the bay and a vibrant waterfront location. Free high speed WiFi throughout the lobby and function floors. Great offerings in our waterfront restaurant, bar and lounge. A steam room, fitness centre and indoor, heated, saltwater pool to relax in. Dedicated meeting and function space creating the perfect environment for any event. We’re just the beginning of great new experiences."}