{"user_rating": 4.0, "review_count": 281, "name": "Four Points by Sheraton Eastham Cape Cod", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We knew we wanted to stay midway between Hyannis & Provincetown & I did an online search & found this hotel on Trip Advisor. At first I was skeptical because some of the previous reviewers complained about the odor of chlorine & my husband has asthma & I was concerned. I called the hotel, as reviewers advised, & requested an upstairs room (the hotel has 2 floors). We did not smell any chlorine at all. The only down side to the 2nd floor is that there is no elevator. That was not a problem for us, but if you are unable to climb approximately 10 stairs & carry your luggage up (although the front desk said they would assist us with the luggage, we didn't need the help) I would not advise the 2nd floor. I asked my husband if he noticed anyone in the rooms next door. He said he had. The reason I asked is that I heard no noise whatsoever. The room appears to be soundproof! My husband used the fiitness center & was very pleased. The only problem (& it wasn't that big of a deal) is that some of the machines had TV's & if you didn't have head sets you could not hear. So please bring headsets if you plan on working out. The room was a very nice size and appointed quite well. We did not use the pool, but it was a beautiful looking area. My only complaint is the lack of ligthing on the balcony. The balcony overlooks the indoor pool & with the overhang it tend to be dark. I was able to read out there, but not easily.", "title": "A Pleasnt Stay", "user": "gayler104", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 17577581, "likes": {"liked": "— Location, room size", "disliked": "— For disabled travlers they would be unable to stay on the 2nd floor"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Ended up here with Priceline at an extremely reasonable rate. If you can bit on Priceline and get this place, awesome. I cannot complain about the rate we got in comparison to what it really sells for in season ($350-$400/night).", "title": "Decent place, but some problems", "helpfulness": 1, "user": "traveler4k", "date": "July 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17507265, "likes": {"liked": "— The flat screen television", "disliked": "— the small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The rooms are decently designed. The have flat screen televisions. The bathroom is mediocre at best. The staff is extremely friendly and down-to-earth but they seem understaffed.", "title": "A wonderful deal", "user": "loyalcapecodder", "date": "June 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17177406, "likes": {"liked": "— The food, the pool"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The entire hotel is a non-smoking property. Upon arrival to out room though, it smelled like an ashtray. We were then moved to a room a couple of doors down, which was the same.", "title": "Acceptably Clean; Roomy", "helpfulness": 1, "user": "sillygirl49", "date": "October 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10049273, "likes": {"liked": "— Location", "disliked": "— Food availability"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The area is quite nice and there is plenty to see around this area (Arnold's Seafood and their DELICIOUS homemade ice cream), First Encounter Beach, and Nauset Beach are all within about 5 minutes from the hotel as a drive.", "title": "OK for a Cape Cod hotel, but not great in general", "helpfulness": 3, "user": "BoSox0407", "date": "September 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 8823334, "likes": {"liked": "— No multi-night requirement, close to beach", "disliked": "— Typical Cape Cod hotel...old, dingy, outdated"}}, {"rating": 5.0, "title": "Loved it", "text": "Stayed for 3 days in August 07 and wished we could have stayed longer. Check in staff very friendly and welcoming and room was big and clean. Indoor and outdoor pools and par 3 golf course. Nice mix of older people and families. We are over 50 but dont mind kids. About a 10 minute walk to the restaurants of Main St. We are planning to go back next year for a week. The hotel is a little \"tired\" but there is a very relaxing and friendly athmosphere which puts you in vacation mood.", "helpfulness": 1, "user": "Jdm8109", "date": "September 6, 2007", "id": 8665503}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Nothing fancy but a clean comfortable hotel. We took an outside facing room (not poolside) as recommended here, and the room was nice sized and the beds clean. The location is great, and most of the staff was very friendly. No complaints overall.", "title": "Very nice experience.", "helpfulness": 1, "user": "shlooza1", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8655938}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 31, "average": 64, "very good": 87, "terrible": 10, "excellent": 89}, "aka": "Four Points By Sheraton Eastham Cape Cod Hotel Eastham", "slim_ranking": 0.444444444444, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Four Points Eastham Cape Cod hotel is surrounded by beaches, salt marshes, bike trails, kettle ponds, and forests. Just minutes from Provincetown. Simple Cape Cod at its best."}