{"user_rating": 3.5, "review_count": 645, "name": "Four Points by Sheraton Manhattan Chelsea", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "This was my first trip to NYC so I wanted to be close to the landmarks and the action for a decent price. I got a great deal on Priceline’s “Name Your Own Price”for $125/night for 3 nights and I couldn’t be happier with the hotel they picked for me! I arrived early via the subway and had no problem finding the hotel even though it’s set back and the sign is a bit hidden. Even though I was a few hours early, the front desk promptly checked me in and offered me free NYC maps. I got to my room and realized it was 2 doubles when I had requested a King so I went back downstairs and the friendly hotel staff moved me to a King immediately. The room was indeed small but functional. When you’re in NYC you’re not spending too much time in the room so who cares if it’s tight?", "title": "Great Location, Comfortable Room, Great Trip to NYC!", "user": "Traveler2585", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84326281}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The room smelled very clean and it looked clean too! The bed was amazing, very comfortable. They changed the linens daily for me. The bathroom is about 4 feet from the bed… very close. The bathroom came with the basic shampoo, conditioner and lotion but no body wash (just soap). I didn’t have any problems with water temperature which was nice. The flat screen TV was a good touch, although I didn’t spend much time watching it. I have to agree with others that the shades do not fully block the light. I was facing the street and the room was bright beginning at 7am. I found that with the windows closed I couldn’t hear the usual city noises so I have no complaints about the noise. I also never heard the bar or club that others speak of… maybe because I was on the 11th floor. My room was directly outside the ice machine and I didn’t hear that either. The fire alarm did go off at 3:30am during my stay but no one left… it was shut off within 10 minutes. The lobby has free juice and coffee in the mornings, which is a good start to the day… saves some money!", "title": "Hotel or Hostel?", "user": "Lucian75", "date": "October 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 84271256}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The location is hard to beat for the price! It is so close to the 23rd Street subway stops. I walked everywhere. Times Square is about a 10 minute walk. Empire State Building is close by. I even walked to Rockefeller Center, Battery Wharf, Little Italy, Chinatown and the WTC site from the hotel with no problems. Just bring walking shoes! The neighborhood feels very safe. Even coming back at 4am from Times Square I never felt in danger.", "title": "Solid hotel with good location", "user": "ke1con", "date": "October 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 84270297}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "If I could get a deal like I did this time, I would definitely stay at Four Points Chelsea again! I can’t see paying the sticker price of $395/night though. Overall, I didn’t encounter any problems, the staff was friendly and the location is amazing.", "title": "Great for the Priceline Price!", "user": "apomrink", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84234240}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Even if downtown New York, I was expecting to find a room a little bit bigger than one in hostels.", "title": "Good location, clean and small room!", "user": "HappyGirl60", "date": "October 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 83071235}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The worst hotel I've ever stayed at! I travel for work so I basically live in a hotel, but have never seen a manager so incompetent in my life. We had a wedding party here and it couldn't have gone any worse. We had rates guaranteed that didn't get honored and when we called to discuss, the manager hung up on me. Please don't waste your time here, there are much better hotels for cheaper......", "title": "Terrible! RUN", "helpfulness": 1, "user": "rjbollho", "date": "June 29, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 69084374}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "Well located on the border to Chelsea and easy access to the mass transportation. For a while the flag ship for Four Points Hotel with small but comfortable rooms. Very comfortable bed, small bathroom and sometimes a bit noisy. the last few month the conditions of the rooms changed to the negative side. Service is okay. The price is compared to similar hotels in the neighborhood sometimes too high.", "title": "Good location for night life and ok", "helpfulness": 1, "user": "FreqTravellerMunich", "date": "June 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 68809134}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "great hotel with great staff for the price. it is friendly, clean and great views. i like all the nice amenities like popcorn in the lobby and good coffee in the morning and two computers in the lobby. i have stayed there three times and will be there again in july.", "title": "favorite hotel in nyc", "user": "sushiskynyc", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68546461}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed one night in a king room on the SPG Preferred Guest floor. We used cash plus points for this stay so the cost was so reasonable for NYC. The parking was an additional $30 at a garage a few doors down. There is another garage nearby that charges guests only $25 but is a bit further away.", "title": "Great hotel and a room with a view!", "user": "themadzins", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68343797}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Our room was huge for NYC standards. We had a king bed, a chair and a half, coffee table, desk, and flat screen. From our window we cold see the Empire State Building. That was such a great added bonus. The bath was good and the shower pressure was good. Only drawback in the bath is that storage area is extremely limited. The hotel should consider adding a few extra shelves.", "title": "Worst Value for Money Ever - but nice people and location", "user": "anoush14", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 68308729}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We picked this hotel based on price and location and were happy with both.", "title": "Overall Good Experience", "helpfulness": 2, "user": "Nashman2", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 78319317}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We arrived at noon and were able to get our room right away, a nice surprise. We were on the third floor and faced the back alley, but no surprise based on the good rate we received. The staff was always attentive and nice - and allowed us to store our bags on our last day.", "title": "Not bad for NYC", "helpfulness": 2, "user": "Larzfrommarz", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 77883066}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The Whole Foods a few steps away was a great bonus. The subway lines a short walk.", "title": "AWESOME- No need to look further!", "helpfulness": 2, "user": "NYCGirl16", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75488910}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "One complaint is typical of a lot current hotels. Why provide a flatscreen TV with not a single HD channel? Very poor channel options. Not that were there to watch TV, but still a dissapointment.", "title": "Is this really a Starwood Property?", "helpfulness": 1, "user": "undercovers", "date": "July 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 73069020}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Also, WiFi only in the lobby, another minus.", "title": "great location, clean, comfy bed, what else do you need?", "helpfulness": 1, "user": "welldone99", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72725894}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "This is our third time staying at this hotel. The hotel is in a great location to see New York City.", "title": "ALWAYS A GREAT EXPERIENCE", "user": "mississaugamom", "date": "October 8, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 82624736}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The staff is amazing going out of their way to be helpful. The staff on the front desk is extremely welcoming, nothing is too much of a problem for them, if they are able to help they will.", "title": "Hit or Miss...mostly miss", "user": "Brian W", "date": "October 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 82478001}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The rooms are very clean and quiet.", "title": "Great Price and Location", "user": "tiger02trip", "date": "September 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 81508236}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I have stayed at other hotels in New York City and they do not compare to the Four Points Chelsea.", "title": "ok, far from great...", "user": "omguru", "date": "September 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 80428502}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This hotel is hit or miss. I'm a SPG platinum member and I've stayed at this hotel dozens of times and the regular staff recognize me by face. There is no such thing as an \"upgraded\" room at this hotel cause all the rooms are basically the same. Some have old tube TV's and the newer/upgraded rooms have a flat panel. Other than that there is no difference in rooms. Many times I've checked in with a confirmed king bed reservation and all they have are double beds. As a platinum guest I should ALWAYS get my confirmed reservations regardless of capacity. I always request high floors because the windows aren't that well insulated. If you happen to get a non-street facing room, especially on a low floor, you will be bombarded by noise coming from a bar on 24th street. This bar has an outdoor back patio and the noise carries all the way to the top floor. If you happen to get a room next to an Ice Machine...then goodbye sleep. Another MISS are the pull down shades. While they look modern and trendy they don't block out any light. Good luck trying to sleep in. Once I did have a room with curtains and pull down shades and this was a slight improvement in blocking out the light. When I was there last they were upgrading/fixing the elevators. They did an upgrade to the elevators a few years earlier which resulted in a really bad wood stain on the panels and burlap type of material on the rest of the cab. Unfortunately the stain was very poor and the fabric material is worn and doesn't hold up to the daily wear and tear. Hopefully this has been fixed.", "title": "Very nice", "helpfulness": 2, "user": "JupiterJeff", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79346288}, {"rating": 5.0, "title": "Loved Everything About This Place", "text": "I've been coming to NY on business for several years and this was one of the best experience I've had.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4739372}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "The front staff were more than helpful, the rooms near brand new and kind of chic and very clean and the beds very very comfortable. It was even really quiet which is remarkable in NY. Yes, the room weren't huge but what do you expect in NY and why do you want to be in your room when you have this amazing city to explore.", "title": "Great room-super clean-helpful staff--would return for sure.", "helpfulness": 3, "user": "RochesterNYJudyR", "date": "March 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4737326}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "There were endless bars, restaurants, clubs, a cinema, shops, subway and a Whole Foods supermarket within a few blocks and far enough from Time Square to be comfortable.", "title": "Loved it!", "helpfulness": 6, "user": "leftwing", "date": "March 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4736836}, {"rating": 3.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "It was also a lot cheaper than some of the Midtown hotels I've stayed in.", "title": "Good Value, Postage stamp size rooms", "helpfulness": 11, "user": "Msk6261", "date": "February 14, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 4459784}, {"rating": 5.0, "title": "A nice place to stay. Clean, comfortable, and good location.", "text": "All in all great value.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "February 9, 2006", "id": 4450071}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband and I stayed here while finding an apartment in NYC (we recently relocated here from Dallas). This hotel was PERFECT! The staff was friendly, the restaurant on site was amazing (and we're picky eaters), and the location was great too. It was awesome to fall asleep to the lights of the Empire State and Chrysler buildings every night! They also give you complimentary bottled waters and a cupcake upon arrival.", "title": "Perfect", "user": "luvlacandi", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121637968}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "My wife and I stayed here for 2 nights at the end of November. I was traveling for business and she tagged along to spend some time in the city. The location was excellent for us, lots of cool but not ultra trendy shops within a few blocks and plenty of restaurants to pick from. She enjoyed meandering around the day I was in training and felt safe doing so herself. We also walked here from the path train with our suitcases and that was easy-- only about 2-3 blocks.", "title": "Decent rooms, great staff, fantastic location!", "user": "JimR1998", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121561696}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "My wife's main criticism was the non-existent space in the bathroom, not even for laying a toothbrush! A different sink or small shelf could easily be installed to mitigate this. Putting your things on top of the toilet bowl isn't the solution.", "title": "Not as good as many reviews suggest", "helpfulness": 1, "user": "mlomagno", "date": "December 5, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 121419965}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I didn't particularly care for the restaurant. Breakfast was on the low end of mediocre. You're in NYC-- plenty of places to eat besides here unless you're really pressed for time.", "title": "Great hotel with excellent service!", "helpfulness": 1, "user": "Randi L", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121412453}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The bed was clean and very comfortable. We had a minor issue and a the front desk sent a maintenance guy right away to fix it. Staff was very personable and made some suggestions for places to go. The room was on the small side, but plenty of room for a laptop and work area. We didn't spend much time inside so it wasn't an issue.", "title": "Perfect!", "helpfulness": 1, "user": "toritraveler", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121404081}, {"rating": 5.0, "title": "Fun in the City", "text": "My husband and I stayed at thie Four Points for a long weekend. I could tell we were going to enjoy the stay as soon as we walked into the lobby. The staff were friendly and quickly checked us in. The rooms were a decent size for a New York hotel. I loved the bathroom. It looked like it was right out of a pottery barn catalog page. The beds were extremely comfortable. Complimentary water bottle was a plus! The location was great. We were able to get anywhere in the city we wanted to within 15 minutes by foot or subway. Parking was right around the corner. Would stay here again!!!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 27, 2006", "id": 4392574}, {"rating": 5.0, "title": "New Years", "text": "We had a GREAT TIME! Very reasonable rates, and close to everything. The subway is close so we were able to get to ground zero and times square very easily, and a short walk to 5th Ave for some shopping.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 27, 2006", "id": 4392172}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Also we had the best veiw of the Empire State building, it was beatiful lit up at night.", "title": "Tiny Cool", "helpfulness": 15, "user": "SBCCA", "date": "January 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4391296}, {"rating": 4.0, "title": "The good and the mediocre", "text": "The rooms are bigger than most New York rooms I've stayed in, and have very well appointed decoration. An Indrustrial feel, very clean and healthy, while being comfortable as well.", "helpfulness": 4, "user": "dc929", "date": "January 10, 2006", "id": 4336403}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Lots of help from the front desk, and room service was prompt.", "title": "Great Hotel, Clean and Comfy", "helpfulness": 8, "user": "crestwasere", "date": "January 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4330549}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "My partner and I went to NYC for the Gay Pride Weekend and the Rapture on the River dance on the pier.", "title": "We had a Gay ole Time!", "helpfulness": 15, "user": "muzebiz", "date": "June 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5392369}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We arrived on 25th street by foot, after having taken the Ferry from New Jersey and the free bus from the ferry to 23rd and 7th. We walked two block, turned right and there it was. The location couldnt be beat, it seemed it only cost around $6 in a taxi to anywhere we wanted to go and all of the trains and buses also go right near by.", "title": "Turned out to be a Great Hotel!", "helpfulness": 7, "user": "jaknix", "date": "June 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5368754}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The lobby was well air conditioned much to our immediate relief as it was muggy and sticky outside. The staff was extremely well trained. We checked in and were told that there were no more king rooms left due to the Pride festival going on that week. I replied, firm yet polite, that our rate was for a king room that was confirmed over a month ago and if they wanted to give us a double room they should adjust the price downward because on the internet these rooms were less expensive. After some chatting with co-workers about the situation both there in front of us and on the walkie talkie we were given a suite on the top floor! I was so pleased, I tried to tip Lisa Lew (the front desk person) but she would not accept it. :) We saw the bar but did not drink there, but it was lit up like something in Sex and the City or Queer as Folk. Very chic. The staff always asked if there was anything they could do for us when they saw us in the lobby, as if it were part of their greeting.", "title": "Small Space But Big on Style and Comfort", "helpfulness": 9, "user": "hotelczar", "date": "June 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5366183}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The room was great! There was a balcony overlooking the empire state building! The balcony was shared by the suite next door, but we never saw them or heard them. It would be fun to get the two suites and have a nice party! Nothing over the top mind you, just a nice party and fun in the city.", "title": "Nice hotel for a good price!", "helpfulness": 10, "user": "olliwi", "date": "May 30, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 3.0, "value": 5.0}, "id": 5235343}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "There was a leather love seat that folded out to a bed, a chair for the desk and another comfy chair and a tv in the living room. In the Bedroom was a luxurious king bed with it seemed like hundreds of pillows and another view of the empire state building. There was a 40 inch flat screen plazma tv on an extension bracket that brought the tv almost right over the bed! Excellent to wind down at night with. It looked exactly like the pictures of the suite on their website, but we did not pay the suite price at all! The place was spotlessly clean (even my mother would have liked it!) and the bathroom was huge by NYC standards. We have travelled the world and this suite was holding its own in comparison.", "title": "Good value", "helpfulness": 6, "user": "betakate", "date": "May 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5147169}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Great Location but an average hotel... this is good place if you want a clean inexpensive hotel in a great location. I stay here often when I am just in for a quick trip and need to be in a central location. The people who work here are very nice and the room is clean but small... but if you are in NYC do you really need a big room? I suggest this hotel to anyone who is on a budget but wants a safe, clean and good location hotel. It is right around the corner from Whole Foods... which is great!", "title": "Great Location but an average hotel", "helpfulness": 1, "user": "nychellzkitchen", "date": "January 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123203608}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "First off the Four Points Chelsea is in a great location at 25th and 7th Ave, 1-2 blocks away from numerous subway lines in just north of Chelsea and south of Penn Station, Empire State Building and Madison Square Garden. The staff is very helpful and friendly, the rooms are more than adequate size-wise for a NY hotel, the furniture modern and comfortable, the wi-fi and coffee are free and there's a nice restaurant and bar in the lobby. We got an awesome deal on the room by prepaying the full stay in advance, saved around 25% on the spg.com website. This hotel is quite the bargain and while its operated by a big chain it feels like a small boutique hotel that really focuses on customer experience at the property.", "title": "Clean Comfortable Almost Boutique Hotel in Chelsea", "helpfulness": 1, "user": "WorldTravelerTodd", "date": "January 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123191868}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I have stayed at this hotel many times. It is very centrally located and it is a good value for the price. The staff at the front desk can be a little bit brusque but I have usually had good interactions with them. They are definitely more attentive to Starwood Preferred Guests. I was stuck there for 3 days during a hurricane in August and I was happily surprised that the hotel didn't try to gouge me for the extra 3 days. The rooms are small but well designed and clean. For the money I would definitely recommend this hotel.", "title": "Good value", "helpfulness": 1, "user": "JohnLosAngeles_CA", "date": "January 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 123189923}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband and I used points to stay here for one night during peak holiday time and were pleasantly surprised. We discovered a hip, boutique-style hotel with a decent size (for NYC) and clean rooms, and a very comfortable bed. The location was central to where we wanted to be (the West Village and Madison Square Garden). We would stay here again!", "title": "Boutique-like, comfortable rooms", "user": "lgvt99", "date": "January 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123107308}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "This hotel is in a great location on 25th street bordering the area of Chelsea and the old NYC flower district. Chelsea is our \"artsy\" area with tons of small restaurants, boutiques and it borders the meat packing district in the south. Location of this hotel is excellent.", "title": "Great 4-5 star hotel in NYC", "helpfulness": 2, "user": "NYCshopper", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122991029}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "I stayed at this hotel for three nights, leaving on Christmas Eve. The service was great. The front desk staff was very friendly and accommodating. I needed some extra towels one night, and the were brought up within minutes, which was nice.", "title": "comfortable and quiet", "user": "bsannich", "date": "December 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 122108301}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The room itself was very clean and comfortable. The size was pretty good, too. I had a room with two double beds, and there was still room to put out my suitcase, etc. The bathroom was pretty small, but got the job done. It was clean, which (for me) is more important than size anyways. My only complaints about the bathroom were that every time I took a shower, the floor would get soaked (the shower curtain didn't do it's job very well), and the tub drained slowly. Call me crazy, but I don't like taking a shower and standing in a couple inches of soapy water. I never called them to take care of the drain though, as I think it's a common problem for a lot of hotels. The toilet also had a \"magic flush\" that took some getting used to.", "title": "This Four Points is the best I've been to.", "user": "reachteresa", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122051738}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The view was awesome. I had a room on the 16th floor facing south (1602). I actually think this is not one of their \"city view\" rooms, but I had a great view of the under-construction One World Trade Center. Very cool to wake up to and go to bed to.", "title": "Holiday Time In The Big Apple", "user": "HappyMom_10", "date": "December 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121867883}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The room had an operable window that I used quite a bit to get some fresh air into the room (ok, \"fresh\" is debatable, but some outdoor air). The HVAC didn't seem to work very well, but I can't really comment on it because I bypassed it for the window most of the time. There was a lot of noise at night though - sounded like a rooftop bar was around somewhere (people yelling and screaming and just having a good time). It didn't bother me, but for some people, it may not have been the best situation.", "title": "Small rooms - older", "user": "KJGator", "date": "December 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 121765414}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "The hotel is in a decent location - it's definitely not out of the loop by any means, but it's far enough away from the hustle and bustle of the city to be quiet and comfortable. A couple subway stops are pretty close - I mostly used the 1 on 23rd and 7th or the F on 23rd and 6th. Both were literally a five minute walk and could get you almost anywhere you would want to go. Speaking of 23rd - it's one of the busier crosstown streets and is only two blocks south of the hotel.", "title": "A pleasant surprise at a prime location", "helpfulness": 2, "user": "Yaron G", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121669496}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We stayed five nights from the 12th April at the Four Points Sheraton Chelsea and were extremely happy with our stay. I know the city very well after many visits but my other half had not been before so it was great to have such a good base to explore from.", "title": "Extremely quiet hotel in central NYC and room exactly like website pictures !!!", "helpfulness": 8, "user": "lee_bear", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5030277}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We arrived at Midday on the 12th to drop our bags off expecting that we may have to return later but they allowed us to check into the room straight away, much to the delight of the person checking us in. Honestly she seemed happier about the early check in than we did !!. We had requested in advance a higher floor away from Ice Machines (thanks to the good people writing here) and got a lovely big room (for New York) on the 14th floor. The decor is exactly as shown on the (--) website which we booked through at a rate of $205 a night plus tax which was great value for this modern room. We had a large television, very comfortable bed, very nice bathroom and everything seemed new, there was certainly enough space so we didn't feel cramped at all.", "title": "Good Value for New York", "helpfulness": 6, "user": "Janice G", "date": "April 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5019090}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "I was very happy that there was a free digital in room safe that I have often been charged for elsewhere. The room was so QUIET right in the middle of Manhattan. We could not hear any noise at all from the street or from other rooms which I was particularly pleased about.", "title": "Great NYC hotel, good price", "helpfulness": 8, "user": "VAGurl", "date": "April 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4967302}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Let me stress again, ask for a higher room so you have a view, away form the very noisy ice machines that are on alternating floors, book through starwood(--) to get the cheapest price and you are in for a very nice stay here indeed.", "title": "Great little find! Just avoid room service :)", "helpfulness": 7, "user": "angelovestotravel", "date": "April 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4895262}, {"rating": 3.0, "title": "Helpful staff and clean but not much else", "text": "I recently stayed at the 4 Points Sheraton in Chelsea - very convenient location - I am an artist and wanted to be close to the Chelsea galleries. The rooms are basic, but clean and comfortable. Not terribly noisy except when the garbage is collected. Close to public transport and a quick cab ride if you want to go to the theatre. If you are looking for a hotel with lots of extras, this is probably not it, however if you are looking for something clean, affordable and fairly central then this is very good value. Less crowded than Times Square - you feel as if you are getting a real taste of New York. Across the road on the corner of 7th avenue and West 24th is a real good organic grocery store - they have a take away salad bar that is really good if you are looking for fresh vegetables and are tired of greasy take aways, they also have lots of fresh fruit and a deli. Quick walk to the +-250 art galleries in the district.", "helpfulness": 8, "user": "brevets", "date": "March 29, 2006", "id": 4773899}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I didn't expect much.. so it was great to check into a convenient, tidy, clean hotel with nice staff and great service. Loved the room. It was quiet and reasonably priced. I'll stay there again next time I'm in NYC!", "title": "What a nice surprise!", "user": "af847", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122971850}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Located in Chelsea this hotel is close to the Blue (A,C,E) and Red (1,2,3) subway lines which can basically take you anywhere in New York city if you are keen on transferring trains. The hotel is approx 50m to 2 Bros Pizza (25th St & 6th ave) if you are hungry during the night for a slice of $1 NY pizza.", "title": "Modern and Comfortable!", "user": "eccentriq", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122694671}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "When we checked in on our first night (our first time in New York City) we were warmly welcomed by the receptionist, and greeted every time we returned. In our opinions as students, we thought the rooms were fairly modern with its furnishing & decor - considering how much we paid per night for 2x double beds city view. Complimentary bottled water and ethernet internet made the booking even more worthwhile.", "title": "New Year's Eve Delight", "user": "SyracuseGirl1981", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122475812}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "There isn't much I can say without reiterating what previous guests have said below.", "title": "Great location & new finishes", "helpfulness": 3, "user": "DDMAT2008", "date": "January 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122374488}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This is the 2nd time we stayed at this hotel. Be careful when using some GPS's (especially AT&T's turn by turn directions). It will try to take you to the same address in Brooklyn if you just type in the address with New York, NY. You have to use Manhattan. We were wondering why the GPS had us going a funky way until we realize it was trying to send us to Coney Island (hello)!!", "title": "Great Location in Midtown Manhattan", "helpfulness": 2, "user": "BridesMom2AJ", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122199790}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 48, "average": 143, "very good": 276, "terrible": 30, "excellent": 148}, "aka": "4 Points By Sheraton Manhattan Chelsea", "slim_ranking": 0.656884875847, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Behind our sleek design is the same comfort and service you expect from a Four Points. You won't need to go far to find a great restaurant, gallery or lounge. Over 2000 square feet of meeting space."}