{"user_rating": 5.0, "review_count": 378, "name": "Four Seasons Resort Maldives at Landaa Giraavaru", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here looking for paradise and it was delivered in spades. The staff was exceptional, always smiling, always friendly, addressing us by name for the entire stay after just one day. We stayed in a sunset water villa and it was phenomenal. There are so many areas around it for simply relaxing and enjoying the view. There is even a secluded outdoor bed upstairs tucked away just enough for complete privacy.", "title": "Perfection in every way.", "helpfulness": 3, "user": "Muninn", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161882026}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The bed inside was as comfortable as any I have slept on and the living area, bathroom, and wardrobe closet are all everything you could hope for.", "title": "Neither Photos nor words can describe the beauty of FSLG", "helpfulness": 1, "user": "AussieAnge", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161827771}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This private island could not be more perfect. It is just large enough to make the bicycles that are offered to all the guests the preferred choice to get around. And if you don’t feel like biking, buggies are always available and the paths are beautifully groomed and perfect for a nice stroll.", "title": "a great way to decompress", "user": "thefuzzy", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161716448}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We swam in the ocean amongst the corals and colourful fish just off the pristine white sandy beaches. We enjoyed drinks at the swim up bar at the main pool, and admired the view from the other pool that led onto the nicest beach area of the island. The spa is on stilts and provided an idyllic setting for our couples massage.", "title": "Literally an Island", "helpfulness": 1, "user": "Esteban C", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161101873}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "It never felt busy during our stay, and it was always peaceful and relaxing. The spa was exceptional, the food was excellent at the various restaurants and we especially enjoyed having a private dinner barefoot on the beach.", "title": "Very ,very bad food", "helpfulness": 3, "user": "Martha M", "date": "May 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160808358}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Wow.", "title": "wow surpassed all expectations", "helpfulness": 1, "user": "doctorsanj", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164039615}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "What more can you say about the experience at this resort? I have stayed in many 5 star hotels over the world, ranging from beach resorts to city hotels, including all the major chains and boutique hotels. I have stayed in other Four Seasons. Hands down, this hotel sets the standard for all future stays.", "title": "Superb!", "helpfulness": 1, "user": "AlanHoumann", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163715978}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We spent our honeymoon here and on the way back stayed at Al Qasr in Dubai. The Four Seasons had set the bar so high that even Al Qasr didn't cut the mustard. Im not even sure where to start as I don't have enough superlatives!", "title": "Underwhelming", "user": "Mads4", "date": "June 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 163438219}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "As soon as we arrived at Male airport an hour late due to Dubai delays and were met by a FS rep and whisked through the the private lounge to refresh ourselves with complimentary drinks, we knew that this was going to be special. We were the last to arrive and the sea plane had waited. We were met off the plane by name and taken to what felt like our own personal Guest Experience Manager Aaruni Dwivedi. What an amazing guy. Our full board had been listed as half board and payment hadn't arrived and the room was a twin rather than double villa with sunset view. He took care of it all. No hassles, no worries, just leave it to me he said. No hollow promise either. After I mentioned that the missus couldn't see the sunset from the outstanding water villa, as soon as another became available they moved us. He checked in on us throughout the stay. Didn't attempt to sell us anything, just pleasantly told us what was available should we wish to partake. That was the whole feel of the place, you could do as much or as little as you wanted, spend as much or little as you wanted, and beware it will cost you a 2nd mortgage! BUT you pays your money and takes your choice- you certainly get what you pay for here.", "title": "Excellent Hotel & Service, but needs more warmth..!", "helpfulness": 2, "user": "Taher B", "date": "May 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 162389155}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "You get bikes and snorkle gear complimentary to hold onto for your stay and buggies to and from your room, should you not want to ride bikes. The missus hasnt ridden a bike since age 6 and so I happened to mention this randomly to a guy in white who turned out to be Pierre, assistant Director of Food and Beverage. He offered us a 3 wheeler that the housekeeping use should it be needed. As it turned out it was a great sandy place for the new wife to learn again on 2 wheels!", "title": "Paradise found.", "helpfulness": 2, "user": "nataliehoran", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162259330}, {"rating": 5.0, "title": "Excellant resort", "text": "My wife and I stayed at resort in may and found the resort outstanding, certainly one of the best of the 40 some four seasons we have stayed at thus far.", "user": "scottsdaletraveler", "date": "July 25, 2013", "id": 168935832}, {"rating": 3.0, "title": "Beautiful colors", "text": "We had the beach Vila room with the lap pool and I highly recommend this for its privacy and size. It was like staying in your own beach house. I think it was much nicer and much more private than the over the water villas.", "user": "GrapTwig", "date": "July 23, 2013", "id": 168724917}, {"rating": 5.0, "title": "A fantastic resort with incredible staff who can't do enough for you.", "text": "The staff was great and everyone went out of their way to make our trip special.", "user": "Jenny G", "date": "July 22, 2013", "id": 168555909}, {"rating": 5.0, "title": "The best all rounder in the maldives", "text": "The food was excellant and they had several different types of cuisine to please anyone.", "user": "OllyR84", "date": "July 22, 2013", "id": 168552205}, {"rating": 3.0, "title": "Gorgeous but not WOW enough to justify $$$", "text": "As far as what to bring, my recommendation is as little as possible. Shorts,light tops and sandals.. Leave the designer clothes for your Paris trip because you will have no use for it here.", "user": "SCW61", "date": "July 12, 2013", "id": 167262183}, {"rating": 5.0, "title": "The staff made the trip, and the clear water", "text": "Quick background on me so you all can make more of an informed decision: married, 32, male, no kids,from USA, was here on our honeymoon, I travel mostly high end destinations, I prefer a cheeseburger over steak tartare, and a smile and firm handshake.", "user": "deeriver", "date": "July 11, 2013", "id": 167189237}, {"rating": 5.0, "title": "Outstanding, simply as good as it gets", "text": "This place was f****ng awesome! I mean it. How was it awesome? First, our beach ville with a pool was spacious and private. We stayed in 202, which is one of the more private villas. The lap pool came in handy for those hot days and romance at night. Everyday our villa was cleaned very well by a VERY friendly man--i forget his name--and he did such a great job. Just a few steps away to the beach where you could snorkle etc.", "user": "hnscls", "date": "July 6, 2013", "id": 166530090}, {"rating": 5.0, "title": "Paradise on Earth", "text": "The staff was terrific; even the gardeners said hello and looked you in the eye every, every, every time. The staff at the spa, restaurants, and beaches were so cool. Big shout out to Massooud (sp?) and Andy at Al Bakarat. Pierre, who oversaw the property was a great guy; easy to talk to and checked in every so often. Sometimes he would give us a champagne :) Bella at the dive center who taught my white-- you know what-- how to dive and that is a must if you go to the Maldives in general. She was awesome.", "user": "ZulekhaTabba", "date": "July 3, 2013", "id": 166201555}, {"rating": 5.0, "title": "Quite simply oustanding", "text": "I wish I had more names, buy my memory sucks. So, to the rest at the resort---thank you!", "user": "GPfree", "date": "June 27, 2013", "id": 165418829}, {"rating": 5.0, "title": "Ultimate luxury and amazing service", "text": "There was so much to do that I never got bored during our 9 day stay. Some days I lounged, some I was busy. My wife had a sailing lesson and loved it. Like I said, I managed to dive and drink plenty on the beach.", "user": "kateweb90", "date": "June 17, 2013", "id": 164234220}], "location": {"continent": "Asia"}, "stars": 5, "variance": {"poor": 5, "average": 12, "very good": 37, "terrible": 1, "excellent": 323}, "aka": "Four Seasons Resort Maldives At Landaa Giraavaru Hotel", "slim_ranking": 0.222222222222, "description": "Welcome to Four Seasons Resort Maldives at Landaa Giraavaru. A scenic sea-plane ride from Malé Airport, discover a paradise hideaway where luxurious seclusion meets wild natural beauty. This verdant, beach-fringed coral island offers sophisticated pleasures on land and water – from genuine ayurvedic therapies in the spa to splashing, sailing or diving in the jewel-like Indian Ocean and the Maldives’ most pristine lagoon. Located within the Baa Atoll UNESCO World Biosphere Reserve, Four Seasons Resort Landaa Giraavaru is a remote natural wilderness that invites a sense of discovery."}