{"user_rating": 4.5, "review_count": 1054, "name": "Four Seasons Hotel George V Paris", "reviews": [{"rating": 5.0, "title": "Exceptionally Romantic!", "text": "As noted in many of the reviews already posted about the Four Seasons George V, there is literally *nothing* to criticize about a stay at the George V.", "helpfulness": 32, "user": "A TripAdvisor user", "date": "January 24, 2006", "id": 4385281}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "I suggest to all honeymooners to start your honeymoon at the George V for at least two nights. Do your best to get a room that has a view of the Eiffel Tower (off season helps). The tower is spectacular from the George V and will add so much to the romance of the occasion that it is well worth any extra cost that it might entail.", "title": "Incredible-Best City Hotel in the World", "helpfulness": 21, "user": "luxurytraveler", "date": "January 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4354006}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "I have posted photos from our honeymoon stay taken on September 30 and October 1, 2005. If you want to view more fine photographic images of the Eiffel Tower, the Chagall Ceiling at the Paris Opera, and more, please visit SterlingImages(-).", "title": "Outstanding", "helpfulness": 20, "user": "SpaceHopperSussex", "date": "January 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4335473}, {"rating": 5.0, "title": "Finest Hotel Experience Ever", "text": "Anyone who finds flaws with this property needs to be admitted to a psychiatric facility!! This hotel is perfection in all respects. Definitely ranks as one of the top, if not THE top, city hotel in the world. The only caveat is that it’s also probably one of the most expensive, so beware.", "helpfulness": 26, "user": "MJC73", "date": "January 10, 2006", "id": 4335231}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I took my Company to the George V for our annual dinner this year where we also stayed overnight. It was exceptional. From the pre-stay organisation by the Conference staff to the moment of departure, the service was of the very highest standard and totally faultless in every aspect. I cannot see how it could ever be beaten or even rivalled.", "title": "Best hotel ever!", "helpfulness": 20, "user": "Macsa", "date": "January 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4328702}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Me and my husband returned to Paris and to George V for our honeymoon in October 2005. Everything was perfect!", "title": "Feels like home!", "helpfulness": 8, "user": "Elian", "date": "April 30, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5020798}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We just got back. It was great. The staff was the best. The food was fantastic.", "title": "Excellent for adults but no game room for kids", "helpfulness": 9, "user": "BostonBP", "date": "April 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4995478}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We have an 11 year old and we travel all over the world. No game room and", "title": "Perfect in Paris", "helpfulness": 39, "user": "just up and go", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4476311}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "no kids club. The only thing I did not like was no wireless internet in our room", "title": "George V (Out of V)", "helpfulness": 25, "user": "SELECTASPACE", "date": "February 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4461111}, {"rating": 5.0, "title": "faultless", "text": "and no lcd TV's. We stayed one week. Paris was great.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4457008}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I decided to surprise my mom and take her to Paris before Christmas to do some shopping, having fun, and get in the holiday-mood.", "title": "Four Seasons George V", "helpfulness": 4, "user": "budgee", "date": "March 17, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "rooms": 5.0, "location": 5.0}, "id": 14349027, "likes": {"liked": "— Flower arrangements and Gift Shop", "disliked": "— Service all the way from entering the hotel until leaving it. Horrible!!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I heard George V is the number one hotel in the world so I expected number one service - and we did not get a bit of it.", "title": "Such a great experience!", "helpfulness": 6, "user": "Cedric&Pierre", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14157606, "likes": {"liked": "— Service, atmosphere", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I must tell you, I was really disappointed about it.", "title": "WOW! Defenitely the BEST hotel of the world!!!! MUCH BETTER THAN THE RITZ!", "helpfulness": 3, "user": "rata_200", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13692042, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Location is good, flower decorations just amazing, rooms grandious (a bit funny though, there are lots of prisms and drops missing from the chrystal chandeliers - i guess memorablia for previous guests...), but thats all.", "title": "Little short of perfection", "helpfulness": 4, "user": "Londoner5870", "date": "February 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13629131, "likes": {"liked": "— Peace, calm, quality", "disliked": "— World's most expensive breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Upon arrival our taxi could not take us to the entrance as drive-way was full with cars. We got out on the street, pulled out luggage from trunk while 4 personell was watching us at the entrance - no one helped us, even not, when going towards the entrance!! One just let us in, did not ask if we need help...", "title": "Every year it's as near to perfect as you can get.", "helpfulness": 5, "user": "Kitdiva", "date": "February 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13506778}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We just returned from a 2 night visit to the Georges V to celebrate a special wedding anniversary. This hotel is amazing - down to the last detail, you really do get what you pay for. We booked the hotel's car service from the airport and were met by friendly uniformed staff off the plane and escorted to our car. the driver telephoned through so the concierge and receptionist were waiting for us on arrival at the hotel and all were at pains wo wish us a happy anniversary! We arrived very early (10.30 am)but our room was almost ready. We had a lovely breakfast in La Gallerie and were shown up to our room. They had upgraded us from a Premier Room to the French Suite (I don't know quite how we managed this but it was incredible...I was speechless). The suite had it's own kitchen and private bar, dining area, living area, guest bathroom, large king bedroon, large walk in closet and huge bathroom. There was a view of the marble courtyard and a balcony overlooking it. They have their staff engagement down to a fine art at the Four Seasons...the staff are really empowered to look after you and question anything they're not happy with (our waiter in the bar sent back my husband's dish as he wasn't happy with the amount of salad on it and then came to explain and apologise that our food would be another few minutes...amazing). If you leave a magazine or book open in your room the maid will place a marker in it and close it over...lots of little things which show the staff really think about your enjoyment and your experience. Go now....don't worry about the price...and enjoy it...it's the best in the world. Oh, and try the violet martinis in the bar...delicious.", "title": "The best hotel in the world, without a doubt", "helpfulness": 3, "user": "TravelQueenEdinburgh", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 19040440, "likes": {"liked": "— The bar, the staff, the rooms", "disliked": "— nothing was bad everything was excellent"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Great Four Seasons service, good kid programs, excellent baby sitting service--ask for Agnes Berdugo--main problem is the location--not readily accessible to many tourist sites--closest bus and metro is up on Champs Elysees--which becomes your main source of nearby restaurants and shopping--not my fave part of town. Not really close to parks. Overall however, very plush rooms--we had a two bedroom suite with very fancy livingroom, 2 baths, our own hallway, small but useable kitchen. Staff fully fluent in english but not snobby about speaking french if you are trying!", "title": "posh but ok for kids", "helpfulness": 1, "user": "llamaMamaMarinCounty", "date": "August 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 18517555, "likes": {"liked": "— fancy but not intimidating", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed at the George V for 3 nights in July 2008, it is by all standards spectacular, it has an excellent location just off the Champs Elysee.", "title": "Flawless!", "user": "Salthillhalli", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 18321988, "likes": {"liked": "— Beautiful, clean, spacious", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Upon arrival the service level is second to none, very professional and attentive, the lobby is beautiful, incredible arrangement of flowers. We were personally escorted to our room by the manager on duty, the rooms were spacious (especially considering the size of normal Parisian Hotels), clean and well appointed. The drapes completely blocked out the light (great!), iPod docking station, the beds were so comfortable and the bathroom was a very good size with nice amenities. The hotel provided us with a bottle of Champagne and dessert for my wife's birthday.", "title": "Amazing (but expensive!)", "helpfulness": 3, "user": "KeithLafayette", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 18024260}, {"rating": 5.0, "title": "Fantastic", "text": "The staff are extremely professional, they are very customer focused (honestly some of the best that we have encountered anywhere). As we were traveling all day we went to the spa to relax, the staff were very pleasant, all the amenities that you could ask for were present. The only negative for the entire stay was the hot tub which was more lukewarm.", "helpfulness": 2, "user": "CPGM", "date": "July 17, 2008", "id": 17972785}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I was very surpised at the hospitality the George V staff showed. I had problems with my travel agent and was worried that I would have troubles checking in, but I was proved wrong by the extremely nice staff at the hotel. Everyone was helpful and friendly! I stayed away from the restaurant seeing that a soda was about $20 US. So all I can comment on is the stay itself, not the restaurant. It was comfortable, the rooms were nice and spacious and housekeeping was fantastic. I had the laundry service and my clothes were returned in a few hours. The spa is very nice and the concierge deserves a gold star! They are all fantastic at the concierge desk.", "title": "Friendly Service!", "helpfulness": 2, "user": "mj79Tx", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16863914, "likes": {"liked": "— luxury, location, hospitality, beautiful hotel", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The prices of EVERYTHING at the hotel are outrageous, but it is Paris, you have to expect it.", "title": "Very Nice Hotel", "helpfulness": 4, "user": "JeepChick79", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16738808}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I surprised my mother with a trip to Paris and London. I wanted to stay at the best hotels and per this website I booked at the Four Seasons. The room was very nice and very european. A lot of antiques and furniture I have only seen on TV... I felt a little out of sorts being in the hotel. It is very high class and since my mother and I are just your average middle class Americans we were taken aback. The concerige was excellent and all the staffers were very nice about the language barrier... In all it was a nice visit. Room service was great but very expensive. Just get used to it all being expensive. The hotel is in a great location and very close to the giant Luis Vuitton store if you are into shopping. Paris is gorgeous and the hotel is just another highlight. We did have some interesting encounteres with the locals who seemed to be a little amused by our attire... but oh well we didn't wear the thigh high boots and leggings... it seems most of the women there wear that type of thing. If I ever go back to Paris I would probably stay at a different hotel... Not for anything that the hotel did because it was excellent... but like I said earlier... we felt a little out of sorts being in such a fancy hotel... But it really is a wonderful place and I would highly recommend it.", "title": "Hotel lives up to lofty expectations", "helpfulness": 6, "user": "buccsmf1", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 16546123, "likes": {"liked": "— the staff", "disliked": "— $$$"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "After hearing so much praise about the four seasons paris I certainly went in with very high expectations. And if you don't mind the price, it lives up to every one of them. The service is among the best in the world. Every single encounter with a staff member was pleasant and refreshing. From the concierge to the doorman to the maids, everyone was extremely polite and cheery.", "title": "Geroge V Paris......Perfection", "helpfulness": 2, "user": "NLMLondon_UK", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16426581, "likes": {"liked": "— The luxury and opulance", "disliked": "— Nothing !"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Upon arrival we found out that we had been upgraded one room category to a bigger room. The room itself wasn't all that big but the bathroom was huge. Big tub, amazing shower, and lots of room in general. Our room was on the 6th floor and we could see the top third of the eiffel tower from our balcony. Overall, we were very happy with the room.", "title": "How can you keep me down on the farm...?", "helpfulness": 3, "user": "madamoiselleN", "date": "May 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16358945, "likes": {"liked": "— Seamless attention to detail", "disliked": "— it is expensive"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Lack of Appeal Le Cinq was boring the staff boring rooms small they should be 50M square and everything should have marble", "title": "Hated It", "helpfulness": 9, "user": "DippytheDog", "date": "December 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "location": 1.0, "rooms": 1.0}, "id": 11708636, "likes": {"liked": "— Leaving", "disliked": "— Le Cinq"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I have stayed at many of the top hotels in the world: the Peninsula Hong Kong, the Oriental, the Four Seasons Hotel New York, Peninsula Bangkok, Amanwana. These are just a few. I have stayed at many of the top hotels in Paris. I have also stayed at half of the Four Seasons properties around the world. I usually do not write reviews on tripadvisor, but after reading the latest review which is so outrageously wrong, I felt that I needed to write my review.", "title": "Best Hotel in the World", "helpfulness": 8, "user": "Nachria", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11656191, "likes": {"liked": "— the service is the best in the world", "disliked": "— None"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "In my opinion, the Four Seasons George V is the world's best hotel and the world's best Four Seasons hotel.", "title": "the hotel that proves that flattery will get you anywhere", "helpfulness": 62, "user": "coffeebar", "date": "December 4, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 11242878, "likes": {"liked": "— it is trully perfect in every way", "disliked": "— lif you want luxury AND classy stay at PLAZA ATHENEE"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "ROOMS:", "title": "The Best Hotel Ever!!", "helpfulness": 8, "user": "IrishKaren", "date": "November 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11114350, "likes": {"liked": "— Everything", "disliked": "— Having to leave!"}}, {"rating": 5.0, "title": "Truly Magnifique", "text": "I stayed in a large expansive Deluxe room that overlooked the Marble Courtyard. The room was tastefully decorated as if it was the residence of a French nobleman. It was tastefully decorated in Louis XVth design, but had all of the wonderful amenities of a Four Seasons hotel: sound proof rooms, high ceilings, very soft beds, a large expansive marble bathroom, and Bulgari bath amenities.", "helpfulness": 4, "user": "AstonMartin111", "date": "November 18, 2007", "id": 10904384}, {"rating": 5.0, "title": "Honeymonner's - we loved it!", "text": "Hello all Paris lovers,", "helpfulness": 44, "user": "A TripAdvisor user", "date": "November 6, 2005", "id": 4089342}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Let me start by saying that the few not so kind reviews in here, probably are posted by competitors or very ...strange people.", "title": "A real treat", "helpfulness": 17, "user": "JAS7578", "date": "November 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4077554}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We chose this hotel to be our honeymoon hotel and could not have found a better place!", "title": "Outstanding Stay and Incredible Service", "helpfulness": 37, "user": "W00dy20stkw", "date": "October 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4042257}, {"rating": 4.0, "title": "A bit like home really!", "text": "They say it's expensive, and sure that's true.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 13, 2005", "id": 4019802}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "But the value you get for your money here is unbeatable, in my opinion.", "title": "One of the best", "helpfulness": 18, "user": "Hertshopeful", "date": "October 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4014777}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "GEORGE V - PARIS", "title": "George V - Paris - WE ALL LOVED IT!!!", "helpfulness": 3, "user": "ISOBELA", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13432496, "likes": {"liked": "— location, staff, quality", "disliked": "— all good"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We arrived early christmas morning, after being met by hotel meet and great service at airport. We were then introduced to our driver, who whisked us away in a black mercedes to this wonderfull hotel. We arrived at hotel 11am, i was told the room would not be ready till 3pm, not a problem we booked lunch at la gallarie for 2pm then went for a walk. Lunch was lovely, then we were shown to our room. I had booked an executive room for myself, husband and son, however the duty manager said we had been upgraded to a 1 bedsuite, with amazing views. The suite was lovely, 2 bathrooms, living room etc..... hugh balcony!!", "title": "Rip off...", "helpfulness": 13, "user": "JaseUK1", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 1.0, "rooms": 4.0, "location": 5.0}, "id": 13181863, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "The staff at this hotel are fantastic, they can't do enough for you. We stayed at the ritz last year and George V is every bit as good, we couldn't fault anything. Yes, its expensive, but so is every other 5 star hotel in Paris. We did 3 shows, moulin rouge, Lido and the crazy horse, all brilliant. This hotel is in a great location, you can walk to all the major landmarks of Paris, plus the biggest Louis Vitton shop is at the top of the avenue!!!", "title": "One of My Favourite Places", "helpfulness": 5, "user": "travelfashionista", "date": "January 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13040157, "likes": {"liked": "— The Perfect Paris Experience - Elegance, Understated, Impeccable", "disliked": "— I couldnt move in!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "It's a great place but so overpriced. I wasn't paying but it's obscene they can justify these rates. There are many better places to stay in Paris for 80% less than what you would pay here.", "title": "great hotel", "helpfulness": 3, "user": "rc51", "date": "January 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12909587}, {"rating": 3.0, "title": "expensive", "text": "What a delight! Of course, its rare to find any faults with a Four Seasons property (my other favourite hotel in the entire world is the FS in Hong Kong). But there is something about Paris...and the George V is really the tops. I have stayed in a suite at the Ritz Carlton in Paris, the Intercontinental and other big hotels, many of which are stuffy, tired and over-decorated. The George V combines the old world elegance one expects of a grand Parisian hotel, but without the kitsch cliche's; here you will not find swathes of red velvet and generous gold trim on every surface, nor the trendy dramatic lounge décor typical of the frères Costes. Instead, grand rooms with fresh powder blue and elegant trim, high ceilings, impeccable bathrooms, plush towels, Bulgari bath accessories and a wonderfully well stocked minibar. Indeed, as at most FS properties, it smells like Bulgari everywhere. Staff are polite, extremely accomodating. Food is expensive but fresh and delicious. I went to a reception downstairs which was well-catered, no obnoxious piano music. Lovely, tasteful and perfect all around. And, of course, the location is superb; minutes from all the best shopping Paris has to offer. I LOVE LOVE LOVE this hotel!!", "helpfulness": 10, "user": "3030chris", "date": "January 6, 2008", "id": 12389424}, {"rating": 5.0, "title": "Trop Nouveau Riche à la Theme Park", "text": "Once in a while, we stay a week-end at the Four Seasons George V to check things out. Perfect in everyway, not much to add to what is superficially obvious.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "December 19, 2005", "id": 4250815}, {"rating": 4.0, "title": "A great location", "text": "The décor, although a tad too \"interior-designish,\" works well in combining the original Art Déco and antique furnishings with various newer elements of English Georgean / Queen Anne / Regency, French Empire / Louis XVI / Neoclassical. Among the guest-room furnishing are coffee tables recognized from a well-known European source that one can easily special-order from the States. The overall effect is of a generic upscale beige in the bathrooms, and yellow or blue/gray in the rooms. Gone are the opulent red of the old George V.", "helpfulness": 8, "user": "annalef", "date": "December 12, 2005", "id": 4233106}, {"rating": 5.0, "title": "Probably the best hotel in Paris", "text": "For the pure material level of comfort and service, North American / Canadian style, it is absolutely the ultimate in Paris. And the \"new\" George V itself is quite spectacularly beautiful, especially the courtyard.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 28, 2005", "id": 4147310}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Having said that, however, we must redirect our critique to a more sophisticated level. The service at the Four Seasons George V, while exceptional, is in general too nouveau riche in taste: too friendly, too profusely accommodating, too, too much!!!! Is it THAT necessary always for the restaurant staff to accompany monsieur or madame out of Le Cinq to the toilettes???? Frivolous and embarrasing! But we have to give them credit for doing so with such gusto:\"Je vous accompagne!\" But other times, it's a different story. We lost a scarf in the bar, and the staff was too troubled to be asked to locate it. But they did try...Mind you, we are native Parisian French speakers. (So that goes to show rudeness is democratic in Paris, not just towards Americans!!!)", "title": "A Parician legend", "helpfulness": 48, "user": "CoRo1979", "date": "November 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4100496}, {"rating": 5.0, "title": "Amazing Hotel - Wonderful Stay!", "text": "What we also find disturbing - and sad - is the fact that the George V is now generically referred to as the Four Seasons, with the historic \"George V\" namesake lost somewhere in translation. What a shame! It was an American who initially created this hotel for the Anglophone clientèle, and named it in honor of George V. It is interesting to note that it is the International customers who always refer to it as the George V, while the American guests always call it the Four Seasons, not always aware of the hotel's significant historic American connection (General Eisenhower established headquarter here at the end of World War II), or the fact that Four Seasons is a Canadian chain.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "November 7, 2005", "id": 4092354}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We had a fabulous time at this hotel. Yes, it is pricey but you pay for what you get! Service was fantastic, everything I needed was quickly provided. I stayed with my 8 year old for 5 nights - as a single mom travelling with my child, I felt very safe and pampered.", "title": "Worth it - Pampered and Fabulous", "helpfulness": 1, "user": "Atozz1", "date": "July 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 17818977, "likes": {"liked": "— Plush!!!", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We booked with whatahotel - an online hotel booking site which advertises special savings with their \"virtuoso partners\". This ended up providing us an unbelievable experience -- we were upgraded from a superior room to a HUGE suite!! 2500 euros a night was the posted rack rate in the room. It was amazing! We both burst into giggles when we walked in and saw how huge and elegent the room was! Seperate living room, 1/2 bath, bedroom with walk in closet and huge full bath! I know we can't be gaurenteed upgrades with that quality all the time -- but hey if it only happens once and this is it -- it was so worth it!! We also received free breakfast each morning and a $50 food credit.", "title": "Best Hotel experience of my life...", "helpfulness": 5, "user": "Rawb", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17767968, "likes": {"liked": "— The staff's attention to both detail and their guests comfort", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My daughter liked the kids perks -- her own robe, slippers, disney channel in english, kids room service options, indoor pool, hot-tub - not gigantic but for the city it was good. The other nice thing is coming in from the states early a.m., our room wasn't ready but we were able to go to the spa/pool area where they provided us robes and swimsuits (throw away kind of fabric).", "title": "Beautiful Hotel", "helpfulness": 1, "user": "jax2", "date": "July 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17534051, "likes": {"liked": "— The friendliness of the staff and comfort of rooms.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Paris is (of course) a beautiful city -- this hotel is in an upscale area walking distance to the effel tower and metro (which is super easy to use and better during high traffic times). I enjoyed my experience and this was the best place to stay with my daughter alone. On my next visit I might try another hotel in one of the quaint areas like St. Germain.", "title": "AMAZING service and wonderful staff", "helpfulness": 3, "user": "YumYum2008", "date": "July 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17533311, "likes": {"liked": "— The very helpful staff.", "disliked": "— There was a huge fee for internet connectivity. I think around $50 USD a day."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The title of my review says it all.", "title": "A hotel for those wanting luxury", "helpfulness": 5, "user": "gtahir", "date": "June 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 4.0}, "id": 16881070, "likes": {"liked": "— The service, very prompt and friendly", "disliked": "— Thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Ive travelled quite a bit in 5* hotels around the world - George V is in my opinion one of the best out there.", "title": "One of the best hotels in the world", "helpfulness": 3, "user": "Virs", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20218640}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "First time I ever set foot there was on business, I arrived at 10pm on Thursday night, went straight to my room. At 7am on the following morning, in the elevator on my down to breakfast, the hotel staff greeted me by my name. I was speachless!", "title": "great food", "helpfulness": 2, "user": "SophieBeaumont", "date": "September 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 20170441, "likes": {"liked": "— comfortable surroundings", "disliked": "— position"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The decor is superb, apparently they spend €100,000 per week on flowers alone... And it shows.", "title": "Lovely hotel but would not stay again", "helpfulness": 8, "user": "jrc910", "date": "September 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20102225, "likes": {"liked": "— location", "disliked": "— extremely high prices"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "Staff is attentive and knowledgable, quality is faultless.", "title": "Excellent, but not best in the world for me", "helpfulness": 4, "user": "kingsroadgal", "date": "September 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20044366}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The bar serves great cocktails, they have special martini glasses where the cone-shapped glass sits in ice to keep the drink fresh.", "title": "A truly first class hotel", "helpfulness": 2, "user": "Wendyhouse11", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19050054, "likes": {"liked": "— The mattress with built in fluffy topper", "disliked": "— That we had to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "This is clearly a world-class hotel with prices to match. I spent Christmas here with my mother (we chose Paris as she lives in France and I live in the UK) and overall it was a lovely experience. We booked the Six Senses Package for 3 nights which turned out to be very good value (Superior room, daily breakfast, 3 course dinner at La Galerie each evening and a one-hour daily spa treatment each). It was no more expensive to stay there over Christmas than at any other time of year it seemed which was refreshing given the cost of top UK hotels during the festive period.", "title": "Christmas at George V", "helpfulness": 13, "user": "Mac7471", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12363967, "likes": {"liked": "— The staff and the decor", "disliked": "— The prices were ridiculous, even for Paris"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The room was beautiful and spacious. Only one vanity unit in the bathroom but a separate bath and shower so plenty of space there too. Bulgari toiletries and pretty much every amenity that you can think of (except a coffee maker which you rarely seem to get in top hotels these days). Good entertainment system but very limited choice of DVDs and our dealings with the Business Center on this front were a bit hit and miss. Housekeeping was a different story - it operated like clockwork and the room was turned around very quickly each day and was always fully serviced when we returned from breakfast.", "title": "Treat Yourself.... you deserve it!", "helpfulness": 5, "user": "Gingersheep", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 12332464, "likes": {"liked": "— The sheer indulgence", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Worth the money", "text": "Breakfast in Le Cinq was wonderful, the spa was lovely (good therapists, complimentary herbal teas, coffee and fruit, although arrive in your robe as the locker room is small), and the staff at the hotel work very hard to remember your name and make you feel special. Dinner at La Galerie was ok, but I wouldn't have eaten there more than once if dinner hadn't been included in our package (the food was very pricey for what it was - approx. 275Euros for a 3 course meal for 2 people without wine - and it's less of a restaurant, more of a corridor lounge, with very low uncomfortable chairs). It was also cold in La Galerie every evening due to the draughts coming through the courtyard doors. Having said that, they had live music every night (different types so we never got bored) and it had a nice atmosphere. We also had afternoon tea in La Galerie one afternoon and that was suprisingly reasonable. The hotel was decorated beautifully for Christmas and overall it was a lovely stay. The staff and the decor make it feel special rather than the facilities or the dining in my opinion. However, I stayed at the Peninsula in Hong Kong earlier in the year and enjoyed that more.", "helpfulness": 5, "user": "londonbiztraveller", "date": "January 4, 2008", "id": 12325144}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "We had one issue on checkout. To begin with I was presented with a bill for the package plus all of the included items as additional charges. I asked for these to be removed and the mistake was quickly rectified, although I was informed that dinner in La Galerie was only included up to the value of 80 Euros per person. I told the cashier that this was not reflected on the website, the booking confirmation, or on pre-arrival correspondence and that we had even checked in person with reception on our arrival and had not been informed of the limit then either. The cashier insisted on charging me for dinner each evening over and above the 80 Euros per person and I decided not to argue. However, my mother had a different view and took this up with reception before our departure. They discovered that the French version of the website and package clearly states the 80 Euro limit, but the English version does not. This is something to be aware of if you are booked on the Six Senses package. Reception agreed to request a refund to my card but could not do it there and then for some reason. However, the additional amount was refunded to my card and a credit receipt sent to my home address within a few days of departure.", "title": "None Better!", "helpfulness": 4, "user": "drgene", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11921284, "likes": {"liked": "— The rooms (and especially the bathrooms)!", "disliked": "— Wish the dollar was holding up better against the Euro."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "Loved the George V. I had heard fantastic reviews and believe me this hotel didn't fail to deliver. The rooms were beautifully decorated, service amazing and contrary to other reviews, I felt that the service and attention paid to the staff was second to none. I stayed in The Plaza Athenee last year and have to say the George V was much, much better.", "title": "We all liked it", "helpfulness": 1, "user": "jsimonlondon", "date": "December 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11875024}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 5, "variance": {"poor": 29, "average": 37, "very good": 76, "terrible": 17, "excellent": 895}, "aka": "4 Seasons Hotel George v Paris", "slim_ranking": 0.00669269380926, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Beautiful hotel housed in the former landmark Hotel George V, furnished with objects of art and antiques - Near Champs Elysees."}