{"user_rating": 4.5, "review_count": 832, "name": "Four Seasons Resort Whistler", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "My wife and I decided to drive up to Whistler for our anniversary. We were upgraded to a superior room; plus they had sparkling wine and chocolate dipped strawberies waiting for us in the room! Everything about the resort was top notch. Service was impeccable. We plan on staying at the Four Seasons annually for our anniversary from now on.", "title": "Top Notch", "helpfulness": 2, "user": "yvr->ewr", "date": "June 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5349418}, {"rating": 5.0, "title": "They thought of everything", "text": "I wrote about an earlier expierience at the Four Seasons Prague on tripadvisor and was very dissapointed with the hotel. I have just gotten back from Vanouver and Whistler. I stayed at the Fairmont Vanouver and not the Four Seasons because of the same reason that I was upset in Prague. The property is tired and still had a huge price tag to stay there. So, Reading the reviews about the Four Seasons whistler I decided to give it a shot and I was blown away. Top notch all the way through....PERIOD. This is what the Four Seasons is all about. [----]. The staff was probably the most professional I have ever seen at a hotel. EVERY member of the staff was outstanding. The Hotel is filled with amazing artwork and nice touches abound. When getting there they told me that there were room upgrades available. I saw three different rooms and each one got better. So a good piecce of advise is to see different rooms if you have the chance. I ended up staying in an AMAZING suite. incredible furniture and FLAT screen and beautuful bathrooms. The hotel has a Cadillac Escalade that can take you anywhere in town to and from! I don't want to make this review any longer than I have made it but this was an incredible hotel and expierence. And just to reinforce what I said in the begining is do research on any \"5 star property\" to make sure it's not tired and just banking of the name because that can lead to a bad taste in your mouth. But the Four Seasons Whistler is nothing short of 5 STARS.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 11, 2006", "id": 5331735}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The Four Seasons represents a perfect example of how sometimes you really do get what you pay for. We had nothing but impeccable service from courteous and professional staff from the moment we arrived.", "title": "Worth every penny", "helpfulness": 6, "user": "tjk1976", "date": "June 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5304785}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "We stayed in a \"Premier Room,\" which offered a beautiful mountain views and was on a higher floor in the building. The attention to detail in the room was superb with such amenities as complimentary French toiletry products, a large walk-in closet, private balcony, etc. We booked under the \"BC Retreat to Luxury\" package, which included valet parking (normally $30), a generous room credit for breakfast, and complimentary 4:00 pm check-out.", "title": "Not Your Typical Four Seasons", "helpfulness": 8, "user": "Moses5366", "date": "June 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 5.0, "service": 1.0}, "id": 5299638}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Hotel decor is elegant and classic in style with lots of dark wood throughout, which gives the ambiance of an old stately home. I would give the bed a 10 out of 10 for comfort.", "title": "Five stars for Four Seasons", "helpfulness": 8, "user": "jackfurlongesq_123", "date": "June 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5294173}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "This hotel is one of the best designed of the Four Seasons chain. The rooms are wonderful along with great bathrooms. The views from upper floors are breathtaking. We actually got a great rate on the rooms and the spa services but watch out for the food. Very expensive for all meals and the service was a little spotty for the price. Servings are so small it's almost like toy food. Granted it was off season for them. Maybe the real chef was on vacation but I think the Four Seasons is capable of better and more reasonably priced food. Room service not so good. Be prepared for sticker shock when you check out.", "title": "Gorgeous hotel but pricey", "helpfulness": 3, "user": "garvine", "date": "May 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5180920}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Spent 2 weeks here - as with all of the Four Seasons Properties around the world I have visited could not find anything to complain about at all, save that housekeeping was a little inconsistent with visiting times.", "title": "Outstanding but a little pricey", "helpfulness": 3, "user": "squeekles", "date": "April 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5017729}, {"rating": 5.0, "title": "So good....", "text": "But, having stayed at a number of other 4*+ and 5* skiing resorts around the world I would have to say that with the 4 Seasons Whistler you pay 100% extra cash for a 20% increase in quality / service over other really good properties (but that's probably always the case at this end of the spectrum).", "helpfulness": 4, "user": "hoteljunky", "date": "April 10, 2006", "id": 4957457}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "After a few disappointing stays in Whistler this one certainly hit the mark. Loved the ski valet.... we never want to have to move our own gear ever again. The concierge arranged some great private ski touring around the mountain and a wonderful birthday cake (remembering something said months before over the phone). The rooms were good, especially good baths. On request, housekeeping were very punctual with additional towels etc. Go for an upper floor to avoid the view of the Fairmont parking lot! Finally some excellent ski kit from the rental lodge/shop - overall a great job, thx", "title": "Best concierge staff . Great trip for family of four.", "helpfulness": 10, "user": "Jenny C", "date": "April 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4829610}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "BEST concierge staff: We visited the Four Seasons Whistler from March 4-8, 2006, and enjoyed every aspect of our stay. Of approximately 5 other FS properties, this concierge staff was by far the best! Maria Louisa was exceptional! They booked, rebooked, changed, and modified ski lessons and rentals for my indecisive family of four without batting an eyelash and constantly offering, \"My pleasure,\" astonishingly convincingly! :) The booked dinner reservations at a minute's notice, loaned DVDs to the kids, and offered us cups of chai or hot chocolate upon returning from skiing in the afternoon.", "title": "Awesome", "helpfulness": 6, "user": "Roadster23", "date": "March 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4727167}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Just arrived back from a vacation including a week at the Four Seasons Whistler. Amazing hotel, beautiful interior, the best service of any hotel we've stayed in. Views of the mountain are limited, but still nice, views over the hotel pool is lovely. Parking is a little pricey at $30 per day for valet. Resturant and room service food great.", "title": "Amazing", "helpfulness": 6, "user": "Vancouver2006", "date": "March 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4587154}, {"rating": 5.0, "title": "Fantastic", "text": "Stayed here for a week last March (2005), thought that both the hotel and Whistler were great. Four Seasons hotels have a reputation for great service and on the evidence of this stay it is entirely deserved. Highly recommended.", "helpfulness": 4, "user": "bobsuncle", "date": "January 31, 2006", "id": 4404580}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "We stayed at the hotel from January 21, 2006 through January 27, 2006. For the most part the service was excellent all around. Upon checkin at the hotel they informed us they had upgraded our room four levels. We should have realized something was amiss and basically or room face the courtyard area of the hotel it was very very noisy it was like a window was open. Do not stay in an are facing the hotel. When I called the front desk they immediatley changed our room there was no prolems after that.", "title": "Mostly positive", "helpfulness": 5, "user": "Timmylinguini", "date": "January 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4395933}], "location": {"country": "Canada", "city": "Whistler"}, "stars": 5, "variance": {"poor": 19, "average": 44, "very good": 112, "terrible": 13, "excellent": 644}, "aka": "4 Seasons Resort Whistler", "slim_ranking": 0.0961538461538, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 4.5, "location": 4.5}}