{"user_rating": 4.5, "review_count": 314, "name": "Four Seasons Resort Vail", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I stayed at the Four Seasons Resort Vail-mixing a little business with pleasure. The room was beautiful-complete with fireplace and balcony. Large bathroom included a deep tub, separate shower, his and her sink. Entryway to the room felt like a beautiful foyer with hardwood floors, walk in closet and bar area. Beautiful wood detail throughout the room and the resort. During our stay, the staff was very courteous and eager to please. We enjoyed the lobby settings, deck areas and the pool. The heated salt water pool was very relaxing and a great place to hang out with friends in our group. Excellent poolside service provided heated towels, beverage and food service, even sunscreen.", "title": "Summer Getaway", "helpfulness": 1, "user": "TomKaten", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132570637}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Best Experience-The Spa! I highly recommend massage therapist, Kristen. She is incredibly skilled! I did the 80 minute high-altitude adjustment massage and it was the highlight of my trip. The Spa itself is beautiful and has all the bells and whistles you would expect at a Four Seasons. All the spa staff were extremely friendly and professional. Also purchased the Four Seasons Ginseng facial and buy purchasing both treatments, received a 10% discount on both. Esthetician Michelle gave an excellent treatment! I enjoyed every moment in the spa and can't say enough about the facilities and service. Also, Kudos to the concierge staff for their knowledge and help in selecting excursions.", "title": "Escape to Vail", "user": "Bob M", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132390223}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Most Disappointing Experience-the food. The food prices in general were approximately double the price you would pay anywhere else. For example, $7 OJ, $5 bagel, $19 breakfast burrito. I'm a vegetarian and ordered off the room service menu-unfortunately, I was brought a chorizo burrito. The kitchen quickly replaced it with a vegetarian option, but it still wasn't what I had ordered and because of the ingredients they chose-I couldn't eat it. The entire meal and service was comped-so the only disappointment was the bother of it all and having to wait a little longer to get a good meal.", "title": "Wonderful!", "user": "ms99Eugene", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132381520}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Four Star rating based on friendly staff, great accommodations and amenities and mostly the SPA!! Food prices and quality kept me from giving it a full five star rating. Would definitely go there again!", "title": "WORTH GOING BACK TO!", "user": "goaway46", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132373132}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "My wife and I were attending a 3 week horse show in Parker. They don't show at the beginning of the week so we took the opportunity to beat the heat. The staff were exceptional and the food was exquisite. Where most places handle pets in a negative light, this \"hotel takes pet friendly\" to a whole new level. The chef makes puppy treats and pet amenities are added to the room, including dishes, bed and their own bottled water.", "title": "Beautiful place to stay in a fantastic setting", "user": "Gary W", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132193762}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "My friend and I stayed here recently with our two 11 yr old children during a conference visit and it was amazing. Every detail was perfect. The rooms were spacious, however I was surprised that they had two double beds instead of two queens. This was a little uncomfortable, but the bed itself was delightful. The bathroom was huge and sparkled with granite everywhere, a huge tub for soaking, separate toilet area, and shower stall. The kids were treated like royalty with personalized chocolate chip cookies, a bathrobe with slippers, and hand made artwork waiting in the room upon arrival. The pool was amazing too. Just the perfect temperature for day or evening swimming. Heated bathrobes and towels poolside and a spectacular fireplace to take the evening chill away. The only detraction was that the kids club was NOT supervised as advertised during our stay since we discovered this was their off season and they were not fully staffed. Besides that, the kids club is awesome for kids of any age. They have a PS3, Xbox, foosball table, pool table, and three computer terminals for PC games. Overall our experience was very enjoyable and the property was beyond beautiful. It's conveniently located in the middle of Vail Village and within a short walk of everything.", "title": "Off season stay was outstanding", "user": "Cynthia W", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131411463}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This is a beautiful property with exceptional service. There is a lovely pool area complete with fireplaces, hot tub and delicious food delvoered via poolside service.", "title": "Only the best with Four Seasons.", "user": "onthego2010_10", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130856318}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The spa is just amazing.", "title": "Good", "helpfulness": 8, "user": "happyhappyfamily", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127483653}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The rooms are spacious and very, very comfortable. You never want to leave the room or the property. We ventured out for dinner and were very displeased. We wished we never left there. It was a great stay at a wonderful resort. There was enough to do for pre-teen kids too between the game room, hot tub and pool....", "title": "Excellent Four Seasons Experience", "helpfulness": 2, "user": "tyny77", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127310029}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "No doubt this is a beautiful hotel. Extravagant and luxurious. Heated floors to keep your toes warm on the bathroom floor. Separate shower and bath. Great location and views. But where it lost me was the insane prices. We had breakfast here and ordered one cup of coffee, eggs and bacon, french toast, milk. Normally a $30.00 max meal and we were charged $92.00!!! WHAT?!? I don't care how nice this place is DON'T take advantage of your customers! We may be able to afford your hotel but we don't want to be ripped off! At check out we were charged $40.00 a day for COMPLIMENTARY internet, coffee and access to their vehicle (which we never used). I'm sorry Four Seasons but if you look up complimentary in the dictionary it means \"given free as a courtesy or a favor\". That would mean you are false advertising. My guess is that most people don't look at what they are being charged. I think it's a scam. There are better hotels in Vail that are just as beautiful but treat their customers fairly.", "title": "One of the best hotels I have been to", "helpfulness": 1, "user": "Kelly G", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127244148}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Could not have had a better time. The facilities, service, and people were top notch. Every detail was accounted for and everything at the facility is first rate. The location could not be better. Only negative was that the refrigerator in the room did not get cold enough (nothing the ice machine could not take care of). Would go back here in a heartbeat!", "title": "Awesome getaway for married couple", "helpfulness": 1, "user": "Brett B", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127214455}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Four Seasons Hotels are my favorite group of hotels, and so I was disappointed to find that the Vail property was a mixed bag in my opinion. I read many of the reviews about the hotel before coming here, and find many of them to be accurate. Since I have stayed at many Four Seasons , I had to think about what is lacking at the Vail location and it’s hard to pinpoint. I believe it is something to do with a lack of personality, the hotel is big and corporate as many have stated, much more so than I anticipated even after reading the reviews. You could as well be in business hotel in Denver or any big city, not at one of the best skiing locations in North America. The hotel needs some whimsy, some personality, some touches that make you feel something about the property. One of the other things is that most of the staff are very young, while this in itself is not a problem, some of them just don’t have the gravitas to pull off their positions. ( One standout person that does have it in spades is Nicolas the sommelier – please learn from him! ) I also thought about my stays in NY, Toronto, or LA and each and every time I’ve stayed there, the staff makes you feel special, and while everyone is trying very hard, something is lacking here.", "title": "Mixed Bag at 4 Seasons Vail", "helpfulness": 1, "user": "Sinclair36", "date": "April 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127078935}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Here’s the low down:", "title": "almost perfect", "helpfulness": 1, "user": "colette_m", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126754491}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Largish clean rooms, with very nice bathrooms. Great housekeeping ( if you need something, just request it and they are there – Orlando was very helpful). I loved the foot warmer that smelt of cloves they put in your bed at turn down service ( more touches like this please ) and thought the humidifier was a nice addition.", "title": "Pleasantly surprised but not completely sold...", "helpfulness": 1, "user": "Beth56", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 126751510}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Ski concierge was very good after initial downer of major attitude from 2 of the guys in the equipment rental area.", "title": "Disappointed", "helpfulness": 1, "user": "newyorkgal07", "date": "March 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 126690430}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We arrived late after a long work and travel day and were exhausted after driving from the airport, but we were greeted by the most bubbly doormen and our moods lifted immediately.", "title": "Most Friendly and Helpful Staff", "user": "shanson", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134091480}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "All the staff were helpful and friendly, I even emailed the hotel concierge before our arrival to inquire about white water rafting trips and hiking trails. They emailed be back with different options for both and reserved our white water trip for us.", "title": "An absolute must!", "user": "cgbash", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133946616}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Our first visit to Vail and kind of a birthday celebration for me. We arrived back at the hotel one afternoon to a bottle of Prosecco and chocolate covered strawberries. Delicious!", "title": "Great stay at the Four Seasons Resort Vail !", "helpfulness": 1, "user": "RKS", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133934897}, {"rating": 5.0, "title": "Ski trip", "text": "We will stay here again!", "user": "Felicia811", "date": "July 1, 2012", "id": 133184790}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I can not say one bad thing about this hotel. It's absolutely phenomenal and worth every penny. Frozen grapes poolside, warm towels, warm robes....the staff is out of this world.", "title": "Birthday Celebration", "user": "travelfun234", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132914557}], "location": {"country": "United States", "city": "Vail"}, "stars": 5, "variance": {"poor": 7, "average": 29, "very good": 43, "terrible": 4, "excellent": 231}, "aka": "4 Seasons Resort Vail", "slim_ranking": 0.212121212121, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "At the gateway to Vail Village, Four Seasons Resort Vail presents a fresh interpretation of a grand alpine hotel. With 121 guestrooms, 19 Residence Club units and 16 Private Residences, the Resort features amazing mountain views, a signature restaurant, Flame, and full-service Spa with 13 treatment rooms. The heated pool, flanked by a fireplace, is open year-round. In winter, skiing is a breeze with the Four Seasons Ski Concierge at the base of the Vista Bahn chairlift. In summer, families discover dazzling outdoor enjoyment, with an abundance of activities including horseback riding, fly fishing, zip lining, rafting, biking and more. With the largest guestrooms in all of Vail Valley — each with a soaking tub and a stone fireplace — you may not want to leave the room! Yet the Resort is just steps away to Village nightlife, shopping, al fresco dining and the renowned Village \"apres\" lifestyle Vail is known for."}