{"user_rating": 3.5, "review_count": 1892, "name": "Four Points by Sheraton Los Angeles International Airport", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The rooms in this hotel are like a roadside motel, below expectations for even the budget brand of national chains. Parking is awkward, where you have to walk down a ramp, past the hotel garbage, with no sidewalk, to get into the hotel. Cleaning staff threw away my zip-lock bag needed for TSA and front desk didn't have a replacement to provide. An elevator got stuck, not the one I was on, but they kept us on our elevator so they could work on the stuck one. Terrible experience.", "title": "Rooms are like a roadside motel", "helpfulness": 1, "user": "ScotBChicago", "date": "September 18, 2011", "detail_rating": {"value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 118261006}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The best way to describe the four points is that it once was an old hotel that has been renovated. So the hotel has an old feel about it. There was even a section that looked like the old style motel rooms (rooms with an outside balcony) that has now been enclosed and air-conditioned.", "title": "Rooms pleasant and clean", "user": "Catz22", "date": "September 17, 2011", "detail_rating": {"value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118252276}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Rooms were pleasant and clean. The only downfall is no fridge but they do provide an ice bucket and free ice.", "title": "value for money", "user": "beatric", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 118187244}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "My wife and I stay here a lot. We travel in and out of the US via LAX so the location is perfect for us. If you're in LA on holiday, there are much better locations to stay, but if you're here for business and connecting through LAX, it's hard to beat. You can check in and check out at any time during the day or night, so you're not stuck with that problem of arriving at LAX at dawn, only to be told by reception that your room will not be available until after lunch. The Starwood Preferred Guest system works well and we often get a room upgrade - try not to stay in the Tower but ask for one of the recently renovated rooms on the upper floors of the main building. The new rooms have a strange designer storage system, where you put your stuff in cartons, instead of drawers, but it's no big deal. Four Points has retired the old polyester bed covers and linens, so the beds are comfortable and clean. Check-in could be faster, because they're usually short-staffed, but we like the people and put up with the wait. The coffee shop is over-priced and the breakfast is not great if you prefer to eat healthy, so we drive a mile to Trader Joe's and buy our own ingredients, stopping at Starbuck's along the way. If you don't have a car you can walk to the Starbucks next door in the Marriott. There's an ACE car rental office in the hotel which simplifies returning your car, and Budget car rental is directly across the road. ACE counter staff are incredibly slow at checking out cars, and if there are two or three customers waiting you'll spend at least an hour in line. We've never had any problems with ACE cars and they're much cheaper than Budget, but there are some horror stories about them online that you might want to read before renting - buyer beware. Parking at Four Points is $15 per day, you can usually get an undercover spot which is unusual for the LAX area, and the parking is on the hotel property - unlike the nearby Sheraton which offers parking at a remote site out back of the hotel strip. If you're accustomed to the service levels of a four star or five star hotel in Asia, the Four Points at LAX will come as a major shock - you get your own luggage out of the car, you put it on a luggage cart yourself, and you push it to check-in by yourself - usually while the guys at the concierge desk watch you. But you can get a room more or less any time during the year at under $100, there's a fridge in the room and the internet's free - so if you're a business traveler without a lot of luggage, this hotel saves you money on tips and it's really convenient.", "title": "Not a bad place to overnight near LAX", "user": "stevenUsa", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 118156361}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Nice, clean Sheraton hotel. Nothing fancy, rooms are a bit small, but functional & well maintained. Airport shuttle service is 24 hours & free, but you'll pay to park your car.", "title": "College move-in weekend in LA", "user": "Marlo G", "date": "September 14, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118132348}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I often check reviews on tripadvisor, but do not post. After my stay at the Sheraton Gateway LAX, I have to post. First of all the rate seemed too good to be true. I had read the negative reviews and thought -its a Sheraton property who bad can it be? I booked direct with the hotel. I have stayed at various LAX hotels but never at the Four Points LAX. The rate was what encouraged me to give it a try.", "title": "Does this place have a manager???????????", "helpfulness": 2, "user": "Dot O", "date": "September 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 118365395}, {"rating": 1.0, "stay_parameters": "Stayed September 2011", "text": "When I arrived the lobby looked clean and pleasant. The check in was not warm and friendly. It was very matter of fact.", "title": "RUN!! Spend the money and stay somewhere worth the price!!", "helpfulness": 2, "user": "Jennifer719", "date": "September 19, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 118335857}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "The windows along the walkway to my room were filthy. The maids in the hallway were accompanied by a man that I caught staring into the room of a guest. I looked to see what he was looking at and it was a another female guest (creepy). The windows face into hallway that has windows to the outside. Everyone walking by can see into your room if you raise the blinds. Dirty room service trays were sitting in the hallway.", "title": "Not worth the money", "user": "Carmt", "date": "September 19, 2011", "detail_rating": {"value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 118324224}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My arrival to the room was a huge disappointment. It smelled musty and damp. There were stains on everything. The decorative pillows on the bed looked stained and well worn. The bedspeads were tired. There were no cups for the mini coffee maker. The room was basic old and roughed up. It looked like they had painted over mold in the bathroom. The tub was cracked and stained. The carpet was dirty. There was rust all around the door frame in the bathroom. The A/C did not work well. Then the bed...very tired sagging and old! So uncomfortable. Now I understood the low rate. O and for breakfast you can have for $10.00 (+ gratuity/svc chg) a bowl of oat mill - by the time you add to that coffee and juice (well you get the point a very pricey breakfast. The maids will start yelling down the hall at each other at 6am. They will bang their carts around and do everything to wake everyone up.", "title": "Hotel Disappointment!", "user": "kjc1156", "date": "September 19, 2011", "detail_rating": {"value": 3.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 118315548}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "After looking back through the reviews I now understand. The Manager refers to their remodeling etc. The should advise that for the low rate, you get a room that is subpar to an old Quality Inn. It should be embarrassing to Sheraton to allow these rooms to be in their network. \"Traditional Room\" - means old tired and musty. \"Deluxe\" means we give you the quality that you expect out of Sheraton. I am sure GM Phil will be happy to get all those who are disappointed into one of the \"Deluxe\" rooms for the same low rate when they return -HA! This GM needs to spend some nights in his \"traditional rooms\".", "title": "Just Okay", "user": "hunterkiwi", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 118262504}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We arrived late into the night, but although it was busy, were welcomed, a couple of questions answered and were processed very quickly by the Assistant Manager. Nice to see they still help out at unsocial hours.", "title": "Efficient and friendly", "user": "Eleanor G", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118487441}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Our room was very nice, although a large person would have struggled getting into the bathroom! Very comfortable bed, and quiet aircon to ensure a good sleep before/after traveling. Coutresy bus every 20 mins to/from LAX, and we didn't hear planes at night. Probably as we were inside the building with our window opening onto the corridor to gain borrowed light - this meant we had to pull a roller blind down for privacy, but the effect was excellent - silence.", "title": "Good Hotel with great food", "user": "Dan7482", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118470054}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Lovely pool, rooms spotlessness clean plus above average toiletries and coffee, with pots of liquid creamer not those horrible sachets.", "title": "A GREAT PLACE & Close to LAX", "helpfulness": 1, "user": "hbsurfer1", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 118457879}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We asked about checking out late as our flight wasn't until 1020 pm - extra $40 to keep the room, which we thought wasn't too bad, or they could keep luggage in a baggage room while you used the buffet/ fitness centre/pool - pool has a change room.", "title": "A lot of Hotel for a Reasonable Price", "user": "Lala and Jules C", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118418446}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The free wifi was excellent and as fast as mine at home.", "title": "Tired but home", "helpfulness": 1, "user": "Ojaipeep", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118380799}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Stayed in the Four Points last week.", "title": "Not bad but not the best", "helpfulness": 1, "user": "jodcha", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 118623390}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Hotel lobby looks great! Staff are friendly! But it seems like the last renovation was done only to the lobby. I stayed on the third floor, east tower. Once I got out of the elevator, the hallway smelled…. The room was ok, I am a clean freak on hotel rooms, I have no complain on cleanliness, but the bed was not comfy. You can feel the Box Spring, especially on the edge of the bed… And wireless doesn’t work properly, it only worked on certain “Sweet spot” we found in the room, plus it was slow.", "title": "Relaxed Californian style", "user": "QueueJumper", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118574734}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Did not try their restaurants so cannot comment.", "title": "Worst LAX Hotel", "helpfulness": 1, "user": "1k_living_on_UAL", "date": "September 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 4.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 118568754}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Gym was small, but have everything you need. Usually not crowded. It was divided into two sections, one with the treadmills and bikes, the other for weights etc. The weight room, air conditioning was not working when I was there (all 4-5 times), so if someone is working out in there, the sweat smell can be strong!", "title": "Customer Service", "user": "violatordjjamx", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118538467}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Overall, I do not mind to stay here again, if I have no other options. Stayed at the Sheraton LAX few months back, and it was a MUCH BETTER hotel. I have also stayed in other Four Points in other cities, overall, beside the look for the lobby, this Four Points is below average for this chain.", "title": "Nice stay - would use again!", "user": "kenandem", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118522505}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 3.5, "variance": {"poor": 185, "average": 367, "very good": 606, "terrible": 125, "excellent": 609}, "aka": "Four Points By Sheraton Los Angeles International Airport Hotel Los Angeles", "slim_ranking": 0.208333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Our LAX Hotel is conveniently located near the airport for quick access before and after your flight. Four Points Los Angeles Airport Hotel offers shuttle service to and from the airport."}