{"user_rating": 4.0, "review_count": 373, "name": "Four Points by Sheraton Toronto Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "This was in between flights and was absolutely perfect. Location right next to the airport so we walked over (terminal three)", "title": "One night - layover", "helpfulness": 1, "user": "Livingmydream", "date": "December 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22967567, "likes": {"liked": "— Convenience for travleing in or out of airport to catch another flight.", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Bed was superb, room was huge and very nicely appointed but I think we had an upgrade.", "title": "Great for airport stopover", "user": "AmyCS", "date": "December 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 22870640}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "Reception even at 2 :00 am was good", "title": "Good Airport Hotel", "helpfulness": 1, "user": "RiverCruiser", "date": "December 9, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 22596004, "likes": {"liked": "— shuttle and proximaty to airport", "disliked": "— lobby bare, could use some decorating"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Noise from airport was minimal even though we looked out on a runway (basically)", "title": "Good stopover hotel", "user": "Sylvainautourdumonde", "date": "October 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21230012, "likes": {"liked": "— Location. Good comfortable value", "disliked": "— Restaurant for diner."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Ideal for business travel or layover if you have to fly in or out of Pearson.", "title": "Good place between airplanes", "user": "holidayjunkieBejing", "date": "August 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 18873679, "likes": {"liked": "— The location to the airport", "disliked": "— The confused service regarding my booking."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We had booked a trip to the Dominican Republic and our flight left at 6am. We thought of all the options we had and figured the park-stay-fly deal was pretty good as they have a 24 hour shuttle service...apparently. The room was the smallest hotel room I have ever stayed in, but as we only needed the room for a few hours of sleep it wasnt that big of a deal. We decided to go for a swim in the pool only to find it ice cold. The jets were all turned off and it wasnt swimmable even though the staff said it was good to go. When it finally came time to leave, the shuttle bus took forever to arrive and when it did come there was only enough room for 8 people so a few others had to wait for another half hour. They only have one small shuttle running at any given time which for a busy hotel right beside the airport is a sham in itself.", "title": "More Trouble Than It Was Worth", "helpfulness": 5, "user": "SteelcityHammer", "date": "March 11, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 14216990, "likes": {"liked": "— The bed was comfortable", "disliked": "— The staff, parking situation and attitude."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "The real complaint I have was when we arrived at the airport. We called as soon as we were through customs and were told the shuttle would be there in 5 minutes. Our coats were in my car and most of the people outside waiting for the shuttles were wearing t-shirts or sweaters as they just returned from hot weather. We then saw shuttles for every other hotel you could imagine come by except ours (and a large group of people waiting for the 4 Points as well). Then we saw those same shuttles come back for a second and then third trip. After calling again half an hour later we were told that the bus had already been by and picked up some people. Obviously from the large angry group gathered outside this hadnt happened. 45 minutes pass and another call was made. This time it would be 15-20 minutes wait. We waited for another 10-15 minutes with no luck and decided that an hour wait wasnt worth it so we took a cab for $16. The hotel wouldnt reimburse us and further inquiring let us know that the shuttle bus had actually been broken down for the last hour or 2 and wouldnt be good to go for another 20-30 minutes! Even though we were told it was on its way AND had picked up passengers when it wasnt even possible to do so! Now Im angry and just want to go home. I go out to the parking lot and my car has 4 foot snow drifts on each side. I ask the front desk person if someone will dig me out but he says the maintenance person left at 5:30 pm and that all he could do was lend me a shovel. I was very angry but what choice did I have? Clearly he didnt want to dirty his suit. So I shovel my car out and have to push it out as it was stuck. This took a good half hour and most of the other cars in the parking lot were in the exact same position. Imagine a senior couple having to go out and shovel themselves out and then push their car out to boot! I asked why the snow had not been removed while the maintenance person WAS there and I was told they had a bad couple of days. I am including a couple of pictures to show you what it was like, one of my car and one of a couple in their 60's.", "title": "Well... What's to say really?", "helpfulness": 1, "user": "AstroJunq", "date": "March 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 14216398}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "My recommendation is to stay at the Hilton or Holiday Inn as we saw shuttles coming every 10 minutes for those 2. Do NOT stay here unless you want horrible service. I should also mention that they have a seperate check in for their VIP guests meaning there was only one clerk to check us all in so expect to wait 15-30 minutes.", "title": "Be prepared to wait....", "helpfulness": 2, "user": "Travelling_Axe", "date": "February 3, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 13243000}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "It's an airport hotel. A place you should stay in case of your flight being cancelled or something of sorts.", "title": "Great for a night", "helpfulness": 1, "user": "Heidi-Ann", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 12391785, "likes": {"liked": "— close to airport, comfy beds, clean room, good front desk staff", "disliked": "— poor service from the restaurant."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The room is nice enough and so's the lobby, but nothing special. But then again, that's all you need for a night.", "title": "always good", "helpfulness": 1, "user": "derloc12", "date": "November 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10567302, "likes": {"liked": "— its all good", "disliked": "— ???"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This is an excellent choice is you need a stopover at Toronto Airport. The free airport shuttle picked us up promptly. The receptionists were friendly and helpful. The room was perfect for its purpose. Large, clean and very comfortable beds. For the cost this was an excellent choice and would highly recommend it.", "title": "A great hotel", "user": "AmeliaLeeds", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18647081, "likes": {"liked": "— Convenience and high quality"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Stayed on a Starwood award stay for 2 nights in mid July 2008 with family and 2 young kids. Excellent stay in all respects. Check in and check out were great, the room was very nice with very comortable beds and plenty of channels for the kids, the small pool was great to play in along with the hot tub. The shuttle to the airport was great at 5.20 am. And all the hotel people were just very nice and very helpful. My only complaint was that the restaurant waitress did not come around to refill my coffee in the morning (maybe because it was all I ordered since restaurant prices were quite high). I usually stay in higher class hotels but this one was well worth the Starwood points.", "title": "Excellent Stay", "user": "kpapadop007", "date": "July 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18136312}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Landed at Pearson and called for the shuttle pick up........Took approximately 25 minutes to be picked up even though the hotel is right across the street ? Arrived to the hotel and stopped in the lounge for a quick drink. Very quiet and fairly expensive. Had one draught and it was $7.50. Checked in and was given the 6th floor as a platinum member. It is the Preferred Guest Floor ?? I don't think it is any different than any of the other floors. Room was clean ........Something about the room just did not have that warm, comfy - cozy feeling. Not sure what is was ? Comortable bed as I had a good sleep. Bathroom seemed to be on the small side. My rate included a free buffet breakfast in the morning. Actually a very good choice and excellent breakfast. Not a bad stay at all but nothing to write home about. I would stay there again but only to collect SPG points as a member.", "title": "One night stopover", "user": "okop", "date": "June 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16911936}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "OK - I think most of the reviewers here have this hotel confused with some other hotel ( I think I even read Days Inn in couple of the reviews)...this hotel is f-a-b-u-l-o-u-s and I am hard to please!!", "title": "OMG Loved this hotel!!!", "helpfulness": 1, "user": "mirchi17", "date": "May 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15907414, "likes": {"liked": "— luxurious accomodations, proximity to airport, value for money, free internet, free bottled water", "disliked": "— paid parking"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I booked through travelocity and it was advertised as 3 star near toronto airport for $53/night. And after the hotel name was delivered t omy inbox, I checked online currently their rooms go for $125/night..of course its mid may!! so I was pretty excited..why are reviewers giving this hotel a bad rating? Let me recap what I got:", "title": "Beds were super soft and loved the quietness!!", "user": "Haley250R", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14477978, "likes": {"liked": "— The beds and bes sheets and comforters", "disliked": "— small bathroom area"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "I've stayed here 4 times on business. My first stay was my worst. I had one of the rooms which had not been refurbished, so it was dated, ugly and dirty. I also got a couple bed bug bites, which was confirmed by my doctor. I didn't pay for the hotel stay so I didn't do anything about it. But imagine how horrified I was when I had to stay here again because it's the hotel my former company used for business trips. On my remaining stays everything was fine though. I had the refurbished rooms, which were modern, fairly clean, with extremely comfortable beds/bedding. This hotel is not located at the main terminal so you'll want to keep that in mind if you're booking to catch a next day flight. There's a shuttle which takes you to the other terminals, but I found this inconvenient when trying to make an early flight back home.", "title": "Better since the refurbishment", "user": "nbologne", "date": "March 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 26750512}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "This hotel is horrible for an airport hotel. I would never recommend staying here to catch a flight. I stayed here with myself and 3 other twenty-somethings and the room was incredibly small and the room itself was so hot but the air conditioning did not work. They have ONE shuttle that runs every half hour, but its first come first served. We showed up 15 mins before the shuttle was suppossed to leave and there was aleady at least 15 other people waiting for a shuttle as well. When we asked the hotel staff what we should do, they said to take a taxi (at our expense). Unfortunately, we ended up cutting in front of people as we were already late for the flight. I cant believe they only have 1 shuttle (and its not even a bus, its a van) that serves BOTH terminals 1 and 3. After returning for our vacation, we called promtly after getting of the plane for the shuttle to come pick us up (which we were instructed to do) and we were told they would be there right away. A group of 12 of us (including a small toddler) ended up standing in the freezing cold for over an horu waiting for the shuttle. I phoned 3 times to inquire and twice the lady at the hotel hung up on me. When we finally arrived back at the hotel to pick up our vehicle, I asked the man behind the desk about the issue, and he told me that we must have missed the bus because it came 3 times. None of us 12 people saw the shuttle, so it must have only went to terminal 1. I told him this was ridiculous and he simply shrugged his shoulders and walked away.", "title": "Do not stay here!!!!!!!", "helpfulness": 1, "user": "dancing_queen87", "date": "February 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 25346216}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "I will never stay at this hotel, I would gladly pay a little more and stay at the Radisson or the Holiday Inn which had buses coming about every 10 mins or so.", "title": "Smooth as Silk!", "helpfulness": 1, "user": "garman1986", "date": "January 31, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24065806}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Saw the hotel online as they advertised park sleep and fly. Awesome deal I think. Paid $154 tax included. Parked for 8 days.Check in fast and friendly. Room is very nice. Beds and room very clean. Shuttle service great and on time. Highly recommend! Pop machine scammed me, didn't give pop! Machine on 4th floor.", "title": "Good enough for overnight", "helpfulness": 2, "user": "kelapstick", "date": "December 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 23144906, "likes": {"liked": "— The bed", "disliked": "— They were testing the smoke alarms, but it wasn't a big deal."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The hotel was very nice, as was the room. There is a small pool and hot tub, a nice workout room, sauna, restaurant and lounge. We didn't use it but they have a shuttle to the airport. Very conveniently located if you have to drive to the airport, only a couple of minutes. The free wireless internet is nice too. A little pricey but I guess that is what you pay to stay close to YYZ.", "title": "Great location for airport layover", "helpfulness": 2, "user": "MADL", "date": "December 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 23021067, "likes": {"liked": "— Location", "disliked": "— Few services and/or food options in the area"}}], "location": {"country": "Canada", "city": "Mississauga"}, "stars": 3, "variance": {"poor": 39, "average": 65, "very good": 125, "terrible": 21, "excellent": 123}, "aka": "4 Points By Sheraton Toronto Airport", "slim_ranking": 0.315789473684, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Located across from Terminal 3 of Lester B. Pearson Toronto International Airport, Four Points by Sheraton Toronto Airport features hotel-wide WIFI, free 24-hour airport shuttle, a heated indoor pool, and a 24-hour fitness centre. All of our rooms are furnished with signature Four Points Sheraton Comfort™ Beds and are 100% smoke free. Guests can indulge in breakfast, lunch or dinner at our on-site De Maple restaurant and enjoy a free sample of our feature local craft brew. We’re easily accessible to all the best the area has to offer, including the International Centre, Hershey Centre, Congress Centre, Woodbine Racetrack, Woodbine Shopping Centre, and downtown Toronto."}