{"user_rating": 3.5, "review_count": 275, "name": "Four Points by Sheraton Los Angeles Westside", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "First time staying at this hotel from Oct. 19th to 20th, 2012. Lobby looks really nice, especially for a Four Points. While checking in, front desk was extremely courteous and friendly. Got to my room and it was decent. Smaller than I anticipated but typical Four Points room. While getting into bed, the first thing I noticed was how well I can hear the adjacent rooms. While my TV was on with average volume, I can hear the TV next door, which was on a Chris Rock standup show. To top it off, I could also hear the people, on the opposite side, talking to each other. So while I'm trying to watch TV and fall asleep, I could hear my TV, another TV and people speaking to each other. I could tell that the walls were extremely thin and it wasn't just people blasting the TV volume or people talking loud.", "title": "Average Hotel but Beware... Thin Walls", "user": "Andrew K", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 143532021}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I hardly have any trouble sleeping but this situation was a tough to fall asleep in. Everything with the hotel was fine except for this which is why I wouldn't stay here again. I would give this place a 2.5", "title": "Average Hotel. Right Off The 405.", "helpfulness": 1, "user": "ToastedBean", "date": "October 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 143498342}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "On a good note, staff was friendly, huge Westfield mall right across the street with a lot of shops and eateries. Location is within close, driving proximity of a lot of tourist spots.", "title": "Nice place to stay", "user": "bj8658", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143159413}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "I had a quick trip. I checked in late, checked out early, so I did not get an opportunity to explore the hotel as I normally like. Rooms are clean. Nice toiletries! Room service was fast! About 10 min wait from taking my order to delivering to my room. They gave me a diet coke, instead of regular :( but other than that, no issues with room service. The hotel is off the 405 so you do hear the traffic. I slept with the a/c fan on all night to drown out the freeway noise. Silver lining....I just had to look out the window in the AM for a traffic alert. Night front desk ladies were really nice. The AM front desk guy was a bit rude and short with me. It's also across from a good mall with a Target. Great if you forgot something and needed to go to the store. I would consider staying here again. But was not overly impressed. And parking was $12 a day.", "title": "Great service. Comfortable", "user": "greatatrip!!", "date": "October 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 143046540}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Very nice place to stay and the location was so convenient in case you need anything (Mall right across the street). Staff was very pleasant (maybe it was the trip advisor luggage tag I had on my bag). Even though we did not visit, the restaurant looked very inviting and the prices were reasonable.", "title": "Nice overnight stay", "user": "evhunt", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142579506}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "If you are an SPG member, this hotel is the best bang-for-your-points. Friendly staff. Clean hotel. However, we were given an upgrade to a deluxe king room (probably 100 sq ft larger) since I am a Gold SPG member and the room was smoky. It also faced the freeway so it was a bit noisy. So we asked for a non-smoky room and we were put on the other side of the floor in a standard king room. It was fine. Small but clean. Bed was average. Location was pretty good with a Westfield mall across the street. Close to the 405. 15 minutes from Santa Monica beach.", "title": "Wonderful lobby, business, and lounging areas", "helpfulness": 1, "user": "Brad H", "date": "November 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145456999}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "We didn't eat here but there is a $15 breakfast buffet. If you are an SPG member it is half-price. Parking is $12.", "title": "Great stay", "helpfulness": 1, "user": "pjauk", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145141371}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Only stayed a single night but wished I could have stayed longer.", "title": "Great budget hotel", "user": "WorldTraveler2054", "date": "November 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145046924}, {"rating": 3.0, "title": "One Bad Apple ...", "text": "Friendly staff on check-in as a SPG Preferred Customer, found my room nice and large, facing away from freeway so proving very quiet.", "user": "OpEd", "date": "November 6, 2012", "id": 144710759}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Just had a snack at the bar with a beer or 2 - bar staff friendly and noticed some locals coming in for food/drink - always a good sign.", "title": "Good friendly service", "user": "RayC888", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 144008461}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Typical Four Points Sheraton in a good central location", "title": "Typical Four Points Sheraton in a good central location", "helpfulness": 1, "user": "nychellzkitchen", "date": "January 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150628621}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Across from a mall that has a Target and a good food court... plus a Gold's Gym", "title": "Great location and rate...Hotel was good but nothing extra special", "user": "Kesslane", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150547841}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Room was average but clean", "title": "good value for money", "user": "faaiza c", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150282884}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "You have to pay for parking which in my opinion should just be included in the room rate", "title": "Good hotel in Culver City", "user": "Angie S", "date": "January 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149530417}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "I picked this location because of the great rate, the location in Culver City and the access to both a mall and a movie theatre. It is like 15 minutes (EASY drive) from LAX. No shuttle service but only $20 taxi. Walking distance to a great mall and good theater complex. Good service and clean and basic room.", "title": "Stay if you need to go to the airport quickly", "user": "Guntsche", "date": "January 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149465612}, {"rating": 4.0, "title": "A Welcome Surprise", "text": "After reading some of the reviews I was somewhat hesitant to book a stay at the hotel especially when using my free points from Shearton for the room. We were met while checking in by an extremely efficient desk clerk who had our key and room available in less than two minutes. The room on the eighth floor was clean and contained a comfortable king size bed. There was an excellent view of the surrounding LA area. While the freeway was down below us it did not provide any noise in the room. The bathroom is extremely small and it is difficult to get all of your toilet items on the counter. There is also no fan in the shower. There is however coffee in the room and an adequate selection of items for your morning coffee. The overall room was large and very comfortable. The Howard Hughes Center is two to three blocks away and within walking distance containing a variety of restaurants. The desk clerk again provided helpful directions of how to get there and where many places to eat are.", "helpfulness": 1, "user": "DCSacramento", "date": "February 27, 2007", "id": 6851769}, {"rating": 2.0, "title": "Thank goodness for Manager", "text": "I booked this hotel direct over the phone from Australia as I had several requests. As my wife and I have four children we required interconnecting rooms. Due to our flight arriving at 6.30am I wanted to check luggage in early and being unfamiliar with LA we wanted shuttle to pick us up. First problem no shuttle to pick us up. (Website says \"free shuttle\"). Rang hotel told no shuttle's. Ok caught a taxi. Second problem when arriving front desk informs us no interconnecting rooms available. Rude girl on the front desk to rub insult into injury. Demanded to speak to manager who sorted out room problem and offered us a free breakfast, (which should have been included in the first place). He also had a bowl of fruit delivered to our room which was a nice touch. Over all staff unpleasant and hotel a little over priced. Good location to shopping mall.", "helpfulness": 1, "user": "mrdigby", "date": "February 1, 2007", "id": 6726326}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "But would never stay here again. If it wasn't for the manager and his efforts it would have been very dissapointing.", "title": "avoid this hotel", "user": "2adventure", "date": "January 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 6612762, "likes": {"liked": "— nothing", "disliked": "— the lack of cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I hardly know where to begin to review this hotel. We chose to stay here so we could park and fly to LAX. We arrived in the evening and were given a room on the freeway side of the hotel. (The freeway is literally next to the hotel). The room at first glance appeared fine, but in reality was very dirty. There was hair in the bathtub and on the bathroom floor and the room was very dusty. We were afraid to touch anything.", "title": "Loved the beds", "helpfulness": 1, "user": "Snowbird-AK", "date": "November 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6053903, "likes": {"liked": "— nice rooms and beds", "disliked": "— no fan in bathroom"}}, {"rating": 5.0, "title": "Really Nice!", "text": "We arrived in the evening (about 8 pm) we wanted to get a bite to eat. After waiting and waiting in the restaurant for service, we finally gave up and decided to get something out of the vending machine only to find it was out of order. Frustrated, we returned back to our room and ate a box of crackers we had brought with us.", "helpfulness": 1, "user": "FabulousTravels", "date": "July 29, 2006", "id": 5525150}, {"rating": 5.0, "title": "Nice place to stay", "text": "I stayed w/ my children recently for about 2 weeks. I & family enjoyed so much, staffs were frirendly & helpful. It's a good location to close the shopping mall & airport.", "user": "stingcho77", "date": "December 18, 2012", "id": 147690341}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Specially, I'd like to thank to Ms. Vicky at front desk. She was responded quickly & helped me to change my reservation easily.", "title": "Good Location for LA but Staff Could Be More Professional", "user": "meganmckean", "date": "December 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147098107}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "We stayed 2 nights at the Four Points at the end of a two week trip around the west coast. We had visited Los Angeles before and stayed in Hollywood, and thought somewhere different would be good to try. The location is great, especially if you have a car. It only seemed to take 10-15 minutes to get to most places, and was easy to access. It's located directly across the road from Westfield, which is great if there's anything you need to pick-up.", "title": "Great place to stay", "user": "bryce m", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146660528}, {"rating": 4.0, "title": "If you are not planning to drive during rush hour, then this is a great hotel", "text": "The check-in staff were friendly, and our room was nice although a little dated, but as it is the lower end of the Sheraton spectrum we had expected this. When we walked to our room though there were several cleaning staff just sitting on the floors in the hallway. This seemed a little odd and quite unprofessional.", "helpfulness": 1, "user": "Enjoys_Relaxing", "date": "November 22, 2012", "id": 145989896}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "The breakfast in the hotel was decent, although not included in the price. We had the buffet one of the mornings we were there, as Starwood Preferred Guests receive 25% off the restaurant services. There was quite a lot to choose from, with eggs, pancakes, bacon, sausage, fruits etc.", "title": "Central LA location, Friendly staff", "user": "claybrizendine", "date": "November 22, 2012", "detail_rating": {"value": 4.0, "sleep": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 145959794}], "location": {"country": "United States", "city": "Culver City"}, "stars": 3, "variance": {"poor": 17, "average": 74, "very good": 121, "terrible": 13, "excellent": 50}, "aka": "Four Points By Sheraton Los Angeles Westside Hotel", "slim_ranking": 0.428571428571, "description": "The Four Points by Sheraton Los Angeles Westside is stylishly redesigned and 100% smoke free, we're within easy reach of southern California's finest, and only three miles from LAX."}