{"user_rating": 4.0, "review_count": 141, "name": "Four Points by Sheraton Winnipeg International Airport", "reviews": [{"rating": 5.0, "title": "Overnight at Winnipeg airport", "text": "This hotel is right outside the airport and yet very quiet. We had a great one night stay here on our way to the Dominican for our holiday. Staff were great and we enjoyed a quiet supper in the restaurant. Good shuttle service back and forth to airport too. Recommend!", "user": "Gemgirlbarbara", "date": "January 30, 2012", "id": 123890644}, {"rating": 3.0, "title": "OK if you need to stay at the airport", "text": "Stayed here recently on a business trip. Great location if you have an early or late flight otherwise not alot around (though it worked for this trip).", "user": "darrennelson", "date": "January 25, 2012", "id": 123626573}, {"rating": 3.0, "title": "Good for an Early Morning Flight", "text": "The hotel is a short walk out of the airport (I think there is a shuttle). Friendly check in; the lobby was nice and there is a restaurant and sports bar.", "user": "Rumples", "date": "January 23, 2012", "id": 123516623}, {"rating": 5.0, "title": "The Night before", "text": "The rooms are very average ... not work the $170 per night at all. I would say more around the $120 a night maybe.", "user": "WobblyCanada", "date": "January 15, 2012", "id": 123090674}, {"rating": 5.0, "title": "Great stay, staff", "text": "We did eat at the restaurant which was also quite average (but exactly what we expected).", "user": "mannycanuk", "date": "January 8, 2012", "id": 122792448}, {"rating": 3.0, "title": "Under renovation. Weak wireless", "text": "Stayed here while putting on a seminar. Conference facilities very good. Only issue was wireless internet was weak in guest room and conference room. Hotel was undergoing renovation so this may have been a temporary result of the renovation.", "user": "hatlad", "date": "September 13, 2011", "id": 118092895}, {"rating": 4.0, "title": "lovely room, great service", "text": "This was super easy for the early morning flight, right across from the airport terminal. check in was easy, staff helpful, room service was 15 minutes at my door, the bed was terrific, and I will for sure stay again!", "user": "W_Peg-Girl", "date": "September 12, 2011", "id": 118018333}, {"rating": 4.0, "title": "Great Location, Great Place and Friendly Staff...", "text": "The hotel is attached right to the airport. It offers convenient amenities for both business and personal travelers. The staff are very friendly and attentive. The rooms are always clean, and it is nice to have a fridge and microwave in the room for an extended stay. There is very fast high speed service, although sometimes the wifi is not very strong. As long as I keep stopping in Winnipeg, this will be my place to stay.", "user": "canor", "date": "August 4, 2011", "id": 116285363}, {"rating": 5.0, "title": "BEST SERVICE EVER", "text": "this hotel went above and beyond to help me and my husband if you stay in winnipeg this is the only place to stay", "user": "rhondaandglen", "date": "June 30, 2011", "id": 114911176}, {"rating": 4.0, "title": "great location, convenient", "text": "thank you four points", "user": "res12345", "date": "June 13, 2011", "id": 113125465}, {"rating": 4.0, "title": "Noisier since the new airport opened", "text": "I stay at this hotel about every 6 weeks and have noticed that you can hear the airplane noise more often now that the new airport is open. There doesn't seem to be a quiet side anymore. The hotel is located a short walk from the airport and has a shuttle service. It's a cold walk in the winter and be advised if you need a taxi you need to walk to the airport or have them call one for you which in my experience is about a 10 minute wait.", "user": "ac1510", "date": "January 1, 2012", "id": 122365953}, {"rating": 2.0, "title": "Would not stay here again!", "text": "The positive side of this hotel is that the rooms are clean and comfortable and there is free internet and bottled water. The food is above average for a four points. The service is the dining room is hit or miss.", "user": "lancelongthrust", "date": "December 27, 2011", "id": 122140688}, {"rating": 4.0, "title": "Convenient to airport", "text": "I stay here because I'm a platinum member. It's a decent choice if you want to be close to the airport.", "user": "Gatordogs", "date": "November 25, 2011", "id": 121023387}, {"rating": 4.0, "title": "Convenient and perfect", "text": "Rooms are dated - need renovations. Poor service - breakfast room service was 1h late, with no apology, but a rude \"do you still want it?\"", "user": "rash_India", "date": "November 13, 2011", "id": 120537531}, {"rating": 4.0, "title": "Stayed because of our Polar Bear trip", "text": "Was very disappointed - the worst Starwood property I have ever stayed at!", "user": "Bob-Carol-Pinjarra", "date": "November 9, 2011", "id": 120368870}, {"rating": 4.0, "title": "Sheraton at the Winnipeg Airport", "text": "We stayed here for 2 non-consecutive nights in October 2011 as part of our Globus/Frontiers North Tour. We arrived at the old airport terminal and could easily walk across the street to the hotel. When we left, the new terminal had just opened and the hotel offered a free shuttle to the new terminal. We could have walked, but it would have been a 5-10 minute walk, part of which was outside and part through a parking garage.", "user": "lithlith", "date": "November 2, 2011", "id": 120091480}, {"rating": 4.0, "title": "Changes are happening", "text": "Both rooms we had were of average size and were nicely furnished. We had free wireless in our 1st room, but not our 2nd (if you room is over the lobby you'll pick up the wireless, otherwise sit in the lobby if you want to use it) There was a coffee maker, mini fridge, microwave, and hair dryer in our room. There is a restaurant and bar attached to the hotel.", "user": "AC_A340", "date": "October 27, 2011", "id": 119797925}, {"rating": 4.0, "title": "In a renovated room", "text": "Stayed here on business again. The lobby is being renovated, so I looked past that. Check in/out was smooth as ever. I am a platinum SPG member, but for some reason this hotel never upgrades you to a suite. Sort of disappointing. They did put me in a \"business room\" which was pretty much identical to a regular room, just had slightly different decor, and was a slightly smaller room. The new airport terminal is opening Oct 30, which is nice, but this hotel will no longer be connected to the airport. You will now have to walk outdoors through two parking garages to get there. So when -30 hits, it won't be nearly as convenient. I would almost recommend staying staying at an off-airport hotel, and using their free shuttles. You won't have to walk outdoors with luggage. The sports bar needs updating, so I hope this is on the to-do list for the property as well. I would stay again though, nothing is pushing me away really.", "user": "ChillyAlbertans", "date": "October 20, 2011", "id": 119534647}, {"rating": 2.0, "title": "Should close until renos are complete!", "text": "I was here just before the major renos started and boy did this need work. This trip I am in a renoed room. Nice, but odd....very large room....these old eyes had a tough time seeing the TV from bed. A big room needs a bigger TV. No tech center...what a wasted opportunity. How much can a few USB ports and a well placed series of plug ins. One well placed plug...with one plug used by the phone....add another ! Geez. Wireless was good in my room....and free for the moment.", "user": "OJonVacation", "date": "October 14, 2011", "id": 119305325}, {"rating": 3.0, "title": "Convenient, but worn and dated. Under renovation.", "text": "Bathroom is nice...but the caulking is already cracked. The counter is freakishly low.", "user": "tomcat335", "date": "October 9, 2011", "id": 119124001}], "location": {}, "variance": {"poor": 8, "average": 23, "very good": 65, "terrible": 2, "excellent": 43}, "aka": "4 Points By Sheraton Winnipeg International Airport", "slim_ranking": 0.225806451613, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Featuring 149 guest rooms and suites, the Four Points by Sheraton Winnipeg International Airport is adjacent to the airport (YWG) and offers guests a free 24 hour shuttle service to the terminals."}