{"user_rating": 3.5, "review_count": 594, "name": "Four Points by Sheraton", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed here for one night using points during a power outage at our home. The room was adequate but the service was deficient. We called the front desk to request an additional feather pillow in place of the 3 foam pillows that were provided. This request was not fulfilled and, when we called a second time, we received an explanation of the percentage components of the pillows. Obviously, feather pillows were stocked since we had one! The second request was also not acted upon. The air conditioning unit in the room worked fine but was extremely noisy and woke us up several times during the night. I believe it was in proper working order but obviously a cheap unit for a \"budget\" hotel.", "title": "Very ordinary", "user": "DCRE", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 133890021}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "The employees were wonderful!!! The were helpful and polite. Check in, check out, room service, cleaning and service all went perfectly.", "title": "We really enjoyed ourselves.", "user": "Jenny J", "date": "July 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 133700681}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Due to our flight delays, we finally arrived to the hotel at 1 am. Our room was on the 7th floor and we didn't have a peaceful night of sleep because the traffic noise was LOUD. We asked for a different room the next morning since our booking was for 5 nights ($200/night plus taxes). The second room smelled horrible, it smelled moldy. We thought if they fix the air condiitoner, then the room might smell ok later. So we went out to do our sight seeing, our first trip to DC! When we came back in the afternoon, the air conditioner was fixed but the mildew and mold odor was very prominent coming from behind the walls. The bathroom vent must have stopped working for months. We really didn't want to ask nor move again, but our health would be in jeorpardy if we had spent one night in that room. We moved to the third room which was acceptable as one would expect from Sheraton...except for the pillows. The front desk attendants were very accommodating. We had breakfast in the hotel restaurant the first morning, and if your first cup of coffee is important to you, don't go there.", "title": "Third time is a charm", "user": "Susan M", "date": "July 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 133651071}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The hotel was very clean with comfortable beds and a convenient location. You could walk to attractions nearby, Starbucks, Cozi & Corner Bakery all within 2 blocks. Staff was somewhat helpful but not overly. The only glitch I had was that we were on a tour and had to leave at 7:15 am. The little mini store in the lobby was supposed to open at 7 and I needed some bandaids. Noone showed up until after we left. The hotel would not open up the store to sell me some bandaids nor did they offer me any. That was a little inconvenient.", "title": "great location! nice hotel", "user": "4hends", "date": "July 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 133646439}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Pros:", "title": "Average Hotel", "user": "Iyc R", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 133548122}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Just finished a two day stay for business at the Four Points Sheraton. Hotel has a great location, centrally located to many restaurants, and D.C. attractions. Rooms are very modern and the property is squeaky clean. The most noteable experience was the staff, eveyrone greeted you with the most enthusiasm, smiles, etc,etc. This was expecially true of the housekeeping staff you saw in the guest room corridors.", "title": "Great Experience", "user": "julius k", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132250314}, {"rating": 3.0, "title": "location, location", "text": "The property is efficient, enjoyable and I really enjoyed my stay.", "user": "Chad B", "date": "June 18, 2012", "id": 132219551}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Thank you!!", "title": "A solid, reliable choice", "user": "amydc", "date": "June 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132150320}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "D.C. Traveler", "title": "\"Comfortable stay with excellent customer service\"", "user": "classicalmusictravel", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131994495}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "And it stops there. It wasn't terrible, and was clean, but it felt like a day inn with Starwood literature around the room. Nothing great. Staff was friendly and helpful.", "title": "Rock the Mall, Part 2", "user": "LindaENJ", "date": "June 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 131970178}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "I am so happy I booked this hotel for my Girl Scout troop to celebrate the Girl Scout Centennial with the Rock the Mall event. I give this hotel 5 stars and more if I could for the wonderful and exceptional customer service. From the moment I made the reservation to the moment I checked out our group was looked after in every way -- extra pillows, blankets, breakfast -- all with a friendly smile. You really feel pampered here. Our connecting rooms were perfect and very comfortable. The pool was small but a welcome respite from the heat and they kept us supplied with comfy striped pool towels -- nice sun deck too. The delicious buffet breakfast every morning gave us the start to each day that we really needed. Chanisse at the front desk really made sure of every detail for us. Again, this is a hotel filled with friendly, helpful, wonderful employees -- I travel a great deal and this was a truly memorable experience!! A big thank you to the friendly and sweet staff of 4 points DC!!!", "title": "We Rocked The Mall!", "user": "Dillyfox", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131925519}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We were in DC for the Girl Scouts 100th Anniversary weekend (my sister, daughters ages 6 and 10, and myself). MOST of the staff was very friendly, however the rooms were tiny holes in the wall. We had no space to put any luggage, only 1 person could fit in the bathroom at a time, I wasn't allowed to touch my own belongings or car.....and for a 10 STORY hotel, the swimming pool was as big as our room--TINY! There were never trash bags in the trash cans.... For the price of this hotel, definitely NOT worth the money!!", "title": "Girl Scouts 100th Anniversary", "user": "Allison J", "date": "June 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 131923319}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed 6 nights for graduation & 1st time in DC.. Close to Metro(2-3 blocks), bus stops in front & also Circulator bus $1. fare to many places, walk 4 to 8 Blocks to Whitehouse, Mall & musuems & monuments.", "title": "graduation visit", "helpfulness": 1, "user": "Amy H", "date": "June 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 131348778}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Smaller rooms but nice. Comfy beds. No refridge or microwave. No comp. breakfast, But Cosi -Same block & MacDonalds 1 block down. Chinatown- 3 blocks, 4 blocks away Safeway market-K&5th &more,", "title": "Dirty comforter and bugs", "helpfulness": 1, "user": "C C", "date": "June 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131345529}, {"rating": 3.0, "title": "No reserved room!", "text": "We stayed in this hotel with my parents. While our room was clean and comfortable, and we had an extremely helpful concierge help us bring some end tables we'd bought upstairs, my parents' experience was less pleasant, and for that I am giving this poor review. On the first night, we noticed that their comforter was dirty, stained in several places. We called to get it replaced, and the maid came in with a bottle of fabric cleaner and gloves, looking like she just intended to clean out the spots right there (odd). When we pointed out the stains, she nodded and then took the whole thing out. When she brought it back, it looked much better, but a little later, we looked closely again and found more stains!", "helpfulness": 2, "user": "Mary E", "date": "May 14, 2012", "id": 129920104}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The hotel was clean, beds comfortable,, atmosphere very warm and pleasant, employees very helpful and location was idea for using public transportation. I will recommend to other family members and friends.", "title": "A great experience", "user": "Carolyn W", "date": "July 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133432434}, {"rating": 4.0, "title": "A great staycation", "text": "My wife, daughter, dog and I spent one night at Four Points during the big East Coast power outage. We actually live less than two miles away. The hotel was comfortable, the room clean and spacious, and the staff friendly. This is one of the few downtown properties that accepts dogs, for a $25 fee per night. We saw many others around, and it was a good feeling. Can't comment on the food or fitness center, but the pool was good and the Wi-Fi perfectly adequate.", "user": "childbride84", "date": "July 2, 2012", "id": 133318868}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The location is really good, the rooms comfortable and clean, the prices reasonable and the staff very nice.", "title": "Perfect for a Few Days With the Kids", "user": "RW2012", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132853362}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "We stayed 8 days here on vacation. It was clean and comfortable. There was complementary coffee in the bar. We were not told this for a couple of days. You can have breakfast for a reasonable price. You had to rent a refrigerator from them but they do have an icemaker. You can wash your clothes for ~3.00 a load and they provided soap. They were stingy with the complementary water and coffee for the room. The help desk wasn't very knowledgeably about getting around town. The metro bus- circulator was right out front.", "title": "It's a clean and cozy place.", "user": "Gowithtwin", "date": "June 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 132568938}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We stayed at the Four Points in DC while attending a show at the Washington Convention Center. On arrival, check in was very easy. Since I'm a gold member, I'm entitled to free room upgrades so I asked the clerk if I had received an upgrade. He said yes, that we were upgraded to a very nice corner room. When we arrived in our room, I then realized that if this was an upgrade, we should be very thankful we didn't get a regular room. The room was in dire need of an upgrade. It was very old a tired looking. They had needed to get power to the TV on the dresser so they ran a power cord under the carpet to the other wall. You stepped on this annoying little bump every time you walked in the room or into the bathroom. The bathroom tub was old and stained. The shower plumbing was not anchored in the wall so every time you had to touch the shower head, the entire pipe moved so you needed two hands. The bathroom was very small for a \"corner\" room. The beds were uncomfortable, which is quite different than many of the other Sheraton hotels I've patronized. The A/C unit on the wall was one of the loudest I've ever heard. It woke us up throughout the night whenever it turned on. The front desk said that's just how they work. Additionally, the walls were paper thin. Hallway noise, phone conversations in the next room and traffic outside was all too loud. The hotel itself was clean and the lobby area was nice. We didn't eat in the restaurant so I can speak to that. The staff was friendly and helpful, except I know the clerk at check in was feeding me a line about being upgraded since we had the same type of room (2 dbl beds). The conference rate for this hotel was $219 and now that I've stayed there, I can say that is exorbitant. I've stayed in Hamptons/Fairfields that were nicer and paid about $130-150 a night. The bottom line is that this is a very basic hotel in need of renovations and is not worth the price being charged.", "title": "Not worth the money", "helpfulness": 1, "user": "reiddg", "date": "June 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 132377785}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3, "variance": {"poor": 74, "average": 139, "very good": 207, "terrible": 28, "excellent": 146}, "aka": "Four Points By Sheraton Hotel", "slim_ranking": 0.713178294574, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Be close to everything at the newly renovated Four Points by Sheraton Washington D.C. Downtown Hotel. Visit a museum, see the monuments or stroll to the White House. Over 9000 feet of event space."}