{"user_rating": 3.5, "review_count": 131, "name": "Four Points by Sheraton San Diego Downtown", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We were part of a group reservation. It was a nice stay. Staff was really nice. They addressed every thing we asked of them, and did it with a smile. This is an older property, and it could definitely use a renovation. But it was comfortable and clean. Its right next to the freeway, so its a bit noisy. Not in the best neighborhood, but we walked around with no issues. Its not really near much, so you have to walk a ways to get to the main activity areas, and restaurants. Little Italy seemed to be the closest area, and it was 5-6 blocks. You have to walk by some homeless people, which is a little disturbing, but they didn't bother us. The location is about 1-1.5 miles from all the activity down by the conference center/gas lap area", "title": "Nice Stay, but not many amenities", "helpfulness": 1, "user": "Tuckers", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132997048}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The room itself was nice. Beds were comfortable. Nice crisp bedding (I like that). The bathroom had a tub/shower, toilet, and a sink with a nice size counter. There was a magnifying mirror that you could use, which was a nice touch. The towels were fluffy and smelled nice. There was a flat screen tv, which we didnt use. Nice dresser area with drawers to put clothes, also a armoir type unit with an area to hang clothes. I think there were 8 hangers in there. Only 2 plugs in the whole room, though, so bring a power strip. (we did). The carpets were a stained and could definitely use a deep cleaning or replacement. The interior halls of the hotel were kept warm and felt almost moist. Not sure what that was about - the rooms were fine. Each room has an easy to adjust thermostat, which was nice.", "title": "Could be better", "user": "Jaydawg802", "date": "June 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 132769220}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Small restaurant downstairs didnt have much to choose from, but the prices were decent and the service good. No breakfast included here.", "title": "Could be better", "helpfulness": 3, "user": "Jaydawg802", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 132570506}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Pool only, no jacuzzi. But the pool is quite warm. We heard its heated to 80 degrees. We were the only ones in there, so it was nice.", "title": "Not a Holiday Inn, but Four Points by Sheraton", "helpfulness": 5, "user": "tferdaise", "date": "June 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131106048}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Parking was $17 per day, not as steep as some other hotels in the area, but still a lot!", "title": "Do it yourself !", "helpfulness": 5, "user": "MasterBry", "date": "May 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 130162630}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 13, "average": 34, "very good": 50, "terrible": 3, "excellent": 31}, "aka": "Holiday Inn San Diego-Downtown Hotel", "slim_ranking": 0.527675276753, "description": "The recently-renovated Four Points by Sheraton San Diego Downtown is located minutes away from Little Italy, the Gaslamp Quarter, and Seaport Village. We also offer a free shuttle to/from the airport"}