{"user_rating": 5.0, "review_count": 127, "name": "Fox Pond B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "One of the high points of our quick weekend trip to marblehead was staying at this very intimate and \"homey\" bed and breakfast. The B&B has only 3 rooms, but what rooms! Luxurious, well appointed and oh so comfy beds.", "title": "Absolutely restful!", "helpfulness": 5, "user": "Travelingtoo", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5774305, "likes": {"liked": "— The quiet and serene atmosphere"}}, {"rating": 5.0, "title": "Wonderful Stay", "text": "The gardens outside are expansive with a slight Asian influence......there is a large Koi pond with very friendly (and hungry) Koi........Ted, the owner and designor of the house is a very accomodating host along with his \"hostess\" the remarkable Sophie! You may not be able to bring your dog along on your vacation but Sophie is a sweet and well mannered Golden Retriever who will fill in for the duration of your stay!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5420636}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Another plus is it's away from the busy narrow streets of Old Marblehead and tucked into a sylvan like setting in close proximity to Salem. Explore Marblehead and the next day take a very short trip to Salem........Two very different cities , each with a unique flavor.", "title": "It simply does not get any better.", "helpfulness": 11, "user": "pets99", "date": "April 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5015363}, {"rating": 5.0, "title": "Fox Pond is Great!", "text": "My husband wanted to show me the BEST of Massachusetts and looked for a B&B that would make our weekend stay special and romantic. He found Fox Pond online and was thoroughly impressed with what he saw. I was a little wary at first because I had never stayed at a B&B and was more inclined to pick a nice hotel. Now that we have stayed there, I can say that my husband did a great job in selecting Fox Pond!", "helpfulness": 10, "user": "Absentmihdedprof", "date": "February 27, 2006", "id": 4550348}, {"rating": 4.0, "title": "Beautiful room and Gardens at Fox Pond Inn", "text": "The house is beautiful and the décor is elegant and tasteful. The garden is magnificent. It is the perfect English garden. The peonies were in bloom and the huge blossoms in various shades of pink were stunning. The weather was not very cooperative. It rained for most of our stay. But in spite of that, the garden with its lush greenery and the explosion of color from the various flowers made everything just fine. There was a poetic feel to it.", "helpfulness": 8, "user": "ktalcozar", "date": "September 22, 2005", "id": 3932769}], "location": {"country": "United States", "city": "Marblehead"}, "variance": {"poor": 3, "average": 1, "very good": 16, "terrible": 0, "excellent": 107}, "slim_ranking": 0.173913043478, "description": "Nestled among tall oaks and ensconced in beautiful English gardens, Fox Pond B&B provides a welcome retreat for guests wishing to relax and escape the noise and traffic. Understated elegance and luxurious details are the signature ingredients that are found throughout this meticulously renovated and expanded cape. The style is a unique blend of southern and cape designs with details found in Victorian, Federal and Greek architecture. Each designer bedroom and suite includes a private bathroom with amenities and exquisite luxury not found except in the most distinctive boutique hotels. Lavishly decorated rooms feature private bathrooms including, marble floors, artist edition sinks, wall mounted HDTV’s, period antiques, oil paintings, custom vanities, a Canton vessel sink, marble showers/bath, a double Jacuzzi in the Canton suite and the highest quality fixtures throughout. A hot breakfast is enjoyed in the dining room or on the patio. The servings include a variety of hot recipes together with fruits and a side of hot muffins."}