{"user_rating": 5.0, "review_count": 157, "name": "Frank's House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "Recently stayed at Franks for 3 nights in the larger room (with ensuite) with my husband. I think TA accurately describes it and we chose it first and foremost for value and positive reviews. Frank was as friendly as ever and took time to explain where to go and what to see and we were really impressed with the spacious room- really clean and the bathroom wouldnt look out of place in a modern 4 star hotel. Frank and his wife have taken time to invest in decent bedding etc and this all shows. Rome is an incredibly noisy city and although it didn't bother us, the traffic noise outside was relentless... it literally went on all night and the windows/shutters blocked some of it but if you're a light sleeper perhaps opt for the back room. It would be nice if there were some coffee/tea making facilities in the room perhaps ... and a pastry or two in the morning but its basically just a small apartment so there are no real facilities to offer breakfast. My main (and only) criticism is the location; I just didn't like the area which is no fault of the B&B as this is why it's so reasonable..so of course it's to be expected I guess but I certainly would not have felt comfortable without my husband there as there were lots of strange people hanging around/homeless ppl/dirty streets etc- but perhaps this is just Rome! To get to the main tourist areas was 20 mins on bus/tube so not bad but I wouldn't stay here as a single female.", "title": "Very pleasant stay", "user": "BigBird27", "date": "October 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 143759204}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "My sister and I stayed two nights at Frank's House in early October 2012. It's everything a cute, quaint place should be! We had the bedroom with our own private bathroom that was just down the hall from our room. We never felt uncomfortable with that situation! We arrived and Frank eagerly greeted us. He knew our time in Rome would be quick as we were travelling south in just a few days. He gave us a map and told us everything we didn't want to miss and told us he was there to help if we needed him. He got us a great reservation at a local place where the food was impeccable. The room was perfect, perfect weather (we even slept with the window open the entire stay). The room was air conditioned but I don't think we ever needed it. There was plenty of room in our bedroom and the bed was comfortable. It's a safe area and close to their Metro system and a great gelato place named G. Fassi! (smile) You can't go wrong for price and location with Frank's House. It was a quick 10-15 minute walk from the Rome Termini station. Ciao!", "title": "Everything we needed!", "helpfulness": 1, "user": "Jennifer L", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143426420}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "A great little place in the center of Rome. Well connected, very clean, and a very nice place to come back to after a long day of exploring the city. Frank is very accommodating and was also very helpful, he gave us a map and explained how to get where, told us where to eat, and just made the whole experience all the nicer.", "title": "Great Little Guesthouse!", "helpfulness": 1, "user": "JustinLewis75", "date": "October 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142952266}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We stayed at Frank's House for 4 nights. We were very impressed with the decor of the room. The room was clean and complete with amenities. Plus, Frank was really helpful in recommending us places to eat and also how to get around the city. Frank patiently answered all our questions and even helped us make bookings to some of the local restaurants.", "title": "Great room, convenient location & amazing host", "helpfulness": 3, "user": "CarolKyg", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142587587}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We found Frank's place on the internet and made contact with Frank who responded promptly to my inquiries. We stayed three nights in this cool place that Frank has transformed meshing the old and the new. The location is near the train station and public buses.There are two rooms but only one has an ensuite with the other having a dedicated modern bathroom adjacent to the room.Both rooms are comfortable but the one with the bathroom is larger with a small sofa and a balcony.", "title": "Good Location", "helpfulness": 1, "user": "psali", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142353454}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We only stayed here for one night, so it's tough to write a valuable review, but the room was great (Frank and his wife have worked VERY hard on the place and it shows). It was spotless, had a private bathroom that was just renovated, and Frank is very helpful. Since he grew up in America, his English is obviously good. His wife is from South America so they also can speak Spanish and Italian. The neighborhood was not our favorite, but we can't say a single thing bad about the room or Frank and his wife. It's also right off of the the first A line stop from Termini. Oh, the room was VERY affordable as well. Thank you, Frank!", "title": "Great room!", "helpfulness": 1, "user": "Kirk S", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 142249865}, {"rating": 5.0, "title": "Wonderful Roma", "text": "Frank was so helpful and answered all our questions, providing useful suggestions. The room was clean, well situated close to main termini & metro station. Beautiful piazza close-by. Would happily stay again.", "helpfulness": 2, "user": "Rebecca G", "date": "September 30, 2012", "id": 141679242}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Perfect place in a perfect location ! We stayed for 3 nights and wished to stay longer. Our room was the smaller room facing the courtyard with an external bathroom. The room was clean, tastefully decorated with comfortable bed & air conditioner.", "title": "Perfect location for first stay in Rome", "helpfulness": 1, "user": "Derina502", "date": "September 30, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 141652246}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The place is 5 minutes walk from termini and very well connected to different interesting places of Rome.", "title": "Couldn't have asked for more!", "helpfulness": 1, "user": "Alessia R", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137327720}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Frank was so kind and helpful in providing good recommendations on places, restaurants & transportations. He & his lovely wife live on the other side of the apartment so we could easily ask him whenever we had problems.", "title": "Great Find! Can't wait to return!", "helpfulness": 1, "user": "Candace P", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137007332}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were so impressed with our stay at Franks house and just disappointed that when we returned to Rome later in the month we didn't stay there again.", "title": "Fantastic find near termini station", "user": "ash4985", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145389045}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed in the smaller room without ensuite and it was faultless, there was no problem having to use the bathroom in the hall as there was nobody else around. The flat was beautifully decorated and the rooms felt very luxuriousness, especially considering their price compared to the rest of Rome. We stayed in a much more expensive hotel later on which was nowhere near as nice.", "title": "An A+ place to stay", "user": "heroes4us", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144185714}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My only complaint would be the location, we like to walk and it felt like a bit of a trek out to the sites. But you are right next to the metro and bus stops so really its not a problem.", "title": "Perfectly nice stay in Rome", "helpfulness": 1, "user": "GTCOOPER", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144117469}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Oh and Frank and his wife are just lovely. We arrived quite late and they gave us plenty of suggestions of places to go for dinner.", "title": "Great stay", "helpfulness": 1, "user": "Paul L", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143838702}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The most obvious question to ask after staying at Frank’s House is, “would you return if you could?” The answer is one word: YES! Not only are the accommodations excellent, Frank and his wife are truly helpful in every way. Every question you ask is treated as an important one, and you are never made to feel as if you are imposing. Courteous, kind and genuinely sweet describe the hosts in every way. As an educator accustomed to assigning grades, Frank’s House earned an A+", "title": "Wonderful Experience!", "helpfulness": 1, "user": "Sandra D", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143835644}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is the type of place you hope you get, and I don't think that the pics really do it justice. We had a wonderful room, a clean modern bathroom, top-notch bedding and mattress, fast Wi-Fi, and great AC. We were very well connected to Metro and bus-lines, but close enough in to do a lot of walking, and we had fabulous and helpful hosts, thank you Frank and Soledad. My wife just loved the decor too. All at a great price - We really couldn't have asked for more.", "title": "Truly Excellent Stay", "helpfulness": 1, "user": "David S", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134280426}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We arrived at Termini with the Leonardo Express and made the mistake to take the Metro. Do not do it! You walk twice the distance to get to the right platform at Termini and from the platform at Vittorio Emanuele to the B&B, then if you would have walked there straight away.", "title": "Five wonderful days...", "helpfulness": 3, "user": "Procnias", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 133072103}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "It is only a ten Minute walk. Lessons to be learned I guess...", "title": "Rome as a local....", "helpfulness": 2, "user": "TW_Yachtgal", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132419121}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "But to Franks place! We had the room with the little Balkony for five nights and it was very nice.", "title": "Very nice stay!", "helpfulness": 1, "user": "Laura C", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 132013816}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The bathroom is kind of small but modern. Most importantly - we are Germans ;-) - it was clean!", "title": "Love the place, will definitely be back.", "user": "Elyysa", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131996235}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 0, "average": 5, "very good": 27, "terrible": 0, "excellent": 125}, "slim_ranking": 0.036454018227, "description": "Frank's House is conveniently located in the heart of 18th Century Rome, right off the corner of one of Rome's main plazas, Piazza Vittorio Emanuele II. It's just a 5 minute walk from the central Train Station Termini, and the famed Basilica of Santa Maria Maggiore, and just a 15 minute passeggiata to the Roman Forum and Colosseum.The multi-ethnic neighborhood of Esquilino, in which it is located, is rich in both diversity and vibrant city life. Nearby mass transit stops, including the Metro and numerous bus and light-rail links, also make it an ideal and easy location to base your Roman Holiday."}