{"user_rating": 4.0, "review_count": 273, "name": "Franciscan Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Unfortunately, our two night stay at this hotel coincided with a late September heatwave. Daily temperatures reached over 100 degrees on both days and the nights were sweltering.", "title": "Beware - Some Rooms Are Not Air Conditioned", "user": "tokyoexpat", "date": "November 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 87740220}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "When we realised our rooms had no air conditioning, we approached the front desk to change. Unfortunately, the place was fully booked, and the staff were less than helpful. They actually insisted that it wasn't their fault because local authorities would not give them permission to install air conditioning (so? not my problem)", "title": "Good stay with some small drawbacks", "helpfulness": 1, "user": "sixxstringer", "date": "November 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 86272947}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Staff told us we should have known because its on the website, and was disclosed on our booking confirmation (but we checked both and it was NOT disclosed - so beware)", "title": "Great location B&B for business block of 5 rooms, accomodating service", "user": "RZPhyxit", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 83080201}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Come on people, at the rate you charge, guests expect aircon when they need it -otherwise DISCLOSE.", "title": "Comfortable stay with kids", "user": "Kablooie", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79287842}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "We booked the hotel for one night, and from the moment we arrived, things were very pleasant. The first day was great, the room was clean, and well furnished. The next day, however, there were some issues. We called the front desk for some conditioner and they said they did not have any. Also, the \"continental breakfast\" was less than impressive. We also found a bug in the room. Other than those things, the stay was good overall. I would stay here again.", "title": "Everyone at the Franciscan inn were so...", "user": "PendleChapter", "date": "September 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 77790343}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We were recently in Santa Barbara unexpectedly on a Saturday night and needed a place to stay for one night. After checking with a couple of other places (one was full and the other was way to expensive) we found The Franciscan Inn, which was inexpensive only by comparison with the other hotels near the beach.", "title": "Know What You're Getting\"", "helpfulness": 9, "user": "travelman1370", "date": "April 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 105217364}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The good things: first, the front desk staff was unfailingly polite and helpful. There is free wi-fi. I seem to recall seeing a pool (obviously we didn't use it). Our room (I don't know about the others) had a sort of mini-kitchen, so if you want to fix some simple meals in your room you could. The sofa in our room made out into another bed. The bedroom \"area\" could be closed off from the rest of the room. The pillows in our room were great. A simple buffet breakfast was included. Coffee was available in the room. There is free parking.", "title": "Superb service, great location and friendly people", "helpfulness": 1, "user": "thmika", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101895186}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Now for the rest: the first thing that struck me on entering the room was that I felt like I had stepped back into the 70s, the very early 70s. And nothing had been touched since then, or at least that's the way it felt to me. Very, very dated. And our room seemed dark during the day. It was also obvious that you better not be a late sleeper as you will hear noise from outside (maids, people walking by, etc). It's just odd how everything in the room is laid out. In our bathroom the showerhead came to about my neck and I'm not tall. Our room did not have air conditioning. But the main thing is it just seems to incredibly dated, cramped and tired.", "title": "great place", "user": "WECAMEWESAWWELEFT", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100873986}, {"rating": 5.0, "title": "Ambiance, charm and wonderful staff", "text": "I notice that at least one other reviewer mentioned the woman who runs the breakfast buffet. What's up with that? She nice enough unless it looks like your about to touch the food (as in serve yourself) and then she'll let you know quick enough that no one touches the food (or the coffee!) except her. The coffee? Really? Again, it's just odd.", "helpfulness": 1, "user": "rowena12", "date": "March 15, 2011", "id": 100305105}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "At the time I'm writing this review there are pictures posted on TripAdvisor that show the room interiors. Take a good, long look at them and decide if that's what you want in a hotel room.", "title": "nice place, good value", "helpfulness": 1, "user": "giromondo", "date": "March 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99193189}, {"rating": 4.0, "title": "Very convenient with a lot of accommodations", "text": "The Franciscan inn is located about one and a half blocks to west beach and two to the pier, and just another short walk to another beach, East Beach. The rooms I stayed in was nice, but the blankets could have been a little warmer and thicker. The lobby is very cozy and the people working at the front desk are friendly and can provide a map of the area. The pool is great and heated. The free breakfast is fine, (the croissants are the best thing there) but there are a good number of foods like oatmeal and cheese and hard boiled eggs. There is also a free hot drink bar as well as free apples and grapes until around 10 O'Clock. Overall, a satisfying place to stay, especially for overnight.", "helpfulness": 1, "user": "slidingsands87", "date": "April 4, 2013", "id": 156622135}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "So charming and comfortable; many accommodation spaces available from singles to suites. Conveniently located to beach walk and walkable to train station and State Street. Very family friendly also. A wonderful gem on a quiet street in a beautiful little neighborhood. Highly recommend it.", "title": "A 'Spanish-style hacienda'", "user": "DDanaC", "date": "March 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155467219}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife and I just spent three nights at the Franciscan as we celebrated a birthday with a longtime friend. The staff were exceptionally friendly and helpful. The Franciscan is within walking distance of Stearns Wharf and State Street. Noise does occasionally pass between the rooms in this older property. The rooms were clean and well appointed.Overall we were happy with our very reasonably priced accommodations in Santa Barbara.Kudos to Carol, the breakfast lady, who had many stories and was just full of information about the Santa Barbara area as well as current events and activities.", "title": "Older Property in Great Location", "user": "gapcmp", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155464906}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "A motel in a good location for the beach city. Easy access for walking to the beach and downtown.", "title": "Tolerable Accommodations", "user": "karinbc", "date": "March 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 155149650}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The motel was clean enough. If traveling with a family it is a good deal because there are suites. I had two rooms but only needed one for myself. It is a motel so there is the noise that comes with a motel of thinner walls, for four nights I listened to a snoring. People walking outside and the cars and car doors opening and closing. There's a continental breakfast served but after the first morning I passed for the next 3 days on it. The food quality is poor. There is spotty internet access and my cell phone didn't work in the room at all.", "title": "Great location and comfy room!!", "helpfulness": 1, "user": "travelingtwin594", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154570051}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed one Saturday night in a standard suite, which was only thing available when I made reservation 2 weeks prior. Would normally not go for the extra expense but it was nice to have the additional space and the refrig in the kitchenette. The reception staff was friendly and very helpful in finding out information about places we wanted to see. The room was clean and comfortable but decor is rather dated. Location is very good near the beach but off the busy street. Generous check out time of 12 instead of typical 11. Liked the ice water, tea/coffee, cookies and basket of fresh apples in the lobby.", "title": "comfortable and well located", "helpfulness": 1, "user": "AnnMarie789", "date": "April 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 159214588}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Although the rooms are small, as noted in other reviews, they are comfortable. The best thing about this hotel is the location. It is a short walk to the beach and pier. The breakfast is O.K., although, rather than serve yourself like most hotels, there is a lady serving everything including coffee, which makes for some congestion in the dining area.", "title": "Good location", "user": "jakrogers", "date": "April 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158484950}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Only stayed one night here because where we had been staying the previous night (just around the corner) was full up so moved into this place. I couldn't believe when walking into the room how small it was, also no mini fridge at all. Bathroom had obviously been refitted was large & nice. Staff were efficient & hot beverages are available in foyer during the day. I didn't have breakfast as we left early on our travels. Maybe I should of asked the room size before booking (but haven't come across this problem before). This place is handy to beach area & short walk into the \"downtown\" area.", "title": "Rooms incredibly small", "user": "anthouse", "date": "April 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 158022084}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I've stayed here several times and always had a good time. The staff are solicitous, the breakfasts are excellent and I love the pool and spa. The hotel is in a wonderful location, with a short walk to the shore, and a slightly longer one to State St., the main drag.", "title": "A little faded, but a good choice", "helpfulness": 1, "user": "petoq", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157077779}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My wife and I recently stayed in the Franciscan Suite: kitchenette, livingroom and bedroom. AND a fireplace that worked! A little faded- the baseboards needed painting and there were some strange wirings that should have been put into the interior of the walls. The rug could have been replaced. But these are minor quibbles- I look forward to returning.", "title": "Very, very noisy.", "user": "theone22", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 156634868}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "What a great little hotel. It's a couple a blocks from the beach and marina, The room was comfortable, and parking was outside the door. The well-planted grounds will make you think you are in a botanical garden.", "title": "What a great little hotel", "user": "gypsy33117", "date": "March 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154109114}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Being welcomed by the breakfast hostess at the Franciscan Inn in Santa Barbara is a real treat. “Auntie Carol” is a delightful and super-friendly woman who clearly enjoys welcoming people, sharing information about the happenings of the day, and providing a generous continental breakfast. It’s always a pleasure to stay here in a quiet neighborhood close to the beach.", "title": "Quiet Motel near Beach with Friendly, Helpful Staff", "helpfulness": 2, "user": "Jeff G", "date": "March 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 153795726}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Just returned from a long weekend in CA which included an overnight stay in Santa Barbara at the Franciscan Inn. Beautiful property, great location. Our room was spacious, nicely decorated and clean. You can park the car and walk the town from this location. If I have the pleasure of returning to Beautiful Santa Barbara I would love to stay at the Franciscan once again.", "title": "Beautiful Santa Barbara", "helpfulness": 2, "user": "Jacksgirl53", "date": "March 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153784427}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Clean, comfy inn close to everything. The only thing that was a little odd was the lady who stood there & handed out breakfast, she made you feel uncomfortable if you asked for a 2nd cup of coffee or a 2nd of anything.", "title": "Comfy Inn", "helpfulness": 2, "user": "sadieanng", "date": "February 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152539037}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "The best choice considering the accommodation, price and location.. We stayed at room #142 and it was ean and really comfortable, loved the jacuzi and the lobby. The price is fair considering the facilities and the breakfast included.", "title": "Just great!", "helpfulness": 1, "user": "Waissengrin", "date": "February 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 152011738}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "My friend and I checked in after a short walk from the train station just before 1:30 pm. We have been guaranteed the Santa Barbara Car Free discount when I made the phone reservation a few weeks before. Our room (two queen beds) was ready and located on the second floor where we took the stairs. It was cozy and clean with plenty of space for a one-night stay.", "title": "Home away", "helpfulness": 1, "user": "blgrn8", "date": "August 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77372047}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The Inn was a block away from the beach so it was a convenient walk back after we ended our day of exploration with a dine-in at Rusty's Pizza Parlor.", "title": "A Perfect Place to Stay", "user": "LisaRN1", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74981422}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My friend and I respectively enjoyed a nice take-your-time relaxing shower in the clean and spacious bathroom. We also had a good night's sleep on the comfortable beds.", "title": "Absolutely wonderful!", "helpfulness": 1, "user": "Sharon_flanagan", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74024476}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "It was a cool, refreshing summer evening so we just opened our screen windows for natural air to get in the room even though there was an air conditioner. The wooden blinds kept our privacy.", "title": "Very nice stay here!", "user": "SanDiegoZix", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73063387}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "Breakfast was in the main check-in lobby and a nice place for a social. However, my friend and I just took our items (e.g. orange juice, banana nut and pecan muffin, bagel and cream cheese, hard boiled egg, cheese cubes) back to our room to eat and chat. It was nice to conveniently have breakfast before taking our morning train back to Los Angeles. The evening before, we were able to linger at the lobby for a bit of hot drinks (e.g., tea, chocolate).", "title": "good hotel", "user": "hotelsrockk", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 72186170}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed here for the weekend and enjoyed it. The Inn is close to the beach and State St. and the staff was helpful in giving and finding directions to a place we wanted to go. We would stay here again. The room decor was nice. Cookies in PM were great.", "title": "Enjoyable stay", "user": "CaPA_visitor", "date": "February 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 96807455}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stopped at the Franciscan Inn on our way from San Francisco to LA and we very pleased by what we found. Great location near the beach and restaurants. Friendly staff and a well kept property. While it is not a 4 star hotel, the Inn offered a quiet, well run place to stay overnight. Value for price in Santa Barbara is quite good also. Only draw backs were the rooms are a bit small and the morning shower temp went from hot to warm (never cold) after a while. Definitley worth considering this hotel if you are planning a short stay in Santa Barbara and don't want to spend the dollars for a high end resort.", "title": "Pleasantly surprized by what we found", "helpfulness": 1, "user": "RugbyGuy1087", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 94408958}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "Brian and Auntie Carol took good care of me during Thanksgiving week, while I was in SB to visit relatives. They are a class act, very accommodating and informative. My room had everything I needed, though the mattress was much too firm for my taste. But I slept peacefully; it was quiet and I felt safe. The cleaning staff does an amazing job, and the continental breakfast (overseen by the charming and nurturing Auntie Carol) was fantastic. The pool is lovely; too bad I didn't have time to enjoy it besides taking my coffee and croissant to a table there to enjoy the sunshine and beautiful landscaping. I'll be back within a few months!", "title": "Love this place", "user": "lisa2lisa", "date": "December 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 88978982}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Cute hotel and rooms, reasonable rates. We stayed here one night on our 2 week tour of California.", "title": "Cute motel, nice staff but the worst sleep of our trip!", "helpfulness": 1, "user": "cdnmr", "date": "December 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 88829245}, {"rating": 2.0, "title": "Disappointing", "text": "Breakfast was great with lots of muffins, boiled eggs, cakes etc! Room was nice, curtains/bedspreads a bit dated but in good shape.", "helpfulness": 1, "user": "simmarian", "date": "November 23, 2010", "id": 87986618}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This place delivered a clean, comfortable, slighty more stylish than expected place to lay our heads in a great location near the beach. It wasn't exciting or luxurious but it was spot on for what we wanted. Booking my base in Santa Barbara from the UK I was hot and bothered about whether to be by East or West beach. I hadn't appreciated how close to each they are. It's a moot point. We were nearest West beach for the excellent Brophy Brothers restaurant on the harbour pier but also just 5+ mins from sandy East beach. In fact many of the inns reviewed here are within a few minutes walk of each other. Collecting breakfast and taking it back to the room or perching on one of the very few sofas and chairs where it was laid out wasn't a high point but didn't spoil a lovely stay. I was pleasantly suprised by how peaceful and attractive the area around the inn is. We walked in and out of the town centre each evening so it's perfectly do-able, though did feel a slight trek late on the way home. As a town I can't recommend Santa Baraba enough. I thought it was really charming. And, it was the first coastal place, on our September road trip from San Fransico that was warm and sunny - hooray!", "title": "spot on", "user": "AlYorks", "date": "May 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162516527}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed here for 1 night and arrived very late but the staff were great and got us settled in as quick as they could and left all the paperwork until the morning.", "title": "Nice little place", "user": "london18", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161369975}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "The rooms were of a nice size and had a tv. We didnt spend much time in them.", "title": "...Like home", "helpfulness": 1, "user": "Susan A", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160167243}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The breakfast was lovely with a range of bagels, cereals etc. Lovely staff and always giving tips of where to go and see or eat.", "title": "Fabulous Girl's Get Away", "helpfulness": 2, "user": "petalumachick", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159919266}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel is within walking distance to the beach and the pier. Very quiet but pretty.", "title": "Would DEFINITELY Stay Here Again", "helpfulness": 2, "user": "Pollie3996", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159801260}], "location": {"country": "United States", "city": "Santa Barbara"}, "variance": {"poor": 16, "average": 35, "very good": 122, "terrible": 1, "excellent": 99}, "aka": "The Franciscan Hotel Santa Barbara", "slim_ranking": 0.283333333333, "description": "Convenient location, casual comfort and caring staff make this cozy inn the quintessential hub of your Santa Barbara visit. Continental breakfast, pool, spa, afternoon cookies, Wi-Fi and more awaits you."}