{"user_rating": 5.0, "review_count": 174, "name": "Frances' Lodge Relais", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We arrived at Frances' and were greeted by Frances and Franco, the owners and folks who redesigned the most beautiful place we stayed at in Italy. There were 4 of us in 2 rooms and we were there for 5 nights and would have been there longer if we hadn't seen everything within a days drive in Tuscany. (a word of caution on the Morocco Room, to get to the bedroom, there is a circular stairway...so if you have any handicap, age or infirmity....do NOT stay in that room).", "title": "I felt like I was living in someones home.........", "helpfulness": 1, "user": "barrycher", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7709601, "likes": {"liked": "— the owners", "disliked": "— the nickle and dimeing of extras"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "That said (my wife's brother and sister in law had that room....we had the Yellow Room), you can't beat this as a place to stay that is both central (a hop, skip and a jump into Siena) and peacefull. We slept every night with the windows open and a blanked, and it was warm during the day. They prepare whatever you want for breakfast (you check it off a list --- there are extras that cost more that what is for free). Also note, there are some costs that creep up on you: you get a bottle of wine for a drink when you check in, but it's on your bill; internet is 10 E; drinking water; and if you want laundary it's 15+Euro to have it done.", "title": "Enchanting Tuscany", "helpfulness": 1, "user": "MolokaiCricket", "date": "April 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7479245, "likes": {"liked": "— Total ambiance and host/hostess", "disliked": "— The fact that we did not stay longer"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005, traveled with family", "text": "Franco and Frances run a great place and will book you into Wine tours and spas and anything else you want. If you want a restaurant in a town that is 100 km away, they can have it for you.", "title": "Enjoyed our stay", "helpfulness": 1, "user": "JulieTMLondon", "date": "March 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7008994}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "They have two beautiful dogs that roam the property but don't bother you. We tried talking to them, but they only understand orders given it Italian. The pool is a blessing at days end and we had two picnic dinners outside after buying the necessary foods in San Gimigiano and Moltepuciano. The wines are wonderful, but the vineyard cost to ship is insane. 6 bottles at a good price of 20 Euro each, would cost you 150 Euro to ship. So the Wineries are hurting for tourist business with the new laws on what goes on a plane.", "title": "Treasure in the Tuscan Hillside-Our favorite place to stay in Italy", "helpfulness": 2, "user": "luv2travelfamily", "date": "March 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6910901, "likes": {"liked": "— Hosts, charm, comfort, scenery, and location", "disliked": "— Having to leave"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We were sad when we left and if we ever return to Tuscany, we would never think of staying in another city or another place. Look at a map, Siena is the center and a great place to be.", "title": "lovely farm but poor value and poky room", "helpfulness": 4, "user": "michelleDublin", "date": "February 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6821103, "likes": {"liked": "— the fig trees", "disliked": "— the poky room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "\"Marvelous\" doesn't even begin to capture the beauty and charm of this modest bed and breakfast nestled in the gentle rolling hills outside of Siena. We were completely taken aback by the quaint charm of this fantastically beautiful and convenient location. Our experience with the proprietors, Franco and Frances was better still, as they were accommodating, friendly and gracious to a fault. Siena was originally not our first choice of destinations in Tuscany (our initial pick being Florence, an hour distant by train), however, we are forever thankful that we changed our travel plans to stay at Frances' Lodge to enjoy the wonderful flavor of this somewhat overlooked medieval Italian city, the and the absolutely incredible beauty of this bed and breakfast, as well as the unrelenting hospitality shown by Franco and Frances. We're truly hoping they will be around for many, many years to come as we are already planning another (longer) stay at Frances' Lodge.", "title": "Paradise Under the Tuscan Sun", "user": "charshbarger", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6179113, "likes": {"liked": "— The hospitality.", "disliked": "— Having to leave."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "New Jersey, October 2006", "title": "Tuscan paradise", "user": "montalcino", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6121847, "likes": {"liked": "— Location, views and comfort", "disliked": "— price"}}, {"rating": 5.0, "title": "Greatest bed and breakfast ever!", "text": "We stayed at the lodge for four nights in end of October. This was just \"picture perfect\". The location, the surroundings, the views, the accomodations and most of all the hosts. Frances and Franco were not just friendly, they made us feel at home. They were extremely helpful in organizing our day trips, giving us very detailed directions and suggestions, making reservations for wonderful wine testing. The rooms were very tastefully decorated and very well equipped. The \"great\" room where the breakfast was served was so beautiful and inviting, it was difficult to leave it every morning to get on the road.", "user": "honeyrebel", "date": "November 10, 2006", "id": 6104611}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "All in all it was a wonderful experience. Highly recommended.", "title": "Gorgeous spot but you need a car", "user": "Vickio", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5964735, "likes": {"liked": "— Sitting by the outdoor pool, sipping wine, watching the sun set over Siena.", "disliked": "— Tiny room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My wife and I just returned from one of the nicest vacations ever. We spent three weeks with Frances and Franco Mugnai at their bed and breakfast on the outskirts of Siena.", "title": "GREAT B&B", "user": "franmcld", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5834784, "likes": {"liked": "— Help from the owners on planning our day trips.", "disliked": "— You have to pay extra for internet."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Frances' Lodge is the perfect base for touring Tuscany by car. We drove 2.5 hours from Rome. Visited Florence, Chianti region, Multipuciano, Mutlticono, San Gimignano and many more towns. Siena is beautiful. Not so small that you can eat at a different restaurant every night. Not as large, crowded and difficult to navigate as Florence. Franco & Franca are warm and helpful. The views of Siena and the countryside are fantastic. There are only six rooms which makes it easy to meet other requests and share experiences - or not. Beautiful grounds planted with olives, grapevines and a variety of fruit and nut trees. Great stay of six nights. HIGHLY RECOMMENDED!", "title": "Wonerful", "user": "BarryPatch", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5813530, "likes": {"liked": "— Great views"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "The raving reviews about this B&B are not exaggerating one bit. The hosts are really amazing and treat you like family. They are English speakers, so it's easy to communicate. Franco was actually born in the house next door to the lodge where his parents, who must be in their late 80's, still live.", "title": "You Cannot Go Wrong with Frances' Lodge", "user": "kyliec", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 5614000, "likes": {"liked": "— Location and views", "disliked": "— The room was comfortable, but by no means luxurious."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The grounds and views are absolutely breathtaking. Rick Steves' team came to Frances' Lodge to take a picture of Siena, supposedly because it's one of the best views in the area. My husband and I chose to pick up our dinners at markets in Siena & surrounding area and bring them back to eat at the outdoor tables.", "title": "Peaceful and Beautiful", "user": "BugsandaBee", "date": "August 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5600421}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Franco provides maps, GREAT recommendations for where to go in the area, rides to and from the train station if you need it, etc. The breakfasts are excellent and there is plenty of it. There is a computer in the common area with free Internet access available. Cell phones are provided by the lodge with very cheap rates, and free calls back to the lodge.", "title": "Our favorite B&B!", "helpfulness": 4, "user": "Travelgirl78", "date": "September 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3980441}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Our room, the Adirondack, was like a guest room in someone's home. Comfortable, but far from luxurious. Not the highlight of the stay, but certainly satisfactory. A nice fruit basket was provided.", "title": "An absolute treasure outside of Siena", "helpfulness": 2, "user": "Carol23Maryland", "date": "September 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3975470}, {"rating": 5.0, "title": "A dream com true", "text": "Me and my boyfriend we stayed from the 1st to the 3rd September, 2005 and I wished that we had stayed for more days...I has been the first time in Tuscany and will not be the last, definitely we will come back to Frances’ Lodge. From the start to the end of our stay Franco and Frances always have been very helpful. On the first day of our stay they came to pick us up to the bus station and once we got to the farmhouse they explained all the things that we could do, where to go...They can also organise guided tours Tuscany(we had Susana and she was an excellent guide), book museums tickets….The farmhouse was only 3 km from Siena and just a short walk to the nearest village Ponte du Vechio about 15 min walk where we had lovely pizzas and a great service. If you are looking for a place this is the place to go, is the home away from home. Excellent views, excellent accommodation, excellent owners, excellent breakfast!!! Take my advise once you will get to France’s Logde you will not want to leave!!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 18, 2005", "id": 3913804}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We spent two wonderful nights with our two kids at Frances Lodge, and couldn't have been happier with our stay! Frances and Franco are warm, knowledgable hosts, our rooms were beautiful and comfortable, and our kids loved the pool! The setting is beautiful, in the heart of Chianti and very convenient to old Siena. Highly recommended!", "title": "We loved Frances Lodge!", "helpfulness": 1, "user": "GabyTraveler", "date": "August 15, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3767011}, {"rating": 5.0, "title": "Warm hospitality and great views", "text": "There are many good reasons to stay at Frances’ Lodge on the outskirts of Siena. The owners, Franco and Franca, hence the name Frances’ Lodge, were the best. The accommodations of the old farmhouse, now B&B, are comfortable and the décor of each of the rooms is tasteful, whimsical, inviting – delightful reflections of Franca’s artistic talents. Franco wins over his guests the minute they arrive, immediately making them feel at home. And where else could one dip into a swimming pool and gaze at a panoramic view of Siena? Breakfast is served in the garden by the limonaia, the structure that used to house the lemon trees. Can you tell I thoroughly enjoyed my stay here and that I highly recommend Frances’ Lodge? For more information, visit ---------", "helpfulness": 5, "user": "sempreingiro", "date": "July 27, 2005", "id": 3705153}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We stayed in Italy for two weeks and the highlight of our trip was Tuscany. We stayed with Frances and Franco for three nights and loved it! What a gem in beautiful Tuscany! First of all, they both treated us like family! They gave us great tips, handled the shuttle bus reservations, and much more. We were there for the famous Palio and Franco assisted us in planning for restaurants, etc. Franco and Frances even scheduled a tour driver (well before we arrived in Siena) for two days in which we visited several small towns, winery tours, etc. The tour driver was one of the best we had in Italy. Her name was Suzanna Sontini.", "title": "The Best place in Tuscany! Absolutely Wonderful!!!", "helpfulness": 3, "user": "watraveler", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3658999}, {"rating": 5.0, "title": "What a place!", "text": "Franco and Frances pool was a great way to end our day. The breakfast was fabulous and we can't say enough about the wonderful cappucino, Franco's olive oil and Frances homemade jam! Yum! If anyone ever goes to Siena, they MUST stay at Frances' Lodge. We definitely will go back and because we felt right at home! Wonderful!", "helpfulness": 3, "user": "alison.mather", "date": "June 20, 2005", "id": 3576728}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 1, "average": 4, "very good": 13, "terrible": 1, "excellent": 155}, "aka": "Frances` Hotel", "slim_ranking": 0.025641025641, "description": "Frances’ Lodge is a loverly restored country guest home set on a hill across from Siena. Its unbelievable view looks out over the old walled city from the top of a beautiful hilltop. It is here that, since the start of the 18th century, noble families of Siena kept their “villa”—the country house where they summered from May to November, to get away from the heat of the city and to watch over the harvests from their farm holdings; and here the Owners restored the 1853' largest \"Limonaia\" overlooking the Historical Garden, as part of a fascinating, rich of History, wonderful Estate, belonging to the same Family since quite 3 centuries.The commanding position of the house with its 360-degree panoramic views, the closeness to the city(only 1.8 km.—little more than a mile—as the crow flies), the silence and peace of being in the open countryside just outside the city walls... all of these features await you as soon as you pass through the gates, enter the lovely driveway, and behold the incredible view of Siena’s skyline amid vineyards, fruit orchards, and olive groves. You’ll be revived by sounds that busier parts of the world have forgotten: birds chirping, cicadas singing in summer, the wind blowing through the trees."}