{"user_rating": 5.0, "review_count": 539, "name": "Francis Malbone House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "... for our entire 3-night stay. We were in one of the Newport rooms in the new part of the inn. Lovely room, if somewhat small. Inn has lots of pleasant common spaces with comfy chairs and fireplaces for reading, chatting, enjoying the wonderful afternoon tea. Breakfast and afternoon tea were delicious. The drawback was that we weren't hungry enough for dinner one night! Will and Anne Marie are great hosts; friendly and helpful and obviously enjoying it. Every staff member we met was the same. The inn is within walking distance of all the downtown Newport attractions, and a short drive from the mansions and Cliff Walk. I won't stay anywhere else in Newport from now on.", "title": "Delightful, friendly staff pampered us ...", "helpfulness": 9, "user": "cliff2smith", "date": "April 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4895838}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Having been to a lot of inns over the years, we thought this one was lovely. We were in a Gardenside room which was even prettier in person than in the website photos. The bed was wonderful, the bathroom was small but really pretty, there was a fireplace (they provide duralogs), and a tv with vcr. Our only complaint was that it was very noisy the first night we were there (a Friday). The noise of all of the people on the street around 11 or midnight was enough to wake and keep me and my husband up for quite a while. We assumed that they were coming out of bars. There was bad weather the next night, so it was much quieter. I would imagine during the summer it would be very noisy.", "title": "Very nice inn", "helpfulness": 8, "user": "bostontraveler47", "date": "March 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4594185}, {"rating": 5.0, "stay_parameters": "Stayed June 2002", "text": "The staff were very nice and took the time to give us a map and make suggestions of things to do, places to eat etc. The breakfast was very yummy with a choice of 2 entrees each morning. We did notice that because the tables are set up for 4 and not 2, that people seemed to be there at the stroke of the time that breakfast started (us included). We think this was probably because most of the couples didn't really want to sit with other couples. There is also a larger dining table in another room. There was an extensive and impressive tea each afternoon with treats galore. We kind of ruined our dinner by enjoying tea so much one day!! There are many lovely common rooms, all with fireplaces burning, so plenty of areas to sit and relax.", "title": "Incredible Inn", "helpfulness": 9, "user": "missy67", "date": "February 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4410594}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Overall, this inn lived up to its good reputation. Though, given its expense, we will probably not return because of the noise problems.", "title": "Great Getaway", "helpfulness": 7, "user": "TARCY2", "date": "January 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4392103}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My husband and I were married in Newport and were looking for an intimate inn/hotel where we could stay along with both of our families. There are a lot of B&B's in Newport, but many of them are quite small and don't offer a lot of privacy. The Francis Malbone House was such a wonderful find! Not only was the inn beautiful, the service was incredible. The breakfast and afternoon tea were always delicious and the rooms are large and comfortable, some with fireplaces. My between all of us we occupied five of the rooms and no one had anything bad to say about their experience. We have since been back and have had the same experience as our first visit.", "title": "Five Star All the Way", "helpfulness": 6, "user": "macdebbie", "date": "January 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4356660}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We largely booked the Francis Malbone House because of the reviews here - and it is as good as they say.", "title": "Just perfect", "helpfulness": 2, "user": "Jennidcap", "date": "August 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5600241}, {"rating": 5.0, "title": "Wonderful experience", "text": "The decor, the furnishings, the food, the hosts, the staff, the location - nothing can be faulted.", "helpfulness": 4, "user": "Napawine", "date": "July 31, 2006", "id": 5535069}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed for 3 nights at the end of our holiday and it was the perfect restful stay that we had been hoping for.", "title": "Wonderful B&B!", "helpfulness": 5, "user": "4starrs", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5514291, "likes": {"liked": "— Location", "disliked": "— A bit pricey"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Extraordinary B&B, first class accomodations and service, easy walk to dowtown Newport. Highly recommended. Best I have ever stayed in.", "title": "Another Great Visit", "helpfulness": 4, "user": "GraftonTraveler24", "date": "July 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5446696}, {"rating": 5.0, "title": "Franics Malbone House Inn, Excellent in every way!!", "text": "This was our first visit to the Francis Malbone House and it won't be our last! A lovely inn on the main street in Newport. The inn's staff is accommodating and friendly. The room we stayed in was comfortable with a four-poster bed. The courtyard is great for grabbing a good book and relaxing. Overall, we really enjoyed our two-night stay and the central location of the inn to all Newport has to offer made our stay wonderful! A real winner!", "helpfulness": 9, "user": "858lindam", "date": "April 16, 2006", "id": 4977992}], "location": {"country": "United States", "city": "Newport"}, "stars": 3.5, "variance": {"poor": 2, "average": 7, "very good": 24, "terrible": 2, "excellent": 504}, "aka": "Francis Malbone House Hotel", "slim_ranking": 0.0196078431373, "description": "Luxury Colonial Mansion in the heart of downtown Newport."}