{"user_rating": 4.0, "review_count": 157, "name": "French Quarter Suites Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Friends and I stayed here couple weeks ago.We thought the staff was very helpful any and every way they could be.We did have to walk to get to are room which would not be good for the elderly.I believe they do need to give classes in HOW TO CLEAN to their maids.We had no problems with noise.Never seen any shady people as others talk about.We had a very nice stay and will be back.", "title": "U get what u pay for", "user": "Jasper05", "date": "April 8, 2009", "detail_rating": {"value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 27653256}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "My boyfriend, myself, and another couple we know traveled together to New Orleans this past weekend. We planned our trip a few weeks ago online. We wanted a suite with two rooms to share for a reasonable price that was close to Bourbon Street. We came across this hotel and booked online. Afterwards we looked on trip advisor and were alittle scared due to previous reviews. We brought clean sheeys and towels and pillows as a precaution. To our wonderful surprise, we had not needed any of these things. The room was very nice and quaint. The staff was very friendly and helpful to our needs. It was quaint and actually very quite. There are two courtyards with pools that were very clean and it is a short walk to everything! My only problem was parking. There is only about 10-15 spots in garage. The other parking is across street and you have to wait for staff to open up the gates. Also, it cost extra 20 per night to park. Other than that it was wonderful! Would stay there over and over again. Make sure to go on haunted history tour while there.", "title": "Awesome time", "user": "hmaxwell79", "date": "March 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25864709}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Five co-workers and I stayed here while on business in New Orleans. I thought this hotel was great for the price (approx 130/night for a two bedroom suite). Other motels at this rate were in really bad or remote areas, but this hotel is right on the northern edge of the French Quarter. It is within walking distance to lots of great destinations in the French Quarter and the Marigny.", "title": "Great Location for Budget Travelers", "user": "DecTraveler", "date": "February 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 24673956}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The rooms are ok - nothing fabulous, but a good place to hang your hat in between working and going out on the town. The room I stayed in was a two bedroom suite. There was a central room, a bathroom, and two separate bedrooms. The carpets and the bathroom were somewhat dingy, but not unsanitary. Our room came with a refrigerator and microwave, but some rooms offer full kitchens. My room was in the back of the motel and therefore my internet connection was pretty weak. My co-workers had rooms in the front of the motel and they said their signal was very robust, though.", "title": "Dirty Room, Scary, Rude Help", "helpfulness": 2, "user": "sjwolf64", "date": "November 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 21707601, "likes": {"liked": "— I must say I struggled to find just one thing I liked about this place & couldn't. Safe parking I suppose.", "disliked": "— Didn't feel safe there. Unsanitary. Rude, unhelpful person at desk."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I found the service to be good. Except for one employee, everyone was very friendly and helpful. The motel offers a secure pay parking lot. The rate is $20/day ($15/day for AAA members). If you are there for just a couple days this rate is probably ok, but if you plan on staying for longer you might want to investigate other parking options.", "title": "Tepid Charm", "user": "Machinecog", "date": "September 14, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 20077906, "likes": {"liked": "— Pet friendly", "disliked": "— The environment surrounding it"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "I saw a review that described this place as \"quaint.\" That's a perfect word for it. The room was spacious, it reminded me of a small apartment. It did smell a bit funny. The couch was sunken in at the middle and a bit grungy looking. We couldn't turn the AC lower than 72 or the coils would freeze. The room was constantly muggy. I slept without the blankets. We were told the hotel had WIFI, but none of could connect and we had two laptops amongst us. The view was pretty, it made us forget about the hotel flaws. It was right into the larger pool area. I think the part that made me dislike the hotel the most was the area. There were three of us, all female and we got a lot of unwanted attention on our way to the French Quarters. The walk is very quiet and empty. Some guy cussed at us for not telling him \"hi\" among a few other creepy experiences with disrespectful men. The ad says it's just steps from the Quarters, which is true. What they don't tell you, is that it's the dark steps, the most empty area of blocks before you get to the actual areas where there are crowds. I don't hate the place, I just wouldn't stay there again. The hotel I really wanted was offering the same price ($129.00) for two nights, parking included. Unfortunately, they were booked.", "title": "Stayed because all the good hotels I liked were sold out, otherwise this would not have been my choice", "user": "ToyInBabeLand", "date": "July 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 36321108}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This is the WORST hotel I have ever stayed at in my life. There was absolutely nothing good about it. It claims to be in the French Quarter, and never having been to NOLA I didn't know that this hotel is located right on the edge that it's technically not even in the French Quarter.", "title": "Worst Hotel Experience of My Life", "helpfulness": 2, "user": "rv1983", "date": "July 27, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 35943491}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "The rooms here are incredibly filthy. Our room stank of cigarette smoke even though it was supposed to be a non-smoking room. On our first day, I had to clean off the toilet seat to use it and pick up stray hairs that were obviously not mine from all over the room. On top of that, housecleaning only came in to clean ONCE on our four-night stay. The so-called free \"continental\" breakfast is an assortment of store-bought bread and some coffee and OJ. Don't count on eating this.", "title": "Warning: Inconvenient location and dirty", "helpfulness": 1, "user": "8-8-8-1", "date": "July 27, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 35920972}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Finally, the hotel had the nerve to charge us a $40 \"cleaning fee\" on top of what I had already signed for on my credit card upon checking out. The hotel is pet-friendly (I had brought my dog) and upon calling to inquire about this charge, I was told it was because they had to shampoo the carpet where my house-trained 4-year-old Yorkie had apparently made a mess. They claimed they did this several times during our stay, which doesn't seem likely considering the room was hardly ever cleaned.", "title": "Amazing value!!! Relaxing AND fun!", "helpfulness": 1, "user": "131wilson", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35768979}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Do yourself a favor - don't even THINK about staying here.", "title": "Wonderful weekend stay", "helpfulness": 3, "user": "dac626", "date": "June 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33250149}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Upon check in there was hair in the bed, hair on the floor in the bathroom, stained sheets AND towels, dingy thin towels, arrogant and unhelpful staff, inoperable lamps and ceiling fans, wifi that doesn't work . It shouldn't take 20 minutes to check into any hotel/motel. The hotel, more like a motel or motor inn is so run down. The carpet was in bad shape. It's a flea bag motel disguising itself as upscale.", "title": "VERY Unsanitary", "helpfulness": 1, "user": "zephyrwisconsin", "date": "September 8, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 1.0, "cleanliness": 1.0, "rooms": 1.0, "location": 2.0}, "id": 19898282, "likes": {"liked": "— The dogs running around everywhere", "disliked": "— The location is dangerous especially at night"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "When I stay in a hotel there are certain things I expect are a given...not here. I would never stgay here nor suggest it to my worst enemy...", "title": "Very Comfortable", "user": "motherthesequel", "date": "July 8, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "service": 5.0, "location": 3.0, "business": 4.0}, "id": 17658475}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Our stay at the Suites were very comfortable. We stayed there for Essence Fest 2008 and was amazed. When we booked our stay there, we were a little weary because of past reviews. I am here to say that all negative reviews must come from negative people. We stayed at the annex and it was very clean, service was excellent, staff was very friendly and we really enjoyed our stary. I would definetely stay there again.", "title": "Great Experience", "user": "Shortie153", "date": "May 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 16260370, "likes": {"liked": "— Huge suite with 3 bedrooms, kitchen, diningroon, livingroom, 2 baths and a balcony", "disliked": "— The railing on the stairs up to the suite were a bit loose which made me nervous"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "I just got back from a lovely long weekend in New Orleans and can't say enough about the French Quarter Suites Hotel.", "title": "Friendly and Accomodating", "user": "Banjosmom", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15617325}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "A group of seven of us went down to NOLA for a friend's 30th birthday and I was in charge of making the hotel arrangements. I looked at many hotels but had difficulty finding one that could acommodate our large group without splitting us up into several rooms. Many of us had not seen each other in years and wanted to spend as much time together as possible. I am so happy that I stumbled upon this hotel on Trip Advisor!", "title": "A Great Jazzfest Experience!", "user": "Rob_NJ", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15508439, "likes": {"liked": "— Spacious living area, friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I've stayed @ FQS for every Jazz Fest since 2005.", "title": "The only place I would stay", "user": "Adamant22", "date": "June 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33097527}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "I wouldn't go anywhere else. They acquired the adjacent hotel earlier this year which was a great bonus. The courtyard and pool are much nicer.", "title": "What a fun weekend", "user": "vacationtimeforme", "date": "June 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 33061405}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "There are different sections of the hotel and they are very different. If booking you might want to ask about what the different rooms are like.", "title": "Quant, historical hotel stay", "user": "OhioCbee", "date": "May 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29784120}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "During JF we stay in the suites section (to cram as many people as possible).", "title": "HORRIBLE HORRIBLE HORRIBLE", "helpfulness": 2, "user": "Travelnut47", "date": "April 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 29108180}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Yeah, some of the carpets in the suites section have seen better days. The owner told us he was going to replace them with tile at some point.", "title": "Dirty, shabby, bad location", "user": "flygirl7747", "date": "April 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 29079842}], "location": {"country": "United States", "city": "New Orleans"}, "variance": {"poor": 8, "average": 19, "very good": 39, "terrible": 21, "excellent": 70}, "aka": "French Quarter Hotel New Orleans", "slim_ranking": 0.52}