{"user_rating": 4.0, "review_count": 170, "name": "Fullerton Marriott at California State University", "reviews": [{"rating": 5.0, "title": "this is the Place!", "text": "Clean, quiet, classy and affordable. This hotel gets my vote. Have spent numerous nights in the Fullerton/Anaheim/Buena Park area and I truly love this place. Easy access to the freeway to nearby Disneyland, The Pond, Knotts, Nixon Library and Anaheim Stadium. A well kept-secret need not be kept secret anymore. See you there!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 26, 2004", "id": 1613725}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "We visited the Fullerton Marriott as part of a group attending a local soccer tournament.", "title": "Nice Relaxing, Comfortable, Well-Located Hotel", "helpfulness": 3, "user": "Tuckers", "date": "September 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5768727, "likes": {"liked": "— Location was ideal & Room was clean and comfortable", "disliked": "— NO complaints"}}, {"rating": 4.0, "title": "Most comfy bed ever....", "text": "First impression: Very good location, right off the 57 freeway at Nutwood. There is construction going on, so getting into the lot was a little tricky, but there was ample parking in the lot/parking garage.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4315847}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "Checkin went well. There were a couple people in line ahead of us, and we waited only about 5 minutes. We were given our room, a map, and we were on our way. We got to our room and someones stuff was still in there. They obviously had not checked out. We went back downstairs and told them. They were surprised, of course, to find out that that room was still occupied. They didnt have any other rooms available with 2 beds. Would we take a 1 bed room? I said I would rather not, because I didnt think my teenager would want to sleep in the bed with me. So they offered a free roll away, which wasnt really acceptable either, but if thats all they had, then ok. She then offered to give us free dinner and free breakfast at the hotel restaurant. Ok, we'll take it.", "title": "A Very Good Choice", "helpfulness": 5, "user": "Pigeon_Point_Pops", "date": "December 26, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4300445}, {"rating": 4.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "New room was fine. It was on the 5th floor and had a nice view of the entry area of the hotel/the freeway/ and faraway city. The room was decorated nicely, with dark woods and a pretty bed. They had a nice down style comforter & lots of pillows. There was a nice desk, with its own lamp. A chair & ottoman, and the unit with the tv & drawers. The bathroom was a typical hotel bathroom. Tub/toilet/sink all in one room.", "title": "Great stay, good value", "helpfulness": 4, "user": "hanaloa", "date": "November 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4110218}, {"rating": 4.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "We did not use the pool, but there was a nice large area, with plenty of chairs. The pool looked nice.", "title": "Good Value", "helpfulness": 5, "user": "SGV", "date": "July 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3722680}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Stayed there for 4th of July weekend. Very clean, comfortable bed/linens. Covered Parking that is free. Easy access to freeway. Not close to theme parks but not too far either. Stay here and be reassured you will not have any unexpected \"suprises\"(letdowns/complaints).", "title": "Won't go wrong staying here.", "helpfulness": 2, "user": "Vacaville", "date": "July 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3635933}, {"rating": 5.0, "title": "A Great Hotel", "text": "This hotel was great!! The front desk staff was great! A clerk named Michael was the best there!! He helped us find a great restaurat, and even gave us perfect directions to several places nearby that we needed to go to. Michael was warm and friendly and by far our favorite person there!!The front desk manager Lori was also a great help to us as well as Laine during the evening!! What a wonderful place to stay!!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3459053}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "I also booked my stay at the Fullerton Marriott through priceline, and got an excellent deal. I have no hesitations recommending this hotel. Although the room we received was not perfect (some wear on carpets and walls), it was impeccably clean. Our king size bed was quite comfortable, and the bathroom was pretty standard, but also perfectly clean. The staff at the front desk were extremely helpful, and eager to provide directions to local restaurants and attractions. Disneyland was only a few minutes away, and mostly non-highway driving. The free parking garage was convenient as well, but our room was near the exit. Didn't try the restaurant due to the prices, but being next to the college there are plenty of amenities nearby.", "title": "convenient and pleasant", "helpfulness": 2, "user": "aspalm", "date": "March 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3298285}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "One of the nicest hotels I have ever stayed at, and the best one that I have ever obtained on Priceline over the past two years.", "title": "Fullerton? But it's so far away from Disneyland!", "helpfulness": 2, "user": "Glengoyne", "date": "March 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3250745}, {"rating": 5.0, "title": "BEST DEAL IN TOWN", "text": "VERY COMFORTABLE BEDS, well designed rooms and bathrooms.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 27, 2004", "id": 1681883}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 6, "average": 27, "very good": 64, "terrible": 9, "excellent": 64}, "aka": "Fullerton Marriott At California State University Hotel", "slim_ranking": 0.1}