{"user_rating": 3.5, "review_count": 44, "name": "Fun Valley Family Camping Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This was our family's tenth year in the last thirteen going to Fun Valley. In the beginning, we would rent a cabin or motel room, then we rented one of the travel trailers, and now we take our own fifth wheel trailer. Where to begin ...", "title": "Tenth Year At Fun Valley ... Looking Forward To More!", "helpfulness": 1, "user": "ccollman", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117227898}, {"rating": 4.0, "title": "Great place, but they do pack them in....", "text": "Fun Valley is a giant family park. Accomodations include full hook-up RV spaces, cabins, a motel and a bunch of 26' travel trailers that have been permanently installed. There is a restaurant that serves great breakfasts, lunches and dinners cafeteria-style. There is also a snack shack that serves burgers, hot dogs, pizza and the best ice cream! There is a gift shop and recreation building with all of the pool tables, air hockey and video games a kid can play. They also have a grocery store with an amazing inventory of stuff, a gas station, including diesel, a laundromat, two restroom / shower buildings, a \"Funatorium\" and the dance hall (where they do dances, small concerts, etc.).", "helpfulness": 2, "user": "Bastrop_TexasMairi", "date": "August 7, 2011", "id": 116404285}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The whole facility is secured - security staffs the front entrance and you must be a registered guest to enter. At last check, you also had to be a couple or a family to get in ... they do not allow overnight transient travelers. This is the only place our family has ever felt comfortable \"turning the kids loose\" to go play.", "title": "Horrible place with Rude and disrespectful", "helpfulness": 13, "user": "bawhitt", "date": "July 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 115887786}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "As far as things to do there, you can play putt-putt golf, rent a bike if you didn't bring one, rent a paddle boat on one of their dozen or so small lakes, go fishing on any of these lakes, tube down the Rio Grande River (the Rio Grande River goes right through the property!) or go for a two-hour horseback ride through the beautiful mountains. Best of all, the kids can take a walkie-talkie and explore the whole place, meeting new friends and spending time in the great outdoors.", "title": "My favorite vacation spot", "helpfulness": 2, "user": "Lnewton2", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115128342}, {"rating": 5.0, "title": "Where Memories are Made", "text": "The staff are mostly retired folks from Texas and Oklahoma. Their personalities, charm and friendliness are unmatched. They do this because they love to, not because they need a job. You always feel welcomed at Fun Valley.", "user": "dawn145", "date": "June 24, 2011", "id": 114711051}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "My family and I met some friends for a two week stay at Fun Valley. I admit that I was worried about getting bored. I was so wrong. Two weeks did not feel like enough time. We visited nearby towns, went to ranger stations for permits to gather fire wood. We took sleds and headed for the moutain tops. It snowed in June! It is so beautiful in the area and we saw all kinds of animals in the mountains. At camp, everyone was friendly. The kids could ride bikes all over. They loved the stocked fishing ponds. We had the best fish fry in the world one night. There is also a contest each week for the biggest fish. My son was so close! We rode the horses through the most beautiful valley. The kids loved putt-putt, which we got to play free since we came in early June. We rode the paddle boats too. The restaurant had wonderful food. The kids loved the gift shop, game room, and snack shack. We enjoyed hiking up the mountain that was right in front of our sight. We carved our names in a tree up there along with the date. Our first trip was in 2005 and we did go back in 2006 and had even more fun. We brought more family with us. We found \"our\" tree and carved the new comers names and the date again. We were unable to go for the past few years, but we are already planning our 2010 trip. We can't wait to go back! Everyone there is awesome. If you want to have a great time with your family, this is the best place to go.", "title": "Fun Valley is the absolute best!", "helpfulness": 1, "user": "KinderCamper", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34867966}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Our Family is going back to Fun Valley again for the 10th year in a row. It is such a relaxing place to go on vacation with your family. The children have a blast while they are there - from riding bikes, playing putt putt golf, paddle boating, fishing in the sure catch pond, riding horses into the mountains that are just to the back of the property and best of all tubing down the ice cold Rio Grande River that runs through the park. It is a park that you can honestly turn your kids loose and let them be kids without any worries. As an adult I enjoy sitting in my chair by the Rio Grande during the day reading a good book and in the evening going to the Snack Shack and buying some soft serve ice cream and coming back to sit around a camp fire with friends. This year there will be 11 families that will be all going from Irving to spend a great week together. Once you go - you have to go back year after year - it never gets old for us.", "title": "The Most Amazing Place to go and reconnect with God's True Beauty", "helpfulness": 3, "user": "momondego", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32841192}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We are able to take day trips to the Wolfe Creek Pass, Treasure Falls, Meadows Lake, Creede just to name a few. The kids have been able to play in the snow at Wolfe Creek Pass in the middle of July almost every year that we have gone. This year my husband and friend are going to hike the Continental Divide in an over night hiking trip.", "title": "Almost Heavenly", "user": "ktex57", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31277912}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We travel from Texas to Colorado - and the drive is so beautiful and breath taken at times. I highly recommend this place for families with young children that truly enjoy an adventure. There is never a dull moment at Fun Valley. The Henson Family and all their crew make your stay at Fun Valley and incredible experience.", "title": "Fun Valley here we come...Again!!!!", "user": "chinatoo", "date": "May 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29789731}, {"rating": 5.0, "title": "Fun Valley, Southfork, Colorado", "text": "We have been going for years and years also.This place is wonderland vacation.Fishing,mini golf,paddle boats,singing,dancing,playing,andTheSnack Shack also has the most amazing strawberry malts out there,with an old timy burger mmmmmmmmm good.The weather is mostly wonderful.Beautiful scenery,river-tubing also,can't wait to go back.A Family Trip to make.Always,ENJOY.", "helpfulness": 11, "user": "whitaken", "date": "July 8, 2008", "id": 17661319}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I recently stayed in a trailer with my family at Fun Vally Resort in South Fork Colorado. We had a great time and there were lots of things to do. My only issue is with the employees that work at the resort. The employees are all people who have been attending this resort for years. They are not friendly and are not interested in the least in helping you. The only reason that I will even consider going back is the location. This is a great resort, and is super family friendly. I have called 3 times over the last 2 weeks to make reservations and have left messages with no return phone calls, and just got off the phone and was told to call back in an hour. I guess they have enough business in these hard times, that they don't need mine. It is very frustrating dealing with people that don't care about customer service. With some customer service this place could be perfect.", "title": "Great Place to stay with family, if you can deal with very unfriendly employees.", "helpfulness": 12, "user": "jason327", "date": "September 2, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 78016867}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The RV slots are so crowded you can barely walk between them. They would not let us pitch a tent on our site even though there was enough room at the end of the RV. We had to pay for an extra site. They close the bathrooms for 1 1/2 hours every morning for cleaning. It's like staying in a giant RV city. If you rent a bicycle from them, you aren't supposed to let another family member ride it. They have to rent their own bike.", "title": "Crowded, expensive, and not a wilderness experience", "helpfulness": 12, "user": "cindy_thompson6", "date": "August 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 73240832}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This would be a nice place if these people weren't so greedy.", "title": "6th year at F V", "helpfulness": 1, "user": "bahbeee", "date": "July 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70688007}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We have enjoyed all six trips to Fun Valley, CO (just got home two days ago). There is plenty to do, even though my husband likes to fish every day. It is very relaxing there. Also, towns closeby are worth visiting; ie, Creede, Lake City, South Fork and Pagosa Springs. Pretty places, lots of trees and mountains. Families can all have fun at FV. There is even a July 4th parade through the park with kids on decorated bikes, people on horses, in decorated golf carts and a old antique fire truck that still sprays water. The rent trailers and cabins have always been clean and ready to occupy when we arrive,", "title": "Bring Your Own RV", "helpfulness": 11, "user": "Martha B", "date": "August 23, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 38555056}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Having vacationed at Fun Valley for years, then spent a few summers there, we are definite fans. This last trip, however, dampened our spirits a lowered our overall opinion of Fun Valley. We were taking a road trip in our car this year, not pulling our RV. We don't mind the older, even worn look of the motel/cabin accomodations, thats all a part of the Fun Valley charm. But, the filth we found in our accomodations was not only unacceptable and quite disappointing, but not healthy. From the floor to the kitchen facilities, everything was dirty. When we checked in, we were required to pay for 3 days, but only stayed 2 because of the condition of our room. Fun Valley is great if you bring your own RV, but not so otherwise. We were also disappointed in how the prices have increased, but the quality has not. Sad visit for us.", "title": "A wonderful place to spend your vacation.", "helpfulness": 1, "user": "sfarmer", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35298933}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We participated in the a week of square dancing with meal included it was very reasonable with good food. Not fancy but quality. It was right on the Rio Grande River and the Travel Trailers you can rent were right next to it. Perfect to have your coffee in the morning. This family resort has lots of RV spaces, many are close together. There are motel units to rent too. Get the ones with a kitchenette. they have two small bedrooms. The motel unit without a kittchenette had no river view. Our unit #14 was above the laundromat and was very warm until the middle of the night. It had steep large steps up to units 14 and 15. There was minature golf, horseshoes and paddle boats to rent. Many of the families brought their kids bikes too. There are also horse ride and entertainment too.", "title": "Square Danced the night away every night", "helpfulness": 2, "user": "stapalm", "date": "June 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 114099824}, {"rating": 2.0, "title": "old and rundown", "text": "A lot of the people camping at Fun Valley had been vacationing there every year since they were children. They knew other campers and had wonderful memories. They saw the place the way it was 30 years ago and didn't seem to realize that it had become old and rundown. I don't think the owners are putting much money back into it. The workers are people who spent many years vacationing there and are now retired and want to spend their entire summer there. If you notice the other reviews, many have been going there for years. There is a lot of potential to the place and I'm sure in it's day it was the best.", "helpfulness": 8, "user": "pawneecamper", "date": "June 16, 2011", "id": 113833130}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We have been going to Fun Valley for many years. When we first went we were a young married couple with no children. We now have 3 and they have been every year of their lives. We never worry about their safety. The rules of the resort make it a safe place for kids. All they have to do is obey the rules and everything is great. We rent them bikes as soon as we get there and they can ride anywhere they want. There is a security guard at the entrance to keep noncustomers out and kids in. It's great. After just one day they kids have made friends and we have these new kids knocking on the door wanting ours to come out to play. Just like in a neighborhood in the 50s(I guess, I wasn't actually born then). It isn't fancy, but the atmosphere makes up for it--much better than a 5 star hotel. They food is awesome. Almost all of the people working there are friendly and helpful. The ones that aren't usually don't come back. Hopefully we can keep going to Fun Valley for many, many years to come.", "title": "Going to Fun Valley is like stepping into Mayberry.", "helpfulness": 2, "user": "VictoriaTraveler_11", "date": "June 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 112791418}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The employees are not only unhelpful, they are down right disrespectful! I made our reservation a year in advance of our trip. I called to change my arrival date by three days and to my shock I no longer have a room. I am only one in a large group that will be making a 12 hour drive to stay there. I was not angry with them or snappy about their rules. I was heartbroken over the indifference they showed about how they affected my family trip. I was told that \"We only want happy people in Fun Vally and that if I couldn't get happy I didn't need to come.\" i could understand being told off in such a way if I was irate and screaming, I was crying people. \"Family Friendly\" a complete lie.", "title": "Disappointing", "helpfulness": 18, "user": "5famfun", "date": "May 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 110831040}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This wil be my 32 year at Fun Valley and I will continue to go until I can't camp anymore. Its a great place to go and have fun. My kids grew up camping there and they now bring their families. Yes there are rules and restrictions and if you don't like them don't come. But for clean family fun the place can't be beat. The workers are always friendly and helpful. Yes thru the years more spaces have been added and they are tight but he makes you get to know your nieghbor and we have made many friends that we look forward to seeing each year. See you at Fun Valley.", "title": "Great Place for Family Fun!", "helpfulness": 5, "user": "lv2go136", "date": "February 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 95296897}], "location": {"country": "United States", "city": "South Fork"}, "variance": {"poor": 5, "average": 4, "very good": 8, "terrible": 8, "excellent": 19}, "aka": "Fun Valley Family Camping Hotel South Fork", "slim_ranking": 0.75}