{"user_rating": 4.5, "review_count": 316, "name": "FunDee Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Fun Dee Botique was the best hotel i have stayed. Ten minute walk to the main beach (Patong Beach). You are in the heart of Patong but not in the hustle and bustle. Touk Touks are in arms reach and other beaches are in close proximity so you are not really spending alot of money for transport. The breakfast was of high standard an infact the best coffee i have tasted. The hotel is best value for money and service is of high standard. So if you are looking for a place to stay i highy recommend Fun Dee.", "title": "Great location,fantastic service.", "helpfulness": 1, "user": "Franco T", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149914226}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Fundee is a good choice in phuket, you could find everything for a good trip here. Firstly, the great location, only 10 mins to walk to beach and half of that time time go market. Secondly, the room was clean and nice decor. Last but not least was the staffs. All of them were so friendly and helpful at suggesting place to go. Highly recommended", "title": "Great location and good value for money", "helpfulness": 1, "user": "Jessica K", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149621278}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "This hotel is a great find - about 10 minute walk from the beach and not in the middle of the madness.", "title": "great find", "helpfulness": 2, "user": "loulou c", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149246845}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The staff couldnt be more welcoming and made sure you had everything you needed before you left recteption. the rooms are spaciaou and clean and the bathroom is clean and tidy with a powerful shower.", "title": "Clean, Friendly and Value for Money", "helpfulness": 2, "user": "Laura B", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 149246019}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "While we were there the owners brother was around and he was genuinely interested in getting feedback from the guests and ensuring we had a good stay. The cafe serves a great breakfast too.", "title": "Fantastic hotel!", "helpfulness": 1, "user": "Danesk", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149236305}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "FunDee hotel is relatively inexpensive, compared to a number of other offerings in the area. Unfortunately, there is a reason for the low price.", "title": "Cheap for a reason", "helpfulness": 5, "user": "bork3000", "date": "January 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150550982}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "Rooms are basic, fairly barren. Bed is large and firm, there is a desk, a semi-usable \"cube\" chair and a tiny TV which you won't see from the bed. There is no teapot or anything else to make tea - which will be important, even if you don't drink tea, see below :)", "title": "A good place to stay for a night in Patong", "user": "Nicola V", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 150376329}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Bathroom is in a common budget-hotel Thailand style - shared space that includes a sink, a toilet and a shower. Since there is nothing separating shower from the rest of the room, and floor is not inclined towards the drain - each shower will invariably saturate the entire bathroom with water. A single floor towel provided is not enough to contain that water from spreading.", "title": "What a great, clean, friendly & bargain Hotel", "user": "Lonewolfeb", "date": "January 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150039718}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Speaking of towels, towel policy is pretty simple - you get 2 large towels per day (provided housekeeping didn't miss your room, see below too). No exceptions, no matter how nicely you ask. If you need another towel to contain the flood in the bathroom - better get your own (hotel conveniently \"sold\" me one for 100 baht).", "title": "Great little hotel just outside the madness", "user": "Mike C", "date": "January 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150003430}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Hot water is provided by instant-on electric heater and only available in the shower. This is also fairly common in lower-end hotels here. Unfortunately, if you need to shave and don't use electric razor - you may be SOL. Remember - there is no teapot? Well, there is no way to make any amount of water sufficiently hot for shaving either. If this may be a problem - plan accordingly.", "title": "Excellent in many ways.", "user": "LubbeSwe", "date": "January 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 149956620}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I should start by saying that 2 stars may seem a little low, as the rooms are fairly spacious and clean, with a decent sized bathroom.", "title": "3 nights too many...", "helpfulness": 5, "user": "Eagles1", "date": "February 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 151543441}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "The real issues I have with Fundee are that like a number of hotels in Patong there is a distinct lack of any privacy or space between the properties. Our room at the back of the hotel was literally a metre and a half from the hotel opposite and the windows pretty much lined up together...not ideal. As well as this, the walls between the rooms are quite thin and you can hear most of what is going on next door. Again with this being Patong this can be deep into the night! I should state that we didn't have quiet nights in, but it would have been nice to get some sleep around 2am or so! Banging on the walls and trying to get some peace and quiet all proved fruitless. The staff as nice as they are were not keen to intervene in noise issues with other guests.", "title": "Good Service, Clean and excellent Value", "helpfulness": 2, "user": "HelouE", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151465133}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "All in all not too bad a place but left needing a few quiet nights elsewhere.", "title": "We considered leaving here....", "helpfulness": 4, "user": "KristaJ", "date": "February 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 151304982}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "This Place is great value and well located close to everything in Patong, The rooms are spacious and clean and the bed was so comfortable. Had all the facilities I needed in the room. The staff are so freindly and hellpful. The coffee here in their little restaurant is one of the best Ive had anywhere on my travels. Ask the staff anything as they speak good english and always willing to help. The Senior Manager there was an Australian named Michel and he was so freindly and funny and willing to answer any of my questions. Thank you to all the staff as they are so nice and freindly and willing to always help. I recommend this place for great service, location and great value for money", "title": "Excellent location and great place to stay!", "helpfulness": 3, "user": "njoy03", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151141963}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "A friend and I traveled to South East asia in the off season. We were used to getting awesome hotels at incredibly cheap prices. So when we saw the price here, and read the reviews, we thought we were getting the same thing. I would not really classify this as a hotel, it's more like a hostel. The rooms, while clean, were incredibly basic- no frills here. Our room had two beds and a fridge- in which everything cost extra. The bathroom is asian style, so expect a wet toilet and bathroom floor for the duration of your stay if you plan on showering there. The staff was nice, but we hit a huge booking snafu- we booked a great trip at a decent price, only to be told later we did not really book it (although we had paid) and that tour was now full. We were placed on another tour which was supposed to be comparable, only to find out when we got there is was anything but- and exactly what we had been hoping to avoid....and the guides on the tour spoke very little English (we had been told they spoke English) and instead found ourselves trying to decipher Russian! Needless to say the tour was not very meaningful- but perhaps this is the tour companies mistake more than the hotel's. When we complained to the front desk, who had booked all this for us, they were not willing to give us a refund or a discount, or any compensation what so ever. The location is good to walk around Phuket. My advice about Phuket is- really know what you are getting into before you stay here- it's not quite what we thought. Also, the lobby is open to the street at all times and we once saw a giant rat running around in there. Not really the hotel's fault, but gross. There is free internet in the lobby, though, which is nice.", "title": "Excellent option, close to everything", "helpfulness": 3, "user": "eugene n", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 150566961}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed at FunDee Boutique for 3 nights during the X-Mas/New Years high-season travel craze, and I couldn't have asked for a better experience. The hotel is just a 5-minute walk from all of the attractions - the beach, party road, restaurants, malls, etc. You can enjoy all that Patong has to offer and then escape the noise for a good night's rest. The hotel is spotlessly clean, the staff are fantastic, the beds are comfortable, the showers are great...I can't recommend it enough. It's a wonderful place to stay.", "title": "Fantastic choice in Patong", "helpfulness": 3, "user": "AndreaConnelly", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148862231}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "My wife and I travelled for two months across South East Asia including the Philippines and Thailand and stayed at a range of different hotels. I can honestly say for the price we payed at FunDee and what we received during our stay, it was ranked as our top hotel.", "title": "A 5 star experience!", "helpfulness": 4, "user": "Bignlilsal", "date": "December 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148021023}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "FunDee is a 3 star hotel from memory so I was a little skeptical after choosing it as our final hotel to stay in at the end of our holiday (especially considering I have a wife who is particularly fussy about where she stays), however in many instances it provided us with more than what the 5 star hotels did. A clean and spacious air con room with a great mattress, a Great location in Patong, the ability to have laundry done for a reasonable price, a great breakfast, bar, scooter hire, day trips, a GREAT cafe, and the list goes on!", "title": "Don't think twice...", "helpfulness": 1, "user": "Taibash", "date": "December 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147786146}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "Above all, the greatest thing about this hotel (that becomes such a critical factor after you have travelled soo much and faced soo many issues) is the fact that the service is GREAT! All staff members talk English fluently and the owners who are always around, are Aussie born and such great people! Friendly, polite and down to earth!", "title": "A very unpleasant experience", "helpfulness": 6, "user": "KGoh", "date": "December 17, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 147639566}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The beach is approximately a 7-10 minute walk and both Banzan Markets and Jungceylon shopping mall is right at your finger tips (approx. 2 min walk).", "title": "Very good hotel", "user": "john_1664", "date": "December 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147438792}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 3, "variance": {"poor": 16, "average": 18, "very good": 63, "terrible": 6, "excellent": 213}, "aka": "FunDee Boutique Hotel Patong, Phuket", "slim_ranking": 0.0674603174603, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "FunDee Boutique Hotel offers first class accommodation in the heart of Patong only minutes stroll to the beach, nightlife, restaurants, shopping centre and tourist attractions. Designed for the savvy traveller, we have 24 hour reception and our rooms are modern, large and fresh with deluxe mattresses and amenities, air conditioning, LCD TV’s, laptop safe, free WIFI, bar fridge and balcony. The hotel lobby and bar offers the perfect ambiance to relax and unwind or to watch live sport on the big screen. We are determined to provide first class accommodation at a truly affordable price. Our fun, friendly and focused staff will ensure you have Sweet Dreams, or as we say in Thai... FunDee"}