{"user_rating": 4.0, "review_count": 2343, "name": "Furnace Creek Inn and Ranch Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Furnace Creek Ranch and Resort is a Xanterra (Fred Harvey) run property and is in the middle of the price range of very limited lodging in Death Valley National Park (Furnace Creek Inn is much more expensive; the more remote, but nice looking Stovepipe Wells, is cheaper). As a frequent visitor to Yellowstone, where Xanterra is also the exclusive concessionaire, I was not surprised by the un-frilly but clean and sufficient accommodations at Furnace Creek Ranch. The room was good-sized, and our nights there were quiet (thanks more to well-behaved neighbors rather than soundproof walls, I suspect). Our room had two queen beds, utilitarian décor, TV with HBO and other good channels (which mattered as I ended up spending a day in bed with indigestion, alas), and a few undistinguished framed photos of Death Valley scenes on the walls that would not hang straight no matter what. The bathroom had a tub, hot water on demand, plenty of big towels, a hair dryer, and little shampoo and hand cream provided: nothing royal, but perfectly comfortable. There was also a dorm-sized fridge, very nice for chilling Cokes and orange juice, and the usual little coffee pot with foil packets of lousy coffee. In late March-early April the ceiling fan provided all the ventilation and cooling we needed (the weather was delicious the whole time we were there). We also had a nice balcony with a view of mountains and huge trees that mostly blocked the view of the golf course beyond. My only complaint about the room was that one of the beds had those trick sheets with the shot elastic that look fine when you pull back the cover but as soon as you lie on the bed all four corners roll off of the mattress and within seconds you’re entirely tangled up in a ball of sheets, bed-pad, and covers. This was miserable during my moments of queasiness (due either to lunch at Del Taco in Baker, or the spaghetti and meat ball dinner at the Forty-niner Café at Furnace Creek, we’ll never know which).", "title": "Furnace Creek Ranch - Just What We Needed", "helpfulness": 4, "user": "YellowstoneGal", "date": "April 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 15013221, "likes": {"liked": "— Location!", "disliked": "— No major complaints"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "The one annoying thing about this property (but by no means unique to it) is the disingenuous card on the bed that says “We are committed to pampering you but…are concerned about our natural resources….Would you like fresh towels? All towels left on the floor will be replaced, towels placed on the rack will not be changed.” This is entirely blah-blah (a pet peeve of mine!) as all towels were changed daily, in spite of the obviously urgent imperative to save water in Death Valley, of all places, no matter where we put our towels after bathing. In fact the whole Furnace Creek oasis is an exercise in the conspicuous consumption of water. Besides well-watered green lawns and large trees (not to be seen anywhere else in Death Valley!) there’s a large spring-fed swimming pool, golf course, and up the hill at the very upscale Furnace Creek Inn, palm-bordered tennis courts.", "title": "Furnace Creek Ranch adequate but overpriced", "helpfulness": 2, "user": "Kleetampa", "date": "April 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 14993625, "likes": {"liked": "— Location inside the National Park.", "disliked": "— Overpriced."}}, {"rating": 4.0, "title": "amazing location", "text": "Also in the Ranch area there are a gift store (which, most disappointingly, does not sell little boxes of 20-Mule Team Borax, but like many Xanterra properties, does have a nice, small selection of fairly priced Indian pawn jewelry), the Forty-niner, which is a so-so sit-down restaurant, a saloon, and the rather good Wrangler Steak House, which, though more expensive, is worth the upcharge. The breakfast buffet there ($11.04 including tax) was generous, and offered a good array of hot and cold choices. In spite of the good food, the coffee was undrinkable. I think it was vanilla or hazelnut flavored, maybe it’s just me, or maybe it’s just the local water, but I thought it was gross. There is also a saloon that we didn’t patronize but it looked busy. Also at the Furnace Creek Ranch are the Borax Museum (cute) and free wi-fi in the gift shop-restaurants area – but take your own computer.", "helpfulness": 1, "user": "greenbank54", "date": "April 12, 2008", "id": 14985012}, {"rating": 3.0, "title": "A place in the middle of nowhere", "text": "Since eateries are very severely limited in the park, I might mention that our lunch at the Toll Road Restaurant at Stovepipe Wells was quite good. We also had a memorably superb dinner at the Furnace Creek Inn Restaurant. Between us we had one glass of (very good!) wine, a Coke, a shared FABULOUS crispy cactus (nopalito) appetizer, two generous entrees, and finally, we split a heavenly mango cheesecake, for about $85 plus tip. The service was great, the atmosphere no where near snobby in spite of the dress code: no grubby trail dirt, no shorts, no t-shirts. We went freshly showered and in neat, clean jeans, tucked in shirts, a little jewelry and make-up, and that met the dress code. We made our reservation only one day ahead, and the restaurant was distinctly not crowded, but I don’t know if you can count on that and it might be a good idea to reserve your table well in advance.", "helpfulness": 1, "user": "smackerel47", "date": "April 8, 2008", "id": 14888888}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This was our first trip to Death Valley and we were very impressed with this huge, undeveloped park. There’s more to do that we realized. Don’t miss Scotty’s Castle, even if fancy houses aren’t your thing. It’s so much a part of Death Valley history! There are lots of short, worthwhile hikes – walk around the top of Ubehebe Crater (near Scotty’s Castle) if you don’t have the wherewithal to walk to the bottom and back out – it’s spectacular. We didn’t have time to do any of the longer ones. I only wish we had had a high-clearance 4x4 vehicle, many of the most interesting places to go are not accessible to citified rental cars. (Speaking of cars, gas is very, very expensive, and don’t hold out for something cheaper – there are only three stations in the park, Stovepipe Wells was the cheapest, Panamint Springs was more than $5 for regular!)", "title": "Don't Stay Here!!", "helpfulness": 5, "user": "paulthirty", "date": "April 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 14856735, "likes": {"liked": "— leaving the hotel", "disliked": "— see the main review"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "My adult son and I stayed one night at the Furnace Creek Ranch. We found the room adequate. This was essentially a standard room but because there are few accommodations in Death Valley this was very overpriced. The Ranch does offer golf, swimming, horseback riding etc., but if one only wants a room in order to explore Death Valley it comes dear. It was clean however, with no smells. I believe that next time I will opt for Stovepipe Wells. I would suggest that one book rooms way in advance as options shrink as the temperature rises.", "title": "Last room available in March.", "user": "amaggiora", "date": "March 28, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 14607845, "likes": {"liked": "— The location", "disliked": "— Just too expensive for the average tourist"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We've made three trips to Furnance Creek Inn in Death Valley. The Inn has tons of historic appeal and lots of charm. The gardens are gorgeous and the pool can't be beat. When we've had enough Pacific NW cold and rain we head for the Furnance Crek Inn for some sun and relaxation. If you enjoy hiking, off roading, and exploring, Death Valley can't be beat. Get a guidebook, spend the morning exploring and the afternoon sacked out by the pool with a good book. Life just doesn't get much better!", "title": "One of our all time favorites!", "user": "Jann01", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14540379, "likes": {"liked": "— Fabulous location, lots of charm, great pool", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008", "text": "Stayed here for 1 night. Death valley is definitely worth it. The resort however is really extremely basic and quite pricey. However, the staff was friendly, the room was relatively clean and the location is just perfect.", "title": "OK - but very basic accomodation - no real alternatives", "user": "GAP15", "date": "March 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 14324999}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "From the rest of the reviews and this hotel's website you might get the idea this place is similar to a lodge like the Ahwahnee in Yosemite National Park. The only similarity is the room rate. We paid $300 plus and it's worth about half that.", "title": "Overrated and Overpriced", "helpfulness": 5, "user": "Chestfever", "date": "February 16, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 13605920, "likes": {"liked": "— The setting in a National Park", "disliked": "— The room and the restaurant."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The exterior has some interesting landscaping, palms and a creek and the pool is large and nice. But it's nothing special outside or inside. For starters our king room overlooking the oasis was tiny. We almost had to turn sideways to walk by the bed to get to the patio. The patio doors are old, junky metal that were a challenge to open. We heard neighboring guests complaining about them also.", "title": "Great place!", "helpfulness": 4, "user": "merlinthewizard", "date": "February 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 13573052, "likes": {"liked": "— The surroundings", "disliked": "— Rooms a bit basic"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "In Death Valley National Park this is a nice place to stay, we had a nice cabin, it was a little small and the shower room much smaller than the other national park cabins, especially seeing the coffee maker is in there too!", "title": "Furnace Creek Review", "user": "Lora21", "date": "May 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 16438418, "likes": {"liked": "— location", "disliked": "— small bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Although the room was ok it definately worth staying close to the action.", "title": "Basic but great pool", "user": "TOfamily269", "date": "May 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 16022993, "likes": {"liked": "— Pool", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Stayed for one night with my wife and 8 year old son.", "title": "Good for just passing through", "user": "AlexKaye", "date": "May 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 15946396, "likes": {"liked": "— Not much, was just passign through", "disliked": "— The coffee machine in the shower."}}, {"rating": 4.0, "title": "all ok here", "text": "Room was very basic and could use updating.", "helpfulness": 2, "user": "traumatizer", "date": "April 20, 2008", "id": 15164143}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "For a place in the middle of no wear it has a lot to offer.", "title": "OVERALL A GOOD EXPERIENCE", "helpfulness": 3, "user": "foolstar", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 15042816, "likes": {"liked": "— inside the park, store nearby,clean", "disliked": "— expensive"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This is our 3rd visit in 20 years. We stay in the Ranch, which is the larger, lower cost place. (The Inn is much pricier, and is closed in the hottest summer months).", "title": "Variable quality accommodation in brilliant location", "helpfulness": 3, "user": "Aztec_Tripper", "date": "June 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 16992591, "likes": {"liked": "— location", "disliked": "— staff approach"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "On the plus side, the location is virtually unique. The golf course, pool and other facilities are excellent. (The pool must surely be the hottest outdoor pool in the world.) Nice bar. The catering is just ok: very typical national park standards. The cabins are quite small. The next size up rooms (we had one of each) are decent size, but old and showing signs of wear. Ours wasn't particularly clean, and we captured a roach on the 3rd day. (However, it is very hard to eradicate this problem in a climate like this when food is kept in rooms.)", "title": "LOVED the pool", "helpfulness": 2, "user": "frenchiesonholiday", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16885874, "likes": {"liked": "— Single story building with a patio with sun lounger and chairs", "disliked": "— size of beds but only cos i like to spread out."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Disappointed with staff attitude over some things. There were no tennis racquets available to take advantage of the wonderful floodlit courts (all racquets were broken). Several machines unserviceable in laundry room, but not labelled up as such, so money and time wasted trying to use dead equipment. No recognition or refund offered by staff on being advised of this.", "title": "Not a good value for the money", "helpfulness": 1, "user": "PTCTravelbug", "date": "June 11, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 2.0, "rooms": 2.0}, "id": 16848010, "likes": {"liked": "— location", "disliked": "— Quality of rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Cleaning of rooms was just about adequate. This is quite an expensive place, but I think as visitors to this area, we have to recognise the extraordinary cost of supplying, staffing and cooling a place in such an extreme location. Also the impact that working regularly in such extreme heat must have on staff.", "title": "What a shame", "helpfulness": 4, "user": "DisneyMel", "date": "June 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 16691554, "likes": {"liked": "— Buffet at the restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Overall, I think this place is showing the result of lack of competition: management probably needs to do a little more to ensure that staff approach their customers with the same level of enthusiasm we have found in most of our travels in the US.", "title": "Oasis in the desert", "user": "domida", "date": "June 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16553995}, {"rating": 3.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "On putting together our trip to California and Nevada this was one location I was always looking forward to having got a taste for the desert at 29 Palms Inn 2 years ago. This time I was bringing my wife and 2 kids - 14 and 10 - in tow. After the hustle and bustle of LA, San Francisco and Las Vegas we were looking forward to just relaxing and chilling out for a while and in that respect it ought to score 5 stars as it achieved its objective. However, even now - months later ( my original review was put in the restaurant section ) - I'm still struggling to really understand where the Furnace Creek Inn sits.", "title": "The Inn - Best of Both Worlds........at a price !!", "helpfulness": 19, "user": "GWalker", "date": "October 31, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0}, "id": 6031394, "likes": {"liked": "— Quietness and views", "disliked": "— family room size and facilities were substandard for the price"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Lets make one thing absolutely clear. Value for money it most certainly isn't. This was at the tail end of our trip and therein perhaps lies the problem as we had become accustomed to a certain standard of family accomodation having stayed at the Georgian in Santa Monica, the Tuscan in San Francisco, and the Mirage in Las Vegas. This was the most expensive hotel on our trip and quite frankly the early impression by all 4 of us was that it was appalling value for money. In fact we were ready to walk out after seeing our room ( which was $330 per night direct with the hotel. Maybe there are cheaper deals? ). It was tiny, the \" air conditioning \" was in fact a rickety fan ( none of us slept as we sweated on top of our beds ) the plumbing was \" unusual \" to put it kindly, and we could hear every word being spoken in the room next door. At that point we honestly couldn't believe we had paid the money we had for THAT room! Quite frankly it was of motel standard.", "title": "Ranch OK", "helpfulness": 11, "user": "righteous", "date": "October 24, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 6007221, "likes": {"liked": "— Location", "disliked": "— Dirty"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "However, the next day we chilled by the pool and realised that perhaps there was maybe a little more to the hotel than just than the room. You ARE paying for that little bit of exclusivity and thus the hotel is relatively quiet and one gets to enjoy the atmosphere without too many noisy intrusions. The terrace outside the room they mention wasn't really quite what I expected being simply a shared walkway to all the rooms on that level.", "title": "Loved it so much we returned later in the trip", "helpfulness": 11, "user": "jessieleigh", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6007027, "likes": {"liked": "— Hotel pool, Wrangler Steakhouse", "disliked": "— that we had to leave?!"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Of far more fun if you have a family is going down to the sister resort Furnace Creek Ranch which is about a mile further down the road. Of course the Inn never told us there is in fact a courtesy mini bus on demand to take you to and from the Ranch as quite naturally they would wish you to use THEIR restuarant and not the 2 more informal resuarants at the Ranch. You can then get someone at the General Store, bar, or restuarants at the Ranch to arrange for to be picked up to return you to the Inn which was great. And made us feel special guests! So best of both worlds really.", "title": "Nothing special", "helpfulness": 12, "user": "JimandSuz", "date": "October 15, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 5959165}, {"rating": 4.0, "title": "Good", "text": "In summary, if you're coming here looking for a degree of solitude and peace and quiet you will probably love it but if as a family then really do be mindfull of the above. If you're looking for value for money you most certainly won't get it. The Inn sells itself as an historic 1920's hotel with character on check in - which as someone from the UK I didn't really buy at all. I felt it was just an excuse to cover up its short comings as we have far more historic hotels than that! Certainly with a family it was shockingly bad as the rooms are a joke for the price really but then you buy the quietness, the views, and the margaritas on the hotel terrace as the sun goes down. Other than that it is fairly ordinary if the truth be told.", "helpfulness": 2, "user": "heegmond", "date": "October 11, 2006", "id": 5942847}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We recently stayed for a night at the Furnace Creek Ranch and it was OK for what we needed. The check-in was efficient and the rooms were clean but fairly worn and out dated. The accommodation is really nothing more than a standard motel in need of a bit of investment.", "title": "Not a lot of choice", "helpfulness": 2, "user": "BillP001", "date": "April 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 14813437, "likes": {"liked": "— Location", "disliked": "— Worn furniture and poor quality upkeep of rooms"}}, {"rating": 1.0, "title": "Overrated and Overpriced - Do Not Stay If You Can", "text": "The rates for the room reflect the location and the fact there are very few alternatives, but you still know you are paying more than you should for what you get.", "helpfulness": 3, "user": "Traveller179", "date": "April 1, 2008", "id": 14723485}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The restaurant's on site leave a bit to be desired, food was mediocre and on the pricey side for the quality.", "title": "Felt like a movie star", "helpfulness": 1, "user": "EllenDelller", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14647114, "likes": {"liked": "— location in death vallley, beautiful building, thermal pool", "disliked": "— room was very small"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed in the Furnace Creek Ranch in July of this year for two nights on honeymoon. We wanted to experience death valley at its hottest and we certainly achieved that! The hotel was perfect for its purpose, a stopping off point on the way through. The room was small but adequate, clean and the air conditioning worked (very important). The food at the grill was excellent, some of the best we had on holiday, and although the pool was closed while we were there, we were able to use the other pool over at the Inn. The hotel grounds are interesting and we liked the way it was set into little houses rather than blocks of rooms. We didn't really see that many members of staff to experience the service, but certainly had no complaints. Death Valley was an incredible experience and Scotty's Castle fascinating, but we were glad when it was time to move on to Las Vegas.", "title": "Hot! Good hotel.", "helpfulness": 10, "user": "MrsBarno", "date": "October 9, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5933090, "likes": {"liked": "— Location", "disliked": "— Size of the room"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The Inn was closed, so we stayed at the ranch.", "title": "the only choice in summer", "helpfulness": 10, "user": "aleponti", "date": "October 8, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 5926921, "likes": {"liked": "— not clean"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The room was not very clean, the shower was dirty, with wet towels on the floor...maybe they forgot to clean the bathroom after the last tourist went away.", "title": "great", "helpfulness": 6, "user": "Cornishwoman", "date": "October 7, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5925567, "likes": {"liked": "— warm spring fed pool"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The staff didn't talk a lot, both at the front desk and at the restaurant.", "title": "Pefect for Death Valley!", "helpfulness": 17, "user": "kazz_usher", "date": "October 2, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5899120}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The position is excellent and the fact that it is almost a monopoly doesn't help to renovate rooms and ambient.", "title": "Great location!", "helpfulness": 5, "user": "suze65", "date": "October 1, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5897642, "likes": {"liked": "— Location", "disliked": "— Cost"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The Furnace Creek Ranch is quite an amazing piece of property. It's located in one of the most beautiful spots in the world with tons of things to do that appeal to both adults and children. The ranch itself has a wonderful swimming pool with toilet facilities and a dressing room, tennis courts, a basketball court (free rental of equipment if you forgot to bring them), an outdoor museum with stagecoaches and an old steam engine. The DV Visitors' Center is within walking distance. There is a good general store on the property where we purchased lunch food. If you remember you are in DV then the selection is good and we had yummy lunches everyday we were there. So, the bad news. The rooms are overpriced even for DV. They remind me of hotel rooms in the 60s. There is a lot of wear and tear on them. Our sliding door nearly came off the track, the locks were broken long ago and replaced with a hinge that stuck, the toilet flushed only when it wanted to, the tub was stopped up, and there is just about zero insulation to protect against noisy neighbors above you and beside you. Bring a noise machine or keep the fan on. Good points: refrigerator and strong water pressure and tons of very hot water and comfortable beds. That's why we keep coming back to the Furnace Creek Ranch. FYI: blankets are in the dresser drawer.", "title": "Keep expectations low and you'll enjoy it", "helpfulness": 7, "user": "difficult", "date": "January 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 12377992}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We came to the ranch as a stopover en route to Vegas.  We arrived in the searing heat so the option of the swimming pool was great.The rooms were pretty basic, but the air conditioning worked well enough to keep the room cool enough to sleep.  The bathroom was small, with the sink outside - strange but ok for a night.The main thing this facility had going for it was the bars and restaurants which offered great food and gave us something to do in the evening.We weren't really there long enough to say much more.Overall, not bad........", "title": "Great Facilities", "helpfulness": 2, "user": "igm", "date": "January 3, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 12305911}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We had two rooms at the Ranch property. Both bathrooms were exceptionally dirty, even after they had been \"cleaned\" by the housekeepers. Another problem was noise - from other rooms, the hallway, housekeeping knocking and shouting at 8 am.", "title": "very dirty bathrooms", "helpfulness": 3, "user": "Rosejoe", "date": "January 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 12185518}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The location is wonderful - right in the middle of the national park - but the price ($187 per room) far exceeds the quality. I would not stay there again because of the poor housekeeping.", "title": "The Ranch - I Loved It!", "helpfulness": 3, "user": "AJK4803", "date": "December 30, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 12083604, "likes": {"liked": "— The shower was good", "disliked": "— It was all good"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Having driven what seemed like a million miles to get there, and being slightly concerned having read the reviews, I loved this place!", "title": "Ranch has a holiday camp feel", "helpfulness": 5, "user": "BritBronco", "date": "December 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 11877640, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "Stayed at the Rach but would have prefered the Inn which was closed at the moment. This reminded me of a very upmarket Butlins holidaycamp. The rooms were set in long shed like buildings which looked like metal containers! Suprisingly inside the rooms were very nice. The y were comfortable and clean. I would not have liked to have visited this place in August when it is busting at the seams. There are two small restaurants and you cannot make a reservation. There is nothing for miles around so that have you really, if you arrive at a busy time for dining them you have to sit and wait. The cafe bar serves nice reasonably priced food. We found the Wrangler steakhouse a little pricey although our steak was probably the best we had the the whole of the USA. The waiter service was excellent. Breakfast was a buffett which we were terribly disappointed in. OK if you just wanted to eat some fruit or rtoast but foget the cooked stuff, it sits under lights for ages and the bacon goes rock hard and the scrambled eggs resemble polystyrene. It was approx $11 each for this and in other places on our trip we had fabulous breakfasts for half this amount. The pool was lovely, got very busy in late afternoon and probably not enough sunbeds for a busy time of year. An experience to visit this place and I am glad that I went but I wouldnt go back.", "title": "Like an upmarket holiday camp", "helpfulness": 10, "user": "EAStephens", "date": "September 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5889052, "likes": {"liked": "— The Pool", "disliked": "— Too large"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "We just spent a one night stopover here, and it was excellent for our purposes, no complaints whatsoever. As other reviews have said, the rooms are fairly basic, but perfectly ok and, most importantly, the air conditioning is good (even arriving at 8.00 pm on a late September evening the heat is quite breathtaking when you step out of your air conditioned vehicle). After fixing a flat tyre in 100 degree heat on the Titus Canyon dirt track we were more than ready for a cold pitcher of beer in the bar, then we had a good meal at the wrangler steakhouse, and didn't find it overpriced as some other reviewers have, considering the quality of food and overall dining experience that we had (but then we are from the UK, so it maybe depends on what you are used to!). Pool is nice, though we didn't use it, and there is quite a cool museum area with old trains, wagons etc. All in all, an excellent stopover location, highly recommended.", "title": "welcome oasis", "helpfulness": 11, "user": "nickya", "date": "September 28, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 3.0}, "id": 5885086}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "After reading the reviews we booked this with some trepedation. Firstly we were not sure about the wisdom about going to Death Valley in July and secondly the hotel.", "title": "Only mad dogs and englishmen go out in the midday sun.", "helpfulness": 14, "user": "Kiteperson", "date": "September 23, 2006", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5829610, "likes": {"liked": "— Clean and air conditioned", "disliked": "— Basics"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "As far as going to Death Valley was concerned a friend of ours in Vegas gave us great advise - be prepared - good car - good air conditioning - a cooler box and lots of fluids. He also told us we had to go because we were English and only mad dogs .....", "title": "Average accomodation at the Ranch", "helpfulness": 6, "user": "tannetts", "date": "September 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 5812056, "likes": {"liked": "— Location and 'feel' - quite pioneer in feel.", "disliked": "— price"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I have to say we were not disappointed. Death Valley is Beautiful but in July you don't goin walking when the sun is up. 127 degrees can kill you (and unfortunately did kill someone the previous week) if you are not sensible.", "title": "Okay, but nothing special", "helpfulness": 4, "user": "Jooolz", "date": "September 15, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 5803603, "likes": {"liked": "— Air conditioning", "disliked": "— Room decor"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Stayed three nights over Martlin Luther King weekend this year. Had 2 queen bed room (single story, near the enterance). Rooms were very dated, although it was nice having TV as an option. Definetly not the best hotel, the bathrooms required some repairs and the carpet/bedding was starting to show its age. The patios were nice, and the heat worked well. No hot water when we checked in, which was a pain.", "title": "Not great, but not a lot of options", "helpfulness": 2, "user": "mcoxpharmd", "date": "January 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 13080231}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The 49er Cafe and the Steakhouse were both great places to eat after a day of sightseeing. Had breakfast one morning at the Inn. Weren't as impressed as the food at the Cafe and Steakhouse at the Ranch.", "title": "Disappointing again.", "helpfulness": 11, "user": "JoanneLeicester", "date": "January 18, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 12770886, "likes": {"liked": "— Surrounding areas off site, amazing and beautiful.", "disliked": "— All of it, tired standard and poor value. 2 star accomodation at a push."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Although the hotel wasn't the greatest hotel, location is sort of hard to beat.", "title": "A decent value", "helpfulness": 1, "user": "BillfromMontreal", "date": "January 11, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12521625, "likes": {"liked": "— being inside Death Valley National Park", "disliked": "— small size of room"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We stayed here 3 years ago and decided to stay again simply because it's one of the only places to stay in Death Valley, we hoped it had been updated but sadly it hasn't. The area is beautiful and the facilities on site adequate (Steakhouse, Diner, Golf Bar and shop). You can play Tennis and swim in the natural spring water pool. The area itself is fantastic with lots to see and do including horse riding and ghost towns, museums etc.", "title": "Budget in DVNP", "helpfulness": 3, "user": "benny73", "date": "January 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 12485102}, {"rating": 4.0, "title": "Great Get Away for a Family", "text": "The rooms therefore are a big disappointment. They are in several blocks some single block with patio facing the pool/court or double floor facing the play area or other blocks. The rooms are in desperate need of a face lift! Decor is a tired Brown with peeling paper in places and fraying Brown patterned carpet. Furniture is old and Brown wood resembling something from the sixties. Our room had a broken screen door (which fell to the floor when I opened it) and a broken shower, I reported it and requested another room, at least expecting a free upgrade (rooms are all the same only some are closer to the amenities (more expensive though I would not be willing to pay as rooms still poor), we got another room a few doors down and no apology.", "helpfulness": 7, "user": "MomWithBoys", "date": "January 6, 2008", "id": 12396032}, {"rating": 4.0, "title": "Death Valley trip", "text": "We just spent two days at the Furnace Creek Ranch Resort in Death Valley, and had a wonderful time. Our room was spacious, clean and well kept. The food at the steakhouse and the cafe was good with excellent service and reasonably priced (considering you are in the middle of a desert). The weather was perfect and Death Valley was so very relaxing without large crowds, the quietness was wonderful. We toured most of the park and Scotty's Castle (well worth the time). Would love to go back again.", "helpfulness": 15, "user": "Hanfordmom", "date": "November 11, 2006", "id": 6107401}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed one night in Death Valley on our way from Las Vegas to Yosemite. I was there last year and stayed at the Stovepipe Wells Motel, which was not a very pleasant experience. Our cabin at Furnace Creek was better in every way and if they were there at least the cockroaches kept well out of sight!", "title": "Better than Stovepipe Wells Motel!", "helpfulness": 16, "user": "SPaPP", "date": "November 8, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 6085626, "likes": {"liked": "— Location", "disliked": "— Stay here rather than at Stovepipe Wells Motel"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We ate at the 49ers cafe onsite and enjoyed the food and the informal atmosphere.", "title": "Rustic, quaint but we loved it", "helpfulness": 10, "user": "Solobay", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6083106, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Death Valley is an incredible place. The natural beauty is amazing. We went up to Zabriskie Point for the sunset but were not blessed with a spectacular one. The sun sank behind the panamint Mountains and there was no lightshow to speak of. Nonetheless, the silence adn sense of peace was well worth the effort of being there. Not sure I would want to visit DV in high summer though. Even in October it was hot, although we actually had some rain while we were there.", "title": "Fawlty Towers in the desert", "helpfulness": 12, "user": "SW18", "date": "November 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 6082229, "likes": {"liked": "— The patio", "disliked": "— Rooms were cramped"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "A visit to Scotty's castle at the nothern end of the valley is a must.", "title": "Motel Style", "helpfulness": 12, "user": "frenchandparisian", "date": "November 2, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 6045384, "likes": {"liked": "— Cleanliness", "disliked": "— No view"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 120, "average": 500, "very good": 1121, "terrible": 45, "excellent": 557}, "aka": "Furnace Creek Inn And Ranch Hotel", "slim_ranking": 0.25, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}