{"user_rating": 4.5, "review_count": 32, "name": "Gakona Lodge & Trading Post", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Spent two nights in a cabin beside the river. Cabin is basic and comfortable, price of the cabin was not a bargain rate, but there are not many lodging options nearby. One night we took advantage of the cabin by cooking our own meal, which was quite nice (there is a supermarket 15 miles away in Glenallen). On site there is a bar (cozy & friendly), restaurant (rustic, with a basic menu). Complimentary breakfast was more than adequate.", "title": "Nice Alaskan cabin", "user": "tony838", "date": "June 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 165535473}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "On our Alaskan tour we ended up in Gakona and stayed in the old road house lodge. Our downstairs room was clean and spacious, although the ravages of time were there. It gave the room, the building character. The room had a bathroom, which was very neat. But was fairly comfy, we had a good nights rest in a historic building that seemed to live (squeecking wood, foodsteps of guest on stairways an first floor, bit noisy but not really disturbing. The Gakona Lodge just came out of the winter, restaurant was still closed (untill june). We had our breakfast in the entrance room of the lodge. Valerie took care of her guests. Enjoyed every minute of our stay.", "title": "Last of the real Alaskan roadhouses", "helpfulness": 1, "user": "megnick", "date": "June 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 163616356}, {"rating": 4.0, "title": "Deja vu all over again", "text": "Spent a night in one of the cabins and it was a very similar experience to when I was a kid staying in a cabin in northern Minnesota. Nothing fancy here but a good night's sleep and fresh muffins, scones, cereal, juice and coffee in the morning. The sound of the river rushing by behind the cabin lulled us to sleep. And when's the last time you got to stay in an historical site? Greg and his wife are very welcoming and if you are there in time for dinner you can taste some of her good cooking. A rustic experience.", "helpfulness": 1, "user": "ProfMercator", "date": "June 9, 2013", "id": 163513780}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed in a cabin here in September when travelling through Alaska. The cabin was fairly new and very clean and the hosts were very accommodating. There is also a restaurant on the premises that serves good food which was great.", "title": "Wonderful hospitality in Alaska back country", "helpfulness": 1, "user": "TJm0m0306", "date": "December 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 146551338}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This is a good spot to spend a night if you plan to go flight seeing over majestic St Elias mountains.", "title": "Good Accommodation and Restaurant", "helpfulness": 1, "user": "oliverAustralia", "date": "November 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144493135}], "location": {"country": "United States", "city": "Gakona"}, "variance": {"poor": 0, "average": 3, "very good": 9, "terrible": 0, "excellent": 20}, "slim_ranking": 1.0, "description": "This historic accommodation (National Register of Historic Places) is comprised of a well-maintained authentic lodge, cabins, tavern and restaurant, located at the confluence of Copper and Gakona Rivers. The lodge has nine rooms with two shared bathrooms, WI-FI and continental breakfast provided. We also offer three cabins, two of which have kitchens are very nice. All cabins with private bath. Located on Mile 2 of Tok Cutoff, 18 miles north of Glennallen."}