{"user_rating": 3.5, "review_count": 374, "name": "Gallery Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "My trip to singapore was quite a surprise, i had 2 days to plan it and so of course hotels i called were all booked. The Gallery Hotel was my first choice due to their website and at that time had no rooms available, so as adventurous as i usually i'm not, i figured since i was traveling alone i should just wing it and see what'll happen. so i was leaving from Bangkok that afternoon and called them one last time for a chance there was a cancellation and there was!, a deluxe room for about $180 including breakfast for only 2 nights, that's a bit steep for me but i figured i can splurge then find a cheap place for the last 2, staying for 4 nights. I arrived late and was given a smoking room eventhough i requested a nonsmoking but the receptionist called the hotel cleaning person to freshen up the room and i found it to not smell at all. the room was a great size with great design. it was stylish but still extremely functional. i did find it to be a bit damp but overall very comfortable. the breakfast was lovely and filling with a wide variety. the pool was also quite uniqe. Free internet! Well needless to say all of Singapore was booked i was not able to find another hotel and asked the Gallery Hotel's receptionist to please let me know if there's a cancellation and the morning of my check out day, i was told i can remain in my room for the last 2 nights for the same price. so i was saved from a possible nightmare of not having a place or staying at a seedy one. so thanks Gallery Hotel and your helpful staff.", "title": "gallery hotel to the rescue", "helpfulness": 2, "user": "nantendo", "date": "September 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8661561, "likes": {"liked": "— building design", "disliked": "— price"}}, {"rating": 1.0, "title": "Overated and Over Priced Hotel", "text": "Have just returned from 3 day stay in Gallery Hotel in Singapore and would rate it as an experience to be avoided at all cost.It is a poor ,faded imitation of a quality hotel with smoke smelly floors and obvious attempts to be architecturally sharp without the core requirements of adequate space, good fittings and the usual services you expect from a complete hotel ( is everything outsourced in this hotel??). On top of this they run some stupid chit system for breakfasts so that the outsourced kitchen makes a living and the customer still pays as if it is a proper hotel.Weird and very unpleasant ;like the owner has his hand in your pocket the whole time. We had 2 very tiny rooms for 3 days with 2 breakfasts and 1 initial evening meal that cost in total S$3,300. Don't use this place!", "helpfulness": 6, "user": "Recent_Visitor_7", "date": "July 15, 2007", "id": 8119361}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at this hotel in August 2005 for a couple of nights.", "title": "Great Pool but Overpriced", "helpfulness": 2, "user": "madhollywood", "date": "May 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7638173, "likes": {"liked": "— Pool", "disliked": "— Small Rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I was really intrigued after seeing photos of it on the internet and liked it's funky styling so thought we'd give it ago.", "title": "Vision not shared", "helpfulness": 4, "user": "ehberlin", "date": "April 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 7474421, "likes": {"liked": "— free internet access", "disliked": "— cleanliness"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Initially I hated it! The rooms are tiny and it's value for money is very low. We had stayed at the Merchant Court Hotel on a previous trip to Singapore and that was much more impressive, cheaper and in my opinion in a better location. It's also a bit too cool to provide good service.", "title": "Overrated", "helpfulness": 7, "user": "Natusik", "date": "February 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6811382, "likes": {"liked": "— Convenient enough location - we love to walk and you can take a pleasant riverside walk to centre of town, otherwise it's a taxi ride as public transport is not convenient. Free internet.", "disliked": "— Musty smell, small room size, two lifts to get to the room."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2005, traveled as a couple", "text": "Could not understand the idea behind integrating a control panel in the headrest of the bed which was hidden behind pilllows. Total lack of user-friendliness.", "title": "Very modern with trendy bars", "helpfulness": 5, "user": "lambo8", "date": "February 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 2.0, "cleanliness": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6746114, "likes": {"liked": "— riverside bar and cool music", "disliked": "— lack of attention to details"}}, {"rating": 2.0, "title": "Not worth it", "text": "Also, the need to change lifts on the 4th level is unnerving. As noted before, there are building sites around the hotel, but this can happen anywhere along the quays. Once this end of the quays has been finished, the location might be more attractive, now it's not close to anything that a visitor might want to see.", "helpfulness": 3, "user": "kateb1977", "date": "January 15, 2007", "id": 6597787}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We booked this hotel based on the Lonely Planet review which listed it in the Top range hotels section. Part of my disappointment came from this - it is not by any means a Top range. But for the price you pay (about GBP65 per night) it seems to be a good enough value for Singapore.", "title": "Style and Value, but Some Quirks", "helpfulness": 4, "user": "ObservantGuest", "date": "January 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 6596733, "likes": {"liked": "— Price was good for Singapore, and room was clean.", "disliked": "— Location, small bathroom,"}}, {"rating": 2.0, "title": "Does it really inspire?", "text": "We stayed here for 3 nights and although we booked a double room we were given a twin. We were informed we had to upgrade if we wanted a double (which we reluctantly did). What was more annoying was that the room was smaller even though it was advertised as being larger. For two people we really struggled with the limited space (not enough storage for cloths).", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4742365}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "To top it off the staff were really unhelpful, and suggested that as it is a boutique hotel, room size doesn't count. If the staff seemed interested in you we would have been happier, but no one here was willing to do anything out of the ordinary to help.", "title": "Great Service, Relaxing Room, Beautiful Pool", "helpfulness": 4, "user": "ntw516", "date": "March 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4724667}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Secondly, the room was in need a decorating. The shower curtain was mouldy, the carpet stained (incidentally the twin room we were orginially offered had a awful musty smell - this too was a reason for upgrading). The electrics (lights/aircon) were unpredictable.", "title": "Very Hip...? if you stay in an Executive Suite", "helpfulness": 3, "user": "Lisa J", "date": "January 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4388888}, {"rating": 2.0, "stay_parameters": "Stayed November 2005", "text": "Would I stay hear again? Most certainly not. There are far better hotels in the city. Would I recommend this hotel? No!", "title": "Style Over Substance", "helpfulness": 8, "user": "gh0z", "date": "December 6, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4164385}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "On a plus side, the bed was confortable, and the conceirge very helpful.", "title": "Great design, poor staff", "helpfulness": 8, "user": "gairlochloyal", "date": "November 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 4124518}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "A plus definitely had to the be the cool bars in the hotel, which attract a younger crowd. One opens out on to the river side and is a good place for a drink away from all the touristy places like boat quay. Having said that, there are several watering holes around the corner from the hotel if you fancy a change of scenery.", "title": "An Unique Hotel", "helpfulness": 3, "user": "Saranghae", "date": "January 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6571142, "likes": {"liked": "— the room", "disliked": "— the bed"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Overall, it was ok if you are looking for somewhere a bit quirky to stay in Singapore, but don't expect 4* comforts!", "title": "Arty but not comfortable", "helpfulness": 2, "user": "LeeCSingapore", "date": "September 27, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 1.0}, "id": 5882156, "likes": {"liked": "— Position", "disliked": "— Comfort, or lack of"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "My normal hotel was full due to the IMF conference so I found the Gallery on Expedia. It looked interesting and was in a part of singapore I have never stayed in before. Though once you are there it looks like it is a stage set or themed area in a big theme park. Getting there from the airport took over 40 minutes by taxi. The decor is very minimalist with lots of stone, marble, steel etc. To get to your room you have to take one lift to the fourth floor (where the resturant is) and then get another to the bedrom floor. On opening the bedroom door the first thing that struck me was the ingrained dirt around the keycard holder inside the room. The bedroom door also needed a good clean. The room was very stuffy and smelled musty, as did the corridors. I got the impression the carpets have never been cleaned. The room has a central control panel for the aircon, ligts, tv etc. This was not working and i had to call reception who sent up an engineer who took about 30 minutes to arrive. This later malfunctioned again at 1am and started switching the TV off and on at random. Also the aircon went off and I couldnt switch off the bedside lights. After a call to reception they sent someone up who couldn't fix it so offered to call out an engineer but i insisted they get me another room, which they did.", "title": "Trendy hotel that has lost its sheen", "helpfulness": 6, "user": "darkscot", "date": "September 15, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 5802788, "likes": {"liked": "— Free Internet", "disliked": "— Needed a good clean"}}, {"rating": 4.0, "title": "Good value option for business or leisure", "text": "I was on a business trip and so had reports to write. The rooms have free broadband connection which is a very nice and rare feature. I only wanted a sandwich to eat so i went to their cafe. They said their kitchen closed at 6pm but they could get me something from the upstairs resturant if I wanted. I said I would just go up their myself. I had to wait about five minutes to be seated as the only waitress was on the phone. The menu is a bit sparse and unimaginative but the tenderloin I had was very good. I only ate in the resturant on one of the three nights as there were private functions on Fri & Sat.", "helpfulness": 3, "user": "HKPhilE", "date": "July 13, 2006", "id": 5462782}, {"rating": 1.0, "title": "Worst hotel experience anywhere! Precious time wasted in return for frustration!", "text": "Overall the hotel is ok if you like that sort of thing, I have stayed in a lot worse but there are better hotels in Singapore for the same or not much more money. Very young and inexperienced staff.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 8, 2006", "id": 5041352}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stopped over in Singapore at the beginning of our honeymoon, and our travel agent recommended that we take the Singapore Airlines stopover package, and we picked the Gallery from the brochure of hotels we were given to select from. We picked the Gallery because it looked a bit different from your average hotel - both on the outside and in terms of some of the theme rooms (which weren't part of our package).", "title": "Nice location", "helpfulness": 1, "user": "ChilliCat16", "date": "January 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 12715942, "likes": {"liked": "— Nice toiletries!", "disliked": "— Twin beds attached to bedhead with stuck on bedside table between - tacky!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "When we arrived, we found it to be a nice enough hotel, but really, nothing special. We were warned by our travel agent that a double bed wasn't guaranteed, and that we might have to have twin beds - but we didn't anticipate that there would be no possible way of pushing the beds together, as they were attached to the bedhead, and with a bedside table in between - nice start to the honeymoon! We asked if we could move to a room that had a double bed since it was our honeymoon, but were not lucky enough to be upgraded like other lucky reviewers - we could only move on payment of an extra $75 per night. To be fair to the hotel, this was their policy, and it was really our travel agent who should have told us that there was NO possibility of a double bed!!", "title": "Excellent Hotel!", "helpfulness": 2, "user": "travelnow08", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12673568, "likes": {"liked": "— The room with views and the bathroom.", "disliked": "— rooms were quite small."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "There was nothing really wrong about the Gallery, but really, if you're in the cheaper rooms like we were, you're just in another hotel.", "title": "Clarke quay area", "helpfulness": 1, "user": "teelee", "date": "January 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12477963, "likes": {"liked": "— Clean with a view of the river", "disliked": "— too far to MRT station"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "It was great being near the Clark Quay area, an area I hadn't visited before.", "title": "Odd coloured Theme Room", "helpfulness": 3, "user": "Papi_UK", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 11053748, "likes": {"liked": "— Location", "disliked": "— Room Decor"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "I was upgraded to Glazzhaus room. Great views. Window seat, Queen bed, excellent bathroom. nice amenties. very quiet, super clean. great staff, good service.", "title": "Mordern hotel", "helpfulness": 3, "user": "meeke59", "date": "November 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10810939, "likes": {"liked": "— THe pool", "disliked": "— The new constructions happening next door. Not a nice view of partly built buildings"}}], "location": {"country": "Singapore", "continent": "Asia"}, "stars": 4, "variance": {"poor": 36, "average": 96, "very good": 166, "terrible": 28, "excellent": 48}, "aka": "Gallery Hotel Singapore", "slim_ranking": 0.454861111111, "description": "Trend setting Gallery Hotel has a total of 222 rooms and suites and 5 function rooms. Located at Robertson Quay which is part of the Singapore River, the hotel offers a variety of dining and drinking places like the all day dining Zenden Restaurant at the 4th level of the hotel, eM by the River and a slew of Japanese restaurants and a host of bistro pubs that will tickle your discerning taste buds. The accolade winning Gallery Hotel hosts a state of the art gym, an award-winning spa among many other business facilities. Guests to the hotel can enjoy wireless internet services in all areas of the hotel."}