{"user_rating": 4.5, "review_count": 1586, "name": "Galley Bay Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I treated my wife to a surprise Christmas present and we spent 3 weeks at Galley Bay.", "title": "It's laid back Antigua in style", "helpfulness": 2, "user": "RomanticsWales", "date": "February 9, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 24394618, "likes": {"liked": "— The Beach", "disliked": "— The Sun Beds"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "On arrival I wondered if I had made the right choice as we were not greeted in usual Caribbean style!", "title": "You get what you pay for", "helpfulness": 1, "user": "jan59Essex", "date": "February 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 24348520}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Instead in was a quich drink followed by the rules and off to the room.", "title": "Such a Shame", "helpfulness": 9, "user": "kjw09", "date": "February 3, 2009", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 24188967, "likes": {"liked": "— Location, Food Quality", "disliked": "— Everything else, ESPECIALLY the room value"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "The room looked a little tired but we quickly settled in and realised that infact it was what both my wife and I needed.", "title": "Lovely but room for improvement", "helpfulness": 7, "user": "Hamper_Nini", "date": "February 1, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 24073254}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We had one of the older Premium Beach front Suites (ground floor) which opened out onto the fabulous beach.", "title": "Liming at Galley Bay", "helpfulness": 6, "user": "sitch", "date": "January 31, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 24054313, "likes": {"liked": "— Everything", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We spent 8 days here 1st week in December. We started out in a beachfront cottage (Room 5) but were unhappy with it, notably a bad smell wafting from the gap at the side where the hotel watersports and boats were. The room was tired and had little space for our clothes. We spoke to the hotel general manager, Mr Foreman. He was fantastic and without hesitation transferred us to a lovely deluxe suite,saying he only wanted happy guests. From then on we were delighted with the hotel. The staff are amazing without exception. The management team are always in attendance (discretely), the restaurant and barstaff are cheerful and super efficient. We loved the relaxed atmosphere and the safe environment. The grounds are impeccable, the beach pristine, and the facilties excellent. The food in the Seagrape restaurant was a real surprise - thankfully no nasty DIY buffets and an excellent menu choice each meal. Dining in the Gaugin restaurant is very romantic but you have to make a reservation on the day you want to eat there(no extra charge) Premium wines and spirits are included (excellent) and as the bars were almost always very quiet there was plenty of time to enjoy the best rum punch in the Caribbean. No-one dresses up for dinner, smart casual is as formal as it gets. For us, no children about the place was a super bonus (been there - did that - kids now grown up!) We specially loved the absence of jetskis, hawkers and raucous noise (no piped \"muzak\" in the restaurants bars etc.) In short a really wonderful chillout in a really lovely place. Can't wait to go back. A big thank you to James and all his staff. Highly recommended.", "title": "Totally chilled", "helpfulness": 11, "user": "CoffeeBeanCardiff", "date": "January 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23385237, "likes": {"liked": "— Wonderful location and excellent service", "disliked": "— Room 5 - needs attention"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008", "text": "We spent 9 days at the hotel from 26th December (a family group of 12). In all we had a very pleasant and enjoyable stay at this quiet, relaxing and well run hotel. It is certainly 4 star, and with a few easy improvements could be even better.", "title": "A special place to spend New Year", "helpfulness": 4, "user": "pinkers12", "date": "January 6, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 23315566, "likes": {"liked": "— comfortable beds", "disliked": "— occasional noise from other rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Airport Arrival: With a number of planes arriving together, it took two hours to clear customs, queuing in a hot room. Be warned. Getting out was easier.", "title": "Back again", "helpfulness": 3, "user": "worldtravler65", "date": "January 2, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 23178249, "likes": {"liked": "— all", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Accommodation: We all stayed in Premium Beachfront apartments. These are large, well appointed, with very comfortable super-king beds. We were not unduly troubled by the noise of the sea at nights. I would certainly avoid the superior rooms, not least as they have no glass windows, and I would be dubious about the deluxe as well (they vary).", "title": "Outstanding spot for a relaxing getaway!", "helpfulness": 4, "user": "graymar6", "date": "January 1, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23162330, "likes": {"liked": "— They were right on the beach and very well appointed. Fabulous bathroom and king sized bed.", "disliked": "— Nothing........."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Beach: The beach is long but shallow, and at times the waves come right up the beach. The beach is great, lovely sand, wonderful waves to look at and play in, and the sea is a glorious and ever changing azure blue. And the water was warm. It is about 700 metres from the Gauguin at one end to Ismays at the other so there can be quite a lot of walking, but the buggy system works well. The last day was very rough due to the Volcano erupting in Montserrat.", "title": "Galley Bay delight", "helpfulness": 2, "user": "RSTaylors", "date": "January 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23155034, "likes": {"liked": "— Privacy and seclusion", "disliked": "— N/a"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My wife and I and another couple stayed eleven nights in February and had a perfect vacation. Since not much has been said about the Superior rooms on the beach I thought I would limit my review to those. We stayed in rooms 1 and 2 as no upgrades were available.", "title": "Perfect Paradise", "helpfulness": 5, "user": "millau70", "date": "March 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25458806}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I must say I was pleasantly surprised with the Superiors. The location is perfect next to the bar, pool, Seagrape, and guest services. Many of the other type suites are a long way from the bar, particularly those by the Gauguin which has no open bar during the day. What makes the location unusually good is the fact that there is zero noise at these facilities. There is no music, no group exercising, no DJ's: nothing but the sound of the sea. Even the sports center is absolutely quiet. The wonderful employees there are not allowed radios.", "title": "Will Smith(lookalike!) drives you through the grounds and says", "helpfulness": 5, "user": "debbienalan", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25344013}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The rooms are very nice. They are deliberately designed on the outside to resemble a local beach shack, but on the inside they are large and well appointed. I dare say that most people would erroneously believe them to be rundown based on their external appearance design. Each room has two lounges on the porch and two beach lounges on the sand. Inside the king size bed must have been brand new and was perfect. As a rare plus, different types of pillows were available. I detest big fat ones.", "title": "Relaxing, peaceful and beautiful", "helpfulness": 2, "user": "Mannafestfun", "date": "February 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 25028386}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The only issue, of course, is the sound of the sea so near at night. We four are all from beach regions so this was not significant to us. Of the four of us, I was the only one who wore foam earplugs; no one else was bothered with the sounds at all. Our friends never turned on their air conditioner; whereas I had mine on all the time. I just prefer the air a little drier when sleeping and it worked perfectly.", "title": "Great Location, Hotel and Staff", "helpfulness": 7, "user": "omni_pr", "date": "February 14, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 24554963, "likes": {"liked": "— the setting in the tropical garden"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Even though the menus don't change at the Gauguin and Ismay's, we preferred them. The quality and service were both fantastic. The beef, lamb, and pork were always perfect. The fish varied somewhat in excellence. The house sauvignon blanc and merlot were delicious. The romantic atmosphere of the Gauguin just blew us away and Ismay's is small and delightful. The Seagrape is somewhat plain in atmosphere, but the food is truly remarkable.", "title": "Tree frog heaven, cockroach hell.....", "helpfulness": 3, "user": "GibbsM", "date": "February 11, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 24482021, "likes": {"liked": "— The beach", "disliked": "— Noise from sea and tree frogs."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "We stayed in the a Premium suite which was wonderfull. The food at Galley Bay can not be faulted. I have always returned home from a holiday wanting a nice cup of tea or salad or a plate of veg. Not this time , we wanted for nothing. Top drinks with London Gin, Barcardi, Teachers Whisky. Even Champagne by the glass ( Moussec) . Yes we will go again.", "title": "Wonderful, relaxing in Paradise", "helpfulness": 4, "user": "The2Ladies", "date": "January 30, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24033859, "likes": {"liked": "— A comfotable bed.", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We booked Galley Bay through the reviews on this site and all in all we did have a wonderful and relaxing honeymoon...but, this place needs to make some changes for it to stay so highly rated and worthy of the high costs they charge. So let's start with the first major issue they seriously need to knock down the superior beach front rooms, I think they are numbered 1 - 10. We were in room No.7 I asked the lovely lady at reception I hope we have a nice suite available for us as it was our honeymoon, \"oh yes she replied, it's number 7, right on the beach, although some people complain that the sea is too noisy\" I had read some reviews of the noise from the beach on this site but as me and my wife both love the ocean we though these people were being a bit pedantic and I just smiled and said I'm sure it will be fine. Arriving at No. 7 my first impression was that this was a very basic room, everything was a bit dated a bit grubby, the bathroom was also dated and naff. I was upset that I had upgraded to this from a Gaugin cottage, but the setting on the beach was magical, even though the waves did look kind of rough! Though after a long flight we just wanted to unpack and chill out. Anyway the next two nights were horrendous, the sound of the crashing surf, which at times the water almost reached our back door, was like a jumbo jet taking off and was incessant! Both my wife and I hardly slept at all, even with my ipod on I could still hear the sea! There was no escape from it we felt like we had been on a ship in a storm for two days, even at the Sea Grape restaurant, your are right next to the crashing surf. I found out later that the sea was slightly rougher than normal as Montserrat had erupted a few day before, but even when the sea did 'calm' down the noise was still bad. So on the second day, I complained and at first we were told we had to pay £900 for the remaining seven days to upgrade to a beachfront suite and were not even offered a discount to upgrade from the normal rates, I refused, as I believed that the £5,000 I had paid already should have secured us accommodation of a reasonable quality! So eventually with my wife distraught and both of us prepared to pack our cases and leave, if they couldn't get us alternative accommodation, we had a meeting with the manager Mr Foreman, he was great and moved us for free to a ground floor premium suite with double glazing No. 77- it was heaven to close those doors and be able to have a peaceful nights sleep! Although the suite we upgraded to must have been three times the size of our original no.7 I still don't believe that it was worth the $1,200 a night rates they were charging. From reading other reviews and speaking to other guests they seem to have a lot of problems with these premium beach front rooms! Still on the negative is the mini bar issue, to only have it filled up once during your stay is pathetic, for what you pay this is just not on. If you want to take cocktails, beer etc back to your room you have to take the silliest little plastic cups. They really need to get larger plastic cups for taking away drinks from the bars. The beach is beautiful, but the sea was too rough, out of ten days, I managed to snorkel once and even then when I was diving down to the bottom I had to fight against the surge of the water to stay in one place. I had visions of strolling into calm, sparkling blue water...oh well never mind. The circumnavigation trip was good fun and the trip to Shirley heights was also a laugh. We were going to hire a car for a day but what we saw on the way to Shirley heights, of the roads and the towns we decided against it, it looked pretty shabby, for all the tourist dollars that come into this island, it certainly doesn't get spent on infrastructure. On the good points the food was great, never a bad meal. Service at times was slow but never too bad and besides, most days we had nowhere to go, so what's the hurry! The cocktails awesome and I thought the wine served was ok. Sitting on the rocking chairs in the early evening, drink in hand was awesome. The spa was nice, though pretty expensive. Also beware that you won't see the sunset at Galley Bay, as the headland to the left of the bay blocks it out, another thing I had been excited about but was disappointed, though we did see one sunset at Shirley Heights. Also be prepared for Antigua's airport, 2 hours of queuing at immigration, no air conditioning, you get the picture! I am baffled as to why so many people return here, I am glad I experienced it, but there are better places to go, with better value.", "title": "This place needs some changes...", "helpfulness": 14, "user": "Bomberlow", "date": "January 29, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 23995644, "likes": {"liked": "— The Food", "disliked": "— Our rooms, the rough sea and no free mini-bar!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Just spent a week here on honeymoon.", "title": "Great Setting, Average Service", "helpfulness": 4, "user": "larmarIreland", "date": "January 23, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 23821135, "likes": {"liked": "— Private pool", "disliked": "— Restaurant Service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "It's a wonderful setting, lovely beach, nice gardens, lake & grounds.", "title": "Still a Great Place", "helpfulness": 2, "user": "Avidhiker", "date": "January 19, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 23706849, "likes": {"liked": "— the beach, size of the room, and views", "disliked": "— consistancy of food preperation"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Had a gaugin cottage which we loved, ours was very private which helped, some of them looked a little bunched together.", "title": "Relaxation and Beauty Surrounds", "helpfulness": 4, "user": "HedoHP", "date": "January 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23620492, "likes": {"liked": "— Beautiful location, great service."}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 29, "average": 78, "very good": 268, "terrible": 24, "excellent": 1187}, "aka": "Galley Bay Hotel St. John`s", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}