{"user_rating": 3.5, "review_count": 293, "name": "Galveston Beach Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband planned a wonderful romantic getaway in Galveston and it was unforgettable. For someone who is normally not creative at all, he surprised me and bent over backwards to please me. I was very impressed. We stayed at the Holiday Inn Sunspree Resort (HISR). After much persistence we got reservations as they were completely booked. I read the reviews on this website which seemed mostly negative but we pressed on with an open mind. Mark was at the reservations desk and he was terrific! Seemed genuinely concerned about our having a pleasant stay. He even left a voice mail", "title": "Great Second Anniversary", "helpfulness": 1, "user": "aarrtt", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8470448, "likes": {"liked": "— The balcony and Gulf views.", "disliked": "— The hassle making a reservation."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "message on our phone about an hour after check-in making sure everything was to our satisfaction and if not to please call him and he'll rectify the problem. Everything in the room worked from the balcony door locks to the adequate shower pressure. The room was very clean with coffee pot, refrigerator, adequate lighting, 25\" TV and the usual bathroom toiletries. There was a posting that if one needed further toiletries like comb, toothpaste, toothbrush to call the front desk and it would be provided complimentary. I especially loved the black-out curtains and the very comfortable bed and thick pillows. The room is very well insulated too. I didn't hear the band until I opened the balcony door. We requested a high floor and got room 513, excellent location. The hotel is made whereby every room", "title": "Nice staff", "user": "sunlite191", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 8445053, "likes": {"liked": "— the view", "disliked": "— the A/C did not keep the room as cool as we would have liked"}}, {"rating": 3.0, "title": "Not bad, mixed review", "text": "has a balcony and is overlooking the Gulf. Upon leaving the room, you step out of the door onto an open breezeway covered in thatch that looks out onto the rear parking lot. Really has a Jamaican feel to it. They have gated parking, a fitness room and laundry room as well. They do only have one elevator but it wasn't a problem for us. Never experienced a too-long wait. But they do have a nice seating area by each one just in case. They have a live band that plays in the bar but in my opinion they were not that great and need a lesson in versatility. However, we went for a stroll along the seawall and by the time we made it back they were packing up to leave at about 10 p.m. Thereafter, there was no one around the pool area at all. The bar stays open til 2 a.m. but it was so quiet around there we thought it too was closed. We kept seeing a few people hanging out around there and James figured they were still open and they were. We stayed out on the balcony enjoying fruit, cheese, crackers, and", "helpfulness": 3, "user": "jxs62870", "date": "July 25, 2007", "id": 8233795}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "a great bottle of Brunello di Montalcino and Chianti Reserva Classico in anticipation of our vacation to Italy next month. It was so peaceful sitting there enjoying each other and the Gulf breeze while watching the activity along the seawall. We stayed out there til about midnight before turning in. The wine had taken it's toll. We slept like babies in a very peaceful surrounding. The hotel has an on-site restaurant but we didn't get to try it out. We made Saturday dinner reservations at Saltwater Grill. Wonderful restaurant! We made reservations Sunday for Champagne Brunch at Bernardo's in the historic Galvez Hotel. Not so wonderful. See my reviews for both restaurants posted on this website.", "title": "Will Not Ever Stay Here Again", "helpfulness": 5, "user": "bjgill17", "date": "June 19, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 7939225, "likes": {"liked": "— Cannot think of a thing", "disliked": "— Everything in my comments"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The only negatives were the heat from the A/C unit on the balcony and their reservations line. We had to be persistent. One time we called and were told they were all booked and there was a two-night minimum. We called back and got a reservation no problem for the one night.", "title": "Great Hotel", "helpfulness": 1, "user": "sarahseever", "date": "June 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7936114, "likes": {"liked": "— The ocean view", "disliked": "— Breakfast in the restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Just returned from a 4 day stay at the HI Sunspree Galveston. I have no downside to speak of. The hotel was very clean, the staff was great. Food at Kokomo's was fine, not a huge menu, salads, steaks, burgers, sandwitches, soups and seafood dishes. Wait staff was fine and the food was good with average prices. I will return to this hotel for sure. Nice pool and swim up bar at Capitan Jacks palapa bar on the property.", "title": "Zero complaints", "helpfulness": 1, "user": "treynolds37", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 10926540, "likes": {"liked": "— The staff was great, gated secure parking"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Was not sure to expect but our arrival was greeted by extremely friendly staff. Check in was a breeze and we were in our room in no time. Fabulous rooms - the view is great and with the glow of the pool at night it was perfect. The hotel was quiet over all when the balcony door closed you can not hear the Seawall traffic at all. The bed was comfy they gave you a whole set of pillows to choose from AND they will bring you more with out complaining! A lot of people complained on line about the hotel only having one elevator - that was not a problem at all don't let that scare you! The pool was fun and the beach right across the street! The staff also was constantly cleaning - it smelled so clean all the time! It is not a resort by Disney standards but it is a great hotel that you should not over look! Be sure to eat at Gaido's - breath taking food! Stay clear of the Dennys down the road - staff was terrible and served cold food and actually said \"my bad\"", "title": "Fantastic", "helpfulness": 2, "user": "trvl1Chicago", "date": "November 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10847020, "likes": {"liked": "— Every room directly faced the gulf"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We will be staying at this hotel again!", "title": "~beautiful place~friendly staff~relaxing pool~yummy breakfast~", "helpfulness": 1, "user": "maceysparents", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8500281, "likes": {"liked": "— Definitley the staff", "disliked": "— bar at rhe pool was slow. they were packed and did not have enough workers"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My 2 year old daughter and I in 1 room and my parents in another in which my step dad needed a handicpped accessable room had a fabulous weekend here. My parents handicapped room was great. Very easy for my step dad to shower and he was able to get around in the room comfortabley. The staff was amazing. Very polite and very helpful to my parents and to me lugging in and out of the hotel all you need to accomidate a 2 year old. The pool was clean and nice. The bar staff at the pool bar could have been a little faster but hey it is the summer and the hotel was 100% booked. The breakfast buffett was yummy and hot.", "title": "not the best three days......", "helpfulness": 1, "user": "238996", "date": "August 23, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 8488882, "likes": {"liked": "— the ocean view", "disliked": "— not clean..problems with the front desk.."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "All in all we will be happy to go back next summer or maybe even in December for all the nice Christmas cheer.", "title": "Terrible hotel for the money", "helpfulness": 1, "user": "sarakDallasTexas", "date": "August 22, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 8471637}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I checked in on Memorial Day weekend with the wife and kids and was immediately impressed with the welcome from the front desk staff. They treated us as if we were VIP guests at their home. When we got into our room, I was quite pleased with the cleanliness of the room and the great view of the ocean. I come to Galveston about 4-6 times a year and this was the first time to stay at the Holiday Inn Sunspree. I must say that from my prior experience with Galveston hotels, this one is the best. I will not stay anywhere else when traveling to Galveston. Everyone at this hotel, from the maids to the managers, are very friendly, personable, and most important when I travel on leisure, FUN! I travel almost 200 nights a year for business(going home is usually considered vacation) and I've got to give it to them at Holiday Inn SunSpree in Galveston, they know how to take care of their guests. That is exactly why this is my new home away from home.", "title": "My new home away from home", "user": "powertraveler1234", "date": "June 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7795492, "likes": {"liked": "— A no worry, no hassle getaway", "disliked": "— It rained one of the days that we were there"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We had problems from the moment we tried to check in, the clerk was new...then when we got to our room and unpacked everything, we discovered the door did not lock when you left the room. In other words, ANYONE could walk into our room unless we were in the room to deadbolt it. When we picked up our phone to call the front desk, we discovered the phone was not working either. We were told it would take a short while to fix it, but 2 hours later, it still wasn't, so we had to pack, move rooms, and then unpack again.", "title": "Not sure why it is called a resort.....", "helpfulness": 8, "user": "familyroadwarriors", "date": "May 7, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 7556233, "likes": {"liked": "— Great views, good band", "disliked": "— the crappy service, all the broken things"}}, {"rating": 4.0, "title": "We had a great time!", "text": "There were no towels at the poolside as we were told there were, which meant we had to freeze our butts off waiting for some in the lobby. The band did play quite loudly, but they stopped at exactly 10PM, so no complaints there.", "helpfulness": 2, "user": "bluevase", "date": "April 30, 2007", "id": 7484575}, {"rating": 1.0, "stay_parameters": "Stayed April 2007", "text": "A huge complaint though, we were awoken at 2PM from squealing and yelling down at the pool. A group of 4 drunken idiots were taking a late-night dip. We called the front desk, and asked why people were in the pool when all the signs posted stated that it closed at 10PM. The lady at the front desk stated that guests were welcome to swim as late as they wanted as long as they were quiet. Well, they weren't quiet. They kept us up until 3PM. Other guests were yelling at them to shut up from the balconies, but they never did.", "title": "Horrible room in need of major repair", "helpfulness": 14, "user": "bagsRpacked92", "date": "April 30, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 7484265, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel is far from a resort. If this was just another holiday inn, it would meet my expectations. Resort? Not even.", "title": "Never again will we stay here!!!", "helpfulness": 10, "user": "Reeroe", "date": "April 22, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 7416252, "likes": {"liked": "— The little Kbana outside the hotel", "disliked": "— everything inside the hotel"}}, {"rating": 1.0, "title": "Noisy hotel = not pleasant", "text": "I stayed at this hotel for one night in February 2007 and will never stay again. The atmosphere is pleasant enough, it's an okay hotel, not fabulous but not terrible either. What WAS horrible was the live music in the cabana beside the pool. When we checked in there was no mention made that there would be live music and it continued on well past midnight. Switching rooms would have been no help, since they all face the pool and the cabana. I made a few calls down to the front desk and after some haggling they did take a small amount off my bill. I've never stayed in a loud hotel so this was definitely a first, and hopefully a last. Stay here only if you don't mind a rock concert outside your window.", "helpfulness": 10, "user": "cherriesjubee", "date": "April 17, 2007", "id": 7380673}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We just returned from a four night \"get away\" stay at the Holiday Inn Sunspree Resort in Galveston. While it is a stretch to say it is a \"resort\", we had a very pleasant experience there. It was a good value for the money. The view of the Gulf from our balcony was great and the sea wall is a wonderful place to walk along the beach. The pool looked very nice although it was too cool to swim. Food in the hotel resaurant was very good and reasonalbly priced. Being off season it was not crowded and we never had to wait longer than a minute for the one elevator. We would stay there again.", "title": "Great stay.", "helpfulness": 4, "user": "jwelhwel", "date": "January 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6596363, "likes": {"liked": "— the location on the Gulf of Mexico", "disliked": "— one unfriendly desk clerk"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Do be aware that the area directly behind the hotel is not the best neighborhood in the city and I would not recommend walking there at night.", "title": "Disappointing", "helpfulness": 8, "user": "HUSKERTRAVELER", "date": "January 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 6556482, "likes": {"liked": "— oceanfront rooms", "disliked": "— poor restaurant service"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The property itself is rather lovely. The pool and pool bar area look very nice, unfortunately it was too cold for us to try it out in Dec. A hot tub would have made our stay better. The first room we were given did not have a very nice view. All we could see was the thatched roof of the gift shop and game room and a lot of power lines. Definetly not what I would call oceanview. We requested another room and were given a room over the pool, much better. ( Make sure you request a room number ending in 15 to 20 for the best view ) The decor was nice.", "title": "Not Bad", "helpfulness": 1, "user": "lilskibearsmommy", "date": "December 31, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6525995}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "On the downside, the deadbolts on our front door and balcony door did not work which made us feel rather unsafe. The balcony has a very annoying bright light on it. We had to unscrew the bulb so we could enjoy the view of the sea at night.", "title": "Great vacation", "helpfulness": 2, "user": "RJoan", "date": "November 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6045666, "likes": {"liked": "— Pool, room with view, staff.", "disliked": "— Lack of public access to internet and lack of info on area."}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 45, "average": 67, "very good": 68, "terrible": 38, "excellent": 75}, "aka": "Holiday Inn Sunspree Resort Galveston Beach Hotel", "slim_ranking": 0.551020408163, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "Just steps from the Gulf of Mexico, Galveston Beach Hotel, Galveston's newest beachfront boutique hotel, is located on the Seawall near the Pleasure Pier and East Beach, our property is the perfect escape from the daily grind. Only 200ft from the sandy beach, you are sure to enjoy Captain Jacks Beach Bar, this large palapa-style bar is famous in Galveston and is a favorite of locals and tourists alike. Jacks offers great views of the Gulf of Mexico from 2 sun decks and a dozen ocean view tables. Captain Jacks also offers a full menu with island favorites such as, fresh fish tacos, char grilled burgers and fresh cut fries. Visit Jacks during the summer months for live entertainment from local artists on our own elevated band stage! Free Wi-Fi, a flat screen TV and a mini-refrigerator are featured in all of the temperature-controlled rooms at Galveston Beach Hotel. Most rooms offer fantastic panoramic views of the Gulf of Mexico and public beaches. Our on-site restaurant offers a full breakfast menu to start your day off right. Just minutes from the cruise terminal our property offers great cruise packages including parking and shuttle transportation. Whether you are going to the beach, on a cruise or in Galveston on business, you are sure to have a comfortable stay with memories that last a lifetime. Our property offers; bunk bed suites, private balconies, a magnificent free form pool with a swim up bar and waterfall, a family friendly restaurant, room service, a full gift shop and arcade! You can truly kick off your shoes and relax at the Galveston Beach Hotel."}