{"user_rating": 3.5, "review_count": 92, "name": "Garden Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "just got back from the garden hotel. dont book anywhere else. all the rooms have just been refurbished to a very high standard. we had booked a double room, the day we arrived we met a friend who was visiting viareggio for the day. she liked it so much she wanted to stay over with us. we went to check in and asked it it possible to put a bed in our room. even though they were very busy and booked up they had another bed in the room made up, all within twenty mins. how that for servise. i have stayed at the president on the main street, which is a lot more exspensive, and not a patch on the garden. all the staff very friendly.. we didnt eat in the resteraunt but we spoke to people who said it was very good. the breakfast is the usual cheese meat bread and cake. just one tiny fault they didnt have a toaster. but thats minor. try and go in feb for the carnival its a awsome experience.", "title": "lovley hotel", "user": "evalinka", "date": "February 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25252663}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "When we arrived at this little hotel we were sceptical as our room wasnt ready and this didn't seem like a very good start.", "title": "noisy but nice", "helpfulness": 5, "user": "leatherjacket", "date": "November 3, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6051699, "likes": {"liked": "— small and friendly", "disliked": "— traffic noise all day and most of the night"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "However this wasn't an omen. This is a really nice little hotel although i did find the head waiter a little scary although he was freindly. We were in a room right at the front of the hotel and i got the balcony i wanted but at a price because for me the noise of the traffic was just to much. But if traffic noise dosen't bother you then this is a perfect little hotel to stay at as it is very near the centre. I must just add that the food was absolutely wonderful.", "title": "The Garden, Viareggio", "helpfulness": 2, "user": "JonathanH", "date": "September 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5831642, "likes": {"liked": "— Location", "disliked": "— Meal Options"}}, {"rating": 4.0, "title": "great family run hotel", "text": "A nice family run hotel just one block away from the beach (inc a beach discount card but you must ask for it, like everything there). A very simple small double au-suite room with TV, one draw, bar fridge and a wardrobe, just about enough for the 6 days we were there for but could have done with more draw space. The waiters were very nice and helpful but I can't say that for the managers - we wanted to use the reception phone to quickly call the rep to arrange a meeting time and they told us that we had to use the phone in the room. We asked about places to go, even though they weren't busy they seemed uninterested in helping us out. No room service to speak of. They had a large roof terrace (we were expecting a lovely decorated Italian terrace) which consisted of plastic chairs and some tables, but it had a good view of the mountains in the distance. We had one night of loud Italians until 2am but one call to the night manager and we didn't have any further problems. He was great and could speak English plus gave a us maps and told us about some of the near by towns to visit and how to get there. We went half board - Breakfast was very good, cereals, Melba toast, jams, and croissants, coffee and hot chocolate . Had dinner twice as there was little choice on set menu, so we chose to eat out were the food was soooo much better! Shame. If you wanted somewhere cheap or as a base I would recommend The Garden but if you wanted to be waited on hand and foot spend the extra £200 odd and go to the Grand.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "November 1, 2005", "id": 4078767}], "location": {"country": "Italy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 27, "very good": 45, "terrible": 2, "excellent": 10}, "aka": "Garden Hotel Province Of Catania, Sicily, Italy", "slim_ranking": 1.0}