{"user_rating": 4.5, "review_count": 48, "name": "Gateway Motel", "reviews": [{"rating": 4.0, "title": "Clean, comfortable, European-style rooms -- Lovely!", "text": "Recently stayed at this motel (stayed here also in 2005), and the motel is super-clean, the rooms are large and attractive, and the customer service is great. The motel is so quaint and pretty -- very much like a Swiss-style hotel with lots of wood trim, and gorgeous balcony flowers. Beds are comfortable with reading lights directly above, and the bathrooms are new and spotless. The motel is very close to the hot springs pool. We would definitely recommend this motel -- reasonably-priced, family-oriented, clean, modern, restful -- what more could a traveller want!", "user": "WBinBC", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8252886, "likes": {"liked": "— Clean, modern, quiet", "disliked": "— No internet connection"}}], "location": {"country": "Canada"}, "variance": {"poor": 0, "average": 1, "very good": 15, "terrible": 1, "excellent": 31}, "slim_ranking": 0.304347826087, "description": "The Gateway Motel has been owned and operated by the Weder Family since 1995. This small 15 unit motel is run with a traditional Swiss charm and atmosphere. It is set in the picturesque town of Radium Hot Springs where the flowers and the scenery are as plentiful as the big horn sheep that call it home. The Gateway Motel is located on Highway 93, just a short 5 minutes from the entrance of Kootenay National Park and it's world famous Natural Hot Springs. With spectacular mountain views overlooking the Columbia Valley, an afternoon can easily slip away relaxing in the afternoon sun. We take pride in providing reasonably priced accomodation, exceptionally clean rooms and superior guest service in English and German. So, why not spend some time in Radium Hot Springs and discover why we love to call this place home."}