{"user_rating": 4.0, "review_count": 335, "name": "Gateway Marco Polo Hotels", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My family and I just had our vacation in Marco Polo Gateway in Tsim Sha Tsui last Dec. 15 to 19. The hotel is currently under renovation which is needed because the rooms are very old already. The service of the hotel is very good. We had requested the housekeeping things e.g. bottled waters, newspapers, utensils, etc. and they acted very fast to our requests. The location of the hotel is both good and bad. It is connected to a big mall so you can go shopping right away. There are also many good restaurants nearby e.g. Chuk Yuen, Macau restaurant, Ippudo Ramen and two food courts in Silvercord Mall across the hotel and another one inside the big mall beside City Super supermarket. Overall if not for the location of the MTR which I feel is just too far, I will stay in this hotel again even if the hotel has not finished renovating yet..", "title": "OLD HOTEL but GOOD SERVICE", "helpfulness": 1, "user": "winston a", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 122252953}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The location is superb, minutes from MTR, star ferry and within the large Harbour shopping mall. Great places nearby to eat also. Hotel is good, they were doing some maintenance on it when we were there (nov 2011) so was a bit noisy at times but never before 9 Am or in evenings, and this was announced on their home page. We had a Continental club room which we'd recommend as in the lounge you can then get complimentary drinks, good snacks & food, and wifi. Only downside is you cannot open windows, as in many high rises, and no wifi in room. Staff were extremely pleasant and helpful as far as bookings and recommendations.", "title": "Great location, very helpful staff and service", "user": "Spanishkathryn", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121123017}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This is a hotel my family and I would love to go back to. Excellent staff, excellent location. At the moment though, the noise from the renovations can be unnerving, especially if one wants to rest after hours of going around the city. The staff however did warn us about this. We hope that repair works would be completed soon.", "title": "Love the place, except for the renovation noise", "helpfulness": 1, "user": "onebell", "date": "November 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120490872}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "I just came bk from our 2 nights stay there .", "title": "It will be perfect if they hv finished renovating the hotel", "helpfulness": 2, "user": "Pigeon9999", "date": "November 10, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 120415179}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Pros", "title": "Great value and location", "user": "lilacstranger", "date": "November 9, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 120370760}, {"rating": 4.0, "title": "Terrific Location!", "text": "Stayed for 6 nights at the Gateway. Great hotel in a terrific location right in the centre of Harbour City Shopping Centre and in the heart of restaurants/shops. You can walk to the Star Ferry Pier to catch ferries to Macau etc and you can walk almost anywhere you wish to go.", "user": "tarynsmum", "date": "February 26, 2012", "id": 125259314}, {"rating": 5.0, "title": "Go for the continent club rooms", "text": "In the midst of renovations so bit of banging during the day, but we were hardly in the room during the day. Reasonably priced hotel, got a great deal through Qantas Holidays. Nice and clean and courteous staff. Definitely stay here again.", "user": "Rnplus2", "date": "February 18, 2012", "id": 124784059}, {"rating": 4.0, "title": "Good hotel for first time visitors to Hong Kong", "text": "We chose to stay at the club floor. A bit more pricey than the usual floors but rooms are new, breakfast included and the best part of it... Free cocktails from 5-8 pm at the club floor lounge! Peaceful, and great for business meetings. They now accept small kids in this floor. Used to be for adults only. Kids up to 11 years eat breakfast for free too.", "user": "TonyHyndman", "date": "February 11, 2012", "id": 124421459}, {"rating": 4.0, "title": "nice hotel but quite expensive during peak season", "text": "My family and i stayed here from Jan. 27-29, 2012. This hotel is very ideal for first time visitors as it is conveniently located within Harbour City (one big mall) along Canton Road in Tsim Sha Tsui. This hotel is in the middle of two other Marco Polo Hotels; The Marco Polo Hong Kong (closer to the Star Ferry but more expensive) and Marco Polo Prince (similar price range to the Gateway but located at the other end of Harbour City. All the high end stores can be located here and close to the public bus terminal, MTR and Star Ferry. The weather was cold which is just the way we wanted. But i would avoid going to Hong Kong during the Chinese New Year if you plan to go to Disneyland, Ocean Park or other attractions as there are so many people and you will just waste your time lining up for the rides/shows. The newly renovated room was spacious with two double beds but no view though. There are a lot of elevators but does not provide key access for that added level of security and you still have to use a real key to access the rooms (this should have been part of their renovation works). This hotel is a bit expensive but worth it as you are within walking distance to almost everything. The continental club lounge provides an extra level of convenience/privacy. There is free wifi as well as computer terminals. Their breakfast buffet is just as similar as the buffet in their restaurant at the basement. Plus, you can avail of drinks all day and they offer finger foods in the afternoon.", "user": "Solotraveller888", "date": "January 21, 2012", "id": 123398995}, {"rating": 3.0, "title": "Good value for money", "text": "For those who want convenience and do not mind paying a little more, you will definitely not go wrong with this hotel. I would definitely advise travelers, especially first time visitors to Hong Kong, to try this hotel.", "user": "MafaldaPortugal", "date": "January 13, 2012", "id": 123024206}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed at the Gateway Hong Kong just before Christmas and loved every minute of our stay there. My husband booked us into a room on the 15th floor (The Continental Club) which didnt cost a lot more than a standard room. The service was impeccable, the staff were very friendly and helpful and treated us like royalty. The rooms were clean and spacious. The buffet breakfast was delicious and plentiful and of a high quality. The Continental Club also offered afternoon tea from 2.30-5.00pm and the food again was delicious and plentiful and I always made sure we were back at the hotel for this special treat that I definitely did not want to miss out on. They also served supper from ?5.30 till 8pm not exactly sure about those times, but again unreal food and plentiful. We hardly ate out at all because the food they served was always enough to fill us up. It was finger food but had variety and enough different dishes to satisfy. Even our fussy daughters were willing to try foods they have never eaten before because they looked so good. The hotel was also close to shops and the harbour if you want to go and see the nightly light show. I would definitely stay here again.", "title": "You wont be disappointed", "helpfulness": 1, "user": "Diamonds47", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122859933}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Very conveniently located but rooms quite old already. Though it seems they are improving it already since our rooms are so noisy as we can hear the sounds of construction during day time. Although our room was not available when we were reach the hotel, they upgrade our regular room to suite, so this compensates for the 3pm check in and the noise in their renovation.", "title": "Good location", "helpfulness": 1, "user": "fivethreezero", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122600243}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Good thing about the location is it is located right in the middle of the shopping mall, so while we waited for our rooms to be availalbe, we got to eat first and go the supermarket right to get some water and buy some snacks for the kids.", "title": "A Dream Come True", "user": "Tony P", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122575790}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Their room is quite big as compare to other hotels in Hongkong. All staff are very friendly and helpful.", "title": "A very excellent location and good service of gateway hotel in hongkong", "user": "maria bella yol... a", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122492840}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "This year I realised a dream I had harboured for over 35 years. Thanks to my wife having to go there on a business trip I was able to share the experience.", "title": "Everything was perfect!!!", "user": "princesslorraine", "date": "January 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122441394}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Couldn't fault much here apart for the awful view from the room. No chance of a harbour view.", "title": "Great value and location", "user": "lilacstranger", "date": "November 7, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 120262286}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I stayed in Hotel Gateway at Harbor Mall in HongKong for the second time. It’s got a great location and situation amidst beautiful malls / shops. It’s a hotel whose location is ideal both for business-executives and families on holiday. The other thing that stands out in the hotel is its staff who are oozing warmth and gracefulness. I thing that amazes me about the staff that I did not come across anyone who was not wearing a smile. They are always ready to help and take care of your implicit needs.", "title": "Great Staff, Great Location but food needs improvement..", "helpfulness": 1, "user": "DebuDeb", "date": "October 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119351211}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "When I reached the hotel in the limo, the whole experience was so warm. The driver was polite and making sure that I was comfortable after a long flight. On reaching the hotel there was a lady by the name Ada waiting to accost me. She not only ushered me to the hotel but also made sure I had a room thought I had much before the specified check-in time. My check-in process was facilitated by a gentleman by the name King. He too was so warm and making sure that my check-in process was smooth and warm. He took me to the room and checked with me a couple of times to find that if I was comfortable.", "title": "Good, but could be better", "user": "capitalHB", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119275604}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Beyond all these the staff in concierge, housekeeping, coffeshop are all great. You ask something and get responded in minutes.", "title": "Great location", "user": "PaulDev", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 119273557}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "One thing this hotel has got it right is great systems and processes. Clearly, the staff have been effectively trained which gives great confidence.", "title": "Great location, rooms a bit old and no wifi anywhere in the hotel", "user": "Derek05", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119214240}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 15, "average": 57, "very good": 148, "terrible": 3, "excellent": 112}, "aka": "Gateway,Hong Kong Hotel", "slim_ranking": 0.103074141049, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Rising over Hong Kong's commercial and entertainment district of Kowloon is the Gateway, a Marco Polo hotel. Housed in Harbour City – Hong Kong's largest shopping complex – Gateway hotel the ultimate in leisure accommodation and shopping experience.Gateway hotel provides the ideal balance of space, comfort and warm Asian hospitality in all its 397 guestrooms and suites. Guests of The Continental Club can enjoy full access and exclusive benefits from the Club Lounge, to include complimentary daily breakfast, afternoon refreshments and evening cocktails, butler service and free Wi-Fi Internet service.The cosmopolitan spirit of Hong Kong is celebrated in Coffee Mill - it features a tempting spread of fresh seafood to go with extravagant lunch and dinner buffets, as well as an international a la carte menu at any time of the day."}