{"user_rating": 4.0, "review_count": 320, "name": "Gatwick Little Foxes Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Clean and friendly small hotel. Put out a lovely little travel cot for our baby with clean sheets and blankets. Found a car seat for the baby for the transfers. We had no problems at any stage. The transfer minibus driver was very friendly and really looked after us. Staff even helped me to heat a bottle for our baby at the end of the break. I would thoroughly recommend as a good, relaible, safe and excellent value for money option. Have made personal recommendations already.", "title": "Friendly and helpful, went out of their way to look after us", "user": "jen78Dorset", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 69938479}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I know it's pretty basic, the beds are hard, the foods not great BUT don't forget how cheap it is. Given the cost of Gatwick parking the bed and breakfast is thrown in free!", "title": "Great value", "helpfulness": 1, "user": "exeman", "date": "June 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 69048588}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "I would howver advise against eating at the Ifield Court as they suggest. Poor quality food and value.", "title": "Take your own pillows and don't forget your ear plugs & car cleaning kit!", "user": "OneHappyChicken", "date": "June 14, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 67515593}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "have left it a few weeks to write this review because I wanted to make sure I didn't write anything out of anger or frustration and wanted to make sure this was a measured review.", "title": "Clean, tidy and value for money , but don't take children!", "helpfulness": 2, "user": "Jonaline106", "date": "June 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 66979519}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The reason we chose to stay at this hotel is its close proximity to the airport and also the relative cheap cost in leaving the car there while we went on holiday. The added bonus being the transfer to and from the hotel to the airport.", "title": "Look elsewhere for accomodation, your car will not be given the care you expect.", "user": "S_Wales_Honest_John", "date": "June 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 66445725}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here before flying from Gatwick quite early in the morning.", "title": "Good Value..", "user": "Twink38", "date": "August 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 75673791}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We arrived quite late (due to our fault) but were given very good directions by the receptionist late on a Sunday night, but we just failed to follow them properly!! We were shown through to our room, which was quite basic but clean - the bathroom was spotless and the shower was so powerful it almost took my head off - but was lovely!!", "title": "They lost the car! Fly from Gatwick regularly - will not stay here again!", "user": "anigati", "date": "August 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 74809104}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "The breakfast was also really nice and the taxi service to the airport was faultless and very quick. The return journey was just the same.", "title": "Good value for money!", "user": "Andy_UKLondon", "date": "July 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 71780740}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed in the Bluebell room. My only negative comment is that perhaps the carpet could do with a bit of a clean. Other than that, it was good value for money and we would definitely stay here again.", "title": "Good location basic facilities but clean", "user": "chrispennar", "date": "July 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 71317192}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Warm welcome. Good price. BUT very basic rooms with paper thin walls. Travelled with parents who came home before us. They arrived at Little Foxes by courtesy bus (very good service) to find their car MISSING! their car keys MISSING! Nobody knew anything despite the fact they were expecting them back. Cant imagine how stressed they were after 30 mins the car was finally located somebody had moved it to the sister hotel and not told anybody! My father wrote to complain and received no reply until the second attempt (they think first letter lost in post...) No compensation offered for this major blunder! Not what you need after a day of travelling!", "title": "Efficient and good value", "user": "PinkmoonNottingam", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70491738}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I booked this hotel through a site specifically for hotels with parking near Gatwick and was aware it wasn't the most luxurious place in the world from the pictures and the reviews on here.", "title": "Slightly outdated but decent for a night's stay", "user": "kathrynjc", "date": "October 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 81737768}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Essentially, it is a decent enough hotel for a night's stay and £89 with a week of parking is pretty good too. The room was a bit outdated, particularly the bathroom, but the receptionist was exceedingly helpful and explained how everything worked thoroughly. We had the buffet breakfast in the morning which was not terribly varied but good enough to prepare us for our flight. We had no problems with noise at all.", "title": "Go at your Peril", "user": "wooziesoozie", "date": "September 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 81368310}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Two things I would warn people of: 1) the shuttle bus service has now stopped so the hotel has an arrangement with a local cab firm. A single journey to or from Gatwich is £10. It was an average journey on the way there but when we came back the cab was there very quickly and the service was excellent. 2) You are required to leave your car keys with the hotel as you park in the normal hotel car park and they then move your car to the long-stay part while you're away. This wasn't a problem for us but might be for some - just remember to seperate the car from the house keys!", "title": "Fantastic little place - 5th stay in as many years", "user": "as2007", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80396880}, {"rating": 3.0, "title": "Nice Place", "text": "Took ages to sign in as the lady was very slow. Room and en suite were basic and clean. Had dinner at the nearby Ifield hotel which was ok but nothing to write home about. Only stayed the one night but left the car there for 14 nights. However on our return from holiday we found that our car had been damaged in the hotel car park, the owner of the hotel when challenged merely pointed to sign near the entrance saying cars and belongings left at owners risk. He said they did not check the cars before putting them in the back car park as it would cost to much and that is why their rates were low. It turned out to be far more expensive for us. Never Again!", "user": "Paulsmd", "date": "September 20, 2010", "id": 80326469}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This is the 5th time we have stayed there in as many years and still cannot complain or fault any aspect of the hotel. Each stay, we have had a different room to the last, and they are perfect. You dont get any noise from the planes taking off/landing unless you are standing outside the reception (smoking area or waiting for transfer to airport). The food is great, and very varied. We had a later flight this year than normal, so meant hanging around the hotel till early afternoon. We were made welcome in the family lounge and left to watch whatever we wanted to on the TV, with the maids even making us trays of tea and coffee all the time!", "title": "Under no circumstances stay in the annex/stables", "user": "garrymayberry", "date": "September 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 79347905}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We paid £124 for an overnight stay in a family room with 2 weeks car parking. We had expected to arrive at the hotel at about 9pm, but due to various delays along the way (road closed due to accident, Friday evening traffic on the M25, roadworks & a longer than expected queue at the day before check in at Gatwick, we ended up arriving at about 10.20pm.", "title": "OK hotel, but don't incur the wrath of Geraldine by being late arriving!", "helpfulness": 1, "user": "grumbleweeds", "date": "September 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 78581793}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Out of courtesy, we called before 9 to say we would be late, but didn't know when we would be arriving. Just before 10pm, we received a call asking where we were as the reception closes at 10pm (at no point had we been told about this). We said we were just leaving Gatwick, so would hopefully only be a few more minutes. Then the ranting started about \"We're just like the airport, we have check in times to stick to, blah blah blah and then the phone was slammed down on us.", "title": "GREAT VALUE", "user": "fransic", "date": "September 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78212053}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "So there we are at Gatwick, no knowing whether we would have a room for the night, or any parking.", "title": "Great value BUT dont expect to sleep much!!!!", "user": "LisaManning", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 76833007}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We got to the Little Foxes as quickly as possible (bearing in mind we were about 150 miles from home, and not knowing the area) using the sat nav, which sent us to the nearby Ilfield Court Hotel as it has the same postcode (we later found out they are owned by the same people). The staff here were very polite and helpful when I ran in to the reception to ask for directions to the Little Foxes, which turned out to be a couple of hundred yards down the road.", "title": "Very good value", "user": "mumsy10", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 76751332}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "When we got to the Little Foxes, most of the outside lights were off, so we nearly missed it, but drove in not knowing what to expect.", "title": "Good Value But", "user": "Chris187065", "date": "August 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 76435314}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 27, "average": 30, "very good": 89, "terrible": 20, "excellent": 154}, "slim_ranking": 0.315789473684, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Country licensed hotel near Gatwick airport offering overnight guests on site holiday parking. All rooms en suite and room price includes breakfast and vat. Single, twin, double, triple and family rooms available Your holiday starts here."}