{"user_rating": 3.5, "review_count": 1979, "name": "Gaylord National Resort & Convention Center", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Washington, DC, is a great place to visit for many reasons. Government, museums, restaurants, etc., are all connected by a wonderful transportation system. You do need a car. No need to search for parking. Unless you stay at the Gaylord. It seems close, but in reality so far away. The Metro does not come this far. And the cabbies will drive you far afield from your destination to run up the fare. It is a nice property with friendly staff. They should have built it elsewhere.", "title": "Nice but distant", "user": "hanesmd", "date": "August 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 137681199}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Stayed here in August for a convention. Room rate was close to $250.00/night. The common areas(lobby, atrium, elevators, hallways and conference rooms) were fantastic but the guest rooms were only adequate at best. My particular room was dusty the entire time I was there, had chipped and scratched furniture, a dirty tub that I eventually cleaned myself, and terrible bath towels and shower amenities. My view was of the stone convention center roof-amazing!!!! I think I could have stayed across the street in the Marriot and experienced a better value. Overall great conference service and poor guest service.", "title": "Terrible value, dirty rooms, and bad view", "user": "Jeffery S", "date": "August 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 1.0}, "id": 137633328}, {"rating": 1.0, "stay_parameters": "Stayed August 2012", "text": "We ordered two cheese pizzas at 12:30 AM. After calling numerous times and being offered false promises, it is. 1:38 AM and we have not review a single pizza. I don't know what college drop out is managing the food service at this \"resort\" but it is absolutely the worst experience I have ever had to deal with. They told us one pizza is on its way up, but that was half an hour ago, the second would be up at some point in time.... Were still waiting on both. Please contact me if you have any questions or want to verify this claim: runningislife05@yahoo.com. AWFUL and UNPROFESSIONAL.", "title": "Food service is absolutely HORRIBLE", "user": "DarrenMy", "date": "August 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 137594703}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "My family and I traveled to Gaylord National this year for the ICE experience. This hotel is clean and well maintained. The staff was very kind and hel[pful. (Do tip) I have to say though, after seeing ICE at the Texan Gaylord, I was a bit disapointed. The National's ICE was small. We rented rooms facing the atrium, money well spent, the view from anytime of the day was beautiful and entertaining. Our total trip for 3 days 2 nights for the ICE experience, this included the greet and meet and Shrek Feast (AWESOME) was about $800. Not bad for a small weekend getaway full of entertainment! There was something to do the whole time we were there!!", "title": "great weekend!", "user": "Micheale A", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 137308643}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This is a beautiful hotel; however, they provide very poor service for the most part. I spent a lot of money in order to have a family vacation at the Gaylord. My daughter ended up sick...with strep throat. After spending quite a bit of time at the walk-in dept at Washington Hospital Center, all my daughter wanted was some soup and some rest. I went to one of the restaurants and asked for the pototo soup to go. I was told that they were not giving to go orders any more for the evening (it was 6:00). I explaind our dilemna but still...no soup to go. I was told to go order room service. The only soup on the room service menu was crab soup which didn't work for my young daughter. For the amount of money I paid to stay in this hotel I expected better customer service. I won't be traveling to the Gaylord anytime soon. This hotel is also a HUGE money-pit. Everything is very over-priced!", "title": "Poor service", "helpfulness": 1, "user": "BEtsy S", "date": "August 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 137262514}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "this was my first time staying at a Gaylord Hotel...I knew this hotel was fairly new but it still looked brand new (I know it's about 3-4 years old now)", "title": "First time at a Gaylord but wow", "user": "Northern_GA_Guy", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 126626628}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I was there for a conference - we had about 1400 for dinner each night, wow staff didn't miss a beat all while a second conference was going on too....grounds/facility was terrific and allowed us to have a lot of \"mixing/networking\" opportunities - food was great, there seemed to always been a pleasant member of the staff everywhere right when you needed them...rooms were large for a DC area hotel...only downside is the location if you're planning on going into the District, not easy", "title": "Huge Bloated = Typical Gaylord", "user": "KJDC19", "date": "March 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 126552712}, {"rating": 4.0, "title": "Nice hotel for a convention, but price was high", "text": "High Prices and isolated location (National Harbor is still very inaccessible from the rest of the DC metro area) makes this a self contained attraction but would not recommend booking it if you wish to visit anywhere else in D.C. The complex has all of the typical gigantic sized options that Gaylord visitors will be accustomed to without any of the real charm that you might expect. Nice view of the river and the adjoining National Harbour complex, complete with shopping and additional restaurants/nightlife in (somewhat limited) galore", "user": "dlpcyles", "date": "March 21, 2012", "id": 126470214}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The setting is beautiful, especially the bike/walking paths that link to area trails. The workout room is the best of any hotel I have seen with 6 nice, newer ellipticals and prob 10 treadmills plus weight machines and dumbbells, even though it was inconvenient to access from the side of the hotel I stayed in. Loved that the room safe was large enough for my laptop and also loved having the room fridge. Wireless signal in my room was a little weak. The steakhouse was pricey but the food was worth it - sportsbar overpriced and coffee bar needed some healthier choices for breakfast. Restaurants in surrounding area were mediocre and overpriced - outside the hotel my best meal was at Potbelly sandwiches. I would not stay here unless I was attending a convention since it isn't on the metro line.", "title": "bring your money", "user": "kkcrane", "date": "March 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 126420660}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "very nice, comfortable beds. no breakfast available on Sunday, so you can get a 10.00 (plus tip and delivery) bowl of oatmeal from room service", "title": "Awesome Staff!", "user": "jerryinegb", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126407686}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Avoid the Gaylord Hotel! I recently traveled there for business for the first time to attend a conference, which I registered for months in advance. Upon arrival, I was placed in a handicap room, no disrespect here, without being informed. These rooms are designed differently and it was not what I registered for. It wasn't until the second night that I was finally able to get another room. Service was terrible! The second room was filthy! It looked as though it had never been vacuumed. Parking was $19 a day for self parking. I also had someone open my door and attempt to enter my room in the evening and while I was in my room....No security! Be Warned!", "title": "Gaylord Nighmare", "helpfulness": 1, "user": "gorp1234", "date": "July 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 36219880}, {"rating": 1.0, "title": "Skip the Gaylord.", "text": "It all started with wanting to change my reservation. They needed 72 hours notice to cancel, otherwise I would have to pay for the room, even though they were virtually full and could have filled the room anyway. I had a suite which was a decent size, but the pillows were hard, and the air-conditioning which was absolute necessary, was incredibly noisy. Then there was a bill for $18.57 for a one minute call. Ask to pay a little extra money at a hotel visa phone but this was ridiculous. The cost of the phone company would be less than one cent and all certainly the hotel is getting a kickback even though they tried to blame it all on AT&T. When I couldn't get i into the Gaylord the night before my conference, I stayed at the Hampton Inn across the street in a suite which was just as nice. More importantly the staff was extremely friendly. It's just a one minute walk across the street -- I encourage you to stay there and avoid the Gaylord. And as many people have commented, you're literally in the middle of nowhere and that's a drag because it means they can charge whatever they want with their services and food. .", "helpfulness": 1, "user": "DrMcKinnon", "date": "July 29, 2009", "id": 36182937}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This place will nickel and dime you too death and it is not worth it. You must pay an amenties charge of $20 every night you stay to use the pool, fitness room, high speed internet, a newspaper, and for 2 bottles of water a day. We never even received our water during our entire stay, even after asking for it. You also pay $20 a day for parking, if you park your own vehicle. Valet is much higher. The hotel was clean, but not as nice as you would think it would be. The iron provided in each room is a joke. I have used nicer irons in an Econo Lodge. Considering I am paying $20 extra a day, you would think they could provide a nicer one. It is also a good distance from downtown D.C. If you are planning on taking the bus to the subway, be prepared to go through the worst part of D.C. I wish we would have stayed in Alexandria. It is much closer to D.C. and most of the hotels there do not charge you for everything! If this was a business trip, and I was not paying for my own room, then I would not have minded my company being charged for amenities and parking. Since I was paying for it myself, I feel like I was ripped off.", "title": "Will nickel and dime you too death", "user": "ghostgirl76", "date": "July 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 36056522}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Booked two rooms for a week stay at Gaylord in June 2009. Used Travelocity to book my rooms. When checking in a man and woman were fighting at the check in desk. The man knocked the woman down and when she got up to get away from him he persued he down the length of the counter. The woman was yelling at him to leave her alone. The person checking me in asked another employee to call for help. (That employee was too busy socializing to concern themself with helping) As the woman was backing up the man pushed her again knocking her into my 11 year old son and pinned him to the check in counter. I had to grab him to get him away from the fighting couple. The check in clerk was upset and said she was sorry. Needless to say we hurried through the check process and got the heck out of there. The check in person took my credit card for incidental purchases. The police were called by someone.", "title": "Hidden charges add up!", "helpfulness": 1, "user": "happytrails94", "date": "July 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 2.0, "rooms": 3.0}, "id": 36050561}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "When I went to check out both my rooms had a resort fee charge added to the bill. When I inquired about the fee I was told that I had been informed at the time of check in! I stated that I had not been informed and they agreed to remove one rooms charges. The only day we went to use the pool June 27, 2009 a child had thrown up in it and it was closed. Neither of my children were old enough to use the hot tub.", "title": "Beautiful Hotel but expensive", "user": "MomOf3LittleGems", "date": "July 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 35937885}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I felt I was held hostage here....the place is huge, 2000 rooms, and the only thing missing are the slots...eating here is an adventure, the food unremarkable, and priced like it was..,found the staff rather vacant...I was on the 19th floor, there was a party next door which started @ midnite, and went on till 3...I called downstairs 3 times...walked barefoot next door in my gym shorts & t-shirt to ask them to tone it down, that \"some of us have meetings in the morning\"...nada...finally banged on the wall at 2:45AM! front desk was totally unresponsive....I was one minute away from calling the local police...I would NEVER stay there again", "title": "If you don't mind being secluded.....", "user": "Clif4nyc", "date": "March 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 126811423}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Views are poor from some of the rooms, but there are no exterior balconies, so this was not a big deal. Several in our group complained of noisy beds, but the beds were corrected by the maintenance staff. The bedding is very nice, but not what I hoped for (who doesn't love luxury linens?). The room size and bathroom size was adequate. Storage was very good, but I always wish for more. The rooms were very quiet, just be sure to put the fan speed of the AC unit on low--high speed is quite noisy. The staff is exceedingly friendly and attentive; really top notch people. The resort has an outstanding fitness center and the spa is AMAZING. Mario the massage therapist gave me the best massage EVER and I have had many many massages!", "title": "A very nice hotel; the staff is the best part!", "user": "ncav4", "date": "March 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 126779954}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed here for two nights for a conference. Beautiful hotel with great views of the Potomac and a nice walk to downtown Alexandria if you like walking. Rooms are large and clean but I would have expected sparklier bathrooms from a pseudo 5 star hotel. The food was just so-so. Dont know that I would stay here again if I was paying for it. The hotel seems to be trying to be something it isnt yet...", "title": "Great views", "user": "GhLez", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126778160}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The room itself was okay, not very out of the ordinary. The bed pillows were awful. Bring your own from home if possible. I used three of theirs and they still flattened out. Not very condusive to a good nights sleep. The amenities in the hotel were very nice. The spa, if you have a chance, was awesome. Everyone who worked there was super nice and accomodating. The hotel is in a great area, lots of shopping and great for taking walks. The water views are great.", "title": "Beautiful area", "user": "Celia R", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 126749593}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Well done. Great hotel to stay at if you have a function at the convention center. Nicely designed. Good size room. Balcony's are very cool.", "title": "Gaylord DC", "user": "Yoosh", "date": "March 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126749042}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "This is the third Gaylord I've stayed at in the last couple of years. I have to rate this one the highest. First of all, the staff is excellent. Check in was great - I had a bunch of luggage (because I drove) - around 8 pieces which I left with the bellhop. I had to check in to my room and then go directly down to meet someone. My luggage was in my room when I returned.", "title": "Gorgeous views & fantastic staff", "helpfulness": 1, "user": "otsthedog", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138440679}, {"rating": 3.0, "title": "Front desk staff needs training! Disappointed", "text": "I was also with a friend on crutches - she had not had a chance to do anything other than go to the emergency room. It looks like she's going to have a long haul. Larry, from the bell desk, ran over and offered a wheel chair which we gratefully took. He allowed us to keep it for the duration of our stay --- a whole week!", "user": "G-father_06", "date": "August 24, 2012", "id": 138274249}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The food was pretty good and the place was very clean. The view from the atrium is of the Potomac River and it's lovely. I had an atrium room with two queen beds and a balcony. Everything in the room was very nice. As with the other Gaylords, I appreciate the double sink and that the sinks are outside the enclosed portion of the bathroom.", "title": "Spectacular, if a bit out of town", "user": "causemark", "date": "August 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 138261438}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Daily newspaper, free wi-fi & a fridge --- those are rare nowadays. Free (or should I say included in the price) bottled water. Coffee maker. And, shampoo, condiitioner, soap & surprise - mouthwash, shaving cream and razor. I spent Saturday night and was pleased to have a Sunday copy of the Washington Post.", "title": "Dated Rooms, Unfriendly Staff, Overpriced", "user": "JT62285", "date": "August 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 138215899}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Bed was comfortable and I had five pillows on my bed which I love. The atrium was temperature controlled, so I just left the doors open and turned off my HVAC in the room.", "title": "This is the life!", "user": "Shayna D", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138143978}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I stayed in the Gaylord National Hotel in March for a conference, and was exceptionally pleased. The room was immaculately clean, a decent size, and comfortable. The conference area was well appointed, and the meals (sponsored by the conference) were also quite good. The Old Hickory Steakhouse is top-notch - I highly recommend it - and there is also a sports bar on site that has decent snack food and a good ambiance for sports fans. A small town area has been built around the Gaylord on the harbor, with quaint shops, a variety of restaurants, and things to. And their famous fountain show is not to be missed.", "title": "Fabulous hotel", "user": "Lisa F", "date": "May 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160844068}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I would definitely stay here again... not just on business, but for personal travel if I find myself in the DC area.", "title": "Most boring place on earth", "user": "270Doctordeb", "date": "May 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 160746519}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I had to pick a conference and my son lives in Washington DC so this conference was at the Gaylord National Harbor. Sounds nice, right? If you like Walt Disney World...without any rides, different venues, or design sense, you'll LOVE the Gaylord. This hotel looks like a set from BIG LOVE. Totally fabricated, like the National Harbor itself, there is nothing REAl here. Upgraded rooms with balconies look INSIDE the Atrium. You are encapsulated in a world of canned air. The standard rooms look out on a square of moldy grass surrounded by other Gaylord pods.", "title": "conference venue par excellence", "user": "DOCMumbai", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 160625725}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Your room is clean and completely unremarkable. The staff is pleasant but were unable to supply me with regular coffee because they can't read English. This is not their fault, of course, but should have sought help.", "title": "Great for conventions and for a weekend getaway at national harbor", "helpfulness": 1, "user": "Jugaral69", "date": "May 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 160621132}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I took my lunch outside TO GET SOME FRESH AIR and sat on...AstroTurf. That's right. A gorgeous 75 degree day in Spring in azalea season and the Gaylord chose to have artificial grass.", "title": "Enjoyable convention stay at the Gaylord National", "user": "davidbh1453", "date": "May 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 160618858}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Spent 4 nights at the Gaylord National during a recent business trip/trade show, and have to say it's one of the nicest convention centers I've visited. Large, clean room and bathroom with all the amenities. Great interior view to the waterworks, and a short walk (unlike the Gaylord in Nashville) to the convention center. Great restaurants, reasonable prices in the lounges and restaurants, nice exercise facility, and very comfortable beds. The surrounding area is still under construction to some extent, but great shopping and dining within easy walking distance. The Gaylord staff did a great job ferrying 15 of us into town for a tour of the sights. Convenient ferry service into Alexandria/Old Town too. Wiould absolutely stay here again.", "title": "Nice place to stay outside of DC", "user": "ThriveWellness", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 37869387}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "When we first arrived at the Gaylord it looked like a beautiful, brand new, massive hotel. We had booked two rooms and when we checked in one was not ready yet at 430 pm. The attendent said that she would call us when our room was finished being cleaned. She didnt call us and finally around 8 o'clock we decided to go back to the front desk to get our keys, we told another attendent our situatuion and she rudely, without a smile gave us our keys. Room service the next morning was nothing special, way overpriced for what you get. The bellmen are friendly and so are some of the people who work in the shops, and bakery. The conceirge dont know the city well, the maids skipped one of our rooms the next day as well. You would think that for the money you would get good service but its closer to the service you get at a holliday inn. Poorly managed, boring rooms that are small.", "title": "Less than satisfactory", "helpfulness": 1, "user": "Edisond1", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 36997706}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "We stayed at the Gaylord for a business conference the week of July 26-Aug 3. I must admit I was a bit hesitant to stay at this hotel after reading all the bad reviews. HOWEVER, I have learned to experience things for myself instead of taking others' advice.", "title": "Great for business, but not for the DC tourist!", "helpfulness": 2, "user": "pharmdoc06", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36816437}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Property: When we arrived (Sunday night at 9pm), we waited about 2-3 mins to get checked in. Nothing was mentioned about the $15 resort fee upon check-in, but we knew about it going in. The hotel was a good size, but certainly not HUGE, in my opinion, like everyone has said it was. We've stayed at several hotels in Las Vegas and those are huge. Even the Gaylord in Nashville, TN was larger than this one. The walk to our room was very pleasant and did not take long at all. We had an atrium view room, which was beautiful, to say the least. The room was perfectly put together and the bathroom was gorgeous with its marble tile floor and granite countertops. The shower had a very forceful stream, which to me was very nice. People has complained on here about the \"plastic\" cups in the bathroom. They were plastic, but were a better quality than you find in your local Super 8. I, personally, don't care if the cups are plastic or glass. That's not on the top of the requirement list when I'm looking for a hotel! The beds were super comfy and there was a flat screen TV that was at least 42\" in size. I didn't use the WiFi internet, but did use it via the cord provided at the desk and had NO problems whatsoever with connecting. I agree with some previous posters about the AC unit. It does get a little loud when it kicks on, but it wasn't loud the entire time. In other words, it's not distracting. I had to call for extra washcloths once and they were in our room within 10min. Every hotel employee we came in contact with was extremely friendly! We called \"conside it done\" for valet and our car was there every time we got outside. They tell you to give them up to 10min. to have your car ready. As far as the food in the hotel, it was all great. Yes, pricey, but it's a RESORT! My advice is to buy some sodas before you get there because a 20oz soda costs $3.14 with tax. We utilized the pool facilities and they were very nice. My only wish is that there was an outdoor pool. They have several lounge chairs on a patio, but no outdoor pool...just an indoor. There are, however, 3 jacuzzis (one inside and two outside). The gym, which is located on the pool level, is of decent size and has several pieces of equipment. The atrium was beautiful and the water fountain was amazing.", "title": "An excellent choice for a conference dtination.", "user": "Extracat3", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36396419}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Transportation: We didn't use water taxi, so I can't comment on that, but we did drive to the resort. It was very easy to get to and get out of, but it isn't within walking distance to the Metro. We got fed up trying to drive to a decent Metro stop one day, so we drove into Union Station and parked there.", "title": "A very nice place, a very huge place!", "user": "troymv505", "date": "July 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 36345219}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This is a shining, modern business and convention hotel that clearly has advantages for the family of a business attendee. The hotel has beautiful vistas of the river, interior details that recall some hotels in Disneyland, a convenient and spacious convention center and large comforatable and efficient rooms. The hotel also provides rapid shuttle service to DCA (National airpiort) which makes travel very simple.", "title": "A hybrid of business convention and pleasure", "user": "lilacroller", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 126746161}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Room service was gaspingly expensive ($46 for a salad and dessert), check-in was not swift.", "title": "Great Conference Hotel", "user": "HotelProNJ", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126745382}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "all in all it's a great place to stay, if you have to work, but your family wants to enjoy and tour.", "title": "Very Nice but pricey", "user": "cindycPasadena_MD", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126742576}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Second stay at this hotel and it was wonderful. It is so nice to be able to attend an event and stay in the same building morning to night because everything you need is right there. My daughter says it best.......\"It is a city in a hotel.\"", "title": "Amazing girls night away", "user": "jha76", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126687957}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The Gaylord is a very nice hotel but pricey. Rooms are nice and clean. Bathroom a little on the small side and only had a shower, no tub. I don't agree with the $15.00 per night resort fee. This covers use of the pool, in room wifi, and 2 bottles of water a day. Since much smaller hotels offer these features for free I just don't get the relavance for this cost. If you go don't park in their garage as it is quite costly. Park at the one across the street by the Hampton Inn as this garage is half the price.", "title": "Didn't stay here, but attended a wonderful conference", "user": "AMERICAN-IN-ATHENS", "date": "March 25, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 126628778}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "My husband and I stayed here for a business convention he was attending. I did sight seeing in DC. I have nothing but good things to say about the hotel itself. It feels like a small village inside the actual hotel with cobble stone paths and pretty views of the harbor through the gigantic atrium. The rooms are very comfortable and the staff was great. But, to be honest, we would not have stayed here if it wasn’t paid for by the company. Its location is not convenient for touring DC. And there is nothing interesting to do in National Harbor besides eat. It’s about a 15 min taxi ride at around $25 each way. The hotel also offer a shuttle service through a tour company which comes out cheaper but I, being a budget traveler, ended up taking the very reliable bus and Metro every day which costs $6.80 round trip but took around 40 min each way. If you’re going to be attending a convention here, have no worries because it’s great. But I can’t recommend this hotel for DC tourists.", "title": "Beautiful hotel, great for business conference", "user": "N0tApplicable", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 35665072}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Our group's horrible experience at the National Gaylord Hotel in DC were similar to other reviews here. We booked our rooms 3 months ahead, prepaid. We even called the hotel desk to make sure that they would guarantee the rooms for us,which they said our reservation was secured. I told front desk about the bad reviews on Tripadvisor.com web site in regard to they did not honor the guest's reservation and ended up sending the guests to another distant hotel. They said those reviews were not true. Well, it did happend to us. When we checked in, they told us the hotel was overbooked and they had to send us to another smaller hotel 15miles away but with the DC traffic, it took us almost 1 hr to get there. I just had a very bad taste in my mouth to continue with this review and had to re-live the terrible experience. STAY AWAY FROM THIS HOTEL.", "title": "Stay away from National Gaylord on DC", "helpfulness": 1, "user": "MissBasil", "date": "July 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 35628027}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Very well laid out and help was super nice.....but it is so far from good reasonable transportation to the sights of Washington DC....very expensive and long trip (don't believe the water taxi hype--a lot of money, a lot of waiting...and it does NOT get you to the heart of the Capitol area). Very clean, quiet rooms.....chlorine-y closed in pool. Waterfront needs some tlc (plastic bottles EVERYWHERE--)...but there are some fun things--the outside amphitheater, the restaurants are good. Lousy shopping and as before, lousy expensive transportation. Old Town Alexandria is fun, though, from the water taxi ($16 rt, per person), for a nice dinner. It just was a very VERY inconvenient place to stay if say, one person is attending the convention and the rest of the family is there to see the sights of DC. Stay IN DC for part of the trip if possible!", "title": "Only stay as long as needed, then move closer to DC sights!", "user": "sjsandy", "date": "July 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 5.0, "rooms": 4.0}, "id": 35578612}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I have been here twice and consistently I am impressed. Like all Gaylord Hotels it's enormous but it has an elegance I have not seen in other properties. The waterfront location is beautiful. I am dinging the hotel a bit for service because they should have installed waterless urinals in the public bathrooms like other places are doing. The area gets a lot of storms and I like being out near (not always under!) the glass roof watching the wind, rain and lightning show.", "title": "Amazingly well run and convenience for conventions on east coast", "user": "traveltode", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 35196878}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Overall great experience. The hotel is gorgeous. Shopping and dining is expensive which I guess is consistent with the price of the hotel rooms. There is no grocery store or liquor store nearby. You can take the bus to the metro to get downtown. Best deal while we were there was at McCormicks and Schmidts down in National Harbor just a couple of blocks from the hotel. The have happy hour every night from 3-6 pm. I had a half pound cheeseburger and fries for $2.95 that was fantastic and drinks were at a reduced price too. Numerous other sandwiches etc. at similar prices. I wish I would have known about it sooner. The other reasonably priced restaurant was Potbelly's which is just across the street from McCormick and Schmidt's. The Boutique in the hotel has some gorgeous jewelry at great prices. We took the OnBoard Tour called \"DC It All\" right from the hotel and it was awesome and well worth the money. I would not recommend the Monument Water Cruise however. It was long and boring. The boat was not very nice, the caption was not nice either. They play a recorded message as the boat went from Alexandria to Georgetown and back. The Boat Taxi from the Gaylord to Alexandria was very nice though. I wish I would have had more time to tour Alexandria. I hope this helps a future tourist.", "title": "Beautiful hotel", "user": "benj2", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 35154862}, {"rating": 3.0, "title": "Much ado about...not much.", "text": "A friend was attending a business meeting at the Gaylord, and she invited me to spend the weekend in DC with her. I had previously been to National Harbor to walk around and I had dined at the sports bar at the Gaylord. I have also previously stayed at the Gaylord Texan (DFW/Grapevine) and Opryland (Nashville) resorts, which were very good experiences, These left me anticipating a really lavish, luxurious experience at National Harbor. To be certain, the only thing that was luxurious were the prices, and this turned out to be a very disappointing experience that did not live up to the otherwise solid Gaylord brand.", "user": "Bob-A_from_CT", "date": "June 14, 2013", "id": 164013603}, {"rating": 4.0, "title": "Another great Gaylord facility", "text": "The room was nothing special - a typically 3-star type room, with a shockingly small supply of hangers in the closet, a TV that required two visits by maintenance to get to work consistently, a very strange, cumbersome system for ordering room service, and hallways that reminded me of the hotel in \"The Shining\". And these were the good attributes! Couple this with a very inconvenient and isolated location, and you have the perfect formula for a captive audience and limited incentive to wow the customer. This translated into the quality of the restaurants (meh!), the cattle-drive type feeling whenever we were in the lobby or ballroom areas, and of course, the underwhelming presentation and utility of the rooms.", "user": "Terrapin909", "date": "June 14, 2013", "id": 164004490}, {"rating": 5.0, "title": "Large resort style hotel, great for business, not so much for sight-seeing", "text": "Experiencing this disappointment at a Marriott Group-owned hotel, in DC, the hub of Marriott's business was a shock, and I cannot in good conscience recommend this hotel.", "user": "DMallyon", "date": "June 14, 2013", "id": 163977911}, {"rating": 4.0, "title": "Vegas in DC without the casinos", "text": "I was here for a medical software conference at the end of May. As with the two other Gaylord Convention Centers I have stayed at (Nashville and Grapevine, Texas), it was an excellent and well-appointed location for a convention - good service, food, and amenities.More great shops and restaurants across the street.", "user": "WIsil", "date": "June 13, 2013", "id": 163908116}, {"rating": 1.0, "title": "I really don't like it", "text": "This hotel is very large. Like a Vegas style hotel 2,000+ rooms. Be prepared to walk. It's in National Harbor -- a manufactured 'town' south of DC on the river. Beautiful location. Town has no character and is just touristy shops and restaurants. Not connected to the Metro or an convenient transit.", "user": "CP M", "date": "June 12, 2013", "id": 163791772}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "OK, this is a huge hotel! Needs a good manager. Our first day no one made up the room. Got back at 10 pm and was too tired to get room serviced. Luckily had some clean towels left. Carry a canteen with water while looking for your room. Ours was about 1 mile from any elevator and the room numbering system is discontinuous and makes no sense. No clues from any signs on the walls. Just keep walking until you see numbers close to what you're looking for!", "title": "Very Large Hotel", "helpfulness": 1, "user": "PhillandKaren", "date": "May 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 161209202}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "One thing good is proximity to D.C., but pay $13 for 15 min bus ride each way! The bus doesn't even have the hotel name on it, so if you're at Union Station look for \"Chariots for Hire\" Or better yet stay in the city. The last return bus is 8 PM.", "title": "Warning -- Room Service Menu Is Short", "user": "SSN695", "date": "May 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161207733}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "While i really like this hotel, I've rated them poorly because someone in Marriott's management has really screwed up. At the Gaylord National Harbor, they've gone paperless in the rooms -- which means the room service menu is done through the television. And guess what, you've got only three choices for dinner -- a fish, a chicken and a beef. Plus if you're challenged by the remote, which seems to have a mind of its own, you'll starve. So if you're a couple looking for a little in-room romance, or a business traveler who doesn't want to eat alone in a restaurant -- go somewhere else.", "title": "not all that", "user": "Mary H", "date": "May 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 161202629}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I was surprised by the \"ordinariness\" of the room. My husband and I bid on the room at a fundraising auction, it was valued at over $200.00 per night. There was a coffee maker, refrigerator and a complimentary bottle of water in the room, the toilet was in with the shower, not separate. Parking was extra; $24.00 per night, double the parking garage across the street. My husband said the pool was nice but that the gym was average. The lobby and public area are nice, but NOT worth the room charge. Housekeeping called to ask us if we wanted our room \"made up\" we said, \"yes, we will be leaving in a few minutes.\" When we returned a few hours later, the room was not made up...housekeeping came by an hour after we returned, while I was napping.", "title": "Enjoyable Stay", "user": "BKLYNQT", "date": "May 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 161110671}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I stayed at this location over the Mother's Day weekend (9-11 May) with my Husband and 4yr old son. The hotel is beautiful and the rooms were very nicely appointed. Check-in was a breeze (staff was very friendly) and we upgraded to a room with a balcony, which was worth the extra $30. From the balcony we watched the water show every evening (begins at 6pm) prior to going out for dinner. Despite having a room facing the center of the hotel, once the door was closed you could not here any noise.", "title": "Great for a Girls Weekend", "user": "Vatraveler58", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161080515}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I recently spent 7 nights at the Gaylord National for two back-to-back conferences. The hotel is beautiful and customer service was excellent. The first night of my stay I had extremely loud, noisy neighbors in the room next to me and the hotel was very accomodating when I informed them the next day. My only semi-complaint is that there were not a lot of options for a quick bite to eat inside the hotel, only one coffee stand and the food was pretty boring for the price. This was challenging for me on a busy conference day, but there are plenty of restaurants nearby if you are not on limited time. Overall, great stay at the Gaylord.", "title": "Beautiful hotel, great customer service", "user": "stephanierae92", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 160614282}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This was a business trip and my husband was speaking at a convention. The hotel is huge--over 1000 rooms, very busy and in a horrible location if you want to go anywhere other than the are the hotel is located in. To get to DC, your options are shuttle from hotel with two drop off points and it doesn't start until 9 or the water taxi to Alexandria which doesn't start until 11 on weekdays. Or, you can take a cab which is pretty pricey. I wanted to go to The Holocaust Museum for a 10 AM entry and had to cab to Alexandria and take the Metra from there. Same thing on the return trip. While the museum is free, transportation to and from ended up costing me around $50. The hotel itself was decent enough, but the food is ridiculously expensive and there were no toiletries in our room. I had to request them.additinally, there is poor signage (sp?)at the hotel so be prepared to ask a lot of people for directions. If you are traveling to the DC area, do not stay at The Gaylord-- stay in Alexandria. It is charming and public transportation to DC is simple via Metra.", "title": "Inconvenient location.", "helpfulness": 1, "user": "Rp917", "date": "May 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 160599613}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We spent three nights there for a conference although we live close by. It seems just the same as before Marriott took it over. We didn't get a river view which would have been great at that location. We went to restaurants both in the resort and near by. The food in the resort was good but both food and drinks are very pricy. Near by you can find a wide variety of foods and prices.", "title": "Close by on the Potomac", "user": "Travelismyforte", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 160491759}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We found the resort staff very friendly and helpful. The rooms are clean and comfortable.", "title": "Works well as a conference hotel", "user": "JLB_miles_to_go", "date": "May 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 160410411}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "There is a water taxi to Old Town Alexandria, one of the best towns in America. No we live in Maryland.", "title": "Great conference facility", "user": "MargaretL750", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 160221594}, {"rating": 3.0, "title": "Disappointing", "text": "For late arrivals their system does not work. I arrived around 10pm and around 4am a security person tried to enter the room (good thing I lock the doors) and the I got a call saying they needed to retreive something a previous guest had left! Checked out very early 2 days later and the person from reception had a hard time doing my bill, it tool them a month to send it to me by email.", "user": "Alexandra V", "date": "June 11, 2013", "id": 163730905}, {"rating": 3.0, "title": "Flash rather than substance", "text": "Lobby and grounds are beautiful. Rooms are average with few amenities -- no tub in our upgraded suite, no mini-bar, but there was a rather useless dining table & chairs taking up the other half of the suite. Spa staff was cordial, but nothing special there either. If you're looking for location, the hotel provides that, but stay in the cheapest room and spend your time in the atrium. Conference room we were stuck in was filthy, cement floors, and felt like an underground hanger or garage. Felt sorry for the vendors trying to attract people to their booths. Mayonaise or egg was plastered on the wall by the elevator on our floor for the entire lenght of our 3-day stay; never saw it cleaned. Again, you are paying for location and the lovely atrium.", "user": "JJinNE", "date": "June 11, 2013", "id": 163697590}, {"rating": 4.0, "title": "Great Oasis from DC", "text": "Stayed at the Gaylord National for a business convention. Never heard of this location before. I was very pleased as I was driving up to the hotel. Very nice town surrounding the Hotel. Great shops. Nice restaurants. Best part for me - restaurants on the water. Love dining outside by the water. The Hotel is beautiful. Check in was quick and easy. The room was very comfortable. I don't typically sleep well he first night on the road but that was different here. Bed was very comfortable. The main area of the Hotel is much like small village. Bars, coffee shops, small grocery store and stores all contained in beautiful glass enclosed area. Took walk downtown (short walk) to break the confnes of the tradeshow. Very easy walk. Beautiful view of Marina. I would stay here if I were to take the family to DC. Very pleased with entire stay!", "user": "JFAnderson", "date": "June 11, 2013", "id": 163665026}, {"rating": 4.0, "title": "Great stay removed from the City (DC)", "text": "I've been to DC many times - and never stayed outside the city. This was a great stay to be out of the hussle of DC. Came here for a conference - was about 15min from DCA - They have a shuttle that runs from the hotel to DCA for about $15 definitely would book this ahead of time. BWI is about an hour away and a $50 cab ride. I had a pleasant stay in my room - though it was a 5min walk to the elevator because the property is so big (and yes, there are 3 banks of elevators and it still took that long). a co-worker of mine did not have such a plesant stay, he managed to have bed bugs the one-night he was staying here. When he brought it to the hotels attention they did not offer any remorse or show any sign of urgency to fix the matter - which was quite surprising for being a luxury hotel. It actually is because of this my company will not be considering Gaylord National to host an upcoming event. They have a nice lobby bar - though the service is quite slow. 4 waiters will look at you - in hopes you will get up and order from the bar or leave. They have live music in this bar - which is nice. But they definitely make it seem like they dont want you to hang out here at this bar. Old Alexandria is right across the river, and dont worry if you do not have a car you can take the water taxi - i would DEFINITELY recommend doing this. Old Alexandria was BEAUTIFUL - we ate at Landini Brothers (read my review on here). Food inside the hotel was meh - just average. Room service was nothing to rave about. It was nice having restaurants and a CVS right by the hotel - though more of the restaurants are bars, and not ideal dining hot spots. The breakfast buffet in the hotel was rather pricey ($22/person) but it was a very nice spread.", "user": "jennifer h", "date": "June 10, 2013", "id": 163583402}, {"rating": 5.0, "title": "I'll BEE Back", "text": "I went to the Gaylord National as I was competing in the 2013 Scripps National Spelling Bee. (Speller 130) The resort was wonderful, and so were the staff. In our room we got a beautiful view of the Potomac off of our balcony, and overall, the hotel/convention center was amazing and very well managed.", "user": "Redneck99", "date": "June 10, 2013", "id": 163554243}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Spend some time in the Belvedere Lobby Bar and enjoy the view! This hotel is simply lovely. The entire hotel is beautiful, the rooms are clean and the staff is friendly and attentive; really outstanding! The only drawback to this beautiful property is its distance from downtown DC. It is not near a subway stop which makes getting around a little more difficult than I would have liked. It's a minor inconvenience however, considering the", "title": "Spend some time in the Belvedere Lobby Bar", "user": "julimac", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 137903934}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This hotel is extremely large, the staff is friendly and the interior throughout is very nice. Our room (king bed) was fairly spacious and very clean. The view from our 17th floor room was out on to the main street in front of the hotel with a partial view of the harbor off to the left. I was slightly disappointed that although the bathroom had a large shower, there was no bathtub. Additionally, because we were on the 17th floor, we could hear the loud music from the hotel's dance club above us, most of the night.", "title": "\"Friendly Staff. Beautiful Hotel. Horrible Food.\"", "user": "RileyPA", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137880946}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The hotel has several restaurants in its atrium area, and we ate two of them. We decided to try the Pienza restaurant for their breakfast buffet. The hot item choices were very limited and not very tasty at all. The following evening, we decided to try the National Pastime Sports Bar and Grill. There, I ordered an applewood smoked bacon burger with fries and a soda, again extremely disappointed. The bun was amazingly dry, and the fries were very salty, $22 wasted. There are plenty of restaurants outside the hotel within a short walking distance. We dined at the Cadillac restaurant, just across the street from the entrance to the hotel during our stay. The food there was magnificent, and the prices were more reasonable than those of the restaurants we tried inside the hotel.", "title": "Nice hotel. Not impressed with food choices.", "user": "atrujillo6", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 137826158}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The Pose Ultra Lounge is beautiful inside and has comfortable seating and a large dance floor. Unfortunately, the night (Friday) we decided to go to the club it was extremely dead. The drink prices were terribly expensive, however, the music was good. We arrived approximately, 10pm and left by midnight. The bartender did advise us that it was because the hotel was at less than 50% capacity.", "title": "fun weekend trip", "user": "sandygt1", "date": "August 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 137806080}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "If I were in need of accommodations again in the area, although the Gaylord was very nice, I might try one of the other hotels in the immediate area. Since we were not pleased with restaurants, and due to our short 2 day stay, did have sufficient time to utilize the other services & amenities, such as, the pool, spa or fitness center the cost was not a good value for us.", "title": "OMG what a great stay and STAFF", "user": "Patricia_lenahan", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137773018}, {"rating": 2.0, "title": "Expect more from a Gaylord resort hotel", "text": "A colleague awoke to find he'd been sleeping in a puddle of urine from the previous occupant! I had no hair dryer and the iron had scorching that left black marks on my clothes. The hallway smelled of something burned (all week!) I arrived at 6:30pm to find the only 2 dinner choices are the steakhouse or the sports bar. The simple cobb salad at the sports bar was awful and the iced tea tasted like sludge. They added a seperate charge to my Amex for my meal 2 days after my departure date, duplicating the charge from the overall bill. When I called their office to resolve, they don't open until 11am!", "user": "Cindy B", "date": "June 19, 2013", "id": 164491039}, {"rating": 5.0, "title": "A beautiful hotel plus in National Harbor", "text": "We stayed at the Gaylord as it was hosting our daughter's college graduation. Had it not been for that we most likely would have opted for one of the other hotels in National Harbor, and there are quite a few to choose from.", "user": "JLangs", "date": "June 17, 2013", "id": 164319134}, {"rating": 2.0, "title": "Great coffee and hot dogs", "text": "We are so glad that we stayed at the Gaylord, and if you try it you will be too.", "user": "roncoate", "date": "June 17, 2013", "id": 164281398}, {"rating": 1.0, "title": "Prepare to bleed money to Marriott (Gaylord", "text": "This is one fantastic hotel from its size, to the dining options, but most importantly, the friendly staff.", "user": "wilbur_the_goose", "date": "June 17, 2013", "id": 164265170}, {"rating": 3.0, "title": "Lacks Character, Very Corporate Feeling", "text": "A couple of tips: If you do go, try to be there for the Saturday night to see the fire works! And, take the water taxi across the Potomac River to Old Town Alexandria.", "user": "Robert B", "date": "June 15, 2013", "id": 164066600}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed here for a conference. It is the only reason to stay here. It is just outside DC but makes town nearly inaccessible during the evenings. Day trips are fine as the shuttle is quick and cost effective. The hotel is nice. Staff attentive. Rooms are clean. Bedding is comfortable. The view is nice. All good things right? YES BUT! the hotel with all that it has in it seems like it is missing something. It may be that I felt like I was sentenced to the property and the shops that seem to have been placed there to support it. I just had no sense of comfort there. In all other instances I would rate a hotel with the aforementioned qualities much higher. This one just didn't wow me.", "title": "Beautiful Property Lacking Spirit", "user": "Highclasslowrent", "date": "May 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 161426503}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This place is certainly beautiful, the atrium anyway. It is huge and great for conferences but really it is so overpriced for everything and the daily room rate is not worth the money for sure. The rooms are just average and really the pool area is only average and certainly not worth an extra $18 \"resort fee\". Resturants way overpriced for average food. Again to sum up it is an average huge nice hotel great for conferences but I would not bother to take a family there. Also not a good place if looking to tour DC it is a ways away. $20 shuttle", "title": "Way Overpriced Average rooms and accomidations", "user": "TravelLitee", "date": "May 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 161409243}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Three night stay for a National Convention was outstanding at the Gaylord National with its location on the Potomac with splendid views of the Woodrow Wilson bridge and the Masonic Temple dedicated to George Washington from the Atrium and the harbor. The service was exceptional and the rooms clean, quiet, comfortable. You are spoiled for dining options both within the Resort and within walking distance along the National Harbor. The Old Hickory Steakhouse was my favorite experience at Gaylord National. Also great to visit historic Old Town Alexandria which is a short drive away. Great place for family and I plan to return with mine1", "title": "Great location on the Potomac", "user": "ShankarBexley_Ohio", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161405550}, {"rating": 4.0, "title": "Beautiful Resort", "text": "Everyone was so kind, helpful, and professional. The resort is enormous but the staff makes you feel very much at home. The restaurants and bars were fun and delicious too! The National Harbor area is beautiful and easy to navigate.", "user": "Dlbjkb", "date": "May 20, 2013", "id": 161345955}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I attended a conference in the hotel which was very convenient. The room was nice and clean. Hotel lobby/restaurant area has a magnificent view of the harbor. Price is a little high but company was paying. Lots of good restaurants within walking distance.", "title": "Almost great", "user": "Mark L", "date": "May 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 161307065}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Gaylord is a world-class hotel for events. During my stay, we had a group of +700 people and there were at least another 2 events running at the same time... Accommodations are very comfortable, everything is quite spacious and the neighborhood is awesome. Lots of restaurants and small stores in a pretty pleasant area.", "title": "Fantastic Convention Center", "user": "Pianta", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126975309}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Came for a meeting, after never having heard of this property, and left thinking that I had been to a gigantic place that had been constructed for convention/meeting purposes. Its a bit like Disneyland for meetings: enormous, polished, everyone happy and wanting to make the experience good, with a full measure of shopping venues within that I'm not sure what to do with... There are a fair number (or will be a fair number) of shops that seem to cater to tourists, but I am not sure who is going to come to the nation's capital and want to spend the entire trip inside. I arrived very late at night. The front desk staff were very pleasant. Unfortunately, the walk from the elevators took literally 20 minutes and I didn't even get lost. If it were humanly possible to be farther from the elevators in this behemoth of a place, I am not sure how. That said, the next day, when I stumbled upon alternate elevators, it was fairly easy to get around. The open multi-level atrium was light and beautiful, with a gorgeous harbor view. The food was silly expensive and not that great. There was still construction of some of the shops. Again, not sure who is going to keep the dollars flowing there. Just outside the entrance is a pedestrian area, again, very new and clean with a nice variety of shops and cafes and restaurants all against the harbor. As a former resident of Washington, DC, I had been dismayed at the disappearance of a famous statue called \"The Awakening\" on the waterfront in DC. What a pleasant surprise to find that it has been placed along the water's edge in the commercial area here, about 5 minutes from the Gaylord's front entrance. For those coming for a meeting, there is plenty here to keep you fed and busy, but I wouldn't use this as a destination if seeing the highlights of Washington are your goal.", "title": "Huge doesn't being to say it...", "user": "DenverDoctorMom", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 126939285}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This hotel is so pretty. If possible ask for atrium view. Amazing rooms. Clean. I was not overly excited about the sports bar. Food was bad and VERY pricey. Comfortable rooms.", "title": "Beautiful hotel!", "user": "Yorkdog", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126873359}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "But there are many restaurants right outside the hotel. So I recommend not eating at the hotel. Very pricey.", "title": "good hotel for a convention", "user": "azpNewYorkCity", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 126841532}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Very nice hotel but you pay for it!", "title": "More than a Hotel", "user": "barry11746", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126831135}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The hotel is quite beatiful along with atrum and its location along the Potomac. Bring or rent a bicycle to experience the bike paths across the drawbridge to ride to old towne Alexandria or Mt. Vernon.", "title": "Nickeled and dimed", "user": "seayou99", "date": "September 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 2.0, "rooms": 4.0}, "id": 39874656}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "But I digress...", "title": "Don't Believe all you read", "user": "dan5959", "date": "August 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38476366}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The place is stunning but I never got the \"wow\" factor as far as the service part. When you stay at a place of this caliber you would think the staff would fall all over you but they don't.", "title": "Overall a great experience with this property", "user": "flips", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 38413546}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "What turned me off was the $20 breakfast and even $4 for a cup of coffee at the coffee stand in the morning. There was quite a long line being this was the only place to get a cup of coffee. Then you have the National Pastime sports bar that has $7 beers, $9 hot dogs and $15 hamburgers. Parking (self park) is $20 and valet I believe is $28.", "title": "Not a great hotel", "user": "kathieorlando", "date": "August 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 2.0}, "id": 38391517}, {"rating": 2.0, "title": "The Gayloard is very nice but a transportation headache!!!!!!", "text": "The real problem is the place is somewhat isolated from the rest of DC and is about 10+ miles from downtown. I can't see the justification to these prices.---NOT at this location, downtown DC maybe but not here. At least Crystal City has acccess to the Metro, this place does not. Also the fitness center was way undersized for a hotel this capacity - it was always crowded with a wait for an exercise manchine.", "user": "JKriz1", "date": "August 19, 2009", "id": 38183179}, {"rating": 3.0, "title": "Just an average experience", "text": "Stayed for 7 nights and wasn't really impressed with anything about the resort. I would have expected more for the outrageous rate ($265) they charged. Room was just OK, a drawer pull was missing completely from the dresser, and the chair is the room was stained. I was equally disappointed with the hotel's staff. We needed a ride to the Nationals game and the valet insisted it was the same price to take one of the hotel's cars compared to a taxi. That was a lie ... their car was $15 more expensive ... we know because we took a cab back to the hotel. Overall, a hum-ho experience.", "user": "Karch72", "date": "June 21, 2013", "id": 164743048}, {"rating": 4.0, "title": "Beautiful for a conference, but expensive", "text": "I didn't stay in a room here, but I was here for a conference. It's absolutely gorgeous! That being said, it is quite pricey. The lunch \"special\" at the deli was a sandwich or salad, chips, and a drink for $10. There is also a steakhouse restaurant that I'm sure is even worse.", "user": "Leah W", "date": "June 20, 2013", "id": 164619506}, {"rating": 4.0, "title": "Nice Hotel", "text": "I would recommend staying at the Hampton Inn across the street. You get a lot more for your money, and it's still right next door.", "user": "Annmarie D", "date": "June 19, 2013", "id": 164543141}, {"rating": 4.0, "title": "Great hotel near DC", "text": "I stayed at the Gaylord as part of a military conference in May and was very pleased with the hotel: service, cleanliness, amenities.", "user": "VirgPolicarpio", "date": "June 19, 2013", "id": 164501921}, {"rating": 5.0, "title": "Excellent Property and Extraordinary Staff", "text": "Since the room cost was part of a contract I never saw a bill so I cannot comment on the fees that other reviewers have commented on. I have seen those at other hotels and find them annoying, so I know that I would have found them annoying here as well.", "user": "JustWanted2Share", "date": "June 19, 2013", "id": 164501783}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I stayed at this property to attend a conference. Will not recommend it to any friends or family. It is really not a resort, even though it offers a little bit more than a typical hotel. The atrium, the hallway, the elevators, and the conference center are in great condition, but the hotel rooms are not. The atrium room I had on the 16th floor is small with worn-out, dirty carpet. I brought my swimming gear with me, thinking that I may be able to do lap swimming there. It turned out that the pool is only 3.5 ft deep throughtout and is really just a kids pool despite its good size.", "title": "Beautiful Common Area, Average Hotel Room", "user": "Sara S", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 138110942}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "my family and i (including children aged 11, 7 and 5) stayed at this hotel for a week in early July as we were there for a convention. The start was quite eventful as we arrived in DC a couple of days after the really bad thuderstorm that knocked out power across the area. We arrived directly in DC after a 24 hour long flight only to be told that the hotel was without power as their standby generator stopped working. It was severely hot and we were utterly exhausted. the staff was quite friendly and they were distributing free mineral water and chips for everyone at the hotel which was a nice gesture. We initially booked two connecting rooms on the ninth floor but since the eleavators were not working they gave us two very distant rooms on the 4th. the rooms were nice but its a maze when you want to get from one room to another as this hotel is HUGE!! Anyway, after the power came back on they moved us to the ninth floor and the rest of the trip went very well ... the hotel is a bit pricey along with the food. The breakfast buffet was good and worth the price. Nice swimming pool as well. We watched the 4th of July fireworks from the river and that was good. Location is nice but its quite a distance from downtown and other areas (approx 30 mins by car and taxi charges around USD 70 to get there and back). There are a few good eating places and a few shops at walkign distance though. Overall a nice place for a convention but would not advise if visitng DC for fun and exploration.", "title": "the bigger the better ...", "user": "SohailOmar", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 138104586}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Great service, only downfall is that it is absolutely huge. Great for conventions, but overwhelming. The atrium is really quite impressive and I spent time walking around the grounds which are upkept beautifully.", "title": "This hotel is huge", "user": "Boorad68", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138090628}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I actually live not too far from the area, but stayed at the Gaylord National for a work event. I must say, the entire experience is first class. Upon checking in the young lady at the counter asked me for my identification and credit card (to guarantee incidentals). Before I could pull things out, a manager walked up to the desk, pointed to the screen and said, \"sir, I apologize, I just need to see your identification and you are all set, your charges will be guaranteed to the master account.\" I knew that should have been the case from the beginning but the manager was perfect in pointing it out to her. Upon checking in, she told me I had been upgraded to a suite. I walked into the room and it was a very nice room, with a corner window overlooking the river to the front and across to the main area of National Harbor. Great view! I was given comp'd water each morning, fresh fruit upon arrival, turn down service and a host of other amenities. The hotel was very clean and upscale and completely what I was expecting. The service was amazing, from the wait staff, to the groundskeepers, everyone was great. The hotel has a few restaurants on site, the key here, go to Old Hickory for dinner at least once, the Ultra Pose nightclub was pretty cool and also make sure you visit the sports bar, very good strong drinks and a good place to hang out at.", "title": "Great Location, Great Hotel", "helpfulness": 1, "user": "regjr13", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138090280}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Overall, I thought the location is great, wonderful views, great service – keep in mind, this is a very large hotel, so, bring comfortable shoes to walk, the elevators are pretty far from most rooms.", "title": "Nice conference hotel", "user": "Kdelos", "date": "August 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 137960134}], "location": {"country": "United States", "city": "Oxon Hill"}, "stars": 4, "variance": {"poor": 208, "average": 365, "very good": 595, "terrible": 147, "excellent": 664}, "aka": "Gaylord National Hotel Oxon Hill", "slim_ranking": 0.375, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "Newly opened along the banks of the Potomac, the Gaylord National Resort & Convention Center is the newest monumental addition to the national capital region. With 2,000 luxurious guest rooms, including 110 lavish suites, and 470,000 square feet of meeting, convention and exhibition space, it’s the largest combined hotel and convention center on the Eastern Seaboard. Here, guests will also enjoy four signature restaurants, a 20,000-square-foot spa, the area’s hottest ultra lounge, elegant retail shops and a magnificent waterfront promenade boasting a full-service marina and views of nearby Washington D.C. and Old Town Alexandria, Virginia. Gaylord National will be the cornerstone of the highly anticipated National Harbor project, a 300-acre waterfront destination offering world-class dining, retail and entertainment venues in Prince Georges County, MD."}