{"user_rating": 4.0, "review_count": 2153, "name": "Gaylord Palms Resort & Convention Center", "reviews": [{"rating": 5.0, "title": "Great", "text": "This is my fourth night of a five night stay. I couldn't be more impressed with a facility. This hotel is lovely and grand in every way. I followed the advice of an earlier trip advisor review and requested an outside room, for quieter evenings. The inside rooms have french doors opening out to the lovely atrium. It's a fabulous space, but they do perform shows every night, and the could get irritating if you are here for more than a night or two. Right now the hotel is doing their Christmas show, which is actually wonderful (but not if you have to listen to it night after night). Food and service at the Villa de Flora is very good for a buffet. They do try to change many of the dishes nightly. The parking lot is a bit of a walk, but I am not sure how it could be otherwise. The pools and pool areas are lovely. Overall, you could pay a lot more for a lot less! This hotel is extremely well located to get to the Disney parks. While I am not here for that, and probably won't go to any, I would recommend it for it's proximity if that is what you are here for. But if you are not, such as me, you can avoid all the Disney places very easily.", "user": "regalaone", "date": "December 4, 2005", "id": 4161180}, {"rating": 5.0, "title": "Pure Heaven", "text": "My husband and I stayed at this hotel for our anniversary. If you are looking for peace and relaxation with a touch of beauty this is the place. The rooms and halls are so quiet you almost feel like you are in a library. We had an Emerald Bay room with a balcony. The hotel had already decorated for the holidays which just added to the beauty of this hotel. Then there is the entertainment of Christmas carols.", "user": "A TripAdvisor user", "date": "November 26, 2005", "id": 4144545}, {"rating": 4.0, "title": "Very Nice, But Way Over-Priced", "text": "As for the staff, they are top rated. They add all the final touches to this beautiful hotel. Everyone is friendly with a smile and a hello. Not just the ones that have to interact with you, but the ones that you pass throughout the hotel.", "user": "Tall_Texan_Dallas", "date": "November 21, 2005", "id": 4131356}, {"rating": 2.0, "title": "Not worth the money, did not meet expectations", "text": "And if it is food that you are looking for, look no further. We had the most incredible dinner at Old Hickory Steakhouse, everything is ala carte but well worth the experience. The breakfast buffet is also wonderful.", "user": "SwimGal40", "date": "November 15, 2005", "id": 4117924}, {"rating": 4.0, "title": "Great Place if you Avoid the Extras", "text": "I have always been able to find some small flaws in other hotels, but this one is at the top of the scale!", "user": "A TripAdvisor user", "date": "November 11, 2005", "id": 4105728}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This was our 2nd. time visiting Gaylords for the Shrek Ice. Last year my wife and I & our youngest daughter & her friend came over from Daytona and truly enjoyed it & had a great time If I remember correctly I think we paid somewhere around $20.00 for adults & maybe $18.00 for kids (under $80.00) for all of us then of course they sneek in the $13.00 +TAX for parking? But last year they did at least give every person a complimentary coupon for a free hot chocolate afterwards. And the show last year seemed to be a lot bigger & nicer with more characters & sculptures & more variety. And the ICE afterwards last year was SO MUCH nicer than this year, they had games the kids could play and win tickets , they gave away prizes , they had ice slides and just so much more the kids could do and enjoy. This year ICE was extremely small and very boring for adults and kids alike, we heard numerous people talking about both the Shrek the Halls and ICE about wow this is it this year? And not only that we paid $160.00 for 4 of us to go this year plus that sneaky $13.00 + TAX parking fee , and the $20.00 photo. Took us less than 13 minutes to go though Shrek The Halls and we struggled to keep the kids in ICE for 20 minutes they were bored to death, nothing to do. AND NO HOT CHOCOLATE this year. So to sum it up it cost us $193.00 for a 33 minute visit to Gaylord this Christmas and none of us or anyone else were heard talking about there experience thought it was worth it this year. Once again looks like GREED is taking over and ruining something else in Orlando that started out to be such a great thing. Last time for us and many others im sure. Thanks Gaylords but No Thanks", "title": "Never Again... Way to take a Good thing there Gaylords and completly run it into the ground..", "helpfulness": 2, "user": "Dan K", "date": "December 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 121815401}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I was here for a 3 day professional conference. It really is made for families looking to have a starting point for Disney. Rooms are quite comfortable and there is a good selection of on-site restaurants, Like most Orlando resorts, you need a car but being somewhat further away from Orlando than other properties, it is not an option. Except for Disney, everything is at least a 10-15 min drive.", "title": "Nice place, but could do better", "user": "Jersey_Gourmet", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121805592}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Have been to this hotel a few times for Ice event, but have never stayed in a room. Ice is amazing. Hotel is expensive, but got a good deal on room stays site. On site restaurants expensive, we brought sushi & beer from Publix & dined in our room. Large hotel not hard to get around after you figure out the layout. Only stayed there because of the discounted rate & Ice attraction. Beautiful hotel, lots to see there, but very expensive. If its a special occassion or event splurge, otherwise go for the day & walk around. Staff very friendly & accomodating, rooms clean & large, but nothing special.", "title": "Special event hotel", "user": "srobbin", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121777679}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "Enormous convention hotel that is impossible to navigate without getting lost. Rooms, service, and food are fine but greatly overpriced. Hotel is isolated and one cannot go for a walk outside anyplace. A car is mandatory but parking fees are outrageous. Indoor atmosphere with balconies overlooking faux rivers and walking paths can be intriguing in terms of architecture but are \"over the top\". Indoor alligator feeding? Please!! Indoor flower gardens? In Florida?? No reason to stay here except if a meeting is scheduled.but even then, it would be less stressful, more flexible, and cheaper to stay offsite and drive back and forth.", "title": "Overpriced and over the top", "helpfulness": 3, "user": "Smeisel2", "date": "December 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 121717008}, {"rating": 3.0, "title": "SHREK THE HALLS VERY COOL! ICE ATTRACTION NOT THAT GREAT", "text": "The Shrek the Halls display was very cool (no pun intended). It's quite chilly, but very neat to see all the figures made of ice. The ICE attraction with the snow was very simple. Young children that have never seen snow would appreciate it,but that's about it. Our 9 year old was very bored. Thought the prices were quite expensive. Plus it's $13 to park...ugh!", "helpfulness": 1, "user": "Girlie410", "date": "December 13, 2011", "id": 121712423}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Very well appointed rooms, we had a great view of the atrium and a nice balcony. The adult pool was beautiful! Very relaxing and plenty of umbrellas for shade. The poolside service restaurant and bar (Sandbar) was very accommodating. We came for a conference and the only drawback was that the food that they served was lacking in flavor and chicken breast seemed of poor quality being fatty. I noticed that the poolside food was also bland like the guacamole that came with the chicken quesadilla had no flavor whatsoever. I also had a grilled mozzarella, tomato with pesto sandwich and the tomato was the end of the tomato, this was disappointing was expecting better quality for the price of the food. We enjoyed Wreckers sports bar and visited twice for the hockey games that were on, we had only drinks here and service was excellent. The hotel really goes out of its way with their (Consider it done service)!! I would happily stay here again we enjoyed our time here immensely.", "title": "Beautiful Resort", "helpfulness": 1, "user": "nstadler", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164545195}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We really enjoyed the Gaylord Palms. The scale of this hotel is incredible. Rooms were very nice and we encountered great service just about everywhere. Be warned though - extras can be pricey. Parking and resort fees added almost an extra $40/day. Also, eating and drinking are expensive ($7.50 for a beer, $10 for a mixed drink). If you are prepared for that, you will have a great stay", "title": "Great Hotel", "helpfulness": 2, "user": "rktj", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164530887}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "What a fantastic addition to the Marriott Hotel group!", "title": "Way To Go Marriott!!!", "helpfulness": 5, "user": "castmember", "date": "June 18, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164448650}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Stayed for 4 nights with our 8 year old twins and it was great. We are Marriott Gold members and we were upgraded to a suite which was probably one of the nicest rooms we've ever stayed in. PERFECT for families. Almost too much room (not that I'm complaining!!). I say that to persuade anyone considering a suite to go for it as it's completely worth it when traveling with kids. I don't know where they get their sofa beds, but they are unbelievably comfortable. It had a real mattress which almost felt like memory foam. My kids slept extremely well on it (not usually the case with sofa beds). The only room letdown was the (stupid!) rainfall shower head. Note to all hotels: a low-flow rainfall shower is NOT luxurious. It's annoying and most likely a waste of water as you have to take a much longer shower than normal in order to feel clean/wash your hair.", "title": "Beautiful property, amenities but walls a little thin", "user": "Edward L", "date": "June 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164392454}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The pool area was top-notch. The mini water park was a huge hit with the kids and a perk for parents who just want to relax .... plenty of loungers in view of the area so you can relax if your kids are old enough to be somewhat on their own (lifeguards are stationed at the top and bottom of the water slides). The main family pool was also a lot of fun (if not a bit too small for the size of the hotel .... VERY crowded). They had games every hour for the kids which were VERY well run (not easy with so many kids in attendance). A resort or cruise ship atmosphere for sure. The adult pool is tranquil as promised and a wonderful spot to relax and get away from the craziness of the family pool. The service at the pool was good considering the crowd. Poolside food was what one would expect at a large resort (average, slightly overpriced, not notable, but fine) although I will say I appreciated the healthier options, especially on the kids menu.", "title": "Beauty and Comfort", "user": "gg731", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164276047}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Gaylord Palms is amazing. We were lucky to stay for a weekend free of charge. The place is huge and beautiful.", "title": "We won a weekend stay at this resort/hotel..", "helpfulness": 1, "user": "laplaya00612", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165670863}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I believe it has two or three swimming pools. Our stay was amazing. We had room service one time, and it was awesome. We also ordered lunch one day by the pool. Prices were reasonable and food was good.", "title": "Good Hotel", "helpfulness": 1, "user": "Laikipia", "date": "June 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 165595799}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We did not eat dinners in the hotel restaurants. We went out of the resort/hotel to eat most of our meals. Definitely recommend it.", "title": "Expected more", "helpfulness": 1, "user": "terryg517", "date": "June 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 165576128}, {"rating": 5.0, "title": "Always the right hotel", "text": "Treated well by the staff from the beginning to the end. Great place for family - well designed pools and hotel layout. Our rooms that faced the atrium provided a great view of the superb architectural design and layout of the gardens, several restaurants and shops within the hotel. Breakfast is not included in your reservation but the restaurants provided great choices.", "helpfulness": 1, "user": "adam-kelley", "date": "June 27, 2013", "id": 165482586}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The Gaylord has always been known as a nice hotel. I have spent time at other locations. I was a little dissapointed with this location though. It was very pretty on the inside, you can tell there was a great deal of time and money spent on the flora and fauna. What did make me a bit upset was the lack of cleanliness of the room, and in particular the bathroom. There was hair on the floor from previous guests. The sink counters where not clean. So it may be a bit concerned about the rest of the room. It was cleaned the next day. The size of the room was no more than a Hampton which I had had larger ones at other locations.", "title": "Staff needs better training, restaurants need overhaul", "helpfulness": 4, "user": "2BOYSMOM44", "date": "June 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 165013650}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "First visit to the Gaylord Palms-- took teens to see the Ice! and Snow! shows. The hotel is beautiful and the attractions were outstanding, particularly Ice!. Yes, it can be a little pricey, but I think that is the be expected--the Palms is more of an experience than a hotel. Staff was exceedingly friendly, and we appreciated being able to store our luggage and keep our car in valet parking the day after we checked out so that we could see the shows. Grounds/hotel were decorated so beautifully that we spent considerable time just taking in all of the Christmas decor. Ate at the Sunser Sam's restaurant, which was okay--my children enjoyed the nachos made with potato chips and the pulled pork sandwiches. I would definitely stay here again--a great place for a weekend getaway!", "title": "Great Place for a Getaway", "user": "EconMom2", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121889832}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This resort is beautiful, especially now as it's decorated for Christmas. Our room was spacious and very clean. Very helpful and friendly staff. It can be quite a walk from your car to your room though and we thought the resort fee and parking charge per day was a bit high.", "title": "Beautiful Resort!", "user": "321Shopper", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121887987}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We went to see ICE - Shrek the Halls at the Gaylord Palms and it was excellent. It is so awesome to see all of this since I have always wanted to go see the Ice show in Harbin. This show will have to do for now. It is so neat to see what can be done. For the best experience I recommend to watch the video explaining how it happened at the beginning of the show and then take your time admiring the show as it isn't that long. Also make sure to bring gloves, a scarf, and a hat. The jackets they provide keep your body warm, but they don't keep your fingers, nose and ears warm. Bring a camera with a full battery and have fun!", "title": "ICE - Gaylord Palms", "user": "FlG8rGirl_05", "date": "December 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 121870245}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Very fun family experience!! The hotel has so much to see just walking through the beautiful atrium!! Ice exhibit was a big hit...just fabulous..our 7 year old daughter at the time loved it!! Would highly recommend!!", "title": "Loved ICE exhibit and the beautiful atrium", "user": "vicki3", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121865325}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The concept and execution of ICE has really fallen while prices continue to climb so unless you're a family with young children desperate to see ice/cold you're better off skipping the event. The hotel and resort grounds are fantastic and worth a night/weekend just to see that. You're not going to leave with much leftover cash since parking/food/room etc all grab what they can, but a great property and worth a visit.", "title": "Hotel/resort is fantastic but ICE has fallen as a worthwile addition", "helpfulness": 1, "user": "skip h", "date": "December 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121851573}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stayed here three nights for a convention. The hotel and convention center were beautifully appointed and I found the staff to be very helpful yet genuinely friendly. The hotel atrium is truly quite spectacular! However I was quite exasperated with the $15.00 to $23.00 per day parking fee. This is Orlando not Midtown Manhattan! The restaurants were WAY overpriced for the quality of the food offered. I ate at Wreckers Sports Bar (a burger and fish/chips with two sodas was $44.00 before tip) and Sunset Sam's (four ceasar salads, a plate of nachos, a BLT sandwich, one seafood pasta, one order of mussels, and four sodas was $152.00 before tip). The food was comparable to Chilis, Applebees, or Fridays only with a very hefty price tag. I actually felt a twinge of guilt when I turned in my expenses for this trip. I have stayed in some very upscale places on my own dime but this resort would not be one of them.", "title": "Very nice resort...way overpriced in some areas", "user": "MJC64", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 132590003}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "my flight was very late getting in due to technical issues, so when i rocked up at 3am, I had no room. Matt Gordon, Assistant Front Office Manager bent over backwards, found me a recently vacated suite, had Housekeeping up there at 3:30 cleaning it and put me in there for my entire stay at no extra charge. To make things even better, he even gave me vouchers for transportation to the outlets the next day, and that was without me complaining...talk about service.", "title": "Gorgeous Surroundings, great staff", "user": "cathie13", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132559073}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The resort is gorgeous, though it was packed with tourists and conference attendees. The restaurants can be a bit expensive, ($40 for a steak, no salad), but the sports bar is reasonable. They even have their own baby alligators, cute as but don't try to pet them.", "title": "Good for a Convention", "user": "chillinfool", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 132547441}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Shuttles are provided to Disney so it's not too bad.", "title": "Beautiful Hotel", "user": "kjones9854", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132544079}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "One thing I can warn you about is The Florida Express Bus, do not use them, stick to Mears, much cheaper and better service if you need transportation to/from the airport or other towns.", "title": "Beautiful Resort and Lots of Great Shopping !", "user": "mayrealtor", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132522032}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Let me start with my one complaint - the mid-afternoon dining options are terribly limited. I just don't understand why a resort this size wouldn't have choices for people might arrive late afternoon. OK - two complaints - dining options are not cheap.", "title": "Neat place", "user": "otsthedog", "date": "December 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122109762}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "That being said, it's a nice resort. I guess something has to pay for the alligators and turtles and the goldfish. Gaylord has done a nice job with the indoor sightseeing. Also, there is a nice-sized outdoor pool and waterslides.", "title": "Gaylord Palms Shrek the halls", "helpfulness": 1, "user": "mp5676", "date": "December 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "service": 4.0}, "id": 122103546}, {"rating": 1.0, "stay_parameters": "Stayed December 2011", "text": "I wanted to get a ride over to Universal Studios to see the haunted houses (around 6 p.m.) - this being right before Halloween. Since I didn't reserve in advance (by 2 p.m. - not having arrived until 3 p.m.), it was quite an ordeal getting to know whether transportation could be arranged. It was, in the end, so we were happy. But, the rules seem a little restrictive.", "title": "Totally overrated", "helpfulness": 2, "user": "crazycray", "date": "December 25, 2011", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 122093825}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The rooms are also nice. I had one overlooking the atrium which is a good view. I don't think the parking lot is as good. Compared to the Gaylord Opryland, this one is much more compact --- but, in a good way --- you didn't feel overwhelmed by the property.", "title": "Everything It Advertises.....AND MORE!!!", "helpfulness": 1, "user": "sthomas0616", "date": "December 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122059447}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Overall, a pleasant place.", "title": "Almost perfect", "user": "loren y", "date": "December 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 122055925}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "We bought tickets through group on and no where on the ticket did it say that you had to wait to make your groupon into a real ticket we waited waited over an hour and a half to get tickets to go in by the time we did this we hardly had any time to look at the ice because we were walking fast just to get it all in andl no where on the groupon did it say that your had to pay $12 to park I hope this will get somebody' s attention because I dont think we will come back", "title": "Ice and group on", "user": "Shootersgirl", "date": "December 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 122049441}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "It was ice...there's no doubt about it. Is it worth $15 - $30 a pop to see? That's debatable. You can clearly tell that the artists are amazing at what they do. Just didn't seem like enough for the price and they stick you for a $13 parking charge for the few hours you are in there. Saw the Christmas rock show and that was entertaining, but will most likely skip it next year.", "title": "Ice...", "user": "peakprfrmr", "date": "December 22, 2011", "detail_rating": {"value": 2.0, "service": 4.0}, "id": 121995879}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We just came back from staying at Gaylord Palms. We stayed their last December and we thought this ICE! was nice but it was one of those things you only needed do once. Then this summer, the DreamWorks Experience was announced to be the new theme of ICE!. Due to my kids, 5 & 8 yrs. old love of the DreamWorks movies, we hesitantly decided to do it again and booked the two night package. I thought the package was pricey but considering the only full DreamWorks Experience with characters is the cruise (which is a lot more expensive), I booked the package. Surprise, Surprise... it was a totally different experience that the typical ICE! events and I am glad I booked it. We arrived late Sunday night to the beautifully decorated hotel. Check-in went smoothly and we arrived and in our rooms fairly quick. Our rooms was “recently renovated” and boy, what a difference from last year. The room we had last year was dark and slightly depressing. The renovated room we stayed at the last few days was bright and modern. The only complaint about the room is that I found the bed slightly hard. I have a bad back and felt very stiff in the morning. The next day we went to Shrek Feast, a buffet at their Villa De Flora restaurant. Shrek, Fiona and Puss in Boots rotated around the restaurant to take photos and interact with guests. Patrons were given green ogre ears after they have been sworn in as honorary ogres and wait for their server while drinking their green “swamp juice”. The hotel had Santa in the main atrium area to sit with kids and take photos (Parents cannot take photos and you’ll have to buy the photo you want to keep that memory). My kids and I roamed the hotel the entire day doing their polar bear hunt and the Puss in Boots quest for the Magic Beans scavenger hunt. In the afternoon, we moved on to “Holiday Hall” for the meet and greet with the DreamWorks characters… we went around not only once but twice at two times during the day. My 5 year stated his favorite part was meeting the characters and taking photos with all of them (Alex & Julian from Madagascar, Po from Kung Fu Panda, Shrek & Fiona and Puss in Boots). At night was ICE! and the holiday shows in the atrium. (The bad part of this package is that you could only visit ICE! one time and SNOW! was a separate admission price). We were up down and all around this hotel the entire day; my kids were pooped by the end of the night. The next morning, my daughter’s delight, we were woken by a wakeup call from Donkey (from the Shrek movies). The food overall in the hotel is good (the ShrekFeast was very good) but it’s typical pricey resort fare (ex. $15 for burger and fries). If you are willing to leave the resort for food, you have many options one exit away on I-4. The service was good and I think the waiters at the ShrekFeast were in good spirits (especially since they were walking around with ogre ears all morning). The renovated rooms were definately an improvement. I will consider staying here in the summer when their new children's water park is completed. My son was already excited by their artist rendering of the new pool area that was on one of the walls. Was the whole thing pricey – YES! Did my kids love it – YES! So in the end, that was the reason I was there and it was well worth it for that reason. We also got dozens of great photos of the adventures of our stay… memories my kids will have for a long time!", "title": "The Dreamworks Experience at Gaylord Palms", "user": "RBabe", "date": "December 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 121935032}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "had a double ticket to see the ice sculptures and the snow.", "title": "Ice sculptures and snow?????", "helpfulness": 1, "user": "MAT34714", "date": "December 20, 2011", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 2.0, "service": 2.0}, "id": 121933676}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "the ice i feel was worth the money but if you have ever seen snow then please dont go to that. it was a very plastic playground with about a foot of crushed ice in the bottom , nothing like snow really, the snow side was not realy suitable for anyone over the age of 10 , my 2 youngest kids had 2-3 mins of sliding down a 1980's style long plastic slide. then we left.", "title": "Nice Property, terrible service, and way overpriced", "helpfulness": 5, "user": "TropicalTraveler78", "date": "December 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121896649}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "THIS HOTEL IS GORGEOUS! Some people on this site are just too picky! I didn't hear any noise or have any problems with check in! IN FACT THEY LET ME CHECK IN EARLY WITH NO EXTRA CHARGE OR PROBLEMS!!! the staf f is amazingly nice, and the hotel is HUGE , and quite fun to walk through! the ppols are massive and beautiful! only complaint: I wish they had more jacuzzis or a bigger one! :) AND mind you i have stayed at many nice hotels in disney including The GRand Floridian and it pales in comparison to service at the Gaylord!", "title": "Beautiful!", "helpfulness": 11, "user": "Christy K", "date": "April 29, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 1848929}, {"rating": 1.0, "title": "WILL NEVE STAY HERE AGAIN", "text": "I stayed here in april 2004 for a security convention, yes there are god reviews and the hotel is very beautiful, you have waterfalls,atriums, pathways, and kids love to explore the inside of this hotel. The problem is the reservation and check in, I paid for a whole day because they told me that if you want to check in at 7:00AM that you would have to pay for the night before hand. So I did, then when we got their all tired from the red eye flight at 8:00AM they said we ahve no rooms for you, we were so exasted and frustrated. I told them I paid to reserve this room the night before.", "helpfulness": 9, "user": "DogsLuvHotels", "date": "April 26, 2004", "id": 1839276}, {"rating": 4.0, "title": "Love the Gaylord!", "text": "They told me we have no rooms for you. I just could not believe they did this to me comming all the way from Los Angeles, I booked this months before hand. THe wrost pary is that they still charged us for the night we did even stay there, and it wasnt until 1:00PM till they had something for us. I asked them If I waited to more hours till 2:)) can we drop the last night fee ( that we didnt even stay ) and they said no sorry.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 15, 2004", "id": 1787443}, {"rating": 1.0, "title": "Agree completely with \"do not stay here!\"", "text": "The food is good, however this is more expensive then the ritz carlton, everything in this hotel is extremely expensive, once you see the landscape you will know why everything needs to be so high priced. They need to pay for the maintenance and the overall cost of this brilliant looking hotel.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 15, 2004", "id": 1787428}, {"rating": 5.0, "title": "Best Ever", "text": "I will never stay here again, I advise peple to be very careful with this corporation, specially if they have your credit card, they charged us about $70.00 at the bar for 4 shots of liquor.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 2, 2004", "id": 1760990}, {"rating": 5.0, "title": "Felt like living in a mansion", "text": "We stayed at the Gaylord Palms for 3 nights during the last week of December. The hotel was extremely easy to find right off I-4 and Osceola Parkway.", "user": "xqzmi", "date": "February 24, 2006", "id": 4500279}, {"rating": 3.0, "title": "Atrium wonderful, but easy to get lost & service hit and miss", "text": "Arrival/Check In: We arrived during the evening hours of Christmas day, stopped off at a Walgreens that opened until 9pm and stocked up on some snacks, breakfast foods, and drinks because the hotel had fridges in each room. We parked our car in their vast lot in the back of the hotel. Most of the cars were parked there to see their ICE show. We walked through the atrium and after a 5 minute walk, we made it to the front. (Truthfully, it was my own fault for parking first before checking in.) We had bought the hotel off of priceline, $100 a night and it was very well worth it. We requested a King room, higher up and facing outside because we read that it can get noisy from the shows that are happening in the atrium. Service was excellent and our requests were well received. We had a room in the Evergreen area, which was just what we wanted, and we were given a double treat...windows facing outside toward the pool area and windows facing the atrium. It wasn't that noisy. The Evergreen area has a separate exit/entrance to the parking lot so you do not have to waste time walking all the way around the hotel.", "user": "Belasaria", "date": "February 21, 2006", "id": 4475383}, {"rating": 5.0, "title": "Outstanding facility superior service", "text": "Rooms: Very clean, safe in room, fridge stocked with 2 bottles of disani water each day, computer with internet. The computer was most helpful--able to look up directions, request items for housekeeping, quick check out.", "user": "A TripAdvisor user", "date": "February 20, 2006", "id": 4474236}, {"rating": 2.0, "title": "Beautiful, but service suffers", "text": "Location: Hotel is sorta secluded. You do need a car in order to get to International drive and other areas for food. I did not eat in the hotel because it was just too expensive. It's very close to Disneyworld, only 5 minutes away. They have complimentary shuttle to Disney but I cannot comment on them.", "user": "StuwArt", "date": "February 15, 2006", "id": 4461308}, {"rating": 5.0, "title": "WOW!", "text": "Cons: The resort fee is about $10 per day but it doesnt cover the parking fee--$10 per night.", "user": "mordrid", "date": "February 4, 2006", "id": 4412608}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "You can tell the Gaylord Palms spends a lot on the ammenties, including having baby gators in the lobby atrium area however what they spend on the thrills they lack in the details in the room. I was surprised by just how average looking the room was, it seriously was on the same level as a Hampton Inn or Holiday Inn Express. When you pay the prices they are asking you would expect the details to be just as good as the look of the place, they werent. The ironing board in the room had more stains on it then I care to remember, chipped paint on the sink counter and corners, dust in and behind the nightstands.", "title": "Place was nice...except for the room", "user": "Dan2330", "date": "June 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 132974434}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Recent stay was for a convention so I can only give my view of this resort from that perspective. It is a beautiful, well laid out resort. The convention center is attached and easy to get to from the hotel rooms. Breakfast and lunch were provided during the convention and both were very good. Had lunch on arrival day at the Wreckers sports bar and it was good also. My hotel room was in Emerald Bay on the atrium side and was concerned about the noise however I never heard a thing. Never heard any noise from the neighboring rooms or hallway for that matter even though the resort was full. The room was clean, well appointed and the view was amazing. The only issue with the hotel was occasionally the elevators were slow and very busy due to full capacity of the resort. The property is far from the main drag of hotels and restaurants in the area so you would need a car. The resort has a great aquatic area with a separate pool for adults. It was the perfect place for a convention that provided more than just a hotel. Although it is a little pricey, I would definitely stay at this resort if I didn't stay on property at Disneyworld or Universal when visiting Orlando. Considering the size of the resort, it never seemed overcrowded.", "title": "Great Orlando area resort", "user": "SuitcaseMom", "date": "June 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 132854397}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed here recently as a last few nights of our vacation in a luxury hotel as a treat. After the initial wow factor on the setting and layout of a top class hotel....what a disappointment and rip off!", "title": "Watch out for hidden costs!", "helpfulness": 1, "user": "LindaBeckenham", "date": "June 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132837806}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Service was very poor, took ages to check in, over an hour to get luggage and had real problems with getting in and out of the car park which was a good 5 mins walk away.", "title": "Vacation in it self.", "helpfulness": 1, "user": "Baroguj", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132785590}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "To top it all as soon as we checked in they told us there was a $15 compulsory surcharge per night for internet access, use of gym (no use unless you take all your gear on hols) and a daily paper you had to go and pick up from somewhere yourself. Then we found out that it would cost another $16 per day/night to park in the hotel/convention car park.", "title": "All time favorite!", "user": "Hightekrednek", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132765886}, {"rating": 4.0, "title": "Theme Park-ish", "text": "I booked this hotel last minute to join my sister for an improptu weekend getaway. I paid 30 dollars extra for the executive room, but the difference wasn't noticeable. We stayed just one night and I brought my four year old son, who thoroughly enjoyed the octopus waterslide, dining on the ship in old key west, and checking out the gators and snakes in the everglades section. We stayed over on a Saturday, and a lot of the interior sections were closed off that evening for private functions which limited our mobility somewhat.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 29, 2004", "id": 1750589}, {"rating": 4.0, "title": "Amazing...with a few minor setbacks", "text": "Overall, it was a pleasant experience in a very unique resort. One suggestion for improvement would have to be directed towards the slide at the Marine pool. There is no lifeguard on duty and children were \"wild\" using this pool and the rules and regulations regarding the slide were not enforced at all. I would suggest that at least a monitor be placed at the slide to avoid accidents.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 25, 2004", "id": 1743080}, {"rating": 4.0, "title": "Nickel & Dime", "text": "We stayed at the Gaylord Palms for three nights, with an \"atrium\" balcony room. As others have said, it is VERY noisy, until they turn the waterfalls off at night. The place is absolutly BEAUTIFUL though. A perfect place for a convention, although we were there for DISNEYWORLD! A full week would be too much, considering the $7 parking fee AND the $10 daily \"resort fee\" the \"Everglades\" themed resturaunt is WAY pricey ($21 for a glass of merlot, $50 for steak w. no sides, or salad) BUT..the food is to die for! worth every bit of the $130 we spent on a AWESOME dinner. VEry very close to Disneyworld, with shuttles. Looked like a fun family place too. I would go back, but hopefully booking it on hotwire for $80 a night, so the resort fee is worth it...I would not pay over $150 a night if I were you (It is Orlando, home of the cheap hotel!!) HAVE FUN!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 2, 2004", "id": 1702075}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Just came back from my 6th or 7th stay at the Gaylord Palms during the last 10 years. While it always was a very nice hotel the new renovations have definately taken it to the next level. The new pool area is very nice and for those of you with small children you can skip a day at the water park and just stay at the hotel on day.", "title": "Outstanding", "helpfulness": 1, "user": "Timwestcreek", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133322402}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I arrived late and Sora was closing but the bartender still took the time to serve me, had breakfast twice at Villa de Flora great food at a fair price for what you got. Had dinner at the Old Hichory steak house and that was outstanding. Had the surf and turf it was like $67.00 but in my opinion worth it. If you are on a buget Villa de Flora also has dinner think its around $35.00 but that includes soft dinks and desert. The convention dinner was also excellent an accomplishment in itself as they were serving probably two thousand people", "title": "the Gaylord Palms Rocks!", "helpfulness": 1, "user": "Tom M", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133267487}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Great Hotel and Convention center!! We have attended two professional events around the country every year for the last 10 years and by far the Gaylord Plams is the best of the best. The staff is very helpful and friendly, the food and service is great, the floor plan is compact and convenient, and everything is reasonably priced.", "title": "You don't ever need to leave the resort!", "helpfulness": 2, "user": "TravelmamaCape", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 133208399}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "This was our second time all this luxury resort. What a beautiful property. There are several restaurants on site (all are very pricey). They just built a whole new pool and waterpark area for the kids and an adults only pool. The atrium is amazing and the baby alligators and fish are cool for the kids to see. The double queen room was clean and up to date. There are robes and slippers for use during your stay. The atrium view room with a balcony is worth the upgrade but I recommend that you book a regular room and ask for an upgrade when you check in, it is cheaper that way. There is a parking fee of $15 per night and a resort fee of $15 per night so be ready to spend the extra money. This is not the place to stay if you are just going to spend all your time at the parks but if you have a day or two to relax on your vacation then this is the place for you.", "title": "Great hotel but VERY PRICEY..", "helpfulness": 1, "user": "Fiveomom7945", "date": "July 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 133173496}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Ok so this was our second time staying at the Gaylord Palms. We stayed the first time a couple of years ago, and it was a beautiful hotel/resort BUT there was not a lot for kids to do. Plus it was very expensive. This time around we booked in the month of our anniversary, so we book one night and get a night free. Plus this time around they now have a kids water park! The water park and kids pool is AWESOME!!! Even adults can enjoy the water slides and awesome pool. They have a big screen for movies and a nice pool bar for adults .", "title": "Must stay destination on your Orlando trip!", "helpfulness": 2, "user": "RN4FL", "date": "June 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133031855}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Checked in late Thursday night, was hungry so ordered room service it was there in less than 15 minutes. Room was spotless as was the pool area and gym. This is a great hotel and staff is always pleasant.", "title": "Another great stay at the Gaylord Palms", "user": "Timwestcreek", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166105329}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "Decided to get away with a couple of friends for a \"staycation\" and decided on the Gaylord Palms based on recommendations. The resort offers a discount for educators ($99/night ) which is a great perk until all the taxes, resort fees and parking fees are added (more than $100). Front desk staff weren't very helpful explaining the self-parking process or which lot was closer based on our room. Fortunately the parking booth attendants were very helpful. Our reservation was for four persons but the room had supplies (glasses & coffee cups) for two. The beds and pillows were so uncomfortable that a good night sleep was impossible. The grounds, pools and inside foliage were impressive, however, based on interactions with front desk staff and incredibly uncomfortable beds I doubt I'll return.", "title": "Not as impressed as expected!", "helpfulness": 1, "user": "madtchr", "date": "July 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 166101349}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "I booked a stay for two nights with three of my friends, using the $99 teacher rate. I have walked around the resort before but never stayed over. The resort is huge,at times making it difficult to get to your room and/or navigate to any of the facilities.Self-parking was $18 plus tax per night and seemed really far from our room. There is also a $20 resort fee per day. That is supposed to include a shuttle to the Disney area, but the shuttle times were few and not convenient.", "title": "A little disappointed overall.", "user": "Jennifer K", "date": "July 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 166094696}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The room was nice, spacious and clean; however, these were one of the most uncomfortable beds I have ever slept in. Everyone in my party agreed. The pool area was nice and clean. We enjoyed the separate adult pool and jacuzzi.", "title": "Not the best Gaylord but pretty good.", "user": "Angie L", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 165818241}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Overall, the staff seemed pleasant and helpful but I can't say the same about the frontdesk staff. Although they were not rude, both encounters at the front desk were less than helpful.", "title": "LOVE THIS RESORT!", "user": "FML831", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 165818175}, {"rating": 4.0, "title": "Well run, comfortable hotel -- unique setting", "text": "I just got back yesterday from a 4-day conference at the Gaylord. They have conferences down to a science. Everything was coordinated very well. The meals, the party to Universal Studios... Considering there were 2000 attendees, the fact that you didn't have to wait for food at mealtime is amazing.", "user": "Sukibot", "date": "November 10, 2005", "id": 4105082}, {"rating": 1.0, "title": "Worst hotel experience Ever", "text": "The room was big and the bathroom luxurious. The setting is fun; kind of like a combination Biosphere 2 and shopping mall and botanical gardens. The pool looked inviting but alas, the conference took up all my time.", "user": "A TripAdvisor user", "date": "November 8, 2005", "id": 4094510}, {"rating": 2.0, "title": "Too noisy for the price", "text": "The food was decent although many of the food items seemed stale. Fresh-squeezed OJ at breakfast was nice as was the blueberry quick bread. Since the conference provided all the food, I did not suffer the sticker shock of the hotel restaurants.", "user": "Jode1", "date": "October 3, 2005", "id": 3985667}, {"rating": 5.0, "title": "Gaylord Palms was an incredible hotel!!", "text": "I was there three nights. Sunday and Tuesday nights were quiet--just the sound of the \"waterfalls\". However, Monday night, there were some noisy people hooting it up in the atrium. I was in the Everglades section on the 2nd floor overlooking the Old Hickory restaurant.", "user": "teejay_ford", "date": "September 29, 2005", "id": 3947817}, {"rating": 3.0, "title": "Extremely overpriced!", "text": "The room, however, did suffer from lack of attention to detail. There were no bottles of water in my room, the TV was unplugged, and the safe was broken.", "user": "flahagan", "date": "August 7, 2005", "id": 3743766}, {"rating": 4.0, "title": "Wonderful Place (expect to pay extra)", "text": "This is an excellent place to stay, as long as you are aware of the extra expenses. We read all the reviews before we stayed so we knew what to expect. The rooms are very nice and the atrium view is wonderful. I will stay again. Just make sure to drink the water, use the soap, lotion and coffee every day because they charge you the extra resort fee anyway.", "user": "LynnLake", "date": "January 18, 2006", "id": 4360956}, {"rating": 5.0, "title": "Wonderful - Different than other hotels", "text": "We paid $190.00 room with atrium view, $16.00 a day for valet parking (this was worth it) $10.00 a day for resort fee. All and all a Beautiful place to stay. Very Friendly Staff.", "user": "Magabi", "date": "January 8, 2006", "id": 4330824}, {"rating": 5.0, "title": "Absolutely Perfect!!", "text": "My husband and I traveled (no kids) to Orlando between Christmas and New Years (2005). We stayed at numerous hotels during this visit. In part because we plan to return with our children and wanted to 'scope out' the hotels. We have previously stayed at Gaylords in Nashville. This hotel is close to Disney (very close to the Wide World of Sports - WWS - complex). Because of WWS tournaments the Gaylord had tons of kids - someone at the hotel advised 600 kids playing at the WWS checked in on 1 night of our stay. We thought we would feel overwhelmed with kids but we didn't.", "user": "vrycmplctd", "date": "December 31, 2005", "id": 4313410}, {"rating": 4.0, "title": "Pretty nice place...", "text": "This hotel is great for adults and for families. The atrium (evergrades) is what sets it apart. They had performances in the atrium. They have shops, adult pool, family pool, 3 bars, etc. I could have simply stayed at the hotel all day and not felt like I 'missed' a thing. There was an ICE show in the connected Convention Center which looked amazing but we did not see it as we are from the north and have enough cold temperatures! We dined at the Old Hickory Steakhouse. Prior to going we read reviews. We parked ourselves with no problem and knew parking would be $7.50. Some reviews of the Old Hickory Steakhouse complained about the prices. Gaylords has 3 dining options. We elected to eat at the Steakhouse ($$$). My husband and I had a wonderful 'dining experience' at the steakhouse. I had one of the very BEST meals I have ever had in any restaurant. Yes, it was expensive but it was ABSOLUTELY supurb. Because they were booked we ate at the bar and actually ordered 2 appetizers and then split one (steak) meal. What I liked is that the waitresses suggested this when I mentioned that I didn't want too much. They brought an extra plate and were very gracious, funny. It was wonderful. I think, with drinks and tip, we spent around $60-80 and it was worth every cent.", "user": "Fred U", "date": "December 28, 2005", "id": 4309152}, {"rating": 5.0, "title": "The Gaylord Is Home", "text": "For adult entertainment we took a taxi ($15) to Downtown Disney (Pleasure Island). I thought this was an adult venue but it was overrun with kids. I didn't quite get that and I think it was because it was still earlier in the evening (7-8pm) and not 10-11. I did like the fact that the 'taxis' from Gaylord were more sedans (limo style).", "user": "A TripAdvisor user", "date": "December 7, 2005", "id": 4218420}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The hotel is centered around an atrium representing the flora and fauna of Florida - including the Gators.", "title": "Unique hotel near the theme parks.", "user": "KLfromMCO", "date": "June 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132757948}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The rooms have all undergone some degree of renovation. We stayed in a suite overlooking the atrium. The balcony was a great place to relax with a cup of coffee or wine.", "title": "Gaylord Palms", "user": "Carol R", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132671911}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The swimming pools have been upgraded. There's an adult pool and a family pool with a \"water park\". The water park is more of a water playground, but it's lots of fun for kids.", "title": "Nice Hotel for Families and Conventioneers", "user": "PAQ", "date": "June 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 132668667}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "There are lots of food and drink options on property, but be warned they're all a little pricey.", "title": "A Unique Property - Great For Conventions", "user": "OB1canOB", "date": "June 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 132655963}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The service was excellent. The room was clean and comfortable. It is a little isolated so facilities outside of the resort are difficult to get to without a car. The prices for food were high, but the food and service were good.", "title": "Promise not kept", "user": "Bia11", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 132590823}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Gaylord is beautiful and very well kept and if it were not for the less than favorable response we received when we reported not one but two encounters with a roach in our bed I would give this place a higher rating. Our first encounter came when I pulled the covers back to get into bed and the roach was in between the sheets. Of course I screamed, grabbed a shoe and killed it. Figuring it flew in from the atrium that surrondes all the rooms I was not too conserned. I slept in the other bed until 2 in the morning when ANOTHER roach crawled across my arm!", "title": "Good hotel, bad bugs", "helpfulness": 6, "user": "Robin B", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 164943960}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Again, killed it and proceeded to stay awake for the rest of the night.", "title": "Great last minute get away", "user": "Gina H", "date": "June 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 164926784}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Checking out that morning I mentioned it to the young lady at the desk and all she said was \"thats too bad\". I was frankly stunned by her less than caring attidude but did not persue it any further. I live in Florida and understand the bugs but for 245.00$ a night and over 800$ worth of services, food, etc I would have at least thought an apology was in order.", "title": "There has to be a better place!!!", "helpfulness": 1, "user": "Jcookie168", "date": "June 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 164833553}, {"rating": 2.0, "stay_parameters": "Stayed June 2013", "text": "Other than that, hotel was beautiful and pool was well kept. Spa service lovely and food was good.", "title": "If top notch service is important, don't stay here", "user": "GinnyBK", "date": "June 21, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 164731260}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Spent 2 nights over the past weekend and had a great time. We have stayed here on 2 other occasions and always enjoy our stay. Perfect place if your expecting a rainy weekend! Very relaxing even with the kids!!", "title": "Gaylord experience!", "user": "Alison V", "date": "June 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 164717037}], "location": {}, "stars": 4, "variance": {"poor": 156, "average": 279, "very good": 652, "terrible": 88, "excellent": 978}, "aka": "Gaylord Palms Resort And Convention Center", "slim_ranking": 0.0621118012422, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}