{"user_rating": 4.0, "review_count": 418, "name": "Georgetown Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We really enjoyed the hotel. I have been to DC many times and have stayed at much higher star hotels (this was our first value hotel visit in DC), however the value and location make this a great deal. We had a 1bdrm suite in the 30th street bldg. (603). Perfect for families and others. The size of the room was very nice. We were easily able to set up a portable crib in the living room area and have plenty of room for us to relax outside of our separate sleeping area. Bathroom was big with a standard size shower. While the wallpaper and decor was a little dated it did not detract from our stay. Room was clean and nice it had a flat screen tv in living area. Kitchen was nice apt size fridge, stove, oven, coffee and microwave. Parking was very easy for our suv (below hotel) use hotel elevator for access. Breakfast was slightly nicer than what I expected. coffee, cold cereal, juice, breads, pop tarts and cookies.(many great breakfast spots within 3 blocks) We only went 1 day but it was refilled and well stocked. Location is what makes this place really shine ½ block off M at the start of Georgetown. I was a bit worried after reading other reviews but would definitely come back again. Please understand that I rated this 5 out of 5 based upon price and star level of the hotel. They treated us nicely, maid service was there daily, parking access key was clearly not disposable and when given a parking key you must initial that you must return the key or there will be a charge. Parking comes with free in and out privileges. Front desk check in area is small and may easily get backed up, but we had no issues. Did not check out the exercise room which they described to me as small or the roof deck. There is a Trader Joe's food store 5 blks away with free parking. Dean and Deluca is only a few blocks away on M.", "title": "Great place perfect for a family", "helpfulness": 4, "user": "Philly_Bill", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32499407}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Outstanding value, very clean, super location, walkable upscale neighborhood with tons of nightlife, shopping, and restaurants. Drug store nearby. Short walk to metro station plus excellent bus service. Great for any business travel, extended stay or leisure travelers who like a great room that they won't be in much.", "title": "Very Good for the Money", "helpfulness": 1, "user": "Matt59", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30461622}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My wife and I spent 4 nights at the Georgetown Suites in late April 2009. This was our first trip to Washington and our purpose was leisure and sightseeing. We couldn't have been happier with our hotel selection. We spent a lot of time reseaching options in the $200/night price range, from the Georgetown area to the Convention Center area and everything in between. While we were there, we passed by most of the other hotels that we had considered and found ourselves repeatedly saying to each other how happy we were that we chose the GS. Some Highlights: Location (staying in the Georgetown area added so much to our overall experience - we loved it there), free upgrade from a studio suite to a one bedroom suite (we booked on Quikbook), the suite was very spacious - great bed and nice living area with comfortable furniture (note: we would recommend a one bedroom suite if staying several nights), 2 for 1 dining card given to us at check-in (only a couple restaurants participating but we used it for dinner one night and had a great experience), Circulator bus only 1/2 block from the hotel - we used it a lot, free wireless internet, curtious and helpful front desk staff, Trader Joe's within walking distance, and pretty easy access to the National Mall via bus (note: I'm a runner and loved running each morning along the Potomac River down to the Lincoln Monument and then across the mall. Some less than ideal features: continental breakfast was so-so (kind of what you might expect for a hotel continental breakfast ), fitness center very small with limited equipment and inconvenient access, kitchen cabinets old and worn and very few utensils (we had to ask for addtional silverware which was graciously provided by housekeeping). On the positive side, the kitchen was fully equipped otherwise and served us well for several eat-in meals. One final note - be aware they have two seperate buildings. We stayed at the main building. While we didn't go inside the other building (called the Harbour Bldg), it's location is not nearly as desirable as the main building.", "title": "A Great Choice", "helpfulness": 3, "user": "bmaxwell", "date": "April 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29024645}, {"rating": 3.0, "stay_parameters": "Stayed April 2009", "text": "Came to DC for the Cherry Festival and my sister and I wanted to stay at a hotel we would feel safe walking at night. Georgetown Suites was perfect for us. In less than a quarter of a block we were in the middle of M Street with its many restaurants and shops. The lobby could use a sprucing up, but the rooms were clean and comfortable and the staff was friendly and courteous. Our room faced the courtyard and it was VERY quiet at night. We took the red eye and the hotel was able to check us in early (about 7 am). It was nice to have a complimentary breakfast available to us. The Circulator bus was very convenient (only 50 cents for seniors) and the Georgetown Connector (between Rosslyn and Dupont Metro stations costs only 25 cents for seniors. We went to a performance at the Kennedy Peforming Arts Ctr and walked via the path by the river (easy walk). Also a plus for us were the two sinks in our bathroom - made it easy for us to get ready in the morning. The negatives: my husband had a hard time trying to leave a mesage because their phone message system wasn't working. We requested a wake up call but never received it.", "title": "Great location", "helpfulness": 2, "user": "addictedtotravel39", "date": "April 12, 2009", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27873176}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We chose this hotel mainly because of the location and the reasonable price for a hotel in Washington. And on those two counts it definitely delivered. Good access to tourist sites and great restaurants around the corner. Wonderful atmosphere in this part of the city whether you walk along the historic canal or on the M street with bustling city life! For that reason I'd recommend it - with some qualifiers as the hotel itself was slightly disappointing though still acceptable.", "title": "Great location, ok hotel, poor service", "helpfulness": 1, "user": "canadabaerchen", "date": "March 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 27070800}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "we booked the hotel with a very good rate (99$ parking incl.) and we saw the regular rate in the room.... 400 and something.... too much", "title": "Ok", "user": "marco.to", "date": "September 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 44346068}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Our room was very big: kitchen, sitting room with sofa, nice bedroom ( confortable bed), small bathroom and 2 flat tv. Furniture are a little old and you feel this oldness all around the room. Position is fantastic, you are in the middle of georgetown and 10-15 block to the white house. Breakfast was included but it is basic and you should fight to reach a table. All in All i reccomend this hotel at bargain prices not at 400..... last but not least: free business center (you can print and surf) and free wifi in the room!", "title": "Comfortable beds, slightly tired rooms but a good location", "user": "BzzBzz", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 40145910}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The hotel is in a very handy location both for down town Washington DC and for Georgetown. It is quite easy to walk to e.g. Dupont Circle in about 20 minutes.", "title": "Twenty years later", "user": "MemberfromPadova", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 39614386}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The room is a bit tired looking but the bed was very comfortable. The room had a safe, wifi (patchy) and a kitchen area with a noisy fridge. The staff at check in were helpful and gave me a room far away from the elevators, facing the back (as requested). The hotel offers free continental breakfast from 6.30 am, which is basically cereal and pastries, bagels and weak coffee, but all in all it is a decent way to kill early morning munchies and saves you finding a place to eat in the morning.", "title": "Much better than expected- a very pleasant surprise", "helpfulness": 1, "user": "jomoms", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 38410021}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Like most older hotels there is a shortage of handy power outlets and those annoying coat hangers that you can only hang in the closet (useless for steaming creases out of suits).", "title": "Comfortable, Clean, and Safe", "helpfulness": 2, "user": "ShannonMcGee", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36930276}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Very large rooms and the price is reasonable for the area. The rooms have a nice big desk for working and free internet access. For business travel this is a big plus. The rooms have a small kitchen. The decor is a little dates (circa 1980) but the rooms are big and bright and very clean. My room was next to the highway so the outside noise was noticable but did not ruin the stay.", "title": "Georgetown Suite Visit", "user": "arliberator", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 26660664}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "They do serve a free breakfast but I would say you should skip it if you can. Mostly cold cereal, old rolls, and bad coffee.", "title": "Excellent Value, Great Location", "helpfulness": 1, "user": "mattjamesBirmingham", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25496250}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We got stuck in DC for an extra week with a small child after he was diagnosed with chicken pox, and really wanted a self-catering apartment so we could entertain him during the day and have some time on our own at night (rather than just sitting in the dark in a small hotel room). So we were looking for a 1 bed apartment.", "title": "DC's absolute BEST!", "helpfulness": 2, "user": "My_viewNY", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25042503}, {"rating": 3.0, "title": "great location, quiet, spacious but shabby", "text": "Georgetown Suites was perfect. It was in a fabulous location and the rooms were exactly what we needed. It was a little rough around the edges- the furnishings were a little old fashioned, the dishwasher looked like it was one of the first models ever made, and the gym was ultimately 5 machines in a closed room deep in the basement of the building. But the good thing about this was that the emphasis was on functionality rather than presentation, and you didn't feel you were paying extra for something you didn't need. The value was excellent compared to the other places we were looking at, especially when combined with free wifi (although patchy at times) and a fabulous continental breakfast. And the service was great- they cleaned the rooms and our dishes, and even came up to pick the lock when our 2 year old locked himself in the bathroom!", "helpfulness": 2, "user": "Carolina924", "date": "January 10, 2009", "id": 23433314}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Overall a great stay, would definitely highly recommend it.", "title": "Excellent for doing you own thing, and selfcater if you wish", "user": "janesta", "date": "January 1, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23155035, "likes": {"liked": "— Location & price."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We loved this place, very spacious, nice kitchen, good breakfast, and the staff was just great. The bus line is extremely close, metro about 8 blocks away.", "title": "great accomodations", "helpfulness": 1, "user": "loc99", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35921141}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "We were to get a king bed and got a room with 2 twins and told it was the only room available. Parking was expensive and you were requested to leave your keys on the dash so someone else could move your car. The beds were sagging and uncomfortable. The furniture was old. The shower door was off the slider. It did have a nice kitchen that was fully equipped. The breakfast are was small, very crowded and noisy. Many guests were taking food back to their rooms. Nothing looked appetizing. Staff was friendly and helpful.", "title": "Uncomfortable beds, unattractive lobby, breakfast a free for all, noisy construction", "helpfulness": 1, "user": "allauction", "date": "July 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 35510954}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I have tried other hotels in D.C. when Georgetown Suites is booked and although I have paid more I have never been as comfortable or happy with the hotel. I highly recommend it!", "title": "My favorite DC hotel -I'm a regular", "helpfulness": 1, "user": "zoodlescrazy", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34302905}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We were not at all disappointed by our stay here at Georgetown Suites.", "title": "Very pleased!", "helpfulness": 2, "user": "KristineCG", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34282152}, {"rating": 3.0, "title": "Great value but very dated", "text": "The \"Goods\":", "helpfulness": 1, "user": "BayAreaTraveler01", "date": "June 29, 2009", "id": 33455881}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 2.5, "variance": {"poor": 25, "average": 54, "very good": 201, "terrible": 16, "excellent": 122}, "aka": "Georgetown Hotel", "slim_ranking": 0.581395348837, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Georgetown Suites is an all suite hotel located in the heart of Georgetown. Georgetown is a quaint neighborhood in Washington, DC with lots of unique boutiques and restaurants. We offer studio, one and two bedroom suites along with 2 bedroom townhouses and a 3 bedroom penthouse. All rates include complimentary continental breakfast daily, free wireless internet and free local calls. Georgetown Suites consists of two buildings, located a half block apart. Our Harbour Building is across the street from the Washington Harbour complex on the Potomac, which offers several waterfront dining options and a brand new outdoor ice rink. Our 30th Street building, is right off of M Street, just steps from the many shops and restaurants in Georgetown."}