{"user_rating": 4.5, "review_count": 328, "name": "George Brooks House B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The owner Will is a wonderful host and his breakfasts are to die for, he really knows how to treat his guests and I would go there over and over and recommend it to all my friends.", "title": "Tremendous host, great food and nice facilities.", "user": "mittenskittens", "date": "April 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28991263}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Beautiful house that's just down the street from the middle of town. Great back yard with a pool and very nice rooms. Quiet and cozy.", "title": "Comfortable, attractive B&B with an appetizing breakfast", "user": "LakeBluffian", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28942076}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Good place to get away from everything for a couple of days.", "title": "Great weekend getaway", "user": "DJT09", "date": "April 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 28430594}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We were looking for a getaway close to home, and the George Brooks House and St. Michael's proved exactly what we were looking for. The room was beautiful and clean, the owner helpful, the breakfast delicious with good company from the other guests. I hope to return as soon as I can.", "title": "A Perfect Weekend", "user": "Phillypeople", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 28174772}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The room was spacious and beautiful. Everything that we could have needed was", "title": "We enjoyed everything. The history of the property was very interesting", "user": "BigJNewJersey", "date": "April 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27285001}, {"rating": 4.0, "title": "Great place for a getaway weekend!", "text": "Warning - long review ahead as all of this is fresh in my mind as we just left St. Michaels!", "user": "NicoleandKyle", "date": "June 21, 2009", "id": 32810516}, {"rating": 5.0, "title": "Perfect place for a relaxing weekend getaway in a charming, historical B&B!", "text": "My husband and I arrived at the George Brooks House for a weekend trip. As we were passing through town, we wondered if perhaps we had made a mistake by not staying in town, but after about 5 min of walking around later in the trip, we were SO happy we didn't. Upon arrival, Will was cutting the grass and asked us to wait for a second. No problem, we were more than happy to take in the surroundings of the clean and large pool, hot tub (unfortunately, under construction while we were there), and simply beautiful gardens. Will welcomed us, checked us in and sat us down to talk about St. Michaels since this was our first visit. He wasn't shy to tell us which restaurants to eat at, which to avoid, and recommend a variety of fun things to do in the area, along with discounts.", "user": "kandjcoop", "date": "June 16, 2009", "id": 32448036}, {"rating": 5.0, "title": "Nice big house, big rooms with a pool. What could be better? Nothing", "text": "Our room was the 1st floor jacuzzi suite with a wonderfully comfortable four-poster bed and a jacuzzi for two. The quality of the linens and towels were high and they smelled so good, my husband and I almost asked what type of laundry detergent they used. Everything was very clean. I had a bit of an issue with the bathroom as there is not a large sink area to leave items out, but the pedestal sink was so charming that we made do. One suggestion would be to add additional lamps as it was difficult to read in bed at night even with all of the lights on. Or bring a reading light! Jacuzzi was fun and romantic with nicely scented bubble bath provided and big fluffy towels.", "user": "vacation4321", "date": "June 15, 2009", "id": 32357840}, {"rating": 5.0, "title": "Home Again in St. Michael's", "text": "Our only complaint (not really a complaint, just something you should be aware of) is that the 1st floor room is right next to the pool area, the outside porch, and a side door. The first night, a few of the guests were having drinks outside and were clearly audible until around midnight. The next morning, we were woken up at 7:30 AM by two guests having a loud conversation outside at the pool area. We could also hear breakfast being made and the side door being opened and closed a few times. It was fine for us because we typically go to bed late and rise fairly early, but if you need pure quiet to sleep or dislike being woken up, I would not select this particular room as it was definitely loud at times. But, we liked being right in the middle of the action!", "user": "WillandJulia", "date": "June 14, 2009", "id": 32303232}, {"rating": 3.0, "title": "Nice Room, but", "text": "Breakfast was more casual than many of the B&B's that we have been to - served at your leisure between 9AM and 10AM. They had self-serve coffee & a pastry (muffins the first day, crumb cake the next), followed up with a fruit cocktail, and then the main course of a lemon ricotta souffle on day 1 and a sausage & pepper frittata/quiche on day 2. Both were good.", "user": "dbrew1974", "date": "June 9, 2009", "id": 31954073}, {"rating": 5.0, "title": "Great place to stay!", "text": "Warm greeting at this beautiful and interesting house. Our room was great,, and we appreciated the modern amenities. The atmosphere was very relaxiing. The stocked drink refrigerator and ice machine was a nice touch. Breakfast was tasty. Our host (Will) was very helpful with restaurant recommendations and things to do.", "user": "udhens", "date": "June 9, 2009", "id": 31949599}, {"rating": 5.0, "title": "This B&B has it all, beauty, comfort, affordability, location & a gourmet chef / Joy & Pat Del Grosso", "text": "The Inn-Keeper, Will and his beautiful wife, made us feel so at home and they did", "user": "JOYSPAT", "date": "June 5, 2009", "id": 31653833}, {"rating": 5.0, "title": "Elegant, restful and peaceful - just what you want for a get-away.", "text": "everything to accommodate our needs. The rooms were so beautifully decorated. The breakfasts were a wonderful variety prepared with such special a special touch to each dish, I have yet to see at any B&B. It is easy to see that Will loves people and he does everything to make your stay one to remember fondly. We look forward to returning to St. Michael's again. We have been coming to St. Michael's for over 20 years and this stay at The George Brooks House will have us returning again and again.", "user": "kquilt", "date": "June 5, 2009", "id": 31638474}, {"rating": 4.0, "title": "Nice mini-moon destination", "text": "Joy and Pat Del Grosso (and) Emmy the cat", "user": "st123", "date": "June 5, 2009", "id": 31629572}, {"rating": 4.0, "title": "6th time in St. Michael's-this B&B has it all!", "text": "One of my favorite recollections - sitting with Will and Julia out at the covered patio sipping some wine and admiring the beautiful landscape design by the pool.", "user": "LancasterTraveler", "date": "May 27, 2009", "id": 30954672}, {"rating": 5.0, "title": "What a marvelous B&B!", "text": "We had a great time at the Brooks Bed and Breakfast. Will was so helpful and nice, the rooms were fantastic, and breakfast was yummy!", "user": "armayer81", "date": "May 27, 2009", "id": 30929563}, {"rating": 5.0, "title": "Setting, Staff and Services were Outstanding", "text": "The Setting, Staff and Services at the George Brooks B&B were outstanding. The B&B is convenientt to the town of St Michaels, MD with its lovely stores, shops, boating facilities and restaurants. It is also close to the homes of family and friends which makes it convenient for our many visits. We highly recommend the B&B to anyone who may be visiting the Eastern Shore of Md.", "user": "williata", "date": "May 26, 2009", "id": 30808443}, {"rating": 4.0, "title": "Nice B&B, very modern and close to St. Michaels, but be sure to read...", "text": "This was a very nice B&B and it was modern and clean concerning the room and bathroom. The service was good and the only thing I have to complain about was the fact that there were 3 cats that live in the B&B and I am highly allergic to them. Thankfully we did not do much but sleep there and even that got to my allergies but I know better now to check for future stays as to whether or not the place keeps pets around. I would not have stayed there had I known this ahead of time, so beware. Other than that, the place was excellent.", "user": "JITWTAL", "date": "May 23, 2009", "id": 30601806}, {"rating": 3.0, "title": "Did not meet our expectations\"", "text": "Unfortunately, the George Brooks House (we stayed 2 nights) did not charm us. The room was clean, but the bathroom sported mildew and a tiny shower. In messy uninviting public areas, the TV seems to be on all day. It was not very appealing.", "user": "LP55", "date": "May 18, 2009", "id": 30220102}, {"rating": 5.0, "title": "Great Bed and Breakfast in St. Michael's", "text": "Location outside the town's limits is not great, you could walk to town but it's better to drive; walking along the highway at night to get back to the B&B may be dicy. Breakfast at 9 was OK but basic.", "user": "Sreagan", "date": "May 5, 2009", "id": 29396378}], "location": {"country": "United States", "city": "St. Michaels"}, "variance": {"poor": 17, "average": 27, "very good": 78, "terrible": 6, "excellent": 200}, "aka": "George Brooks House Bed And Breakfast", "slim_ranking": 0.538461538462, "description": "Heritage Award Winner for Best Historic Restoration in 2001, the George Brooks House provides superb \"bed and breakfast\" and so much more just outside of town on 8 acres with the best swimming pool, hot tub and formal gardens in the area. Bedrooms have mahogany canopy Queen or King beds, TV/DVD, A/C and private bathrooms with custom tiled showers. Breakfast starts with pastry and coffee at 8 - 9 AM followed by a fruit course and then hot entree."}