{"user_rating": 5.0, "review_count": 606, "name": "Gerald's Place", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My wife and I needed somewhere central to stay for one night in Edinburgh and, by good fortune, an internet search led us to Gerald's Place. Having booked with Gerald and received details by e-mail, we expected something out of the ordinary and we were not disappointed! We enjoyed a warm welcome, a clean and comfortable room and bathroom with all the facilities we could possibly need, a complimentary box of chocolates, Gerald's art collection to look at, numerous books, magazines and videos to pass any spare time we might have had, information on things to do and see in Edinburgh, and the best breakfast we have ever eaten. In addition, Gerald was a charming, kind and thoughtful host who ensured that we wanted for nothing; we felt like family friends rather than paying guests and, having discovered Gerald's Place, we shall certainly return for a longer visit.", "title": "The best ever!", "helpfulness": 2, "user": "Argyll_resident", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10589066, "likes": {"liked": "— Friendliness and concenient location", "disliked": "— Shortness of our visit"}}, {"rating": 5.0, "title": "Gerald's Place -- Thank you!!", "text": "Gerald's Place was a wonderful stay for us. We originally booked 4 nights and extended it to 6. Gerald personally and warmly greeted us as we arrived from our long transAtlantic flight. He was thorough and helpful. Everything was clean and the room was well equipped with many extras like tea, biscuits and generously stocked fridge. The bed was particularly comfortable with high quality bedding.There was also a complimentary lap top and internet hook up available. Gerald treated us to a fine complimentary sample of whiskey. It was very conveniently located near bus and rail terminals and Gerald helped us book tours. Gerald's place was an easy walk to great shopping, fine restaurants, lovely gardens, the Castle and other historical sites.", "helpfulness": 2, "user": "HappyTravellers1011", "date": "November 3, 2007", "id": 10576166}, {"rating": 5.0, "title": "Loved It!", "text": "Breakfasts were both flexible and superb. Bottom line was Gerald's Place was a delight and figured prominently in our wonderful vacation in Scotland.", "helpfulness": 2, "user": "Champagne77007", "date": "November 1, 2007", "id": 10503079}, {"rating": 4.0, "title": "A Bonnie B&B in Scotland", "text": "Gerald's Place is as warm and charming as Gerald himself. We were warmly welcomed with a hug and a wonderful bottle of red wine: both of which were appreciated after traveling! Gerald's is warm, romantic and centrally located, plus he is knowledgeable about your needs as a traveler who is new to the area. We have already recommended Gerald’s' Place to several of the friends who are planning to travel to Edinburgh and recommended it as the \"only\" place to consider staying.", "helpfulness": 2, "user": "Travelgator22", "date": "October 24, 2007", "id": 10295867}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "During a recent visit to England, my wife and I took time out for a brief interlude in Edinburgh, booking a 36 hour stay at Gerald's Place, a charming bed & breakfast conveniently situated near the city center and just a few minutes by taxi from the train station.", "title": "Wonderful in every regard!", "helpfulness": 2, "user": "Holnessrtw", "date": "October 8, 2007", "detail_rating": {"business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10056261, "likes": {"liked": "— Gerald and his friendly, well informed manner", "disliked": "— Nothing I can think of."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "My husband and I and our three year old daughter stayed here over the halloween break for 4 nights. Its location was great, just a five minute walk from Princes Street which was ideal for us with a young child. We were greeted by Gerald on arrival with a great big hug which made you feel more like a family member rather than a paying guest! When he brought us to our room he had all the information on Edinburgh there that you could ever need as well as little pocket size street maps for our use.There was a large selection of teas and coffee available in the room and the bathroom stocked up with shampoo, shower gels, shaving gels etc...... This selection I have never even had in a hotel room before!! As for the bed, well,I have never slept on a mattress as comfortable in my life!!! The breakfast was brilliant. A large selection of fruit, cereal, yoghurt, fruit juices followed by tea/coffee, toast and cooked breakfast. The cooked breakfast was all grilled by Gerald while you enjoyed everything else and all the food organic. He has a large collection of books, videos, dvds and magazines all for your use also. I could go on and on", "title": "Home from home", "helpfulness": 3, "user": "SneevlyCo", "date": "November 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10937153, "likes": {"liked": "— The hospitality from Gerald", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "there is just so much to tell about this place. This bed and breakfast is Geralds home and was delight to stay in. The best I have ever stayed in anywhere. This was our third trip to Edinburgh and hopefully won't be our last and we would hope to stay here on our return visits. Thanks again Gerald!!!", "title": "Great B&B, but . . .", "helpfulness": 2, "user": "Charleytoo", "date": "November 11, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 10747699}, {"rating": 5.0, "stay_parameters": "Stayed August 2003, traveled as a couple", "text": "Although Gerald's web site leads readers to believe his two accommodations are equal, they are not. One is larger than the other and has ensuite facilities; the other smaller one has a bathroom in the hall. Which is fine, but my husband and I were given the smaller room while a single lady was given the larger, ensuite one. Which was still fine until I found out the other lady had booked three days ahead while I booked nearly four months ahead! We could not ask about this because Gerald wasn't even there. . . his sister Gloria was innsitting. She said she had no authority to question Gerald or his rules.", "title": "We loved Gerald and his place", "helpfulness": 2, "user": "smjy", "date": "November 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10738836, "likes": {"liked": "— Comfort of Bed, Breakfast; but, mostly Gerald", "disliked": "— We loved it all"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This said, we enjoyed our stay. The beds were fabulous, the location can't be beat, and Gloria was a nice hostess.", "title": "what a gentleman !!", "helpfulness": 2, "user": "twinkletoesOxford", "date": "November 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10665453, "likes": {"liked": "— Gerald........of course!", "disliked": "— nothing... it's perfect"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My wife and I had visited Edinburgh and its surroundings on four occasions in order to attend the Edinburgh Festival and Fringe. Each time we spent 3 weeks. We knew what we wanted in a B&B in that city, searched the web and came across Geralds Place. It was located in a lovely section of this great city opposite a delightful park; and within walking distance of some of the most popular venues. It was also a half block from a bus stop with buses taking you to all of the major venues for concerts, opera and theatre. It was convenient, as well, to museums and very intimate eating establishments as well as shopping and lovely views.", "title": "A Lucky Find", "helpfulness": 2, "user": "Samtmann", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10591348, "likes": {"liked": "— Gerald", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "I stayed during the festival, and he was most helpful in recommending shows, concerts, plays and restaurants. The breakfast was exquisite, and I've never stayed in a more comfortable room. The bed was so wonderful it could have been my own. Gerald is a wonderful host and I thoroughly recommend you stay here.", "title": "The Best in Edinburgh", "helpfulness": 4, "user": "Orla_PLondon", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11981274}, {"rating": 5.0, "title": "Weekend away", "text": "My wife and I stayed at Gerald's for a weekend only. The helpful and informative e-mails from Gerald set the tone for our stay. It was a cold and wet weekend but we received a warm welcome, including a bottle of wine waiting for us.", "helpfulness": 4, "user": "bhpUk", "date": "December 21, 2007", "id": 11871245}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The room was lovely and had everything we needed. There were some very thoughtful touches like access to a laptop with Wi-Fi , any number of pampering toiletries, as well as a large selection of teas and coffees in the room. The room itself was very clean and quiet and the bed was exceptionally comfortable.", "title": "Home from home comfort", "helpfulness": 4, "user": "UK_Basball_Fans", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11485049, "likes": {"liked": "— Comfort and welcome", "disliked": "— Too warm - should have turned the radiator down on arrival!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "We found the location to be very helpful and given it is so central, encouraged us to do most of our exploring on foot.", "title": "Gerald's, His Home is Yours", "helpfulness": 3, "user": "caartlover", "date": "December 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11282034, "likes": {"liked": "— The amazing hospitaity and location.", "disliked": "— No comment."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The breakfasts were tailor made for us and the service/assistance was pitched at just the right level.", "title": "Gerald is a gem!", "helpfulness": 2, "user": "upstatetravelers", "date": "November 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11126690, "likes": {"liked": "— Geralds personality", "disliked": "— rainfall"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "What can I say about Gerald and our wonderful stay there? My wife and I and our two closest friends rented both rooms for about a week in November, 2007.", "title": "Gerald is Edinburgh's Ambassador!", "helpfulness": 2, "user": "no1fcb", "date": "January 10, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "business": 5.0, "rooms": 5.0}, "id": 12503762, "likes": {"liked": "— There is only one Gerald and he makes Edinburgh magical.", "disliked": "— NOTHING."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Gerald's attention to detail is immaculate. He has carefully considered all the things one might want to do while visiting Edinburgh (please see pictures of some of the sites attached to this review), then amassed a wealth of maps, reviews, suggestions and directions to all of those places or events. He is a fount of both useful and fun information and history of Edinburgh and so much more.", "title": "Gerald's is the Place", "helpfulness": 3, "user": "bopbud", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12470732, "likes": {"liked": "— Host and location", "disliked": "— shower"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Gerald is a delightful host. Once ensconced in his cozy and comfortable home, you are his guest, not merely a boarder. He is genuinely happy to meet, educate and elucidate his guests. He takes his position as a host very seriously, meaning your comfort is of paramount importance to him. The rooms are comfortable and cozy, well supplied with whatever you might need. The breakfasts are delicious, varied and plentiful - you will not head out to the streets of Edinburgh hungry.", "title": "Wonderful Host", "helpfulness": 3, "user": "ChestertonBorrowed", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12283556, "likes": {"liked": "— Character", "disliked": "— Seperate bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "In summary, our stay at Gerald's place was awesome. Very clean, comfortable and relaxed. However, it still remains that Gerald is the best part of Gerald's Place. What a pleasant, kind and generous host. Gerald would make a lengthy stay in a cold, wet dungeon more than bearable. Thanks Gerald!", "title": "great stay at Gerald's Place", "helpfulness": 1, "user": "teleer", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10761679, "likes": {"liked": "— Gerald was the best asset of the accommodation.", "disliked": "— My having a cold while there."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "We spent a marvelous few days at Gerald's Place. Our host was very considerate, organized, knowledgable and amiable. Our room (bed - especially) was very comfortable. The breakfasts were wonderful. Gerald's Place is quite conveniently located for exploring Edinburgh on foot.", "title": "Peace & Quiet and quality B&B", "helpfulness": 3, "user": "Tartanhabit", "date": "December 28, 2007", "detail_rating": {"value": 4.0}, "id": 12023175}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 3, "very good": 28, "terrible": 0, "excellent": 575}, "aka": "Gerald`s Place Hotel Edinburgh", "slim_ranking": 0.0112612612613, "description": "Gerald's Place is in Abercromby Place, one of the finest Georgian streets in Edinburgh's historic New Town, built over 200 years ago. The location is incredibly convenient to the express airport-bus, train & bus terminals, top shops, banks & historic sites [Castle, Palace, Museum/s, Galleries, ICC, Parliament, Theatres]. Gerald welcomes guests to experience B&B hospitality at its very best and the Edinburgh City Centre at its finest. 'Be the best - no compromise'"}