{"user_rating": 4.5, "review_count": 46, "name": "Gillespie House Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We had a lovely stay at the Gillespie House Inn. The house is beautiful and decorated very tastefully. The hosts were very accomadating, certainly very friendly and were eager to share information and their affection for the Parrsboro area. Our room was comfortable with a perfect bed and high quality linens. Also, I might add spotlessly clean.", "title": "Great Place to Stay", "helpfulness": 3, "user": "Lilygrl", "date": "June 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7771947}, {"rating": 2.0, "title": "Not Our Cup of Tea", "text": "In the past we have had bad experiences with other B&Bs but our stay at the Gillespie House Inn certainly restored our faith in this type of accomadation.", "helpfulness": 3, "user": "lovemusic", "date": "August 6, 2005", "id": 3742207}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Parrsboro was our home base for exploring the Glooscap Trail, we stayed at Gillespie House Inn for two nights. Days were spent hiking, kayaking and exploring the area - which was unspoiled and beautiful. The Gillespie House Inn was right off Main Street, situated on a large piece of property that included a walking/sitting flower garden area and a large garage filled with antiques, all this abutted a beautiful church property - which made this all the more scenic and peaceful.", "title": "Perfect in Parrsboro", "user": "kasey363", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39517045}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The owner, Laurie, was very welcoming and took ample time to show us through the house and into our room. There were living room areas for use, a large walkaround covered porch with out door furniture, chairs and tables, and a computer for use also.", "title": "Very welcoming and comfortable", "user": "getoutoftownnow", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37577315}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Our room was large and very comfortable, with a queen bed and plenty of drawer space if needed. Bedding was very comfortable, windows to open and a fan was provided. Our bath was very spacious with a large claw foot tub with shower attachment, and a seperate spacious shower stall. There was plenty of room for toiletries, and nice soap/bath gels etc left for use. Property is immaculate.", "title": "Beautiful Inn", "user": "MountainMooses", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34956444}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We were kindly set up with coffee to go and muffins on the early day of our kayak trip, since we would miss breakfast, so that was very accomodating. The breakfast the next day was in the dining room shared among guests and made- to- order choice of chive scrambled eggs or french toast that day. Plenty of fresh juice, coffee/tea and loaves of bread to cut yourself and toast to enjoy with various local jams. Breakfast was excellent. we had a lively group of fellow inn guests, so breakfast was fun - always enjoy the conversation.", "title": "Beautiful historic B&B", "user": "Eimes30", "date": "September 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 20481119, "likes": {"liked": "— The rooms were beautiful"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Overall, this was a fine B & B (and we have stayed in many), clean, very homey, spacious accomodations, pretty upscale for a rural area if I have to add a better desciption. Ownership was helpful with suggestions, and made time for you without being intrusive at all. We sincerely appreciated the effort of the breakfast- to- go. Beautiful area, we're glad we ventured off to the coast that is not frequented as much by tourists - we really enjoyed this side of the Fundy coastline and our few days at the Gillespie House Inn.", "title": "First Class Lodging", "user": "chellyfla", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19376361, "likes": {"liked": "— Beautiful house and furnishings", "disliked": "— Everything was first quality"}}], "location": {"country": "Canada", "city": "Parrsboro"}, "variance": {"poor": 1, "average": 0, "very good": 8, "terrible": 1, "excellent": 36}, "aka": "Gillespie House Inn Parrsboro, Nova Scotia", "slim_ranking": 0.285714285714}