{"user_rating": 4.0, "review_count": 55, "name": "Glacier Mountain Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "The Lodge is a nice little place. It looks like a motel and it is pretty basic, but it's comfortable and clean.", "title": "Good place to stay", "user": "Bigbluesquare", "date": "August 2, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 116189905}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "It's within a short walk of a liqour store and The Saddle restaurant (which I recommend).", "title": "Excellent Atmosphere", "user": "cody_79", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116168603}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "In the morning there was no hot water as the boiler had gone out. It was fixed immediately, great service.", "title": "This was fine choice in small town without too many options.", "user": "OnOurWay038", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116073755}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Breakfast is good, with bagels, toast and a good choice of cereals.", "title": "Great place to stay!", "user": "Adam_WorldTravel", "date": "June 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114750172}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "It's a little on the expensive side, considering the quality of the place, but that's compared with other towns, not other places in Blue River.", "title": "Very pleasantly surprised", "helpfulness": 1, "user": "Kiammo", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114581553}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We have stayed at Glacier Mountain Lodge twice now, as it puts you about 4-5 hours from Jasper, making it an ideal overnight stop. The rooms are basic but clean and absolutely fine, and the breakfast is a nice self-service buffet, with cereal, porridge, bagels, bread, coffee, etc. The only downsides as far as we are concerned is that there is no restaurant and no pool (though there is a small hot tub, placed rather oddly right beside the lobby/breakfast room). There's no coffee-making facilities in the rooms, but coffee is always available in the breakfast room. There's no restaurant on-site, and no room service, leaving you to go to the Esso garage across the road for sandwiches or to the Sandman for a very ordinary meal. You can use the microwave in the breakfast room to heat food though, which was useful when we were traveling with a baby. It might also be worth getting something like a microwave meal and eating that in the evening, as the local food is very ordinary, very expensive or both, and the few restaurants that are in Blue River are often closed out of high season. There's allegedly the possibility of getting a pizza delivered, but we didn't pursue it.", "title": "Comfortable accommodation and a good breakfast for a great price", "helpfulness": 1, "user": "Topoftheworldma", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 113280505}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Parking is free but is just outside the front of the building. Wi-fi doesn't seem to have made it to Blue River yet...", "title": "Great place to stay!", "user": "LesleyON", "date": "June 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112772942}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "What Blue River does have as a nice bonus is a nice kids' playground where you can sit in a toy train and watch the real trains going past (and sneak pennies onto the track to be flattened by the next train through, though I didn't tell you that!). It also has a tiny but rather lovely lake where you can have a little picnic.", "title": "comfortable stop-over on our VIA Rail VACATION", "user": "ppg58", "date": "November 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 86387598}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "Glacier Mountain Lodge isn't a lodge by any stretch of the imagination - it's a 2-storey motel, and that's fine. Although it's on the main highway, even the rooms at the front of the hotel are pretty quiet (and I'm very intolerant of traffic noise). It's very reasonably priced (about 100 dollars a night) and the staff have always been friendly and helpful to us. Just take your own food, and you're sorted!", "title": "Great stop between Vancouver and Jasper", "user": "AshBlueMtsNSW", "date": "September 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81575207}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Only 4 stars for service, just because of the slightly basic amenities. But definitely recommended.", "title": "Excellent for small Town", "user": "kms61", "date": "September 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79985322}, {"rating": 4.0, "title": "Nice Hotel - as advertised", "text": "The room was clean as advertised. The woman working at the counter was very professional - stayed at 3 hotels on my trip and she was the best. I would stay here again for sure - only downside is the lack of food choices, but this is a comment on the small town not the hotel.", "helpfulness": 1, "user": "M109R", "date": "August 12, 2009", "id": 37473774}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Went to this hotel as a stop over to vancouver from edmonton, the service was great and the room was cool and clean. I called the day before fro a reservation and the lady fit us in. Breakfast in the morning was nice and on the way out the door the lady asked me if I would like a coffee to go. Great personal touch. No cell service.", "title": "very nice place to stay", "user": "pitdot", "date": "August 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36988023}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at the Glacier Mountain Lodge in Blue River as it was conveniently positioned on our way to Jasper. We were not expecting too much but we were pleasantly surprised. Blue River is small – a couple of restaurants, a gas station, a heli-skiing resort … that’s about it!", "title": "An enjoyable overnight stop-over", "user": "DavidBSurrey", "date": "July 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 33997055}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The motel is easy to see from the Highway and there is free parking. Staff were very friendly and efficient – helpfully pointing us to a great restaurant called the Saddle Mountain Lodge where we had a super dinner. The room was larger than expected – with two queen-sized beds and good sized bathroom. There was also plenty of sitting space, a full-sized fridge and AC. It was clean, comfortable and well maintained. Free coffee was available at all times and a buffet style breakfast was available in a small area between the reception and hot-tub. The breakfast itself was adequate.", "title": "Good clean, friendly, stopover", "user": "steve_randomno", "date": "March 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 26761887}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "There was no mobile/cellphone service here but free wifi is available.", "title": "Worth The Stay", "user": "rickster0728", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21849104, "likes": {"liked": "— The location", "disliked": "— noting really about this property"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "on our way to Edmonton. Pulled in around 10pm. The room was big, clean and the breakfast that was included was a nice bonus. Good assortment of bread, cereal, juice, baked goods. It was nice that the breakfast was also available at 545 am!", "title": "stay here, was good as reported in prior posts", "user": "Mazda3", "date": "September 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 78183697}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This property is well managed and the staff is very friendly. The rooms are clean and well maintained, though the beds are on the hard side. Ask for a room away from the highway as the hotel sits right adjacent to the highway and you will hear the trucks passing if you are on the highway side. The good news is that the traffic really drops off during the night, so this is not a huge issue. Breakfast is included but rudimentary - cereal, bagels and bread, oranges and apples, tea and so so coffee and orange juice. Given the alternatives, a good choice.", "title": "Good for an overnight stop", "user": "tirnie", "date": "August 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 77725242}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed in this hotel one night en route from Edmonton to the Okanagan Valley. We chose it based on great online reviews and the place exceeded our expectations. The room and bathroom were huge (in fact, larger than in most big-city hotels I had stayed in), the carpet was spotless, and the beds were super-comfy. All rooms on the second floor come with balconies with a majestic view of the mountains that surround Blue River. The staff was friendly and professional. We even decided to hop into the hot tub and enjoyed the experience very much.", "title": "More than you can expect in a small town!", "helpfulness": 1, "user": "Scythian41", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73335557}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The room fare includes continental breakfast (the usual selection of bagels, toasts, jams, and fruits). I wish they had better coffee, but that is a minor thing compared to the overall very pleasant stay.", "title": "EXCELLENT! SUPER COMFY & SPOTLESS!", "user": "velvet29", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57550490}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "If you get bored staying in your room, you can take a short drive to the nearby Eleanor Lake, a tiny lake with a great sandy beach that has a facility with nice and clean change rooms, showers, and more. Indeed, the whole experience of staying in Blue River was more than I expected of a town this size.", "title": "Just what we wanted", "user": "evergreenlochness", "date": "January 15, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 53526425}], "location": {"country": "Canada", "city": "Blue River"}, "variance": {"poor": 1, "average": 7, "very good": 30, "terrible": 0, "excellent": 17}, "aka": "Glacier Mountain Hotel", "slim_ranking": 0.5, "description": "Glacier Mountain Lodge is a European-style mountain lodge nestled in the valley between the Monashee and Cariboo Mountains, bordering Wells Gray Provincial Park in Blue River, British Columbia, Canada. Special stay packages for snowmobile vacations are available."}