{"user_rating": 3.5, "review_count": 356, "name": "Glacier Park Lodge", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I booked our family room last year, after being unable to get the type of accomodations we needed in the Many Glacier area (for 6 of us.) I paid the deposit of one night's lodging (minus the tax- that is still billed after your stay, including a Blackfoot Indian tax- it was a little bit more than 10% altogether. My husband was a bit upset, but I had been warned beforehand somewhere on-line- although not from the hotel!)", "title": "I was expecting worse.", "user": "catelisa48", "date": "July 26, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 18286289, "likes": {"liked": "— The lobby and the grounds", "disliked": "— The bathrooms, the stairs"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "After reading reviews and seeing pictures, I was really nervous and tried repeatedly to see if there were any cancellations at Many Glacier, so I could change my reservations. Since we were staying only one night, and I had been warned about the bathrooms here, we all bathed really well at our previous night's location in Yellowstone. Our room was on the third floor.", "title": "Great Hotel, But Beware of the Uptight Anti-Family Crowd", "user": "Loognoogy", "date": "July 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18275318}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Here is the good: The lobby is nice. The grounds are beautiful. The Amtrak station is within site and walking distance, if you take the train. The view of the mountains is nice. There are ample places to relax outdoors: porches, picnic tables, etc. The morning clerk at the desk was nice and helpful. The gift shop is nice and the employee that helped me was friendly. There was a full basket of toiletries in the room.", "title": "BAD BAD BAD... NOT WORTH THE MONEY", "user": "FutureGlobeTrotter", "date": "July 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 18174043, "likes": {"liked": "— LOCATION", "disliked": "— EVERYTHING"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Here is the OK: The rooms were ok. They were a bit nicer than I expected. The door had problems latching properly, and the kids were scared we had a ghost when the door popped open a couple of times. Room and bathroom were clean. Check-in staff was so-so.", "title": "Check your reservation!", "user": "Mac8135", "date": "July 16, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0, "location": 2.0, "service": 1.0}, "id": 17956821}, {"rating": 1.0, "stay_parameters": "Stayed June 2008", "text": "Here is the bad: The property could use more remodeling, especially the bathrooms. Glad we bathed up, because I don't think I could have handled that shower. The trek from parking lot to the annex, and then up three flights of stairs is murder. We are young and healthy, and it got OLD. We skipped the pool in order to hear a Native American speaker advertised...the speaking event was cancelled, and when we asked the front desk about it, they really weren't able to tell me much about it..", "title": "Do not stay here and do not book a wedding here", "helpfulness": 1, "user": "mo44", "date": "July 5, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 17555670, "likes": {"liked": "— Glacier National Park", "disliked": "— Too many to name"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We stayed in a King Suite on the second floor overlooking Glacier NP. The view was fantastic and the room, though old, was very comfortable with a dining and sitting area. The balcony to the side offered a great place for morning tea and was wonderful for watching the sunset. The only complaint was that the walls were \"thin\" and we heard everything our neighbors said!", "title": "Room with a View", "helpfulness": 2, "user": "lander007", "date": "August 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 19277022, "likes": {"liked": "— Location and the charm of an old inn", "disliked": "— Thin walls"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I entirely agree with the review below, “Beautiful Lobby, Terrible Rooms”. The room was dirty (black mildew in the shower) and old -- not charming old, just icky old. For example, I was cold at night and went to get the extra blanket in the closet. But it was crusty and stiff -- it wouldn't completely unfold; could stand up on it's own. With that, I chose to sleep in my sweat pants and jacket instead. (I also showered with my Teva water shoes on -- did not want to touch the floor.)", "title": "Miserable", "user": "KNK2222", "date": "August 20, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 19156718, "likes": {"liked": "— Exterior architecture", "disliked": "— Everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Since the hotel is located within the Blackfeet reservation, they are observant of Blackfeet traditions/holidays -- which is fine of course but caused some discomfort for us. While we were there, the Blackfeet were celebrating a holiday that called for no alcohol to be served for several days. So, instead of staying open to usual hours serving non-alcoholic beverages (trying to make people feel comfortable), the bar and all of the restaurants in the hotel simply shut down at 9:30 pm. So here was this huge hotel, with 100s of guests wandering about with nothing to do (no TVs in rooms or common areas, no place to hang out) and no where even to buy a bottle of water or cup of coffee. We played cards in the lobby under neon lights until bedtime, as our room was too depressing. All this for $200 per night! (I wonder where the money goes -- it certainly is not reinvested in the hotel.) And to think that the lovely, virtually perfect Silver Wolf Lodge is just across the Park in West Glacier for $175. Whacky!", "title": "Beautiful But Noisy", "helpfulness": 1, "user": "Chante_m", "date": "August 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 18848760, "likes": {"liked": "— Beautiful building", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "The upside? Luckily we were booked for one night only.", "title": "Just As You Want A Mountain Retreat", "helpfulness": 1, "user": "tedhart", "date": "August 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 18569376}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "Glacier Lodge in East Glacier (southeast of Glacier National Park) is a beautiful lodge. Built in the early 1900's, it features 40-foot fir pillars in the lobby as well as columns fronting the buildings. It's a building that I can't imagine being possible to build today.", "title": "Beautiful Lobby, Terrible Rooms", "helpfulness": 3, "user": "PhotoCitizen", "date": "July 27, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 18319941, "likes": {"liked": "— Located in Glacier National Park", "disliked": "— Noisy and uncomfortable."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed at the Glacier Park Lodge for one night on a week long trip to the park. Mainly we stayed because it was the best option when the weather ended up being colder and rainier than we expecting and we didn't want to camp. It was by far the nicest place we stayed on the trip. It's a beutiful old lodge built in early 1900's. The clientele was mainly the AARP set, but it was a nice place. The room was big and we had a great deck facing the mountains of the park. Unfortunately not able to take advantage of the spa treatments available but it's nice that they are there. I would recommend it but would say that the walls are a little on the thin side and no elevators so don't expect the lap of luxury.", "title": "Beautiful but past prime", "helpfulness": 2, "user": "lbmore", "date": "September 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 19969017}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I think when staying at a historic lodge there are some things that are inherent: the walls will be thin, the rooms will be small, and sometimes they just can't bring the room up to modern day standards.", "title": "Quaint, Comfy, & Loud", "helpfulness": 2, "user": "BrigH", "date": "August 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 19481812}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The outside of the lodge is beautiful. You can sit on the front lawn and watch the world go by. Golf and pitch & putt are available on site. There are plenty of places to rest around the lobby.", "title": "Beautiful National Park Lodge", "helpfulness": 2, "user": "Tuba-IA", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19423328, "likes": {"liked": "— The historic setting and beautiful location.", "disliked": "— A larger bar/lounge would be nice."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The room was small with no a/c. They did provide a fan but it was tough to rig it in the window to allow for air flow. I realize no a/c but if you're going to give us a fan try to make it easier to provide for airflow.", "title": "Not what it used to be......", "user": "Sunny/Virginia", "date": "August 26, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 19396939, "likes": {"liked": "— The lobby"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The problem I had was with the running around the walkways until late night & then again early in the morning. It was loud and made it tough to sleep.", "title": "Perfect for Train Travelers", "helpfulness": 1, "user": "Megs1722", "date": "August 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 1.0, "cleanliness": 3.0, "rooms": 3.0, "location": 4.0}, "id": 19383621, "likes": {"liked": "— No elevators!"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This review is for the East Glacier Park Lodge.", "title": "Hotel was amazing, Rude/incosiderate guests ruined the stay", "helpfulness": 3, "user": "BrianMcC", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 5.0}, "id": 17349905, "likes": {"liked": "— The building and view were both Very impressive", "disliked": "— The other hotel guests, they absolutely Ruined our visit."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2005, traveled with family", "text": "Bottom line? Tourists too often leave their brains, common sense and common courtesy at home when going on vacation. Visiting a hotel with thin walls AND rude guests is just a recipe for a bad experience.", "title": "Grand National Park Lodges are Great Fun", "helpfulness": 2, "user": "travel035", "date": "April 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15036906, "likes": {"liked": "— It is in one of the most amazing places on earth, bar none, and a nice historic hotel besides", "disliked": "— I did not have enough time to stay"}}, {"rating": 3.0, "title": "needs TLC", "text": "I'm sure you already know that the building is absolutely beautiful, the main hall is VERY impressive/grand and the view is fantastic. You may also already know that the hotel is closing in on 100 years old and has thin walls as well as retrofitted bathrooms/indoor plumbing. This is all part of the charm and character of the building and I have nothing bad to say about the hotel itself. The room was great, we shared a balcony with only one other room and had an amazing view of the mountains. Our room was quite large too, though the bathroom was small compared with todays standards. I had a hard time taking a shower in the very small stall, but I'm also 6'4\" and athletic in build (wide shoulders)... though my 5'2\" and slim wife said she had no idea how I could have showered in there.", "user": "dobb", "date": "October 8, 2007", "id": 10053735}, {"rating": 5.0, "title": "American Wonder", "text": "The main complaint about the experience of staying in the hotel were the Other guests. Since there's no way you can control other people, you are very likely to encounter the same issues we found. Parents who don't parent, their kids running wild through the entire hotel. Running down hall ways and up and down stairs, screaming and generally being as annoying as possible and disturbing people in all directions were the worst. The hotel was FILLED with these families. Then there were the people who drug their rolling suitcases down the stairs in the morning... obviously so out of shape that they couldn't lift their 80 pound bag, filled with junk they never needed, and disrupting the rest of anyone within 100 feet of the stairs. I've never been more disgusted with humans than while staying at this lovely historic hotel. And to think that travel is supposed to be Down due to the falling dollar and rising fuel costs! I just can't even imagine how much worse this building is during peak season.", "helpfulness": 3, "user": "nhlady68", "date": "September 19, 2007", "id": 8755761}, {"rating": 2.0, "title": "Majestic Old Hotel", "text": "If you're into \"families\" and can deal with unrestrained brat kids, then maybe you can still enjoy this lodging. On the other hand, if you value civilized behavior, along with peace and quiet, then you would be well advised to stay far, far away from this hotel. Visit and take pictures, enjoy dinner or a round of golf... but find somewhere else where you can actually get more than a couple of hours of sleep.", "helpfulness": 1, "user": "WDMTraveler", "date": "September 18, 2007", "id": 8749329}], "location": {"country": "United States", "city": "East Glacier Park"}, "stars": 2.5, "variance": {"poor": 44, "average": 81, "very good": 126, "terrible": 36, "excellent": 69}, "aka": "Glacier Park Hotel East Glacier Park", "slim_ranking": 0.636363636364, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}, "description": "Experience the western charm of the historic Glacier Park Lodge, which was completed in 1913. Its comfortable feel combined with some of the world's most spectacular scenery, makes Glacier Park Lodge a truly unique vacation destination. Although steeped in culture and history of the Great Northern Railway and Blackfeet Indians, Glacier Park Lodge features modern amenities such as a heated swimming pool, nine-hole golf course, in-room telephones, nine-hole pitch-n-putt golf course, gift shop, Lounge and the outstanding Great Northern Rib and Steak House. Glacier Park Lodge is in East Glacier Park, Montana on Highway 2. Glacier Park Amtrak Train Station is located just across the street from the hotel where guests are picked up daily in our antique red Checker taxi."}