{"user_rating": 4.5, "review_count": 36, "name": "Glan Yr Afon Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Visited this lovely pub today after hearing about new ownership. Very welcoming fire on entry, extremely friendly staff, prompt arrival of the best fish I have tasted in a long while, plus a perfectly cooked and presented burger both complimented with delicious home made chips. Good pint of locally brewed brew - looking forward to a return visit.", "title": "Excellent", "user": "Demon100", "date": "December 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147909339}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "A group of eight friends have visited this Inn annually for the past ten years. In that time it has changed hands a few times and is now in very capable management indeed. The bedrooms have all been refurbished, the bars and restaurant have all been spruced up and the beer is very well kept. the food from the restaurant is very good and reasonably priced. It's the very good end of pub restaurant fare, rather than a gastro pub, but it shows promise.", "title": "A smashing Inn", "user": "Chesini", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164160188}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The pub has a good atmosphere- no machines, and it is very conveniently located off the A55.", "title": "Red Rose TR Car Club visit", "helpfulness": 1, "user": "Richard2165", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163584338}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Highly recommended.", "title": "Lovely quiet tucked away place", "user": "frostypops1966", "date": "June 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163473768}, {"rating": 5.0, "title": "Good food", "text": "Five of us stayed for two nights. All staff were very friendly and welcoming. The rooms were comfortable and clean and the bar was well stocked and had a good atmosphere. The food was excellent with plenty of choice. We will return.", "helpfulness": 1, "user": "UkSil", "date": "May 19, 2013", "id": 161152023}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Just love the location, just off A55 but tucked away so no noise apart from the birds. Am staying here as working in the area and love coming back after a days graft. Great pub, friendly staff, tidy rooms, good food......what more do you want???", "title": "It is very good!", "user": "tupeloNorthWales", "date": "May 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161151360}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Thoroughly enjoyable weekend spent with friends and family to celebrate 'tawd man's' 60th birthday. Staff gave a warm welcomed and looked after us for the two nights we stayed. The room was clean and comfortable. The location was idylic with great views. We ate in on the first night and food was very good. We were asked what time we would like breakfast and the 'full english' was cooked to order so very fresh. Paul, the chef, barman, and chief bottle washer seemed to be on duty from first light to last orders but always with a smile on his face and a quick wit, and always ready to be of assistance. A real family friendly atmosphere and would not hesitate to recommend to others. Definitely would stay again", "title": "A Warm Welcome to Wales", "user": "Tonto54", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170188310}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "A no fuss, welcoming and comfortable weekend spent with friends for a 60th Birthday celebration. Through the weekend, staff were unobtrusive but readily available to ask if you needed anything more.", "title": "A Welcome in the Hillside!", "user": "Tartanhen", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169856764}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Traditionally decorated and in keeping with the age of the property. Lovely clean room with comfy bed. Good, freshly cooked breakfast and gallons of hot tea/coffee - starter of cereal and yogurt if you wanted. Loads of hot toast.", "title": "Good food great view", "user": "Pjjr1979", "date": "July 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169510980}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Chef Paul was smart, quick and organised, with a good sense of humour too!", "title": "Nearly as good as home", "user": "Carl R", "date": "July 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 169495252}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Didn't really get to meet the owner Chris, but his wife Karen served in the function room (Estuary Bar) with a smile and speed and again, was nicely unobtrusive, leaving her customers to enjoy themselves. Fab view of the estuary from the bar.", "title": "Superb friendly small hotel.", "user": "Jockmcallister", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 169274684}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Visited here with 5 friends, it's been many moons since I've been here, I believe its recently been re-opened and I can't fault it. The staff were extremely friendly and very efficient, the food was beautifully presented and was cooked to perfection. There's a good & varied selection on the menu although not much if your vegetarian. it was nice to eat out mid week and enjoy your evening without feeling like the staff are waiting for you to leave at 10pm! which unfortunately happens all too often in other places we've visited for meals. I can highly recommend this little gem hidden away in the hills and I will definetly be visiting again soon and be recommending it to all my friends.", "title": "Excellent in every way!", "user": "GillyMH", "date": "April 26, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 158858247}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This was our second visit to this beautiful, cosy Inn. There were seven in our party and every one of us thoroughly enjoyed our meal. The steak and ale pie and roast dinners deserve a special mention for being soooo delicious! We were served by friendly and helpful staff and we were made to feel very welcome. We will definitely be returning!", "title": "Delicious food!", "user": "PiffyIth", "date": "April 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 156233222}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We visited today this afternoon Saturday 16th February 2013,as we had heard good review locally. Chris and Karen are the new proprietors and the place had been decored to perfection! After questioning Karen as to who was now the chef we were delighted to learn that Paul the original chef was back on board and actually got to chat with him which was lovely. Karen is a lovely landlady and we chatted while there which I feel makes it appear so much more friendly and welcoming. We didnt stop for dinner but are going back on Monday night, tonight they had a wonderful set valentine menu for 2 adults for total £35 including a complimentary glass of pink champagne! However the main menu was phenomenal, I talked to Paul (chef) about the time he was last there and his home made chicken nuggets or gougons which are on the childrens menu! He actually made a portion of these for our adult pickie eater and made them with beer batter and they were gorgeous! What I love about Paul is everything he makes is with his fine chef hands and its wonderful to know he's back. The menu has a good variance and if you can not find something on their for all palates then I dont know what you are expecting. There is also a fine selection of beers and my hubby was in his element knowing they had Directors but they also had a local brewed Flint bitter. I had lager Italian Birra Moretti absolutely gorgeous, but you had the norm also of Fosters and Kronenburg! The accomodation has all been renovated to a high standard! The restaurant is lovely and their is still an additional room to hire our for private functions! You can also eat our in the bar which is of comfy seating, and a wonderful fire in the lounged area with a log burner between the dining area and lounge! We will be back Monday evening to sample to food and from past experience a few years ago when Paul was the chef we could not fault anything! I have a very pickie food family, but this chef will put his hands to anything if you request it! Welcome back Paul, and best wished Karen and Chris for bringing back one of the most delightful country taverns in the area.", "title": "Wonderful to know this beautiful place is once again open", "user": "BowlerClan", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152270433}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed here 22nd december with another couple, met by great hosts Chris and Karen the new proprietors who made our stay very enjoyable. Our rooms had been recently renovated to a high standard and were comfortable and relaxing. Our evening meals were wholesome and tasty we all varied our orders for starters and mains to experience the chefs ability and he did not let us down , his breakfast was also excellent and plentiful.", "title": "Hidden Gem!!", "helpfulness": 1, "user": "debed", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151023532}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The hotel has an olde world charm about it with local real ales and cosy fireplaces, add the friendly hosts and staff ,throw in a few locals to chat to and you;ve got yourselves a little gem !!!", "title": "Dining out", "user": "jennyben47", "date": "December 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 148433049}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 6, "terrible": 2, "excellent": 27}, "slim_ranking": 1.0, "description": "Dogs are welcome in bar areas where meals can be served. We do not allow dogs to stay in bedrooms. Glan yr Afon Inn has a registered taxi service available to residents of the hotel. This is a chargeable service, rates are set by Flintshire County Council."}