{"user_rating": 3.5, "review_count": 496, "name": "Gleddoch House Hotel, Spa & Golf Club", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Last Saturday my best friend and I had a lovely stay at this hotel as a wee treat for her birthday. The setting was so beautiful with the restaurant looking out on stunning hills and trees. The manager Steven was one of the most attentive managers I have seen and his young staff are a credit to him. Our dinner was beautifully presented and I had the salmon and seafood main course and it was cooked to perfection and the sauce was so delicious my friend \"stole\" some. I was particularly impressed with a young waitress who had to deal with a rude diner and she handled the situation beautifully. I spoke to the manager to congratulate him and his staff. I do not like rudness in any shape or form. In the morning we were served by Aaron and he was a lovely, friendly, efficient waitor who could not do enough to make our dining experience perfect. Well done Aaron. For breakfast I had the best ever kipper with a lemon sauce. The chef knows how to cook fish to perfection and they are many who do not. Our bedroom was clean with fantastic queeen single beds with lovely linen. I know some reviews say it needs a refurb but If you go to a country house hotel you are getting the full package of the beautiful scenery, superb food, lovely service and as long as my room is clean and the beds comfortable I am very happy. On check in and out the girls at reception were helpful, efficient and gave us a lovely welcome and farewell. Well done Gleddoch staff. Yesterday my son was at a wedding there and he came home last night raving about the venue. We look forward to returning.", "title": "Beautiful overnight stay", "user": "scottiewanderer", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140821010}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "After working all night in Glasgow needed a 10 room booking with an early check in. Stumbled across this wonderful part of Scotland just outside the city centre.", "title": "Peaceful, picturesque, accomodating, great stay.", "user": "00dread", "date": "September 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 140705081}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We arrived around 11am and they were good enough to put breakfast on for us despite breakfast closing at 10am.", "title": "Very Tired", "user": "Sandy G", "date": "September 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 140481203}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Rooms were spacious. In most cases the rooms had two double beds or a king size. They were clean with lovely views of the well kept golf course or the river.", "title": "Lovely overnight stay", "user": "Anneb2012", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140419508}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Gutted I didn't have a chance to take advantage of the pool or other facilities. Great place, would live to come back.", "title": "Out of touch and out of date", "helpfulness": 3, "user": "baggio42", "date": "September 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 139750717}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed here in August 2012 for three nights. Booked it because of the golf for hubby and pool for my step daughter.", "title": "Enjoyable family mini break", "user": "SpinningJen", "date": "October 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 143623821}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The room was clean enough with a view of the golf course. Beds comfy and bathroom clean.", "title": "Room smelled of poo!", "helpfulness": 1, "user": "Caroline M", "date": "October 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 5.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 143124385}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Pool was excellent entertainent for 7 year old but we didnt eat in the restaurant at dinner time as it was on the pricey side.", "title": "not bad for the price", "user": "Matt13teen", "date": "October 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143095570}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Breakfast was nice except for a few things, bad choice of music (dance, hard core music) and quite loud, not the type of music you expect at brekkie time.", "title": "Ideal getaway", "helpfulness": 1, "user": "ossam_12", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142896363}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Also we ordered pancaked one morning and they tasted as if they had been cooked in the kipper pan and smelt of strong fish.", "title": "WEDDING BLISS AT THE GLEDDOCH", "helpfulness": 3, "user": "Happycouplejuly2012", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142534008}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Not clean, too many stairs, wifi didnt work, asked for a room with a view and got a room with a view at a roof! Most staff didnt talk english, couldnt understand a word, staff ignored the dirt and the restaurant served most food of low quality, but did as if it were the most expensive caviar.", "title": "Bad!!! Not clean, to many stairs, wifi didnt work, asked for a room with a view and got a room with a view at a roof! Mo", "helpfulness": 1, "user": "kekobela", "date": "October 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 142197722}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Celebrated parents 60th Anniversary, events organisor very helpful and efficient. Rooms, food and service excellent for our private function, exceeded expectations having read some of the reviews. Staff very kind and helpful just wish the organisation which owns this hotel would value such an asset and restore it to its previous glorious self as far as the grounds, facilities and decor is concerned, this would guarantee many more satisfied and retuning customers to this beautiful location.", "title": "Family Celebration", "user": "MARGARET H", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141595752}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Got a good deal for a 2 night stay then got worried when i read some of the reviews!. needn't have as hotel was lovely, room well presented and clean. all staff were helpful and attentive. food looked great and tasted wonderful. Only 2 things let it down . One, no hot water for shower early on day of departure.Reception apologised and said would get maintenance onto it, and two, evening meal duck main course was tough.However waiter was great and very apologetic. Main course replaced with different one which was lush! Would definately go again.", "title": "Had a lovely 2 days break!", "user": "Moira J", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141238174}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Loved the hotel.it was clean, modern and the food was great.We had a big spacious room with a lovely view. The staff were helpful.Would def return. We got a great deal so it was brilliant value for money.", "title": "Had a great time.", "user": "vicki r", "date": "September 24, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 141058027}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We where at this hotel in june and it is a hotel i will never go back to ! I have mobility problems and asked for a room with a walk in shower that was not a problem they said when we booked it ! got there dont have rooms with a walk in shower use the showers at the leisure centre ( i dont think so ) what a way to treat guests swimming pool down a large flight of stairs very handy and i dont think !!!! place in need of a very good clean we will not be back again what a total waste of money will advise our friends of this!!!!", "title": "never again", "helpfulness": 2, "user": "amk-10", "date": "September 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 140988422}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Excellent views of the Clyde valley, but overall I cannot see that this hotel lives up to a 4 star billing. We got the stay on a special deal so overall it was good value for money, but I would not have liked to pay full price. Plus points, the restaurant food was excellent and good value for money, the room was clean and tidy, but the whole place felt like a golf club with rooms, great if you are on a golfing break... The residents bar was more like the golf club bar and everything, including the pool was up a lot of stairs, 71 from reception to the restaurant, almost as many to the pool, which unfortunately felt more like a municipal pool than a 4 star hotel offering. I think if we wre to stay again we would plan an evening in Glasgow and use this solely as a base.", "title": "Not quite what we expected", "helpfulness": 1, "user": "magpieranger", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144621072}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "On the plus side, great location, fantastic views, a lovely big comfortable bed, and the pool was pleasant. On the minus side, the leisure section where our room turned out to be is very functional, not really the country house hotel we had anticipated. There is no cosy, warm bar to have a drink or a coffee in, or at least we could not find one, and the food was unexceptional at best. A previous reviewer mentioned the carpet outside the kitchen in a review a few months ago - it is still dirty where food has been spilled, and pretty smelly, and frankly a bit off-putting as you make your way to the restaurant for dinner. Overall, disappointing.", "title": "Some plus points, a lot more minuses", "helpfulness": 1, "user": "MdV62", "date": "November 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144505499}, {"rating": 3.0, "title": "Room for improvement", "text": "No marmalade (for two days), ran out of fruit, a 15 minute wait to be served for breakfast on the 29 October. Not too good, seemed rather short staffed.", "user": "St4rsend", "date": "November 4, 2012", "id": 144473215}, {"rating": 3.0, "title": "Overall enjoyable but needs attention to detail", "text": "In the area where most of the rooms are, the walls are paper thin so don't expect too much peace. Clearly the hotel is setup for functions so you can expect quite a bit of noise.  If you like dogs you are in luck because they are welcomed.", "user": "ScotsmanabroadKMB", "date": "November 1, 2012", "id": 144263705}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Let's start with positive points. The hotel has stunning views of the Clyde estuary looking across to Dumbarton Rock. The room was kept clean, towels changed daily, courtesy tea, coffee and biscuits replenished daily. The staff were all friendly and helpful. Decent sized pool with steam room and sauna. Well equipped gym with good, current equipment. Plenty of car parking. We didn't use the golf course but it seemed popular.", "title": "Good hotel bad breakfast", "helpfulness": 1, "user": "ScotlandJoey", "date": "October 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143824101}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 62, "average": 94, "very good": 166, "terrible": 39, "excellent": 135}, "aka": "Best Western Langbank", "slim_ranking": 1.0, "description": "Gleddoch House Hotel and Golf Club and its 360 acres estate was once the home of the shipping baron, Sir William Lithgow. It is an ideal base from which to explore Scotland's famous sites and attractions and is uniquely situated for Glasgow International Airport and Glasgow city centre. Gleddoch House Hotel & Golf Club takes you away from the bustle of the city with breathtaking panoramic views of the Clyde Estuary. The property boasts 70 bedrooms with two suites, bar and dining facilities, indoor swimming pool and gymnasium, as well as an on-site 18-hole golf course that has dramatic views across the River Clyde to Ben Lomond. We consistently strive to not only meet but to exceed your expectations in delivering a first class service and invite you to sample our welcoming hospitality."}