{"user_rating": 4.5, "review_count": 86, "name": "Glenmoor by the Sea", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "This is a wonderful location to the water and activities in the Camden area. Very clean cottage #36 with a view of the cean and near one of the swimming pools. Good area to walk the dog and get some exercise, it is all ona gradual hill. Cabins ar easy access. When i arrived I was greeted in a nice lobby living area. This is a wonderful place for a family, lots of activities on the sprawling green lawns. The fire pit was roaring when i arrived, although no one enjoying t in the drizzle. I recomend McClauighlins lobster pot.....casual and on the harbor. Dots for morning or day goodies. A/c loud.", "title": "cottage colony and dog friendly", "user": "hilary t", "date": "August 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137589717}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "Bungalows with Ocean views and nice grounds. Perfect if you're a family but just OK for a older couple who travel a great deal. Bed was like a trampoline and linens where a bit old and dated. Staff are terrific. We weren't unhappy with our stay but where a bit disappointed and felt we should have done better.", "title": "More motel quality then high end. Really adequate though.", "user": "johnnap", "date": "August 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 136938670}, {"rating": 5.0, "title": "Inviting cottage environment", "text": "We were pleased with our stay at Glenmoor by the Sea. The staff was very friendly and helpful giving it that \"mom and pop\" feel we so love. The cottage we stayed in was very clean and comfortable. The property is quite large with all types of activities -we enjoyed frisbee golf. The best though was the smores by the firepit in the evening. Thanks for a great stay!", "user": "provencebound", "date": "August 9, 2012", "id": 136733916}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Glenmoor by the Sea is a very nice property, located right on Penobscot Bay. We stayed in the St. Andrews Building in July 2012. The room was attractive and comfortable. The included breakfast tends toward muffins and Danish, with good coffee. The only downside was the loud air conditioner, which cycled on and off thunderously, but that should only be a problem in very warm weather.", "title": "Beautiful location", "helpfulness": 2, "user": "Cabdiver", "date": "August 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 136411100}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "I had read previous reviews and we were somewhat leary of what we would find upon our arrival. In short, we were pleasantly surprised in almost every facet of our stay.", "title": "Our new number 1", "helpfulness": 1, "user": "CoolAir_11", "date": "August 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136279274}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I stayed on the first floor of the St. Andrews House last week (July 2012) with my 80-ish mother, and we both found it to be a peaceful and pleasant place. Having two separate bedrooms and a sitting room made for a wonderful stay for two adults with very different sleep schedules. This is not a cookie cutter chain hotel room--we appreciated the space to spread out.", "title": "Beautiful Retreat--we will be back", "helpfulness": 1, "user": "ArdenCJ", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135912590}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The continental breakfast (with terrific coffee) was a real treat with really spectacular pastries. Every staff person was friendly, and I appreciated the excellent service. We also enjoyed sitting at the deck right at the water's edge, although that was far down the steep hill from St. Andrew's House. I hope to book one of the cabins closer to the water on my next visit.", "title": "Peaceful oceanview retreat.", "helpfulness": 1, "user": "Margo N", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135330312}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I look forwarding to booking here again for next year's visit to my daughter's summer camp.", "title": "Hospitality personified", "helpfulness": 1, "user": "Kurt M", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135280217}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I spent 4 days here in St Andrews House, 2nd floor with a spectacular ocean view and great deck to sit and have coffee or read or just watch the boats in the harbor. It is 2 seconds to Camden, and there is plenty of parking in the charming town with lots of restaurants and retail experiences you will love. The staff were wonderful. It is dog friendly but everyone is meticulous about picking up after their dogs. Tennis, lawn games for the hearty, and peaceful relaxation for the weary.", "title": "Great family reunion", "user": "lambermom", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134969722}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I travel to my camp in the western mountains of main quite frequently. Sometimes, I go directly to my camp, and other times, I take the scenic route along the coast. I have stayed in several of the chain motels on my coastal journies, and where they may have been acceptable, there was no comparison to my stay ay Glenmoor By The Sea. The atmoshere was more comfortable and casual, the staff treated me like family, and the rooms are clean like my Mom would have in her home. Spotless. You can see all the effort put forth from every member of the staff so clearly. It shows in every way from the warm smiles that greet you when you arrive, to the beautiful flowers that seem to be everywhere you look, and finally, the comfortable bed in a nice, clean room that provided me with a wonderful nights sleep. Don't look any further. Here, you will find everything you could possibly want. I'm looking forward to staying a little longer on my next stop here to enjoy some of the local recreation. I hear its great!", "title": "Absolutely Fabulous!", "helpfulness": 2, "user": "Kathleen C", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134730808}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We went off season and saved some money especially with a Living Social deal. Normally the prices can range $200-300 per night depending upon accommodations during high season and discounted in spring and fall. We had a first floor room at the St. Andrews House that had an ocean view. The room is very spacious and well decorated and does have a fireplace.", "title": "Nice place.", "user": "ojdidit", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141453334}, {"rating": 1.0, "title": "Questionable online reservations", "text": "The grounds are very well maintained and have a variety of family friendly activities. Almost on the bay is 13 cottages that will provide more space if that is your need. The staff is responsive and they have a small continental breakfast available. They also have a complementary computer for your use.", "helpfulness": 1, "user": "piw213", "date": "September 24, 2012", "id": 141171207}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Glenmoor is about 5 miles from Camden and about 12 miles from Rockland. Rockland has the Farnsworth Art Museum and it is worth the trip. Camden is more along the lines of quaint Maine coastal villages with pricy restaurants and gift shops with the usual assortment of stuff that I normally bypass.", "title": "SImple, well done.", "helpfulness": 1, "user": "tmpaia", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141170644}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "For a money saving tip you can head down Route 1 towards Rockland for the usual collection of fast foods and casual dining. There is also a Hannaford's and Shaw's super markets on the way.", "title": "Clean and cute", "helpfulness": 4, "user": "HLEJR", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140192029}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "As a side note we had a \"goody bag\" that probably had $25 worth of items including a split of champagne and this was part of the Living Social promotion.", "title": "Relaxing, restful and beautiful property", "helpfulness": 1, "user": "Busyinnkeepers", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140176582}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Not what it seems by the Photos. Better!!!! Stayed Memorial Weekend. Now picture yourself here in the morning as the sun starts to ascend, walking a few hundred yards to one of two decks that are perched upon the cliffside overlooking the bay sitting in chairs, sipping your morning coffee before the kids wake up.Picture a family with kids who need constant entertainment. They come down to meet you when they wake and ask to go get some of the fresh cinnamon roles from the continental breakfeast( delicious). Two heated pools a Croquet court, disc golf course, tennis courts and nightly bon fires along with a set of playing cards and super friendly staff more than suplimented our kids with entertainment in between our planned outings durrinf the day (sailing trip on the bay, shopping in Camden etc).. This was a fantastic way to unwind for a weekend getaway from Boston. We have already rebooked for next year and am looking forward to my next stay. The only negative i found was i did not care for the coffee. but that may be do to my snooty palet after working in a coffee shop years ago.Which was also easily fixed... there is a great place for good gourmet coffee and fresh baked goods just up the road at a place named Dots where i also received fantastic service. The Cottage we stayed in had a king and queen and a small hide-a-bed along with a small kitchen. I would describe it as semi rustic and very clean and they are Very Dog friendly! Awesome!!!", "title": "Glenmoor by the Sea. What a retreat!", "user": "Michael L", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139443061}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Glenmoor by the Sea is well-situated for exploring the Camden area. Moreover, the setting and accommodations are really lovely. My family and I found our lodging -- a cabin near the water -- spacious, comfortable, and well appointed. The cabin had clearly been renovated in recent years and was clean and fresh. And the grounds have many pleasant diversions, although we didn't avail ourselves of any but the pool and the decks. This is an ideal place for kids and dogs, but it transcends its family ethos; there were plenty of couples enjoying themselves as well.", "title": "Excellent location, lovely grounds, well-kept cottages", "helpfulness": 1, "user": "small_monkey26", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138673387}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed at Glenmoor August 13-15 to celebrate a 35th wedding anniversary. We used a Living Social deal. The deal called for a split of champagne when we arrived; they were out of splits so they gave us a full bottle! And it was Moet and Chandon that sells for $37.00!!", "title": "Great place to relax", "user": "snowmanvt", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138052102}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed in St. Andrews in Room 14. The room was delightful with a canopy bed and a small frig as well as a micro-wave. The room was spotless. We had a nice deck,", "title": "New Experience... and a Winner!", "user": "SrMaryA", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137796651}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "and a great view to the Bay. All ages were at the Glenmoor, families with kids and old folks", "title": "My family will be back", "user": "DebinCincinnati", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137617680}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 6, "very good": 25, "terrible": 2, "excellent": 53}, "aka": "Glenmoor By The Sea Hotel", "slim_ranking": 1.0}