{"user_rating": 3.5, "review_count": 273, "name": "Glenwood Canyon Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My family (myself, my wife, our two kids and a close family friend) is currently staying at the Glenwood Canyon Resort in the RV park. The RV spaces are large and very easy to access. They have cabins as well. There is no hotel here, despite this review being under the \"Hotel\" category. The location is gorgeous ... at the bottom of the canyon next to the Colorado River, and just two miles east of the town of Glenwood Springs.", "title": "A Bit Pricey, But Great Place To Stay And Play!", "user": "ccollman", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115687743}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Check-in was fine. The office staff was friendly and helpful. Got our space and got parked in no time. Immediately signed up the family for river rafting, high ropes course, rock climbing wall and zip line adventure. The Rock Gardens Rafting Company was great ... they are located on the grounds, so we just woke up yesterday morning and walked 100' to their buses. Rafting down the Colorado River was awesome. The river is running very high right now, which made for some great whitewater! Our guide, Rachel, did a great job and was very good with our kids.", "title": "Beyond the look", "helpfulness": 2, "user": "angrybird016", "date": "July 21, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 4.0, "service": 3.0}, "id": 115625022}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We then had lunch at the resort in their new snack area and event building. The burgers and fish and chips were fantastic! Manager Kevin Peterson walked around and talked to everyone making sure the food was good and the service was even better. The only drawback was the unexpected 11% Resort Fee that got added to everything you purchased.", "title": "We love it here!", "user": "nevadavic", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 115574989}, {"rating": 2.0, "title": "Choose another place if camping & watch out for \"resort fees\"!", "text": "After lunch, we were greeted by another guide, and the family began the high ropes course, rock climbing wall and finished with the zipline across the Colorado River. This is all located right here on the grounds ... didn't have to go anywhere. They all had a blast (I had to stay behind and give them all moral support ... did I mention that I'm also afraid of heights?).", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 20, 2011", "id": 115570926}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Finished the day with some Baby Back BarBQ Ribs at Rib City in Glenwood Springs. Great ribs! Thanks Rachel, for that recommendation.", "title": "The best part of our trip", "helpfulness": 1, "user": "Tooter0", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 115402808}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "You can't beat the views. The first 2 nights we were in the bottom campsites over Memorial Day weekend, and the river kept rising. On Monday as everyone else was checking out, we asked about moving to higher ground and they said \"no problem\". The view up there and the wi-fi were much better. The wind died down on Wed, before we left, but we had a great time. The grill was fun and the musician was fun too. Checked out the premium suite's behind the grill too, they are gorgeous. Stayed one night on the way back to Cali on June 5 as well, Our family is into trains, so the trains didn't bother us at all. The staff was very friendly. Glenwood Springs, is the cutest little town and Aspen and Vail are less than an hour drive away.", "title": "Spectacular views", "helpfulness": 2, "user": "Kelchlepp", "date": "June 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 112427540}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Very nice calm (1,2 &3) raft trip. Great for a family with (10+ age) children. Staff was very accomodating and friendly.", "title": "White water rafting & zipline", "helpfulness": 1, "user": "rettas-review", "date": "June 2, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 111112332}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Zipline Wow.... wish that we would have booked the rope course too.", "title": "Pricey for what you get", "user": "cooogrrr", "date": "May 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 110637529}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Serious fun!", "title": "Awesome RV/Camp grounds - great location lots to do", "user": "ski321", "date": "May 30, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 110632386}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "Stayed in one of the camper cabins. Basically a little wood shed with two windows, a double bed and a set of bunk beds, and a light bulb - nothing else. The beds were hard - like sleeping on the floor. No outlets to plug in chargers-had to go to the game room to charge anything. Where the camp cabins are there are not enough grills, picnic tables for the 8 cabins that are there. There is also only one campfire pt for all 8 cabins - this leads to it getting very loud around the campfire... well after quiet hours. The cabins are also close to I-70 - you could hear the cars/semis at night.", "title": "Who needs a sentence, Breathtaking can sum it up.", "user": "Directvguy", "date": "May 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 110301549}, {"rating": 1.0, "stay_parameters": "Stayed June 2011", "text": "We are tent camping with ten year old kids. This place advertised sites by the river which sounded great. Phoned for a reservation. What they do not tell you is they have built a bar on the hill overlooking the campsites and they had live music until 9:00 pm, then another hour of recorded music. The lights from the thing shine all night totally spoiling any kind of camping experience. We brought guitars to play at our camp fire but we couldn't use them before the kids passed out.", "title": "Camping in A Walmart parking lot would be more peaceful.", "helpfulness": 4, "user": "Freakshow42", "date": "June 26, 2011", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 114758869}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "It is clear they have decided to focus on the giant RV crowd that wants a getaway but with nightlife. This isn't camping though and it isn't family friendly at all. It is aimed at the retirement crowd with big RVs. Converations with owner were unsatisfying with him suggesting we no longer patronize his establishment. I would have been happy to oblige had I known the kind of place this really was. Will not return.", "title": "Best Time Ever", "user": "supabooch22", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114083085}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Went out to Colorado with 6 guys. We were looking for places to zip line and white water raft. Glenwood Canyon was absolutely amazing. For not a bad price at all, they give you the package of lunch, rafting, and zip lining. The staff is amazingly friendly. There is a bar/restaurant that over looks the zip-line and the mountains that has a view like none other. I suggest requesting Gnarly Marley as your rafting guide. She ROCKS.", "title": "First Class top to bottom, RV, Cabins, Rafting, Zipline Great Food and Beverage", "user": "Travelfools12", "date": "June 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113902072}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Wow! Right on the mighty Colorado River, Nice Rv park with Cabins and facilites for Tent Camping up to Big Rig. A Spanking New Restaurant with open deck for great views of the River. A snack bar and grill overlooking Ziplines across the Colorado River. Wonderful Challenge Course for anyone. We sat and enjoyed a cold one as the Family ran the course of Zipline and River rafting. Quality and Fun for everyone.\" We Will be Back\"", "title": "BEST RAFTING AND ZIP LINE , AMAZING!!", "user": "bcelticsthetruth", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112809838}, {"rating": 5.0, "title": "Absolutely terrific!", "text": "Glenwood Canyon Resort has beautiful scenary, we enjoyed every activity that they offered. We went on the Zip Line first and we spent 2 hours on all the ropes having so much fun. The moment built up will all the fun we had, and our tour guide was really nice. All the height challenges were fun, it was definitly worth my time in colorado. I was scared to go on some of the height challenges but my tour guide walked along with me and held me up, so that was awsome. Then we went on a 3 hour rafting trip and that was really fun, they gave us all the stuff we needed to enjoy our time. We all got wetsuits and jackets to keep us warm. Rafting was the real adventure i would definitly go again, and our guide Jared Williams made our trip worth while. We had pictures taken of us all day from the photographer and we left with tons of memories. It was a great all day event and i would definitly go back whenever i get the chance! If you go, i suggest you eat at their new no name bar and grill it was really good.", "helpfulness": 2, "user": "PerNilsson", "date": "June 11, 2011", "id": 112809274}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I am not someone who typically participates in these comment sections of the internet, but I feel it is necessary to point out that there appears to be a very vocal minority who are giving an otherwise reasonable and very family fun oriented resort a bad name.", "title": "Fun filled day - negative feedback unjustified.", "helpfulness": 5, "user": "BroncoKid", "date": "July 14, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "service": 4.0}, "id": 115372739}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My friends and I stayed in town, so I cannot offer my opinion about the camping experience that Glenwood Canyon Resort provides, but we did participate in the morning raft trip, bar and grill lunch with a zip line and challenge course trip in the afternoon. While the reservations office leaves something to be desired with their customer support, the rest of the resort's staff and guides are absolutely amazing and friendly. Everyone had great attitudes and were attentive to our group's needs.", "title": "Great View but HORRIBLE CAMPSITE!", "helpfulness": 3, "user": "bestronghold", "date": "July 13, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115331056}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I have been on rafting trips in the past and Rock Gardens' guides were some of the best I have ever encountered with their friendly demeanor and their attention to safety during an otherwise dangerous high water season. The zip course was simple, but the challenge course sealed the deal with a couple of obstacles that really pushed our limits. We encountered a new and fun guide at each station we visited. All of us agreed that we could really tell that everyone there loves what they do and they extended that feeling to us the entire time.", "title": "WARNING....You will regret tent camping here!", "helpfulness": 6, "user": "camper2222", "date": "July 13, 2011", "detail_rating": {"sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115328093}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Bottom line, this resort is not something to be missed and I encourage all travelers to stop by for some fun on and around the river while on their way through Colorado!", "title": "Great rafting and zip", "helpfulness": 1, "user": "SunAndBeachSeekers", "date": "July 7, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 115139492}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Lets start with the good. The view is amazing, however....the RV site on the lower level are VERY TIGHT! You would have more room if you camped in a parking lot. The bathrooms are not secure with windows that have no latch...so anyone can look in. But the worst is the train that goes by and applies the brakes ALL NIGHT LONG! The campsite is located along a bend in the river and railway so the SCREECHING happens about four times a night! When I talked with the management about getting a refund for the rest of our stay I was threatened. Too end on a brighter note we did find a great camp ground in Carbondale, CO.", "title": "How can you stay in business when you treat your customers so POORLY?!?!", "helpfulness": 10, "user": "EMERGENCY_ROOM_DOC", "date": "July 6, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115101461}], "location": {"country": "United States", "city": "Glenwood Springs"}, "variance": {"poor": 19, "average": 28, "very good": 46, "terrible": 60, "excellent": 120}, "aka": "Glenwood Canyon Hotel", "slim_ranking": 0.4, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 4.0, "location": 4.0}, "description": "Welcome to Glenwood Canyon Resort in majestic Glenwood Canyon, Colorado. Offering cozy accommodations, including Canyon Club Suites, Family Cabins, Deluxe Resort Cabins, RV sites, Camper Cabins, and riverfront tent sites, Glenwood Canyon Resort has ALL of your resting and relaxing needs met. Not to mention, while you stay here with us on the mighty Colorado River, enjoy some of our other amenities offered by the Colorado Adventure Center, such as whitewater rafting trips, zipline tours, high ropes challenge course, climbing walls, self-guided and guided biking tours. After a full day of activities, come on down to our very own on-site bar and grill and enjoy some delicious food and luscious libations on the deck of the No Name Bar and Grill. We look forward to your company and serving you and your family."}