{"user_rating": 5.0, "review_count": 62, "name": "Glendavan House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife and I spent a wonderful time at Glendavan House. The room - a suite, in fact - was more than comfortable. We even had our own fire in our own sitting room. The breakfast was among the very best we had in two weeks in the Highlands. The resident red squirrels are amazing, and there are great walks, and very good restaurants, in the immediate vicinity. But the best of all was Moira and Rebecca's welcome, which was simply stupendous. One drawback : normally one can only reserve for a minimum of two nights, but given the experience, you my regret not spending longer.", "title": "The warmest welcome of all", "user": "chatenay", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16200736, "likes": {"liked": "— The four-poster bed, the fire and the shower"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We are not a B&B type of travelers.", "title": "A fantastic stay", "helpfulness": 1, "user": "anon73", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72702190}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "When we travel, we want to see the country, not the people.", "title": "Scotland at it's most welcoming", "user": "Fife_traveller", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70242241}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I have no interest in getting to know the locals, I don't want to discover hidden gems off the beaten track (they are off the beaten track for a reason), and I sure don't wanna stay in \"Suzy's old room\". So if you're like me, and are reluctant booking this place cause you don't want to have breakfast at somebody's kitchen table - read on.", "title": "Truly, a hidden gem unlike any other !!!", "user": "Marzdi", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69872765}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This place is great. We stayed in a Glendavan suite - a large bedroom, a beautifully furnished sitting area, and a conservatory/sunroom with a private access to the deck.", "title": "Outstanding - A great B+B experience", "user": "Ranald M", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66913685}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I feel the hosts thought of every possible obstacle and prevented it.", "title": "Beautiful guest house with gracious hosts.", "user": "GarranTraveller", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60282328}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "During our 14 day tour of Scotland, we experienced some very good B+B's but Glendavan House was right there up at the top.", "title": "Second time here - its just fantastic!!", "user": "CSJAberdeen", "date": "December 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51144130}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Wow, what can I say about glendavan? We stayed in the ogston suite and were pleasantly surprised, if this is a five star b&b then I'll never use a hotel again. The room came with a lovely homely drawing room and private conservatory where you can relax and watch the red squirrels play on the decking most nights. The family who run glendavan are the nicests hosts you'll ever meet and the breakfast just superb. Glendavan is surrounded by beautiful walks and lovely villages and for a weekend break or weeks holiday I wouldn't hesitate to recommend this lovely b&b to the closest family!", "title": "The friendliest bed and breakfast ever", "user": "Paddyday", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38893044}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Fabulous place. Met by owner on arrival and given personal guide through the apartment as had booked the suite. The suite was better than could be expected. Both the bedroom and lounge were furnished to \"Royalty\" standard. The full bathroom includes a shower and a deep jacuzzi bath. It was great. There is also a large conservatory off the lounge which gives access to a large secluded decked area which attracts all sorts of birds and other wildlife. When I stayed it was visited regularly by a family of red squirrel. The house does not cater for meals (although snacks are provided for the very late arrivals). However they recommend some local hostelries. We choose the Victoria in Dinnet which was also first class and very reasonably priced. Breakfast was served in a communal dining room The menu was very extensive and all that was served was fab. A large kitchen / pantry is available to use for teas / coffee etc as and when you wish. This area also incorporates a large selection of wines (including champagne), beers and spirits which you help yourself to and are paid for on an honestly basis. The prices are very little above High Street shop prices so no need to take your own. All in all a fabulous place - Just how it should be some would say !", "title": "Six Star Accomodation", "user": "Ewen50", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35327786}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed in the Davan Suite. Our stay exceeded our expectations, the complimetary tea, coffee, biscuits and port are a lovely touch. Breakfast is superb. Alan, Moira and Rebecca are wonderful hosts - recommendations about what to do and where to eat are spot on but not foisted upon you. All in all, the whole experience is excellent value for money and we shall be returning soon.", "title": "Like being at home - only better.", "user": "LittleMissShoes", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27840658}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Where do I begin?", "title": "Delightful stay at Glendavan", "user": "LeeOny", "date": "November 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21673554, "likes": {"liked": "— Everything", "disliked": "— Leaving and staying only the one night!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Glendavan was simply delightful, and a great find! We stayed here for our honeymoon for one night, and our only regret was not staying for longer. We were welcomed to the house by Rebecca, who was an absolutely charming hostess. She informed us on arrival that as we were the only guests for the night that we had been upgraded to a suite of rooms in exchange for the room we originally booked. Our upgraded room was simply beautiful, and is definitely worth paying extra for. It consisted of a bedroom with a four poster bed, with luxury bed coverings, a bathroom with a roll top bath and a separate shower with plenty of huge fluffy towels and towelling robes, and best of all a living room, with wonderful views of the woodland, with its own coal fire, fully set up and ready to go. In the morning, we had the choice of a full Scottish breakfast, including haggis and black pudding! plenty of fruits and cereals, smoked salmon and scrambled eggs etc. Breakfast was in a beautiful dining room, where we were served again by Rebecca, and made to feel as if nothing was too much trouble.", "title": "Kind and courteous hosts pure bliss!", "user": "arm52", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18844176, "likes": {"liked": "— Kind and courteous host, stunning accommodation and best ever breakfast.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I would not hesitate recommending this place to anyone, and will definately be back!", "title": "A Wonderful Break", "helpfulness": 1, "user": "MarymacGlasgow", "date": "July 2, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 17426533, "likes": {"liked": "— the lovely house and people", "disliked": "— leaving!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This was our second stay, we first stayed Oct 14 2008 and returned a year later, what an excellent place. We stayed in the suite upstairs last year and then the suite downstairs this year, the hospitality was superb,as was the food. The rooms are gorgeous, spotless and so comfy. The local amenities are great, good food, golf, river Dee etc, loads to do. Cant wait a year for our third visit and have agreed we need to spend more than a night next time so looking forward to a fantastic week end away as soon as possible. We have recommended Glendaven House to many friends. Thanks for a wonderful stay both times.", "title": "Fantastic Place cant wait for third visit", "user": "YvonneMulgrew", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50445189}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This was the first B&B on our scotland trip & it set the standard to a almost unreachable level. Honestly, it was just fabulous. Perfect wheather, perfect environment, wow what a room (absolutely loved the bathtub in the separate bathroom), superfriendly hosts & the breakfast was amazing aswell.", "title": "set the standard", "user": "Yiukohah", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46836980}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We've had some wild and varied experiences with accommodation in our own country (see our other reviews) and to be honest some of our experiences of Scottish tourist areas have, quite frankly, been embarrassing.", "title": "Restored my faith in Scottish Hospitality!", "helpfulness": 1, "user": "Redspecial2000", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40012273}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "It was a pleasure then to trip over this little place- quite possibly the hidden gem of the Highlands! We had originally planned to head to Europe on the Bank Holiday weekend, but rushing to the airport to try and catch flights with tight deadlines put us off. Quite by chance we were wandering about Tripadvisor and found this place and it had a suite at a very reasonable rate available for 3 nights B+B.", "title": "Luxuriant, friendly comfort...", "user": "Nibcfb", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39492197}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 62}, "slim_ranking": 1.0, "description": "Glendavan House is a 5* Gold Bed and Breakfast offering quality accommodation in spacious and luxurious suites of rooms. Each suite comprises large bedroom, en-suite bathroom and en-suite sitting room with real coal fires that will be lit for you in the evenings. The Ogston Suite also comprises a lovely conservatory from which you can watch the army of red squirrels and birds that play on the decking outside. Situated in glorious and peaceful countryside fringing the Muir of Dinnet Nature reserve and within the Cairngorms National Park, Glendavan House offers a fabulous retreat from busy life. Peace and relaxation guaranteed."}