{"user_rating": 4.5, "review_count": 39, "name": "Glenfield Guest House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Situated 10 minutes walk up a hill from Whitehaven town centre, we had a friendly welcome when we arrived on our bikes, which were safely stored in the shed. The room was large with a huge bed and two chairs, TV and tea and coffee making facilities. The bathroom was also large with bath as well as shower.", "title": "Large Comfy Room", "user": "Samkirk9", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 39904862}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Breakfast was good and plenty with cereals, fresh fruit, yoghurt and cooked food.", "title": "If only all B&B's were like this...", "helpfulness": 2, "user": "UkHotelguest", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33114942}, {"rating": 5.0, "stay_parameters": "Stayed April 2009", "text": "If you were thinking of eating in the Italian in town, Casa Romana, you may want to think again. I don’t eat meat or fish so opted for the Penne Arrabiata. We ordered our food and wine together, the wine turned up straight away and then a minute later so did the food! There was clearly no cooking going on and it was like a pasta sauce, well more like curry sauce, out of a jar – and very expensive.", "title": "Very unique and beautiful place", "helpfulness": 2, "user": "ezymove", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32391819}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "This is a really lovely guest house, situated conveniently on the main road south out of Whitehaven, but only about 10 mins walk from the harbour. Rooms are traditionally furnished, but are clean and well maintained with excellent bedding and facilities. The owners are great - exactly the kind of people who should run B&B's - caring and interested, and apparently possessed of a kind of 6th sense for anticipating what you might need or ask. Breakfast was great too, and the home baking smelled so fantastic we wished we were staying longer to sample more of it than just the homemade toast. This was the best guest house we have stayed in for a long time, and well worth the money. Only wish we could have stayed longer!", "title": "Can't complain", "helpfulness": 2, "user": "mysteryshopmaster", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30968415}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "This is a very special place and one of the nicest places we stayed while being in the Lake District. The food was wonderful, the rooms very clean and comfortable. All rooms are named after Alfred Wainwrights \"Cost to Coast\" Guide Book. We stayed in the St. Bees room - which was beautiful and very authentic - and just the right name for rock climbers wanting to climb at St. Bees cliffs ;). The hosts are a lovely and very hospital couple.", "title": "excellent friendly hotel", "helpfulness": 2, "user": "tonyStockport", "date": "February 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25092562}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 1, "very good": 12, "terrible": 1, "excellent": 24}, "slim_ranking": 0.5, "description": "An imposing Victorian house set in a conservation area close to Whitehaven town centre. Spacious en-suite rooms providing bed and breakfast to AA 4 star quality. Superb home cooking, licensed, open fire in the guest lounge and free Wi-Fi internet connection. Evening meals require ordering in advance. Secure cycle storage."}