{"user_rating": 4.0, "review_count": 554, "name": "GLO Hotel Art", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Lovely reception staff. Room small but comfortable beds. Beautiful bath in very 'cool' bathroom. Glass door did not soundproof bathroom so you would need to know your companion fairly well. Dining room serves limited menu in the evening but we enjoyed meals there twice. Not large portions. Breakfast was excellent - great choice and all very fresh. All the staff were lovely and the location is very good.", "title": "A well designed city hotel", "user": "fionnualag", "date": "August 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 138746361}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Since the reviews were so good, I decided to book Glo Art instead of the conference chosen Radisson. However, I was disappointed. First of all the bathroom was not clean. Hairs on the tiles, handprints on the door. I asked twice if they could take extra care. They reacted very friendly but nothing happened. The room I got was probably one of the oldest one; not taken care of that well. Breakfast was fine. AC was making quite some noise and not possible to put out. The location is OK, but still quite a walk to the central places.", "title": "Below expectations", "user": "likeWildfire", "date": "August 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 138704781}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Unless there are only 3 hotels in all of Helsinki, that would be the only way this one is ranked #3. The place is very deceptive, with lovely castle decorations in the entry. After that it is all downhill from there. In 17 days of a long trip, this one night stay was our worst nights sleep. Everything echoes (there is no soundproofing, the walls are thin), we were woken up by late night sounds of people and cars and things, no ventilation in the room and the woman at the desk told me they gave me a free upgrade. If this room was an upgrade 2'X2', I don't even want to know what the lower room looked like (I know 2 people would have never fit in a smaller room). The final offense was in the morning, I asked to buy a cup of coffee, the woman told me the coffee was $3.80 Euro, which equals 5$ in US dollars. I almost passed out, I have never paid 5$ for a cup of coffee anyplace in the world. I went down the street for a coffee 1.50 Euro. Bottled water in room 3Euro,", "title": "You have got to be kidding #3?? No wAY", "helpfulness": 1, "user": "JUneUSA", "date": "August 28, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 138664989}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I now admit it - I am an older traveler and like my comforts away from home. The Glo Hotel Art in Helsinki met every need and then some. First, the staff could not have been more helpful in answering all questions, even to the point of making special changes to our room. Likewise, the delicious breakfast assortment was made ready by a cheerful, young staff who also granted any request. A smile in the morning is my favorite. The room was artfully appointed in contemporary design and furnishings - even a glass-walled shower. Location was only 4 trolly stops from the center of Helsinki, but in a quiet residential area which also had shops and restaurants. One could find anything within a 2 block radius. Our next trip to Helsinki will definitely include the Glo Art.", "title": "Perfection in every way.", "helpfulness": 1, "user": "Peru-love", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137755068}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Stayed with a friend for one night. we were given a room in a new building. Good service, very nice room, excellent beds. Breakfast is not included, but can be recommended to buy it. Warm croissants and home made jam were very good.", "title": "Very nice modern city hotel", "helpfulness": 1, "user": "Lady B", "date": "August 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137186518}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I travelled with my two girls and older mother, and this hotel met everyone's needs. We were delightfully impressed with the 'small touches', like the Glo kids breakfast buffet, the Glo mascot tiger in the room, and of course, the impossibly comfortable beds. When we arrived, there had been an agency booking problem, and the staff dealt with it wonderfully. The room was very clean, it had good views, and the curtains blocked the night light out well. The room was spacious, and the staff were helpful in every instance.", "title": "Glo-ing report", "user": "Krysia B", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134409574}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Really beautiful hotel in a historic building with a tasteful modern high style interior design. The hotel is in a good location walking distance to restaurants, the west harbor, the antiques flea market, and the design district.", "title": "nice roome, gorgeous lobby, good location, good value", "user": "diverguy", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134182916}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "We were not aware the hotel offered the use of bicycles untill the weekend after we stayed the New York Times ran a 36 hours in Helsinki article which mentioned the hotel. It might of been nice if this was mentioned at check in.", "title": "Excellent Value, Great Location", "user": "Fedora-n-FountainPen", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133946913}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The interior design of the room was really stunning, gave me ideas for remodeling at home.", "title": "Trendy, Clean and Central", "user": "candleberry", "date": "July 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133759427}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "I can thing of two minor downsides to the hotel neither of which seemed major to me but I mention them only in case other people might feel these issues are improtant to them.", "title": "Central tasteful jugenstil value!", "user": "Jisa B", "date": "July 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 133618975}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "I stayed four nights in an \"Economy Double Room\". I made my booking with booking.com. When I entered the room I was slightly taken aback at how small the room was, but as I was travelling alone it turned out to be fine, although if I had been travelling with a friend it would have been a very tight squeeze indeed!", "title": "Excellent stay in a Beautiful Maritime City", "helpfulness": 1, "user": "trish990", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135541636}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "My room was on the third floor overlooking a very quiet street, in fact I experienced no noise issues at all during my stay. The room was spotlessly clean and the bed was very comfortable. Breakfast was not included in my room rate and at an exorbitant €18 per day, I chose to have breakfast instead in the nearby Stockmann department store every morning for around €7.", "title": "Interesting quirky hotel", "helpfulness": 1, "user": "ElvisC", "date": "July 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 135538165}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The location of the hotel was perfect, it was within walking distance to all major sights. Helsinki is a really beautiful city. The hightlights of my trip were Suomenlinna Fortress, Uspenski Cathedral and the Olympic Tower.", "title": "Business Trip", "user": "LeCacoin", "date": "July 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 135235031}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I was very happy with this hotel and would definitely recommend it, although if I returned here with a friend I would consider staying in one of the larger rooms.", "title": "Art and service at its best", "user": "Ortwin", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 135122181}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Stayed for a couple of nights in May, in the newer part of the hotel. There do seem to be two distinct parts to this hotel, an older part featuring the reception, restaurant and most of the public areas, and a newer building of mostly smaller bedrooms. I stayed in a single room in the new part and the room was small but every inch of space was cleverly used. It had some interesting features, a wet room style bathroom with glass walls and strategic frosting, a bed which could be electrically raised in various ways, and dimmable light cubes doubling as bedside tables. For a couple of nights it is fine. If I had had a weeks worth of clothes thought, I would have struggled to find places to hang them. The location is good, you're just 10 minutes walk from the centre of town, but if you prefer bigger rooms you should probably check with the hotel to see if you can get one of the larger ones.", "title": "Great room, good value...", "user": "paullem", "date": "July 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135081292}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I have now stayed twice at this hotel for business. It is walking distance to the centre of Helsinki or if you are feeling particularly lazy a short tram ride. Although, I have found that with traffic signals it is almost as fast to walk as it is to take the tram!", "title": "Great value hotel in the heart of Helsinki", "helpfulness": 1, "user": "ab_and_as", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137157640}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "For the price this hotel is vey favourable, especially when compared to the more established brand hotels in the centre of Helsinki. The staff have always been very welcoming and helpful. The rooms are nice and new, spotless and the bed is very comfortable. The bathrooms, again are all newly fitted and therefore feel very clean. When I stayed there (Jun 2012), there was no gym, but the staff assured me that the gym was under construction and would be ready after the summer.", "title": "Lovely hotel, lovely staff", "helpfulness": 1, "user": "Benemma82", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136216399}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "There are only a couple of niggles with this hotel. Firstly the check in process could be a bit quicker. Even staying for the 2nd time they still had to check my passport and I had to fill out all of my details on a card. Secondly there is no hair conditioner in the rooms. Finally in the standard rooms, the lighting is quite poor, especially if you need to work. (My 2nd stay I had a larger room and the lighting was MUCH better).", "title": "You wont be disappointed", "helpfulness": 2, "user": "siof", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136082501}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Stayed on last night of backpacking trip for much needed luxury and were not disappointed - given free upgrade at check in as room available, and despite work going on in hotel, stay was unaffected.", "title": "Like in a castle", "helpfulness": 1, "user": "Olga O", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135784521}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Room was spotless, comfortable and bathroom and shower facilities top drawer.", "title": "Brilliant welcome to Helsinki", "helpfulness": 1, "user": "Peter F", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135676058}], "location": {"country": "Finland", "region": "Southern Finland", "continent": "Europe", "city": "Helsinki"}, "stars": 4, "variance": {"poor": 18, "average": 77, "very good": 247, "terrible": 7, "excellent": 205}, "aka": "Linna Hotel Helsinki", "slim_ranking": 0.179104477612, "description": "The new GLO Hotel Art is a unique combination of a 1903-built Art Nouveau castle, with its variety of charming meeting and event facilities, and a new modern hotel."}