{"user_rating": 3.5, "review_count": 1143, "name": "Globales Cortijo Blanco Hotel", "reviews": [{"rating": 4.0, "title": "Very good value - all inclusive", "text": "We booked 3* Allocated on Arrival 7 nights with My Travel flying from Newcastle. Pleasantly surprised to be sent to El Cortijo Blanco, San Pedro - a couple of bus stops up main road from Puerto Banus. No airconditioning and can be very busy at weekends due to influx of Spaniards but our week overall was very enjoyable. Good location, approx 5 mins walk down the side road to lovely promenade and grey sand beach and bus stop yards away to take us to Puerto Banus, Marbella. We're veggies but self-service food was fine (lovely salads), bar open from 1000 until midnight! The entertainment team work hard too - several professional shows laid on during our week of a good standard. 3 pools to choose from, one much quieter than the other 2. San Pedro a short walk up the road is worth a visit too. This Pretty hotel has well maintained gardens etc and the rooms were cleaned daily. Pueblo style with blocks of ground floor and first floor rooms. Ideally suited for all including wheelchair users, families with children.", "helpfulness": 14, "user": "rosetaylor", "date": "July 2, 2006", "id": 5417339}, {"rating": 1.0, "stay_parameters": "Stayed October 2004", "text": "before i start to write this i am TRYING to think of some good points............................................................................. still trying!", "title": ":( bad bad bad bad bad bad", "helpfulness": 8, "user": "pammymt", "date": "June 22, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5373720}, {"rating": 5.0, "title": "loved everythink", "text": "ANTS! Everywhere, i dont mean a few i mean THOUSANDS in the room, we arrived and opened the wardrobe-bad move it was infested! complained to reception who said we had left food out- we'd only been there 10mins! the came and sprayed the room, no diffrence. i shared my room whith a colony of ants!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 17, 2006", "id": 5146684}, {"rating": 2.0, "title": "My visit to Cortijo Blanco", "text": "FOOD- ok usual repetitive stuff!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 27, 2006", "id": 5013296}, {"rating": 2.0, "title": "House of Horror or Paradise Lost?", "text": "LOCATION- over looking a very very very busy road. there was at least 3 bad accidents a night! to get to the bus stop you have to cross the road-GOOD LUCK!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 20, 2006", "id": 4990747}, {"rating": 4.0, "title": "A good value hotel if you want a cheap holiday!", "text": "This may be a long review but you will be glad you read it - don't be put off by some of the other reviews! I've been meaning to write this for the last month or so. The only reason I'm writing now is because I'm looking to go back and thought I'd checkout the reviews.", "helpfulness": 41, "user": "A TripAdvisor user", "date": "December 8, 2005", "id": 4221847}, {"rating": 2.0, "stay_parameters": "Stayed November 2005", "text": "Me (33) and my mum (50ish!) stayed at the beginning of October for a week. My mum had been before with a group of girls in Jan and recommended it for a cheap hols.", "title": "Flies and sickness", "helpfulness": 6, "user": "hansomone", "date": "November 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "rooms": 5.0, "service": 3.0}, "id": 4111274}, {"rating": 2.0, "title": "Costa Butlins", "text": "We went with First Choice but to be honest, my next booking will be to book flights and accomm myself and get a taxi. Although a little expensive, worth the money as you get to your holiday destination an hour earlier...instead of sitting on a coach stopping and starting along some horrible areas of the costa del sol!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 30, 2005", "id": 4072252}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "When we first got there we were given our key and a little map on how to find our room. We found our room (which was disappointing because we were overlooking the entertainment and bar area). However, I decided that this couldn't be a superior room which we had paid only an extra £20 or so for) and went to reception the following morning. The manageress (English) was very apologetic and said we had been put in the wrong room. She gave us the key for the correct room and we went back to pack and head to our new room.....what a difference for only a little more expense! PLEASE READ....MAKE SURE YOU ASK FOR A SUPERIOR ROOM OVERLOOKING THE GARDENS AT THE BACK. THEY HAVE AIR CONDITIONING AND ARE IN A MUCH NICER PART OF THE HOTEL (AND A LOT QUIETER!)...what a relief!! We could now enjoy the rest of our holiday!!!", "title": "excellent value for money should be a 4*", "helpfulness": 6, "user": "afi_fan666", "date": "October 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4050818}, {"rating": 4.0, "title": "Good Family Clean Hotel", "text": "The food was okay - not brilliant but for all inclusive it was okay. The drinks at each of the two bars were fantastic value. You could basically have anything you wanted....and nothing is measured! In fact we had to tell the bar staff to stop pouting as they were triple measures!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4006772}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Having read some rather negative reviews after booking our holiday we were very pleasantly surprised. We'd decided to go for some winter sunshine and invited another couple of friends to join us. Arriving rather late our first impression was one of amazement as the ever helpful Anita in reception told us leave all our luggage and go straight to the restaurant as it was about to close, we all expected a plate of picked over chips and not much else but were staggered to find a selection which only included chips if you wanted. That set the tone for the rest of our week.The food is not Michelin star quality, but it's varied tasty and plentiful. I did not eat a single chip all week and felt all the better for it.", "title": "A real tonic!", "helpfulness": 5, "user": "ChrisGG1950", "date": "March 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4579556}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The rooms were spotlessly clean and a very high standard of cleaning was maintained all week. The staff were cheerful and friendly and the entertainment was an absolute hoot!", "title": "Fabulous!", "helpfulness": 12, "user": "PenelopeHart", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4475164}, {"rating": 4.0, "title": "fantastic holiday made memorable by the emerald sports bar", "text": "I was very reluctant to go along to the evening Bingo session and had to have a fortifying G&T before my first trip, but it was something I don't think any of our party willever forget. The ladies laughed until they cried and several of the calls will be etched in our memories forever.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 20, 2006", "id": 4366051}, {"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "There were lots of activities provided each day although we used the hotel as a base for exploring the area so didn't take part in any.Anita heard us talking about a visit to a market and instantly produced a list of all the local markets and bus timetables to get us there and back.", "title": "THE WORST", "helpfulness": 6, "user": "MLiverpool84", "date": "January 9, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4334933}, {"rating": 1.0, "title": "The worst hotel I have ever been unfotunate enough to stay in", "text": "The bus service into Marbella is easy to use and the only slight drawback was the return trip when the busy road had to be crossed; fortunately a passing local cyclist stopped and told us where the \"steps\" to the underpass near the neighbouring hotel were so we didn't have to walk too far.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 4, 2006", "id": 4324241}, {"rating": 5.0, "title": "cortijo blanco is the best", "text": "the hotel was very nice all the staff r very nice and antonio (bar staff ) was very nice and sexy i must admit good kisser to he was 18 and looked like ronaldo player for man utd, it was nice and hot the beach was 30 mins away something like that . in a bit luv me xxxxx", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 14, 2006", "id": 4973503}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "Myself and my daughter (16) went for a week in the sun fully inclusive.", "title": "Well It Was An Experience!....", "helpfulness": 2, "user": "SoozF", "date": "April 12, 2006", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4967514}, {"rating": 3.0, "title": "A TRUE STATEMENT IF EVER THERE WAS ONE!!!", "text": "The hotel was fine, fairly clean, maids did our rooms on a daily basis - but did not pay attention to the dust on the floor! But hey we were on holiday who minds a bit of dust.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 10, 2006", "id": 4955140}, {"rating": 3.0, "title": "You Get What You Pay For.", "text": "Not alot to do during the day - did see some avtivites going on but they were more for younger kids. You are issued with an 'all inclusive' wrist band... these are a bit annoying as they play havoc with your tan!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 22, 2006", "id": 4724495}, {"rating": 4.0, "title": "basic good and cheerful", "text": "One of the pools was not open and the pool bar was not operational. We were told by our rep that they had had drainaige problems but advised it would open in a couple of days...... never did whilst we were there.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 18, 2006", "id": 4689615}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 103, "average": 193, "very good": 470, "terrible": 68, "excellent": 309}, "aka": "Cortijo Blanco", "slim_ranking": 0.25, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 3.5}}