{"user_rating": 3.0, "review_count": 76, "name": "Goldbelt Hotel Juneau", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed here at the end of a Ketchikan to Juneau Inside Passage cruise on Cruise West. In advance, we had booked an extra night 6 mos in advance, informed hotel that we wanted water view in combination with the first night that was arranged by Cruise West. Called the hotel a week in advance of cruise to confirm & explain about the extra night. When we checked in they had us in a rear of hotel view. Hotel was booked solid & they couldn't change us to water view. Very poor ventilation & no AC in room. They have a fan that we put in front of open window to get air flow. We had a 6 am flight & had arranged for a 3:45 am wake up call that they forgot about!! Luckily, we had also set alarm clock in room.", "title": "Adequate in Juneau", "helpfulness": 4, "user": "BocaBlocks", "date": "August 8, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8375327}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Room was spacious w/ small TV. Otherwise, adequate, but not special. Staff were friendly & helpful. There was a single computer available in lobby w/ internet access, but could not print boarding pass for flight because printer wasn't working.", "title": "Good Location, so-so rooms", "helpfulness": 3, "user": "AnonymooseAK", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 8222428, "likes": {"liked": "— Location and staff", "disliked": "— Power outlet problems, poor ventilation, and small bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Hotel is directly across from the dock where Cruise West ships come in so it is very convenient, but far enough away from where the large ships come in so that you are not bothered by them. It is a short walk to center of Juneau one way & to the museums the other direction.", "title": "Insure room is in rear of hotel!", "helpfulness": 2, "user": "Debbyghouston", "date": "July 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 8213302, "likes": {"liked": "— Location", "disliked": "— Needs to be updated, pillows need to be replaced"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed here three nights in July. The view (7th floor, water view) was fantastic! The room itself, however, was only mediocre for the price paid. The beds were noisy (sound of the springs in the mattress), but comfortable. The green industrial carpet could have used a fashion update. The bathroom was small, lacked an exhaust fan, and we could tell exactly when our neighbor turned on the tub or flushed the toilet. The soaps and other toiletries (Bath & Body Works) were a very nice touch. The wi-fi was nice, but one of the two desk outlets was non-functional and the other was being used to plug in the lamp, so to run my laptop I had to unplug the desk lamp. Ventilation was via a box-fan, which was silent at the low setting, but very noisy at medium and high speed. Parking was tight at some times (very small lot), in two cases we got the last spot in the lot and felt bad for anyone coming in after us.", "title": "Get a Non-Smoking Room!", "helpfulness": 2, "user": "kime1974", "date": "July 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 8212900, "likes": {"liked": "— Location", "disliked": "— Cleanliness"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "All in all, I was not very impressed by the room, especially considering the price. But the location was very, very convenient, and the staff was incredibly helpful (Jessica, the front desk clerk, went so far as to get the elevator for me when my hands were full and punch the button for my floor -- a big thumbs up to them!)", "title": "Pretty good", "helpfulness": 3, "user": "Trippinbrit", "date": "June 18, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 7924625, "likes": {"liked": "— Quiet room", "disliked": "— Restaurant"}}, {"rating": 4.0, "title": "Great place to eat", "text": "This hotel has one of the best restaurants in town. I select it to eat, often. The largely Alaskan Native staff are friendly and well trained and the food is excellent.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 24, 2004", "id": 1834702}, {"rating": 4.0, "title": "Best hotel in Juneau", "text": "We went to Juneau and were put up in the Goldbelt hotel by the company that flew me out there. My wife and I turned it into a vacation and are very glad we did. The Juneau area is unmatched in it's beauty and, despite it's small town atmosphere, was not as small as we thought.", "helpfulness": 9, "user": "DenverTraveler35", "date": "September 25, 2003", "id": 1364789}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "The hotel was nice-certainly not anything like you can find in NY, San Francisco, Vegas, or any other big city but it sits on the channel and a water view room is definitely nice. The rooms are nice sized and the bed is very comfortable. The staff was friendly, although the hotel could use a complimentary paper besides the pathetic Juneau Empire-a Wall Street Journal or USA Today would be nice.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 5, 2003", "id": 1071318}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I stayed at the Goldbelt for six days in February, 2007. Downtown Juneau is compact. While the Goldbelt is at one edge, it was convenient to everything. The room was clean, good hot water, good amenities. There's a free shuttle to/from the airport. Zen, their restaurant, was excellent. Jaded, the bar, is frequented by all sorts of people. There's good music on Fridays and Saturdays. Not luxurious but more than acceptable.", "title": "Very comfortable", "helpfulness": 3, "user": "nola2ak", "date": "March 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6907925, "likes": {"liked": "— Free wifi", "disliked": "— Breakfast not available daily."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I was pleasantly surprised with this hotel. I stayed in a B&B my first 2 nights in Juneau, but had to transfer to this hotel for the 3rd night since the B&B was booked. From the outside, the hotel didn't look like much. However, the room was clean and spacious. The free shuttle to and from the airport/ferry made up for the higher price compared with the B&B - will save you $20 (airport) or $30 (ferry). The location was at the edge of downtown, close everything without being in the middle of everything. It was quiet at night, compared to the street noise we heard at the B&B. There are many restaurants nearby too. Would definitely stay at this hotel again.", "title": "Enjoyed my stay", "helpfulness": 11, "user": "pandasfl", "date": "June 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5288612}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "Just got back from Juneau and stayed at the Goldbelt twice, at the beginning and end of our trip. The rooms were the quality of a mediocre Holiday Inn somewhere else, but at a very expensive price. The first two nights we had what was billed as a Water View room (room 301 I believe), but you could only see the water by peering out the window to the left and glancing between buildings - and even then only at high tide. The last night we were in room 502, which had an amazing water view. I wish we were given that room initially.", "title": "OK - not many other options", "helpfulness": 13, "user": "V Traveler", "date": "August 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 3734759}, {"rating": 4.0, "stay_parameters": "Stayed May 2004", "text": "The location is great, and the free airport transfers were a definite plus - it saved us $20 each way. The restaurant was good for breakfast - eat there or at the SilverBow or Paradise Cafe up the street. Restaurant service was awful, but hotel service overall was good. They are usually packed with tours and people going to or coming from cruises, so the lobby was usually full of suitcases. The cleaning staff was very nice.", "title": "Great view", "helpfulness": 9, "user": "surfcrab", "date": "May 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3435518}, {"rating": 4.0, "title": "Quite Surprised", "text": "We would probably not stay there again - we found some B&Bs that looked cuter. But overall not bad. I would have given it 4 stars if it was a little less expensive.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3240072}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed here for 4 nights and had no problems. Nice large room with a comfortable king bed and good-sized bath with all the amenities you'd expect in any moderate-priced US hotel--not luxurious, but perfectly adequate. The hotel is clean, well-maintained, and the location can't be beat for access to downtown Juneau and the waterfront. Two minor criticisms: front desk staff is courteous, but not warm; TV would not accept channel number input from remote, so we had to scroll through channels to get the one we wanted. But again, overall a very enjoyable stay.", "title": "Had a Good Stay", "helpfulness": 2, "user": "WHTraveler", "date": "July 23, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18181194, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed here as part of our Cruise West cruise before boarding the ship. The hotel was just average but I'm not sure there is much better in Juneau. The location was fine for downtown shopping and site seeing. When we first arrived it was an exceptionally warm (80 degree) day so the room was hot (no air conditioning or ceiling fans) on the sunny side of the hotel. I complained and they gave me a room around to the side that wasn't as good of a view but was a little cooler and a little quieter. The staff was very nice. There is a Chinese Restaurant in the lobby which is not fancy but the food was good and the service was fast and friendly.", "title": "not bad", "helpfulness": 1, "user": "bjpremierontheroad", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 17850211, "likes": {"liked": "— staff", "disliked": "— no ac or fans"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "As other reviews indicate, there is nothing particularly special about the rooms at the Goldbelt, but the location is top notch for being in downtown Juneau and not needing a car. We found the rooms to be comfortable and clean, pretty good bathroom, and our 7th floor front room was reasonably quiet with very good views. Shuttle from airport was very convenient, and our check-in was smooth; the desk also was helpful with restaurant recommendations. We found breakfast at the hotel to be ok, but dinner at Zen was quite good. All in all we were quite satisfied and would return.", "title": "Decent with great location", "helpfulness": 2, "user": "SantaFeUser", "date": "June 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 17005765, "likes": {"liked": "— Location", "disliked": "— No real complaints"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I have stayed at the Goldbelt several times on business to Juneau the latest was last week. The hotel could use some sprucing up of their dated furniture and flooring. Great views on the Harbor side, especially on a rare clear day.", "title": "Good downtown location, nice views", "helpfulness": 3, "user": "Jaegerak", "date": "May 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15893326, "likes": {"liked": "— Location", "disliked": "— it was raining"}}, {"rating": 3.0, "title": "A big box on the edge of shopping", "text": "The have remodeled their restaurant, I have not eaten there yet but it is always busy so they must be doing something right.", "helpfulness": 1, "user": "k6tfz", "date": "August 27, 2007", "id": 8514886}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 9, "average": 40, "very good": 22, "terrible": 2, "excellent": 3}, "aka": "Juneau Goldbelt Hotel", "slim_ranking": 0.625}