{"user_rating": 4.0, "review_count": 310, "name": "Golden Tulip Little Palace", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Our stay in Paris was for my 30th Birthday. I wanted to soften the blow. lol. The service was amazing. I only know a few words in French, literally. The reception staff was amazing. All friendly, all helpful, all at my beckon call. This hotel was not pricey, I received a room with a balony, nice bathroom (not big by american standards) but all we needed and renovated for about 600 USD for a three night stay. My husband also prearranged flowers and fruits to greet me in the room when we arrived and displayed a nice arrangement.", "title": "Impecabile Service", "helpfulness": 2, "user": "30inParis", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 105385088}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "I will agree the elevator is small. But we it was part of our experience. My husband and I and my cousin and his wife mushed ourselves in and took pictures on the ride up. Cute! the Parisian Experience! The hotel was walking distance to the Notre Dame, and there you can pick up the hop on hop off bus tour where essentially we used it as transportation, to get to the Louvre, Champs Elysees, the Effiel, and other sites. There is a Monorix down the street from the hotel for anything you need, pharmacy on the corner and the club Rex. We were late for our reservations twice, once at Dans Le Noir and the other the Four Seasons Le Cinq :) and they called and rescheduled for us AND arranged car service.", "title": "Thanks", "helpfulness": 1, "user": "ParisProd", "date": "April 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 104390719}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Beware: I would suggest for you to hale your own cab unless you are mega late. The cab started his meter where ever he left and we paid like 16 euros for a 6 euro trip. Aweful, but i presume not their fault. Thats what we asked for. I would definetly stay there again. I almost forgot, upon arrival as we waited for our rooms to be ready, we were very early, we were served tea and coffee, how chic! This hotel was definetly worth my money. Take it from a teacher from NY. :) Happy travels", "title": "Clean, Friendly, excellent location... a very nice exerience", "helpfulness": 1, "user": "aulicny", "date": "March 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100863072}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Great personnel, very forthcoming. Justust had a few clients there and everyone loved it. The rooms with balcony on the South side are the Best...", "title": "Amazingly friendly staff", "user": "TalisVertriest", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100374099}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Clean, Friendly, excellent location... a very nice exerience. Wonderful staff.", "title": "One of Paris top 30% hotels", "user": "johangente", "date": "February 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 97200464}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We got to the hotel at night and the immediate impresion was that we did a bad mistake. A heavy small of urine wellcomeed us outside of the hotel, it was dark and some homless drunk people were hanging there passing their time breaking empty bottles. In the morning it looked better espwecially if yoy walk to the side of St martin street and not Sebastopol.The staff is excellent. The description of a superior room does not match the room we got: a small badly planned room facing a wall at the back of the hotel. The price is high for a 3 stars hotel in a not so great neighborhood", "title": "friendly staff compensate for the disadvantages of the hotel", "helpfulness": 2, "user": "tzili", "date": "June 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 5.0}, "id": 112003534}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed in a double room on the 6th floor with a small baloncy with a pleasant view of the square across, the arts and metier museum and near by rooftops - very parisian. we could even see the top of the effiel tower! the lifts are small but the room itself spacious for paris. our bathroom was tiny but the balcony made up for it. we ate nearby and walked to the marais, canal st martin and louvre from here. metros are close by and there are many restaurants to chose from - had great crepes from houblon & sarrasin.", "title": "great location and would recommend", "user": "yvrldn", "date": "June 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 110984219}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed here for my mums 80th birthday trip to Paris. The hotel is well located to be able to easily get to all of the main spots and the staff are helpful with any information you may need. My parents had a small room on the 7th floor with a balcony from which they could see the Eiffel Tower and they enjoyed this although it was little cramped for older people. Our room was larger but no view which was not an issue as we were there for my parents enjoyment. It was a good stay and an affordable one as we had 3 rooms!", "title": "WELCOMING AND GREAT LOCATION", "user": "PamBDc", "date": "May 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 108963967}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Our first room, a top floor \"suite\" at the back, was poky and up in the eaves (couldn't get into the bed on one side). We complained and, the next night were, in a second floor twin room, with very small shower room, at the front of the hotel.", "title": "beds were small but staff helpful and good view and location", "user": "OhGetOn", "date": "May 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 108611392}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This room has a lovely view over the garden square (and is still fairly quiet for central Paris). Staff were kind and helpful and recommended excellent restaurants for petit dejeuner and diner. (We didn't use the hotel for breakfast).", "title": "Great staff, mediocre location for price", "user": "Ajm4", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 105677424}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel is a 3 star but in the centre of Paris and within easy distance of most attractions and very close to an underground station. We had a room at the top of the building with a small balcony overlooking the park opposite. The rooms are quite small but clean and the staff are very helpful. If I had a couple of small criticisms it's that the walls are very thin and you can hear the televisions of adjoining rooms and even the occupants talking. Also it was quite warm for the time of year when we visited and the air con didn't work and the room was unbearably hot. We left the balcony window open in the night as the road does get quite quiet.", "title": "A nice small hotel very conveniently placed", "user": "Chris4817", "date": "November 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 120453197}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "i'm hesitant to write a good review here because i'd like to keep this place a secret because it has so many positives! this is a small establishment right next to the remau sebastopol station and a 15 minute walk to marais/centre pompidou. i stayed for five nights with a friend in a twin room with a balcony that overlooked the park. recently renovated and modern, this is a real gem because its quiet, comfortable and offers great value by paris standards. the front desk staff were friendly and helpful during my stay. i would stay here again anytime.", "title": "quiet, convenient and great value", "helpfulness": 1, "user": "gabewong", "date": "November 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120139568}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Small hotel is close to the metro station. Nice quiet area. Rooms on upper floors have small balconies with nice view of park and city. The staff is very friendly. Lots of cafes close by for breakfast. A good walk to the river, Notre Dame and the Louvre. World's smallest elevator. The staff was very helpful and friendly.", "title": "good value for money in Paris", "user": "ambrotraveller", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 119938941}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed at this hotel 9/13-9/15/2011. Our first time in Paris, we really liked this hotel. It is in a good location, we walked to the Louvre and numerous cafes & shops. The staff is very helpful & pleasant. We used their driver to pick us up at the airport...what a godsend, Lionel is the best driver & a nice person. My partner's mother was with us...he was most considerate , helping her in & out of the car...& whenever he would see us in the hotel, he always had a smile for us. Our room was very nice..clean & comfortable. The bedroom was plenty big, very pretty & the bed comfortable. The bathroom was a nice size & modern. The breakfast offered downstairs every morning was a good way to start the day; coffee, pastries, cold cereal, juice , hard boiled eggs, etc. The hotel is on a quite 1 way street with a park right across the street. There is also a dependable lift in the lobby. We were very happy with our stay here.", "title": "Highly recommend this hotel....good location, good staff.", "helpfulness": 2, "user": "laura g", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119148565}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The hotel is well-placed for the main attractions of Central Paris - it's about a 15 minute walk to the centre. It overlooks a small park and the rooms near or at the top have wonderful views of the Paris rooftops and the Eiffel Tower - beautiful at dusk. The hotel staff were very helpful and friendly and the breakfast was delicious.", "title": "A very nice, well-located hotel with friendly helpful staff", "user": "Angela M", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117731754}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We found the staff very helpful and accomodating . Asked for a room change for a better view . They checked and found another room , commenting it was a little smaller but a great view including a balcony (great view of the tower in the distance) . Very clean and well presented . Buffet continental breakfast plenty of choice and well presented . Metro just around the corner for ease of getting around .", "title": "Ideal for the short break", "user": "SandG017", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117094750}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I booked this nhotel with specific instructions for the ground floor wheelchair room. arrived at the hotel and was told that already booked. It was 6pm and they did offer to ring round hotels to find me a room but to be honest I had done that exercise when booking and they are the only ones to have wheelchair room free.", "title": "Disabled in a wheelchair and double booked", "helpfulness": 1, "user": "Gig1964", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117073592}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I agrred to struggle in the lift using my crutchd leaving chair to charge in hotel lobby. This cause me a lot of pain and discomfort.", "title": "Fantastic! :o)", "helpfulness": 1, "user": "Luksus", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116244287}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The staff were excellant and supportive and I cannot critisise their effiency. Room was well decorarated and clean and not a very noisy hotel at all.", "title": "Good value and location", "helpfulness": 1, "user": "david183", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116160999}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Again on the downside there were 2 steps upto hotel with door bell out of reach of wheelchair and the ramped they used was too shor so was dangerous to use.", "title": "Will not use this again", "helpfulness": 2, "user": "Leif69", "date": "June 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 1.0, "service": 3.0}, "id": 114584810}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 15, "average": 46, "very good": 166, "terrible": 15, "excellent": 68}, "aka": "Golden Tulip Little Palace Hotel", "slim_ranking": 0.281093139989, "description": "Facing a peaceful and beautiful garden , the Little Palace Hotel offers a quite location in the center of Paris. Between Le Marais, and Beaubourg, a short walking distance to the main tourist sites: Le Louvre, the Picasso museum,Place des Vosges, the Bastille, Pompidou art center, Notre Dame.The metro Reaumur Sébastopol is in front the hotel on the boulevard de Sébastopol, direct connection to RER les Halles on the way to CDG airport, Disneyland Paris."}