{"user_rating": 3.5, "review_count": 215, "name": "Golden Tulip Rio Vermelho", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The hotel was fine - nice rooms, good service from reception and in the dining room. We arrived late after trying to sort out missing bags at the airport and keen to unwind with a drink. Bar had just closed at midnight, and we had to wheedle a bit but they did let us have a drink.", "title": "Not sure about location", "helpfulness": 2, "user": "eiluvtravel", "date": "October 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 5948179, "likes": {"liked": "— quality and comfortable rooms", "disliked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Not sure about location but it depends what you are in Salvador for. We just wanted to do the tourist stuff around the Pelourhino, which is a good half hour taxi drive away. For a short visit I would have preferred a hotel in the Pelhourinho, but I think the Blue Tree Tower was probably more comfortable and less noisy. Our room overlooked garden and was very quiet - or perhaps we were just so tired that we didn't hear any local noise!", "title": "Average Hotel in Salvador", "helpfulness": 1, "user": "P01904", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 5610197, "likes": {"liked": "— Nice views from roof top pool and restaurant", "disliked": "— Location and noise"}}, {"rating": 5.0, "title": "Carnaval in Salvador", "text": "My wife and I stayed here at the beginning of a 2 week tour of Brazil at the end of July 2006. Our room was quite spacious and clean, if a little dated and poorly lit. We were staying here for 3 nights during the Brazillian winter/low season and so the hotel was very quiet (in terms of number of guests) and we were only one of a handfull of people in the dining room when we ate in the hotel. We opted for the evening buffet as we wanted something quick. It was pretty cheap, less than £10/head but of only average standard.", "helpfulness": 4, "user": "bajan3+", "date": "March 7, 2006", "id": 4591603}, {"rating": 4.0, "stay_parameters": "Stayed June 2004", "text": "We felt the location of the hotel was poor for a few reasons. The hotel is perched on top of a hill and a steep climb up from the main road below. There did not appear to be any decent looking bars or restaurants near by. In fact we heard from a local guide that you need to be quite careful if wandering about in the area and try to aviod carrying handbags, jewelly and cameras. A taxi seemed the only option to get around and would take around 20minutes to get to the Pelourinho district. Although the hotel has excellent sea views from the roof top swimming pool there is no beach at the hotel. The final issue about the loaction was the close proximity of a number of scruffy looking bars to the hotel which were quite noisy right up until 6am, so pack a pair of ear-plugs. These will also help block out the noise from within the hotel as all the floors are tiled which means trollies, chairs being scrapped and footsteps also create a lot of noise.", "title": "Great service, location could be better", "helpfulness": 7, "user": "traveling_couple_80", "date": "September 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3943597}], "location": {"country": "Brazil", "continent": "South America", "city": "Salvador"}, "stars": 3.5, "variance": {"poor": 18, "average": 54, "very good": 93, "terrible": 4, "excellent": 46}, "aka": "Golden Tulip Rio Vermelho Hotel Salvador", "slim_ranking": 0.454545454545, "description": "Golden Tulip Rio Vermelho is close to all the best beaches of Salvador. Located just 30 minutes from Salvador International Airport and 9 kilometers from the city center, where the city’s Pelourinho and Mercado Modelo tourist attractions are located.The hotel has 200 apartments, distributed in three categories, os apartamkentos Standard, has an area of 30m², with air conditioning, safe, TV with cable programming, telephone, wi-fi internet and minibar. The Deluxe apartments has an area of 40m² with many comfort and convenience."}