{"user_rating": 4.0, "review_count": 4942, "name": "Golden Nugget Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "We had a very enjoyable experience at the Golden Nugget during our 4 night stay in September. Check-in was very efficient and friendly after a very long day of travelling from England. There were several minor problems with our room but having spoken to personnel on the reception desk we were swiftly moved to another on the same corridor. The room was extremely comfortable and large and was fine as a base as you're not likely to spend that much time in your hotel room in Vegas! The location is great for the Fremont St experience as it's right outside. We had no car, but getting onto the strip was pretty straightforward as the Deuce double decker bus leaves downtown regularly and stops all along the strip. It's quite slow, however! The ongoing renovation and refurbishment at the Golden Nuggett didn't bother us at all and I'm sure it'll look fantastic when completed. The price we paid was amazing value for money - check the hotel website for offers.", "title": "Very pleasant stay", "helpfulness": 4, "user": "TimPithers", "date": "September 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5891972}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "Stayed for 4 days at the Golden Nugget as a \"Vegas Virgin\". The hotel looked very nice, was very clean and the room was very spacious, compared to European standards anyway. Shower and bath provided but the shower was crap. The walls were very thin so I had to endure a couple coupling on a couple of occasions!", "title": "Not bad", "helpfulness": 8, "user": "SimmoUK", "date": "September 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 5832308}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Had to queue for breakfast and due to renovations, there is only one other coffee alternative (Starbucks) with 10-15 minute queues each morning. The staff were very friendly and the hotel clean. Next time I would stay on the Strip as it's where I spent all my time as it turned out and a can costs $15 or so each way. The Fremont St. Laser Show is right outseide and is excellent.", "title": "Stay away from the Nugget", "helpfulness": 11, "user": "safetyman", "date": "September 24, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 5831869, "likes": {"liked": "— not much", "disliked": "— Poor location,some of the staff"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006", "text": "We arrived late at night & settled down for a long rest after a long day of delayed flights from England only to be woken in the early hours by Harley Davidson Motorbikes.It turned out out to be a Hogs & Heifers weekend which the hotel was activley participting in. The constant rumble & vibration from these machines made it impossible for us to enjoy ourselves as we are not in to motor bikes.When i spoke to the Golden Nugget staff they did not appear to be interested . Either the Golden Nugget or expedia should have warned us about this activity.", "title": "Awful", "helpfulness": 7, "user": "trivster", "date": "September 21, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 1.0, "cleanliness": 1.0, "rooms": 1.0, "location": 1.0}, "id": 5823266, "likes": {"liked": "— using the phone to book another hotel room", "disliked": "— too numerous to mention"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The Pool is also a construction site , again we were not warned about this,as we were looking forward to relaxing by thepool.", "title": "Awesome!", "helpfulness": 7, "user": "hypnoticrichard", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5813599}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Our stay at the Nugget didn't start off too well because of a power failure and a problem with our room but once these issues were resolved we had a great stay.", "title": "Proper Las Vegas Hotel", "helpfulness": 1, "user": "Grant_George", "date": "June 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7842716, "likes": {"liked": "— The pool.", "disliked": "— The power failure tripping the fire alarm."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Our room was more than big enough although the beds were only standard doubles so not the full american luxury experience.", "title": "A real Gem", "helpfulness": 2, "user": "joemel", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7840715, "likes": {"liked": "— The Pool", "disliked": "— In room A/C was a bit loud"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "The hotel is an authentic part of the real Las Vegas not one of the show hotels like on the strip. The casino is massive and they run classes in most of the table games if you know nothing about gambling.", "title": "Ate well @ Nugget", "helpfulness": 1, "user": "madison666", "date": "June 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7839760, "likes": {"liked": "— Restaruant choices and quality", "disliked": "— Bathroom: small, dirty"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The swimming pool is amazing with a shark tank in the middle which has a water slide running through it!", "title": "Loved the Golden Nugget", "helpfulness": 2, "user": "bluespix77", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7834182, "likes": {"liked": "— Excellent large rooms", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Have dinner at Vic & Anthonys steakhouse if you fancy a big splurge, the steak is amazing and the service is second to none.", "title": "The place to stay downtown", "helpfulness": 1, "user": "LCarpenter", "date": "June 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7800123, "likes": {"liked": "— Location and Food", "disliked": "— Long check in line, but that happens everywhere in Vegas"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008", "text": "30 minutes to check in. The pool was completely closed on Sunday. Buffet service cashiers had trouble understanding English. Shower was broken, and when the maintenance man came to fix it he tracked mud all over the shower so I still didn't want to use it. The room door was warped and extremely hard to open and close. The TV was large, but didn't have HBO. Spammers in the lobby kept trying to sell you time shares. Otherwise, it was a decent hotel. No one of these things would put me off the hotel, but taken together they add up and I can't imagine staying here again.", "title": "Too Many Glitches", "helpfulness": 2, "user": "elharo", "date": "October 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 20530427}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "This is one of the worst hotels I've had stayed at, there were numerous problems with our stay. When my husband and I arrived, we were supposed to get a king bed. After a lengthy check-in we were told that we would have to take a room with two doubles (very small). We were ok with that because the hotel said they would contact us the next morning to move us to a new room.", "title": "Awful stay", "helpfulness": 4, "user": "lisa11wa", "date": "September 29, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 20481955, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "When we got to the room (south tower, 22nd floor) we were not happy. The entire NON-SMOKING floor smelled just like a dirty ash tray, especially in our room. Obviously, this floor was at some point a smoking floor. Further evidence was provided in our room by bed sheets with BURN HOLES in them! There was A/C in the room but it was very loud and rattling. The next day the staff never contacted us to change rooms, so we had to pester them about it. After numerous phone calls, extended wait times, and hang ups we finally got someone (a manager) to tell us that our new room was ready at 7pm, not in the morning as they had promised. When my husband went to the front desk to get the new key, they left him standing there for a half hour before they finally gave it to him.", "title": "Was ok, but not great", "helpfulness": 1, "user": "MicheleMartuscelli68", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 2.0}, "id": 20448421, "likes": {"liked": "— The pool", "disliked": "— The room"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We moved to the new room (south tower, 18th floor), the floor did not smell like smoke and we got the king bed. I thought we were all set! WRONG! Our new room had WET carpet, yes really wet! It was apparent, by the smell, that someone had puked on a few areas of carpet and staff had washed it up with a strong floral smelling cleaner. Yummm, our room smelled like pukey flowers and we had to make sure not to step in the wet spots. This room also had a loud A/C, though this one didn't rattle like the previous room. Just to make things even better, the \"On Demand Movie\" option on the TV was broken so we couldn't order any movies and the wireless internet was broken in the entire hotel! We were there for a software consultant convention.... and imagine... broken internet! And as if this trip was not perfect enough, on our last day there I decided to use a lit make-up mirror that electricuted me. Yes, really, the brass base of the make up mirror was live (luckily low voltage). The hotel sent security up to check out the mirror. When they arrived they grabbed the mirror and told me there was no current in it..... I then pointed out their rubbed soled shoes and told them to take the shoes off then grab the mirror (duh, simple physics). They didn't want to do that.... point is, even if I was some crazy lady and was imagining the whole thing, they should have taken it away with no questions and replaced it, not give me a hard time about it.", "title": "Bad hotel, bad service", "helpfulness": 3, "user": "Monkeybrains11", "date": "September 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20424938, "likes": {"liked": "— Leaving", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Overall, this place was awful. In addition to all the above, the decor was extremely old, there was no refrigerator in the room, the lighting was poor and it was not worth the money. It's in \"old Vegas\" and is a $20 cab ride (one way) to get to the strip. I heard from some people the renovated North tower was a bit better but it is more expensive and there are still the same issues with staff, if I wanted to spend more money I would have stayed someplace else entirely.", "title": "Not my first choice", "helpfulness": 1, "user": "Road__Less__Travld", "date": "September 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 20388053, "likes": {"liked": "— The Shark Tank", "disliked": "— Ambience and Hospitality"}}, {"rating": 2.0, "title": "over before it started", "text": "I have never been to downtown Las Vegas before, usually stay on the Strip. Decided to try the Golden Nugget for one night on our way back home from a long road trip, mostly because of the positive reviews on TripAdvisor, and their website looked promising.", "helpfulness": 6, "user": "kingsberry", "date": "June 30, 2007", "id": 8031107}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Downtown LV is down at the heels and depressing. Despite efforts to spiff it up, it is a far cry from the Las Vegas Strip. The Golden Nugget appears to be the jewel in that dreary crown. The common areas and casino look nice, and we enjoyed lunch at the Carlton Cafe. However, the pool area at the GN is disappointing, teeny and jam-packed. Sharing a pool with such a throng must be unsanitary, personally I wouldn't put even a toe in that water. Although I realize that GN doesn't have the real estate that the Strip hotels have, the pool area is in no way sufficient for a hotel with nearly two thousand rooms!", "title": "Great Hotel", "helpfulness": 2, "user": "Jackie-London", "date": "June 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8018979, "likes": {"liked": "— Pool Scene"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We never made it to the room. After waiting in the check-in line for 45 minutes, we were no closer to the desk with its many windows showing closed signs. Mind you, this was not even a holiday or a weekend. Exhausted and frustrated, we called the reservation number and asked if we might please cancel our reservation and not be charged for the night. The agent on the phone was very accommodating, and agreed to credit back the room rate to my card. Although we had driven for the previous ten hours, we got back in the car and drove four more hours home rather than wasting one more minute of our precious time in that unreasonable line.", "title": "Terrible Service", "helpfulness": 7, "user": "Crashpro", "date": "June 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 5.0, "location": 1.0}, "id": 7977219, "likes": {"liked": "— the pool", "disliked": "— the service received from the front desk"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "Obviously there is a serious problem with check-in at the Golden Nugget that they are not addressing. They should wake up and realize that people standing in line aren't out in the casino giving up their money! They should hire some more agents or at the very least be offering complimentary cocktails for the inconvenience.", "title": "Impressed", "helpfulness": 14, "user": "dirishlove", "date": "June 22, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7960012, "likes": {"liked": "— Hotel is nicer than most BIG NAMES on the strip, and relaxed enviorment", "disliked": "— VIP Check in host"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We have recently returned from a 3 night weekend stay at the Nuggett. This is a great hotel and definately the best downtown hotel by a long way. Rooms are nicely furnished and spacious. The pool area is fabulous with the shark tank and waterslide going through. Only negative is the loungers are extremely close together, but then they need to be to accomodate everyone. We eat at the Carson Cafe and also the Buffett and both were great. We have stayed here 5 times now and have always been very impressed. The prices have definately gone up but then they have spent a fortune on the hotel so I guess that is expected. I would definately recommend this hotel if you are planning to stay downtown", "title": "The Golden Nugget is a Golden Experience", "helpfulness": 6, "user": "cjennt", "date": "June 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7952437, "likes": {"liked": "— The rooms, service.", "disliked": "— Long walk to hotel lobby for self-parking guests."}}, {"rating": 3.0, "title": "The Golden Lady is starting to show her age a bit.", "text": "Have spent many happy times at the GN over the years.", "helpfulness": 4, "user": "ricoba", "date": "August 9, 2006", "id": 5589459}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "She is a great property and in a great location, since we really enjoy downtown Vegas & Fremont Street.", "title": "Best hotel-casino we have stayed at in Las Vegas", "helpfulness": 9, "user": "Trevor101", "date": "August 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5565923, "likes": {"liked": "— Value for money"}}, {"rating": 5.0, "title": "Golden Nugget was GRAND", "text": "But having said that, was a bit aware this past stay, that the Golden Lady of Downtown is starting to show a bit of wear & tear....afterall she is celebrating her 60th birthday!", "helpfulness": 4, "user": "bsg5698", "date": "August 4, 2006", "id": 5559021}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We reserved directly through a casino host & got great service etc as always.", "title": "Loved the Golden Nugget", "helpfulness": 10, "user": "dietcoke85", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5544692}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "The room in the North Tower was clean, but it's time for some updating. The carpet, chairs, bath fixtures etc are all starting to show their age.", "title": "Golden Nugget - A Grand Lady", "helpfulness": 20, "user": "cheribob", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5539435, "likes": {"liked": "— beautiful hotel at a bargin price a lot of stores/restaurants within walking distance", "disliked": "— no pool"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "Just got back from staying at the Golden Nugget Hotel in Las Vegas, and boy, did I have a GREAT time or what? Everything was super clean - from the rooms, to the public restrooms, to the gaming tables and slot machines. I loved the atmosphere! I have not been to Vegas in a long long time, especially not to the downtown area which never sounded appealing to me. I took this trip with Good Times Travel, based in Fountain Valley, so everything was arranged by them. I personally would never have made an effort to book downtown, leave alone the Golden Nugget. All I can say is that I love this hotel, swimming pool, shark tank, gym, spa, and the fact that I saw every age group represented. What a happy place. I will definitely be back !!! and look forward to seeing the \"ceiling\" show at night (projcected onto the ceiling of the roof over the pedestrians-only street). The music and graphics were awesome. Never knew about that little surprise!", "title": "Golden Nugget is a wonderful surprise", "helpfulness": 2, "user": "02212012aj", "date": "June 6, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 7790084, "likes": {"liked": "— AMBIENCE"}}, {"rating": 4.0, "title": "A great Vegas value!", "text": "Marci Wiesen", "helpfulness": 1, "user": "kmike566", "date": "June 5, 2007", "id": 7780218}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed at the Golden Nugget April 26-30 and I was happy with the trip overall but a bit disappointed. This is the 3rd time that I stayed at the Nugget and the first since it was bought by Landry's and renovated. The new gaming floor and pool is very nice, everything I hoped it would be. Also the sportsbook is now modern and confortable even though still WAY too small. The same can be said for the new poker room. It is modern and I love the daily hold'em tournaments but there are only 10 tables and they are so close together that you are pressed up against the table your sitting at. I have read several reviews about the service and I had always been extremely happy with the staff at the Nugget until this last trip. I don't know if I just had bad luck but if so, then so did the other members of my party. Everything from a blackjack dealer personally insulting me while dealing to a waiter refusing to find my server who was AWOL because she said that wasn't her job. To be fair there was some of the usual great service I expect from the Nugget but on the whole I was very unhappy with the service. I would still recommend this hotel for anybody who loves old Vegas, gambling, or staying downtown. When it comes to hotels in Vegas, the Nugget is easily the best one not on the strip.", "title": "Horrible Experience", "helpfulness": 9, "user": "Dallas_TexasDee1", "date": "June 3, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "business": 3.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7753416, "likes": {"liked": "— I did not", "disliked": "— service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We stayed at the GN in Las Vegas May 27 - June 1, 2007. It was a terrible experience. I have stayed at this hotel for years and have always found it to be a great place to stay, but this visit was not the case. Evidently they are now going for quantity and not quality. With their new pool and arcade for kids they evidently want a different clientel. Kids running in the halls, couldn't find a place to sit at the pool and when did get in the pool it was not relaxing as in the past because of all the kids. Also for the first time have trouble taking a nap in the afternoon because people in room above were running and stomping. Call the front desk but it did not help. On the thrid day no one even answered at the front desk. Phone rang for seven minutes before it finally cut my call. If you are looking for a restful place my advice is not to go to the Golden Nugget in Las Vegas.", "title": "Great Staff at the Golden Nugget", "helpfulness": 1, "user": "Leelab", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7722782, "likes": {"liked": "— Great Staff", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at the Golden Nugget the beginning of May 2007.", "title": "Golden Nugget rocks!", "helpfulness": 1, "user": "dthopson", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7714585, "likes": {"liked": "— Value - excellent hotel for a very reasonable price!!! It was immaculate also.", "disliked": "— People bringing their children, there was nothing about the hotel that we were unhappy with."}}, {"rating": 4.0, "title": "Great", "text": "My husband and just returned from a 5 night stay. Our room was very nice clean and quiet. Maid service was excellent. We never did eat there so I can not comment on that. Even though it is being renovated the casino was clean spacious and did not notice much of the construction. Check in was fast and we checked in early. Checked out on the tv and made it to the airport with plenty of time to spare. When we go back this winter we will stay there again. We really enjoy downtown compared to the strip, it is not as crowded and you dont have to walk forever to get from place to place. Had dinner at Limericks at Fitzgeralds it was awesome. Great food nice steak house but also casual and a wonderful waitstaff.", "helpfulness": 17, "user": "vegascrazy96761", "date": "August 27, 2006", "id": 5713953}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We liked this hotel because the price was right, our room was clean, the bed was comfortable, and the food was tasty. You can't compare it to some of the hotels on the strip, but it's the nicest place in downtown Vegas. They do a good job keeping the place clean and shiny.", "title": "Positive experience", "helpfulness": 14, "user": "floridatravel06", "date": "August 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5712034, "likes": {"liked": "— Good value for your money", "disliked": "— There was a long walk to the room from the elevator"}}, {"rating": 4.0, "title": "The classiest hotel in downtown LV!", "text": "There is lots of construction going on right now and the pool facilities aren't available.", "helpfulness": 15, "user": "kcchin", "date": "August 26, 2006", "id": 5711782}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The hotel gave us a 40 dollar dining and bev. credit that we used to cover two of our b-fasts- gratuity not included. We had to wait in a 20 minute line to get through the buffet even when we arrived there at 8:30am, but that's typical for Vegas buffets. The food was decent, and I really like the cheese blintzes.", "title": "1 Night at the Nugget", "helpfulness": 17, "user": "Kenderson", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 5607903, "likes": {"liked": "— Rates, quality of the rooms", "disliked": "— Limited amenities due to construction, distance from Strip"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We really liked the room. The pillows and bed were just right and the soaps in the bathroom were nice. The shampoo and conditioner weren't so good though.", "title": "Enjoyable stay at the Golden Nugget", "helpfulness": 12, "user": "almadelpueblo", "date": "August 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5604164, "likes": {"liked": "— cleanliness, spacious room, housekeeping", "disliked": "— Can't beat the accomodations for the price"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "I had the cheapest room and it was wonderful. Everything about the room was the quality of a much higher priced room anywhere in the world. Loved it!!!!!!", "title": "Loved the Golden Nugget", "helpfulness": 1, "user": "Belle16", "date": "October 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 1.0, "cleanliness": 5.0, "rooms": 5.0, "location": 3.0}, "id": 20732797, "likes": {"liked": "— beautiful , comfortable room and beautiful things in the hotel, especially pool.", "disliked": "— distance to the outside"}}, {"rating": 5.0, "title": "My favorite place in Las Vegas", "text": "As a woman traveling alone I was made to feel safe and comfortable in every way.", "user": "ruthski", "date": "October 7, 2008", "id": 20697487}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The buffet was very good with high quality foods and plenty of healthy choices. The prices were good, too.", "title": "gold brick", "user": "ziggystar", "date": "October 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20684812}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I would have liked to be able to use the gym for no extra cost but the hotel is just not laid out that was.", "title": "Not as good as I expected", "helpfulness": 1, "user": "julesingeorgia", "date": "October 6, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 2.0}, "id": 20662201}, {"rating": 5.0, "title": "Another Good Stay at the Golden Nugget", "text": "The whole hotel is elegant and the new pool with an aquarium in the center was just the best. I could swim along with the sharks and other fish in the hot sun.", "helpfulness": 2, "user": "heisman", "date": "October 6, 2008", "id": 20659708}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "HaveJust come home from another fantastic trip to Vegas. staying at the Golden Nugget was again Fab. Staff very very helpful and pleasant, rooms great overall service superb. For vegas virgins or regulars alike Downtown Vegas is a must. The Freemont experience out shines the Strip.... Greatest tour was a trip to the neon museum aka the boneyard,, its a must do tour, book in advance for this best $15 ever spent, if your planning a trip to vegas soon, make this a must do on your list, i think an actually museum is planned for next year, which will be cool but seeing this in its raw state is a must, for all you csi fans this is a must, see season 4 episode 22. I would also check out Bills Casino on the strip the Karoke with the $1 beers is a must and after 5 can guarantee you will be singing, I did, it was an abba classic, dancing queen (I blame the super mamma mia i saw the night before at mandalay bay).. Cant wait to book up again!! VEGAS ROCKS!!!", "title": "What a Gem", "helpfulness": 2, "user": "Sassysally8", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20377559, "likes": {"liked": "— Great Hotel in downtown Las Vegs, with everything on your doorstep", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Moved to Golden Nugget from a strip hotel that we were staying at for a trade show.", "title": "Great Hotel Downtown!!!", "helpfulness": 1, "user": "TravelNut70", "date": "September 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20339955, "likes": {"liked": "— Great service and amenities", "disliked": "— not much....maybe just that the pool is pretty small"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "All I can say is WOW! We booked a Gold Club Luxury room. What a nice change from some of the other Vegas hotels. Floor 17 in the North tower is all dark wood, quiet and attractive. There is coffee, water and munchies sitting by the elevator when you get off.", "title": "Worst hotel of American trip", "helpfulness": 2, "user": "ValenciaScarlett", "date": "September 24, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 1.0, "rooms": 3.0}, "id": 20337752, "likes": {"liked": "— size of room", "disliked": "— the bed"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "The room is great! Dark wood, a DVD player, I Pod player, flat screen TV. Great furniture and large, very comfortable bed. Bathroom is really outstanding. Huge shower with waterfall type shower head. Large bottles of shampoo, conditioner, lotion, shower gel, shaving kit, etc. Sinks are separate bowls sitting on the dark, granite countertop. Loved the in mirror TV too.", "title": "Great Stay", "user": "shasadee", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 20318180, "likes": {"liked": "— The friendly staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Very upscale and well worth the little extra from their regular rooms. We also received an amenities booklet with two for one buffet, free drinks and other half off specials.", "title": "loved the hotel", "helpfulness": 1, "user": "txSatx", "date": "September 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20184570, "likes": {"liked": "— great room for little money", "disliked": "— i liked it all"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Just got back from Vegas. Stayed at the Golden Nugget in the old part of Vegas for the first time. We've been to Vegas and stayed on the Strip many times so we thought we'd try the Fremont Experience for a change. The Golden Nugget was really nice. Great service, clean, tastefully decorated, nice newly renovated pool with the shark tank; no complaints about the hotel itself. The only thing was, it is so far away from everything! We thought there would be more to do in Fremont but it's really run down and kind of depressing; good for a one night visit, perhaps, but to be down there for three nights and four days was too much. We ended up taking cabs to the (new) Strip and at $25 one way, it ended up being expensive. It was also about a $25-30 cab ride from the airport (each way). I would say check out the Fremont Experience for one night maybe, but stay in the new part; there's just so much more to see and so much more excitement, which is why you go to Vegas in the first place.", "title": "Nice hotel, not so great location", "helpfulness": 2, "user": "rmori", "date": "June 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 1.0, "rooms": 4.0}, "id": 7871109, "likes": {"liked": "— Nice hotel", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The room was spacious and fairly nice. The downtown location is convenient for those who like to wander about to other clubs. They have a swimming pool with a large adjacent fish tank and a water slide that goes through the fish tank. This pool is a center of activity for the hotel. Three gaming tables and a bar are poolside.", "title": "Nice Place to Stay in Downtown Las Vegas", "helpfulness": 4, "user": "Lightning21", "date": "June 16, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7858572, "likes": {"liked": "— Good value, good food, nice room.", "disliked": "— Overpriced internet access"}}, {"rating": 3.0, "title": "If you are spending time on the Strip, stay on the Strip", "text": "The hotel’s Italian restaurant, steakhouse, and coffee shop all serve", "helpfulness": 3, "user": "ath17", "date": "June 14, 2007", "id": 7847911}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "decent meals. The hotel does charge $11.95/day for internet access which seems a bit of a rip off, considering many roadside motels provide this free to their guests.", "title": "Great Time at the Golden Nugget", "helpfulness": 4, "user": "FMBWaterSports", "date": "June 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 7847628, "likes": {"liked": "— The Pool Area", "disliked": "— Fremont Street - lack of clubs"}}, {"rating": 3.0, "title": "very unfriendly hotel staff", "text": "The show Strictly Ballroom was enjoyable. The lounge \"Rush\" has some overpriced, but decent, specialty drinks and occasional fun live entertainment.", "helpfulness": 5, "user": "uniquegirl", "date": "June 13, 2007", "id": 7845667}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I was a little concerned about what I would find in the Golden Nugget's older, less expensive south tower. I made my reservations by phone, and the salesman was really pushing the newer, more expensive north tower rooms, extolling the virtues of pillow-top beds, flat-screen TVs and in-room safes. I decided to go with the south tower anyway, and... maybe I just lucked out, or maybe it's important to ask for a room on the upper floors (we were on the 18th floor). But my budget room boasted a pillow-top bed, a flat-screen TV and an in-room safe(!)", "title": "Nicer than expected", "helpfulness": 1, "user": "Kaycj", "date": "October 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 20971112, "likes": {"liked": "— size of the room, price", "disliked": "— the pillows, off the Vegas Strip"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Anyone out there who, like me, might be hesitant about choosing an \"old\" room shouldn't be. It was very nice -- large, nicely decorated, with several pieces of furniture, a table, chairs and a nice, clean bathroom with plush towels and even two robes in the closet. Sure, the carpet is a little worn, but it didn't bother me.", "title": "great time at the nugget", "helpfulness": 1, "user": "dwcar", "date": "October 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20792605, "likes": {"liked": "— convenience"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My only complaint -- and it may sound strange -- the bed pillows were horrendous. I can't believe such a high-class establishment would put such uncomfortable pillows in their rooms. One night, I simply could not sleep because of the pillows -- they're small with bunched up, lumpy foam. To the hotel's credit, though, the front desk had a replacement pillow delivered to me in the middle of the night, and it was fine and my sleep was fine after that.", "title": "Nugget Really Isn't Golden", "helpfulness": 1, "user": "LondonGirl0", "date": "October 10, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 20779457, "likes": {"liked": "— nothing", "disliked": "— The staff. They were SO rude!"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "One final note: this was the first time I stayed at a downtown hotel. I found that I missed staying on the strip, and believe it may be worth the extra dollars to do so, especially if you've never been to Vegas or have limited time there. But the Golden Nugget is a great value for your money.", "title": "Golden Nugget not so golden rooms", "helpfulness": 2, "user": "hdrelxn", "date": "October 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20775364, "likes": {"liked": "— Pool", "disliked": "— Room and Manager service"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "the wife and I stayed in the GN Oct 7th thru Oct 10. Arrived at noon. there was no line. Our room was ready. It was clean and cold. We stayed in the South tower. The walk is nothing to the casino or freemont street. The pool was great. The chairs are a little close but still nice. the food was excellent. We had the breakfast buffet one morning, the cafe two days for lunch and Vic and Anthonys one night for dinner. V and A was very very good. the valet service is free and the guys were very helpful with directions.", "title": "very long check in lines", "helpfulness": 2, "user": "egsandclsareme", "date": "October 8, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 20741094, "likes": {"liked": "— the pool", "disliked": "— long check in lines"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed for 3 nights at the end August. We booked a room in the south tower at the summer rate but if we waited for 45 mins we could upgrade to a north tower room. We waited for 1 1/2 hours and the room was small, dark and faced a wall. We complained to the front desk and the manager put us in a suite and gave us a $ 50.00 credit for dining. After this shaky start everything else went smoothly. All the staff were friendly and the room and hotel itself very clean. We did look at rooms in the south tower and they seemed brighter and newer and it was not much of a walk to the casino. We rented a cabana and spent one day at the pool and had such a great time. The pool manager was very helpful. Even though it was over 100 degrees outside the pool was cool and refreshing. The shark tank was really cool and we had fun on the water slide. I thought the food was very good at both the buffet and cafe. I liked downtown because there were a lot of choices within walking distance and it seemed very relaxed. We will be back next summer with the kids and Grandma!", "title": "Wonderful stay!", "helpfulness": 1, "user": "KatfromLQ", "date": "September 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8708542, "likes": {"liked": "— Price and location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We were there from August 23rd through the 26th. We had a great time. I know a lot of people wrote about a long check-in, but it took us all of 15 minutes to check in. The room was just right (North Tower). The pool was wonderful (could have used a swim up bar, but that's okay). The slide through the shark/fish tank was awesome, my 15 year old nephew loved it. Great trip!!", "title": "Loved It", "helpfulness": 2, "user": "ClareE", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8703551, "likes": {"liked": "— Winning at the casino", "disliked": "— Losing at the casino"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "We stayed at the Golden Nugget for the UW UNLV game and had a great time. The pool was the perfect place to meet other Badger fans and celebrate after the win. We even watched the Packers win the next day on the T.V. in the pool bar! The slide is fast and fun and the couches are so comfortable that they're hard to leave. The only complaint we had is that we requested a non-smoking room but none were availabe upon our arrival They did move us the next day but some kind of added perks would have been nice for our trouble. All in all, we enjoyed our stay and the Nugget is the gem of downtown.", "title": "Great Party Pool", "user": "safred-7", "date": "September 12, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8702757, "likes": {"liked": "— The Pool", "disliked": "— More restaurants needed."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "A fascinating hotel, good place to stay off the strip. Do not be put off by bad reviews, everyone will have a bad experience in a hotel if that person is a frequent traveler. That is simple probability.", "title": "off the strip, but do not let it off your radar", "helpfulness": 2, "user": "terryjgardner", "date": "September 9, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8682132}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "On to the GN: a nice hotel, interesting decor, less flashy and opulent than hotels on the strip. I have stayed many times at the GN and would go back again. It is not the Bellagio or the Luxor, but not too bad either when the strip does not appeal.", "title": "Enjoyed the Nugget", "helpfulness": 1, "user": "TravelRevue", "date": "September 9, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 8681483, "likes": {"liked": "— Great location, nice room, good staff", "disliked": "— Weird smell from bathroom sink"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Read and heard about all the renovations the Nugget has done and all I can say is WOW! Great job!", "title": "Great stay!", "helpfulness": 6, "user": "Reenwad", "date": "October 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10032558, "likes": {"liked": "— The beds - the BEST!", "disliked": "— The view - looked out & over the top of the Freemont Street experience."}}, {"rating": 4.0, "title": "great Time", "text": "We arrived on September 19th. We reserved a two bedroom suite, since there were six of us sharing the room, we thought that would work great. When we arrived, the check-in line was quite long, but since we reserved a two bedroom suite, we got to use the VIP check-in service. (A private little room off to the side)Checking in was no problem at all, except our room wasn't ready, (we arrived about 1:00 pm) but it only took them about an hour.", "user": "3296", "date": "October 2, 2007", "id": 10031644}, {"rating": 3.0, "title": "Great Fremont Location & Pool, guestrooms lacking", "text": "Our room, #827, is basically three rooms made into one big one in the north tower. (The difference between the north and south tower is walking distance! The elevators were very convenient for the north tower, the south tower was quite a hike to get to.) Our room had three entrances! A door to the left was the master bedroom, the door in the middle was the living area, and the door to the right was the second bedroom. Each bedroom had a full bathroom, and there was another in the living area, which made three full bathrooms. It was beautiful. The beds were the most comfortable I have EVER slept on. The living area was quite large. It had a full size couch & table, dining area, wet bar, and of course at television. See the photos!", "user": "CGTravels", "date": "October 2, 2007", "id": 10030818}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Bell desk had our luggage up within minutes of calling!", "title": "Great Hotel!", "helpfulness": 3, "user": "Doglady17", "date": "October 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 10026999, "likes": {"liked": "— Large clean room", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We dined mostly at the Carson Street Cafe. Food was good there and had quite a selection. From breakfast, to sandwiches, to steak dinners, there was ample to choose from.", "title": "Beautiful Hotel", "helpfulness": 3, "user": "kimbo410", "date": "September 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10012755, "likes": {"liked": "— Pool and Food", "disliked": "— It is a bit of a hike to the South End of the strip, $15.00/$17.00 cab ride the Duce takes forever!"}}, {"rating": 5.0, "title": "Outstanding Service from Check In to Check Out.", "text": "We stayed at the Golden Nugget for 4 nights and will never stay anywhere else in Las Vegas. Check in was effortless, the room was large, clean and the buffet outstanding.", "helpfulness": 1, "user": "heavyweight", "date": "October 9, 2007", "id": 10060940}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The A/C unit was not cooling properly and maintenance replaced it in less than 20 minutes from the time we placed the service call. Visible Security personnel who actually checked our room keys before allowing access to the elevators, drinks supplied without asking while playing at the tables and slots, and very friendly dealers made for an outstanding experience.", "title": "AWESOME stay, renovations show!! Pool is wonderful", "helpfulness": 2, "user": "xichic", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10058620, "likes": {"liked": "— pool"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Tank is a great experience and one of the few pool areas that actually have enough chairs and lounges to accommodate their guests. We will return at the first opportunity. Thanks to the management for maintaining a little bit of old Vegas with modern amenities.", "title": "A blast from the past", "helpfulness": 5, "user": "CSL63", "date": "October 8, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10054067}, {"rating": 2.0, "title": "Beautiful Public Areas", "text": "We stayed at Golden Nugget for 2 nights, so we could get the old Vegas feel, and it was AWESOME!", "helpfulness": 2, "user": "sarge74", "date": "October 7, 2007", "id": 10049640}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This hotel just underwent$100+ million renovations, and it totally shows. The room was well appointed to. We checked in early, at 11am and they gave us a corner room. The bathroom was clean, bed was surprisingly very comfortable, and the hotel interior looked updated.", "title": "Spa Suites: worth the splurge", "helpfulness": 11, "user": "4meandhim", "date": "October 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 10046765, "likes": {"liked": "— Clean, large, well maintained, staff", "disliked": "— If pressed, I'd say the bell staff....found them not that interested in guests"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My boyfriend and I went there the week of August 17-23. We were a bit disappointed we weren't told back in February that the construction would be going on, but the people at the front desk at check-in were nice about it. They technically couldn't do anything since we booked through expedia, but she was very nice and gave us a free coupon book.", "title": "Good deal for the cheaper price.", "helpfulness": 11, "user": "Rach84", "date": "September 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 5807093, "likes": {"liked": "— Good deal for the price.", "disliked": "— Maid servce"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The view from the rooms is very pretty. We had a view of the west and all the mountains, very pretty. The room was pretty clean and big for the price, which was nice. I wasn't particularly happy with the maid service though--we ran out of shampoo and were not given another bottle, and 3 nights she forgot to give us a new bath mat. Also, there was an unusual stench in the bathroom that wouldn't go away anytime we were there. I read an earlier review saying the same, so it must not be just me. They charge you $1 a minute to use the computer, which I believe should be complimentary to the guests. But if you're lucky and receive the coupon book, you get 10 free minutes. If you plan on using internet there, bring your laptop and use it in your room. It's $12 a day, but a much better deal than the $1 a minute.", "title": "What a great experience", "helpfulness": 12, "user": "stn61", "date": "September 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5798666, "likes": {"liked": "— the size and quality of the room", "disliked": "— the renovation work"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "It's a good downtown location, but too far from the strip to walk there. We booked this thinking we could walk to the strip, being it was only a couple miles away. We were obviously wrong! Walking 2 miles to the strip sounds easier than done, being that it's very hot and being outside for a long time can really drain you. If you're looking to stay downtown, I really recommend renting a car. We took the Deuce one day, which was pure hell. The other days we had our car, which was much better. Rent a car if you can, much more freedom and less time consuming getting around.", "title": "Management Did Nothing About Bed Bugs", "helpfulness": 15, "user": "moeshansgf", "date": "September 11, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 5788209, "likes": {"liked": "— I liked how nice the rooms looked.", "disliked": "— The shock of having bed bugs in these nice rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "You'll be approached by people looking to sell you timeshares and such, almost everytime you walk through the hotel. Avoid them by nicely telling them \"I live here\" and they will keep their distance.", "title": "The Golden Nugget is Just OK", "helpfulness": 14, "user": "Trinity68", "date": "September 10, 2006", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5786667, "likes": {"liked": "— The room was very clean", "disliked": "— The room had 2 double beds instead of 2 queen beds"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The hotel is a much older crowd; you hardly see kids around it. My boyfriend and I are in our early and mid 20s, but we like nice, quiet places that don't have such a party scene with a younger crowd. So in that aspect, we really liked it since it wasn't ever loud. It is ok if you have kids, but I just don't think this hotel is very kid friendly. Especially since there isn't any pool.", "title": "Great for the over 40 crowd", "helpfulness": 10, "user": "ariesfire", "date": "September 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 5763030, "likes": {"liked": "— Clean rooms and very pretty hotel", "disliked": "— Long walk to the room, very sedate crowd"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "We have stayed at the Golden Nugget before, but this time the experience was not as pleasant as in the past. The check-in time took forever, even though there were only 3 of us in line and three people at the counter - we got in line at 8pm and finally checked in at 8:30. The room (south tower) was fine except for the bathroom. The tiles were dirty and the water would back up in the tub when taking a shower. We like the downtown location but will find a different place to stay next time.", "title": "Dirty Bathroom!", "helpfulness": 1, "user": "Baskgrl", "date": "September 26, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10007737, "likes": {"liked": "— Location", "disliked": "— Condition of bathroom"}}, {"rating": 2.0, "title": "Not as great as I thought it would be", "text": "I had read other reviews on staying at the Golden Nugget before I made up my mind. I was really excited about going to Vegas for the first time. The only thing I had read that was bad about the Nugget was how long it took to check in. That wasnt long at all but... we had asked to have joining rooms. Nope they cant count there was a room in between. Also the beds are soooo hard that I could not sleep but maybe 3 hours the first night. So the rest of our trip I was worn out. The GN is very pretty and all but it is NOT a 4 star hotel. The service in the restruant was terrible. The casino was very tight. If you go and stay downtown gamble elsewhere. It was a very disapointing trip after looking so forward to going and all.", "helpfulness": 1, "user": "Bam816", "date": "September 25, 2007", "id": 10003645}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "About a month before our trip, I had received an invitation from the Golden Nugget to stay with them Sunday through Thursday at a $69 per night rate (standard king room) and also receive a complementary coupon book good for services at the hotel worth over $250 dollars. The rate of stay for Friday and Saturday in the standard king room was $189 per night.", "title": "Lady Luck's alive and well at the Golden Nugget", "helpfulness": 7, "user": "ADeputy4U", "date": "September 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 3.0}, "id": 8865447, "likes": {"liked": "— Cleanliness", "disliked": "— Older air conditioner and lack of view of the strip."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "When I called to make reservations, I learned I had earned four complementary nights at the hotel using my Preferred Arrangements (PA) Card. (If you don’t have a card, call the hotel and ask to become a member. It’s free of charge). I also learned, by staying on the nights I booked, I would earn double PA points (you earn 25 points during a normal stay Sunday thru Thursday and 20 points for Friday and Saturday). This meant, we could pay for the first two nights at 50 points a night and comp the last night, and not loose any points already earned. Good stuff huh!", "title": "A Standout Downtown", "helpfulness": 2, "user": "pirate859", "date": "September 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8735636, "likes": {"liked": "— Location", "disliked": "— No coffee machines in rooms."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I also want to tell you I researched the latest information on the hotel via Trip Advisor and learned of a VIP program where you could pay $15 dollars through VIP services and use them for check-in and out, eat light snacks during your stay (cheese and cracker plates in the lounge while open) and arrange any type of concierge issues you might have, like booking shows on the strip or Limos. I called and paid for the service prior to our trip. More on the VIP service in a moment.", "title": "Loved It!", "helpfulness": 1, "user": "Rhiannon57", "date": "September 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8710715, "likes": {"liked": "— The Pool", "disliked": "— No luggage carts available"}}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 294, "average": 599, "very good": 2039, "terrible": 208, "excellent": 1802}, "aka": "Golden Nugget Las Vegas", "slim_ranking": 0.233333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Experience the splendor of the best hotel in Las Vegas. Sparing no expense and furnishing every desire, you will agree that the Golden Nugget Las Vegas Hotel is the standard for luxury and comfort. Envelop yourself in our world-renowned Las Vegas Hotel, located in the heart of Fremont Street. Bask in the gorgeously appointed splendor of downtown Las Vegas. One look inside and you'll understand why the Golden Nugget Las Vegas Hotel has earned the AAA Four Diamond Award since 1977. We look forward to welcoming you as a guest at our hotel and hope you enjoy your stay here in Las Vegas."}