{"user_rating": 4.5, "review_count": 165, "name": "Goreme House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We stayed in a second floor double room, which looked over the courtyard. It was clean with a good bathroom, and found it to be good value for what we paid. The terrace on the third floor is lovely, as is the breakfast room which is at the top of the building. The staff were very nice, and the owner's cat is very friendly.", "title": "Lovely hotel in an amazing town", "user": "BrisVegans84", "date": "June 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 69196338}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "One recommendation is, pack earplugs! We got a very big surprise very early in the morning, as the town mosque speakers were pretty much directly straight at our room. Other than that, we had absolutely no problems.", "title": "Very Kind staff , good location but overrated rooms .... they are just average .", "user": "sipenholz", "date": "June 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 67162423}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We spent 3 nights in a dark twin-bed room ( downstairs ) with old furniture and a very ' simple ' bathroom .", "title": "Amazing Goreme House", "helpfulness": 1, "user": "nrgm5", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66357830}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The rate may be justified for the location , but surely NOT for the room .", "title": "A big disappointment", "helpfulness": 1, "user": "ushab", "date": "May 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 65859438}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "There are equal but cheaper places in the neighbourbood .", "title": "Everyone was so nice and helpful and the location was spectacular!", "user": "sellsgifts", "date": "May 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65823640}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "This was a charming family-run business that gave us great value for our money. I particularly liked the family-run aspect of it because we could sit there in the afternoon, after a long (and hot) day of sightseeing and chit-chat with the owners. There is a mulberry tree in the main courtyard and the owners picked a bunch of the berries and gave us a plate to eat. The breakfast was delicious too - the jam is all homemade and delicious. So delicious that the bees love to come and hang out with you as you eat!", "title": "Charming family-run business that gives you value for money", "user": "calkenneth", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77714173}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I thought the rooms were decent - they weren't too busy so they gave us the adjacent room for free, which was nice. Since we had four people, every extra bathroom helped. It was REALLY hot in the rooms though, even with the windows open. We borrowed a fan from reception but it didn't really help at all.", "title": "Nice hotel and very good location", "user": "buzzlog", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74515352}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "They were supposed to have free WiFi but I couldn't get it to work. And since I was on vacation I didn't bother to ask for help...", "title": "Wonderful Experience", "user": "JewellALexandriaVa", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72295674}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Overall, I would definitely stay in Goreme House again - it was a fantastic experience with great people. The owner's sister even helped me mail my postcards since I didn't have time to get the stamps. I gave her some money and she took them to the post office herself. Fantastic - only a family-run business would do that for me.", "title": "Good value, good location, comfortable", "user": "Patti122", "date": "July 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 71066863}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We recently stayed at Goreme House Hotel for couple of nights. The hotel is located couple of minutes from the center of the town. We really enjoyed our stay. The hotel owners did a great job with our accommodations. The breakfast made by the owner's sister was excellent. My wife and I really enjoyed the view from the hotel terrace. The room prices are a little expensive compared to some other hotels but this place was recommended in our Turkey tour book.", "title": "Relaxed and at home here", "user": "berlydark", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70410433}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I enjoy traveling to Turkey very much and I hate to give this hotel a bad recommendation but a member of my travelling party picked this hotel for its uniqueness. I found the hotel to be dusty and damp with threadbare sheets and towels. Hit = location, breakfast, hospitality. Miss = catching the maid taking a nap on my bed and the room being constantly damp even with the heat on. There are many more options for accommodations in Goreme.", "title": "Hit or Miss", "helpfulness": 1, "user": "scott s", "date": "January 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 94054413}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "I really wanted to love this place. The website is beautiful. And, there are some nice things about this hotel, but it hardly lives up to the website, so be prepared. Unfortunately, I had problems from the beginning. I was promised an airport pick up, but no one showed up, so I found my own way to the hotel. When I got there, the very apathetic manager was unable to find my reservation. He actually had me sit at his computer to find my emails so he could find my booking. I finally got my room, but there was no apology for the missed airport pick up, and it was a cold welcome at best. The whole process was uncomfortable. I wasn’t given any information about the hotel or the area.", "title": "Cannot Recommend", "helpfulness": 2, "user": "Anabanana", "date": "November 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 85800295}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "A morning later, I was leaving the hotel for a tour, when the manager told me that he needed my room. He told me that he was going to put me in a different, but better room, and asked that I pack up my things to move. I wondered what was going on, so I asked him several times why he needed my room, but he didn’t give me any explanation, and he got increasingly irritated with me for asking. I just wanted to know why I was being moved, and wondered if I’d be moved several times during my stay. I also worried that I’d be charged extra money for the change. I left for the day, and when I returned, one of the staff gave me my new room key. I asked the woman why I was being moved, and she called the manager over to talk to me. The manager became extremely angry and yelled at me for continuing to ask questions. I was stunned and walked away, but he kept yelling. He was irate. It was unbelievable. I finally went up to the room, which was very nice and larger than my original room, but I was so shaken and upset by the whole encounter, it was hard to enjoy it.", "title": "Not worth the money", "user": "CapitalsSunShine", "date": "October 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 84568875}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Some nice things about the hotel: They provide a good breakfast in the morning and the terraces offer lovely views. The hotel is well situated - an easy walk to many restaurants and shops. The hotel is fairly quiet, except for the early morning call to prayer coming from the nearby mosque.", "title": "Disaster!!!", "helpfulness": 1, "user": "tokuzlu", "date": "September 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 80657740}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I never did see the “library” mentioned on the website and it wasn’t clear to me which computer was available for guest use, though there is one in the reception area.", "title": "Very Hospitable Family Run Inn", "user": "Nikki0307", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79046569}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We just left the Goreme House yesterday after spending five full days. We had the standard room downstairs, which is small. However, we only slept there, since whenever we were \"home\" we sat right in front of our room, on very comfortable seating in the courtyard, enjoying our tea or a glass of wine, reading or playing cards, or simply watching the goings on. Through the open gate we could see a rooster strutting with his chickens, the local little ones playing in the street , just a very relaxing rural atmosphere. The location is great, just a short walk down the hill to the main street, where most of the stores and restaurants are.", "title": "A great place to spend some time...", "user": "hjtravel", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 64981740}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The people at the hotel were all extremely helpful and nice and when we left yesterday it was like leaving family. All outings were arranged through the hotel and there never were any problems. If you consider a hot air balloon tour, (and we really recommend it!) make sure you speak to Halis, the son, who is a pilot himself. Emine, the daughter, has won a special place in our hearts with her wonderful smile and her warm demeanor. Neither one of us can think of any thing negative to say about this place.", "title": "Incredible location + helpfulness", "user": "knotso", "date": "May 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64941076}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Goreme is small and very laid back, a perfect spot after hectic but wonderful Istanbul. No high pressure vendors and very friendly local people - wish I could speak Turkish...", "title": "Friendly and Hospitable B&B in Convenient Location", "user": "Chiquitita", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 64696227}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "If not the best hotel we've ever stayed at, it was certainly the best value -- and by far the friendliest owners, who give new meaning to the term \"host.\" We asked to change our reservations not once but twice; this was accomplished with no fuss or penalties. 60 euros/night gave us a comfortably sized room with immaculate furnishings & bathroom, 100+-channel TV, not to mention a window facing out on the most dazzling and fantastical-looking city-street scenery on planet Earth.", "title": "An unpleasant room for a premium price and the breakfast didn't help. Avoid this hotel.", "user": "justdessert", "date": "May 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 63076873}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Further nice surprises awaited outdoors: a 3rd-story terrace with an even more fantastical view, and in the courtyard, a bar/dining area where we were served tea gratis.", "title": "A really great little hotel", "user": "Pamcooper45", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61851208}], "location": {"country": "Turkey", "region": "Cappadocia", "continent": "Europe", "city": "Goreme"}, "stars": 3, "variance": {"poor": 5, "average": 17, "very good": 36, "terrible": 3, "excellent": 104}, "aka": "Goreme House Hotel", "slim_ranking": 0.809523809524, "description": "Goreme House offer s levels of service and professionalism previously enheard of in Göreme. The attractively decorated rooms are blissfully comfortable, with great beds tea-and coffee-making facilities and well-equipped bathrooms. Rooms have satellite TVs and a small sitting area. After a day's walking or sightseeing, guests can relax in the shade of a large mulberry tree in the courtyard or on the roof terrace, which has good views. Though everything here is impressive, it's the extras that make this place so great: breakfasts include fresh orange juice and börek (filled pastry) straight from the oven, olive oil soaps are in every bathroom, bottled water is provided at no charge in the rooms and small boutique touches such as a pillow menu have been introduced. Great stuff."}