{"user_rating": 4.0, "review_count": 83, "name": "Governors Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "My wife and I had the pleasure of staying at The Governors Inn both to and from our recent driving trip to New Orleans. We stayed both times in a Chamber Suite, and my wife had one of the best sleeping nights ever! The front desk staff and valet were friendly and welcoming, and the room was large and very clean. My only minor complaint is that the breakfast buffet is somewhat limited in selection.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "Simmrouter", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126867391}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I would highly recommend this hotel to couples, families, and business travelers visiting the Tallahassee area. The hotel is also located close to several decent restaurants and bars if you need to dine out.", "title": "Can't believe the good reviews!", "helpfulness": 5, "user": "Robinnora", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 125714653}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "My husband and I stayed at Governer's Inn because of the glowing reviews on Trip Advisor. Yikes, seems like a completely different hotel! The room was tiny, the TV was tiny, the refrigerator was dirty, the bathroom floor was sticky, and every time someone used the water or the toilet in other rooms, it sounded like our bathroom was flooding. Also, I had to fix the toilet by reattaching the chain in the tank.", "title": "The best Tallahassee has to offer", "helpfulness": 1, "user": "Colinasita", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125669000}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I almost killed myself when I fell out of the unnecessarily high bed in the morning because we were awakened at 8am on Sunday by drilling outside of our room.", "title": "I should have done this a long time ago b/c they deserve it!", "helpfulness": 2, "user": "vexedangel44", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125353776}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The breakfast was marginal, at best. The only bright spot was the very friendly staff. Never again!", "title": "Historic Hotel", "helpfulness": 1, "user": "oceantravelFLA", "date": "January 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123623709}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "My stay at the Governors Inn was one of my best experiences staying at a hotel. The amenities and concierge service they offer are wonderful. The Manager's Reception or \"cocktail hour\" was one of my favorite features. I was able to enjoy free cocktails with fellow guests and get to know them as well as the staff. The wonderful beds and friendly staff made my stay relaxing and pleasurable.", "title": "Great AmenitiesThat Make You Feel Welcome", "user": "Rebecca H", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118040668}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "You can't find a better place to stay when visiting Tallahassee than the Governor's Inn. From the minute you pull up and are greated by the Valet, to the turn down service at night - everything is more than should be expected. It was also a pleasure to attend the manager's reception, where not only do you enjoy complimentary appetizers and cocktails - you also have a chance to meet the manager and some of the staff. The guest rooms are very well appointed and they make one feel right at home. The location is perfect - close to everything you would want to do during your stay in the capitol city. The concierge was very helpful in suggesting places to visit and local restaurants. I will definitely return - next time I visit Tallahassee.", "title": "A Great Place to Stay!", "user": "klc8990", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118022356}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The Governors Inn is in the best location. They are directly downtown and surrounded by many delicious restaurants in the area. My personal favorite was Jasmines, the sushi restaurant around the corner from the hotel. Because I was a guest at the Governors Inn, I was able to get 20% off when I showed my key card. They have many different discounts and specials to restaurants downtown, making it even that much better to stay with them", "title": "FANTASTIC TIME, EXCELLENT SERVICE", "user": "878Julie2269", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118020746}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The staff was so nice and VERY accommodating. We really felt special when they made drinks (call brands) for us during a nightly free happy hour in the small, comfy parlor. We WALKED to fabulous restaurants every night and a great breakfast place each morning and loved being in the center of town. The hotel looks like a classy, old inn with big wooden ceiling beams that show some history. The rooms were decorated like it was still the 1800's, which added to the charm. Our bed was wonderfully comfortable, too. They also provided a computer with free WiFi on an antique desk on each floor. The place was just so homey and inviting with antiques everywhere and soft lighting that it felt like we were coming home each time we walked through the front door. Our visit was definitely a good one, and we will remember it with warm, fuzzy feelings because it felt special, not just another standard hotel stay.", "title": "We loved it! Will definitely make it our #1 choice in Tallahassee.", "helpfulness": 1, "user": "AG8trGirl", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117843298}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I stayed here for a business meeting in Tallahassee. Staff was friendly and helpful. Rooms were well appointed, very clean and nicely decorated. Great service including turn down. Morning breakfast was nice too. Recommended stay when you're in Tallahassee!", "title": "Cute Hotel with Great Service", "user": "SarahMpls", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115418734}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Location, cleanliness, comfortable beds, polite staff, the ability to walk out the door without waiting for an elevator all make for a great experience! This will be my third stay at Governor's Inn and look forward to it. The style is more casual and like a bed and breakfast. With valet parking, cocktails at 5, and a complimentary continental breakfast you will not miss all the others! Jules", "title": "My favorite in Tallahassee...", "user": "jgc255", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119812360}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I cannot give the Inn a higher recommendation for pleasure, business or visiting a student at FSU; location, comfort, charm, cleanliness, quality of bedding and decor, helpfulness of staff and concern for each guest. I have already booked another visit. Each staff introduced themselves and offered all kinds of helpful information regarding restaurants and what was going on locally. The breakfast was totally adequate and charming with lapetop or without, large flatscreen and many newspapers to enjoy. Evening cocktail hour a very nice addition for socializing and many restaurants, in all different catagories, within walking distance . Thank you Ben, Wiley, Matthew and Casey, staff that made visit so comfortable. Anne K.", "title": "Governor's Inn a Wonderful First Impression For Our State's Capitol", "helpfulness": 1, "user": "Anne K", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118663821}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This was my second visit to the Governor's Inn in Tallahassee and my week there was just great! The staff and the accomodations did not disappoint! The rooms are so inviting and you fell as if you are at home. The staff was there for any request that I had and the hotel close to every meeting that I had including my office. I hope to return very soon!", "title": "Governor's Inn...Like Being at Home!", "user": "amysulli", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118262456}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Being able to see the Capitol building from the lobby alone would be enough to make The Governors Inn one of the most convenient lodging establishments I have ever visited. The rooms resemble guest rooms rather than the standard polyester hotel rooms. The new mattresses, new irons, and spotless bathrooms met every expectation for an experienced traveler, but I was pleasantly surprised to discover the universal cell phone attachment on the clock radio. (No falling asleep terrified that I had set the alarm clock incorrectly, or listening to bad fm radio while working on paperwork!)", "title": "The Governors Inn's Best Amenity is Not its Location", "user": "Allison L", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118079985}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "But, it is because of the staff at the Inn that I find myself making skipping Expedia to make reservations far in advance. My first stay exemplified the individual treatment that is standard at the Inn. Traveling alone as a woman creates unique challenges. But, from the managers, to the owner, to the (clearly college kids) working at the front desk and valet parking my car, they eliminated any concerns I might have had, many before I had even thought about. Immediately upon pulling in to the valet parking at the inn, a polite valet hoisted my luggage out of the trunk, while inquiring about what time I would be needing it the next day. While checking in, my luggage was moving ahead of me to its room. The girl processing my check in asked if I had eaten dinner, gently informing me that the restaurants closed within the hour, and handed me 6 menu's, before volunteering to have the dinner sent to my room with a glass of wine, and offering to schedule a wakeup call.", "title": "Location: County Courthouse", "user": "Ed D", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118068972}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed in a loft room arriving Saturday night and leaving Monday morning.", "title": "Good location but depends what you're looking for", "helpfulness": 5, "user": "JoeR11", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121173958}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "First the nice parts - the place is located right in the middle of the government builddings and courthouses and downtown. The room was very nice with a comfortable bed, lots of room, and a nice sitting area.", "title": "terrific service", "user": "smoss46704670", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120127790}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Next the neutral parts - the view was rather lackluster from our room. There is no hotel parking and valet parking is $10/night (we should have guessed as much due to the location). Breakfast was nothing to get excited about - kind of a half-hearted attempt - bagels and pastries out of a package, yoplait yogurt, granola, etc.", "title": "Staff", "user": "331Easton11331", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120092988}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Finally the not so nice parts - There seemed to be a minimal staff on duty in the whole place to the point where the front desk clerk was going to be our valet. We told her we'd fetch our own car. Perhaps the minimal staffing was due to a low guest count. The breakfast area had only one table with a table cloth. You could sit on the couch and eat off of the coffee table too I guess. But for a hotel that size, I wouldn't want to try the breakfast if the hotel was full. The air conditioner vent blew right on our heads when we were sitting on the couch - not very comfortable. There was no desk in our room to sit at for computer use. The price seems a little high for what you get.", "title": "Governor's Inn... The best place to be....", "user": "Carlton B", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120071215}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "In conclusion, if you didn't drive but just got a taxi from the airport, the location is great. If you like to skip breakfast or eat out and just need a comfortable bed in close proximity to government offices, this place is nice.", "title": "The right place to stay.", "user": "iiyoyoguy", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120020613}], "location": {"country": "United States"}, "variance": {"poor": 11, "average": 6, "very good": 11, "terrible": 4, "excellent": 51}, "aka": "Governor`s Hotel", "slim_ranking": 0.383333333333, "description": "The Governors Inn is a 41 room boutique hotel prominently located one block from Florida's Capitol Building in Tallahassee. Guests to the recently refurbished Inn enjoy a complete array of services and amenities, some customary, others pleasantly out of the ordinary. Opening onto our lamp and sky lit hallways are 41 rooms and suites, each named for a Governor from Florida's past. European turn down service, complimentary breakfast & cocktails, daily newspapers, valet parking, Wi-Fi services."}