{"user_rating": 4.0, "review_count": 1053, "name": "Grace Hotel Sydney", "reviews": [{"rating": 5.0, "title": "Great service, modern rooms", "text": "We got a free upgrade at checkin to the top 'heritage floor' and the room was very nice...modern, spotless, well appointed. The bed/", "helpfulness": 1, "user": "spired", "date": "April 3, 2007", "id": 7275805}, {"rating": 4.0, "title": "Great hotel and location", "text": "linens/amenities were all top notch. We didn't have a view but that wasn't that important.", "helpfulness": 2, "user": "janines", "date": "April 2, 2007", "id": 7271363}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "The concierge was great too with recommendations, arrangements advice, and everything you expect them to provide.", "title": "Nice hotel! Service mediocre", "user": "akm107", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7269977, "likes": {"liked": "— The beds!", "disliked": "— The concierge service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Highly recommended.", "title": "Fantastic", "helpfulness": 2, "user": "Kev&Tina", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7246199}, {"rating": 5.0, "title": "sell the kids if you have to", "text": "My husband and I stayed at the Grace the week of March 26. I was able to get a rate of $157 through asiarooms.com. On check in I told the receptionist I read on this website someone who was upgraded by staying over 3 nights. She said she wasn't aware of this upgrade, but she did put us in an upgraded suite.", "helpfulness": 2, "user": "kirven42", "date": "March 29, 2007", "id": 7245784}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "we have just had a night at the grace and loved it! My husband and i just had our 8 year wedding anniversary at the grace. we only stayed there because we could not get into the park hyatt. I am extremely fussy and have booked out of so many hotel rooms all over the world. we booked a heritage room which is on the 11th floor. it is reasonably spacious, no outlook to mention but bright not dark and dingy. we booked on wotif.com and got a good deal including breakfast, turndown and chocolates ( which never came) i dont know what the other rooms are like but the heritage level is very nice. it is a lovely old building, beautifully restored. It is clean and the staff were friendly enough. the concierge staff were particularly helpful and welcoming. the great find with this hotel is the position. i am from sydney and for anyone wanting to be in the heart of the city -this is the place. we had lunch in the david jones food hall, always a treat. walked through the strand and the queen victoria building. walked to dinner at the summit, which was so nice we just had cocktails and champagne watching the wonderful view unfold. this was one of the nicest stays we have had in the city for a long time. the breakfst was nice as well. the price is reasonable, the old world charm was a delight, the position was the best. oh and the bed was sooo comfortable, a king bed that was soft and fluffy. it was quiet also, no street noise. we will be back.", "title": "hidden gem", "helpfulness": 1, "user": "sulumanly", "date": "April 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7414026, "likes": {"liked": "— the bed", "disliked": "— the small tv"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Even though it was a few months ago, I had to write and let everyone know what a great place to stay. The heritage of the building is beautiful especially when you walk into the grand lobby through the original Grace department store doors. The floor tiling is spectacular and it's like stepping back in time. Adjacent to the lobby near the elevators, is a history of the building which is rather fascinating to read.", "title": "Amazing Grace!", "helpfulness": 1, "user": "aurora26Melb", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7392730, "likes": {"liked": "— The location and heritage of the building", "disliked": "— Breakfast Buffet"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "We stayed on the 10th floor which is the heritage floor. Our window looked directly up at the Centrepoint Tower, which illuminated at night is wonderful. The decor is modern dark timber which is a favourite look of mine, yet the decor didn't detract from the building heritage.", "title": "Scam! Beware!", "helpfulness": 4, "user": "CazAustralia", "date": "April 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7391245}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "The floor above has the pool and gym. The pool is really a lap pool, we didn't swim there at all. Take a ferry out to Manly or a bus to Bondi and enjoy the beach culture whilst in Sydney.", "title": "Very nice hotel, centrally located.", "user": "CarlosPedro", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7379720}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel is located so central to the city shopping and eating. Eating is a short 5 minute walk to either King Street Wharf, Darling Harbour and Cockle Bay Wharf. We walked numerous times down to Circular Quay, however it is a good 15min walk but fairly easy. Sydney is rather pricey to eat, however I can recommended Velvet Slide at King Street Wharf and Blackbird at Cockle Bay for reasonable price eating. Ghengis Khan is great too. Some restaurants have specials on different nights.", "title": "The Grace is one of the best", "helpfulness": 1, "user": "AccElan01", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7278159, "likes": {"liked": "— Great location & value"}}, {"rating": 3.0, "title": "Great location, amazing city, good hotel!", "text": "I stayed at The Grace for 4 nights at the begining of March 08.", "user": "RosieFlynn", "date": "March 6, 2008", "id": 14095243}, {"rating": 5.0, "title": "Wonderful hotel in Sydney", "text": "After spending hours reading reviews here, I'm pleased with my choice.", "user": "elisha333", "date": "March 4, 2008", "id": 14027851}, {"rating": 5.0, "title": "Friendly and efficient", "text": "The location is perfect, although Sydney is such an easy city to navigate, but the hotels proximity to all the major tourist attractions is a bonus.", "user": "LeicestershireSammy", "date": "February 27, 2008", "id": 13901407}, {"rating": 5.0, "title": "Quality Grace Hotel", "text": "I was in town on Business and arrived at the hotel at 7am, on the Saturday of the mardi gras, and was unable to check in any earlier than the advertised time of 2pm(it was a busy weekend I suppose) so I went for a stroll around the city and came back at 2ish to check in.", "user": "SingaporeSEAtrekker", "date": "February 25, 2008", "id": 13823817}, {"rating": 1.0, "title": "Horrible customer service", "text": "My room was a nice size, the bathroom was ok, pretty standard, not what you woudl expect from a 4 star hotel.", "user": "mn2ca2az", "date": "February 20, 2008", "id": 13707521}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Having travelled by plane for thirteen hours, I arrived at the Grace around 8.30a.m. on November 24th, 2007. The concierge and porter were very polite and welcoming and relieved me of my bags immediately. However, the member of reception with whom I had the misfortune to deal, was extremely SURLY and RUDE. I was understanding of the fact that, as I had checked in early, my room might not be ready. (However, on reading this website, I see that some people have been far more fortunate than I was and have been allotted their respective rooms on early check-in.) While I was waiting for my room, I went into the Café off the lobby for breakfast. The staff in there were very friendly and, on hearing that I had just arrived in Sydney for the first time, proceeded to give me advice on where to go and what to see in the immediate area. The breakfast was also excellent! Afterwards, I went back to sit patiently in the lobby, where I remained until after 10.00a.m. I then noticed a busload of people checking in and immediately going to their rooms. On observing this, I approached the reception desk to politely inquire why a room was not ready for me at this stage, as I had remarked on booking that I would be arriving early. The same member of reception I had encountered on check-in spoke to me, once again, in a rude and insulting manner. I then informed him that, in all my travels, I had never encountered such bad manners in any hotel staff. I requested to speak to the manager and, quietly but firmly, made him aware of my disgust at the treatment I had received from his colleague. He took this on board and assured me that he would deal with the problem. I stayed in the Grace Hotel for four nights in November and returned for two nights on December 9th and 10th.", "title": "Extremely SURLY, RUDE reception!!!", "helpfulness": 1, "user": "MeganDublin_", "date": "December 20, 2007", "detail_rating": {"front_desk": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 11715945, "likes": {"liked": "— The beds! Lifts, Art Deco surroundings, Location", "disliked": "— Reception check-in"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I was very satisfied with my accommodation on the first occasion and loved the upgrade I received when I came back. My room was on the eighth floor and was spacious and bright. I loved many things about this hotel - the beds (only in the Omni Parker House Hotel in Boston have I experienced beds as comfortable as those!), the art deco surroundings, the lifts!, the location (brilliant for shopping and sight seeing). As it was my first time visiting Australia, I think it was rather unfortunate that I had", "title": "Perfect location", "helpfulness": 2, "user": "barryandsam", "date": "December 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11576345, "likes": {"liked": "— Central location. Comfortable mattress!", "disliked": "— Lack of private bar/cafe"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "to meet up with the rudest person I ever met in a hotel reception, on my first morning in the country. All my other experiences in Sydney and Australia were brilliant! From other postings here,", "title": "overall a very good hotel", "user": "Essex123", "date": "December 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 11320263}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I notice that I am not the only person who has experienced rudeness from a member of reception at this hotel. I am of the opinion that some training in common courtesy is sadly lacking here.", "title": "Wonderful Hotel", "helpfulness": 2, "user": "Oskar07", "date": "December 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11273770, "likes": {"liked": "— Everything!", "disliked": "— The more recommended The Grace is the busier it will be when we try to go there again!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "This was our first trip to Australia, we were visiting our son and wanted a reasonably priced, central hotel. After much research, we chose The Grace for the first week of our stay. We needed to book a further 4 nights in Sydney following a week of travelling around NSW but waited until we had arrived in Sydney so we could look around the city and see if there was a better situated hotel. It was immediately clear that the location of the Grace was perfect - 5 minutes from Darling Harbour, 10 minutes from Hyde Park and 10-15 minutes from Circular Quay. We did check on a hotel near Circular Quay for our return stay but they quoted AUD435 per night, compared to AUD250 at The Grace!", "title": "Excellent Choice & Value if Staying in Sydney", "user": "nj_group_diving", "date": "November 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10922585}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "I've lived here for 2 nights last month and it was a excellent experience to live in a historical building like this. I lived in the room 1013 and you could see the people walking down there on the street. The check in processes quickly and without problem. Staff were very friendly. Basically the hotel decorated with very warm and mature style so you wont feel any uncomfortable living in. The size of the room was not very big but at least alright for a sleep. The bathroom was spacious compare to the room.", "title": "Excellent experience", "helpfulness": 1, "user": "Zu Y", "date": "September 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8712457, "likes": {"liked": "— The historical building & atmosphere", "disliked": "— small size guest room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The location is the main reason i chose it. It is very close to market/george street where the main shopping area (QVB, Pitt st. The strand etc..) located and it is only a step away (take 8-15 min easy walking to the rock & circular quay or darling harbour if you like to walk around) If you would like to grab something easy to eat at morning or during nights, its not far away reaching Woolworth where you could get some dairy, fresh fruit.", "title": "Phenomenal", "user": "shortstufff", "date": "September 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8711587, "likes": {"liked": "— ambience, decor & bedding, service, quality!", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Also it takes only around 5 mins to town hall station or bus stations around the area.", "title": "Excellent", "helpfulness": 2, "user": "Katiereading", "date": "August 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8428337, "likes": {"liked": "— The room", "disliked": "— Only had a small lap pool would have been nice to have a roof top but cant have everything"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled with friends", "text": "This place is phenomenal, definitely one of the greater hotels that i've stayed at. I stayed at the Grace hotel for a special occaison and the Grace hotel fit the importance of the occaison. We booked the \"King Corner\": to call the room lavish is understating its beauty. The decor was gorgeous: i'd recommend this place for romantic getaways and business trips and any other excuse you could find to stay at this place. These reviews are not understating the case when they say these are the most comfortable beds in Sydney (and well worth the price paid for them). the size and comfort of our room was well worth the price paid (which compared to some of the other hotels in Sydney is not a great deal at all). To top it off, $35 all day parking in sydney on a weekday- an absolute steal! (usually $50-55 or more) AND, a full hot buffet breakfast was given to us at a discounted rate (Incredible array of well prepared and delicious breakfast options to choose from).", "title": "Best Bed, Stylish, Convenient", "helpfulness": 1, "user": "TallulahB", "date": "July 31, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 8268483, "likes": {"liked": "— Bed", "disliked": "— Restaurant on site"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I'll definitely stay here again!!", "title": "Grace is Great", "helpfulness": 3, "user": "bundyone", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8231444, "likes": {"liked": "— Location, price, staff! You can't go wrong at the Grace", "disliked": "— LOVED EVERYTHING...maybe too many beers at PJ's downstairs"}}, {"rating": 4.0, "title": "Great location, comfortable, clean, spacious rooms", "text": "I stayed at the Grace for 5 nights while on business. Although my office was in North Sydney, the Wynyard station was two blocks away and I could catch a train for the 7 minute ride to the North Sydney station - AUS $2.60 each way.", "user": "Hollie M", "date": "February 17, 2008", "id": 13619498}, {"rating": 4.0, "title": "A reasonable hotel for a downtown stay", "text": "My room was very large, with two beds, large bathroom, closet, television, small sofa, coffee table, and a desk. I didn't have a view but it didn't matter because there is so much to do in the immediate area, I was rarely in my room.", "user": "Darlox", "date": "February 13, 2008", "id": 13528819}, {"rating": 4.0, "title": "Great hotel but...", "text": "The hotel is short (10 minutes) walking distance to The Rocks, Circular Quay, Darling Harbor, and many shops, restaurants, and transportation. There is a Woolworths grocer three blocks away if you prefer to purchase fruit, yogurt etc. for meals/picnics. I would recommend this hotel to my family and friends any day.", "user": "Vjohn", "date": "February 10, 2008", "id": 13433572}, {"rating": 2.0, "title": "The Dis-Grace Hotel", "text": "The Grace hotel is a reasonably nice property occupying a 1930's building in downtown Sydney. It has the \"grand old\" look of a classic National Trust building, but the rooms are quite basic. We spent two nights in the Grace just after New Year's 2008, and found it to be an acceptable, if unremarkable, lodging. Read on for details...", "user": "explore_&_indulge", "date": "January 21, 2008", "id": 12832735}, {"rating": 4.0, "title": "Loved the Grace", "text": "LOCATION:", "user": "SportMom04", "date": "January 15, 2008", "id": 12636199}, {"rating": 5.0, "title": "5 Stars Plus!!!", "text": "We stayed at The Grace earlier this month (July) for 2 nights and absolutely LOVED it!!! From the moment we arrived until we left we noticed how nothing seemed too much trouble for the staff. We pulled up in the taxi and the doorman opened our door immediately and welcomed us warmly and took care of the luggage. We walked into the foyer and right away felt impressed - it looks great! The staff were very courteous, professional and welcoming from start to finish. We arrived early and they gladly stored our luggage until our room was available and did the same thing on the day of our departure, so we could shop all morning and into the afternoon without having to worry about carting luggage (& all the shopping we'd already done) all over Sydney.", "helpfulness": 40, "user": "Jenn W", "date": "July 20, 2007", "id": 8203119}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "The room was fabulous & huge! It looked like it had been painted recently and was so spacious. We stayed in a family room on the 8th floor and got a great deal on wotif.com for 2 adults and 2 children plus full buffet breakfast (divine!!) for all of us. It had a lovely king size bed and great double fold out sofa bed.", "title": "Wonderful...so sad to leave!", "helpfulness": 40, "user": "UnitedStatesMember", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7899175, "likes": {"liked": "— Our room", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We didn't dine in the restaurant but had the best steak sandwich I've ever had from room service. It was huge and came with a large serve of french fries and a bread roll as well - $19 but well worth it!!", "title": "Best Beds Ever!", "helpfulness": 39, "user": "Ykombi", "date": "May 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7632785, "likes": {"liked": "— The bed", "disliked": "— Had to pay for parking"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "All in all it was a fantastic stay - can't rave about it enough - and can't wait to go back!!", "title": "Great to stay at the Grace", "helpfulness": 40, "user": "peoria_gal", "date": "May 8, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 4.0}, "id": 7568245, "likes": {"liked": "— Location", "disliked": "— One concierge did not seem extremely knowledgeable about the area details"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "It was so hard to leave the Grace when our trip to Australia ended...it was marvelous! Never before have I experienced such magnificent service than I did at the Grace Hotel. Our room was several floors up, with a wonderful view of downtown Sydney. We had two queen beds (I was traveling with my father on a business trip), and the room was spacious, extremely clean, and equipped for virtually any need that might arise! (This was the first time I had seen a telephone in a bathroom.) The staff were extremely friendly and helpful, and the concierge recommended many good restaurants and sights to see. The bellhops helped us get our luggage out of our taxi when we arrived, and helped get it back into a taxi when we left for the airport. Our last night in Sydney my father took me upstairs to the exercise room and swimming pool. The pool was marvelous...very warm water, and brightly lit up. The best part? No other people! I had the entire pool to myself, and had an excellent swim. I would definitely recommend the Grace Hotel to anyone who comes to Sydney...please ignore the bad remarks, because they just aren't true.", "title": "Quiet, perfect location, incredibly comfortable bed", "helpfulness": 2, "user": "Risky_Rat", "date": "May 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7553583}, {"rating": 5.0, "title": "Great location", "text": "We stayed at the Grace Hotel for 6 nights over Christmas and we were very pleased with our choice.", "user": "Pete W", "date": "January 14, 2008", "id": 12602629}, {"rating": 3.0, "title": "Decent hotel", "text": "Perhaps the best thing about the hotel is its location - 5 minutes to Darling Harbour, 5 minutes to the main shopping streets and 10/15 minutes to the Rocks or Circular Quay.", "user": "phillipsrhit", "date": "January 3, 2008", "id": 12307520}, {"rating": 5.0, "title": "This Hotel has Grace", "text": "Our room was very smart and clean - if a little dark - and there's a good gym with a small indoor pool on the top floor.", "user": "Jetlagged72", "date": "January 2, 2008", "id": 12261386}, {"rating": 4.0, "title": "Like a Bruce Willis Movie, solid & dependable but won't win an Oscar", "text": "The service is very good. The concierge in particular is a real asset.", "user": "JACKSONJE8", "date": "January 1, 2008", "id": 12181174}, {"rating": 4.0, "title": "Good Location, Acommodating Staff", "text": "The hotel cafe is also very good - serving very tasty modern Australian food at reasonable prices.", "user": "WWwalker", "date": "December 27, 2007", "id": 11992954}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 34, "average": 120, "very good": 501, "terrible": 22, "excellent": 376}, "aka": "Sydney Grace Hotel", "slim_ranking": 0.2, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Discover Sydney from its heart at The Grace Hotel and be steps away from Darling Harbour and King Street Wharf, plus the best shopping, theatres and entertainment on offer. Standing beautifully restored today, the heritage listed 4 1/2 star Grace Hotel offers warm, personalised service and a unique blend of Art Deco charm and contemporary elegance."}