{"user_rating": 4.5, "review_count": 849, "name": "Grace Bay Club", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "My friend's and I wanted to have a girls night in before my best friend got married. We chose to stay at GBC and it was a wonderful experience. The staff were accommodating, the food was great, and the room and the views were amazing, even with a storm in the area. We stayed in a 2 bedroom family suite overlooking the pool and the beach, and enjoyed every minute of it! One night was not enough!", "title": "Girl's night in at GBC", "helpfulness": 1, "user": "Karlansia M", "date": "July 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167498157}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We are returning from a flawless vacation at this beautiful property! We are frequent travelers", "title": "AMAZING!!!", "helpfulness": 1, "user": "Schwabsters", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167455229}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "and what impressed us most was the friendliness and professionalism", "title": "Great Stay", "user": "Leemaleem", "date": "July 12, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167243298}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "of the entire staff...refreshing!!! Godfrey and Kenny (our personal concierges) were right on", "title": "Awesome!", "helpfulness": 2, "user": "ellienavid", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167209651}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "with their recommendations on food and activities throughout our stay. Godfrey miraculously", "title": "Luxury beyond our dreams", "user": "LynC270", "date": "July 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167163364}, {"rating": 5.0, "title": "Our very, very favorite resort.", "text": "Having stayed at GBC many times I must respond to a negative comment by a wedding guest staying at GBC. Friends were staying at Villa del mar and the comment was they were not treated well when they came for breakfast. If they wanted breakfast and were going to PAY for it, why not tell the hostess immediately they were not guests of the hotel. The hostess was doing her job. Your friends created an awkward situation not the hostess. I've seen several instances of outside guests trying to take advantage of the situation.", "user": "Et2942", "date": "July 19, 2013", "id": 168172013}, {"rating": 5.0, "title": "fantastic!!", "text": "GBC is an absolutely wonderful resort with a wonderful staff. We spent two weeks there in January and several days in March. We will be doing the same in 2014.", "user": "Martina_Martiii", "date": "July 16, 2013", "id": 167796134}, {"rating": 5.0, "title": "Plan and simple: Paradise", "text": "I think that this is a really beautiful hotel especially for the fantastic view.", "user": "Dlynnscott", "date": "July 15, 2013", "id": 167718934}, {"rating": 5.0, "title": "Absolutely Wonderful", "text": "I had (with my family) a really good time", "user": "Linda D", "date": "July 14, 2013", "id": 167576686}, {"rating": 5.0, "title": "Great place to relax", "text": "Staff is really welcoming", "user": "Alastair S", "date": "July 14, 2013", "id": 167564363}, {"rating": 4.0, "title": "Loved Grace Bay Club", "text": "My husband and I celebrated our 7th wedding anniversary at the Grace Bay Club (9/28-10/2/06). All we were looking for on this trip were great beaches, great restaurants, but most importantly TOTAL RELAXATION (as an ALL ABOUT US type of thing) since we were leaving our very active 4.5-year-old son with family. We're very happy to report that Provo and the Grace Bay Club delivered.", "user": "MrsTraveler", "date": "October 4, 2006", "id": 5910381}, {"rating": 5.0, "title": "Trip was good until we dined at Anacaona - hidden jewel", "text": "Upon our arrival at the resort, we were greeted with a wet towel and a drink. We sat in the beautiful lobby while an employee checked us in. He then proceeded to show us around the resort before taking us to our room. We spent the rest of our first afternoon at the beach, marveling at how blue, calm and clear the water is and how soft the sand is.", "user": "Schumanberg", "date": "September 10, 2006", "id": 5786479}, {"rating": 5.0, "title": "A wonderful Grand Hotel !", "text": "This resort has just grown from 20 odd suites to about 50 odd suites and i have to say they have done a great job in preserving the small luxury feel of the hotel. The beach/ocean front accomodations (of which all of them are)have an uncluttered feel which is excellent, and the beach....well, it has to be one of the best in the world. The people here are wonderful - always trying to go above the call of duty - extremely friendly and accomodating, it's really like visitng family. You will see the managment team in action at all times, i even asked the charming GM if he ever went home to sleep. We really enjoyed the two restaurants and i have to advise all of you to try the chocolate gourmandis, as it is to die for! The beach staff need special mention as they really made us feel that we were in paradise! Overall we were very impressed at where they have come in just 3 months of opening the new villas, they still have a few minor kinks to sort out,but we are confident that they will do so. A sure 10 out of ten on our list and we have been to many great resorts in the carribean like the 4 Seasons, Cap Jaluca etc!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 9, 2006", "id": 4449038}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "I have to say I was skeptical with all the mixed reviews posted. But after spending time on Provo and checking out the different resorts on Grace Bay, the layout of GBC is definitely the nicest--great use of the space, spread out. The other resorts--Palms, Point Grace, etc.--are all clustered together. At GBC, you step out onto your oceanfront balcony and you feel as if you are all alone--great! Stayed at the Hotel, which definitely needs work. Was told that they are completely renovating 3/06-12/06. Construction everywhere on Grace Bay, not just here, so be aware if you go off season. Thankfully there was no bulldozing going on during our stay but the Villa directly next to the Hotel was being finished. Plans to build the Estates (to the east of the Hotel) go into effect in 2007.", "title": "Service? what service?", "helpfulness": 16, "user": "pursuit", "date": "December 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 4310335}, {"rating": 3.0, "title": "Stayed on the Island, ate at the Hotel, enjoyed the lounge for drinks", "text": "And I definitely thought the Anacoana was the prettiest, especially at night. And the food was very nice, nothing spectacular, but I don't think it paled in comparison to Palms or Point Grace. About equal. The Lounge is wonderful too--live music, peaceful. But when we were there (3rd week Dec), the entire island was pretty quiet. Their continental bkft and afternoon teas are great.", "helpfulness": 9, "user": "Linnie-Bird", "date": "December 18, 2005", "id": 4248449}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "We spent a very enjoyable week at Grace Bay Club this Spring with our two young kids. There is no question that this resort offers the best food I have ever had in the Caribbean. The service was quite impressive for island service, though I did not adore our personal concierge who did not respond so promptly to requests and did not seem terribly interested in us. That said, he did always come through in the end and made nice dinner suggestions to us locally. We did not ask for much more, so it was just fine.", "title": "Island paradise", "user": "Elizabeth H", "date": "July 24, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 168927726}, {"rating": 5.0, "title": "Teens love it here!", "text": "Grace Bay Beach is really divine, and Grace Bay Club has a very nice set up on the beach. The pools are very good as well. Although I did not find the rooms anything more than average, we were comfortable, happy, and loved the view.", "user": "Sheryl Z", "date": "July 23, 2013", "id": 168773500}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I would most definitely return to GBC and look forward to it a lot.", "title": "Simply Paradise", "user": "bonniemadison", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168741087}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "What a perfect place for adults to relax while teens have a great time! Watersports are included, and our teens kept busy with sailing, kayaking, paddle boarding and windsurfing. Many thanks to Morley (water sports staff) for his incredible patience teaching my nephew to windsurf. Morley spent at least two hours instructing, even paddle boarding alongside and \"rescuing\" with kayaks and sailboats when my nephew had trouble turning around for shore. What a patient, hardworking guy!", "title": "I found Paradise", "user": "Mkpepe", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168704186}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "An appreciated addition to GBC this year was the pool/beach float mats, which we all enjoyed. However, the red beach beds were in poor disrepair this year; though we never use them anyway I was surprised to see this lack of maintenance.", "title": "Grace Bay Club = Top Notch", "user": "Alex G", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168703728}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "I'm a little late filing this!", "title": "I still love it!", "user": "MrsTraveler", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169490708}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This was my 3rd trip to T&C. The 1st time was an anniversary trip with my husband (stayed at the Grace Bay Club). The 2nd trip included our son (we stayed at Villa del Mar). I was all by myself for this 3rd trip in May 2013. Work had been stressful so my husband told me to just go. He didn't have to tell me twice!", "title": "Grace Bay Club is Paradise!", "user": "Mkny27", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169480169}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I booked Grace Bay Club and totally relaxed for a long weekend. I didn't go anywhere on the island since I was by myself. The resort has seriously expanded since the last time we stayed there. I'm still a huge fan of it. The weather was great. The food was great. The staff was great. What more can a girl ask for?", "title": "AMAZING vacation", "helpfulness": 2, "user": "Cynthia M", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169458293}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Misc1: Wifi only worked in my room and on one side of the beach.", "title": "Great Anniversary Trip", "helpfulness": 2, "user": "Cory M", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 169203182}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Misc2: A personal concierge came with the room rate. That's so not me but the guy was so nice. He made dinner reservations for me and booked me a massage but I had to have been the easiest guest he's ever had. I just wanted the pool and the beach! :)", "title": "We hated to leave....", "helpfulness": 1, "user": "brandi0604", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168968318}], "location": {"country": "Caribbean"}, "stars": 4.5, "variance": {"poor": 22, "average": 46, "very good": 108, "terrible": 27, "excellent": 646}, "aka": "Grace Bay Club Hotel", "slim_ranking": 0.170731707317, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}