{"user_rating": 3.0, "review_count": 97, "name": "Grafton Guesthouse", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "After an exhausting plane ride, my mother and i arrived at the grafton guesthouse by walking and getting slightly lost and irritated. The small sign and having to go to the hotel next door probably only irked us due to sleep deprevation. The room we were situated in had lovely wallpaper and a great bed. The shower and bathroom was spotless, and the location was perfect: just off of the main areas as not to feel insecure. While not getting a good nights' sleep due to the time change and the fact that it was Friday night, the breakfast in the morning made up for all of that. Included with your stay is cold breakfast at \"le Guelton\". do not miss it! You can order hot breakfast for a price, and it is well worth your while. The option of a half-irish is welcome for us females, and was prepared beautifully. The proprietor of the restaurant was very helpful, and drew a walking tour right onto our map that allowed us to take in sights and see parts of dublin you don't see through the bus tours.", "title": "Nice hotel: breakfast is a must!", "user": "ZenonZyyzzkk", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 80999269}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "I stayed at Grafton guesthouse for one night, last friday. The room was very nice, especially the bathroom which was new, with a big shower!", "title": "I stayed at Grafton guesthouse for one...", "user": "Elena88milan", "date": "August 10, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 74658520}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "There is no elevator, but i was located on the first floor, so it wasn't a big issue.", "title": "Great Location!", "user": "heather_rs", "date": "August 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 73286457}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The reception is located at Kelly's hotel, which is about 20 mt from grafton.", "title": "Cozy, cute, and comfortable, plus the included breakfast was delish.", "user": "culturedgirl", "date": "October 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 48207686}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The breakfast is great! It's server in a restaurant nearby.", "title": "Clean, Excellent Location and Reasonable Price", "user": "brian1984", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48035590}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "Four of us went to Dublin from England over bank hol weekend. We arrived on Friday night and went to the sister hotel 'Kelly's' to check in. Were told that The Grafton was overbooked! So we were put up in the penthouse suite at Kellys hotel for our stay. The penthouse was great full of expensive gadgets and very trendy apartment style room. Went out on Saturday and on our return to our horror the staff had moved our things out of the penthouse suite and told us our room at the grafton was now ready and that someone else was staying in the penthouse! We went to the Grafton which was tired and run down, in need of some TLC but beds were clean at least. We were refunded for one night for our troubles. Kellys is much nicer and trendier than Grafton. However Kellys is very noisy until early hours due to being above a pub! Oh by the way, I had even telephoned the night before our stay to confirm our booking!", "title": "Confirm your booking before you get there!", "user": "Rainbows213", "date": "May 30, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 110474346}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The Good: The location is very convenient--walking distance to everything you might want to see or do in Central Dublin. The building is beautiful from the outside--a true Georgian gem.", "title": "Indifference rules at the Grafton Guesthouse", "user": "Dhappel54", "date": "May 29, 2011", "detail_rating": {"cleanliness": 3.0, "location": 5.0, "value": 2.0, "rooms": 2.0}, "id": 110313235}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Bad: There is no one on premise--no reception, no housekeeping nothing. The property is managed by the folks in the Kelly Hotel across the street and, if earlier reviews are to be believed, they have ignored the upkeep in this property. If you have a concern (our safe key was missing) they are not interested in resolving it.", "title": "Great Location - But that's all that's great....", "user": "2LGtravelbugs", "date": "May 27, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 110130634}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "The Ugly: Although I requested a quiet room, ours faced Great George's Street which was very busy until 3 AM on Friday night. Loud traffic, emergency sirens, car alarms and many, many loud drunks.", "title": "Location - only good thing.", "user": "Kim J", "date": "April 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 105513849}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "Grafton Guesthouse has no front desk. When we arrived there was no one to greet us and I looked at my confirmation and was reminded we had to go to another guesthouse down the street to check in. Didn't think that was a big deal when we made the reservation, but it really does matter. There's literally NO one on the premises that works there. No service provided other than a room and a breakfast (again down the street).", "title": "Great value for the money", "user": "TravelAddict5350", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88789418}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "this place has 3 different locations, 1 is the reception, 2 is where you actually stay and 3 is where you have breakfast .all within a stones throw of one another but a very odd setup. the actual location is ideal and saves on taxis . we stayed at the very top floor and there are no lifts but apart from that the room was fine .there were 4 beds in our apartment/room and it was clean and tidy. no parking available by the way", "title": "odd", "helpfulness": 2, "user": "william q", "date": "January 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122367400}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "According to the website, it seemed to be a nice hotel... but in fact, we had a terrible experience.", "title": "Very bad experience", "helpfulness": 1, "user": "Oreldu17", "date": "November 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 120419370}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "First night, it was like sleeping in the street. The window are so thin that you could hear any noise from the street, and the street is one of the noisiest of Dublin. Furthermore, there was a water leak from the toilets.", "title": "Poor", "user": "ChicagoBeechbum", "date": "October 4, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 118938056}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We asked to change room. It was better but the velux window could'nt close completely and we could hear the hundred of people drinking in the bar just behind the hotel.the evacuation of the shower was blocked !", "title": "Wanted value but this pushes the limit.", "helpfulness": 2, "user": "sascolo", "date": "June 21, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 114618245}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The breakfast was not that good.", "title": "Good Location but Room Quality Poor", "helpfulness": 1, "user": "LeahVancouver", "date": "May 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 110476588}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Stayed one night in a triple room with two girlfriends. Was nice and central for shops and bars, easy to get to and from. On the hottest weekend this year the room way very warm at night, but a fan was provided and exhausted from a days shopping, drinking and dining made for a good nights sleep.Clean, cheap and cheerful and would recommend.", "title": "Suited our needs for a girly weekend", "helpfulness": 1, "user": "caitni2000", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130797197}, {"rating": 3.0, "title": "Average", "text": "Definitely can't complain about the location, but I guess we should have realised the noise would be...noisy. Firstly, picking up the keys from the other hotel is a bit of a pain, as no lift means you have to carry luggage up an extra flight of stairs and back down - wasn't expecting that. Then I had to change room, as the bathroom door didn't close - might not be a problem for all, but was for us. Strange, as the receptionist obviously knew this, and the bathroom itself had been refurbished. Unlike our second room. Slightly quieter as it was on the second floor, but my word, that bathroom was dated. The breakfast is served in yet another building - quite a nice restaurant, and not exactly far away. Good points though: location, 12pm checkout, comfy bed...", "user": "Sarah H", "date": "May 3, 2012", "id": 129282794}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We knew going into it the room would be small and outdated, but it was clean and in a great location and reasonably priced for Dublin. We knew we wouldn't be in the room much--so it didn't matter. Needed to pick up/drop off keys at Kelly's Hotel just a few buildings down.", "title": "Not modern but GREAT location", "helpfulness": 1, "user": "ConBakDoug", "date": "March 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126331880}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My boyfriend and I were very pleasantly surprised! We had read previous reviews on here and so were not expecting too much. We went with it though as the price was right and could not complain about location! When we arrived, Kelly's Hotel (where you check in) was right next door so dont see what the problem was there or see why someone had complained about this in a previous review (surely you read the info about this before turning up at the hotel, same goes for breakfast location, hardly a 20 second walk away, literally!!!) The staff were very friendly and welcoming and walked us to our room and explained all amenities and procedures etc. The room was comfortable and clean, decorated in retro style wallpaper which gave the room a lovely feel. (Again the person who found the decor laughable did you not view the photo's before booking a room here?? And btw, there is nothing wrong with the stairs, pretty sure I didnt even hear a creek as we walked to the top floor!) We stayed in a non-street facing room, which is surely common sense to request if you know you are staying in a centrally located city guesthouse. Anyway, the room overall was warm, comfortable clean and excellent value for money. The breakfast was wonderful, a lovely continental buffet. We certainly filled up on the breakfast, the restaurant where you take breakfast was a matter of 10 meters away from the guesthouse frontdoor, and was more than suffice! The location of the guesthouse was fantastic! A matter of 10minutes maximum walking distance from some lovely attractions. Bars, cafes, restaurants, shops and markets on the same street. A wonderful little guesthouse which was brilliant value for money. I very much doubt you'd get anything as good value in london for its location and hospitality thb. We had a fantastic stay for our valentines break and would definately stay here again! Maybe more suited to younger people 30years and younger, maybe that might explain the extreme difference in opinion. Maybe? I honestly cannot see where these bad reviews have come from judging by our own experience staying here. We loved it! Fab!", "title": "Fab!", "helpfulness": 7, "user": "Joanne C", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124651751}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Jo from Essex", "title": "Hillarious!", "helpfulness": 3, "user": "psycholewis", "date": "February 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 124270049}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 13, "average": 25, "very good": 37, "terrible": 11, "excellent": 11}, "aka": "Grafton Guesthouse Hotel", "slim_ranking": 0.540880503145}