{"user_rating": 3.5, "review_count": 2449, "name": "Gran Melia Golf Resort Puerto Rico", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "Just returned from 5 night stay at the Paradisus. Overall the resort is good, with exceptional rooms (we were in their Royal Service buildings), great pools and grounds. Staff were friendly and went out of their way to help. Food was varied from a great breakfast buffet to a so so dinner buffet. The theme restaurants were decent although the service was a little slow (Italien)", "title": "Not for Beach Lovers", "helpfulness": 5, "user": "M'times", "date": "March 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6898530, "likes": {"liked": "— Rooms and pools were excellent", "disliked": "— Beach was poor"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The beach was poor so if you are a beach person who likes to walk the beach and swim in the ocean this is not the place.", "title": "Lost in Puerto Rico", "helpfulness": 4, "user": "Bracca", "date": "February 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 6856789, "likes": {"liked": "— Nothing", "disliked": "— My ring was stolen"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Traffic in Puerto Rico is bad so plan lots of time to get to places. Every trip was twice the time we were told. Took us over 1 1/2 hours to get from gthe hotel to Old San Juan.", "title": "had a great time", "helpfulness": 3, "user": "marapr95", "date": "February 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6841572, "likes": {"liked": "— Very beautiful pool", "disliked": "— beach"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Weather was good, had a couple of rain storms that blew through in about 15 minutes.", "title": "Great relaxing vacation", "helpfulness": 2, "user": "gomo42", "date": "February 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6835328, "likes": {"liked": "— It was located in a gated area so we always felt safe", "disliked": "— beach"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Next to the property is the CoCo Beach golf resort with 36 holes. The Palms (9 holes) is the tighest course I have ever seen. No room for spraying as the jungle takes all! THe Mountain (9 Holes) has some great view and holes but also a couple of quirky ones. The other 9's Lakes and Ocean are a little more forgiving. Not cheap though as a round and rentals cost $200 US", "title": "Best vacation of my life", "helpfulness": 1, "user": "islandbarbiegirl", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 6819985, "likes": {"liked": "— The friendly staff and the good food", "disliked": "— Distance from San Juan"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We stayed here two days before a cruise in Nov. We paid a little extra for the Royal Service and were happy we did. The breakfast and the happy hour reception at night (drinks and snacks) were worth it. There was also a private pool. Our room was in a great location and was beautiful and spotless. Our room safe did not work at first but was fixed immediately when we brought it to their attention.", "title": "Nice Stay at the Gran Melia.", "user": "gruvtrtl2", "date": "December 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 22879851}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The resort grounds are beautiful but it is a little spread out. We didn't mind walking and enjoyed being serenaded by the coquis at night. The pools are beautiful. There really is no beach to speak of. The property was a little hard to find as they are doing construction in the area.", "title": "Beautiful Resort with Issues", "helpfulness": 1, "user": "wckdcj", "date": "December 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 22817052, "likes": {"liked": "— Great bed and pillows.", "disliked": "— No buffet as promised."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The staff were friendly and the service was very good. We rented a car and drove to the El Yunque rain forest which is very close by. Parking was $15 per day or $20 for valet at the hotel.", "title": "Not-So-Gran Melia (Thumbs down for Trump)", "helpfulness": 1, "user": "HappyInTheStates", "date": "December 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 22785493, "likes": {"liked": "— Getting Drunk", "disliked": "— Everything"}}, {"rating": 3.0, "title": "Potentially A Great Resort, but not yet", "text": "We only ate at one restaurant - the Italian one. The food was delicious but the portions were TINY. It was a little overpriced for the amount of food you received. That is our only complaint about the property. Otherwise it was a perfect stay in paradise.", "helpfulness": 1, "user": "717pilot", "date": "December 13, 2008", "id": 22695041}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We choose and paid an extra $1300 for breakfast and dinner. Two daily non-alcoholic drinks were part of that meal plan. Breakfast according to the internet write-up was buffet style. Dinner was also buffet but had two other a la carte restaurants available. Because the resort had virtually a handful of guests, there was no buffets. This meant guests had to eat at the other a la carte restaurants... and they only had one of these open evey other night. In addition, tipping was thus required (where it would not have been with buffets). There was no entertainment. This resort was out of the taxi zone... which was not specified upfront in the online hotel description. Service was not good in general. The beach was not walkable nor the ocean swimable (strong under currents), The main building however is very beautiful.", "title": "Amazing Time - Shocked at the Horrible Reviews", "helpfulness": 1, "user": "Chicoferhen", "date": "December 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22619517}, {"rating": 2.0, "title": "Loved Paridise", "text": "The hotel was amazing i just had a problem with dinner reservations and some people were very rude! But, overall it was a place i will never forget.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 26, 2005", "id": 3231918}, {"rating": 4.0, "title": "Fine experience overall but you're naive if you're expecting the Four Seasons or Peninsula stay.", "text": "My wife and I returned from a five-night stay at this lovely all-inclusive resort in January, and, like any new property (opened 3/04), it has kinks that have to be ironed out. I preface this posting by saying that my wife and I both work in the hotel/ hospitality industry for large hotel companies, and i must say that the Paradisus passes the test. The positives severly outweigh the negatives, and by reading many of these December postings, I have to believe that the Paradisus took the criticism to heart and \"fixed\" most of these bugs.", "helpfulness": 33, "user": "A TripAdvisor user", "date": "January 26, 2005", "id": 3087924}, {"rating": 2.0, "title": "Beautiful facility!", "text": "This is an all-inclusive resort where tips/ charges are taken care of by your daily rate. But I must say, the staff treated us like royalty from the moment we stepped out of our taxi. The door/bell staff are very cheerful and make an effort to please. They socialize with you and offer assistance before you even have to ask. In the hospiatlity industry, we are expected to anticipate our guest's needs, and at the Paradisus, they do that. From the bellmen down to the maids, they make a sincere effort to make you happy. I happen to believe that, despite it being all-inclusive, it's Ok to tip a couple of bucks. There were times I didn't have change and did not leave a tip, and it was fine with their staff. They didn't seeme bothered or slowed their service because of this. Believe me, this happens at many resorts (Cancun and Domomican rep. come to mind). I received terrific service on my first day through to the fifth day. My wife was there for a conference and I just tagged along and had fun.", "helpfulness": 8, "user": "58", "date": "January 12, 2005", "id": 3003177}, {"rating": 4.0, "title": "Great vacation!", "text": "The lobby bars are very good. You get top of the line liquor and you get your drink refreshed before you're even finished with the one y0ou have in your hand. There was a waiter, which I cannot remember his name, who must have swerved around 50 people in this one area. He was efficient and very friendly. I watched as he filled everyone's order (correctly) and quickly. No one tipped him. Not one. But he came back and gave the 100% service time and time again. I live in Chicago and let me tell you, I can go 15 minutes without having my drink refreshed or even have trouble getting the waiters attention. But at Paradisus, you almost never have to wave a waiter/ waitress over to you because they're already there.", "helpfulness": 8, "user": "yahootie", "date": "January 4, 2005", "id": 2976489}, {"rating": 4.0, "title": "All Inclusive gets good review", "text": "I disagree with the assertion that the pool bar/ waitresses sucked. The days varied as far as occupancy ( ranged from 40-75%), but I received great service in the pool. I had a waitress ask me at least every 15-20 minutes if i wanted something. Yes, she did her rounds. Best of all, when i was just snoozing, she didn't bother me like some resorts do.", "helpfulness": 5, "user": "sunfunlasvegas", "date": "January 3, 2005", "id": 2973653}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We had a wonderful stay at this resort. If you want a complete vacation to visit the island, rent a car.", "title": "Great...rent a car for a complete vacation!", "user": "TravelClarion", "date": "July 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17802768, "likes": {"liked": "— Location, modern decor, and the pool", "disliked": "— Needs new quilts"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Accomodations:", "title": "Great, Relaxing Resort", "user": "islandhopper629", "date": "July 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 17801256, "likes": {"liked": "— Relaxing setting", "disliked": "— taxi prices and location to attractions"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Everything was clean and well cared for. The beds were extremely comfortable (fluffy and huge). AC and cable TV, Free safe for valuables. Balcony with nice views of the resort landscape (not brick walls of adjacent buildings). Free coffee; (buy bottled water and beverages for minifridge).", "title": "Never Again, shame shame shame", "helpfulness": 2, "user": "JavierDiaz4", "date": "July 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 17771244, "likes": {"liked": "— The beach and being around palm trees", "disliked": "— Serviceeeeeeeeeeeeeeeeeeeee"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Pool:", "title": "Gran Melia Puerto Rico--Do not waste your time or money, read this review.", "helpfulness": 2, "user": "PapiHenry", "date": "July 9, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 17705522, "likes": {"liked": "— It's Pretty on the outside", "disliked": "— See my review"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Great! Warm waters. Can sunbathe on \"island platforms\" within the pool or nearby Coco Beach. Watch for the friendly hermit crabs that children like to collect.", "title": "Very Nice", "user": "MaratMiami_Florida", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17647805, "likes": {"liked": "— Spacious", "disliked": "— INo wireless internet connection"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "There was food left outside the neighbors door for 3 DAYS! We had to make alot of noise to get rid of the birds etc to get away from eating it so that we could get back into the room.", "title": "Loved the poolside drinks", "helpfulness": 1, "user": "dk190", "date": "February 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 6750755, "likes": {"liked": "— The pool and poolside bar", "disliked": "— Food left outside the room"}}, {"rating": 2.0, "title": "Would NOT Recommend", "text": "Many,many complaints were necessary to finally have it removed.", "helpfulness": 7, "user": "jstorms", "date": "February 5, 2007", "id": 6746385}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We just returned from a week at the Paradisus. It's absolutely beautiful and the staff is for the most part pretty friendly. As many others have stated, this place falls short in many ways and we were quite disappointed. We got there and were told that they were only at a 23% occupancy. We thought great, we will have no problems eating where we want. We are then told that you have to book reservations for you dinners way ahead. We tried to get in somewhere the first night we got there and were told there were no openings! With 23% occupancy, how can the restaurants be full? We were on a company trip so I mentioned this to our Marketing director who proceeded to check on the reservations himself and they gave him 10 spots at 3 different restaurants?? How does that work? The food was pretty good tasting however; it was ALWAYS cold at the buffets and not just a little cold. You would expect better quality of food at such a nice all-inclusive. We were wondering if there is ever any sort of Health Dept. that inspects and checks the foods temps. Also, for an all-inclusive they don't make foods very readily available. There is a very limited room service menu. There is no grill or anything right at the pool. You have to go into one of the restuarants to eat. Also, none of the staff is eager to get you another drink, many times we had to just go to the bar and get our own. This is definetly a beautiful place but for the money you could go to an all-inclusive in Mexico and get much better service and food. We will not go back here.", "title": "Lovely place but bring some power bars with you for dinner...", "helpfulness": 4, "user": "mshdhntr", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6714296, "likes": {"liked": "— very comfy bed", "disliked": "— the food"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "My husband and I just returned from the Paradisus and I am happy to say that I dropped a few pounds because the food was so horrible.", "title": "Gorgeous grounds, horrible management and service", "helpfulness": 13, "user": "Traveler1234567", "date": "January 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 6624100, "likes": {"liked": "— Appearance", "disliked": "— Experience"}}, {"rating": 4.0, "title": "Great Vacation Place", "text": "Let me say that the grounds are lovely, the rooms are large and clean, the bathrooms are very ample, the pool is gorgeous and the help could not be nicer.", "helpfulness": 17, "user": "miav", "date": "January 16, 2007", "id": 6606704}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Having been to Puerto Rico several times before, we were able to avoid some of the potential hassles and overall had a really nice time. Hopefully, some of these tips can help you. The hotels in PR tend to be pricy - Paradisus included. However, Paradisus serves decent food in the buffets, very good food in the reservations required places and has top shelf drinks included - the value is not bad as compared to other places. Paradisus has nice, large rooms with balconies. The beach is OK, not great. But the pools are wonderful and the place is large - i.e. not crowded. The service staff is primarily younger folks (this is not their career unlike what you find in many other Carribean destinations) - you see many of the things that can come with that - service is not always rapid fire or accurate - but it is generally very good. The hotel is well outside of San Juan. If you want to do excursions with a tour company, you get stuck with the inevitable waits you see anywhere in the world. (I abhor waits and shuttles) Here's some advice - if you are going to leave the resort and tour or partake in excursions, rent a car. Driving in PR is easy, rental cars are cheap, picking them up at the airport is fast and easy, self park is close to the rooms. A lot of cool stuff can be done on your own, you don't need a tour company. Or, hook up with the tour company at the destination rather than waiting on a shuttle. There are a lot of people from the North East. They, generally, have a more brusque approach to things - if that really bothers you, don't go to PR because it is a big destination for New Yorkers.", "title": "Pretty Darned Good", "helpfulness": 2, "user": "SkiKat", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6816036, "likes": {"liked": "— Very good spa", "disliked": "— distance from room to pool etc."}}, {"rating": 4.0, "title": "A week in paradise", "text": "I felt I needed to add a review to this website after using it in preparation for our family's trip. I read through many reviews ranging from \"this place is hell on earth\", to \"greatest destination I have ever been.\" After the reviews I did not know what to expect, but I trusted my family's decision and could not wait to get away. Our party included 18 people ranging in age from my grandparents to young cousins. I am a 29 year old male. I should note here that our last family trip to an all-inclusive resort was a disaster. Stay away from Playa Naco in the Dominican Republic at all costs. Paradisus was head and shoulders above our last experience. The trip to and from the airport was about 40 minutes by van and not bad at all. Our first order of business was an upgrade to royal service. I recommend this move if your budget allows. It provided access to a few extra ammenities including a separate royal service pool (ask for the mojitos), and some upgrades in rooms and dining. The all inclusive food and drink worked out very well for our party. It was great to be able to eat or get a drink at any time, day or night. My uncle was able to force me into a shot of tequila and a beer as I stepped out of breakfast one morning. The quality of the food was very good over all. This included the breakfast (good omelettes) and lunch buffets, and all of the different restaurants on sight. The only negatives here were the slow service at one or two of the restaurants, and some confusion over reservations. Not bad over all. Room service (try the quesadilla) and butlers were also free with royal service. The main pool in the center of the resort was a lot of fun for all including water basketball and other sports. I should note here, if you are a looking for a beach-front resort, paradisus is not for you. The pools were great and there was a beach volleyball court. The sand and beach area were not great. The staff and service was very competent and friendly over all, including one woman with beautiful eyes that my brother is still talking about. Some slow service in the restaurants but we had a party of 18 to serve each night. We were lucky enough to have great weather for most of the week. A little overcast and rain at times. The resort did get buggy at night and my feet and ankles were pretty bitten up all week. On our last night we were fortunate enough to catch the \"white party.\" A dance party where guests and staff (yes she was there) showed up wearing white and we danced and drank until the wee hours of the morning. A great way to end the week. My family's review was very positive over all. We all had a great time and I would recommend the resort. My major complaints were the lack of a great beach area and the bugs. I think I covered the important points and I hope you find the review helpful. Bring your sunblock and bug spray and enjoy the trip. Have a mojito for me.", "helpfulness": 8, "user": "p20nch", "date": "February 15, 2007", "id": 6798564}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "After reading the reviews in Trip Advisor I was prepared for the worst. After booking this package online I was unaware that you had to prepay a shuttle fee, please make sure you pay the fee otherwise it could be a very expensive cab ride to the resort. The resort is beautiful in appearance however it is 45 mins east of the airport and remote. The staff was polite and professional but weren't trained in providing excellent customer service. I didn't have a problem booking the restaurants for dinner. The best one I went to was Toscano in terms of atmosphere. One of the waitresses told me that in May the restaurants would no longer be part of the all inclusive package and that you would have to pay for the meals separately. I had breakfast at Caribeno twice the first outside which was not so good with all the black birds swarming around and the second time inside. I had to ask the hostess to get someone to replace my cream because there was a gnat in it. The waiters were nice though as was the staff who drive the trolleys around the gtounds. Also the resort does porvide day trips but you have to pay for each trip separately, one at least should be included in the package. I would suggest to the all the people who had not so pleasant experiences write Sol Melia Resorts the company that manages the Paradisus to express their displeasures.", "title": "Extremely Overpriced", "helpfulness": 3, "user": "NCDino", "date": "February 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 5.0}, "id": 6781090, "likes": {"liked": "— The resort itself was beautiful", "disliked": "— Too far away and remote"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My boyfriend and I recently stayed at Paradisus for 4 nights. After reading many negative reviews I was hesitant but the lure of an all inclusive sealed our stay here. Thanks to the advice of some savvy travelers, the suggestion of upgrading to \"royal service\" was heeded. I firmly believe if you can afford it, upgrade. The service was notably better as far as gaining dinner reservations easily with other advantages such as a private butler. Our", "title": "Paradisus tries but it's not a 5 star.", "helpfulness": 6, "user": "ILike2Explore", "date": "February 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 6780403, "likes": {"liked": "— Ocean front suite with an outdoor jacuzzi.", "disliked": "— The food."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "butler provided us with special services such as a cheese plate with wine before dinner and they even set up a romantic jacuzzi evening for us. It seemed to be ask and you shall receive.", "title": "Below Average Paradisus", "helpfulness": 6, "user": "sci", "date": "February 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 6752627, "likes": {"liked": "— The property", "disliked": "— The rooms and food"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "This hotel is very beautiful, but the service was the worst I have ever experienced. It took 1 1/2 hours to check in! Even after this length of time, one of the couples went to their room only to find it preoccupied. Had to go back to the office for another hour to get it straightened out. Next morning check-out took 1 hour. The desk said that we had only paid for two rooms and owed for a third room. We had booked online, but they said they had no record of an online booking. With duplicate paperwork (which they took at check-in) we were able to prove we had paid for 3 rooms. They said they would not charge us for the 3rd room, but When I arrived home from our vacation, they had charged my credit card I had used for incidentals over $700 in unlawful charges. These charges on my credit card were placed without authorization or my signature. I contacted them, and it literally took 3 full days to get it straightened out. Wells Fargo said that these charges were all done illegally because they did not contain a reference number. The hotels explanation was: \"Someone by a name similar to yours came and checked in a week later, and we accidently charged the wrong credit card. The funny thing is...they didn't have my credit card at all when supposedly this other couple checked in. I had to cancel my credit card because I was afraid they would keep charging it. \"What a scary Situation\". We will NEVER stay there again! We feel they are disgusting and dishonest in everyway.", "title": "Dishonest, Terrible Service", "helpfulness": 1, "user": "kgshaw1954", "date": "December 4, 2008", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 22444995, "likes": {"liked": "— Beautiful location and facility", "disliked": "— Customer service, dishonest hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The hotel is just beautiful. The lobby area is huge, with plenty of places to sit and relax. It has several water fountains and ponds that give you the sensation of being in a truly tropical place.", "title": "Perfect setting for couples", "helpfulness": 1, "user": "Jgomez65", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22352903, "likes": {"liked": "— Beautiful hotel, clean", "disliked": "— Parking. You must walk or take a golf car every time you go to your room"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The room was very clean and spacious. It includes a balcony and sitting area. Although our room was not ocean front, you could see the beach from the balcony. The beach is less than 50 meters away.", "title": "NEVER AGAIN!!!", "helpfulness": 3, "user": "clorany", "date": "November 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 22272042, "likes": {"liked": "— Rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "The staff was very courteous and helpful. They can provide you with maps and driving directions to all the mayor attractions in the area and even to farther places like San Juan (the hotel is about 45 minute drives from the Airport and about 1 hour from San Juan)", "title": "If you want to be treated like royalty...", "user": "delgman", "date": "November 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22260832, "likes": {"liked": "— service, staff, physical sturcture", "disliked": "— natural beach was protected but I like pools better and they are right on the beach so who cares."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Grand Melia Puerto Rico is not a traditional hotel .The rooms are villages grouped in units of 4 to 6 each (three on the bottom and three on the second floor) There are not elevators and you cannot park in front of your village, instead you must park near the lobby or the casino and they will take you to your room in a golf card. If you don’t want to walk you must wait for the golf car to pick you up and take you back to the car. They pass by frequently or you can call the front desk and ask them to send someone to pick you up.", "title": "Held Hostage at the Gran Melia", "helpfulness": 7, "user": "Moochanator", "date": "November 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 22012071, "likes": {"liked": "— Rooms", "disliked": "— Food, Location, Beach, Just about everything else."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Though the resort itself is beautiful, we found that it really never exceeded our expectations. The lobby area, pool, furnishings, spa, etc. are gorgeous. The rooms are a decent size. The food is nothing special, which is to be expected in an all-inclusive I guess. For the money, we would recommend staying at The Ritz and be assured of exceptional service. With few exceptoins, we found most staff to be apathetic. Three out of the five days we were there, our room had not been cleaned by the time we returned from the pool around 4pm. This was at a time when the resort was more than half empty so I wouldn't want to be there when it is at capacity.", "title": "Gorgeous Hotel, Service Needs Improvement", "helpfulness": 14, "user": "KLM1970", "date": "March 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3298748}, {"rating": 2.0, "title": "can't get their act together", "text": "I also heard that they allow people to day-trip at the hotel pool, which I think is unacceptable when guests are paying to stay there. It just created more crowding.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "March 23, 2005", "id": 3296184}, {"rating": 1.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "Overall we had a great time, but we would likely not return to Paradisus, which is unfortunate because it has much more ambience than other resorts I have been to in Puerto Rico. A management overhaul would likely bring the service up to par with the surroundings.", "title": "No paradise at the Paradisus", "helpfulness": 11, "user": "Boeckmann", "date": "March 21, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3291966}, {"rating": 3.0, "title": "Much better this year!", "text": "just returned 3/20/05 from hotel and their are several area to be concerned with:First-Transportation,when you cal there they either give you the conciege or transportation to arrange travel from the airport.These are two different services within the hotel ,so be aware when you call to confirm and they say there is no reservation.Also the hotel does not tell you that a cab (all vans) from the airport is less expensive and not a per person charge as is the hotel.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3281286}, {"rating": 5.0, "title": "A fantastic trip to paradise", "text": "Reservations for eating were impossible.They have 3 restaurants that require reservations and they do not let you make them on the phone.The restaurants are small and it's hard to get a reservation at a reasonable time.They do not open reservations for Fri or Sat until certain times.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 15, 2005", "id": 3274749}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Just got back from a week at the Paradisus. The service was horrific. We seemed to be bothering everyone when we asked something. It took us three hours to get from the lobby to our room. They insisted we use their bell boy and this is how long it took to get a party of 8 to our two bungalows. The food was no better than a cafeteria. Everything was a buffet. We ended up having Dominos Pizza delievered the last two nights because we could not handle the food any longer. There is no beach at this resort. It is all seaweed and rocks. You can rent paddle boats and kayaks, but are limited to a specific area. There is a kids club and our three children loved it, however, it was only available 3-4 hours per day, unlike the advertised hours. The weather was great and we did get a nice tan! Good Luck if this is your destiniation.", "title": "Terrible!!!", "user": "GONORTHGIRL", "date": "March 28, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 7239406}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Myself and a few girlfriends decided to go on a nice getaway to Puerto Rico and stayed at the Paradisus. The resort was absolutely gorgeous. The buffet was gross so expect to spend some cash at the local eateries. The key is to make friends with the resort staff because their very helpful with giving directions for local restaurants and attractions. Rent a car because it is easy to get around and the price to rent cars are really cheap and are accessible from San Juan Airport. I highly recommend the following restaurants which are 10 minutes away from the resort: EL Dejao and Las Vegas (Yummy!)", "title": "Gorgeous Resort", "user": "mo1love", "date": "March 27, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7230227, "likes": {"liked": "— The garden view from the balcony", "disliked": "— The broken A/C"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "I just returned from a 5 day trip to the Paradisus. We upgraded to Royal Service. Our review is mixed: we had a wonderful, relaxing time but the customer service is REALLY lacking.", "title": "Beautiful resort and great food but customer service lacking", "helpfulness": 2, "user": "cmc2275", "date": "March 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7229966, "likes": {"liked": "— The resort and the resort facilities", "disliked": "— the customer service"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "First, the Royal Service turned out to be a good thing for checking-in (we were able to bypass the front desk) and for making dinner reservations and also for reserving the \"huts with beds\" at the Royal Service pool. The Royal Service pool was great---not crowded and quiet. No children are permitted. There is also a separate bar at the Royal Service pool. That is the only upside to Royal Service but highly recommend it since we couldn't imagine what the service would have been like if we didn't have it.", "title": "Way better than expected", "user": "missnr", "date": "March 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7226590, "likes": {"liked": "— everone was really trying to help you", "disliked": "— distance to other activities"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "The food at the resort was excellent. We tried all the restaurants except the Italian. Order the filet mignon where you can. The Asian Fusion restaurant was ok but the menu was limited and again, the service was lacking. Breakfast and lunch are buffets but don't be scared---the food was great and varied. The lunch buffet had fresh fish, sandwiches, hot foods, gourmet salads, etc.", "title": "Great time", "helpfulness": 2, "user": "sam8273", "date": "March 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7208620, "likes": {"liked": "— the pool", "disliked": "— all the walking.buildings very far apart"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Difficult to find... far away from san juan...atleast 30-40 min A lot of construction on site....we upgraded to the vip plan....staff friendly and great....great concierge service...got picked up/dropped off in golf carts.....no complaints... the room was gorgeous facing the beach...the beach was not very inviting... VERY NICE POOL....with palapas Great furniture in the lobby...bar makes excellent drinks. The food at the hotel also needs help...breakfast was very bland", "title": "ok", "user": "thepandas", "date": "January 5, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 23272189}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "the only complaint i have is the BED BUG BITES, i noticed after i got home....i would suggest that they exterminate the rooms, and install dehumidifiers as the rooms are very humid which may be causing the bed bugs to thrive....The ac seems to turn off as you exit the rooms... which may be adding to the problem....The hotel staff is excellent.... and the grounds are gorgeous.......", "title": "Enjoyed the stay!", "helpfulness": 2, "user": "bokson", "date": "December 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23118244, "likes": {"liked": "— The hotel grounds are enough to be satisfied", "disliked": "— Not enough selection of food"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I read many of the reviews on Gran Melia as my wife and I were looking for a short 3 night stay in Puerto Rico.", "title": "Absolute Paradise!! I don't understand the bad reviews!!!!", "helpfulness": 1, "user": "Love2TravelfromVB", "date": "December 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23109371, "likes": {"liked": "— How beautiful the landscaping and decor was", "disliked": "— That we weren't allowed to stay forever for free :)"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Of all the 4-5 star hotels in Puerto Rico(i checked on sidestep.com) , Gran Melia's price per night was sig. lower than it's website price(we got 800 including taxes on lastminutedeals.com, compared to 1100+ on other sites). I even checked other comparable hotels which, during Christmas, were well above 300+/night for this hotel class. So all in all a great deal! btw, we did not order Royal Service", "title": "Great Resort and Worth the Cost", "user": "flatfender", "date": "December 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22965741, "likes": {"liked": "— The views of the beach and mountains all within the turn of your head.", "disliked": "— Having to come home."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "To add to the other reviews listed:", "title": "Perfect Place!", "user": "TravlerKat", "date": "December 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 22940166}, {"rating": 5.0, "title": "Loved it!! Don't believe everything you read", "text": "I was not looked forward to my recent trip based on the reviews but after the first day my mind was changed.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 9, 2006", "id": 5441836}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "The food was good. People must have only ate at Mirador Grill for them to say it is bad. I will say that the Caribeno did have better breakfast and lunch than Mirador Grill.", "title": "the worst service I ever got", "helpfulness": 1, "user": "SERVICIO", "date": "July 7, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5437438}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Toscano was good. Joel the Maitre D' is great and very friendly.", "title": "Loved the Paradisus, don't listen to the bad reveiws. ITS AWESOME", "helpfulness": 7, "user": "seagrl44", "date": "July 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5420059}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Bamboo was excellent!", "title": "Some people can't enjoy themselves!", "helpfulness": 3, "user": "JSmith48", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5419564}, {"rating": 1.0, "title": "Believe the HORROR STORIES! They OVERBOOK even confirmed guests are sent away", "text": "Romantico very good! Roberto is a great waiter.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 1, 2006", "id": 5414806}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "OK. I don't normally write reviews but after all the horriffic things posted about Paradisus on this site I felt that I had to. I do feel awful for the people who had bad experiences here, but my husband and I just got back from 5 days there and were THRILLED with the entire experience. Yes, it took about an hour for our luggage to arrive at our room after we checked in, and that was a bit annoying, but we went and had a drink at the bar and it was fine.", "title": "Had one of the best vacations of my life.", "helpfulness": 1, "user": "sullil01", "date": "March 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7189775, "likes": {"liked": "— Gorgeous grounds, great food.", "disliked": "— Slow to get luggage delivered."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We did NOT upgrade to Royal Service, but still managed to have no issue with service or attentiveness by the staff. Example: one night we locked ourselves on our patio. (Actually not that hard to do, so watch out, people!) I flagged down one of the MANY golf carts that drive around offering rides to guests to ask him what we could do about it. (I was in my jammies, as was my husband, and didn't really want to walk back up to the front desk.) The driver stopped the golf cart, even though he had a passenger on it, went to a courtesy phone, had them speak to me to verify I was who I said I was, and then used his master key to get me back in my room. All was taken care of within 5 minutes.", "title": "Good service not included", "helpfulness": 2, "user": "LikesTheSunBoston", "date": "March 15, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7165298, "likes": {"liked": "— the beauty of the resort itself", "disliked": "— overall service and unwillingness to make a problem right"}}, {"rating": 4.0, "title": "Great Experience", "text": "We also couldn't have been more happy with the staff - they all had a big smile and a wave for each guest, and went out of their way to help you out. A girl working at the pool taking drink orders even went into the casino to get change for me! I was amazed. And they were all so helpful as far as telling us what everything was - there was a traditional Puerto Rican dance show our first night there, and the VERY busy bartender took time out to explain to us what it was, what its' name was, and why the dance was done.", "helpfulness": 2, "user": "007travel", "date": "March 12, 2007", "id": 7148055}, {"rating": 1.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "The food was GREAT. Yes, the outside dining (Mirador Grill) has quite a few birds flying around, and you do see them around the salad bar area, so if you get queasy about that, don't go there. The Caribeno (the other casual buffet) is inside and WONDERFUL. The restaurants that require reservations were delicious, and the appetizer buffets are ridiculous. You barely even need your entree! Beware of the 'snack' buffets, though (afternoon and late night) - all greasy stuff. Ick. Chicken wings, pizza, chicken nuggets. I guess that's more for the kids though.", "title": "Worst Hotel Stay EVER", "helpfulness": 3, "user": "srp123", "date": "March 9, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 3.0}, "id": 7007896, "likes": {"liked": "— Room", "disliked": "— Food & Service"}}, {"rating": 2.0, "title": "5 Stars My Butt", "text": "All in all, it was Paradise. Truly. We had an amazing time, the weather was perfect, and it was a very special vacation for us.", "helpfulness": 6, "user": "07Gemini", "date": "March 1, 2007", "id": 6898957}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I absolutely loved it! At first glance my breath was taken away. The lobby décor was extraordinary. I was very skeptical about staying at this resort because I read all of these negative reviews about it and because I was traveling right after the recent fiscal crisis in Puerto Rico. To my surprise there was nothing to worry about. The ambience at the Paradisus put me in a relaxed tropical vacation mood right from the start. Getting stressed out was impossible at this place. Don’t believe all of the negative reviews. I was a nervous wreck during my whole flight worrying about what was waiting for me at this resort.", "title": "Absolutely Loved It! The Negative Reviews Are Not To Be Trusted", "helpfulness": 11, "user": "cinnabar75", "date": "June 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5371831}, {"rating": 2.0, "title": "Checked out and went to another hotel", "text": "The service was excellent. The staff was extremely attentive whether you tipped or not (I forgot to tip a few times). The only service issue I had was that housekeeping removed the washcloths and towels from the room daily but they would only replace them if they removed them from the towel rack. I know, silly but true. I never put my washcloths and towels on the rack after I use them so everyday I had to request a washcloth and towel. That was annoying.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 19, 2006", "id": 5360674}, {"rating": 4.0, "title": "Don't believe all the negative reviews", "text": "The food was excellent. I enjoyed all of the restaurants with the exception of the Midori Grill. The Midori Grill is the day snack eatery. This is the place to go if you missed one of the other restaurants for breakfast, lunch, or dinner but you are still hungry. The food tasted good but ………….The Midori Grill belongs to the birds, literally. I am not at all comfortable dealing with birds of any kind. Because I am a native New Yorker, every bird is a pigeon. Those birds flew all over the place. They walked on the tables, they ate every piece of unattended food (including the buffet) and when they were done they pooped. Yuk! I only had to eat there on day 1 of my vacation because I neglected to read the electronic itinerary in the front of the resort that tells you what time everything opens and closes. Don’t make that same mistake; you do not want to eat with the Puerto Rican pigeons. The food at the other restaurants was excellent and so was the service. I read reviews that stated that the buffets had many unidentified foods and that the eggs were not safe to eat. I eat Caribbean food often so I knew what the few native dishes were. The breakfast buffet had an eggs station. I don’t really care for trendy food presented with chocolate drizzle and parsley on the plate so I was satisfied with what they had to offer. I had no complaints at all.", "helpfulness": 2, "user": "gary d", "date": "June 13, 2006", "id": 5341832}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The Beach was very small and full of shells. It was not very appealing but I am not a beach person so that did not bother me. However, before I left the resort I toured the grounds with the Melia Club and I discovered that the Paradisus has a section for Royal Services. This section is cut off from the rest of the resort. It has separate villas, separate staff, a separate pool, and a separate beach which is beautiful. The common traveler doesn’t have access to the Royal Service facilities and for good reason. Those people paid $$$$$$$ to be isolated. So if you want to have access to the fabulous Beach at the Paradisus that’s the way to go. But the pool will make up for the beach, if you don’t want to spend that kind of money.", "title": "Perfect family vacation", "helpfulness": 9, "user": "QueenBee22", "date": "June 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5315969}, {"rating": 3.0, "title": "has its ups and its downs", "text": "The pool is phenomenal. It’s huge! It has a swim up bar, pool beds so you can lie down and be in the water at the same time. There are real beds (not sure what they are called) on the outside of the pool as well. All of the activities take place around the pool. You can have a drink in the pool, step out to have a salsa dance lesson and then get back in the pool. It was great!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 5, 2006", "id": 5313191}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This Hotel is definitely not what I expected after I was there a couple of days. The grounds are very nice, a little worn down, but overall very good. However service is very inconsistent, here goes my summary:", "title": "Regular if you have high expectations", "helpfulness": 6, "user": "panajoe81", "date": "February 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124930316}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Check In: only 2 people at the front desk so it takes a while to check in since this is a huge resort and usually you have people either checking in or asking some questions, and many of the people go to the front desk instead of the concierge that is on the left side of the reception area.", "title": "Red level service overated", "helpfulness": 5, "user": "Eli E", "date": "February 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 124878544}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Room: Not bad, very good size, a little tired and should get some upgrades. TV's for me nowadays at these resorts should be at least flat tv's and if you are lucky have HD. Here the tv is small and the reception is not great, good amount of channels though. I did not see a mini bar, everything is a walk from your room since so I would've liked to have an option for some snacks in my room without having to go through room service.", "title": "trip review", "user": "phand31755", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124869039}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Spa: They do their best to try and make it a top notch resort, but it is not even close. Very expensive to start out with (140 bucks for a mani and pedi for the wife and 175 bucks for a hot stone massage). I can get those prices at a St Regis or Four seasons which have amazing spas. The spa is loud and very small, I used the facilities and there is only 2 showers in the mens locker, and very small jacuzzi and one toilet! It is extremely hot in the locker since they have a steam room and a sauna in this very confined space. They don't have many therapists so basically you get treatments done when they have time not when you want!", "title": "Appears tired and in need of some love.", "helpfulness": 3, "user": "digital_dilemma", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124825257}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Food: Regular food in my opinion and so expensive. I ate at the Asian and the Italian rest. we paid an average of 85 bucks a person with no alcohol, which in my mind is crazy for the quality of the food. I am not a picky person, but this was a joke. I went to Pikayo in San Juan, its located in the conrad hotel and is an amazing restaurant and paid 175 with tip and 2 drinks, and the restaurants at the Melia are not even comparable to this.", "title": "Red Level a Must!", "helpfulness": 2, "user": "Thomas M", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124802643}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Gran Melia was once an all-inclusive which would have been great, except they changed two days prior to our arrival.", "title": "Felt like prison", "helpfulness": 3, "user": "chicagotvd", "date": "May 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 1.0}, "id": 7565456, "likes": {"liked": "— The warm weather provided by mother nature", "disliked": "— the location"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Positives:", "title": "No where close to a 5 star. Not worth the price.", "helpfulness": 3, "user": "DerrickWTampa", "date": "May 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 7555743, "likes": {"liked": "— Beautiful Hotel", "disliked": "— Service and cleanliness of rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007", "text": "Beautiful resort, great pool, okay service.", "title": "Can't recommend it", "helpfulness": 1, "user": "cway", "date": "May 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 7551118}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Negatives:", "title": "A terrific resort", "helpfulness": 3, "user": "USAlawyer", "date": "May 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7545193, "likes": {"liked": "— Nicely landscaped, spacious rooms, varied choice of restaurants, great pool and serene beach", "disliked": "— Some confusion at front desk, no evening activities for guests other than casino."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Way too expensive...Corona's were $7.00. An 8 ounce draft of local beer was $6.00. Food was TERRIBLE. The hotel is 3.5 miles from the main drag which limits any walking that you want to do. Gran Melia is an all-inclusive type hotel minus the all-inclusiveness.", "title": "Paradisus was Paradise!!", "helpfulness": 1, "user": "bubbles3266", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7430540, "likes": {"liked": "— The fantastic layout of the hotel", "disliked": "— promptness of bartenders"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My wife and I stayed at the Gran Melia Resort starting February 7th for eight nights. Although it's a pretty resort and the employees were nice, I was amazed at all of the problems we experienced here, especially considering it is NOT a cheap resort! When we entered the room for the first time we discovered two light bulbs that were burned out which we had to have replaced. Also when we entered the room for the first time the message light was flashing on the phone, only to discover that is was a \"bogus\" warning, that the resort was having trouble with the message system. Then we realized there were no dressers with drawers to put our clothes in, something I have always had, even at cheap motels such as a Motel 6! Instead, they had shelves to put the clothes on which could not be closed such as in a dresser. During our stay there were MANY power outages, some relatively short in duration and some not so short. A couple of these power outages caused problems with the water supply to the room. One morning, after a power outage the water could not get any hotter than barely warm for the entire resort so I took a shower early in the morning with a water temperature that was barely tolerable. I was told that the power outage broke three out of the five pumps at the resort and they couldn't get a plumber out during the night so fixing it had to wait until later in the morning. So the water temperature was like this for at least five hours and of course, at a bad time when guests would be taking showers. A few days later another power outage caused the water to go completely OUT for a while in the morning for the entire resort. Fortunately, neither my wife nor I were in the shower when this occurred. I feel sorry for any guest who happened to have a head full of shampoo when the water went out! I checked my room charges daily and right at the begining I noticed a charge of $1 for UNICEF on my room charges. When I asked why this was on my room charges since it was not authorized, I was told by someone at the desk that the computer sometimes does this, as if the resort had no responsibility for this! I had never heard of a hotel doing something like this. One of the mornings when we returned to the room, our room card wouldn't open the door. Luckily, a maid was nearby who opened the door for us. We were told our cell phone must have caused this to happen. This made some sense until I discovered the other room card also wouldn't work, which had been locked up in the room safe at the time, far away from our cell phone! The resort offered and we did recieve a discount card named \"MAS\" which provided discounts at the resort restaurants during our stay. Unfortunately, for some odd reason they were unable to enter this into their hotel computer system during our stay, something that seems pretty basic in the age of computers, and they do have computers even at this resort. Instead, we had to provide this \"MAS\" card everytime we went to a hotel restaurant to receive the discount. One time we simply forgot the card so I had to walk back to the room to get the card and then back to the restaurant, the only way to receive the discount. One day while we were out I was expecting an important message from a tour company to find out what time they would pick us up at the resort the next day. At the time we were on a separate tour of the rainforest so we could not recieve calls during this time, obviously. When we got back to the resort I asked at the desk if there were any messages for us while we were out. The clerk at the resort desk told me there weren't any messages. As it turned out, in fact, there was a message from the tour company, written on a piece of paper stuck at the side of the door at our room. One would think that desk clerk could have at least told me that yes, there was a message, even if she wouldn't tell me what the message was! On our last day right before checkout, we were carefully looking around the room to make sure we didn't forget anything to bring back home with us, my wife discovered a plastic bag of old cereal from a previous guest. We know for a fact that many other guests while we were there also had numerous complaints about their stay at this resort. Some of these guests we talked to while we were there and saw some irate guests while we were in the lobby each day at the resort. We were in the lobby each day, usually for about an hour, because the lobby is the only area where free Wifi was available at the resort and we actually appreciated having this free Wifi during our stay. Many times while we were in the lobby we noticed irate guests who were upset about the resort for one reason or another, some of whom asked for and ended up speaking to a manager. Fortunately, our tour company did an excellent job on our vacation which helped make up for our multiple bad experiences at this resort. We liked Puerto Rico in general on this vacation and found it to be very pretty, even prettier than Hawaii, but if we return we will never stay at this resort again!", "title": "Avoid This Resort!", "helpfulness": 9, "user": "Michael R", "date": "February 17, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 124738069}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The negative reviews about Gran Melia truly amaze me...I cannot find anything to complain about. But, as a response to some of the complaints, here's what I would say...if you are a person who wants everything to happen immediately, Puerto Rico (most of the caribbean actually) is probably not the best destination for you. If you want to be in the middle of hustle and bustle, this is not the resort for you. Gran Melia by design is a quiet, beautiful resort. It sits off by itself on a peninsula so yes, it's definitely best to have a car. There is an Avis on site and the parking is very reasonable ($16 per day). In fact, ALL the prices are reasonable for a resort: rooms, food, and drinks. The grounds are absolutely beautiful and the service is top notch. The rooms are clean and very well appointed but they do get a bit humid (it's a tropical climate 10 minutes from a rain forrest - we're not talking rocket science here), just keep the air conditioner running and it's not a problem.", "title": "Relaxing and beautiful", "helpfulness": 11, "user": "mnp19148", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124632203}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The red level upgrade is definitely worth it, and when you add up the ammenties that red level affords (breakfast, evening hors d'oeurves and cocktails) the cost is very close to the standard room. The service that you get from the Red Level staff (especially Nilda in the lounge, Angel the butler, and Gus and Manny at the Red Level pool) is so great! They clearly take pride in their work and treat you like guests in their home.", "title": "Inconsistent", "helpfulness": 3, "user": "ButchChicago", "date": "February 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124599881}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "I really can't say enough about this resort, I would recommend it to anyone without hesitation. I will go back many times I'm sure. My advice to the complainers: relax! You're on vacation!! :-)", "title": "Marvelous", "helpfulness": 8, "user": "joanne c", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124432764}, {"rating": 2.0, "stay_parameters": "Stayed February 2012", "text": "Stayed here several times, had great times and been very frustrated ( own a time share next door). If you stay here, lower your expectations. Pay extra for royal service. And tip extra up front, for better service.", "title": "Beauty only skin deep.", "helpfulness": 10, "user": "ajwkmills", "date": "February 10, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 124414296}, {"rating": 2.0, "title": "Great Facility, Poor Management", "text": "Not deserving of the “Leading Hotels in the World” status. The facilities are beautiful, but the poor management creates a 2 star experience.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 3, 2005", "id": 2973182}, {"rating": 4.0, "title": "A great getaway", "text": "1) The better restaurants are booked days in advance and you can’t book them prior to arrival. So those restaurants really aren’t available to you during busy seasons. Also the reservation system is horrible with many reservations being lost. Even when the restaurants are booked, there are many empty tables. I suspect the capacity is linked to lack of cooking staff. Also, while there are plenty of choices in the buffet, the food is NOT 5 star.We were served our bread without butter at Romantico. It took a half hour and 5 requests to finally get it.", "helpfulness": 4, "user": "SilkeSyl", "date": "December 17, 2004", "id": 2897615}, {"rating": 2.0, "title": "To lead or not to lead", "text": "2) The music around the pool and expansive lobby area is way, way, way to loud. You can’t talk, you can’t think and the music is often annoying. I love loud music and concerts, but a pool side and lobby is for relaxed talking. It’s simply a matter of turning the volume down.", "helpfulness": 17, "user": "Worldtraveler", "date": "December 14, 2004", "id": 2879578}, {"rating": 4.0, "title": "Not deserving of \"Leading Hotels of the World\" rating", "text": "3) The towel situation around the pool is out of control. People get up at 6am to reserve chairs and by 8am they are all taken. Granted we were there the week after Christmas but there has got to be a better way to manage the chairs and towels.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "December 9, 2004", "id": 2874083}, {"rating": 5.0, "title": "A Diffinate Repeat", "text": "4) Don’t expect a beach, there isn’t one. The ocean frontage is on a lagoon though, so the free sail boats, pedal boats and kayaks are a wonderful option here not possible on a regular beach.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 9, 2004", "id": 2873876}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Our party of 4 spent 5 nights at Paradisus in March 2007. One of our travelers walks with a cane and has difficulty standing alone. Our sad experiences began with the doorman. We arrived in the afternoon and after standing for considerable time with our bags at the entrance, we asked if we could not proceed to our rooms. The doorman responded that he was busy and for us to sit down and be patient. We considered this an insensitive comment directed to a handicapped person.", "title": "Paradisus is Not Paradise", "helpfulness": 3, "user": "wmrc", "date": "April 23, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "location": 3.0, "rooms": 5.0}, "id": 7418235, "likes": {"liked": "— Beautiful hotel", "disliked": "— Attitude of staff, mostly indifferent."}}, {"rating": 3.0, "title": "Good Stay", "text": "We proceeded to the registration desk. The receptionist was disorganized and not understanding the reservations. We finally reached our rooms only to find that our reservations had been switched. The handicapped person did not receive the requested handicapped room. The second couple did not receive the requested king bed. We returned to the registration desk to seek correction. Believe it or not it took almost one hour of confusion to check in.", "helpfulness": 1, "user": "AKfrozen", "date": "April 16, 2007", "id": 7374991}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We were informed that dinner reservations had closed at 4:30 and we could present ourselves to any of the several restaurants for seating without a reservation. Nothing could be farther from the truth as we arrived at first restaurant and we were informed that we could not be seated until 9:00, a little late after a long day of travel from the states. I sought the help of the night manager who obtained us a table at the Bamboo Restaurant. For a 5-star resort we were shocked by the brusque service. It was as if we were intruding on the staff's routine. The food was expensive and unsavory. Duck in wrap was cooked so hard that we could not eat it. We were much relieved to finally get to bed.", "title": "a relaxing and enjoyable trip - Penfield,NY", "helpfulness": 2, "user": "1anna1", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7368256, "likes": {"liked": "— the pool"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "The next morning the breakfast buffet was fabulous as it was each morning. Breakfast was the best meal of the day. Trying to get food at the pool was another matter. There is none. You must go into the restaurant for lunch. I asked the receptionist if I could take some food to the pool. She explained that it was not allowed but that I could wrap up some food in a napkin and take it out. That I did each day.", "title": "Missing it already!", "helpfulness": 2, "user": "wanita36", "date": "April 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7363240, "likes": {"liked": "— The beach and pool. The landscaping too!", "disliked": "— Leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We had two excellent meals at Avocado and Romantique. The resort is in the process of renaming the restaurants. Avocado food was superb but the service was about 2 star if that. The waitress insisted upon delivering our check before our dinner was complete. Since we had the same annoying experience the evening before I pointed the oversight out to her , and she insisted that was what management required. I explained to her that the check should not be presented until the guest asks for it particularly so if dessert or coffee is likely to be requested. My comments did not make any impression, instead she argued with me.", "title": "Our best vacation yet!", "helpfulness": 2, "user": "McLucky", "date": "April 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7289033, "likes": {"liked": "— Service", "disliked": "— No beach"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "The hotel grounds are beautiful. There was a recently a management change. They still have a way to go. I understand there have been several management changes in the last two years. Service in restaurants is very inconsistant. Room service gets our order correct 50% of the time. Best food is in Bamboo and Romantico restaurants.", "title": "I'm here now, July 14, 2006", "helpfulness": 5, "user": "KTM250300", "date": "July 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 5465438}, {"rating": 5.0, "title": "Had a Blast", "text": "Overall, this hotel has great potential. But, has falls short now. Tour desk only has one person. Generally a wait to get information. However, offers variety of excursions. Recommend 4 wheeler trip. No food service at Royal Service pool. If you want food delivered, you must order room service and have the food delivered to your room and carry it yourself to the pool. Odd!! Recommend Royal Service for couples.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 13, 2006", "id": 5463923}, {"rating": 5.0, "title": "Loved Paradisus", "text": "Lots of small kids and blaring mexican hip-hop music at main pool. Lots of locals here on weekends, with children. Two additional luxury hotels are scheduled for completion next to Paradisus within the next few years. Hope everything is up to speed by then or they will have a difficult time.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5447865}, {"rating": 2.0, "title": "Not very All Inclusive at all...", "text": "My wife and I picked the Paradisus Puerto Rico, because we had stayed at Sol Melia All Inclusives before (Playa Conchal Costa Rica), and we were curious about seeing Puerto Rico. We also thought we could (and did) get a good deal in the off-season (last week of June). After we made the reservation, we had some difficulty getting answers to some of our emails, but were still excited to go. Then someone suggested checking out Trip Advisor. Wish we had not. The reviews were negative, and just made us anxious about the whole thing. As it turned out, we had a great time. The food, facility, service, area etc. were all wonderful. We play golf, and the Resorts nearby were excellent (Coco Beach and Rio Mar). If you play golf, you must play the Lakes and Mountain Courses at Coco Beach, and the River course at the Rio Mar. The hotel will take you to the Coco Beach course for free, and pick you up. We did not run into a single unhappy person at the hotel, and everyone was wondering what provoked those negative reviews. As for ourselves, we have nothing, but good things to say. As others have said, you should make your dinner reservations for the whole week as soon as possible. Also be advised that if you rent a car and drive there, the self-parking is $10.00 per day. The area and facility are beautiful. If you do go, plan ahead for checking out. We called three times to get our bill, so that we could do Express Check-out. We finally gave up and went to the front desk. Luckily no one was in line and we were immediately taken care of. We hated to leave, because we had a blast.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5447185}, {"rating": 1.0, "title": "the wrost service ever", "text": "We stayed at Paradisus June 12-20 2006 for our honeymoon and had a fabulous time! The rooms were beautiful. No problem getting into the a la carte restaurants (everyday but the first). I am a foodie and was worried about the food. However, the dinners were wonderful. Room service was excellent. The breakfast and lunches were buffets, but were not bad. I especially liked the fresh fruit. It was very relaxing, had music every night and had lots of optional tours. We loved the rainforest tour with extended hike, where we could swim in La Mina Falls. We also went deep sea fishing (didn't catch anything :() , snorkeling and to Old San Juan. The pools were beautiful and it was very easy to get a cabana. A great place to visit if you want a relaxing vacation!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5446312}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We came with a group of farmers from North Dakota and noone had any complaints. Had a great time. The room we stayed in was clean and had lots of room. But, the 2 french doors were broke going to the balcony, so we couldnt lock them when we left. My hubby riged the doors with the drawers of the dresser and a tall stool from the bar. I'm sure the maids came in wondering what in the world we were doing...but we didnt have time to wait for someone to come fix it, we were to busy with all the tours we took. We were doing something everyday. It was way out in the boonies, so we had to take a taxi everywhere we went. Cheap if you were with a group. Some people said rent a car, i dont know about that. The driving was alittle crazy for me. The place was beautiful.!!", "title": "Had Fun", "helpfulness": 3, "user": "nodakfarmgirl", "date": "February 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 124359912}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "After reading reivews of Gran Melia I was nervous to go. It greatly exceeded my expectations. The staff was very friendly. We loved the Red Level pool -Manny was a great bartender. The Bali beds with views of the ocean were heaven. The drinks at the pool were good, breakfast was good, we tried the Italian & Puerto Rican for dinner & were disappointed with both - below average food for high prices and so so service. If I were to return to this resort I'd stop at Ralphs on the way in and stock up on my own food. The beach was beautiful as were the pools. You felt as though you were on your own private beach. So peaceful and relaxing. The lobby and bar areas were large and beautiful. Definitely a great place for a romantic getaway, wouldn't bring my child, as it is tailored more for adults.", "title": "Beautiful Resort", "helpfulness": 5, "user": "moopr", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 124350103}, {"rating": 1.0, "stay_parameters": "Stayed February 2012", "text": "We checked into this beautiful hotel for our honeymoon, thinking it was going to be wonderful! Upon check-in they asked us what credit card we'd like to put a hold on for incidentals, seeing as they don't let you pay with cash ANYWHERE in the hotel except the casino and gift shop, we asked what type of hold would be done and how much, as most of our spending $ was in cash. The front desk clerk told us they'd hold $100 / day and we could settle up with the other charges in cash at the end of the trip. NOT THE CASE! Our card was hit 3x before we even checked out! When we actually did go to check out, we were first met by the supervisor who told us we should have been told if we exceeded the $100 / day , whatever we went over would be added to our account, and held on our card with the other charges until the end of our trip...except that was a lie also! We put down a debit card...so it AUTOMATICALLY took out any overages immediately. Luckily my husband likes to check our bank account periodically, and noticed the charges, otherwise we'd have paid twice before leaving today (and yes I'm so mad I'm writing this the same day)! When the supervisor had nothing helpful to say, I asked to speak to the General Manager of the hotel. My husband and I work in the service industry as managers (I'm a shift manager, and he's a General Manager) and when someone asks for a GM...you find one...Immediately! Unfortunately, that didn't happen. Next we were met by the Front Desk Manager who re-itterated the SAME thing the supervisor said. Our problem isn't paying...its being lied to by an employee who should know his job before telling people incorrect information that screws with their money! Especially on vacation...and even more so on someones HONEYMOON! I then asked for a General Manager again...so someone else comes out... I feel its important to mention now, that another employee has now confirmed to me that the \"blonde guy in the suit\" I saw walking around, is in fact on the property AND the GM...the person who greets me is not blonde or in a black suit...he's the ROOMS Manager. Before I even begin the conversation, the smarmy look on his face infuriates me, so I ask for the GM again...and am told a 3rd time, he's not available or on the property. We are then informed that they don't really care how we feel bc they've already been paid. GREAT HOSPITALITY. On top of all that, they tax on top of making you pay for parking, and charge a daily resort fee (normal these days, but no one told to us/reminded us at arrival). The pool is unheated and you have to battle the birds for clean lounge chairs and any food you have near you. The restaurants alternate nights, so you have to plan accordingly, and make sure you have a reservation, you'll wait 15minutes anyway, but if you don't have one at all, you won't eat...the food is sub-par...sushi was the only thing worth eating, don't bother with room service or the pool bar...its also annoying they only have one place to eat for bkfst and lunch, no options...", "title": "DO NOT GO HERE...THEY LIE!", "helpfulness": 8, "user": "envs", "date": "February 9, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 3.0}, "id": 124347901}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The one shining star at that resort...Richard the bartender! If you're unfortunate to have already booked your vacation, go hang with him and give him all your money! He's a fantastic bartender and host! HE should be the GM! At least he understands customer service! Much more than I can say for ANYONE else at that hotel!", "title": "DO NOT GO", "helpfulness": 4, "user": "LAWOFFICESOFGK", "date": "February 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 124319408}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Thanks for ruining our honeymoon! We'll never be back!", "title": "Can't wait to go back!", "helpfulness": 1, "user": "Twoboys610", "date": "February 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124317146}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I visited the Paradisus Puerto Rico with my boyfriend from December 6 through December 13. I chose this resort based on my previous stays at the Paradisus Punta Cana and the special pricing I received. As all the reviews have stated, it is a beautiful resort. The room and bathroom were both large and well appointed. I did not expect the groomed sandy beaches because I had read previous reviews but I’m sure some guests were disappointed. The food was always good, especially Avocado. I am not one to always plan my evening meals and would have liked the option of an informal evening buffet. We had no difficulties getting reservations for dinner however I’m sure it would be a problem if the resort were fully booked. To our advantage there were few guests staying this week. I have read that getting people to come to this resort has been an issue and may explain the special pricing of my package. I do take exception to the negative comments about the staff in previous reviews. I felt the staff was no less than great. Special thanks to bartenders Efrain, Shirley and Alex, and server Vanessa. I did find the management team was rude to guests as well as staff. The tension between management and staff was obvious. This may explain some of the less than flattering reviews about the staff. The Melia parent company is also promoting its vacation club that has a building under construction at this resort. This, as well as the pressure for “Royal Service”, was somewhat distracting. The entertainment and activities staff was not as I was used to from my many stays at other resorts. The entertainment was a singer in the main bar area every evening and the activities seemed less than enthusiastically promoted. The only major complaint during my stay is what will prevent my return and my recommendation of this resort to others. The resort allows day passes for guests, which in itself is no problem. The problem occurred when 70+ young adults (18-25) from Blockbuster Video converged on the pool at 10 in the morning and drank heavily until 5 in the afternoon. They were loud and obnoxious. When I complained to management that there was no oversight for these individuals I was told there was nothing they could (or would??) do. These guests had paid their $135 and basically too bad. I never did find out what happened to one partier who was passed out cold in one of the outside showers.", "title": "Not worth the money", "helpfulness": 10, "user": "vpn", "date": "December 27, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 6504808}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Unfortunately, while the property was lovely, enough lapses occurred that I cannot recommend vacationing here. We stayed just before Christmas 2006 in a Royal Service Oceanfront Junior Suite. We found our room musty and poorly ventilated. The beach was for walking only, and not for swimming--we had to hire a driver to take us to a nearby beach for that purpose. The enormous pool is gorgeous, but not heated.", "title": "There are better options . . . .", "helpfulness": 13, "user": "jaypatent", "date": "December 23, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6485553}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Two restaurants were open for breakfast and lunch. One, the Mirador, was infested with a number of black birds. Several of them landed on the bread line of the buffet and picked away while we were seated there. The remaining quickly circled our table. The staff did nothing, so we left promptly. We ate the rest of our breakfasts and lunches at the other restaurant, which typically opened 5-10 minutes late.", "title": "Loved the resort", "helpfulness": 4, "user": "Oksana K", "date": "December 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6480297, "likes": {"liked": "— swimming pool, room, service", "disliked": "— beach, ocean"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "We found the \"Royal Service\" not particularly helpful in making reservations. Rather than arrange travel or tennis for us, for example, we were simply directed to queue up at the front desk, concierge, or travel desk. Royal Service did provide a prompt check in and check out, however, and also gave us access to the charming \"Royal Service Suite\" as a base of operations. The suite was far less musty than our room, and featured a TV, Internet access, drinks, and a small buffet.", "title": "Gorgeous Resort, Horrible Service", "helpfulness": 9, "user": "DarleneSanJose", "date": "December 19, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 4.0}, "id": 6473403, "likes": {"liked": "— Beautiful facility", "disliked": "— Customer Service"}}, {"rating": 4.0, "title": "Almost Paradise", "text": "Although the hotel boasts that tennis lessons are available at certain times, in fact the staff will simply call local tennis pros to see if one will visit on-site. Nobody was available during our stay, so my daughter didn't receive a lesson.", "helpfulness": 3, "user": "BaltNj", "date": "December 14, 2006", "id": 6441325}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "Personnel - 4 out 5 stars", "title": "forget all the bad reviews", "helpfulness": 5, "user": "Dbuoy1961", "date": "January 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6606065, "likes": {"liked": "— the food and wine and the pool", "disliked": "— not enough day activities off the property"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "8 out 10 staff members smiled and greeted us. We didn't have any issues checking in or checking out. The operator was always there to pick up the phone and helped us. Everyone was friendly and attentive.", "title": "eh... beautiful facility, ok service, too many New Yorkers", "helpfulness": 10, "user": "tervs", "date": "January 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 6569930, "likes": {"liked": "— patience and a sense of humor"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Food & Drinks - 3 out of 5 stars overall, but some restaurants are better than others", "title": "Beautiful Hotel but poor service, mediocre food and bed bugs!", "helpfulness": 9, "user": "ParkSlopeBoy", "date": "January 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 6556838, "likes": {"liked": "— Beautiful hotel with nice decor", "disliked": "— Bed bugs and TERRIBLE service"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We didn't use room service, so we can't comment on that. We had breakfast at Caribeno and Mirador Grill. We found Caribeno to be better than Mirador Grill for food quality. The outdoor seating at Mirador Grill is nice and convenient if you've been out at the beach or the pool all day, but there were bees by the desserts and pastries - at times I wasn't able to get desserts and pastries because I was afraid of the bees. Mirador Grill is also open for snacks in the late afternoon. We had dinner at Avocado (steak house), Romantico (fine dining) and Bamboo (Japanese steak house). Avocado was below average for your usual steak house - the appetizer and desserts were buffet style, but the main course is ordered from the menu. We liked Romantico and Bamboo much better (both are not buffet style). Make sure to wear pants for Romantico, we saw a guy who was asked to change since he had shorts on. Other restaurants were not as formal, but people did somewhat dress up for dinner. We didn't have any issues with dinner reservations (we made our reservations right after we checked in), but the hotel didn't seem to be booked when we were there.", "title": "Total Rip Off - Not as All-Inclusive as You Would think.", "helpfulness": 17, "user": "petulia", "date": "December 30, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 6520117, "likes": {"liked": "— Hotel building is nice", "disliked": "— Food - Horrible"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My wife and I had never been to an \"all inclusive\" resort before, so we weren't sure what to expect. The resort is beautiful, the room was very nice. We opted for the \"Royal Service\", so we had an upgraded room (ocean view with jacuzzi on terrace). Nothing better than sitting in the jacuzzi, wind blowing through the palm trees, watching the ocean. The Royal Service also gets you faster check in/check out, immediate dinner reservations for your entire stay, an adult-only pool area (much stronger drinks mixed at the adult-only pool), a special area to check e-mail, have snacks, etc. All staff was very friendly and helpful.", "title": "Loved it . . .", "helpfulness": 5, "user": "gmat43", "date": "December 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6438782}, {"rating": 4.0, "title": "Surprised by others complaints of poor service...", "text": "Breakfast and lunch are buffet-style, and the inside restaurant (Carmeno) had plenty of choices. We did not try the Mirador, which is the outdoor buffet. Dinner at the Romantico was fabulous -- the filet mignon was excellent, and the service and atmosphere was as good as I have ever seen. The Bamboo (Japanese cooking at the table) was also very good.", "helpfulness": 5, "user": "FastEddie_MA", "date": "December 12, 2006", "id": 6433495}, {"rating": 2.0, "stay_parameters": "Stayed November 2006", "text": "We took the rain forest tour which included a hike to the waterfall, which I would highly recommend. We spent time at both pools, and you can reserve a cabana (large covered bed area) to relax and put your towels, bags, etc. Besides a short walk, we didn't spend any time at the beach, because the pools are so nice. Overall, a top-notch vacation.", "title": "Wanted to love it.", "helpfulness": 8, "user": "m.stanley", "date": "December 1, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6313233}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Stayed at Paradisus with my wife from December 4-11, 2006. I was a bit worried, given some of the bad reviews I had seen from people who said the staff was rude or otherwise inattentive. Thankfully, this was not my experience.", "title": "Nice place to stay - but not 5 star", "helpfulness": 7, "user": "ravi_sim", "date": "November 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 6230451, "likes": {"liked": "— rooms, bar, waitstaff, beauty of property", "disliked": "— beach, tourdesk, phone calls charged exorbidantly"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The facility is very nice. Suites were spacious and well-appointed. Housekeeping was good overall, but lost points when they forgot to restock our fridge the last 2 days and also for missing hand towels on a couple days. Other than that, the room was clean and well-attended.", "title": "Facility 10+/ Food 3/ Service 3 too bad nice hotel", "helpfulness": 6, "user": "Chaver", "date": "November 27, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 6181689, "likes": {"liked": "— The hotel is really beautiful", "disliked": "— Food is terrible"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "My husband, mom, MIL and 1 year old twins traveled to this hotel in January. Let’s start at the beginning. This is not in San Juan, it is about 45 minutes away from San Juan, but is very easy to get to. If you want the party/city life, you will not be happy here. We were fine with this as we have been to San Juan over 10 times and did not need to be in the city. The hotel was at the end of a long drive once you turn into Coco Beach/Trump Golf. We were well received and the staff couldn't be more accommodating when we arrived. I went to park the car and when I returned my husband was ready with the room keys. Check in took all of 3 minutes, very fast, the lobby was very well designed with all the restaurants concentrated there. We did not upgrade as we were traveling with our kids and the private pool at the red level does not allow kids. We received rooms close to the hotel with a kitchen and living room, which we needed since traveling with kids we had requested a fridge but this was better. Maybe these were not the most wanted rooms (not close to the beach) but they were the biggest and when you have kids you want these rooms. The rooms did not have a balcony but again not needed with 1 year old twins around. The rooms, 117 and 118 came furnished with a kitchenette and some dishes, glasses and cooking essentials. The only drawback was the rooms only had 1 king size bed. No double beds. We tried to switch one of the rooms since my mom and MIL were sharing and they were very accommodating and willing to move us but the rooms with double beds did not have the kitchenettes, so we opted to stay and make use of the pullout sofa in the living room. We opened the sofa and it was the worst shape ever, the legs did not even stand. We decided not to make a big deal of that as the space was more valuable to us than the sofa. My mom and MIL slept in the same bed since it was huge. The bathrooms were big but do show wear and tear as so does the rest of the resort. The breakfast in the morning was good; yes it was the standard breakfast at any hotel. We had our MAS card and only paid half price for breakfast which was $11. I think $11 for buffet breakfast is a good deal and they were very liberal with the take-away policy, did not care if people walked out with fruits or yogurts. The lunch at the wet bar (pool area) was good too, $10-$20 entrees, again right in line with what you would expect in a resort. The best dish there was the paella which is about $28. The burgers were ok nothing to write home about. I think they could use more diversity for lunch, as that was the only place open. I would love for them to have a lunch buffet or some other a la carte restaurant open for lunch. The drinks were not bad at $8.50, had the standard resort drinks and depending which bar you ordered them from the liquor content changed. The pool was good, big with plenty of shade and plenty of Bali beds. I did not have a problem with the music until the weekend and then they had a live DJ which was a bit loud so I moved further out to a spot on the pool that was more remote. The Bali beds, $25 per day, but it seemed anyone could just hope on them as no one was checking and a couple of times I had to tell people I had them reserved for the day as they were there when I arrived, no matter what bed you got you always got the sun during some part of the day. They should really put up shades to them. Sometimes they were made up for you if you reserved them but mostly I was given the sheets to do it myself. I think a bit of customer service in this area would have gone a long way. My favorites were #13, #14 and #16. Close to the kid’s pool and the bathroom, restaurants. The beach was ok, rocky but plenty to walk and get your own spot. The night restaurants, we only ate at the Puerto Rican one and the food was delicious and plentiful, no complaints and no I did not think it was expensive, dinner for two with wine/beer $78. However the waitress there forgot everything we ordered and came back twice to get our order... We order mofongo, she took the order came back to drop off the drinks and asked us again did we order the mofongo? Annoying as this happened with every single thing we ordered. I took advantage and every time she came back asked her all sorts of questions regarding the area and things to do. Never ate at the other restaurants but they look cute, with tables near the water inside the lobby, very cute setup. We order their pizza service from our room once and it came pretty quickly but the pizza was a bust, yuck, we had better frozen pizza at home. The market store will save your life. They sell everything from coffee/ice-cream to diapers and the prices were very reasonable. We ended up going out as we had a rental car and went to the supermarket, Amigo, 3 times. It is about a 10 minute drive and has everything. We loaded up on food for the twins, water and some beer, wine for us. We also went to luquillo and ate at #20 and Ricky’s. Very good food at both places. Actually brought food back with us on one occasion which we had the next day for lunch. We also went to the outlet mall once. The casino is very small and you can forget about free drinks. This is not Vegas, AC nor San Juan but it did make a Good Friday night. The lobby had entertainment on Friday and Saturday.", "title": "The Most Honest Review on this Property to Date", "helpfulness": 8, "user": "ndelapaz", "date": "February 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124316007}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Overall, this hotel was solid 4 stars. They deliver in some cases and not in others. I had to call once to get our room cleaned but that has happened to me in a solid 5 star and had to call them to get an electrical problem fixed, has happened in a better hotel too. The bathtub was not thoroughly clean. The good things, I always had extra towels, always had a ride to the room, the breakfast service was amazing since our kids made a mess of it every morning, had drink service while at the pool. Enough room to lay out at the pool or beach. This hotel is good if all you want is to relax and not be bothered, there was enough room in the property to get your own spot and not have people all around you as in other resorts. Overall we had an amazing relaxing time with our family and if you do priceline as we did you will not be disappointed.", "title": "Great Trip - January 2012", "helpfulness": 2, "user": "restondrums", "date": "February 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 124274282}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We spent a week at Gran Melia and since we got a great price we decided to upgrade to Red Level service. Oh my, what a fabulous decision that was. Combine a full breakfast every morning, a three hour \"happy\" hour every night, an oceanfront suite with a jetted tub on the balcony, and finally the use of a made up bed, poolside: incredible. if that was all we would have been happy but since the Gran Melia is located in a remote spot and we elected to forgo a car rental we were \"forced\" to use the onsite restaurants. Well, we needn't worry, each of them was fabulous, well prepared food (and we can be picky), great drink selections and signature desserts that were wonderful. The prices were not unreasonable (we're from Washington, D.C., so unreasonable is relative). All in all we will be back. Travel Hint: rent a bike and travel along the golf course and around the property - good exercise and lots of fun!", "title": "All encompassing resort near rain forest", "helpfulness": 3, "user": "cliffview12", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124228583}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "We really enjoyed this resort.We flew into San Juan and didn't want to drive too far since it was in the evening. This was about one hour from the airport. One of the places we wanted to see was the rain forest and it is about a 20 minute drive to El Yunque Rainforest (which was wonderful). The resort had a number of restaurants. We ate at the Italian one (food so so, ambiance great) and had breakfast each morning at the cafe buffet. The grounds are beautiful and had nice lounge chairs by the beach. The pool was nice. We spent more for the Red Level category which has it's own pool and it's own check in area. I don't know if it was worth it--my advice would be to go for it if it's not a lot more. They have a separate room to check in and out. They have an evening happy hour with wine/beer/ soft drinks and appetizers and you can eat breakfast (continental) there in the morning. We chose to go to the full breakfast buffet instead. We had a room on the second floor with an ocean view (not ocean front, but still saw the ocean and really enjoyed it). Just a note: when you turn off on the road to get to the hotel you pass a couple of big places first. We thought we had arrived a couple of times, but the gran melia was further down the road!", "title": "Worst experience ever This is the anti-Club Med: watch for your $$$!", "helpfulness": 3, "user": "globesurfer11", "date": "February 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 124224121}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I didn't actually choose this resort as I got my accommodation there through the \"name your own price\" feature with priceline but I wish I hadn't used that feature! I have never been so bored in my life as there is nothing to do in this resort in the middle of nowhere and no access to any town unless you have a car and pay the hefty parking fees. On top of that everything is charged and is extremely expensive, even a bed near the swimming-pool. It is the contrary of the Club Med: nothing is included and you have to pay for every single thing!!!They also charge resort fees of $15 per night on top of the already expensive room price. The swimming-pool water is cold and even in the jaccuzzi area! Worse than that, the staff couldn't care less and can't tell you about what activities are going on and at what time. They don't seem to be aware that there are other languages in the world than spanish and english but their english is poor and their spanish is different from the spanish spoken in Spain. Besides, there is no authenticity whatsoever in this place. Everything is artificial and flashy and it's not even clean outside the lobby area! The food at the restaurants is bland and stodgy, although very pricy. No wonder they can't find enough clients and have to get them through this feature. Hopefully I only stayed there a weekend but that was a weekend too much... Never again!", "title": "Beautiful Resort, but.....", "helpfulness": 1, "user": "Shakazee", "date": "February 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 124209898}, {"rating": 4.0, "title": "Really nice!", "text": "I stayed at the Gran Meliá the last week of July and had a really great time. My sister and I took my parents there- who had never stayed at a hotel before- and we are sooo glad we chose it! It has 1st class accomodations and service.", "user": "prchic65", "date": "August 5, 2008", "id": 18658054}, {"rating": 1.0, "title": "Grand Melia or Grand pain?", "text": "Beautiful pool and we really enjoyed the water aerobics class, since it was more for fun than anything. The atmosphere at Ave Nue Bar was great ,except that we wished they'd had the live entertainment- \"batucada\"- that was printed on the schedule. Loved the indoor gazebos at the bar and the beautiful furniture alll around. everyone was very friendly and helpful. Highly recommend it!", "helpfulness": 3, "user": "1RedShark", "date": "August 2, 2008", "id": 18553179}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Do go out to eat since the food is so expensive for a party of 7.", "title": "Beware!!", "helpfulness": 5, "user": "FloridaSunshine2008", "date": "July 31, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 4.0, "location": 2.0, "rooms": 1.0}, "id": 18467170, "likes": {"liked": "— Service and cleanness"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The Grand Melia was a grand painful experience for my wife and I. First and foremost, the hotel failed to advertise or offer transportation vouchers back and forth from the hotel. So before we even left the airport we had to eat a $35 dollars each ($70 dollar for 2, $140 dollars round trip, Taxi's were the same price) transportation fee to get the resort. This was using there shuttle service..", "title": "5 star prices, half star service", "helpfulness": 2, "user": "nolatele", "date": "July 31, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 3.0}, "id": 18455063, "likes": {"liked": "— It looked great", "disliked": "— the service"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "To there credit, the resort architecture is extremely elegent with a mix of art deco and comtemporary designs. The rooms were incredible. However, all of that deminished due to the lack of service. We experience numerous and consistant issues with service from the time we arrive until the time we left 4 days later. My wife and I were part of there so-called vip service called \"Royal Service\". The Royal Service was a joke, There was not one piece of the VIP service that was satisfactory. Even after discussions with management, poor service continued. After the second day we basically had to fend for ourselves. We had to bushwack house keeping to get them to provide us towels so that we would at least have enough to take a shower the next day. They struggled with basic services like room service (took an 1 1/2 to bring a pizza to our room, when it can it was already cold).Royal service included a butler which introduced himself and was never reachable the whole time. They charged you for everything too. I won't waste your time complaining about the resturant food and service, grounds transportation, pool services, and etc. All of it was terrible. Ever couple we met complained about similar experiences.", "title": "Beautiful resort, Inconsistent service", "helpfulness": 2, "user": "amcConnecticut", "date": "July 29, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 18376637, "likes": {"liked": "— The rooms and the beach", "disliked": "— The service"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Don’t really understand what’s not too love about this place. Stayed here for four nights and loved every minute of it. The rooms were absolutely beautiful, spacious and the shower to stay there all night! My only complain about this place the darn roulette tables at this hotel never won! Other than that, will without a doubt stay here again (I will make sure and play at another hotel ). Armando at the front desk was very nice can’t comment on the hotel food since we ate out all the time. If you want to relax this place is the one.", "title": "Loved Gran Melia", "user": "giyo19", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22006830, "likes": {"liked": "— The room very spacious", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My wife and I stayed at one of the Royal Service oceanfront suites #2007 from 11/14/08 to 11/17/08. It was by far one of the greatest experiences we ever had, the service is impecable, the personnel could not do more to accomodate us and overall I met some of the most amazingly friendly people you will ever see. We highly recommend this place to take your family or to have a quiet time as a couple. Everyone of their personnel is very proud of working there and they go above and beyond for you. We cannot wait to go there next year for our anniversary. Alex & Pat", "title": "Honeymoon at the Gran Melia", "helpfulness": 1, "user": "Santiaguero43", "date": "November 19, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 22005573, "likes": {"liked": "— Amazing service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed at Gran Melia for a week Oct 29th-Nov 6th. The location was ideal: 5 minutes to El Yunque, 20 minutes to Fajardo (Ferries, Kayaking) and 25 minutes to Old San Juan where we spent the weekend. After a busy weekend in Old San Juan, returning to Gran Melia was like a coming home to a private oasis in Paradise...", "title": "Enlightened all of our senses: Beautiful resort with Grade A Service!", "user": "AustinMcKs", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21854540, "likes": {"liked": "— The Ambiance", "disliked": "— Remote, best to rent a vehicle to see the island"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The interior and exterior of the grounds are aromatic and illuminary. Exotic, melodic, up-tempo music fills each of the indoor and outdoor spaces. Our room was beautiful and the bed the most comfortable one we've ever experienced in our lives (coming home to what we thought was a nice bed, was a bit of a disappointment)!", "title": "Paradise at Gran Melia", "helpfulness": 1, "user": "lelie40ct", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21471856, "likes": {"liked": "— luxury in paradise", "disliked": "— the beach"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Spend the money for the Royal Service Treatment, it pays for itself in spades with a free nightly happy hour from 6-9pm, a private Royal Service Pool, discounted services, and truly amazing, personalized service from the staff.", "title": "Had a Fantastic Time", "helpfulness": 1, "user": "Bruingal79", "date": "October 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21325640, "likes": {"liked": "— The grounds", "disliked": "— Distance from San Juan"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Arrived to check - in which took over 1 hour. Only 2 people at the desk registering new arrivals. Not offered a drink. I went to the bar and relunctantly I was given bottles of water. We were unaware of the \"Royal Service\" (RS )so we had to book our restaurants for the week at the concierge. We did manage to get to the restaurants we wanted .We prefer to be waited on and not do buffets and did get those type of restaurants..", "title": "Not 5 Star but they are working on it", "helpfulness": 4, "user": "BritRN", "date": "July 26, 2006", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 5513623}, {"rating": 5.0, "title": "One of the BEST!", "text": "From there we decided to get towels and go to the pool . At 3pm there were no clean towels and we were told to walk to the RS pool to get some. Well bad no towels , good that we went there. This pool is Adult only,( no -one under 18yrs) peaceful , elegant and has upgraded wooden sun beds. We figured out very fast this is where we wanted to spend our week. An Upgrade cost us only $25 pp, which in our opinion was definately worth it. If we had done this in advance we would have also been able to check in at the designated RS lounge (so no waiting upon arrival). A continental breakfast and pre-dinner appetizers are available in the RS lounge- worth going there as other people said lines for breakfast were horrible in the main restaurants. Restaurant wise the Bamboo, Avocado and Romatico were very good. Service is not. Having stayed at other recommended \" Leading Hotels of the World\" this is not one and should be removed from their book until a similar standard is achieved. However, a management team from the Cancun Paradisus are here presently and are making changes!", "helpfulness": 6, "user": "susandances", "date": "July 25, 2006", "id": 5509745}, {"rating": 3.0, "title": "Had a decent time, but not 5 star quality!!!", "text": "We met some great people and had fun with them. The weather was beautiful. The Spead Eagle catamaran day out was outstanding and the snorkelling better that we expected. Overall I would say a 4 star resort with potential . Cannot tell you how the place is from a view without the RS.Other people were complaining about the noise at the main pool, lines for food and standard of food being mediocre in the self service restaurants. Would visit again but like one other reviewer said there are too many other great resortss out there to visit to keep coming back and many more are better than here", "helpfulness": 6, "user": "scottnic", "date": "July 24, 2006", "id": 5503641}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We just returned from a long weekend at the Paradisus (July 21 - 24) and had a spectacular time! Do Not believe the negative reviews! The resort is absolutely beautiful, from the grounds to the rooms.", "title": "Two Families - One Great Experience", "helpfulness": 5, "user": "ChipL71", "date": "July 22, 2006", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5498458, "likes": {"liked": "— The resort is beautiful.", "disliked": "— The Front Desk was a bit slow."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "My husband and I paid for the Royal Service and I would highly recommend that you pay the extra for it. We did not wait long at all to check in (there was one person ahead of us). I will say that the line was extremely long for regular check-in and we met a family that waited 2 hours to check in. Therefore, do the Royal Service if you can. Upon arrival, our butler (Manuel) drove us to the Royal Service pool, reserved a Palapas (wonderful \"hut\" w/mattress and pillows) for us for our entire stay, got us drinks and booked us reservations for dinner for our stay. You definitely need to book dinner reservations when you arrive. We found that they tend to say that the non-buffet restaurants are booked, but if you insist or just \"show-up\" you most likely will get in. We ate at Romantico twice and really enjoyed it. The food was very good and the service was excellent. The other night we ate at Avacado which was quite good, too, though not as good as Romantico. We ate breakfast and lunch at Mirador and contrary to what others have written, my husband and I enjoyed our meals there. It is not gourmet food and a lot of it is their local cuisine, but the food is perfectly good. It is an open-air restuarant and views of the ocean are wonderful. Every morning we asked them if they would cut us a fresh mango and they never had a problem with it. We has excellent service there, too!", "title": "Some flaws .... but overall very nice", "helpfulness": 11, "user": "Beachlover888", "date": "July 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5470357}, {"rating": 5.0, "title": "Absolutely Fabulous!!", "text": "We just got back from this great place last night and we are all really missing it. My daughter woke up this morning and wanted to go back! We found this hotel purely by coincidence, we were originally scheduled to vaction in the Bahamas on a remote island, but Bahamas Air cancelled our connecting flight a week before we were to leave. My wife and I scrambled to find another destination and found the Paradisus. They had availability for the exact dates and we booked it. We lucked out and loved our trip.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 12, 2005", "id": 3268833}, {"rating": 4.0, "title": "Tip the help! A few pointers", "text": "Everyone who worked there, and I mean everyone, was extremely helpful and went out of there way to make sure everything was taken care of. As an example, I forgot my cell phone charger and asked the front desk clerk were the nearest Verizon store was and the front desk manager over heard this and offered up his Verizon charger. I borrowed it a few times and he always said no problem. This is just one example and I won't bore you with others, but everyone went out of there way.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 9, 2005", "id": 3262481}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "The food was very good for an all inclusive, but not like in a small gourmte restaurant. We were not expecting 5 star restaurants so we were very pleased, if you are expecting a 5 star restaurant go to one don't go to an all inclusive resort.", "title": "Loved the Paradisus", "helpfulness": 2, "user": "Nature1611", "date": "March 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3261125}, {"rating": 5.0, "title": "Great Place to stay", "text": "The pool, grounds, rooms and everthing else is very very nice. The only negative is the beach. It is small and the water is not so great, but pretty to look out to. My wife and I take a vacation every year to the carribean and have been to many great beaches and new this was not going to be a great beach based on the reviews here and thus were not disappointed. We have small children who love the pools so that is where we were going to be anyway. All I can say is if you are a beach person you might want to try another hotel.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 27, 2005", "id": 3234131}, {"rating": 5.0, "title": "Royal Services A+", "text": "Also, we noticed that the hotel never seems crowded even though they were at capacity.", "helpfulness": 28, "user": "kings54", "date": "February 26, 2005", "id": 3232179}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I am not sure what happened to the people who wrote such bad reviews of this resort. It really is wonderful. If you like a beautiful, tranquil and a relaxing vacation - this is the ideal place.", "title": "Fabulous!", "helpfulness": 3, "user": "vacagirl7", "date": "April 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7286726, "likes": {"liked": "— The landscape/pool area", "disliked": "— the beach - but it that was not a problem in the end"}}, {"rating": 4.0, "title": "Wonderful getaway!!!", "text": "Yes... Okay... you should make reservations for dinner. So do it early in the week. If you want to try all the restaurants - just reserve earlier. We went to all of them the week we stayed. It was such a fabulous place - we are planning to go back. The beach wasn't the type of beach you would plan to utilize - but the pool was incredible! It made up for the lack of beach - which you can always rent a jeep and travel to or take a tour to San Juan. Nothing was cheap as far as traveling outside the resort - but it is also located away from the city - but close to the tropical rain forest - which is a must!!!! If you are looking for something more - stay in San Juan.... I prefer the Paradisus though. We were blown away by the landscape and the sunsets. It was very romantic. I thought the staff was really nice. No problems. I think some people are just really picky and look for issues. We went there after reading reviews and were really nervous.... but after arriving - it was really a tropical, heavenly place. If you want to relax - this IS the place to go. We heard J-lo stayed in a private bungalow suite as well as Kevin Costner. Again - this a 40 minutes away from San Juan - where all the \"action\" is located. So if you want a restful, serene and wonderful resort - I suggest to go here. You really need to try it for yourself. I was really disheartened to read all the bad reviews. I don't think that \"conference/business trips\" reviews should count. The staff is usually overworked and those business groups are not there for the pleasure of it all!", "helpfulness": 3, "user": "miltonmom", "date": "April 3, 2007", "id": 7277624}, {"rating": 1.0, "stay_parameters": "Stayed March 2007", "text": "By the way - the food was great. Nothing to be worried about. Just make sure to book dinner reservations when there seems to be a large number of vacationers. Anyway - check out the photo's I took there!", "title": "It's almost humorous", "helpfulness": 4, "user": "WashingtonTravelers", "date": "April 2, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 7271473, "likes": {"liked": "— pool", "disliked": "— everything eles"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We just arrived back from a 3 night stay at Paradisus Puerto Rico. I was very skeptical after reading many of the reviews on Trip Advisor. I'm thrilled to report that our stay was wonderful!!", "title": "A wonderful, memorable honeymoon!!!", "user": "jenmorgan55", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7254794, "likes": {"liked": "— Everything", "disliked": "— No champagne in room upon arrival, but later received a complimentary bottle"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The only problem we found at the resort were some of the people staying there!!! There were several people who we ran into who were looking for problems! It seemed there was NOTHING anyone could do to make them happy! Unfortunately, these seem to be the same people who love to write reviews! One couple we met stated that their whole trip was \"horrible\"! And then they followed that comment up with \"Well, our standards are VERY high..we just returned from Club Med.\" I'm sorry, but Club Med is NOT the pinnacle that others should be compared! We have stayed at the Four Seasons, The Ritz Carlton, and several of the top hotels of the world. Although this resort is not in the same league as some of these, it is a wonderful resort.", "title": "Not what its cut out to be...", "helpfulness": 1, "user": "sts3mike", "date": "March 29, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 2.0}, "id": 7246418, "likes": {"liked": "— Puerto Rico", "disliked": "— The Resort"}}, {"rating": 5.0, "title": "Beautiful!! Loved It!!", "text": "First off, I must admit I was a bit skeptical about this resort from reading these reviews. We wanted to get away for a couple of days before we got married. We definitely made a great choice! Getting royal service was one of the best things we did. With this, you get exclusive check in, a separate area. Also from 6-9pm, they offer complimentary unlimited drinks (Hennessey and Coke, our choice). Tamehri in Royal Services was very friendly and helpful and the waiter in there was awesome!!! He never hesitated on bringing us drinks! Angel was one of our butler, when our TV wasn't working, he got right on it and made sure it was fixed before we got back. With Royal Service we also got free breakfast every morning and got to hang out in their private adults only pool...it was so peaceful, relaxing and never crowded. Also, they have golf carts driving you around wherever you need to get to on the resort. Someone was there in two minutes even though we were leaving at 4am. We showed up at the pool and the waiter reserved one those beds right by the pool (cost $0). From listening to these reviews, we did rent a car and that was one of the best things we did. Cabs out there are very expensive. We didn't eat at any of the restaurants there.....we went off the resort to eat authentic PR food everyday. Yes, it does cost $15 a day for parking and it does get crowded in the evening at the resort. Our room was amazing!!!! We even had a jacuzzi on the balcony with a view of the ocean. Our room was clean everyday we came back. They do have a natural beach.....but hey, it's still beautiful. I just wish they had more of a nightlife, perhaps a mini club, to cater to the younger crowd. It was still an amazing trip and as always, too short......we definitely learned not to base our opinion to everything other people write. Wherever you go, there are gonna be some positives and negatives, you just gotta plan ahead for these bumps! Overall, I would definitely go back with a group of friends and service was always with a smile! Thank you guys for making our pre-wedding trip an unforgettable one!", "helpfulness": 2, "user": "fotografikdesign", "date": "July 28, 2008", "id": 18362240}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Let me start by saying I'm a 30 year old guy and I'm not one of these people that have never traveled before and then come straight home to write a review about how wonderful there vacation was, because lets face it, first time in the Carribean, how could it be bad? I've been all over the world, and have stayed in many 5 star resorts. The Gran Melia is world class. The staff was amazingly helpful, the restaurants were some of the best I've ever been to in my life ANYWHERE!! The rooms were absolutely perfect. Even the beds were top notch with plush pillow top mattresses, down comforters and large down pillows. If you need to get out and roam, this is not the resort for you, as you are miles away from anything, however there is so much to do right there at the resort I can't imagine why you would need to go anywhere. If you want to rent a car, rent it at the airport, not the resort! They wanted over $300 for 4 days, and we ended up renting at Enterprise for about $125 insurance included ( after driving in Puerto Rico I highly recommend taking there insurance). Taxi fares are not cheap! To get from the resort to the airport was about 30 miles and cost $80 dollars each way, but remember, you're still basically in the United States. Wages are the same, and cost of living is very high here unlike most destinations in the Carribean, so don't expect to come here and rack up on some over priced brand name purses, because everything is priced basically the same as in the states. Through the resort you can contact a guy named Angel for some of the best scuba diving I have ever done in my life. All day tour for about $175 per person, lunch and beer included! Great value, great guy! Oh yeah, Donald Trump is building a couple hundred condos on the same property as the resort (Don't worry, you don't even know the construction is going on, this place encompasses over 2000 acres), and Trump also has two 18 hole golf courses (PGA tour 2008-2011) on the property. As I said I would recommend this resort to anyone wanting to relax, be totally pampered, and enjoy some of the benefits of the good life. By the way, I read somewhere that the place was overcrowded with locals paying only a small daily fee to get in. This is somewhat true, but undestand that these people are paying abut $50 dollars per person for only the use of the swimming pool and a few of the other pleasures of the resort. A family of 4 cost about $200, so your not dealing with a bunch of out of control kids running around with one adult trying to wrangle them, these people are paying very good money for the day use only of these things, and are not a problem at all. Oh yeah, the casino is very nice, and drinks thre are always free (Hold'em tournament every Saturday Night)", "title": "Absolutely Beautiful!!", "helpfulness": 1, "user": "Brianh898", "date": "July 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 18201922, "likes": {"liked": "— The rooms were more like a 6 star resort!", "disliked": "— Service at the swim-up bar was extremely slow, but hey I'm waiting for a drink in a pool bar, could be worse!"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The property itself is very lovely (especially at night when it has gorgeous candlelight) but be prepared to hike to your rooms. The beach is not very appealing but the pool is nice. Did not appreciate the cabanas-to-rent signs for only something like $100 a day but my daughter tells me this is commonplace.", "title": "Very bad service", "helpfulness": 3, "user": "boraboralover", "date": "July 23, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 18157897, "likes": {"liked": "— beautiful candlelit at night", "disliked": "— extremely bad service, overpriced restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The staff are all very friendly and I hate to write a negative review but I must.", "title": "Fabulous", "helpfulness": 3, "user": "aceit", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18067653, "likes": {"liked": "— The people were so accommodating", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "There was a dispute over our bill and they said it would be taken care of but I was not contacted by them just saw the bill on the charge card and have no clue as to how they arrived at that figure.", "title": "NIce Hotel, Very Poor Service", "helpfulness": 2, "user": "Jayant98", "date": "July 18, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 18010311, "likes": {"liked": "— Great ambiance, nice rooms, good location and decent food.", "disliked": "— Extremely poor service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The bad reviews could not be farther from the truth. My husband and I just left this hotel this morning and because we were so nervous about the negative reviews, we could not wait to come back and write a review.", "title": "We didn't want to leave!", "helpfulness": 10, "user": "DCAttorney", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6027604, "likes": {"liked": "— The pools were breathtaking!", "disliked": "— Rent a car because the local cabs are a bit expensive."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I am EXTREMELY picky and never stay in a hotel with less than 4 stars. Everything was perfect from start to finish.We also did the Royal Service Oceanfront service. The staff was FABULOUS. After arriving at the hotel, we were whisked off to the special room where Royal Service guests are checked in. We were offered champagne during this process (or any other drink that we desired). All restaurant reservations were made for us at that time. Then we were taken to our room. The room was very nice and the jacuzzi on the balcony was great. I could write for days about how nice our stay was but the fact that we just booked a December vacation at another Paradisus property in Cancun should tell all! Enjoy!!!", "title": "Awesome Resort", "helpfulness": 6, "user": "DT123SP123", "date": "October 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5969582, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Great Resort! This place was amazing! One of the best vacations I've ever had and I've traveled all over the world and have stayed at many nice resorts, plus I live in paradise in Florida so great review is something special! As for Restaurants you have to make all dinner reservations when you arrive. As for Breakfast & Lunch: Mirador is outside and very casual, El Caribeno is in inside and air conditioned both have great food, a little more upscale. For dinner...must try Romantico...super nice candlelite dinner. This is the only restaurant that requires a dress code, ie: kakais pants and a polo shirt are fine for guys...dress shirt and tie is not required. Very Romantic and a must for one of your nights. Bamboo is a great Japanese Restaurants with Teppanyaki (that's where they prepare the food right in front of you at a table, what a great show) or you can do the sushi buffett. In between Romantico and Bamboo is an awesome Martini Bar, go there before your reservation and have a cocktail. They make great martinis...I heard great things about Avocado which is a American Steakhouse that may guests raved about as well, though I didn't have enough days to check out. All the drinks were top shelf...and since you're in Puerto Rico you need to try some Rum Drinks, try the Rum Punch at the pool and Mojitos are delicious. Don Q and Barcardi are the Puerto Rican Rum Favorites. If you get the basic room you will be so pleased, we had a king bed and it was huge...all rooms are suites. This was my 3rd vist to Puerto Rico and I would go back in a heartbeat. I didn't do any Spa Services but heard they were execellent. This is a great place to visit on a honeymoon, anniversary, or just a get away and even with babies/kids. And if anyone is getting married there...wow you'll love it, they have beautiful area for a ceremony. Enjoy your stay.", "title": "Enjoyed very minute of Paradisus.", "helpfulness": 6, "user": "2ndavid", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5963418}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I went for a 4 day R&R with my husband at Paradisus. We really enjoyed our stay. The resort was beautiful and the staff were very friendly. The food was great! The room was clean and getting the royal service was an excellent idea. Felt like we were king and queen for that 4 days. Didn't have to wait in line for check-in and there were so many perks by having the royal service. Highly recommend the royal service. We check out the night before so we didn't have to worry about waiting in line for check out and missing our shuttle. The ocean was right there at the resort and it was very quiet and nice. I enjoyed walking on the beach and taking in the scenery. True, the water was not very blue but it was still very nice. Some day the food was better than another but the dessert always make it up. This website was so helpful in gaining information about the resort. I took all the tips from other reviewers ie. get the royal service, make dinner reservation right away, etc. So thank you to everyone that made a review for this resort.", "title": "PARADISE at PARADISUS", "helpfulness": 10, "user": "drdavid5", "date": "October 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5938073, "likes": {"liked": "— pool & top shelf drinks", "disliked": "— FOOD"}}, {"rating": 5.0, "title": "Frankie and Samara 's Anniversary", "text": "My history: this was my4th all inclusive ,all different regions/resorts,1 cruise.", "helpfulness": 3, "user": "trustus", "date": "October 7, 2006", "id": 5926114}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I almost didn't book this hotel based on the not-so-great reviews but I am super happy that I went with my gut and booked the Oceanfront Royal Service. The hotel is absolutely gorgeous and relaxing. My only disappointment is that we were only there for two days as we traveled all over the island on our trip. If you can swing the Royal Service, do it!! It's completely worth it.", "title": "Fabulous Time!", "user": "Citychick_0274", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17996100, "likes": {"liked": "— The location and size of the room", "disliked": "— the cost of ppv movie - $14! Yikes!!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "A lot of reviews have complained about how long the drive is to the resort and how far away it is from everything. Considering it only takes approximately 2.5 hours to get to the southwestern municipality of Guanica from Rio Grande, it's not that big of a deal. However, unless you are only staying in Old San Juan you definitely need a car to fully enjoy PR.", "title": "Loved the Gran Melia, we highly recommend it", "user": "shar0n_and_jeff", "date": "July 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17887817, "likes": {"liked": "— The rooms were beautiful, the atmosphere romantic and the service terrific.", "disliked": "— Nothing really, just maybe a better beach."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "After a long red-eye flight we stopped for lechon asado and batata off the freeway (OMG! Amazing) and a Medalla at a roadside bar a bit further up the road from our meal. We were on vacation after all and in no huge rush to get to the hotel. It is true that the resort is a bit of a drive from the airport and about 3 miles once you pull off the main road but the view is so stimulating you don't even notice it! The plants, golf course, flowers and birds are pretty and vibrant.", "title": "Loved the Grand Melia!", "helpfulness": 1, "user": "greenbeltdan", "date": "July 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17854721, "likes": {"liked": "— Beautiful hotel", "disliked": "— No hot tub"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "When we finally pulled up I took one look at the parking lot and it was decided we would spend the extra cash for valet. Totally worth it! The last thing I wanted to worry about on vacation was finding parking. Check-in at the RS lounge was quick and easy; it should be noted that when I called three days prior to arrival they did not have a reservation under the booking number I was provided by the website. Two phone calls later it was fixed. Save yourself the hassle and call ahead. We were greeted with cocktails and our fab butler, Manuel, picked us up and gave us a tour of the property all the while providing us with useful information about the resort and surrounding attractions.", "title": "5 Star quality the staff is Excellent !!!", "user": "berend2nd", "date": "July 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 17820338, "likes": {"liked": "— The staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Our room was right next to the RS pool and was big and beautifully appointed. I loved the huge shower! Manuel took care of everthing we needed, whenever needed, and my boyfriend loved how close it was to the beach. The outdoor whirlpool was so relaxing at night with the sound of the waves lapping the beach and the coqui chirping. *sigh* I miss it already!", "title": "Don't believe the reviews", "helpfulness": 2, "user": "jonesa67", "date": "July 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17809027, "likes": {"liked": "— Environment", "disliked": "— Overcrowded on weekend with locals"}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 373, "average": 404, "very good": 674, "terrible": 312, "excellent": 686}, "aka": "Gran Melia Golf Resort Puerto Rico Hotel Rio Grande", "slim_ranking": 0.75, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 3.5}, "description": "With an idyllic location on Puerto Rico's northeastern coast in Coco Beach, Río Grande, Gran Melia Puerto Rico brings the privacy and exclusivity you deserve and allows you the opportunity to escape from the rest of the world. From the moment you step inside this tropical oasis, you will be enveloped by the beauty and grandeur of Gran Melia Puerto Rico. Boasting a world-class YHI spa, the nearby Trump International Golf Club and the best pool on the island with four integrated whirlpools, Gran Melia Puerto Rico is the place to live the true resort experience in Puerto Rico."}