{"user_rating": 4.5, "review_count": 346, "name": "Grand Hyatt Jakarta", "reviews": [{"rating": 5.0, "title": "Really good hotel", "text": "Wonderful hotel in a less than fantastic city.", "user": "FrequentFlyer123", "date": "August 15, 2006", "id": 5612045}, {"rating": 5.0, "title": "One of the Best Hotels in Asia", "text": "We were upgraded to a suite on the Club floor - an enormous beautifully appointed room. This included access to the Club lounge with an excellent cocktail time each evening with very delicious food - enough for dinner!", "user": "Westonian", "date": "February 27, 2006", "id": 4523547}, {"rating": 5.0, "title": "Best hotel in Jakarta, on par with other best Asian hotels", "text": "We dined at C's which came highly recommended. Fantastic food (try the scallops sauteed with mushrooms and goose butter and/or the black pepper prawns!) and wonderful personalised service. Very pricey by world standards - let alone Indonesian prices.", "user": "JWYeung", "date": "December 3, 2005", "id": 4159897}, {"rating": 4.0, "title": "Number one in Jakarta", "text": "Would definitely be my first choice if I visited Jakarta again.", "user": "chalermchai", "date": "August 4, 2005", "id": 3736876}, {"rating": 5.0, "title": "Sumptious Luxury - I loved it!", "text": "I stayed at the Jakarta Grand Hyatt on Feb 14-17, 2006.", "user": "FromIreland", "date": "June 15, 2005", "id": 3557647}, {"rating": 5.0, "title": "Loved it", "text": "Great hotel - lovely rooms, superb gym, top restaurants, great location, rooms not hugely expensive if you're on a Western budget. Everything you expect from a Hyatt and more.", "user": "superstardj", "date": "April 17, 2007", "id": 7381311}, {"rating": 4.0, "title": "Nice hotel in good location", "text": "All in all, I'll defnitely stay at the Hyatt again when I return to Jakarta.", "user": "Yank-In-Sing", "date": "March 4, 2007", "id": 6908566}, {"rating": 4.0, "title": "not bad", "text": "I am currently staying at the Grand Hyatt in Jakarta, a city where there are multiple 5-star hotels from which to choose. I think the major advantage of the Grand Hyatt would be its location, right on top of the Plaza Indonesia. Certainly no bargain for shopping (especially for Indonesia), but the mall is good for a variety of restaurants, Hard Rock Cafe, movie theater, etc. A lot of other hotels in Jakarta are not adjacent to malls, and this is not a city in which you'd want to walk alone at night, especially as a Western woman.", "user": "alan9", "date": "December 12, 2006", "id": 6366112}, {"rating": 3.0, "title": "Still the standard in Jakarta", "text": "The good points of the hotel. The swimming pool is gorgeous and huge, the gym is the biggest hotel gym I've ever seen, and the room layouts are spacious. I love the walk-in wardrobe, and very comfortable beds.", "user": "beijau", "date": "December 2, 2006", "id": 6316899}, {"rating": 5.0, "title": "Excellent 5 star hotel", "text": "The bad points. First off, avoid the Club floor! Not worth the extra price. I've stayed at quite a few Club floors in SE Asia and this is by far the worst as far as food. The complimentary breakfast is appalling, more like a cheap continental breakfast at a Best Western than a Club floor perk at a 5-star property. Also from what I can tell, none of the rooms are non-smoking, and although they do a thorough job cleaning I can still faintly smell smoke in my bed linens.", "user": "Steve Winter", "date": "November 9, 2006", "id": 6088521}, {"rating": 4.0, "title": "Great hotel, with lovely facilities!", "text": "I've just returned from a two night stay at this hotel, for business and I really liked it!", "user": "RosieFlynn", "date": "March 6, 2008", "id": 14094690}, {"rating": 5.0, "title": "Nice", "text": "My room was a great size, with a fab bathroom (typical Hyatt style) big tub, seperate shower, good selection of toiletries. There was a nice walk in closet, good bed, desk and chair (lounge style).", "user": "kiwi400", "date": "February 29, 2008", "id": 13946306}, {"rating": 2.0, "title": "Disappointing", "text": "The pool area is amazing! big pool and very spacious with plenty of loungers and chairs. The gardens are beautiful and there's a 800m running track around the grounds.", "user": "pardesi_frangipani", "date": "January 30, 2008", "id": 13118588}, {"rating": 5.0, "title": "What big rooms you have....", "text": "The health club is just as any other Hyatt I've stayed in (Singapore & Auckland only) great! Plenty of machines, towels and water available everywhere, the changings room are spacious and the showers very powerful. There's also a steam and sauna with a great plung pool (both hot and cold) between the two, so you can have a quick dip before entering again!", "user": "wockinwod", "date": "January 24, 2008", "id": 12967013}, {"rating": 4.0, "title": "Recommended for the Jakarta Business Traveler", "text": "I didn't get much time to explore the surrounding area, I only managed the attached shopping centre, which is where I went for dinner and breakfast - there's lots and lots of options here (both Asian and western), so I wouldn't have breakfast in the hotel, although on my first night I order room service for dinner and it was pretty good, big portios, but nothing special.", "user": "Wheaton", "date": "September 22, 2007", "id": 8850794}, {"rating": 4.0, "title": "Best Choice for Jakarta", "text": "I've been flying to Jakarta a few times a year for the past 7 years, and have stayed at over a dozen hotels. This is probably one of the best choices in Jakarta because of its location (central Jakarta). One of Jakarta's best shopping centers is just downstairs! My other choice is the Dharmawangsa Hotel (an affiliate of Leading Hotels of the World) which is a most beautiful hotel in Jakarta, but the location is a bit off.", "user": "A TripAdvisor user", "date": "October 30, 2004", "id": 2796073}], "location": {}, "stars": 5, "variance": {"poor": 9, "average": 21, "very good": 124, "terrible": 5, "excellent": 187}, "aka": "Grand Hyatt Jakarta Hotel Jakarta", "slim_ranking": 0.0326086956522, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Regarded as one of the finest hotels in Indonesia, Grand Hyatt Jakarta is living up to its name. Strategically located in the Thamrin CBD and adjacent to Plaza Indonesia Shopping Centre and The Plaza Office Tower, the hotel provides excellent services and amenities to people from all around the world. Dine in the hotel's award-winning C's steak and Seafood Restaurant, pamper yourself in the Club Olympus Fitness & wellness Centre and swim in our 43-metre lagoon-shaped outdoor swimming pool."}