{"user_rating": 4.0, "review_count": 196, "name": "Grande Florida Beachside Resort", "reviews": [{"rating": 4.0, "title": "Great Family Resort", "text": "After the past few reviews on this property I was a little worried. I even called several times to request a refurbished airconditioned unit. I was politely told my request was noted but they could not guarantee that it would be granted. Luckily we did receive a newly refurbished and aircondiotioned unit and it was absolutely lovely, I was impressed. The furnishings were very modern and comfortable. The kitchen had everything I needed. We were on the first floor and had a lovely outlook onto thick tropical gardens and lovely palm trees aswell as the pool. The pool was great for the kids. We were there at peak time and it was never overly busy and you could always get a deck chair. Very close to beach with a security gate leading out to a path that led directly to the beach. Overall I had a great stay, it was comfortable and family friendly. However I would insist on a refurbished airconditioned unit as I did glance into other units that hadn't been re-done and they did look very tired and dated.", "user": "kazkap", "date": "January 23, 2008", "id": 12913236}, {"rating": 1.0, "title": "Incredibly bad !", "text": "After previous great experiences I recently stayed at the Grande Florida and was sorely disappointed. The rooms were very tired and are desperately in need of a refurbish. The staff are extremely discourteous and show little interest in ensuring a comfortable and enjoyable stay. The only redeeming factor was the pleasant pool surroundings.", "user": "Gubbsy1", "date": "November 14, 2007", "id": 10815892}, {"rating": 1.0, "title": "not happy", "text": "I'm not sure if it's because the resort has now joined the Accor group but the overall experience was deplorable.I would definitely NOT recommend this place - there are much better available at the Gold Coast.", "user": "tobyWandongVic", "date": "November 12, 2007", "id": 10783553}, {"rating": 1.0, "title": "Horrible", "text": "this was our 2nd stay at grande florida, and very disappointed this time. We asked for a ground floor flat, but got top floor. We had an elderly couple with us who one could not get up and down the stairs, but could not change rooms, as they were full. The flat was rather dirty, and 2 days was very noisy with workmen in next flat renovating. We would not stay there again. We were there when break in of laptop stolen and wittnessed staff not caring or helping guests who had been robbed.", "user": "Garvstar", "date": "November 6, 2007", "id": 10655159}, {"rating": 2.0, "title": "A little disappointed", "text": "BE WARNED", "user": "TigerNsw", "date": "October 15, 2007", "id": 10079820}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "As a family of two adults and two children an apartment is a great way to have a holiday. When I booked, the Gold Coast was booked pretty solid so I was rapt to find the Grande Florida had a vacancy!", "title": "Most popular pool ever!", "helpfulness": 2, "user": "Holiday_needed", "date": "October 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 10040944, "likes": {"liked": "— The quietness of the location, the great pool and bbq, and the internet cafe.", "disliked": "— The apartment we stayed in needed to be updated."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2004, traveled with family", "text": "We had such a good location right in front of the heated pool on the ground level with a lovely big balcony that we could relax on while the kids were in the pool.", "title": "coming back for more.....", "helpfulness": 1, "user": "jo1108", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8402018, "likes": {"liked": "— privacy, aircondioning,all the facilities.", "disliked": "— a lift rather than the stairs would have been nice."}}, {"rating": 4.0, "title": "Fantastic Family Resort", "text": "Our apartment had two bedrooms, a main bathroom and an ensuite and a large TV with combo video/dvd player in the living area.", "helpfulness": 11, "user": "Watson68", "date": "November 3, 2006", "id": 6051337}], "location": {}, "stars": 3.5, "variance": {"poor": 6, "average": 14, "very good": 64, "terrible": 12, "excellent": 100}, "aka": "All Seasons Grande Florida Hotel", "slim_ranking": 0.2, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "BRILLIANT location 30 mts walk to BEAUTIFUL BEACH, 1,2,3 bedroom apartments mains with en-suites, 2 magic award-winning pools, 1 of which is heated, wireless internet, some apartments recently renovated."}