{"user_rating": 4.0, "review_count": 95, "name": "Grand Hotel Poltu Quatu", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Booked my hotel throgh expedia so thought that it would be nice. They seemed to stick all the english in one area of the hotel!! The staff were rude even in the restaurant one night we were paying London prices a lot of Italian people came in and they served them before us!! I ended up walking out that was the only time they noticed us!! Told the manager am not used to this service in London and he tried to argue with me!! Also had a massage in the beauty place to have a man giggling and being stupid!! the hotel is bad stay away not a 5 star more of a three star!!", "title": "Very low class", "helpfulness": 3, "user": "leeabbey", "date": "January 5, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 6555759, "likes": {"liked": "— nothing", "disliked": "— EVERYTHING"}}, {"rating": 4.0, "title": "Fantastic", "text": "Fantasic hotel in perfect location. A luxury stay, lovely pool, incredibly friendly staff, ignore other reviews they say they aren't.", "helpfulness": 8, "user": "TravelLing75", "date": "September 27, 2006", "id": 5881714}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Great views of the Poltu Quatu Marina and the restaurants here are fabulous. Poltu Quatu really is a hidden gem and I'd say the best part of northern Sardinia. Our Deluxe room was as its title suggests.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "Samantha_D", "date": "September 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5821709, "likes": {"liked": "— Swimming Pool and fountain", "disliked": "— Rooms can be a bit noisy - can sometimes hear doors banging from other rooms"}}, {"rating": 5.0, "title": "Fantastic", "text": "Only downsides were the showers needed running for 10 mins before they reached normal temperatures, otherwise you had boiling hot water. We were offered another room to compensate however.", "helpfulness": 4, "user": "TravelLing75", "date": "August 20, 2006", "id": 5628452}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We were also promised a free weeks car hire and parking as part of our room rate. On arrival we were told this car was only a 2 seater and therefore as we were 3 (baby) we would need to pay the upgrade of 45 euros a day. It would have therefore been cheaper for us to hire a car at the airport and also have saved on the taxis to and from the airport (£40 each way). The management had also promised before our arrival that a baby seat would fit in the free hire car they were offering us but denied this on our arrival.", "title": "a nice hotel, terrible management", "helpfulness": 9, "user": "uvs", "date": "August 16, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 5617696, "likes": {"liked": "— nice views", "disliked": "— staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This hotel is very expensive as is the area, taxi to Porto Cervo 20 euro one way. Pizzeria in Porto Cervo forgot to serve us one part of our meal but refused to not charge us for it and insisted we pay the service charge for the meal - Manager useless. Staff in hotel good, however did feel that that within the area people were really just ripping us off, even without a smile! Do not rent a car at the hotel with JUST BUISNESS, huge deposit, poor service and overpriced car hire, pathetic! Why the hotel allow it for its guests is beyond me! Anyhow this area and hotel is for you if you have money to burn! PS. We are both very experienced travellers!!!!", "title": "Good but....", "helpfulness": 4, "user": "hamish75", "date": "August 13, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 5605346, "likes": {"liked": "— Room", "disliked": "— Very expensive bar / room service"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "Did not like the hotel..I tried to confirm my room with the hotel prior to my arrival and they did not respond to my email even after 3 emails! The room assigned, was located on the 1st floor facing the swimming pool bar and had an awful view. The a/c and room safe were not working. The room was also above the piano lounge which was noisy at night well past 1 AM. I requested to move and the hotel was full. Reception said that they would call the next day and did not and blamed me for not calling them to reminder them! Never again at this hotel! The staff are completely clueless about customer service.", "title": "Awful Service", "helpfulness": 4, "user": "desertguy", "date": "June 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 5349598}, {"rating": 5.0, "title": "We had a great time!", "text": "We spent a week in this hotel last September. It is a lovely and modern hotel with a huge swimming pool. Staff is friendly and there are many cafès and some shops on the Marina promenade that comes alive in the evening. You need to hire a car: Poltu Quatu village is nice but small and after a few days you wish to see what else is around. Baia Sardinia is about 3 KM and is a more affordable place for the Costa Smeralda standards. Porto Cervo is 5 minutes by car (in case you can afford Prada and Gucci or even a cafè in the “piazzetta”!) We booked a standard room but we were given a superior one facing the pool without charge, since it was low season. We had a great time and we are now planning to return!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 20, 2006", "id": 4365635}, {"rating": 3.0, "title": "Very expensive for what it is", "text": "We stayed at this hotel in June. It is advertised as 5 Star but the room prices you pay are not really five star. We paid about £95.00 per night so we were shocked when it was 3 euros just for a bottle of water. We didn't eat breakfast as this was about 25 euros each. We found a supermarket not far away like most people seemed to do. You never saw many people around the pool with drinks. We did eat at the main restaurant twice and the food and service and the setting were all excellent. The rooms are are clean but a bit like something you would get in an all inclusive hotel in the carribean. Poltu Quatu is a very small port with just a few restaurant (expensive) but the food is very good. Baia Sardinian is a bit more lively and more affordable. You definitely need to hire a car as everything is far away but we didn't as the price we were quoted was 90 euros a day so we got taxis instead. I did enjoy the 8 days we had there but the whole holiday cost us about £3000.00 for a week in Europe! I wouldn't mind if it was a real luxury five star but it wasn't. The rooms rates were ok but eating and drinkgin there costs the earth.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 27, 2005", "id": 4055441}, {"rating": 2.0, "title": "Melia Poltu Quatu Hote is an average 3* plus hotel", "text": "Stayed at this hotel in mid September just before end of season - overall staff were friendly and hotel was fair but not quite a 5 star - by today's standards would say a 3 star plus.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 1, 2005", "id": 3982214}, {"rating": 2.0, "title": "Overpriced and boring!", "text": "The hotel itself is nice. It's light, modern, and has a spacious reception area, but it has been badly designed. The pool is small and is stuck in the middle with the hotel walls looming all around it, which means sunbathing is limited. We went out of season (9th-19th September), yet because of the small pool area there was a fight for the sunloungers - when it wasn't raining that is, which it does a lot of in September. The bedrooms/bathrooms are nice but although they may once have been fit for 5 star, they've got lazy so they would now be 4 star.", "helpfulness": 14, "user": "subee", "date": "September 25, 2005", "id": 3938530}, {"rating": 5.0, "title": "Lovely hotel", "text": "Also, I know this is Costa Smerelda, but the prices are ridiculous, so ridiculous that no one could afford to go to the restaurant or bar in the evening and there is no other evening entertainment, so it is deadly quiet. Therefore, even if you can afford the prices, you'll be alone. For this reason you must hire a car, and eat elsewhere such as the much cheaper but more touristy Baia Sardinia (5 minute drive). Taxis are very expensive (20 Euros to Porto Cervo which is only a 5 minute drive away).", "helpfulness": 21, "user": "190671", "date": "July 20, 2005", "id": 3687509}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The other main problem, is that there is nothing to do here. There is no steam room which is what it says on Expedia. Also, the only fitness equipment is a treadmill in a disused hallway and is not plugged in. Other than a small outdoor pool (and I guess you could have an expensive massage) there is nothing to do, so when it rains, you are confined to your room, or forced to splash out on ridiculously priced drinks.", "title": "Fantastic Hotel", "helpfulness": 15, "user": "Michael123London", "date": "July 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3678819}, {"rating": 3.0, "title": "Make sure you get a view of the pool!", "text": "We used the internet and spent 10 Euros on a voucher which we were told would give us 50 minutes, yet when we logged on it said we had 39 minutes remaining. The reception staff then said it was just an estimate. We had also requested a marina or pool view, because of a previous review, and although our room faced the pool we could only see the roof of the restaurant. When we asked to be changed we were told tough luck, even though we went out of season and there were lots of rooms available. Basically, for the money you pay you don't get much and you get the distinct impression that they will try to screw as much out of you without giving much back.", "helpfulness": 41, "user": "A TripAdvisor user", "date": "June 25, 2005", "id": 3610045}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "stayed here mid-April so it wasn't too crowded. Pool looked fun but it was too cold for us. Right infront of the marina and several restaurants. STaff was extramely helpful with everything and anything you needed. Despite the construction for expansion, cold weather and hard to locate, it's a beautiful hotel wtih good food and good drinks! I'm sure if we traveled around aug or sept, we would have had more of a blast.", "title": "Great staff", "helpfulness": 2, "user": "marie6613", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 3.0}, "id": 11228774, "likes": {"liked": "— staff and food", "disliked": "— location and hard bed"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I have just returned from staying at this hotel and I thought that the overall experience was fantastic. I was aware from reading other reviews on Trip Advisor that the staff could be rude, but I found everyone very friendly and the concierge service was especially helpful. The rooms were kept very clean and the bathroom was huge.", "title": "Great location, great hotel.", "helpfulness": 2, "user": "Holiday_Gal78", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8520601, "likes": {"liked": "— The cleanliness of the rooms. The helpful staff.", "disliked": "— The plastic sun loungers."}}], "location": {"country": "Italy", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 4, "average": 11, "very good": 31, "terrible": 6, "excellent": 43}, "aka": "Grand Hotel Poltu Quatu Sardinia/Arzachena", "slim_ranking": 0.2}