{"user_rating": 4.5, "review_count": 411, "name": "Grand Hyatt Macau", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2011", "text": "From previous pleasant stays at the hyatt hotels around Asia we decided to stay at the grand hyatt in Macau also. it was me , my wife and 3 little kids. As we arrived the hotel their were so many people quing to check in. Lockly I have a platinum membership so we had to wait for only 15 min. The room was ok but we expected better from the hyatt.", "title": "A sham to the hyatt brand.", "helpfulness": 4, "user": "Namd", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 116752848}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The most disappointing part was the dinning options. They have only 2 resturants in the hotel , one Chinese and one international which have also kids menu. The international restaurant was closed on Monday so we had no other alternative for dining with the kids. We asked the front desk staff and they recomamded to order room service. What a joke ! Staying in 5 stars hotel and need to stay in the room for dinner???", "title": "Fabulous Stay", "helpfulness": 1, "user": "iroshaw", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116737387}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We asked for the front desk manager , his English was poor and he asked if can assist with booking to other restaurants in the city of dreams complex, we asked to known which restaurants offer international or western cuisine and he said we can have dinner in pacific coffee which similar concept of starbucks. What a joke. Coming to a hyatt to have dinner at the pacific coffee. lovely ! Finally we decided to walk to the four seasons and to check our their options. They had an amazing international buffet with an excellent and very friendly staff.", "title": "best stay in macau", "helpfulness": 1, "user": "gaupai", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 115662421}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "The buffet breakfast at the hyatt is disappointing , the quality of the food is bad,the way they display the food was discusting(look at the picture of the smoked salmon they serve at the buffet) and the service is a sham. Most of the staff at the hyatt don't speak English. Is this an international hotel ? Or a local Chinese hotel? And the hotel have a very heavy smell of cigarettes smoke.", "title": "Maybe You Need To Be a High Roller", "user": "YuYuanDonguuan", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 115385392}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "If you are traveling with kids don't stay their. Try the four seasons or the westin. If your a gambler and want to stay at the casino 20 hrs a day then it may be good place for you to stay.", "title": "Excellent and stylish hotel", "helpfulness": 3, "user": "kittyliketravel", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 114700110}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "best ever stay in macau we booked the suite.", "title": "way better than venitian", "helpfulness": 3, "user": "sidhj", "date": "June 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 113333980}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Much better than the ventitan rooms which are almost rundown now. and cost was cheaper to including the full package of breakfast and one way ferry transfer.", "title": "SUPERB EXPERIENCE", "helpfulness": 2, "user": "sunnygohel", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111407999}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "very accommodating chef who made special vegetarian food for us.", "title": "Excellent for Business and tourist purpose", "helpfulness": 2, "user": "jain90", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111233029}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "Last minute deal was worth every moment of 31st night, Grand celebration, Friendly staff, Excellent hotel which was expected from Hyatt Group. City of Drams is what it is known for and was actually a paradise. Excellent room service, Staff and food.", "title": "Favorite place to stay in Macau", "helpfulness": 4, "user": "EarnyinLA", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110451674}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Rooms were very neat and clean , very spacious. Great view of local airport.", "title": "Just great. Cool Stylish and awesome service", "helpfulness": 1, "user": "serviceobsessed", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106463707}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "After staying at Venetian the last time we were in Macau, we decided to stay in a hotel without a casino attached to it to avoid the pungent smells of the casino. We chose Grand Hyatt according to the great reviews from this website .", "title": "Pleasant Stay.", "helpfulness": 4, "user": "fleurbean", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114659210}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The rooms were bright, basic, and clean. We enjoyed the breakfast meal which was WAAAAY better that that at Venetian, so totally worth buying the room and breakfast deal, which we had found soooo disappointing when we bought the deal for Venetian.", "title": "Beware of Grand Hyatt and smoking policy", "helpfulness": 4, "user": "MemphisTravelers02", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 1.0}, "id": 114377002}, {"rating": 5.0, "title": "Great sleep, gorgeous rooms", "text": "The coach service was very convenient, and we were right above the House of Dancing Water show, so we didn't have to rush to catch the show.", "helpfulness": 2, "user": "shirlz_yee", "date": "June 15, 2011", "id": 113723463}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Check in and check out was relatively fast, and we enjoyed our stay here.", "title": "amazing hotel, top-notch", "helpfulness": 2, "user": "theotherloneranger", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113641386}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed one night at Grand Hyatt Macau May 24, 2011. Upon arrival the room was not available so we went to the Beijing Kitchen for lunch. Very Good, but QUITE expensive for Chinese food..but to be expected at Grand Hyatt. The room is laid out very differently with the tub/shower totally exposed to the bedroom. The shades were broken to hide the shower so a repairman was called and quickly repaired the problem. Dinner in the Mezza9 was a disaster!! We were aked if we wanted smoking or non-smoking and were seated in non-smoking as requested. Shortly after ordering dinner, they opened the doors to a private dining room where everyone was smoking cigars. The smoke was intolerable! They moved us two table toward the windows but that did not stop the smoke from ruining our dinner. I could not even finish my dinner. The manager was called over, but he did nothing to accommodate us nor did he close the doors to the private dining area. Even the wait staff was coughing when coming out of the private dining room. I wrote a comment card but never heard from them. I was asked to pay for my meal in full....I will never go to that restaurant again and I encourage non-smokers to find other dining options! The Hyatt is a nice hotel but I think I will try other options like the Hard Rock Hotel(same City of Dreams complex) or Venetian(just across the street). Macau is a great day trip from Hong Kong or an interesting gambling destination", "title": "Very pleasant stay", "helpfulness": 3, "user": "bedilizia", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 113533307}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Went to Macau for a quick weekend trip from Hong Kong. Bought a package deal that included breakfast and ferry tickets.", "title": "Did not disappoint", "user": "AKLVancouver_Canada_", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117847661}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I stayed at the Venetian before. Loved the room and amenities, but found it too big and too crowded. Grand Hyatt is an excellent alternative if you want peace and tranquility.", "title": "Amazing, beautiful, luxurious and opulent!!! I love Grand Hyatt Macau!", "helpfulness": 1, "user": "mari0nette", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117839966}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The service standard from staff is impeccable, from the moment I stepped in the lobby for check-in to when I was given back my baggage stored at the bell service after check-out, everyone (except a Korean speaking staff that could use some smile, maybe he had a bad day) was eager to help and please.", "title": "Excellent stay!!", "user": "Kelwoo", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117658528}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Another slight complaint was the package deal breakfast. I didn't expect that they set up a function room for the breakfast buffet. As such, the ambience and variety are lacking comparing to normal restaurant buffet. I would not recommend this if you have a choice to not pay/include this.", "title": "A nice lux hotel in Macau", "user": "Tigersan", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117548895}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I used the pool and the gym while there. Since it's not a huge hotel, there were not that many guests using the facility. Perfect! The change room has a smallish hot tub and sauna. Ideal to relax and let the stress fade away.", "title": "Sanity in the midst of madness", "user": "pemblin", "date": "August 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 5.0}, "id": 117378574}], "location": {"country": "China", "continent": "Asia"}, "stars": 5, "variance": {"poor": 8, "average": 39, "very good": 122, "terrible": 4, "excellent": 238}, "aka": "Grand Hyatt Macau Hotel", "slim_ranking": 0.0975609756098, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Grand Hyatt Macau hotel is located in the Cotai area between the islands of Coloane and Taipa, off the tip of Macau Peninsula, China. Our Cotai hotel is part of the City of Dreams urban resort integrating entertainment, dining and shopping options. The hotel features 791 rooms & suites with spectacular views over Cotai and the west banks of Pearl River.With well-equipped MICE facilities and signature restaurants, Grand Hyatt Macau hotel promises to provide magnificent services to every guest visiting the cosmopolitan cultural city of Macau.Our hotel in Cotai is easily accessible from Macau and Taipa ferry terminals, China Border Gate and Macau International Airport."}