{"user_rating": 4.5, "review_count": 604, "name": "Grand Hyatt DFW", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "I stayed here for a 3-day meeting and considering I did not go outside for over three days, I enjoyed my stay. Clean rooms, good restaurant, convenient to the airport and fully remodeled rooms.", "title": "Convenient, good service, fancy lightswitches", "user": "sfrunner", "date": "February 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124743681}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "My only complaints: low shower pressure, slippery shower floor (theres a rubber mat hidden under the sink) and creepy automatic window shades that effectively block light but seem to have a mind of their own.", "title": "Only place to stay in DFW", "helpfulness": 1, "user": "brizzeyAustralia", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124480512}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "That said, the gym was very nice and I didn't have to wait for a machine. The room comes with a yoga mat but not sure why it's locked with a zip tie. Indication for cleaning staff or do I have to buy it?", "title": "Great Hotel", "user": "steve480977", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124456365}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed here for 2 nights before my flight back to Australia and it couldnt be better.", "title": "Great hotel, convenient location, clean and quiet", "user": "BillF", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 124352968}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I am currently still at the hotel and amd enjoying the stay immensely.", "title": "Great Location and Great Service", "user": "ItsAboutTheTravel", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124312278}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This hotel is for those who are travelling in and out of DFW, I could not imagine staying here otherwise. I would not consider this a luxury hotel; it is a lovely respite from the burdens of travel. The hotel and rooms are attractive, modern, clean and quiet. The bed and linens are comfortable, towels fairly thick. The shower head is oddly pointed at the door, so please do not make the mistake of turning on the water without either moving the shower head or getting in first. Also, the size of the shower makes shaving an acrobatic act. The pictures on the website and tripadvisor are accurate and speak fairly for themselves. The staff can be cool. Floor 4 is 1/2 smoking and 1/2 non-smoking, therefore, I recommend non-smokers avoid. Also, watch the rates on the Hyatt website; the rates can fluctuate quite a bit and if you secure a lower rate be sure to request an email confirmation as the hotel does not appear to get the revised rate. Upon each visit I had to show my blackberry to convince the hotel staff that I did indeed negotiate a lower rate. More work for the travel weary. Again, a lovely hotel if you find yourself at DFW.", "title": "Convenient for Travelers", "helpfulness": 3, "user": "ANGshire", "date": "April 2, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7271536, "likes": {"liked": "— Convenient to DFW", "disliked": "— 1/2 Smoking 1/2 Non Smoking Floor; Room Rate Confusion"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "It is a delight to find a hotel where the level of service is as high as at Grand Hyatt DFW. Prompt, professional, personal are three “P” that describes it well. The room was tastefully decorated, the bathrooms is large and superb. Choose the rooms on the side that have an airport view -its magnificent.", "title": "Absolutely top notch", "helpfulness": 6, "user": "karin stockholm", "date": "February 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6822155, "likes": {"liked": "— the personal service and comfortable beds", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "The restaurant serves excellent food. Will definitely stay there again when I come to back to Dallas.", "title": "Great Airport Hotel", "helpfulness": 3, "user": "LAKTEX", "date": "January 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6716174, "likes": {"liked": "— Work station & separate shower", "disliked": "— everything was OK"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Like many others, we stayed just one night (after a flight from the UK with British Airways). After an awful arrival experience in Terminal D - despite being almost first off the aircraft we had to wait just under two hours to clear immigration and customs - huge volumes of people queuing infront of us - it was poorly staffed compared to other US airports. However, I guess this hot and uncomfortable experience made us appreciate the hotel even more!", "title": "Very conveneint for Terminal D arrivals and departures", "helpfulness": 2, "user": "dogsareforlife", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126437635}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Firstly its easy to find. Tip: one level up from Term D arrivals - there is a small elevator to the right of the coffee shop in the arrivals area which takes you to exactly the right place. The front reception staff were very welcoming and check in was efficient and quick. The Grand is cleary a luxury hotel and like most they know how to charge for everything. At check in we were offered a deal of wi-fi access and breakfast for an extra $19 per night per person. This was on top of the rate for the room ($260 per night plus several taxes) I decided to take the offer and was glad I did - the breakfast next morning was exceptional (recommend the eggs benedict and the breakfast parfait) and the internet access was quick - given how much these facilities cost on their own, it did represent good value. Then again, at $260 for one night they should perhaps be included...", "title": "Updated rooms. Convenient airport location.", "user": "RobfromPA", "date": "March 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 126410062}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "The room on the 7th floor was stunning - large, elegant and with loads of technolgy - it was like staying in an iPad!. The blinds opened automatically when you entered and they revealed a super view of the runway. Given that I don't mind looking at aircraft taking off this was great fun.", "title": "Day rate", "helpfulness": 3, "user": "Rhonda B", "date": "March 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126202367}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I particulalry loved the bathroom. It was large, with a huge corner shower with good water pressure - essential for someone like me with long hair to wash - and the standard Hyatt White Ginger bathroom amenities which I'm not overly keen on due to the strong scent - if you have sensitive skin you should consider bringing your own stuff.", "title": "Nothing to complain about", "user": "Moonstonemoclips", "date": "March 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126132432}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "There was a mini bar - usual prices for these hotels - approx $8 for a Heinken and $4 for Canada Dry ginger - full size cans. There was a bar and sushi restaurant downstairs near reception but by this time we had been travelling for a long time and just wanted a hot shower before sleeping so we did not try these. The bed was comfortable and we both got a great night's rest.", "title": "Comfortable stay in DFW", "user": "Mo2men", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125981011}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The Grand Hyatt at DFW has been recenlty renovated. The room was modern, very clean and very chic! They not only offerred a great night's sleep, but the staff was very professional, helpful, and friendly as well. We also had dinner in the restaurant and both of our meals were excellent with excellent, friendly service - best pork chop I've ever had! It was very easy to catch our flight in the morning too. The Bellman took our luggage and us right to the American Airlines desk. It couldn't have been easier! When overnight in Dallas with an early morning flight, this is the place to be. I've also flown in before, had a meeting there, and flown right out.", "title": "Classy stopover", "helpfulness": 2, "user": "mikee47", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125095029}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed one night at the Grand Hyatt DFW to attend a meeting. It was convenient to reach in Terminal D via Skylink even after landing in Terminal A. Check-in was quick with efficient staff and lunch was enjoyable in the Grand Met restaurant. The meeting space was inviting with lovely art and pictures all along the foyer. Surprisingly, the buffet dinner with our meeting was some of the best food I have had in awhile--definitely not the usual hotel rubber chicken! The rooms had a number of amenities, were clean, very quiet, and had comfortable beds. I would definitely stay at this hotel again. One of the best hotel experiences I have had in a while.", "title": "Excellent experience at the Grand Hyatt DFW", "user": "mom2amywill", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124835623}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We used the check-in kiosk upon arrival which was very easy to use and nice to have when their are long lines at the check-in counter. It dispenses your room keys without ever having to speak to an agent. We also used it upon checkout and it was still easy to use and there is a drop box to drop your room keys into.", "title": "Convenient for when you have an early morning flight", "user": "bkesler84", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124828698}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The rooms at the Grand Hyatt DFW have been remodeled and the new electronic features (electronic shades & lights) are a nice touch. You can open/close the shades & turn on/off lights directly from a control panel on your night stand. It didn't appear that the bathrooms had been remodeled, however they are very spacious and it is nice to have a separate tub & shower.", "title": "SUPERIOR AIRPORT HOTEL", "helpfulness": 1, "user": "marenostrum", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124801559}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A nice perk of staying at the Grand Hyatt DFW is you can access the secure side of the DFW terminals directly from Terminal D. You have to let the front counter staff know that you want to take advantage of this and they will contact a DPS official to check your IDs. As long as everything checks out, they give you an entry pass to be able to get through the security checkpoint. You are required to go through an enhanced screening process, but it really was no big deal. Then you are able to take advantage of the restaurants within any terminal (since you can ride the SkyLink) or browse through the shops. Make sure you get there early though, because they can only issue the entry passes through 8pm, but you can stay in the terminal until it closes.", "title": "Amazing Hotel in Dallas", "user": "tomlucky85", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124791382}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "Really convenient, especially to Terminal D at DFW. Huge step up from the Hyatt at Term A&C. Room has had some visible traffic but you expect that at an airport hotel. Loved watching the planes land on the west side of the airport. The A/C in my room had a mind of its own.", "title": "In the heart of DFW Airport", "user": "TEXKEYSTONE", "date": "March 6, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 125726065}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Got stranded in DFW for the night, but was so happy with the hotel that I didn't mind a single bit! Love that the hotel is attached to the terminal building, so there is no need to go outside once you're in the airport. One of the first things that struck me about the room was how nice it smelled: like freshly laundered clothes. It was so comforting! The room itself was lovely. The furnishings were new, tasteful and modern, and the bathroom was enormous. It had a huge tub and a separate shower. The room was a pretty big with a large TV and a window that covered the entire wall. We had been told that the view from this room wasn't good, but I disagree. It's quite hard to describe, but it was kind of like looking out on the Millennium dome in London, but actually FROM the dome. We were obviously looking out at the roof of the building below, but it seemed quite futuristic. Certainly not something I would want to look on everyday, but it was really quite interesting for an overnight, and the window comes with an automatic shade that blocks the whole thing out. Anyway, who cares about the view at an airport, right? The rate included breakfast which I highly recommend getting because they allow you to use this credit for room service and it was a lot of food. I had the mushroom and onion omelet and my husband had the egg white, both came with toast, and both were excellent. We also got a pot of coffee each (listed as 'small' on the menu, but I must have had 3 cups and didn't even finish it) and two large glasses of juice. I also really appreciated the thoughtful inclusion of a yoga mat in the closet which I would loved to have used if I had not been so pressed for time. Actually, I'd have liked to have stayed an extra night as this hotel was such a welcome change from any other airport hotel. In fact, I think it's safe to say that this hotel is better than most at which I've ever stayed.", "title": "Easily earns its #1 rating!", "user": "Nannarpite", "date": "March 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125624105}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I'm a corporate event planner for a small company and we recently held our annual national sales meeting at this hotel. It's a very convenient location as you can fly into DFW and never have to leave airport property to get to the hotel. Every single member of the Grand Hyatt staff went out of their way to be helpful and ensured our two-day meeting went off without a hitch. The sleeping rooms were fantastic and they provided very nice welcome amenities for our VIPs. The meeting space was perfect and the food (both catered and restaurant) was very good, although expensive. This hotel was just renovated and they have done a fantastic job with it - all areas of the hotel are very beautiful and much nicer than one would expect at an airport hotel. I have planned events at many top hotels around the country and this is one of the best in terms of customer service. The only negative I had in my experience was a slight snafu in booking our group of 40 people into the restaurant but that was resolved and we had a lovely dinner. I would recommend this hotel to anyone conducting a business meeting or needing a nice place to lay over while in Dallas.", "title": "Great venue for a corporate meeting!", "helpfulness": 1, "user": "JulieSandpoint_Idaho", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125460110}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "A 3-day business meeting at the DFW Grand Hyatt has been an annual event for several years. This year the \"ho hum\" hallways and rooms had been redone in a tasteful modern decor. My complements to the decorator. Unless you like to watch airplanes land and take off or to view parking structures and airport roof tops during the day, the best views are at night from the pool deck or upper floors.", "title": "Fantastic remodel", "user": "JBPortland", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125457318}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Its new, clean and comfy. Located in the American Airline International Terminal. There are 3 restaurants to choose from in the Hotel, offering 3 dinning levels, Lounge Grill, Sushi Bar, and Fine Dining. There is also a Spa. Our room was very well appointed, no complaints. Excellent Staff. All that was missing was Free Internet.", "title": "Airport Hotel", "user": "is0lde", "date": "February 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125310326}], "location": {"country": "United States", "city": "Dallas"}, "stars": 4, "variance": {"poor": 11, "average": 23, "very good": 133, "terrible": 5, "excellent": 432}, "aka": "Grand Hyatt Dfw Hotel", "slim_ranking": 0.0213903743316, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Luxury, convenience and unsurpassed service are the standard at the Grand Hyatt DFW. The hotel is integrated into DFW International Terminal D and accessible from all DFW terminals via the SkyLink or Terminal Link systems. This luxurious hotel offers 298 elegantly appointed guest rooms, 34,000 sq. ft of meeting space, and a globally inspired dining experience."}