{"user_rating": 4.0, "review_count": 1511, "name": "Grand Palladium Punta Cana Resort & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Ok, I booked this holiday for myself, partner and our 4 year olf daughter. We thought it was going to be luxurious after looking at the pictures on the first choice website. This review is totally honest and i will go through the main pionts individually.", "title": "The complete truth from a british point of view!", "helpfulness": 3, "user": "lryan6279", "date": "July 7, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 17625153, "likes": {"liked": "— jacuzzi bath", "disliked": "— leaking shower and damp smell in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "ok, reception staff - alot of people have complained about the reception staff as being rude but i only found one of them to be rude, his name was \"jesus\" funny enough. On arrival we were taken to our room in the 2000 block which was really nice. However, my daughter was provided with a couch pull out bed which would have been ok but the metal spings on the side of the bed were bent and so they stuck out quite danerously as they were really sharp. My little girl banged her elbow straight away and so we asked them to replace the couch bed with a normal bed which never happened. \"Jesus\" was extremely rude to me and I was not impressed by his attitude. my partner complained to the manager who dealt with the problem by offering us other rooms that were smaller so in the end we stuck with the room we had. We never got a replacement bed so I simply stuck towels around the shap parts of the pull out to make it safer for my daughter.", "title": "Wonderful Vacation", "helpfulness": 1, "user": "Lili_m", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17591893}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Rooms- really nice but the shower leaks terribly as the bath is too far away form the shower and so it leaks everywhere all over the floor leading into the bedroom. Apart from this the room was really nice, extremely modern and clean. We stayed in block 2000 which was close to everything.", "title": "Great Experience!", "helpfulness": 2, "user": "Mariat_8", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17590775, "likes": {"liked": "— The whole package was absolutely amazing!", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "The grounds - very impressive and well maintained. The overall grounds are lovely and it was nice walking in the evening to and from various buffets and theatres.", "title": "Big and Beautiful", "helpfulness": 2, "user": "Beachbaby771", "date": "June 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17364571, "likes": {"liked": "— The beaches are awesome", "disliked": "— The air conditioning is not cold enough"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "Food - ok, this is my main compalint. Bavaro buffet was the best and couldn't complain about a thing. For evening meal - go to this buffet as its simply the best with lots of choices available! Now the bad bits - Punta cana beach grill is awful, hardly any choice and on numerous occasions the chef on the grill would pick up raw meat and then pick up the cooked meat and put it on your plate. We compalined about this and was told he would be told how dangerous this was. however, this continued and so we didn't eat any fresh meat throughout our stay. i suffered a dodgy tummy the first week and suspect it was down to eating form the grill before I noticed what the chef was doing. I noticed the same thing in the bavaro grill as well.", "title": "Grand Palladium Punta Cana Resort vacation", "helpfulness": 5, "user": "fitnessgal", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17341899, "likes": {"liked": "— Everything", "disliked": "— Not enough time (stayed 7 nights)"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "my husband and i were there june 29 till july 6. we had a great time.", "title": "whay a GREAT place to vacation", "helpfulness": 3, "user": "misses1223", "date": "July 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18017102, "likes": {"liked": "— rides to and from, hot tub, out door shower", "disliked": "— n/a"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008", "text": "dont let people fool you about these negitive reveiws because all of the this i was conserned about from reading reveiws we never came across.", "title": "Not impressed one bit!", "helpfulness": 3, "user": "AlwaysGoneInSummer", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 17983711, "likes": {"liked": "— The sun and the variety of restaurants", "disliked": "— The so few spoke/understood English"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The grounds a beautiful. we were in thr honeymoon suite right on the beach. that was cool, we alwaysate at a new place every night. the buffet not up my alley but we had lunch there everyday and it was right by our room. we always were able to find a chair at the beach and at the pool no problems. there is always something going on somewhere. we mostly did the cosino at night though, we did not care much for the shows.", "title": "Not a 4 Star", "helpfulness": 4, "user": "cmcbass", "date": "July 17, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 2.0, "location": 2.0, "value": 1.0, "rooms": 1.0}, "id": 17986548, "likes": {"liked": "— Nothing", "disliked": "— Old bedding gave me th creeps!"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "not to worry about the language barrior cuz there no proplem at this resort everyone seems to know some english or you can point they will get you. just say hola! to everyone with a sime they will love you.", "title": "The beach was the best part !", "helpfulness": 1, "user": "wissa", "date": "July 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 17920078}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Whith a small tip like a buck or two goes a long way and they really seem to appreciate it.", "title": "Peace and Tranquility", "helpfulness": 2, "user": "kml2001", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17661362, "likes": {"liked": "— The friendly staff and great view"}}, {"rating": 3.0, "title": "Awesome vacation, but not a 5-star resort ...", "text": "My friend and I stayed at this hotel from July 12-19, 2008. We had a wonderful week of fun in the sun and made some new friends along the way! This was my third trip to Punta Cana (stayed at two different resorts before) and my friend's first time in the country.", "user": "terre-neuvienne", "date": "July 24, 2008", "id": 18217937}, {"rating": 5.0, "title": "Favorite Place in the World", "text": "Check-in: Other reviews I have read are right on the money ... this was a painful process. Our travel agent had requested a room that wasn't on the ground floor and one that was close to the beach. In fact, we were given a ground-floor room that was in the middle of the resort near the reception. When we got to the room, we were disappointed to say the least, even more so when we found out the key they had given us did not work. Back to the reception where, when we requested a room change, we were met with a scowl and told the hotel was full to capacity (this was untrue). However, if we were willing to pay an extra 15$ a night, we could stay in a Jr. suite. Needless to say we did not do this, and settled for the room they had given us. That being said, the AC worked perfectly in our room and we were quite pleased with it.", "user": "HonestlyHonestly", "date": "July 23, 2008", "id": 18183660}, {"rating": 4.0, "title": "Hot, Humid Wonderful Paradise", "text": "Restaurants: There's always something for everyone at the buffets. Might I suggest the Cathedral, which is the largest on the resort. The Mexican theme night was excellent - lots of stuff to try! Other than that, the usual buffet fare with nothing exceptional standing out in my mind. One thing we did notice, however, is that there was very little AC in the restaurants or buffets - so sometimes mealtimes were uncomfortably warm. Staff are usually friendly but can be indifferent in the buffets and restaurants. Unfortunately, we didn't meet anyone who showed us exemplary service during the week. This was not the case in the other resorts I have stayed at in the past, so we were a little disappointed.", "user": "dcake", "date": "July 23, 2008", "id": 18174424}, {"rating": 4.0, "title": "A Great Resort and Stay .... just a few details need attention", "text": "A la cartes: You don't need to fight for your a la carte's on this resort. You chose when you want to go and ... go! If there's a line-up, they give you a beeper that lights and flashes when it's your turn. It's a good system! As such, we didn't have much luck with the a la carte restaurants. We tried the Italian one night and the Seafood/steak another. The problem was with a persistent waiter who kept harassing my friend. At the first a la carte, we were so uncomfortable that we didn't get to finish our meal and had to leave before dessert. When we went to the second a la carte two nights later, the waiter who had given us grief from the first restaurant was there and came back again. Unfortunately, we did not get his name (no name tag) because we would have reported his unprofessionalism to management. After that, my friend (currently not married) wore her university ring upsidedown on her left hand, and that helped a great deal.", "user": "Latinathang", "date": "July 22, 2008", "id": 18155442}, {"rating": 2.0, "title": "5 Star - No Way!", "text": "Grounds: Immaculately kept and the gardeners greatly appreciated the hats and sunglasses we had taken with us to give out.", "user": "NomadGolfer", "date": "July 22, 2008", "id": 18136239}, {"rating": 5.0, "title": "Fantastic Holiday", "text": "We stayed in the palladium punta cana from 3-18 July and we had a fantastic time.", "user": "pinkangel36", "date": "July 22, 2008", "id": 18129342}, {"rating": 3.0, "title": "Nice resort, great beach..but........a few things that did not make this 5 star", "text": "I have read a lot of reviews on this complex and i was worried but please ignore the people who have had a good moan, they must have been unlucky as we had no complaits.", "user": "donatodanny", "date": "July 20, 2008", "id": 18078197}, {"rating": 2.0, "title": "Fun in the Sun but here's a few tips...", "text": "We stayed in room 4212 and had no problems with any of the room half way through the holiday my partner broke the toilet seat we didnt even report it and the next day once the cleaner had been it was fixed. and we wasnt charged for it. The cleaners start work at 8-5 so somtime in the morning it can be a little loud but we was up most days before 8.", "user": "ChicaChicaToronto", "date": "July 20, 2008", "id": 18071422}, {"rating": 4.0, "title": "Great vacation for the price", "text": "You can use all the other hotels resturants on the complex the best buffet for the evening we found was the bavaro it had a little more option, but the other buffets were fine. We tried all the a La Cartes except the Dominican,Italian a la Carte are amazing, the others were all very good we couldnt complain.", "user": "happykath8", "date": "July 20, 2008", "id": 18061405}, {"rating": 5.0, "title": "Dream Holiday Became Reality Amazing", "text": "The Staff are all very friendly there english isnt the best i must admit but your in there country so maybe try and learn a few phases if not dont worry as we didnt and we was fine.", "user": "Colzy78", "date": "July 19, 2008", "id": 18032195}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 116, "average": 187, "very good": 464, "terrible": 55, "excellent": 689}, "aka": "Grand Palladium Punta Cana Resort And Spa", "slim_ranking": 0.49504950495, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Grand Palladium Punta Cana Resort & Spa enjoys a privileged, sea-front location on the renowned Playa Bavaro. The resort, located on a sprawling estate of lush tropical vegetation and a coconut plantation, is next to the Grand Palladium Bavaro Resort & Spa, the Grand Palladium Palace Resort Spa & Casino & Royal Suites. The facilities of these adjoining resorts are open to guests of the Grand Palladium Punta Cana (excluding the Royal Suites)."}