{"user_rating": 3.5, "review_count": 174, "name": "Grand Hotel Tettuccio", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "Security in this hotel is dangerously inadequate.", "title": "Security Risk - keep well clear", "helpfulness": 6, "user": "kento", "date": "May 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 5028250}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The hotel was conveniently located near the spas. The room was adequate, but in need of updating. Our stay was comfortable, but certainly not what one expects with a 4-star rating.", "title": "Ok, but not 4-star", "user": "veggie_spice", "date": "September 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 19975625}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This hotel was aboslutely as nice as it looked on the internet. Glamour, nice staff and very good location. From here You can walk to the trainstation( s), to the \"funicolare\", take a walkk in the beautiful park or just go for shopping or a nice meal.", "title": "Nice hotel", "helpfulness": 2, "user": "Nille68", "date": "August 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8444026, "likes": {"liked": "— The interiour and location", "disliked": "— Prices in the bar"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Unlike some of the previous reviewers we had a really good experience at this hotel. We booked late and got excellent rates for a one night stay. The staff were extremely helpful and let us check in early. We were given a lovely room at the front with air conditioning that worked efficiently! The buffet breakfast was plentiful and was served in delightful surroundings. The hotel is close to the main spas and to the funicular to Montecatini Alto. It also has its own car park which is very useful in Montecatini as street parking is 1 euro per hour.", "title": "Good base for a spa break", "helpfulness": 1, "user": "Jet2traveller", "date": "August 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8399897, "likes": {"liked": "— Magnificent public rooms on ground floor."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "This was an overnight stop on a tour, so there wasn't much time to sample everything that the hotel had to offer. Rooms did appear to vary from quite impressive rooms on the 1st floor to what could only be described as 'the servants' quarters' on the third floor. Even the glamourous artworks on the walls ceased after the Ist floor landing.", "title": "Grand on the Lower Floors, Maybe", "user": "GMMelbourne", "date": "July 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8125762, "likes": {"liked": "— Location", "disliked": "— The shoe box room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Nevertheless, the public rooms are impressive, particularly the dining room and there's a pleasant sitting area at the front of the hotel. It's a great spot for a drink.", "title": "Great town!", "user": "travelguru5", "date": "July 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8096578}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Just returned from a 7 night stay in Tuscany, making our homebase the Grand Hotel Tettuccio. From this small town we used the trains to see Florence, Lucca, Pisa, Cinque Terra, and other small Tuscan Villages along the train line. The hotel looks just like the website, however they must have used a wide angle lense! That's okay, rooms in Italy are small. Room was clean, house keeping very excellent. Front desk staff, professional but not friendly. Morning breakfast was awful and after 3 days we stopped going down. Not much food to choose from and what was there was poor quailty and cheap. What was odd about this hotel is there is nothing in the room! No clock /radio and when I asked for one I was told \"no\". (we forgot ours!) No directions on how to use the phone, no book on the hotels offerings, no phone book, no directions on the TV....nothing. Very odd. I would have thought they would have had a book with everything about the place in the room, but they don't. Room was very clean, and view out to the main street was nice. I know we were there off season, and I have a feeling all the guests staying were on the same floor, which was the 3rd floor. Location perfect and this is a great little town if you don't have a car and just are going to use the train system, which is a perfect way to fit in and live like a local.", "title": "Some great things & some real bad things!!", "helpfulness": 1, "user": "Lawin4cr", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 50206161}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The mini refridgerator never real cooled the drinks down and they do have some items in there, but don't buy anything from there. 3 euro per soda!! We stocked up at a store about 1/2 mile away on the main street called Conards. Soda was .44 euro and water was .33 euro, so we had a stash in the room.", "title": "Great location and value for money", "user": "monster_munch", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 45194774}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Excellent restaurants in this town, put on some nice shoes and go out and explore!! Best meals we had (4 dinners) was directly across the street at Cucina. Open until 0200 hours and the best pasta I have ever had. Staff there not friendly, but so very professional. Other excellent \"Must eat at's\" are Enoteca Giovanni, & Monte Crisco. All wonderful.", "title": "A dissappointment", "user": "PCTravelerUtah", "date": "September 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "service": 3.0}, "id": 42859412}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Monticatini has a great tourism information office on the same block as this hotel, use it!! Staff very nice and helpful with trains and recommendations. Also, they have cheap internet ports if you don't travel with a computer.", "title": "Very Poor for 4-Star", "user": "Alanshepherd", "date": "July 5, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 33959828}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Two beautiful movie houses down the next block, first run movies but dubbed in Italian with no subtitles. Excellent Piano bar also close. Train station is 4 blocks away and remember that the staff is there only M-F, but they do have ticket machines only in Italian, but easy to figure out! Stamp your ticked after you get it as there is a huge fine if you don't, we always did but saw several tourist get hit with a $15.00 fine for not stamping the just purchased train ticket!", "title": "A beautiful Hotel with friendly staff and a real 'feel good' factor.", "user": "mollie133", "date": "May 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29896297}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 17, "average": 25, "very good": 80, "terrible": 11, "excellent": 41}, "aka": "Grand Hotel Montecatini Terme", "slim_ranking": 0.37037037037, "description": "In downtown Montecatini Terme, facing viale Giuseppe Verdi and right in front of the Parco termale (Thermal Park) with the famous beneficial waters and beautiful Art Nouveau facilities, the Grand Hotel Tettuccio sets an example amongst the 4 star hotels of Montecatini for elegance, charm and services.Restaurant, Cristal terrace, meeting rooms and much more for one of the most pleasant stays in a hotel in Montecatini Terme..."}