{"user_rating": 4.0, "review_count": 2553, "name": "Grand Palladium Bavaro Suites Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2003", "text": "We were in the Bavaro Resort end of August and we like d it very much.", "title": "Very nice hotel and beach, all OK", "helpfulness": 2, "user": "willmis", "date": "September 13, 2003", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 1282922}, {"rating": 5.0, "title": "Phenomenal resort", "text": "Our children and we had a lot do: katamaran sailing (1 hr is free for each room, but you must be there at 9 am to get a date), pool and a very nice beach. We liked the people (wich cannot speak english so well, but there is always a way of understanding), people were very friendly. Food was good (sometimes excellent), and there was a lot of different choices of food (especially for children): Pizza, self made noodle, ... The people in the buffet area are looking for cleanil ness very much. They always clean the places around the buffet. The rooms are very nice and are cleaned well. The animation people are very friendly and do their best.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 10, 2003", "id": 1278330}, {"rating": 3.0, "title": "Nice holiday...but worst animation I have ever seen", "text": "We are thinking of visiting this resort again sometime!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 7, 2003", "id": 1275438}, {"rating": 2.0, "title": "Beautiful resort with many drawbacks", "text": "My husband and I spent 7 nights at this resort.....8/29/03 - 9/5/03 and we could not have been any more pleased ! I read all the reviews on this site prior to leaving and was very skeptical. Unfortunately for me, if there is anyone in our family who will get sick....it is ALWAYS ME....therefore I took this trip with great caution ! I packed an entire pharmacy for the trip. To my amazement I never got sick nor did my husband. Of course they tell you do not drink the water and we strictly adhered to that and we did not eat an abundance of fresh cut fruit. The remaining food selection was out of this world. If you can not find something to eat here, then you obviously are far to picky. We had selections ranging from Pizza, Pasta, Ham, Pork Chops, Steak, Rice, Goat, Rabbit, Mashed Potatoes, Fried Potatos, French Fries, baked chicken, fried chicken, chicken stir fry, shrimp, lasagna......anything and everything you wanted was there...including cavier ! And we ate our share ! You can go to the ala carte restaurants and we NEVER had to wait for service EVER...however we preferred all the different buffets at all 3 resorts.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 27, 2003", "id": 1262779}, {"rating": 5.0, "title": "Wonderful time!", "text": "The Dominican people for extremely friendly and on the contrare of what a previous review stated....they LOVE AMERICANS ..... they think Americans are friendlier and much more pleasant and they love to have as many Americans visit as possible. Most of these staff and workers earn approximately $100 a month...and if you leave $1 for the maid or hand the waiter a $1 tip and a nice polite smile....you have made a friend for life! These people were always smiling and singing as they worked.....as one local told me....If we are poor...leave us poor as we are happy....they love their life and it shows in their personalities.", "helpfulness": 2, "user": "smp21", "date": "August 23, 2003", "id": 1257856}, {"rating": 4.0, "title": "1 week ...should have stayed for 2!!", "text": "AMAZING!!", "helpfulness": 4, "user": "mandyg", "date": "November 30, 2004", "id": 2856902}, {"rating": 5.0, "title": "5* all the way!!! Great wedding, great food, great people!", "text": "What a beautiful, wonderful resort.", "helpfulness": 7, "user": "judgeless", "date": "November 25, 2004", "id": 2846699}, {"rating": 4.0, "title": "Calgarian in paradise", "text": "A word for the wise....bring comfy shoes, and take the train whenever possible or your legs will feel like stones by the end of the day!!", "helpfulness": 16, "user": "A TripAdvisor user", "date": "November 9, 2004", "id": 2815451}, {"rating": 4.0, "title": "Great holiday", "text": "Our room was one of the romance suites, very nice & kept very clean, #1583 very close to the pool & beach. The food was great in the buffets, lots of variety....we had 2 alacarts but gave up on those after the 2nd (steak was not like home).", "helpfulness": 16, "user": "A TripAdvisor user", "date": "November 6, 2004", "id": 2810048}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "Attended a family wedding while there & it ran very smooth. Out of 12 people 1 got sick...unfortunatly for 4 days of the vacation, if you get sick don't wait to see the doctor as it may only get worse!", "title": "Great Value - Great Vacation", "helpfulness": 19, "user": "ozMKE", "date": "November 4, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2806514}, {"rating": 5.0, "title": "We loved Grand Palladium Bavero", "text": "Hi,", "helpfulness": 11, "user": "Dansi", "date": "January 3, 2005", "id": 2973540}, {"rating": 5.0, "title": "The D.R. is wicked / We had a blast", "text": "My husband and I really enjoyed Grand Pallidium,the junior suite was", "helpfulness": 41, "user": "A TripAdvisor user", "date": "December 31, 2004", "id": 2967666}, {"rating": 2.0, "title": "Palladium Bavaro Grand Resort & Spa, Punta Cana, Dominican Republic", "text": "great to stay in,the people were very friendly,and the food was great,", "helpfulness": 9, "user": "A TripAdvisor user", "date": "December 30, 2004", "id": 2964731}, {"rating": 4.0, "title": "Enjoyable vacation", "text": "the weather super, we had a little rain,and it was dry in no time at all,", "helpfulness": 8, "user": "deepwaterqueen", "date": "December 28, 2004", "id": 2960392}, {"rating": 4.0, "title": "A little dissapointed!", "text": "the sun was hot,just do not leave your towel on the beach.we lost one", "helpfulness": 15, "user": "les1112", "date": "December 23, 2004", "id": 2922759}, {"rating": 5.0, "title": "1 word, Wow!", "text": "this was definetely the best vacation ever, as a matter of fact im going again this summer with my family for my sisters fifteens. trust me you will love it and the food selection is great. anywhere from fish to meat to jappanese food. whoever said the food sucks doesnt know what there talking about!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 22, 2003", "id": 1143541}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This was my second vacation to Punta Cana but the first at this hotel and the last! I traveled with my family of 5 and my sister's family of 6 ranging from ages 8 through 43.", "title": "Nice Island Bad Hotel", "helpfulness": 1, "user": "bellavaca", "date": "July 22, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 18133044, "likes": {"liked": "— The Spa", "disliked": "— The staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Lobby: was open and hot as hell. You could not go there at night to listen to the live music because you couldn't breathe. At check in they give you a plastic braclet to wear your entire trip which everyone HATED. You got a stupid stripe on your wrist from the sun and it got in the way if you wanted to wear a braclet. You have to sleep with it and shower with it and it is annoying.", "title": "Wonderful, relaxing, enjoyable vacation!!!", "helpfulness": 3, "user": "cle3", "date": "July 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18104023, "likes": {"liked": "— grounds were amazing and so was the beach", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Staff: at the reception desk did not speak English well and were not friendly unless you spoke Spanish. To their surprise my husband does speak Spanish. When we checked in they told ME our three rooms were each in a different hotel which was totally unacceptable being I booked well in advance and my son and nephew were NOT going to be in a different hotel from my sister or myself. When my husband spoke to them in Spanish and told them we needed three rooms together like we had booked they suddenly came up with three rooms right next to each other. The hotel \"manager\" Jose Torres was never taught \" the customers are always right attitude approach\" he is horrible with customer service and now I understand why his staff have bad customer service skills.", "title": "Go somewhere else!", "helpfulness": 2, "user": "krobella", "date": "July 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 18088500, "likes": {"liked": "— My room was always clean.", "disliked": "— No one spoke English!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The Rooms: were clean, large, and air conditioned well. I didn't see any bugs Thank God! The shower door was broke so there was a mini flood every time you showered. They were cheap with the towels and gave you face cloths when they felt like it which wasn't often. The safe in our room broke in the middle of the week and was still not working when we left. The mattress, pillows, and blankets ALL need to be replaced. The maids were all nice and very appreciative of a tip which was a pleasure to leave to them.", "title": "nothing cud spoil our honeymoon", "helpfulness": 2, "user": "chamasandcoke", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 18078945}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The Beach: was nice but the seaweed in the water was awful. There was not enough lounge chairs and not nearly enough huts so you have to get up before dawn if you want a hut. I was aware of topless beachgoers and in fact my sons were looking forward to them BUT........I think they should have drawn the line with the topless mixing with little kids on the water slide. The water slide charged $30 a day but haggle with them because by the middle of the week we were paying $10 a day. The hustlers on the beach are soooooooo annoying. They come up to you literally every 5 minutes. DO NOT buy cigars on the beach. My husband did and they rolled old cigarette butts in them. They do have a security guard on the beach but I still don't know what he was there for!", "title": "Not Impressed", "helpfulness": 2, "user": "slp223", "date": "July 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0}, "id": 18027614, "likes": {"liked": "— many things"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Hi everyone, our group of 25 just returned from the palladium grand resort and it was a magnificent experience. Jan 12-16th. We had a variety of age groups ranging from 25-78 and all had positive responses. We frequently travel with a large group and try to find the best spots for our money. This trip was a highlight of the past 4 outings.", "title": "A must return resort!!", "helpfulness": 14, "user": "ChicagoSSTraveler", "date": "January 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3013508}, {"rating": 3.0, "title": "Not for us! Food is important!", "text": "The check in process was none painful only 1 room was not available, great start. The rooms were large spacious and the airconditioning was ok for the temperature. Opening the patio door for a breeze was better!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 16, 2005", "id": 3010442}, {"rating": 5.0, "title": "A couple of thoughts on the Palladium Bavaro.", "text": "Bathrooms with double sinks, separate shower and whirlpool tubs beautiful, the roman room had an additional area with sitting area shower and hamack.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "January 10, 2005", "id": 2998638}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "The food varied from resturant to resturant but there was something for all, I strongly suggest trying as many buffets as you can. The best was Los Torres!! All dishes cooked and seasoned for perfection. Not much time when a meal is unavailable. Only 2 of 25 had any intestinal problems. Do not drink the water, bottle water is best even to brush and rinse. Immodium is a good travel companion, back to normal in the next 24 hours.", "title": "Great resort", "helpfulness": 21, "user": "tlgs", "date": "January 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2991009}, {"rating": 4.0, "title": "Nice resort, beautiful beaches, service has room to grow.", "text": "The wait staff were ready to assist, even with the language barrier they made every attempt to fill your request. The daily housekeeping was done late in the day which was ok with us, but you have to ask for additional face towels. The activity directors have way too much energy and will get you to do things you haven't done in years!!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 6, 2005", "id": 2985934}, {"rating": 5.0, "title": "What A Wedding - Holiday", "text": "In April of 04 we flew to the Dominican Republic to attend my son's wedding. There were approximately 32 people. Everyone was totally amazed at the accomodations when we arrived at the Palladium Bavaro Grand Resort & Spa. A number of people in our party have travelled extensively and were thrilled at the Junior Suites, the friendly and helpful staff and in particular the food. The wedding was absolutely beautiful with the wedding coordinator being extremely helpful. The beaches are out of this world. It was a very special week and only 1 person out of the 32 had stomach problems for only one day and I suspect that was more from over indulging than anything else. Could have been too many rum drinks, ha ha..", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 23, 2004", "id": 2483073}, {"rating": 5.0, "title": "GREAT,,GRAND,,WONDERFUL", "text": "We unfortunaley booked a second week at a different resort and after our amazing experience at the Palladium were expecting more of the same. The name of the second resort will remain anonymous but it was atrocious. Food was terrible, birds were eating from the buffets, people were dropping left and right from stomach ailments, the staff rude and belligerent, the rooms were dirty and cleaning staff still had not even made up the beds by 8:00 p.m.. Had to call down to desk a number of times to get bed made. This second hotel was rated as a 4 star hotel I would give it a minus 10. Palladium you will have my business!!!! My son and his wife also moved onto a 5 star hotel for their second week honeymoon and told us the Palladium was far superior to their 5 star very very expensive honeymoon resort.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 22, 2004", "id": 2482481}, {"rating": 4.0, "title": "Beautiful, friendly resort", "text": "My wife and I were there in Sept. last year, we had a great time. The staff was very good and all we wanted, we had.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 21, 2004", "id": 2480679}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "I would suggest taking some coloring books, colors, and things for children. We left things like this in our room with a small tip ($5.00) every morning for the maid, our room was kept spotless.we are going back this Nov. and we can't wait. I have recommended this place to all my friends, some of which have gone down and they tell me that they loved it as my wife and I have.", "title": "This vacation was a blast", "helpfulness": 4, "user": "Jay H", "date": "August 20, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2479204}, {"rating": 4.0, "title": "punta cana was one big party", "text": "Resort is beautiful. Beach is beautiful. The best pool is the Palladium. Pools are clean. Resort is very clean and well maintained. The plants and flowers are incredible. If you can't find something to eat, there is something wrong with you. They make the best homemade breads. However, I couldn't find a dessert I liked. They do not know how to make anything \"chocolate\" at all. Coffee is different, but fine. Rooms are clean. We had a problem with ants, but they came and took care of it promptly. The ant thing was really our fault...one of the kids left an open coke in the room.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 19, 2004", "id": 2461828}, {"rating": 4.0, "title": "A Few Surprises But, Overall, A Very Fun Vacation Destination!", "text": "We thought you'd appreciate a review of the Grand Palladium Bavaro written by a pair of unseasoned, unbiased travelers. On our return trip home to Michigan, we thought about what we'd like to \"put out there\" so that other travelers might know what to expect when visiting this all-inclusive complex. There's nothing in our review that should discourage you from booking the GPB but, hopefully. a bit of information that you'll find helpful. When we deboarded in Punta Cana Airport, we were photographed with Dominican dancers and then hustled through a line where we were each required to pay a $10 \"airport usage fee\". It's a good thing we had cash, and you'd be wise to plan for this occurrence - we had no idea there was a fee upon entry. All of the vacation package specialists' booths were easy to locate (psst...the airport is very small). We had a short wait before beginning the 35 minute mini-bus trip to the resort. Check-in at the GPB went very quickly and smoothly (15 minutes). The property is large and the walkways are confusing to newcomers - if you stick to the covered walks, you'll have better luck finding your condo later that night when you've enjoyed the pleasures of the bar. The Grand Palladium Bavaro is actually the first of 3 side-by-side-by-side resorts along Bavaro beach. You move from one property to the next without really knowing it! Each of the three has at least one pool and several restaurants, including at least one giant buffet restaurant. Most of the pools have swim-up bars. The drinks are distinctly weak in alcohol and sweet. It takes a real effort and about 5000 calories to feel any effect. You'll have one choice of beers - El Presidente, a pretty non-presidential beer if I'm to be asked. The food in the sit-down-and-order-from-wait staff restaurants is very likable - nicely cooked and presented and served by professional staff. The food in the buffet restaurants is suspect, and I'm a guy who selects his food like a goat. \"Something\" gave each of us a 24 hour bout with \"the plague that attacks the bowel\". But, with a little Immodium AD and a certain sense of adventure, we ventured back to give the giant buffet hall a second chance with no further ill effects. I suspect the salad, my wife is suspicious of the lunch meats. Being a teacher, it's helpful for me to communicate in terms of grades (before grade weighting - let's say the 1960's). I'd have to give the buffet restaurants a C+ and the Ala Carte restaurants an A-. The soft serve ice cream, available at several buffets, is dynamite! The tropical fruits (esp. the pineapple) are wonderful. Let's go to the beach! The beaches are everything they're raved up to be - clean, alluring, gorgeous. I cannot imagine a more picturesque beach (presuming the absence of the topless elderly European women). There are beach bars located along the length of the beach, so you won't have to stumble any farther than 100' or so to get a fresh drink. People compete (translate - \"fight\") for beach lounge chairs. You'll have to rise with the mockingbirds and sleep walk to the beach early in the morning to lay your towel out and lay claim to your chair. Don't get too attached to it though - we experienced lounge chair theft. The beaches (and swimming pools) are the hawking grounds for an almost unlimited number of vendors desiring to sell you rides, excursions, experiences, cigars, sea shells, jewelry, hats....we couldn't find 5 minutes of private time without having to wave off a salesman. Walk down the beach - it's just as bad. Avoiding eye contact doesn't work - these are salesmen who are not to be denied! Claim to be the only person on the planet to speak a certain language - they'll still come after you. Nobody warned us about this intrusion, but we're warning you. The venders are not rude, but they are persistent in a \"won't take NO for an answer\" sort of way. We selected Bavaro Beach because we were told we could snorkel \"right off the beach\". Well, nobody ventures out beyond the roped-in swim area because it'd be suicidal! Boats winding in and out of each other provide part of the day's entertainment from the beach, but you wouldn't want to be swimming out there unless you had it in mind to visit the local health care facility (located right on the property!). We booked a $30 per person (for one hour of snorkeling) excursion to the local reef where the coral are dead but there are plenty of fish to view (because the guides feed them with bread from the buffet restaurants). No matter what snorkeling tour you book, you'll end up on the same reef about 15 minutes south of the Grand Palladium Bavaro, so book the cheap one! Our room was nice and clean, and the clean staff showed up everyday and did a very nice job (be sure to tip them!), but we never knew what time to expect them - one day they cleaned the room after 5 o'clock! Our TV never worked (we missed the UNC-MSU game, dang it!) in spite of our friendly inquiries to the maintenance staff. In our room and at certain sites on the grounds there was the \"backed up sewer odor\" Whew, baby! We got rid of it quickly by opening the patio door to a fresh breeze and some lovely scenery. The staff at the GPB was very friendly and helpful (except for maintenance - they were just friendly). We were definitely in the minority - Americans and Canadians constituted only about 10% (just a guess, not a fact to be taken literally) of the persons visiting the resort. Most of the travelers were Spanish and German, and we also noted that there were many French and Italian guests. We enjoyed listening to their beautiful languages and trying to figure out what they found so funny when they looked at us. It's a small world after all!!!! Well, it seems as though I have reached the limits of your patience and should wrap this review up. In spite of the minor criticisms that dominated the bulk of this treatise, we had a terrific 6-night vacation. I feel that the resort has enough positives (the beauty of the grounds, the cleanliness of the entire property, the effort made by the staff, the gorgeous beaches and clean pools, the relaxing atmosphere) to outweigh the criticisms I've cited. We both feel that the resort deserves our \"4 out of 5\" rating, and that to achieve the perfect 5/5 would have required an improvement in the buffet restaurants and a reduction in the number of salesperson assaults we were forced to tolerate. Oh yeah, and I'd like to see them ramp up the drinks...a lot.", "user": "GRYC", "date": "April 13, 2009", "id": 27956000}, {"rating": 4.0, "title": "\"A Few Surprises But, Overall, A Very Fun Vacation Destination!", "text": "We thought you'd appreciate a review of the Grand Palladium Bavaro written by a pair of unseasoned, unbiased travelers. On our return trip home to Michigan, we thought about what we'd like to \"put out there\" so that other travelers might know what to expect when visiting this all-inclusive complex. There's nothing in our review that should discourage you from booking the GPB but, hopefully. a bit of information that you'll find helpful. When we deboarded in Punta Cana Airport, we were photographed with Dominican dancers and then hustled through a line where we were each required to pay a $10 \"airport usage fee\". It's a good thing we had cash, and you'd be wise to plan for this occurrence - we had no idea there was a fee upon entry. All of the vacation package specialists' booths were easy to locate (psst...the airport is very small). We had a short wait before beginning the 35 minute mini-bus trip to the resort. Check-in at the GPB went very quickly and smoothly (15 minutes). The property is large and the walkways are confusing to newcomers - if you stick to the covered walks, you'll have better luck finding your condo later that night when you've enjoyed the pleasures of the bar. The Grand Palladium Bavaro is actually the first of 3 side-by-side-by-side resorts along Bavaro beach. You move from one property to the next without really knowing it! Each of the three has at least one pool and several restaurants, including at least one giant buffet restaurant. Most of the pools have swim-up bars. The drinks are distinctly weak in alcohol and sweet. It takes a real effort and about 5000 calories to feel any effect. You'll have one choice of beers - El Presidente, a pretty non-presidential beer if I'm to be asked. The food in the sit-down-and-order-from-wait staff restaurants is very likable - nicely cooked and presented and served by professional staff. The food in the buffet restaurants is suspect, and I'm a guy who selects his food like a goat. \"Something\" gave each of us a 24 hour bout with \"the plague that attacks the bowel\". But, with a little Immodium AD and a certain sense of adventure, we ventured back to give the giant buffet hall a second chance with no further ill effects. I suspect the salad, my wife is suspicious of the lunch meats. Being a teacher, it's helpful for me to communicate in terms of grades (before grade weighting - let's say the 1960's). I'd have to give the buffet restaurants a C+ and the Ala Carte restaurants an A-. The soft serve ice cream, available at several buffets, is dynamite! The tropical fruits (esp. the pineapple) are wonderful. Let's go to the beach! The beaches are everything they're raved up to be - clean, alluring, gorgeous. I cannot imagine a more picturesque beach (presuming the absence of the topless elderly European women). There are beach bars located along the length of the beach, so you won't have to stumble any farther than 100' or so to get a fresh drink. People compete (translate - \"fight\") for beach lounge chairs. You'll have to rise with the mockingbirds and sleep walk to the beach early in the morning to lay your towel out and lay claim to your chair. Don't get too attached to it though - we experienced lounge chair theft. The beaches (and swimming pools) are the hawking grounds for an almost unlimited number of vendors desiring to sell you rides, excursions, experiences, cigars, sea shells, jewelry, hats....we couldn't find 5 minutes of private time without having to wave off a salesman. Walk down the beach - it's just as bad. Avoiding eye contact doesn't work - these are salesmen who are not to be denied! Claim to be the only person on the planet to speak a certain language - they'll still come after you. Nobody warned us about this intrusion, but we're warning you. The venders are not rude, but they are persistent in a \"won't take NO for an answer\" sort of way. We selected Bavaro Beach because we were told we could snorkel \"right off the beach\". Well, nobody ventures out beyond the roped-in swim area because it'd be suicidal! Boats winding in and out of each other provide part of the day's entertainment from the beach, but you wouldn't want to be swimming out there unless you had it in mind to visit the local health care facility (located right on the property!). We booked a $30 per person (for one hour of snorkeling) excursion to the local reef where the coral are dead but there are plenty of fish to view (because the guides feed them with bread from the buffet restaurants). No matter what snorkeling tour you book, you'll end up on the same reef about 15 minutes south of the Grand Palladium Bavaro, so book the cheap one! Our room was nice and clean, and the clean staff showed up everyday and did a very nice job (be sure to tip them!), but we never knew what time to expect them - one day they cleaned the room after 5 o'clock! Our TV never worked (we missed the UNC-MSU game, dang it!) in spite of our friendly inquiries to the maintenance staff. In our room and at certain sites on the grounds there was the \"backed up sewer odor\" Whew, baby! We got rid of it quickly by opening the patio door to a fresh breeze and some lovely scenery. The staff at the GPB was very friendly and helpful (except for maintenance - they were just friendly). We were definitely in the minority - Americans and Canadians constituted only about 10% (just a guess, not a fact to be taken literally) of the persons visiting the resort. Most of the travelers were Spanish and German, and we also noted that there were many French and Italian guests. We enjoyed listening to their beautiful languages and trying to figure out what they found so funny when they looked at us. It's a small world after all!!!! Well, it seems as though I have reached the limits of your patience and should wrap this review up. In spite of the minor criticisms that dominated the bulk of this treatise, we had a terrific 6-night vacation. I feel that the resort has enough positives (the beauty of the grounds, the cleanliness of the entire property, the effort made by the staff, the gorgeous beaches and clean pools, the relaxing atmosphere) to outweigh the criticisms I've cited. We both feel that the resort deserves our \"4 out of 5\" rating, and that to achieve the perfect 5/5 would have required an improvement in the buffet restaurants and a reduction in the number of salesperson assaults we were forced to tolerate. Oh yeah, and I'd like to see them ramp up the drinks...a lot.", "user": "GRYC", "date": "April 13, 2009", "id": 27955998}, {"rating": 4.0, "title": "We had an absolutely amazing vacation!", "text": "My husband and I stayed at this resort from March 28-April 4, 2009 with another couple and had a fabulous time! The beach is truly amazing - one of nicest I have ever seen. The food was plentiful with lots of variety and selection. The rooms were lovely and were cleaned daily and rechecked every evening to replenish towels and be tidied. The staff were wonerful. We communicated easily with most of them. Almost everyone speaks spanish and atleast some french. English is definitely spoken less but we certainly had no issues with language. All in all, the trip was amazing and we would definitely return to this resort and Punta Cana! For everyone who has an upcoming trip to this resort, be assured that you will not be disappointed. I wish we were back there now and we have only been home for a little more than a week!", "user": "NovaScotiaSunGirl", "date": "April 13, 2009", "id": 27921786}, {"rating": 4.0, "title": "Nice Resort", "text": "Ola, from Nova Scotia. We have been to several resorts over the last 9 years and this one would be in the top 3...........We stayed here the week of March 23rd and the weather was fantastic. The grounds were well kept , with lots of greenery and flora. We stayed in one of the junior suites which was quite nice with a very large bathroom............everything was clean and well maintained. The food was excellent at the specialised restaurants and very good at the buffets. Service at all restaurants was very good........", "user": "HillaryNovaScotia", "date": "April 9, 2009", "id": 27729932}, {"rating": 4.0, "title": "Fabulous Wedding", "text": "Other items that were not so great which we managed around, was;", "user": "sunqueen_neen", "date": "April 6, 2009", "id": 27541734}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Just returned back from the Grand Palladium Bavaro in Punta Cana DR. What an awesome resort. This was our 3rd trip to Punta Cana and it still excites me. It's a great country with great people. The Punta Cana beach is just beautiful, white sand and aqua waters, lined with lush palm trees. The resort, so far, is the lushest we've been on, so if you like lots of trees, flowers, and gardens this is the resort for you. Everything is kept spotless from the lobbies, to the rooms, to the grounds around the property. The room was great, lovely hot-tub right in the room itself, with a stand up shower in the bathroom. All marble floors throughout the resort, being lobbies, rooms, and public washrooms- even at the beach. The food on the resort was great also, there were 6 of us and no one got sick. If you go, go to the Brazilian restaurant for sure, it was the best A La Carte I've been to in a few years, and I go every year to one country or the other, and this one was top notch. You got roast beef, chicken, saucage, fish fillets, and shish-kabob, all in your meal, not choice of one or other, but all. Everything was cooked very tender and seasoned nicely. The pools on the resort were great, there are 5 in total, and very large so not over crowded at all. William at the main pool bar was totally awesome, very friendly and curtious. Always were able to find chairs on the beach and at the pools as resort is roomy so there are plenty. You have full use of the sister resorts as well, being Palladium Punta Cana and Palladium Palace. There are two multi-seated trains that run around and between the resorts so you don't have to worry about walking far as they run every 15 minutes. If you are walking, most pathways are covered so you are shaded from the hot sun. The nightly shows were very good and costumes worn by entertainment team were very beautiful- seemed that they were all new. There is a piano bar in the main lobby and the disco is right out front, next to the theatre, so everything is close by. Next to the disco is the sports bar which has 24 hour food service. This resort had the best pizza that I have tasted in these areas as well. Everything from meat, chicken, vegetarian, Hawiian, to just plan cheese...yummy! If you like ice cream, you have to try it here, from self serve- soft serve, to tubs you scoop out of as well, make sure to try the rum & raisin - there's RUM in there!! We found the drinks to be very good here too, but the food was so good and plentyful, made it hard to find room to put the drinks in sometimes :) There are also many turtles, fish, and flamingo's around the main lobby, makes for great picture taking with the flowers and trees in the background. When you hit the beach, to the right (10 minute walk) there are about 5 or so shopping huts. They are very aggressive there, so if this bothers you and you like to do the hut shopping thing, go to the left from the resort, BUT you will have to walk farther. A lovely 40 minute stroll down and back past lots of other resorts along the way (just around the point) will bring you to about 15 shopping huts. You will still have to haggle but they are less aggressive here. Take a bottle of water with you and take your time and the walk does not seem that far at all- hop in the ocean along the way. About walking around the resort, we found no flies or bugs that bothered us, but we did put bug lotion on our legs at night just in case. For excursions, we did the Bavaro runners and the Marinarium tour. Both were well worth the money, around $90 US per person. Bavaro Runners takes you through the country side, to a local school, sugarcane plantation, coffee plantation, cocoa plantation, tobacco plantation, horseback riding, and lunch at a ranch in the mountains. The Marinarium tour takes you out on a catamaran to swim with stingray and nurse sharks- very safe, you have a lite lunch on board, an open bar on board and a floating bar in the ocean. You take a cruise along the coastline and stop off shore for a dip. For those who don't wish to swim, you can stay on board and party with the entertaining tour guides- alot of fun!! There was some language barrier on the resort, mainly with the younger staff, while the older staff had very good English. Well dah, you are in a Spanish country, and that is to be expected. If they travelled here we would speak English to them wouldn't we...so no problem there for me. I found the staff to be very very friendly, but you always get what you put out. Lastly if you wish to cool off late at night, hop on the train and take a spin around the resort, it passes right along side the beach and the breeze is awesome. Go, enjoy the culture, enjoy the resort, enjoy the beauty, embrace the people, and you'll have a wonderful time.", "title": "Totally Awesome Trip", "helpfulness": 15, "user": "Culture-Shocked", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29113029}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Just spent two weeks at bavaro resort, absolutely amazing, rooms, food, service, weather, everything just perfect, had our wedding 2nd week, carolina handled everything and the day was flawless, all staff are really friendly, cant do enough for you, will be back again next year.", "title": "IGNORE ANY NEGATIVES, THIS PLACE IS WONDERFULL", "helpfulness": 1, "user": "gj021", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28625343}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Gary & Jennie, Birmingham", "title": "what more could one ask for?", "helpfulness": 8, "user": "applejacks6", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28519866}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Been back in the States for a week, and I miss the beautiful beach and weather sorely. After spending hours on this website scouring reviews, my gal pal and I finally settled on this place. We were not disappointed. The hotel is as gorgeous as it looks in the pictures. Upon arrival you are greeted with fruity drinks and your bags are whisked away by a helpful bellman (but he'll catch you off guard, I promise...then expect a small tip for holding your bags while you check in). The hotel staff were pleasant from the first - able to speak at least 4 languages with minimal effort. My friend and I had placed a reservation online (not through an agent or company), and were given a single King. We're buds, but not that close. We requested two queens, of which there were none that day, but we were told they would bring a roll away and have us moved the following day. We were then led to our room, which was gorgeous. Nice bathtub - shower was a bit small in the first room though. Everything was super clean. When we relocated the following day (all it took was a trip to the front desk in the morning and 1 phone call after we had arrived back to our old room to notify them we were ready to move), the new room wasn't quite ready, as the cleaning staff had the beds PULLED OUT FROM THE WALL to clean behind and all furniture moved. I've never seen that before. Needless to say I did not have concerns about bedbugs while we were there.", "title": "Great trip - worth every penny!!", "helpfulness": 8, "user": "billswife1025", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28435857}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Speaking of bugs - no mosquitoes on premises that I noted. They must fumigate at night, because I am the mosquito queen (wherever I am, they find me). The airport, on the other hand, is where I was eaten alive. Just be forewarned...hanging around there is bad news for exposed skin.", "title": "Excellent time", "helpfulness": 3, "user": "micky055", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28320271}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I simply love the GPBR. We arrived on time from STL. Our room wasn't ready (room 1141) until about an hour after we arrived at the hotel, but so what. We had a perfect location (close to the beach and close to all of the restaurants). This was our first time there and we were encouraged to leave our bags so we went at it. After reading the different reviews it's safe to say that some people are sort of picky and hard to please. I enjoyed the people and the food. (I must admit that I ate a little too much (indigestion), but that was my fault. We enjoyed the \"tram/train\". We walked a bit. Someone wrote that the tram was a joke. It was slow enough to take in all of the sights. I loved the people (especially the women) :) I was on my honeymoon as well. I picked up a few spanish words and phrases (some naughty and mostly friendly). I had a great time with the staff. The staff were very friendly.", "title": "Dynamite Time at the GPBR", "helpfulness": 1, "user": "dphouse", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17759830, "likes": {"liked": "— The people", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We are an African American couple and we were catered to (not because we were AA), but because we were friendly and appreciative.", "title": "Terrible, very anti-British", "helpfulness": 1, "user": "Whateverfantalemon", "date": "July 2, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 17467142, "likes": {"liked": "— Hemmingway Cocktail Bar", "disliked": "— Everything else"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The beach was great. I loved the topplessness, despite not everyone being in the greatest of shape. Then again, who is. This is totally prohibited at any public beach in the US that I know of.", "title": "The Good ,the Bad, & the Ugly", "user": "ky-mic", "date": "June 30, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17378357, "likes": {"liked": "— beach, room, excursions, and spa services", "disliked": "— drinks, not enough Americans, 16% tax rate"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I loved all of the restaurants. The staff seemed to try very hard to please the guests. I actually enjoyed tipping. I am willing to bet that 99% of the people from the US can't get this quality of service in the US. You may get better food, but it wouldn't necessarily be over the top better. Let's face it, you are not at home. The beef may be \"raised\" differently, the seasoning of the food is different, you can't get Budweisers there (as far as I know). Loosen up spoil sports.", "title": "Awesome Vacation and Resort", "helpfulness": 4, "user": "emmilou05", "date": "June 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17267644, "likes": {"liked": "— Everything", "disliked": "— Going home"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The people selling items along the beach can be a little annoying, but brush them off if you don't want to be bothered.", "title": "Loved the Bavaro", "helpfulness": 1, "user": "BigE2319", "date": "June 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17234146, "likes": {"liked": "— Our room", "disliked": "— Lack of activities"}}, {"rating": 4.0, "title": "Great Resort", "text": "Wife, son and I just returned after 4 nights/5 days at the Palladium. This is a beutiful tropical resort with great resturants, rooms, bars, service, pools and beach. As guests at the Palladium, you get to enjoy all the facilities at the ajoining 3 Fiesta resorts (Fiesta Pallace Resort, Fiesta Beach Resort & Fiesta Royal Suites Resort). All these properties ajoin along a 3/4 mile streach of Bavaro Beach.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 8, 2004", "id": 2518276}, {"rating": 4.0, "title": "The positives and negatives", "text": "We had a junior siute in villa 21 on the second floor. Our room had a great view of the tropical gardens and a partial beach/ocean view.", "helpfulness": 18, "user": "mstv", "date": "September 5, 2004", "id": 2514257}, {"rating": 5.0, "title": "Loved the Palladium Bavaro Resort!", "text": "Room: Junior suite. Very nice in size, clean and modern with a huge bathroom. The bathroom is nearly as big as the sleeping and living area of the room. It comes with double bowl sink and a huge whirlpool tub and sepaerate shower and seperate toilet area. A/C worked great with a nice tv and balcony. Sofa and sitting chairs.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 1, 2004", "id": 2506896}, {"rating": 4.0, "title": "Would definately go back ....", "text": "Beach: Awsome beach. Very, very picture postcard like. Clean water and turquise in color. Fine pure white sand.", "helpfulness": 4, "user": "Don_McLean", "date": "August 31, 2004", "id": 2504533}, {"rating": 3.0, "title": "Family Vacation in Punta Cana", "text": "Pools: Pool at the Fiesta Palace was the best. Very tropical. All the pools were very nice. A total of 5 in all. All but one had a swin up bar.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2491664}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Before going to Punta Cana I eagerly awaited the latest reviews and forum updates on the Grand Palladium Bavaro Hotel. Since returning and reading some of the more recent ones I felt compelled to give some balance to future potential visitors as it's all too easy to write a solely negative/positive review.", "title": "Some Balanced Reviews please?", "helpfulness": 4, "user": "BartySmicer", "date": "July 18, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 18003204, "likes": {"liked": "— The Resort Spa", "disliked": "— Reception and Customer Service"}}, {"rating": 5.0, "title": "Wow! What a resort!", "text": "A little background - 2 couples travelling together aged 27 - 30 years old. Have been on similar trips before, including all inclusives but not to the Caribbean itself.", "helpfulness": 3, "user": "JohnTheTraveler_8", "date": "July 16, 2008", "id": 17922518}, {"rating": 4.0, "title": "Grand Palladium Bavaro Resort & Spa!!", "text": "(1) - Reception - Utterly incompetent and rude, regularly over 14 days. Absolutely zero communication between them and a glazed look of \"I don't care\" as they begrudgingly dealt with issues. Example - Door was broken to room which locked us out. At least our friends were beside us. 6 phone calls and 2 visits to reception over a 10 hour period followed - No help. At 2am, a maintenance crew member broke the door in for us. Worse still, 3 phonecalls were made the following day to have it fixed for obvious security reasons. Result? Nobody had a clue about the problem. We sat in the room until 3pm until they finally arrived to fix it. Manager didn't help at all and demanded we pay for the night as our things were in the room and as a result we technically stayed there. There were more unreal attitude probelms ahead but I'll leave them out. I must point out that I have no doubt that others may have had great service from reception. We didn't and it left a bad taste, maybe we were unlucky. There is a massive difference between laid back and unhelpful.", "helpfulness": 1, "user": "RealDealProd", "date": "July 15, 2008", "id": 17918761}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "(2) - Rooms - First room was a deluxe until we upgraded. It had filthy stained jacuzzi, leaking AirCon, broken toilet door, leaking shower, broken phone and old musty sheets. Second room, Junior Suite, was far superior even though it cost almost $400 to upgrade. Unfortunately, if you don't tip on Day 1 the lovely flower petals and folded towel animals are omitted. Over 2 weeks our room was not cleaned 4 times, once for 3 days. Despite calls to reception and customer service desk, this was never explained or even remedied.", "title": "Hermosa Dominicana!!", "helpfulness": 1, "user": "vicbc31", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 17910525, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "(3) - Food - I enjoyed it a lot as I didn't expect Michelin stars. La Cathedral got a bit dull but the others such as La Uva were worth a visit. The 'A La Cartes' are just a 5 option menu so don't get too excited at the prospect. The Italian restaurant is the best of those by a distance. 3 of the 4 in the group had stomach problems but this may have been more a combination of heat and new cooking styles and seasonings.", "title": "Fab hotel, loads of fun!", "helpfulness": 1, "user": "robynw08", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17768182, "likes": {"liked": "— everything!", "disliked": "— loved everything!"}}, {"rating": 4.0, "title": "A wonderful vacation overall", "text": "My husband and I just returned from a wonderful 10 days at Fiesta Bavaro with our 4 kids, age 11, 9, 6 and 4. We stayed in a Junior Suite, in the middle of the resort, not far from the main pool. As Apple clients, we enjoyed the pools and restaurants at the 2 adjoining properties as well. We especially liked the pool at Fiesta Beach, as it was quieter than the rest (and prettier, too). Our room was adequate for the little time we were in the room. 3 of the kids slept on the pull-out sofa, which I would definitely NOT recommend for adults, as the mattress is thin and flimsy. The room was very neat, and the maid kept the mini-fridge stocked for us at all times. The beach was absolutely spectacular-of the several places we've stayed in the Caribbean, this was no doubt the prettiest. The staff kept the beach clean, and raked daily for seaweed (minimal). There were 1-2 foot waves which were perfect for the kids without being too rough. And this was after Hurricane Claudette had bypassed the island. The younger kids enjoyed the Mini-Club (the older 2 preferred to stay on the beach with us). Leani, the regular care-giver at the mini-club, was quite pleasant, but spoke little English. This did not seem to be a problem with the kids. They enjoyed making friends from other countries. Our 4 year old had her birthday while there, and the staff made a big fuss with a gift for her. They also took the kids sailing on a Hobie cat one day, as well as mini-golfing. The mini-club facility itself is adequate with a little playground, soccer field, fort to climb in, Nintendo, ping-pong table and craft room. The kids' day is not entirely spent there, as they take them to the buffet for lunch, to the pool and beach.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 25, 2003", "id": 1148412}, {"rating": 2.0, "title": "Dont believe the hype", "text": "The food was very good. Keep in mind this is mostly a European resort, so the chefs have the challenge of appealing to many tastes. We never went hungry, and mostly overate! We did not bother with the reservation restaurants, as we heard that the food is mostly the same as the buffets, and the reservation system seemed silly. The presentation of the food is lovely. One highlight was the chef who carved food sculptures in the dining room so the kids could watch him. The fresh fruits were awesome. We also loved Mexican night-the best guacamole I ever had. Another night they served every kind of roast imaginable-roast beef, roast chickens, roast turkey, roast pork, etc.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 25, 2003", "id": 1148289}, {"rating": 5.0, "title": "Awesome Trip!", "text": "Delicious! Yes, we all did experience stomach upset and diarrhea. We were not able to isolate what caused it but we think it was the presence of unflitered water in the environment-they are constantly irrigating the landscape and washing sidewalks with this foul-smelling water. We were extremely careful not to drink the tap water and used bottled-water exclusively. A few doses of Imodium took care of the problem-be sure to take some along. The biggest problem was the behavior of a few of the topless women. We knew toplessness was permitted when we booked the vacation. However, unfortunately, the resort needs to provide beach monitors to assure that toplessness doesn't mean sexual behavior. For some couples (mainly young Americans who perhaps have not been topless before) this was an invitation for inappropriate behavior in the ocean. This was very unsettling for our older daughters, and my husband and I on a few occasions had to ask the couples to respect that this is a family resort. I'd estimate that 60-70% of women on the beach were topless, and much smaller % at the pools. The only other disappointment was that snorkelling was an extra expense. We had to pay $20 per person to be taken out to the reel off-shore to snorkel. It was very good once we got there, but it would have been nice if there was eguipment available to borrow for the kids to use along the beach also. I guess next time we'll take our own from home. Also, you need to reserve the Hobie cats by 10am the day you want to sail. Otherwise, it's all booked. We enjoyed the sea kyacks (free) instead! We brought inexpensive inflatable rafts and rings from home, and I'd recommend that, too.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 24, 2003", "id": 1147959}, {"rating": 5.0, "title": "Everything was perfect", "text": "All-in-all, it was a wonderful affordable vacation. We'd go back without hesitation.", "helpfulness": 3, "user": "PAGELEE98", "date": "July 23, 2003", "id": 1144052}, {"rating": 4.0, "title": "\"Nice Family Vacation\"", "text": "hello potential travelers, I' ve been to this resort and let me tell you, i didn't have a good time. me and my wife and two other couples traveled here from july 16th to july 23rd 2003, and it was the worst vacation i've ever had!!! The resort itself wasn't that bad, the pool and beach was very nice, and the people were very friendly, but spoke very little ENGLISH. some of the other problems we encountered were too many kids on the adult side of the pool, kids in the disco at 12 and 1:00 am and also reservations for the restaurants was an inconvenience, but ladies and gentlemen the clincher was the food. It gave everybody diarrhea. I was sick for 2 days my wife for a day and my buddy when we got back to the States he went straight to the hospital with the diagnosis of a bacterial infection that had him sick for 5 days. Needless to say I will never go back there under any circumstances. My advice is to you guys if you must go, take an anti-biotic from your doctor and a bottle of Immodium AD. Thank you P.S. Pack an iron, there's only five of them in the whole resort", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 23, 2003", "id": 1143613}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Briefly, as we have just today returned. This was the best holiday we have ever had. Superb accomadation, we had an upgrade to Junior Suite, take it if you are offered it. It is definatly worth it. The food , the facilities, the total package, everything was without fault. If you want to nit pick then there were a few small things but so small it is not worth a mention.", "title": "The Best Holiday.", "helpfulness": 1, "user": "rutland4191", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26507769}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Went with Thomson no probs there either, flight, rep everything spot on.", "title": "Great Vacation", "helpfulness": 7, "user": "atticany", "date": "March 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26342349}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Weather was good, a bit windy first week, but only roughed up the sea a bit, the beach went on forever in both directions, so the 'walk of shame' ( food burn off exercise) after breakfast is in perfect conditions.", "title": "loved this resort", "helpfulness": 5, "user": "lizbeth14", "date": "March 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26323233}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "If you read this then take it from me you will enjoy.", "title": "Grand Palladium Bavaro great place to stay", "helpfulness": 7, "user": "barbiedoll1965", "date": "March 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26273047}, {"rating": 4.0, "stay_parameters": "Stayed February 2009", "text": "From the moment we arrived at the resort we liked what we saw. Everything was beautiful and very spacious but easy to get around with the train or walking.", "title": "Overall a great trip!", "helpfulness": 6, "user": "AMMCan", "date": "March 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 26032413}, {"rating": 5.0, "title": "Unbeatable", "text": "Been to Punta Cana 6 times and this is the best resort we've stayed at. Access to 3 resorts, 13 resturants, 16 bars! Service is amazing, rooms are top notch, food is good and the beach is to die for. Highly recommend this resort!", "helpfulness": 19, "user": "VancouverPimp", "date": "January 23, 2005", "id": 3026700}, {"rating": 4.0, "title": "Palladium was wonderful", "text": "Ok, First off, coming to such a beautiful place was amazing!!! The beaches were absolutley beautiful, and the grounds of the Resort were very well maintained and beautiful, flowers of all sorts and colors just sprouting everywhere!! It was like walking through a paradise! Unless you are an extremely uptight person, who doesn't know how to relax and needs absolute perfection, I strongly recommend this place. ( I can't believe some of the bad reviews I have read about this place!! SO NOT TRUE!!) There were 6 of us in our group aged 23-27. We only did one excursion called the party raft-you get to go snorkling and all the drinks were included for about $60. The guys on this boat were SOO much fun. They kind of reminded me of Jamaicans-so laid back and friendly! warning: Go EASY on the \"sex on the boat\" drinks they mix up after you are done snorkeling!!!! We got extremely intoxicated off of these and my boyfriend and I found ourselves throwing up later that night!! We found that being young AND American was definatley in the minority. We found out that the yellow bracelets were Americans who booked through Apple vacations, and the blue bracelets were from other countrys like Canada or Europe. VERY helpful to remember a few spanish phrases-you will be glad you did!!! Not everybody speaks english here....however some are very good. It was fun to try to talk to them though.", "helpfulness": 32, "user": "A TripAdvisor user", "date": "January 21, 2005", "id": 3022003}, {"rating": 4.0, "title": "Great Time", "text": "The Tex-Mex Restaurant was EXCELLENT!!! We couldn't get enough of it!!! The Spanish Restaurant was very poor -DON\"T GO!!! The food for the most part at the buffets was NOT bad!!!! Yes, American food definately tastes better, but there was ALWAYS something good to eat here. We decided that the American food is just way more flavorful and seasoned. The Dominican cheese is a little bit greasy. None of us got sick at all!!! We were all surprised that no one got sick after reading other reviews.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 20, 2005", "id": 3021239}, {"rating": 5.0, "title": "Wow!", "text": "One thing that we really spent a lot of time in was the Sports Bar. They had excellent nachos, you could order burgers and fries, pizza, and the ice cream was great! Alberto works in the sports bar....we tipped him well our first night and he treated us like kings the rest of the week....He's a great waiter!!! The majority of the workers here were sooo friendly. You can tell that they all enjoy their jobs....they walk around singing, smiling and dancing....it is just fun to be around that! Tips go a long way here....and they really do appreciate it....I brought $50 in $1 bills and the rest in 5's and 10's. This was perfect! They will not break a bill into smaller denominations and give you change (Unless you go to the casino or get it in pesos) before we got to our resort, we drove through town-it was sad to see how these people live, and then we arrive at this resort just down the road that looks like paradise. (before I forget- if you do go to the casino, watch your chips close!! My boyfriend was playing 3 card poker for only about 1/2 hour, and the dealer tried to short him 3 different times!!!)", "helpfulness": 6, "user": "priyar", "date": "January 19, 2005", "id": 3018300}, {"rating": 3.0, "title": "Beautiful Beach, Grounds and Hotel. Food is Average.", "text": "We found that we had to get out early to save a beach chair. There were always a few available, but we needed 6 of them, and that was hard to find at times. The sun is so hot here. Wear sunscreen!!! It was a lot cooler out by the beach with the breeeze. If you go to the flea market, DO NOT pay what they first tell you. I bought some beautiful larimar jewelry there, and got it for almost 1/4 of the price he started with. We went to the market early in the morning, but I wished we would have waited till it was more busy, it seemed like a lot more people were trying to sell to us. so we just left.", "helpfulness": 23, "user": "columbia22", "date": "January 18, 2005", "id": 3015041}, {"rating": 5.0, "title": "Fiesta Bavaro - excellent vacation", "text": "My family and I just returned from our 8 day vacation at Fiesta Bavaro. I have to say we were alittle scared about going after reading some of the reviews. Well guess what? Forget all the negative reviews, they'd probably complain about anyplace they went to. We (3 adults and 3 teenagers) had a great time!! The food was great at the buffets and the reservation restaurants. There was a great selection from different cultures including American, that you could always find something you liked. The rooms are your basic hotel rooms nothing special, but your not in them anyway. Yes, I'll agree about the pillows, but have a couple of drinks before bed and you won't care. The resort, grounds and beach are absolutely beautiful. You do need to get your towels on chairs at the pool early (around 8am) if you want a lounge chair at any point during the day (table and chairs always available). The beach lounge chairs only if you have a large party. Most of the buildings are not air conditioned and it's very humid there (at least in August) so dress accordingly. The reservation restaurants, the lobby bathrooms, the disco and your rooms are it. Either we got use to it or the humidity lifted the last half of our week. Remember again, your in the tropics. The staff is very friendly, but speaks little english, just enough to get by. Guest services personnel do speak english and some of the front desk people. I'd recommend learning a few phrases, but we got by on forgotten middle school spanish and only used the spanish/english dictionary once or twice. The activities/entertainment staff were wonderful, friendly and very active. They have activities for everyone - adults, children and the teenagers. The non-motorized water equipment was always available except the catamarans. You need to reserve them at 9am by the spa. Which brings me to the spa -- yum. I don't think they realize what they could be charging for they're services. When we go again - we decided we'll have something done everyday. It's sssooo cheap and feels great. Try a beach massage, the ocean breeze feels great. The shopping is kind of limited, there are shops near the lobbies of all 3 resorts. If you like to haggle there's a flea market area down the beach from the resort. Or if you cut thru there's alittle town with shops and the mercado is cheaper then the resort. And to the question everyone is wondering about - if you brush your teeth and rinse your toothbrush off with bottled water and don't drink any of the faucet or shower water - you should be fine and not have diarrhea. I had no problems - only a little upset because of all the fruit and rich food. Everyone else in our party did one of the no no's, like rinsing the toothbrush with the faucet water, but it didn't slow anyone down (bring the Immodium AD). Bottled water is available everywhere - it's your best friend embrace it. And here's my only complaint - European's are rude and smoke everywhere! That's it ! - I would return to Fiesta tomorrow if I could get off work and I truly hope to go back next year. Have a wonderful time there!!!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 18, 2003", "id": 1235817}, {"rating": 5.0, "title": "Never Want To Leave", "text": "I loved every minute of my vacation in Fiesta Bavaro. I did get sick, but only for a day and it had nothing to do with the food it was from the sun. I definetly did not wanna go home at the end of our vacation and I am trying to convenince my mom to go back there next year. Go there you'll love it and get to know the workers they are a blast.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 16, 2003", "id": 1229669}, {"rating": 4.0, "title": "Beautiful Grounds", "text": "We just returned on Wednesday, August 13th and had a really good time.", "helpfulness": 2, "user": "thetwin", "date": "August 15, 2003", "id": 1229337}, {"rating": 4.0, "title": "Great Time", "text": "We traveled with out 15 year old son. I was a little concerned about", "user": "A TripAdvisor user", "date": "August 14, 2003", "id": 1227639}, {"rating": 4.0, "title": "Mixed feelings", "text": "the food after reading all the reviews, but we all thougt the food was", "helpfulness": 14, "user": "A TripAdvisor user", "date": "July 31, 2003", "id": 1154700}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "I have just arrived last night from a week on a gorgeous white sand beach, with great staff and services. Food was plentiful and with great variety for meat eaters as well as vegetarians. Lots of super great restaurants to choose from, and if you travel with Transat for your holiday, I received complimentary no reservations cards for 5 specialty restaurants.", "title": "A must read advise before going...", "helpfulness": 4, "user": "Beetlegurl60", "date": "April 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27501397}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My one suggestion before you go... do not forget to pack a bug spray for the feet and legs. I couldn't figure out if the flea like unseen pests were in the sand, the bed, or the ones tickling me in the theatre during the evenings entertainment. Very disconcerting as I did not pack bug spray, nor calamine lotion and the itching, scratching and general discomfort ruined what could have been an exceptional time. Of course those bite marks and huge welts that came with scratching them returned home with me and is still very bad.", "title": "Fantastic resort in the middle of tropical garden", "helpfulness": 2, "user": "MariannMa", "date": "April 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 27385735}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I have made a suggestion to the hotel about them, but better be warned then not!", "title": "Great Holiday, Great Place!!", "helpfulness": 7, "user": "brian157", "date": "April 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 27372174}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Also, if you are single and going \"solo\" like I did, remember that this is a family resort with lots of little children and babies... be forewarned!", "title": "We Love This Resort", "helpfulness": 7, "user": "cjbesq", "date": "March 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27001992}, {"rating": 4.0, "stay_parameters": "Stayed March 2009", "text": "I would try another Fiesta Group hotel for sure.", "title": "Great stay - beautiful wedding!", "helpfulness": 8, "user": "FreddyBeach_Gal", "date": "March 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 26529618}, {"rating": 1.0, "title": "Casino Fiesta", "text": "Gamblers Beware Don t Gamble At the resort casino the owner/manager is a crook what happened is I was gambling and drinking i needed more $ so I used my credit card instead of walking back to the room to get more money they assured me many times that the rate would equal $200.00 US on card but I found out different they got me for $320.00 instead I only recieved $200.00 US I even confronted the manager he admited to scaming tourists and ripping them off after I threated to cancel credit card anyways call the new Local Casino just opened in Dec 2004 they will pick you up from your hotel free you only pay for ride home its called the Towers Casino and it s awsome they have all the latest table and slot machines state of the art, free drinks beautiful place you won t be disapointed it s by the Plaza Bavaro close to all the resorts", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 21, 2004", "id": 2908052}, {"rating": 5.0, "title": "Just returned yesterday!", "text": "I just returned from the Palladium Bavaro last nite. What a wonderful hotel. I'm not sure who can complain about this hotel. The food was great. The buffet is so huge, that if you dont like something, get something else! I found breakfast to be the best meal, fruit smoothes, omelettes made to order. You have many choices with al la carte restaurants so you dont need to buffet every meal.The beach is the best I've seen and I've been to Varadero and Mexico. We did a couple of tours. The Jurassic Park safari was great. Our trip to Catalina Island was a gong show. I know that other groups had a great time but ours had boat problems etc. If you want more details, just email me. The service at the hotel was outstanding. The staff wants to make you happy and always has a smile on their face. I did tip for very outstanding service. I would say you get good service regardless but I just like to do it when someone stands out. We had a romance suite. What a room! Right near the beach, outdoor shower, marble floors and it was huge. If you want details, just ask me. All in all, excellent vacation, excellent hotel and excellent vacation choice.", "helpfulness": 14, "user": "CalgaryGirl", "date": "December 17, 2004", "id": 2887672}, {"rating": 3.0, "title": "Not for the Americans!", "text": "First and foremost--I would not go back to the Palladium Bavaro.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 15, 2004", "id": 2884742}, {"rating": 3.0, "title": "Got engaged! Hard to say...", "text": "I am not a complainer by nature, but compared to Mexico (I have vacationed there 5 times) the service we received at the Palladium was definately lower class! The French vacationers were top priority to the hotel staff. Staff spoke fluent French, but not many spoke English. American's weren't treated very cordially. We wore color coded wrist bands, which I felt were a distasteful measure. This supposedly indicated the country you were from or the language you spoke. (I asked a waitress one day and she informed me of this). In Mexico, the locals laugh, joke and treat everyone with such fun and excellent service. That definately was not the case here. I made the best of our trip, but wouldn't go back.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "December 15, 2004", "id": 2883041}, {"rating": 4.0, "title": "Very good but still room for improvement", "text": "Some people we met on the flight stayed at the Sunscape, and said that the Sunscape even served a Thanksgiving Feast on the beach, on Thanksgiving Day, for the American's staying there. NOT something you would have seen at the Palladium. Other acquaintances stayed at Secrets and have returned there a few times-speak very highly of that resort and the service. Just a bit of advice.", "helpfulness": 7, "user": "TRWCleveland_OH", "date": "December 12, 2004", "id": 2876353}, {"rating": 4.0, "title": "Amazing, we got married here", "text": "We stayed at the palladium myself, my new husband, and my three children aged 13, 12, and 7 from the 6th to the 20th Oct.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 21, 2004", "id": 2771577}, {"rating": 4.0, "title": "the best vacation in my entire life !!!!", "text": "We went to the Dominican expecting to stay in another resort, but thankfully due to hurricain Jeanne our hotel was closed and we we're upgraded to the palladium. We went there with no expectations and we we'rnt dissapointed in any way.", "helpfulness": 2, "user": "novayasapuntacana", "date": "September 28, 2004", "id": 2606487}, {"rating": 5.0, "title": "Can't wait to go back!!!!!", "text": "The wedding was fantastic, the food was lovely, the place was clean, people we're friendly, the entertainment was top class, and well we came back wanting to go again.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "September 27, 2004", "id": 2602827}, {"rating": 1.0, "title": "Punta Cuna - Grand Palladium Resort - mistake for sure", "text": "The only down side for us is we dont speak any spanish and there we're very few english but hey so what next time we will learn a little lingo to get us by.", "helpfulness": 23, "user": "Charles D", "date": "September 24, 2004", "id": 2597521}, {"rating": 5.0, "title": "You are Royalty here", "text": "Please go its fantastic and say HI to JC who looks after the kids and adults alike.", "helpfulness": 12, "user": "OhiotoCaribbean", "date": "September 14, 2004", "id": 2571268}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My husband and I have traveled quite a bit in the Carribean, with this being our second trip to Punta Cana. The last trip we stay at Secrets Excellence. Comparing the two, there were good points to both.", "title": "Not Great.... Not Bad....", "helpfulness": 3, "user": "sperrybella", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16969493, "likes": {"liked": "— lots of variety", "disliked": "— Surveys!!"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Arrival:", "title": "pools close at 7pm", "user": "ttking", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 16794005, "likes": {"liked": "— beach", "disliked": "— the pool scene"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This was the first time that we were ever able to check in our room as soon as we got there. We arrived at 12:00 noon, and was very surprized to be able to start our vacation right away.", "title": "Great vacations", "helpfulness": 4, "user": "Caribenha", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16754179, "likes": {"liked": "— location", "disliked": "— night shows"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Room:", "title": "Eh, not that great", "helpfulness": 2, "user": "perrim", "date": "June 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 16700367, "likes": {"liked": "— beach", "disliked": "— The food, the entertainment"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "We booked the romance suite for our anniversary. I was definitly worth the extra money. The room had a king canopy bed with a sitting area, and a vanity in the main room. The bathroom was large with seperate shower and toilet area. One problem that we had, was that the whirlpool tub did not work. But, the outdoor shower ceratinly made up for it. Our room was 1212. We really liked the location, because it was near the beach. The room was very clean and no other complaints other than the tub.", "title": "Amazing and Unforgettable", "helpfulness": 4, "user": "Marlin1978", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16681651, "likes": {"liked": "— Always something going on day and night", "disliked": "— There seemed to be short minor rolling blackouts in the morning and afternoon"}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 150, "average": 301, "very good": 768, "terrible": 101, "excellent": 1233}, "aka": "Grand Palladium Bavaro", "slim_ranking": 0.435643564356, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Grand Palladium Bavaro Resort & Spa enjoys a privileged, sea-front location on the renowned Playa Bavaro. The resort, located on a sprawling estate of lush tropical vegetation and a coconut plantation, is next to the Grand Palladium Punta Cana Resort & Spa, the Grand Palladium Palace Resort Spa & Casino & Royal Suites. The facilities of these adjoining resorts are open to guests of the Grand Palladium Bavaro (excluding the Royal Suites)."}