{"user_rating": 4.0, "review_count": 1971, "name": "Grand Lido Negril", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My boyfriend and I stayed here for a week in mid-December 2011 and were very happy with the resort for the most part. We went to Negril to relax; to lay on the beach, drink fruity drinks, and de-stress. Breezes was perfect for this.", "title": "Wonderful relaxation!", "helpfulness": 1, "user": "heathergreg", "date": "January 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122381921}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "BEACH: The beach is beautiful (not the best we have seen, such as in Grand Cayman, but still very beautiful and wonderful to swim in.) The pictures posted of the beach online do not do it justice- it's far more beautiful in person. My only complaint would be the water was a little cold for me in December so I couldn't stay in long- though my boyfriend found the temperature perfect. The sun loungers are plentiful and comfortable, and there is plenty of shade if you want it.", "title": "Disappointed in this 4 1/2 Star vacation", "helpfulness": 2, "user": "hmnjacques", "date": "December 28, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 122204933}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "ROOMS: Very clean and comfortable. We had a suite with an ocean view, so that made it even more amazing. AC worked great, lots of cable channels to choose from if you like to watch tv before bed, and no bugs!!:)", "title": "A week get away from all", "helpfulness": 5, "user": "419flora", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122200442}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "SERVICE: Bar service was great. I would recommend bringing a large mug to have them fill up for you though, instead of just taking the tiny little cups of beer/drinks they provide you with. The bartenders are great and will fill up your large mug with whatever drink you want. Also, if you feel they are making the drinks too weak, just ask for it to be stronger and they will accomodate you. MEAL SERVICE WAS ANOTHER STORY... I love pasta, and they had pasta every day at the lunch buffet BUT... instead of leaving it buffet, they take already-cooked pasta, and make you wait in line for 45 minutes (no exaggeration) while they fry it again in a pan (mind you, it's already warm and cooked), so that it falls apart when you try to eat it. VERY frustrating... I would rather they just let me take my own pasta from the bin and pour some sauce over it and be on my way...some things would just be so much faster and easier if they'd let you do them yourself! Also the Reggae Cafe and La Pasta restaurants sometimes took forever to serve you as well...it varied from time to time, but we definitely waited for close to 2 hours at each place on separate nights just to get a burger and fries, or a plate of plain pasta. Also, do NOT let them offer to take your bags to your room for you when you first arrive there... or you will be wasting several hours of potential beach time, just sitting in your room waiting for your luggage containing your bathing suits, while they take their sweet time with your bags and then expect a tip.", "title": "Breezes Grand Negril- 2 weeks and I didnt want to go home!", "helpfulness": 11, "user": "tweetybird24", "date": "December 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 122193269}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "LOCALS: The ones that walk the Breezes beach are perfectly nice. They will serenade you with guitars for tips, and try to sell you cigars, marihuana, etc., but all you have to do is say \"no thank you\" and they smile and say ok and walk away. BEWARE of the vendors if you walk up either side of the beach though- the ones that have their stands of shirts, bags, etc. set up on the beach. Some of them were extremely rude to us when we politely declined to shop with them.", "title": "A Beautiful Place, if a little rough", "helpfulness": 7, "user": "Mark M", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122166625}, {"rating": 5.0, "title": "Soooooo much better than we expected!!!!", "text": "My husband I stayed at GLN June 26th-July 1st. I will try to make it as brief as possible.", "helpfulness": 3, "user": "js2moon1", "date": "July 9, 2009", "id": 34272725}, {"rating": 1.0, "title": "Replace General Manager", "text": "Arrival: On time flight w/Air Jam. Breezed through immigration/customs.", "user": "Ezzie_S", "date": "July 7, 2009", "id": 34178069}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Transport: Waited about 15 minutes after checking in @ Superclubs lounge. Yes, after the luggage is carted off and loaded onto the bus you are expected to give a tip. No problem! A 90 min. ride to Negril with a 10 min. stop in between. I held onto the edge of my seat, but hubby slept the ENTIRE way! We did tip the driver as well. He was informative and got us there in one piece!", "title": "Awesome!", "user": "missmeek", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34121091}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Check-In: We were seated in the lobby with a mimosa and cold towel. The young lady was super nice and had a great smile. Our room was not ready so we went to eat lunch at the buffet.in the Grand Terrazza. Thirty minutes later our room was ready.", "title": "I want to go BACK!!", "helpfulness": 3, "user": "gracielam45", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33612483}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Room: We were placed on the C/O side of the resort, room 1080. My husband and I THOUGHT we were the ultimate prudes. But in Negril,....not so much ;)! We had a fantastic patio that was HUGE! Sure, an occasional birthday suiter walked by our open patio doors. No problem! No need to gawk and stare. As a matter of habit my husband and I made a practice of keeping it moving! The bathroom did have the strange stair thingy to get into the jacuzzi tub/shower. It made for a hilarious event for me at 5'0 to climb in and out. It was better not to use it at all.", "title": "Way, way, way terrific property and vacation, but no cry babies allowed.", "helpfulness": 6, "user": "AtlantaBuster", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33337992}, {"rating": 3.0, "stay_parameters": "Stayed December 2011", "text": "We returned to Breezes for the 5th time. First time since the brand change from Grand Lido. We did get a good deal and I'm really glad we did, otherwise we would be even more disappointed. Started off with not getting our room request. Husband has mobility issues and we had asked for first floor room with walk in shower. Have requested in past and got it with no problem. We even emailed resort and were told that we would get that type room. Got a room on second floor with the step up tub. Tried to no avail to get changed. Decided what the heck, we are here, we will make do.", "title": "Glad I got a bargain", "helpfulness": 2, "user": "mel-rph-cat", "date": "December 20, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 121924485}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "It is sad to see how the resort is deteriorating. We had loose tiles with broken morter on the floors. Tripped a time or 2. They had the same decor as the first time we came almost 6 years ago.", "title": "Destination Wedding Magnificence", "helpfulness": 6, "user": "CHorak", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121894848}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We had excellent service from housekeeping, the person who restocks the fridge, and at the c/o beach bar. Great to see sweet Shenice and Gloria again.", "title": "Breezes, lots can be forgiven if you just smile", "helpfulness": 5, "user": "John C", "date": "December 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121890821}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "We ran into Jerome and really wish he was the still the omelet chef. I never had a fully cooked egg of any kind the entire trip. In fact this is where this resort has really gone downhill. The food. Other than the great food at the c/o bar, the only decent meal we had was at the Italian restaurant. The Japanese was ok, but my steak was raw, not medium rare. We tried to eat at the French, but they wouldn't let my husband in because he didn't have on a collared shirt. Nevermind the fact that he was wearing a silk dress shirt. There were people eating there in tropcal shirts and blue jeans. The beach party and managers buffet were so-so. Not nearly as good as in the past. The other nights we ate at an outdoor buffet set up by the pool because the regular non reservation restaurant had no air conditioning. I don't think we are super picky, but the food was a major disappointment.", "title": "Breezes Negril Is One Of The Best", "helpfulness": 7, "user": "maketheswitch", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121865000}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were pleased with the quality of the liquor. Mainly used the c/o bar and reggae bar. They had great people working at those bars. Sometimes at the main bar the bartenders would just ignore you.", "title": "Satisfied", "helpfulness": 6, "user": "kappycur", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121861797}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I truly am amazed at some of the reviews on here! I can't believe we were at the same place! This place is falling apart--the outside of the buildings are dirty and shingles are falling off, the rooms were dirty. We had ants on the floor, and the shower head was all crusty. There was mold in the corners of the shower. The outside furniture on our balcony and at the outside diner were rusty with stained cushions. It was terrible, and never book through Delta Vacations, because they will definitely overcharge you for it.", "title": "This place is terrible", "helpfulness": 2, "user": "jen2929", "date": "July 15, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 34839162}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Plus, the pool is tiny, with no poolside service. The website is very misleading. DON'T STAY HERE!!", "title": "My Wedding was Excellent!", "helpfulness": 3, "user": "grnidevilnj", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34757132}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I recently had my wedding at Grand Lido Negril. The wedding coordinator, Yvette and photographer, Gary made my wedding perfect! I look forward to going every year with my husband. It has jsut right mix of laid back 'lovers' atmosphere with a good nightlife. We did not want to be somewhere that partied day and night, we wanted some quiet and relaxing time with each other during the day and wanted to keep the upbeat excitement at night, we go the best of both worlds here!", "title": "Nice Vacation, but probably won't go back", "helpfulness": 5, "user": "Kohmann", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 34743854}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Okay, when we booked this resort we thought...5 star...super all inclusive....great!! Overall the resort is nice, but definately old. The people are wonderful and the food is great (except the Cafe Lido - skip it)...La Pasta was really really good!!", "title": "FANTASTIC", "helpfulness": 2, "user": "katstephEngland", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34522452}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The rooms are old...the room categories are misleading though..We paid for a beachfront room and our room was about 100 yard from the beach...hmmmm....they did switch us to a new room but because they originally put us in an oceanview (not what we paid for) it took us an extra hour at least to get to our proper room and then had to switch...grrrr", "title": "zzzzzzzzzzzzzzzzzzzzzzzzz......", "helpfulness": 2, "user": "AmazonStar", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 34341594}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Very relaxing and enjoyable trip once again; my mom has never been to a tropical destination, and when I stayed at the Breezes in April, I knew this would be the place she could enjoy so I planned to take her for her Birthday in December.", "title": "Great 2nd return to the Breezes", "user": "Bridie64", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121992503}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The beach at the Breezes made it very feasable for her to access the water. I have been to a lot of tropical destinations and this is the best beach yet; not too big or overcrowded, and a smooth transition from sand to water.", "title": "Not Braco, but a good alternative", "helpfulness": 4, "user": "poppitb", "date": "December 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121958251}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I was very happy to see she had a single shower and did not have to climb in a tub to have a shower; the Breezes are phasing out the tub/shower system and the new upgraded showers are beautiful.", "title": "12th trip back to Jamaica, worse resort we've been at so far", "helpfulness": 7, "user": "Dianna E", "date": "December 21, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 121956021}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Once again the staff are very accomodating and welcoming and all on first name basis.", "title": "We loved this resort!", "helpfulness": 1, "user": "Jenni R", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 121929775}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I was very happy we were recognized as return customers; we had a bottle of champagne in our room and a reception in the piano lounge on the night of the Managers Gala; which is a beautiful event every Friday night.", "title": "Best resort we've been to in Jamacia", "helpfulness": 7, "user": "Bootiebrew", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121927548}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Previously had been to Breezes Grand Lido 5-6 times so thought we'd try it out since the takeover. Grand Lido itself was in need of repair and changes but now it's becoming serious. It's structurally dangerous in places. A woman fell through the rotting floor on the outside deck and broke her nose before they finally closed the area off and started to put in a new deck. We love to dance but the dance floor is another hazard. Holes everywhere and large spaces between the wooden latts. With high heels, you're at risk, constantly looking down to make sure you're not close to one of those holes! Seriously, are they waiting for someone to break an ankle or what? The entertainment committee mean well but they're at the mercy of an ancient sound system which continuously breaks down. No music after dinner for 2 nights...couldn't believe it. I should have offered them my little CD player which I had brought from home. Our room was very clean, the bed comfortable and we were right off the cove on the ground level. That was good. However, the bathroom is a hazard as well. You have to \"climb\" into the jacuzzi tub to bathe or shower. For someone older or less able, a definite risk. They should rip them out and put in walk-in showers in ALL the rooms, period. Also, some rooms have better showerheads for some reason with more pressure. Unfortunately, our was almost at a trickle so rincing your hair took a long time. The food at Lido was never Grand...which always astounded me as they hosted an international epicurian week a few years ago which our friends went to and loved...great food, great wine. Well it wasn't the usual and now the quality and choice of food has been downgraded as well. We always bring our own wine as we enjoy decent wines and you can't buy a good one at the Breezes. The cocktails are great as is the service. Yes, it's better when you tip and why not? These people are not making great salaries and if a few extra dollars now and then can help, then we should and did. Seriously, they work hard, deserve it and appreciate it. Thanks to so many including Michael, Camille, Keisha, Cleon, O'Rear, Gloria, massage team (sorry! forgot some names!) who always had a warm smile and kind word along with excellent service both with or without tips. REALLY wonderful people. If we never return to Grande, we'll miss them the most! Sadly, if they don't make the necessary changes, we will move on and look elsewhere for another spot. We don't want to but I don't think \"Breezes\" can step up to the plate. Too bad..we'll miss our snorklin' cove!", "title": "Sadly disappointed...", "helpfulness": 11, "user": "Louise C", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122139277}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "If you are looking for a picture perfect vacation--you need look no further. Just returned from Breezes Grand Negril and without a doubt one of the best vacations ever. I do not believe you will find a better valued vacation for your dollar. I rated the property excellent because I could not find anything wrong. By all means, do your comparison shoppng. I do believe you will find yourself at Breezes Grand Negril. From Mr. Macintosh(Manager) too the groundskeepers--you will not find a more dedicated, friendly group of people. They do everything to make sure your vacation is the best. The property was so clean, the beach immaculate, the food and drink was great. I had a fillet there that would equel any steak house in New York. You wish too try a new watersport? The staff are pros and so willing to help in anyway they can--so just go and do it. Or do nothing and just enjoy the beach and the views. If you need something all you have to do is ask and it is done. I can assure you that you will not regret a moment at this property. You will get your money's worth and more. A return trip will be in your future. There is so much more to say but I believe I have made my point. Best of Luck to all.", "title": "You need look no further!!!!", "helpfulness": 11, "user": "romanticsnyc", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122113466}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I have been to Jamaica more than a few times now and this is my second stay on Bloody bay and my first at breezes. Bloody bay is the most beautiful beach in Jamaica. Forget 7 mile. Not sure what all the hype is about because 7 mile is no where near the beach Bloody bay is. I was torn in telling people this because i do not want Bloody bay to get any busier than it is now.", "title": "Good resort, great location.", "helpfulness": 3, "user": "JamaicaDavey", "date": "December 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122113007}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The resort is just fine. im not sure what people expect for under $1500 a person. So for all you complainers spend the extra $1000-2000 dollars and stay elsewhere and guess what you people will find something to complain about there too.", "title": "Wonderful Family Vacation", "helpfulness": 9, "user": "Sandymish", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 122041624}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "Resort has great snorkelling, kayaking, sailing right off the beach. Free snorkelling trips daily and lots of sea-life all near the resort. Beach is excellent and no problems getting chairs or towels if you can drag your lazy a** to the beach before 10 am. Bugs are a minimal issue unless you like to wear perfumes or scented lotions. I received not one bite all week but my wife had several.", "title": "Older rooms...but who stays in the room?", "user": "Tikigod2011", "date": "December 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 122010710}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The food was hit and miss. The buffet was excellant some days, mediocre the next. The constants were the lamb chops at the Reggae cafe in the afternoons. The grilled sausage patties in the mornings were also great. Jamaican patties at the reggae cafe and beach bar were also fantastic. The a`la cartes were very good except the Japanese was underwelming, performance was good but the food was not great.", "title": "Beautiful Property That Needs to Be Completely Renovated", "helpfulness": 5, "user": "RichlandTripsrus", "date": "December 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 122005783}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Nice relaxing stay at GLN. Resort was less than half capacity while there and we felt we were the only ones on the resort at times. The highlights are as follows:", "title": "Nice Stay on Best Beach", "helpfulness": 3, "user": "Bgiants", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35985941}, {"rating": 1.0, "stay_parameters": "Stayed May 2009", "text": "Beach - Superb and clean. Some seaweed because the resort is at the apex of the bay where the waves push into. Staff was out every day burying the seaweed. The beach is long with plenty of room and chairs.", "title": "An Absolutely Horrible Waste of Money!", "helpfulness": 11, "user": "emiejo1967", "date": "July 26, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 35878313}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Beach Bar - Staff was friendly and provided beach service at times. They did tend to run out of fruit or other necessities at times. Popcorn and patties were the only foods available.", "title": "Wonderful, scenic, and peaceful with the best staff", "helpfulness": 2, "user": "daddyocrusto", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35757309}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Resaurants - Reggae Cafe was closed, Italian and French were good, Cafe was the best. Buffet for breakfast and lunch were fine, but not much variety. Treehouse was best for quick meals.", "title": "A definite \"yes\"", "helpfulness": 3, "user": "stokes26", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35643494}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Service - Most staff were attentive and friendly. Had some issues with wait time between courses for French resaurant (20 minutes before someone asked if we wanted dessert) , although they were not busy. Other restaurants were quick and friendly.", "title": "Overall Great Place", "helpfulness": 2, "user": "LOVEbeaches26", "date": "July 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 35519591}, {"rating": 5.0, "stay_parameters": "Stayed February 2009", "text": "I just recently got back from the Dominica Republic after attending my friend wedding which was a mess. This led me to add my comment about my wedding which took place on the 7th Feb 2009. at Grand Lido. My wedding co-ordinator Sophia haughton was fantastic. She was truly born to do this sort of job. My wedding was breath taking and she truly given me my dream wedding. My family and friends up to date is still taking about my wedding.", "title": "Fantastic", "user": "beautifulme9", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 35381967}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Sophia my darling you are one in a million, thanks for your hard work and your jovial personality. The management team at Grand Lido need to reconised this God given talent.", "title": "All inclusive, beautiful beach, great restaurants, incredible staff.", "helpfulness": 1, "user": "JCnewyorkcity", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35187369}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We have been going here every year for 20 years. The staff is amazing..always so happy to see repeat guests and they go out of their way to make sure you have a great time.", "title": "Perfect Wedding!", "helpfulness": 2, "user": "chicagolefty", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35018409}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "All inclusive, beach is beautiful, restaurants are great! If you love tennis or want to learn, be sure to see the residient pro..he is an amazing instructor!!", "title": "Good for the price!", "helpfulness": 2, "user": "crystalbuds", "date": "July 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 34925359}, {"rating": 5.0, "stay_parameters": "Stayed May 2009", "text": "I highly recommend this place", "title": "A beautiful hotel, with beautiful people working and vacationing in happiness", "helpfulness": 6, "user": "CJofNYTravels", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 34890036}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 149, "average": 327, "very good": 658, "terrible": 73, "excellent": 764}, "aka": "Breezes Grand Resort & Spa Negril All Inclusive Hotel Negril", "slim_ranking": 0.440860215054, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}