{"user_rating": 4.5, "review_count": 1373, "name": "Grange Tower Bridge Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "I ended up staying at three London hotels in the past week which were all roughly the same cost and I have to say that The Grange was the best.", "title": "Impressed", "user": "KCS", "date": "March 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153631361}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Loved the lobby. The room was well designed and decorated. The attention to detail was great - small bed lamps, lights to indicate occupied, comfortable bed, a shower cubicle (and separate bath), nice sofa, smart TV etc etc....", "title": "Nice London escape", "user": "helbeluk", "date": "March 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153584159}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I used the 25m pool and gym.", "title": "Grange hotels never disapoint", "helpfulness": 1, "user": "Trazie", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153572973}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Location is not so good (depending on what you are looking for). I would choose this hotel again for sure", "title": "Unusually good for London", "user": "A_Hotel_Visitor", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 153433858}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This turned out to be the Secret Hotel booked through lastminute.com. Hotel nicely presented, modern but still warm and welcoming - staff likewise. Free 25m pool, hot-tub, & sauna were highlight as well as big, soft bed that it was hard to get out of. Free wifi also a bonus. Ideal location 2-minutes walk from Tower Hill, with semi-good views of city skyline - was quiet and almost like you weren't in the city (though quiet pervades the City on the weekend -not sure it would be like that during the week). Didn't eat here, just used bar which, like in all these hotels is rather expensive. There is a Wetherspoon's next door for inexpensive eating and drinking. Would definitely stay again as a base to explore delights of London.", "title": "Lovely hotel - can't wait to stay again!!", "user": "reesyt", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153358765}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "A new hotel which is ECO friendly, the service you receive from the concierge through to reception staff high quality. The rooms are clean, bright, well decorated and furnished, have good facilities (don't move anything in the mini fridge), massive bed, lovely bathrooms. It is quite well located at Tower Bridge £15 taxi ride into the West End. The bar was reasonably priced, just watch out for the 10% service chage if you order away from the bar.", "title": "Clean modern hotel with excellent service", "helpfulness": 1, "user": "Paul D", "date": "February 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 153357959}, {"rating": 4.0, "title": "Pretty decent new build hotel \"could be anywhere in the world though\"", "text": "The only one issue I have is the price of the breakfasts, which are scandalous at £20 each. We walked out of the front door less than a 1 minute walk to the Witherspoons next door where we got a breakfast for £4, which was great quality. It is very much worth the small walk and was full of residents form the hotel, who were doing exactly the same.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 28, 2013", "id": 153357686}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "We would use the hotel again.", "title": "Consistently good", "user": "Johnny K", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 153301689}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Paul Daly", "title": "Fantastic Hotel !!!", "user": "ClareP73", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153271900}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This is a good hotel. Its fairly new so suffers from that fairly bland \"anywhere in the world\" feel to it. Its all good quality and perfectly nice, please understand, its just the same colour and so on as 99% of the hotels in the world.", "title": "Good Location But Average Hotel !", "user": "JenPower", "date": "February 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153236122}, {"rating": 5.0, "title": "Superb value, lovely staff", "text": "I paid £99 on a last minute.com deal and was thrilled to bits with this hotel. Clean, modern, spacious and really well equipped rooms, I really couldn't have asked for anything more. The staff were also quite delightful, which was the icing on the cake. Warmly recommended.", "user": "Mordrydd", "date": "July 17, 2012", "id": 134603835}, {"rating": 4.0, "title": "Value for money", "text": "Great room with modern furniture and en suite. Not a bad location either with the tube and DLR five minutes away. I will seriously consider the hotel for a second visit.", "user": "Bensonsl1", "date": "July 16, 2012", "id": 134567294}, {"rating": 5.0, "title": "Modern", "text": "Not too far from the sights/tube. Good service. Nice room though the bed is awfully firm. Excellent continental breakfast (included in some rates) which far surpassed my expectations: multiple different pastries and breads and a variety of cereals, cheeses (including Brie), juices, yogurt, and fruit. I could find no reason to upgrade to the warm breakfast (full English breakfast plus some other items -- oatmeal, pancakes, waffles, eggs Benedict -- 5 pounds) for the 3 mornings we were there. Never availaved myself of the gym because we spent our days walking the city, but it looked fabulous. Booked the room and airfare together on British Airways.com so I can't completely figure out how much I paid. Would definitely stay here again.", "helpfulness": 1, "user": "keraven", "date": "July 16, 2012", "id": 134559943}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I have stayed in a sister hotel of this before and we booked here mainly for the location. However we were very pleasantly surprised at the standard of the hotel. It looks pretty anonymous from the outside but it is very clean and modern inside. We booked a large twin room as my wife and I were staying with our two small sons and so we wanted a room that could house 4. The room was large and very well decorated with a clean and modern bathroom, and though we overlooked the railway line it was extremely well sound proofed. We arrived early on the Saturday for a single night stay (£150 excluding breakfast) yet our room was ready for us at 11 am in the morning. The spa and swimming pool are excellent and the staff were polite and attentive. The location is very good, just 10 minutes walk from Tower bridge and the tube and though we did not eat in the hotel there are pubs serving food very close, a Tesco express close by and a car park (Minories) 5 minutes walk away which is very cheap at the weekend. I have stayed in many hotels in London for weekend breaks but this is by far the best, I would highly recommend this hotel.", "title": "Excellent hotel", "user": "David B", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134519395}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Booked room for two nights with continental breakfast. Had upgrade which was a good start. Overall service excellent and hotel facilities impressive. Breakfasts really good with plenty of fresh fruit, bakery items, hams,cheeses, smoked salmon etc. Room was spacious and very well resourced. Will definitely use again when having London weekend break.", "title": "Quality at a reasonable price", "user": "Bhamtraveller_7", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134422586}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Just spent 3 nights at this hotel...had a free upgrade to a room with fantastic views. The continental breakfast was excellent and staff were friendly. Sadly didn't have time to use the spa but spoke to other guests who said it was wonderful. I would defiantly stay here again.", "title": "Great hotel, great location", "user": "PaulineBrown", "date": "February 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 153233437}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I stayed at the Grange Hotel Tower Bridge last weekend with my husband and another couple. Overall we found the hotel staff very friendly and the location is good apart from the fact that we happened to be staying on one of the few weekends of the whole year where the Tower Hill tube station (circle line and nearest station to hotel) was closed for maintenance. This meant we had a bit of extra travelling time and every other tube line was really busy as well. Our other friends were staying in Soho and everything was on their doorstep. I've got to admit we were more than a little jealous!", "title": "Great Hotel", "helpfulness": 1, "user": "220Louise", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 153178219}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "On a more positive note the spa was fabulous and even our bathroom was so clean and well equipped with lovely products. I would stay here again but I would check the transport website first for disruption to services.", "title": "Alround excellent", "helpfulness": 1, "user": "just1602", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153050130}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We got a deal through lastminute.com and so there was no breakfast included. This was fine as there are so many lovely cafes nearby.", "title": "Weekend Break - Secret Hotel", "user": "FoodCritic54", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153038381}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This was a second visit. Theb first time we booked it it was through a secret hotel and we were not disappointed. The secind time it was also a secret hotel the dispriction hadnt change so wew knew wh we were booking. The rooms were excellently equipped, and perfect with the exception of the mini bar which is automated and full of goodies my son wanted, we just made sure will had a few treats which didnt cost the earth. The resurant was excellent value and quality with a great kids menu. The staff were always polite and very helpful. The spa swimming pool was out of this world my son spent hours in there. During the week he was resricted to 10 til 12 and then 2 til 4 but no restriction during weekends.", "title": "Fab Hotel, great location", "user": "roxynsw", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153025745}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Hi stayed at the hotel for a few nights, advertised as a 5 star but would say more 4 instead.", "title": "OK", "user": "charlie0161", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 153023046}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Things like only 1 bottle of water left in the room between us with none the day after, I would have expected details such as this from a 5 star hotel. The spa was nice, but the pool so cold we couldnt stay in very long,The concierge team were excellent very friendlyand helpful", "title": "Lovely Hotel", "user": "Liketotravel004", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153015084}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Location is ideal for the Tower, with a great little cafe at the back of the Hotel owned by an Italian family. Note you only get a view of the Tower if you book the most expensive rooms, we were advised we could get one but it would cost an extra £55 + tax.", "title": "Very comfortable.", "user": "TJandLJH", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152981226}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My husband and I have just returned from this hotel and we were both impressed. The hotel would be suitable for all ages, couples and families alike. We were warmly welcomed. The room was clean and modern. The bathroom was beautiful, we did have an issue with the temperature of the water, so I just had a bath, so the water can be mixed and there's a shower in the bath too. We didn't have breakfast as it was too costly, so we popped next door to Weatherspoons which served a breakfast which was good enough for the price.", "title": "Relief when you pass wether spoons", "user": "asreies", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 152979309}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The hotel is in the 'financial district' and a bus ride away from the main areas (Leicester Square, Covent Garden etc), so get an oyster/all day travel card for cheaper travel.", "title": "Great hotel", "user": "falcarragh", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152969059}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "My partner and I stayed here for one night last week after a trip to paris. We were blown away by the hotel having had such a good deal to stay there! Nothing was too much trouble for the staff and they allowed us to check in 2 hours earlier than check in time.", "title": "Unbelievable!", "user": "kattythoo", "date": "July 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134333520}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The room was incredible and the bathroom was luxury. We had room service on arrival and the food and price were excellent.", "title": "Exceeded Expectations", "user": "Robin M", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134221900}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The next morning we used the pool facilities and we were very impressed. The pool was lovely and there was also a jacuzzi, steam room and sauna.", "title": "Relax in the center of london", "user": "Coco R", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134221340}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "We had the continental breakfast and the food was once again great! So much choice and the option of having a cooked breakfast was not needed with the already large amount on offer.", "title": "Peaceful but central", "user": "Caseyella", "date": "July 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 134104045}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Wish we could have stayed for longer and we will definitely be back!", "title": "Hotel Review", "helpfulness": 1, "user": "Mark B", "date": "July 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133981584}, {"rating": 5.0, "title": "Quite good", "text": "Have stayed there a couple of time for business but also good for families. Fairly new hotel, nicely furnished and good sized rooms. I'm there on a corporate rate but the regular rate is good for what you get, particularly for London. Very close to the Tower Bridge, restaurants etc. Has an indoor pool, good gym. The area is being re-developed but is quite cool.", "user": "1freqtraveler", "date": "July 9, 2012", "id": 133911490}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Well, not strictly true, I suppose - the bed was a little to firm for me, but as gripes go, you can't really count that as one! I got a 2 nights for £189 deal through a voucher site and pre paid - I wondered if there would be any problem with this but no, they had my reservation and confirmed it was paid in full without breakfast. As I didn't want to open an account to charge anything to my room, they locked the mini bar there and then which is a very sensible idea! I forgot to ask for a robe and slippers so called from my room and one arrived about 5 minutes later, still warm from the laundry. The bathroom was spotless, thhough the amount of mirrors and scarily clear lighting is a bit of a shock! For a central London room, it was a decent size, having a sofa and table near the window whilst still allowing room to walk around the bed.", "title": "Could not fault it", "user": "sazzra", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133853708}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "All the staff I dealt with were lovely, smiling and appeared cheerful in their work which is a change from a lot of the hotels I've stayed at. All in all, a great stay, I'm planning to book here again for The Moonwalk 2013 just for the extra deep baths and access to steam rooms!", "title": "Before you try anywhere else for a small touch of luxury, try this Hotel.", "helpfulness": 2, "user": "Hawaiiangirl_12", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133770850}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Visited Hampton Court Palace Flower Show. Hotel was clean, quality furnishings in the room. We paid £99.00 per night including full English breakfast for 2 adults, we booked direct with the hotel - late rooms was more expensive. Request your slippers and bathrobes on check-in. Your complimentary newspaper is delivered daily outside your room. Sebastian the receptionist was professional and friendly. Place the do not disturb button on your room if you are in residence. We resided in 1407 on the highest floor of this hotel. The room view overlooked 'The Shard'. The superior room had a king sized bed with a soft mattress topper, soft sheets and hollowfibre pillows (extra pillows in the wardrobe), plenty of task lighting for doing your make-up/hair and 2 hairdryers (bathroom and bedroom) with thin nozzles. Blackout curtains very good. Bathroom size was compact and the corner shower was excellent with Ajala toiletries. Safe, tea making facilities, ironing board and iron in wardrobe, plenty of hangers. Do not open fridge if you are not thinking of consuming contents. Tesco express and Wetherspoons (opens 9am) nearby. Plenty of good breakfast places to eat close by. Full English breakfast in Hotel £20 per person inclusive in our price. We will eat breakfast out next time, as the friendly, polite staff need to be better managed when customers are ordering the optional extras from the menu, we spoke to three different members of staff before our order was acknowledged and understood. The full English buffet (self serve) was in large, covered, heated containers and luke warm, with hot optional items on request. Order your breakfast optional extras as soon as you sit down, ours only took 5 minutes to arrive after ordering, when it was 9:30am. I ordered the eggs Benedict (very good) and my husband ordered extras including fried eggs, black pudding and fried bread, all arrived hot. The cold buffet has plenty of choice and is fresh. Spa and gym looked clean and efficient in basement, although we never had time to use it. Shoe cleaning machine available in lobby. All the staff were courteous and polite. We will certainly look at his chain of hotels again if the price is right.", "title": "Good location, comfortable, clean and modern", "helpfulness": 1, "user": "deltaseven", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133676694}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "WE were very pleased with this hotel. From check-in to checkout, the staff were friendly and professional. The room was clean and comfortable with everything we needed. We used the spa a few times - mainly relaxing in the hot-tub and swimming a few lazy lengths. Really enjoyed the glass elevators - a great view over London as you go up. If you are allocated a room on the lower floors, take the lift to the top anyway - just for the view.", "title": "Value for money London hotel", "user": "markiemarc", "date": "July 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 133664099}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Partner and I stayed from7-5-11 to 7-14-11. We emailed ahead and requested early check in, king bed room with a view and away from elevators. We had 2 queen beds instead of a king but that was fine. View was great---Gherkin, Shard and a bit of Tower Bridge. Free wifi was great. We were able to check in at 10:00 am which was fantastic after an overnight flight. Continental breakfast was included which was also good--meats, cheeses, fruit, cereal, breads, etc. Never had to wait for a table or coffee. Tower Bridge tube station very close. Some reviews have commented on a lack of nearby places to eat or get a drink. That was not our experience. 2 Indian restaurants within a very short walk. Red Chili and Cafe Spice Namaste. Also nearby were Jamies, The Minories, The Chesshire Cheese and a German place. Pub Princess of Prussia practically across the street. We expected to be on the tube a lot and were, which I think is a good way to learn a city. No complaints at all.", "title": "Great Stay--Room 803", "helpfulness": 1, "user": "Westshore", "date": "July 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134979447}, {"rating": 5.0, "title": "Restaurant", "text": "Did not stay in the hotel but had a meal in thr restaurant .We arrived quite late (5 covers) but the staff were most accommodating.The food was first class..try the chicken in strawberry sauce..it actually woks!! Fillet steaks were superb and decor and atmosphere most relaxing...would def be back.", "user": "muscrat007", "date": "July 19, 2012", "id": 134861034}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We loved staying at this hotel. The staff were quick to respond to our needs and the hotel room was great. The breakfast was excellent and, once again, the staff very attentive.", "title": "Definitely worth a return visit", "helpfulness": 1, "user": "3Countries", "date": "July 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134778388}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "This was one of our best hotel experiences in recent years.", "title": "Love this hotel", "user": "digger2", "date": "July 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 134745787}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We were delighted by the beautiful, comfortable room we were given, a executive twin ( see pics) on the 8th floor.", "title": "A Room with a View", "user": "prodbourn", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134626498}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4.5, "variance": {"poor": 46, "average": 109, "very good": 476, "terrible": 25, "excellent": 717}, "aka": "Grange Tower Bridge Hotel London, England", "slim_ranking": 0.139405204461, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Launched in June 2011, the brand new Grange Tower Bridge Hotel redefines luxury accommodation and events facilities within the famous Tower Bridge district. Signature facilities include an expansive Conference and Events Centre, together with a luxurious Wellness Centre offering an extensive range of beauty and holistic treatments. The Grange Tower Bridge incorporates renewable solar and photovoltaic panels, and has an on-site borehole to reduce water consumption – making it one of the most energy-efficient hotels to open in recent years."}