{"user_rating": 4.5, "review_count": 589, "name": "Grand Bohemian Hotel Asheville, Autograph Collection", "reviews": [{"rating": 3.0, "title": "My lasting impression is rude and unorganized service!", "text": "Location is great, atmosphere is fun, if a bit on the cheesy side, room was large and very nice, but the service or lack thereof is what is most memorable. The valet area was a disaster - I even saw a bride in her wedding dress carrying in her own bags!! The bartender was smug, unhelpful and rude actually. The front desk was very non-chalent and it seemed a bit of a nuisance for them for me to be checking in. If you are going to pay these prices, service really needs to be improved. It's almost like they haven't had any training!", "helpfulness": 1, "user": "KimTO", "date": "July 29, 2009", "id": 36138740}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel was very nice, but the last time I was in Asheville 2 years ago I stayed at a B&B that wasn't too far away and Iwe liked it much better. I didn't care for all of the stuffed animals and the antlers in the - a little strange. Kind of crepped me out. The hotel is in a very good location and was clean.", "title": "Nice. But I would suggest a nearby B&B instead instead", "helpfulness": 1, "user": "EileenMS", "date": "July 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35873258}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband & I were looking for an alternative to the Grove Park Inn (wonderful but have stayed there numerous times) and we ran across this little gem. Situated at the gate to the Biltmore House and convenient to downtown, this is a perfect location.", "title": "WOW -- what a little gem!", "user": "GypsyAtLast", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35872679}, {"rating": 5.0, "title": "Fantastic place to stay in Ashville!", "text": "From the moment you walk in the door, you know this is a special place. I've seen the reception area described here as \"small\" and it is not your typical large cavernous area with a row of counter space. It's very intimate with 2 large check-in \"desks\" and is situated directly across from the fireplace/sitting area and in close proximity to the bar and art gallery.", "helpfulness": 1, "user": "NcWill", "date": "July 25, 2009", "id": 35775563}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "What we loved: The decor is wonderful!! Even the hallways are decorated with atypical hotel carpeting, wallcoverings and artwork. Drop dead gorgeous light fixtures and chandeliers. Our sleeping room was very special and featured a gorgeous glass shower door, sunken tub and glass water closet door. Not sure where they came up with the idea of the curtains between the sleeping area and the bathroom area but what an interesting touch. We didn't feel like we were in a \"hotel\" room -- but at the home of a wealthy bohemian old friend. We ate in the Red Stag for dinner one night (in the back, smaller dining room) -- food was FABULOUS (Elk was particularly wonderful). Almost 1 whole wall covered with carrera marble backlit by a red light -- felt like we were in an exclusive hunt club in Germany perhaps. Service was impeccable. The bar area is smaller but lively and fun.", "title": "Great Chic Place", "user": "supportALS", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35685064}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My wife and I stayed here for three nights while touring Biltmore and other sites in Asheville. We were very impressed. We were concerned about room size due to some comments in Trip Advisor. Our bellman, William, was happy to show us two room options. Ours (room 229) was very spacious. Also, I liked the fact that there are two desks at which guests can sit down while they are being registered. A civilized practice I don't recall encountering at any other hotels, even boutique hotels (only a very occasional bed and breakfast will have this thoughtful touch). This place is on the small to medium size (80 rooms in the main building, 20 in the one across the street). The hotel is new, so everything is immaculate and fresh. The decor is wildly imaginative. It is very dark, very Bavarian hunting lodge. I've read some equivocal comments on Trip Advisor about the decor, but I isn't a tasteful, interesting looking place better than one more slice of chain hotel bland? I wouldn't want my house to look like this, but the decor was just about as elegant as I have encountered (I haven't stayed at the Pierre or a St. Regis, but we regularly stay at Ritz-Carltons and Orient Express hotels; the Grand Bohemian beats them in the decor department hands down.", "title": "The Grand Bohemian- A Grand Experience", "helpfulness": 1, "user": "stropertre", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35517001}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I really appreciated the fact that the hotel did not nickel and dime us (Biltmore has a tendency to do that). The internet and in-room movies (limited selection) were free and a wireless keyboard connected to a very large flatscreen TV, which made using the internet fun. I could have left my laptop at home. You had the option of parking at Biltmore Village and saving $15.00 per night which we did. It was a two minute walk to park in an upscale shopping area across the street. A printer in the business center was available at no charge.", "title": "We just spent over a $1000 bucks here, and NO MINI-BAR???", "user": "dqcrazy", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 35035867}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "If you are visiting Biltmore, you cannot find a more convenient location. In all honesty, the Grand Bohemian is just as close as the Inn at Biltmore Estate. A room at the Grand Bohemian can be had for 25-45% less than the Inn at Biltmore. And at the Grand Bohemian, you can have breakfast (or lunch or dinner) at the Corner Kitchen down the street. We thought Corner Kitchen was pricey for dinner, but breakfast was great and a little cheaper than the hotel. Staying at the Grand Bohemian encourages you to sample the town a bit more. I think we would not have done so if we stayed on the Biltmore Estate grounds. If you want to save a few bucks, there is a Hardees and a MacDonald's across the street. However, their presence does not detract from the upscale neighborhood one bit since they are housed in buildings which blend perfectly with the surrounding area. Asheville is a shining example of zoning and land use planning.", "title": "Great funky boutique hotel", "helpfulness": 1, "user": "fiftyisnifty59", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34496472}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The staff at the Grand Bohemian were virtually all very friendly and very professional. For example, the hostess was happy to pour us a couple of cups of coffee when I came down very early after working out. Our waitress at the bar was terrific. We had just a snack at dinner with our drinks since we had some large lunches while we were touring. She was happy to have our shared plate divided and delivered on two plates. She was also happy to serve us at a comfortable sofa in the lobby which we preferred to sitting at the bar. At breakfast, our waiter thoughtfully substituted a black napkin (usually used at dinner) because my wife was wearing black pants and he was concerned that the white napkin used at breakfast might shed on her black slacks. I can't remember a more thoughtful gesture at another hotel at any price.", "title": "If you like Disney does lodge, you'll like the Grand Bo in Asheville...", "helpfulness": 1, "user": "sanyadee", "date": "July 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 34460196}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Our bed was among the most comfortable I have slept in at a hotel.", "title": "we enjoyed our stay at this funky hotel", "helpfulness": 1, "user": "NCreviewer", "date": "July 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 33932757}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "The hotel is a sister property of the Mansion on Forsyth Park so I knew it would be plush and comfortable. I loved how although the property is brand new, it felt like an extension of the Biltmore with its lodge decor, but it still manages to be totally upscale and chic at the same time. The rooms are outstanding to say the least with flat screen TVs with internet access right from the remote. You can also connect to the wireless internet if you have a laptop free of charge, which was nice and unexpected.", "title": "Awesome but Be Advised of a Few Things", "helpfulness": 1, "user": "ashley1165", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33339425}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Be aware, however, that if you book a King room they are in a separate building across the street. At the time I checked in, it was rush hour and the thought of schlepping three bags down a flight of brick steps, across the busy street in 100 degree heat and up another set of brick stairs was daunting. I asked for a room in the main building and got two Queen beds instead and it was much better being a quick elevator ride right to the valet stand and to the restaurant. And as it turns out, the Red Stag restaurant in the hotel is to die for.", "title": "Amazing Service, Thanks Dan!!", "user": "sand214", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33107182}, {"rating": 4.0, "title": "Spoiled Me!", "text": "In addition, unlike most hotels, there is not a collection of still-in-the-theatre and new to DVD movies to purchase. The only onDemand movies available were what is on Starz and the selection wasn't that great.", "user": "off2ctab", "date": "June 17, 2009", "id": 32531646}, {"rating": 5.0, "title": "A Grand Experience", "text": "Also be advised that if you get the notion to have a soda in your room after a long exhausting day, there are no vending machines or soda machines in the hotel. You can get ice, but the only beverages available outside the restaurant or room service is a $5 bottle of water or a bottle of wine in the room. I was a little surprised that the other Kessler hotels I've stayed at have a mini-bar in the room, however, this hotel does not, nor does it have a fridge.", "user": "S Paige", "date": "June 14, 2009", "id": 32280121}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "And finally, there is not a pool, which a lot of travelers like.", "title": "A grand experience . . .", "user": "Sunnybird", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31243822}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This was our 2nd visit as we had stayed before in April right after they first opened and I think they were still working out the kinks. Everyone we encountered while staying at the hotel were very nice, the room was comfortable and clean. My husband loved the Room Lynx with free internet and movies. The fitness room is great with individual Tvs on each cardio machine. Our dinner at the Red Stag Grill was delicious and reasonably priced with great service. The piano in the bar was nice to listen to after dinner with a drink and dessert. We are returning again this upcoming weekend for 2 nights instead of one as we didn't have enough time to try the spa which we hope to do. The only other restaurant we could find that compares to the Red Stag Grill is Rezaz which is across the street, in walking distance. We love the location of this hotel as we never have to drive if we don't want to.", "title": "2nd Visit Even Better!!", "helpfulness": 1, "user": "vacation920", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30881292}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My wife and I stayed here this weekend. They have a unique style and atmosphere going on here that really is GRAND BOHEMIAN. Some of the decor felt a little artificial and some of it was really interesting. The rooms have comfy beds and a big flat screen tv with internet. There isn't much privacy in the bathroom. A curtain separated the enormous deep bathtub from the main part of the room, which was cool, but a little awkward when you have to close the curtain for extra privacy. A fridge would have been great to have in the room. The toilet paper was lousy- you might want to bring your own.", "title": "cool hotel- too expensive", "helpfulness": 1, "user": "thesmellofiron", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 30825277}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "My wife and I had a great dinner at Fig Bistro which is right down the street.", "title": "Nice Hotel - not perfect!", "helpfulness": 1, "user": "TriciafromTX", "date": "May 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30717481}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We had two rooms in this hotel for a visit to the Biltmore Estate and stayed three nights. It's new and has a nice ambience to the lobby. Not quite sure what the effect they're going for but I guess bohemian would describe it well enough. The rooms are average size, nothing special. We all thought it was strange that there are no mini-fridges in the rooms (tastefully hidden of course!). We sometimes like to use them to chill water or a beverage that we've brought back to the room. My room had an issue with stray hairs on the small rug near the sink which I didn't like at all. Called for someone to replace the rug and they were cheerful and did a nice job of cleaning the floor again which I thought was above and beyond. They have in room safes (nice feature) and the beds were very comfortable (though I did find on our first night a black hair which appeared to have been pressed with the sheets (another yucky thing for me...) They need to step it up a notch for the price they charge per night IMO. Parking is a concern unless you're happy with valet parking. We were able to find a place within a block where we could park our rental and the valets gave advice on this topic (nice of them). Overall a good place to stay, so close to the Biltmore, but I'd not stay unless I got a super nightly rate ($100 or so).", "title": "Needs A LOT of work - service and structure", "helpfulness": 2, "user": "bosman09", "date": "May 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 30173653}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The hotel is beautiful and VERY high style - as has been stated in previous reviews. However, some of the style does not WORK. You get poked in the eye by a stylish arrangement of twigs as you get off the elevator on the 3rd floor where our room was located (room 329). The music in the elevator lobby is VERY loud - which is disconcerting early in the morning or 11pm at night. The phone is nowhere near the bed, the alarm clock is a Bose radio, which is great, but it is a long way away from the bed. I like to be able to see the clock from the bed. The bed is fantastic and the room was beautiful, but for a new hotel, the AC was fairly loud. The robes are beautiful as was the bath although the bathroom lighting was too dim. My major complaint was about NOISE. The ballroom is on the 4th floor of this 4 floor hotel, right over our room on the third floor. There was a wedding the night we arrived and it was impossible to sleep with the walls and ceiling vibrating to the bass and drums of the band playing right over our heads. The front desk was not helpful at all and only after two calls did they eventually find a room on the other side of the hotel. RIchard, from the staff was the only person who seemed to care and he was very helpful in resolving the noise issue. They cannot rent the rooms under the ballrooms when they have events there unless to the guests going to the event.", "title": "Wonderful Hotel", "helpfulness": 1, "user": "latravel57", "date": "May 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29549983}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 26, "average": 58, "very good": 144, "terrible": 8, "excellent": 353}, "aka": "Hotel Grand Bohemian", "slim_ranking": 0.206896551724, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}