{"user_rating": 4.5, "review_count": 2655, "name": "Grand Hyatt Kauai Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We loved the grounds of the hotel, the restaurants, the beach, the pools, everything. It was very kid-friendly to our 15 month old and yet still had 'adult only' areas so it was not overrun for those who did not want to deal with young kids at the pool. High class and we would definitely go again.", "title": "High class, worth every penny!", "helpfulness": 2, "user": "BiggChill", "date": "December 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6477369}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "After much research, we decided to stay at the Grand Hyatt during our trip to Kauai from December 6-12. It was a fantastic decision. The grounds are probably the most beautiful we've ever seen -- the pictures on the website don't do it justice. And the pools are incredible. They have a very nicely laid out adult pool with hidden caves and a \"lazy river\" that seems to go on forever. At the end of the adult pool lazy river they have a jacuzzi and a surprisingly long and fast water slide. We spent a lot of time enjoying the water slide, then running up the stairs and heading right down again. Down the stairs from the adult pool area is a HUGE family pool area with another jacuzzi and a artificial beach area. We didn't spend much time on the lower level, but it looked like a blast. The hotel has plenty of beach chairs. You can get free towels (and a wristband for the water slide) from a desk attendant station near the lower pools.", "title": "Great time at the Grand Hyatt", "helpfulness": 19, "user": "Traveling_Terp", "date": "December 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6470724, "likes": {"liked": "— Incredible pool area and grounds", "disliked": "— Rooms were ok"}}, {"rating": 5.0, "title": "Absolute Paradise (travel agents POV)", "text": "We booked a partial ocean view room at the government rate and ended up saving around $1500 versus an ocean view room. Although an ocean view room might have been nice, we just couldn't justify the expense, especially since we spent most of our time out of the room. We did make one mistake -- when we checked in, the clerk told us that they had us in a room with two queen beds. We asked for a room with a single king bed and so they moved us. Before accepting that room, we should have asked about the view. When we saw the room we could have had and compared it against the room we ended up with, we were really depressed because our original room would have had a much nicer view. But we chalked it up to experience, and although the hotel couldn't put us in a nicer room (they were booked solid through our entire trip), they did agree to discount our rate by another $30/day. Very nice folks! As it was, we still had an ocean view -- we just had to go out on our balcony to see it. The room itself was fine. Clean, decently decorated, nothing special, but perfectly adequate.", "helpfulness": 10, "user": "TravelGOGOWWV", "date": "December 14, 2006", "id": 6441311}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The hotel itself is almost as gorgeous as the grounds. There's a beautiful indoor garden in the center, next to a terrace overlooking the ocean. I don't think there's a better view in the place. It's a big hotel but you can get just about everywhere fairly quickly.", "title": "Grand Hyatt Kauai", "helpfulness": 13, "user": "TAG_LA", "date": "December 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6364368, "likes": {"liked": "— pools; overall grounds; location to excursions", "disliked": "— bedding"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We'd heard a lot about the Princeville resort, so we decided to head up there for lunch one day. It's got a great location, and the view can't be beat. But...it's kind of old looking, and the decor is sort of Las Vegas meets Louis XIV. The Hyatt is much more modern and and more comfortable -- you can really relax here. At Princeville, I felt like I was visiting a maiden aunt. I suppose that's why I've heard Princeville is going through a major renovation in the coming year.", "title": "Great resort in every way", "helpfulness": 6, "user": "lindagriffin", "date": "December 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6349263, "likes": {"liked": "— Very comfortable and spacious", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Great Family Hotel!", "text": "We stayed for 8 nights at the Grand Hyatt in December and loved our stay. We have 3 children (4,7,8) and one set of Grandparents came along and all ages loved the stay. The hotel is catered for the honeymooners and families. The salt water lagoon is a perfect spot to lounge the day away as the kids play in the protected and safe lagoon. The ocean is not safe for swimming but a great spot to sit and watch the surfers.", "helpfulness": 9, "user": "littlelulu", "date": "January 9, 2008", "id": 12483015}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "We had a buffet breakfast included in our stay (we booked through Costco Travel, best rate out there at the time) which was the perfect start to each day. The asian restaurant at the golf course connected to the property is great for families, very large portions and great kids menu to pick from. We ate at Roy's one night and all 7 of us enjoyed our meal tremendously. Skip going to Brenneke's, it was not good. For pizza, Brick Oven Pizza is the best and only a 15 minute drive or so. A great spot for an inexpensive dinner is Keoki's nearby the Hyatt and you can sit in the bar with kids and the menu is a lot less expensive than the dining room and you don't need a reservation.", "title": "Beyond Beautiful", "helpfulness": 6, "user": "fiona1028", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12362955, "likes": {"liked": "— pools and grounds", "disliked": "— a casual resturaunt open for dinner"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We went to the Hyatt for our honeymoon 10 years ago and while we were there we thought when we have a family, this would be a great spot for a family vacation! We did it 10 years later and loved every minute of it. The waterslide is a huge hit and the pool was never over crowded as you find at some resorts. The resort is huge but it seems small the way it is laid out. I would highly reccommend this hotel for a family vacation.", "title": "Passed Its Prime", "helpfulness": 20, "user": "CathrynG", "date": "January 2, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 12267078, "likes": {"liked": "— The location", "disliked": "— The lack of service, cleanliness and size of property."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007", "text": "We booked our trip on Hotwire.com and found an excellent rate. Didn't love the flight arrangements, but they were surivable. My mom and I arrived at the hotel and were greeted with beautiful fresh flower leis. When we got to our room we didn't love being on the ground level. (We wanted to be able to sleep with the balcony door open a little) They happily accomidated us and moved us up to the third floor. The grounds were breathtaking! We would get up every morning and walk around the grounds and along the beach. Best way to start the day. The grounds we constantly being swept and groomed and everyone was very helpful. We even asked a groundsmen a question and he stoped what he was doing and walked us to what we were looking for. Very friendly and helpful. We stayed five days and loved every minute of it. Wished we could have stayed longer. Food was a bit expensive, but hey, it's Haiwii. Room service seemed to be our best fit! Breakfeast buffett is awesome. If you can find a package that includes breakfeast, go that route. We didn't and wished we had. Note... The fridges in the rooms are drink coolers only! It won't keep perishables. We spent two whole days by the pools/lagoon! Very relaxing. And not at all crowded. You can always find a quite place to yourselves. Poolside drinks are about $6 or $7, but worth it once or twice! Great poolside cafe! Overall we loved this hotel! We want to return and bring our whole family next time! This place is worth every penny. You'll never regret it!", "title": "Nice grounds, service is average", "helpfulness": 3, "user": "Atlantatravels", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 12224609, "likes": {"liked": "— the grounds and pools", "disliked": "— poor service for hotel of this level"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "We stayed over Christmas week and booked via Hyatt's website in July at a rate of $530/night for a \"garden room\". After taxes and a $15/day resort fee, the room came to approx. $600/night. We are also Gold Passport members (which didn't matter one bit to the Hyatt staff).", "title": "Wonderful sunny respite", "helpfulness": 5, "user": "girl in the middle", "date": "January 1, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 12222763}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "This was our 4th stay at the Grand Hyatt and I'm finally getting around to reviewing it. Everything about this hotel is just so great that I'm not sure where to begin. It has everything that you'd expect from a 5-star hotel, but a little less expensive. We've always stayed here with the kids and, if you ask them, it's their favorite hotel in the world! The pool is huge with something for everyone and they absolutely love Camp Hyatt...they always look forward to seeing Greg and the rest of his great staff. The service is always spot on and they've been very willing to help with anything we want, including getting flowers freeze-dried and shipped to me so I could preserve a beautiful bouquet! Tidepools is our favorite restaurant on the island, but breakfast at Illima Terrace is perfect and I love the Italian restaurant Dondero's. If you're going to Kaua'i with your family, this is the perfect place to stay...if not, there's also an \"adults only\" section of the pool where you can relax in peace :)", "title": "Our Favorite Place in the Islands!", "helpfulness": 11, "user": "KMarie8", "date": "December 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11614485, "likes": {"liked": "— How family friendly it is", "disliked": "— It's a large resort, so depending on where your is you could be walking a ways to breakfast or the pool"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed at the Hyatt on the first leg of our honeymoon. We arrived after a long day of traveling and were greeted with quick check in, an upgrade, and a bottle of champagne. The pools at this hotel are unbelievable. There are so many options and you could just float around forever. The lagoon is amazing also.", "title": "Amazing!!", "helpfulness": 13, "user": "MelissaL81", "date": "December 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 11484949}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The problem with this hotel is the rooms. They are in no way 5 star quality. The bathtub needed refinishing and nothing felt clean, even if it was, because it was beyond outdated. Still, we loved this hotel. We just felt so at home and even though it is huge it never felt that way. We had a first floor room over the pool and we never thought it was noisy like some others had complained.", "title": "Exactly the Hawaii you think of - including price....", "helpfulness": 9, "user": "mishmashAJ", "date": "December 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 11471838, "likes": {"liked": "— beauty of the resort", "disliked": "— prices. I felt like i was nickeled & dimed"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The island of Kauai is paradise. There is not a spot on the island where the view is not amazing. Our favorite part of our stay was exploring the island. You MUST go to the north past Princeville and see the gorgeous beaches and mountains. There are cute small towns and restaurants there and the road ends at a park with beautiful hikes. Just gorgeous. It seemed more rainy up there, so do not even think of staying up North if you want long sunny days.", "title": "Short but Sweet", "helpfulness": 9, "user": "craigtnutz", "date": "December 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 11461041, "likes": {"liked": "— The grounds", "disliked": "— Renovation noise"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We loved the beaches everywhere. Make sure to ask the valet for towels before you leave the hotel.", "title": "Great Service. Fantastic Resort.", "helpfulness": 7, "user": "stattlich", "date": "December 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11432949, "likes": {"liked": "— Facilities", "disliked": "— Exorbitant menu prices"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I stayed at the Hyatt in Kauai as our first part of our honeymoon. As eveyone else states, the grouds are just beautiful. The check-in process was seamless. Our room was a partial oceanview. It overlooked the adult pool and off in the distance, the ocean. Im my opinion I wouldn't book an ocean front room because the hotel is set rather far back from the water. So I am glad we didn't pay all that money for an ocean front room. Our room was comfy and just what we expected. I would have liked it if there was a jacuzzi tub, but none the less it was perfect for us. The breakfast was good. They had a large variety so there was something there for everyone. Made to order omletts to cereal, fresh fruit, fresh juice, miso soup, pancakes, muffins, breads, etc. The beach is rather rough so we didn't attempt to swim there. There were surfers out there. We even saw a monk seal right on our beach! There were a few wedding ceremonies happening right on the beach too. The hotel didn't seem crowded. The man-made lagoon was cool to swim around in and expolore behind little islands and curves. You could rent canoes there if you wanted. The sand by the lagoon was more like little pebbles. I would have liked it if it was a little softer. You need to get bracelets and towels from a little booth. You need a bracelet to ride the slide. The bracets was free and the towels were free. A nice touch would have been to have people setting up your chairs with towels for you. The pool is really neat with little caves and twisting all along waterfalls and flowers, we really like it. We ate at Tidepools and tell the truth we wern't impressed. I got some sort of hawaiin fish. It was good, but I expected better for the price. Better off going to The Beach House. We also got some appetizers and drinks at Stevenson's lounge. It was nice to sit next to a giant fish tank before we retreated back to our room. We also ate breakfast at the restaurant by the golf course. The view was beautiful. That restaurant turns into a Chinese restaurant for dinner. We also ate there one night. It was good. We also made use the of the spa. We got a couples massage in a little hut with the breeze coming in. It was fantastic. Then we layed by the spa pool on comfy chairs with thick pillows. The spa has sauna, hot tub, showers, etc. They have a shower with like 12 spouts, the lady there called it a \"human carwash\"! They aslo have outdoor lava showers. They are pivate and so beautiful to be showering next to lava and plants with an open roof. All in all, we had a fantastic time at the Hyatt and I hightly reccomend it to anyone considering it.", "title": "Loved the Hyatt", "helpfulness": 4, "user": "steph44w", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12761469, "likes": {"liked": "— The grounds, short drive to places", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "was there for our honeymoon the resort was wonderful, loved the pools, clean room, good food, friendly staff, great weather, just the luau got us sick but was a good experience.", "title": "best place ever", "helpfulness": 1, "user": "sweetiepie19", "date": "January 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12664065, "likes": {"liked": "— pools", "disliked": "— how far room from lobby"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "will definelty go back to kauai and stay at the hyatt again, deluxe ocean view room still far from ocean but great views", "title": "Beautiful Hyatt, Kauai", "helpfulness": 4, "user": "MaciEugene", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12618618, "likes": {"liked": "— pool, service, location", "disliked": "— slow pool service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stayed at the Hyatt the first week of January to get away from the cold weather. We had a beautiful stay at the Hyatt in Kauai. We used our AAA card to get the \"sunshine on sale\" package. This allowed us to have the breakfast buffet for no charge (normally 28.00/person, 14.00/children 12 and under). From the check-in to the check-out the service was outstanding. Staff would literally stop what they were doing to help you in any way that they could.", "title": "Nice -- for a big resort", "helpfulness": 4, "user": "SkyeTraveler", "date": "January 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 12531254, "likes": {"liked": "— Location, dining"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The grounds were beautiful and constantly being maintained while we were there. We spent most of our time at the pool and salt water lagoon. Absolutely beautiful! We had no trouble getting chairs as some of the other reviews stated. A tent rental at the beach was 100.00/day and the cabana's by the pool/lagoon were 35.00/day if you wanted to go that way. I think my only complaints would be the lack of staff picking up the towels left on the chairs...or a bin to put your dirty towel in (giving the impression that people were still using them) and the poor food/cocktail service. We sometimes had to wait an hour or more for a drink. We ended up getting our own food/drinks because of the lack of service. The beach always had a red flag (no swimming or extreme caution while swimming), but we did see body boarders and surfers out in the waves. We walked down to Poipu Beach (told by the Hyatt that the only way to get down there was to walk on the main road), only to find out that you can \"cut\" though on a path through some properties. Although we probably weren't suppose to do this, we saw many other vacationers doing this and it was MUCH safer than walking on the side of the road (no sidewalks). Poipu had some great snorkeling and was a perfect family beach.", "title": "Don't forget to hit the hammocks after dinner", "helpfulness": 2, "user": "4bonn", "date": "January 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12526577, "likes": {"liked": "— The resort landscaping and the open architecture of the lobby", "disliked": "— lack of cell phone service in room"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The resort is enormous but the rooms are somewhat on the small side and the lanais are kind of drab and small, especially given the location and views available. The resort also has kind of a fun park vibe. We stayed at the Fairmont in Maui before this and were a little underwhelmed by this resort after that. The service was fine and they were able to give us a hospitality suite on the day we left, which was nice. But there were dirty towels in the room and we were unable to get clean towels delivered before we had to leave to catch our flight. We had a room with the door facing a courtyard with trees, and there were loud birds each morning that started chirping around 6am. The walls and door were thin and they woke me up each morning. Not a huge deal since we generally got up early to go do stuff. But not great on the one morning I wanted to sleep in. Overall, I think we'll try a different hotel next time we visit Kauai.", "title": "Nice resort but has a fun park vibe", "user": "tk211", "date": "October 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 119846566}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed here for the first three nights of our honeymoon and it was AWESOME! The hotel is fairly large for our taste but it was nothing but exceptional. Upon arrival everyone is friendly, the grounds are beautiful, the lobby is open and clean. The rooms are enourmous. The bathrooms are huge. They give you free bottle water and as many towels as you need. If you are a honeymoon couple make sure you let them know. The give you a bottle of champagne which is already in your room when you arrive. Along with the champagne you get a dessert at one of there restaurants and a cabana for the day at the pool or beach. Their pool area, lagoon area, and beach area make you feel as though there are not a ton of people around. The pool is open 24 hours. Whenever you leave the hotel they ask you if you need any towels for the day or bottled water. No questions asked about your room number or restrictions. We ate breakfast everyone morning at the buffet which was the best setting and food we have ever had at a hotel. I cannot say enough about how great this hotel is. I would recommend this hotel to all honeymooners it is well worth the money!", "title": "WOW! Breathtaking! Excellant!", "helpfulness": 1, "user": "KWM10711", "date": "October 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119723643}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Amazing views, Great accomodations & Beautiful landscapes!! This is paradise & we plan on going back in the future. The restaurants are fantastic, salt water lagoon is clutch, staff is helpful & friendly, workout facilities are immaculate... this place is the spot for everyone!!", "title": "\"Incredible & Unforgettable", "user": "Brandon M", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119693380}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I stayed at the Grand Hyatt in Kauai for 5 nights in Oct 2011. It was our 2nd time to Kauai - last time we stayed at the Sheraton (about 5 min from Grand Hyatt).", "title": "Great Experience and Hotel", "user": "Chad K", "date": "October 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "location": 4.0, "service": 5.0}, "id": 119692513}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Grand Hyatt staff is really nice and accomodating. Rooms are clean and ours was right on first floor wo we could walk out room onto the grass and 25 feet to the beech - pay for the upgraded ocean view room!!! This hotel is the nicest on the island and worth the price. If you are not looking for exceptionally nice and willing to pay for it - then this is not the spot. BTW Sheraton is nice, but not nearly as nice as Grand Hyatt (but can save 100-150 per night).", "title": "Fabulous!", "user": "shill629", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119688111}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "This property is absolutely beautiful and impeccably maintained - from the lobby with a large open window looking out to ocean to the lagoons and gardens. And, while it is large, I didn't feel it was hard to get around or impersonal. I got an free upgrade from a Royal Gardens room to partial ocean view because I'm a Hyatt Gold Passport member, which made me very happy!", "title": "Fabulous hotel", "helpfulness": 4, "user": "ao23", "date": "March 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6898987, "likes": {"liked": "— The view from my lanai", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I reserved a poolside cabana for $35 for one day but I felt it was unnecessary. There were also tons of pool chairs available, many under umbrellas.", "title": "Still great, but fading a bit", "helpfulness": 10, "user": "hawaiiroar", "date": "February 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 6843210, "likes": {"liked": "— The resort", "disliked": "— The rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Some other highlights from my stay: I ate at Tidepools and Yum Cha at the Hyatt. Tidepools was the best meal of my trip. The strawberry shortcake dessert is unforgettable. Yum Cha is pretty new but it's interesting to find an Asian tea room located by the golf course. I enjoyed it. I'd also recommend Keoki's Paradise, which is a five minute drive away in the Poipu Shopping Village. It's fun and the seafood was great. I spent a lot of time by the pool but I also took a helicopter ride with Will Squyres which was pricey but worth it. I will never forget the view of the Na Pali coast.", "title": "Lovely hotel but huge compound...", "helpfulness": 9, "user": "SKYtrip", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6819180, "likes": {"liked": "— Good location on the island (less rainfall)", "disliked": "— Large compound, so it's hard to get around"}}, {"rating": 5.0, "title": "Excellent Hotel!", "text": "My wife and I stayed at the Hyatt late January, our third trip there. This resort is still probably the best place to stay in Kauai, just edging out the Princeville because of location convenience. The Hyatt is close to great restaurants, sights, etc. but the Princeville is tucked away up north.", "helpfulness": 10, "user": "Ben8", "date": "February 18, 2007", "id": 6808307}, {"rating": 5.0, "stay_parameters": "Stayed January 2007", "text": "We do love the property. It's stunning without being over-the-top. You can spend your entire time at the pool and lagoon area (but please, definitely see the island). And it amazes me how much fun I have on the waterslide. There's a beach you can't really swim in, especially during the winter months, but you can still enjoy it and climb the hill nearby for some great views of nature.", "title": "It's the Best!", "helpfulness": 10, "user": "TheThreeTravelers", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6780869}, {"rating": 3.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "I use TripAdvisor all of the time, and have thought about writing a review of the Hyatt several times, but now that I’m planning another trip back to the islands it’s made me realize that I really need to write a brief review of the Hyatt.", "title": "I had hoped for more", "helpfulness": 6, "user": "JLane", "date": "January 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6573191, "likes": {"liked": "— The pool", "disliked": "— The refrigerator"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "First, it was beautiful. It did seem a bit like Disneyland, but I was OK with that. I was overwhelmed by its beauty and I think that’s the right way to feel when you first walk into a hotel. We stayed in “cheap” rooms that overlooked the parking lot (I knew not to get a mountain view, but they “upgraded” us when we got there and my husband didn’t want a fuss). The rooms were OK. The bathroom was huge! But the walk to our room got me. If we’d been older, we would’ve needed a cart or something. There were no quick routes to the pool or the front entrance even though you could see them enticing you from across the way.", "title": "Best place to stay on Kauai", "helpfulness": 13, "user": "LAesquared", "date": "January 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6567262, "likes": {"liked": "— The pool", "disliked": "— The beds."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Two of the things that bothered me the most, and why I’m writing this review, is that they charge $12 a day for internet access (I consider that pretty lame since the rooms were really high to begin with). Also, they have refrigerators in the hotel, but after we’d spent $50 or so on breakfast foods and put them all in the refrigerator we realized that the food wasn’t staying cold. When I called the front desk, they told us that all of the refrigerators weren’t working and they were in the processing of completely removing them from the room. Well, a little bit of notice would’ve been nice (it can’t cost that much to print up a note on the refrigerator).", "title": "Fluorescent lighting. . .", "helpfulness": 8, "user": "GreenMermaid", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6558148, "likes": {"liked": "— view of ocean through lobby area", "disliked": "— fluorescent lighting"}}, {"rating": 5.0, "title": "WORTH THE MONEY", "text": "The pool was amazing, however. We spent most of our days relaxing by it. We even found our own little spot that didn’t seem that popular. We also enjoyed the lounges and the food was amazing at Tidepools.", "helpfulness": 10, "user": "KPTexas", "date": "January 5, 2007", "id": 6556394}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I guess all in all it was a great hotel but I wouldn’t go back. I’d try the Princeville instead. I feel like for the money we spent and the fact that it’s the #1 rated hotel, they’d treat us more like quality guests rather than guests of the Quality Inn.", "title": "Grand lived up to its name", "helpfulness": 6, "user": "Linnbada", "date": "January 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6533956}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My wife and I stayed here for four days in November. The hotel was under construction and we asked to be moved from the originally assigned room. I believe we rejected the second choice and settled on the third choice. While the public spaces -- the lobby and the lagoon -- were spectacular, the rooms were nothing to write home about despite a pretty high price. Moreover, at a resort like this with high prices, I find it pretty annoying to feel \"nickled and dimed.\" That is, absolutely every little thing costs more and typically way too much. I understand that when hotels compete on room prices, they make their margin on the extras, but in a resort with (mandatory) resort fees as I think this one was in which the room rate is not low, I'd rather have a few things rolled into the room rate.", "title": "Nice, but not as nice as it should have been given the price", "helpfulness": 2, "user": "letsmakeadeal", "date": "January 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 12208835, "likes": {"liked": "— the view", "disliked": "— the feeling of being nickled and dimed"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "On the positive side was the view from the hotel. From the restaurant where they served breakfast, the view was terrific. The serving staff for breakfast was, if I recall correctly, very helpful. On one day in which they switched breakfast locations due to construction, they couldn't provide all of the items on the menu. They told my wife that they could offer something (poached eggs?) and much later came back deeply apologetic that they had inadvertently mislead her, causing us to wait a long time. They insisted that breakfast would be free.", "title": "Great Hotel-Best in Kauai", "helpfulness": 9, "user": "Phillychic", "date": "December 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12147604}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Grand Hyatt was a great hotel. However, having come from the Four Seasons in Maui, service was just ok. For instance, they asked if we liked champaign for our honeymoon and we said yes, but no champaign ever came to the room. The valets were not as helpful with the car (putting roof up or off on our jeep) like they were in Maui, and you had to get your towels yourself and put them on your chairs. You do not get pampered here. The towels on the chair thing would not have been a big deal if we were not pampered at the Four Seasons. It is what is keeping the Hyatt from a lucury hotel. Our room was standard king size with a balcony. The bathroom was slightly better than an average hotel, but the shower and tub were not separate. Our room was far away from the restaurants, pools, and main lobby. We asked for a different one and they did accomodate us but it only moved it slightly closer.", "title": "Absolutely Great Hotel! Some Minor Work!", "helpfulness": 10, "user": "Ruba786", "date": "December 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 12089800, "likes": {"liked": "— ANARA SPA", "disliked": "— Rooms needs upgrading"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The best part of this hotel is its grounds. The pool and salt water lagoon were very nice. This is important since the beach is not swimmable. There were so many niches and hideaways that you could find a quiet spot at any time during the day. The Captain's Bar was perfect for a nice drink and some pupus. The lobby was gorgeous! It outdid the Four seasons.", "title": "Worth every penny!", "helpfulness": 3, "user": "teif2be", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12008309, "likes": {"liked": "— Everything!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Tidepools is a must. Dinner was delicious and the setting was one in a million. We also loved Stevenson's Library as a great place to go for some sushi on the weekends wihtout needing a reservation. It was nice and dark and relaxing. Dondero's was marginal food. We also ate at Beachhouse-which has great views of the sunset-try and reserve there at 5:30pm.", "title": "Great Hawaiian Resort", "helpfulness": 6, "user": "John_from_SF", "date": "December 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11997345}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The property is amazing. The pools really cannot be adequately explained. They have something for everyone. For little children there is a salt water lagoon, which has a large shallow area. Our toddler was able to play for hours, within our sight, within his comfort zone and without our concern for his safety. The slide is great for a hotel property. They claim you must be 42\" to use it, but my son is 39\" and we had no trouble (I was very involved in his use of the slide, catching him everytime).", "title": "Outstanding, with very little to be desired. Take your young children here.", "helpfulness": 4, "user": "SherryDiversion", "date": "March 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14333861, "likes": {"liked": "— Pool", "disliked": "— Beach (my ideal beach has snorkeling & body surfing - this has some nasty rocks)"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "From our room I spied whales every day (usually mornings) but one. The sound of the ocean was delightful. We were in the west wing (Poipu?). The east wing rooms overlook the 24h pool - not my desire. A friend could barely hear the ocean from their room on the 5th floor, east wing. We slept to it, in the west wing, from the 5th floor. We had manicured grounds and then the beach...", "title": "Simply Paradise !!!", "helpfulness": 4, "user": "Curious_Canucks", "date": "March 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14249819, "likes": {"liked": "— Everything ! Room, pools, restaurants, etc...", "disliked": "— to leave..."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Koi are impressive -ask them at Tidepools (tasty but pricey restaurant) to give you some fish food. It's quite a show. BTW, the wine list at TP's is right out of Costco and 4x the price. The corkage is $20, so I jogged up to the room (long walk) to get a bottle I picked up at Costco, paid for my entre.", "title": "Beautiful Grounds, Mediocre Service", "helpfulness": 7, "user": "KelleyinAustin", "date": "March 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 14234451, "likes": {"liked": "— Pool", "disliked": "— Price, service, beach"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Valet is great. They even offer you beach towels to take with you.", "title": "Fabulous Hotel - Fabulous Island", "helpfulness": 3, "user": "roamingplanet", "date": "March 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 14181482}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "My wife enjoyed the bathroom, toilettries.", "title": "Wonderful Relaxing and Can't Wait to Go Back", "helpfulness": 1, "user": "Soniebug", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14141806, "likes": {"liked": "— The staff was truly remarkable and made every effort to make your staff first class.", "disliked": "— The television in the room."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Pricey but worth it! We felt pampered and welcomed... Staff treated my kids 8 and 10 with an abundance of kindness, sweetness and to lots of fun. These people SAVED our vacation ( caused by the mistreatment we received at Aston Poipu.) We love Hyatt!", "title": "Awesome for our family!", "user": "Twosaint", "date": "October 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119898378}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The hotel was a fantastic place to go with small children. The resort has a spectacular man-made salt water lagoon that includes a small sandy beach arranged with lounge chairs. The lagoon is large enough that one can rent a small kayak to paddle around it. The water is heated to about 85 degrees. Waitresses patrol the lagoon to offer a wide assortment of tropical drinks. Adjacent to the salt water lagoon, there is a large fresh water pool, complete with a water slide. For the more adventuresome, the actual Pacific Ocean is only a stone's throw away (however, the surf can be unpredictable, and there are no lifeguards, in fact someone was rescued while we were there by a hotel guest). The hotel is ideally situated on the warmer, drier side of Kauai, Poipu Beach, (the northern side is much rainier).", "title": "\"the best family resort I've visited", "user": "cdvmanhattanbeach", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119894292}, {"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "This hotel/resort has everything! By far the best place to stay on the lush island of Kauai! I stayed here for the weekend and it was amazing! Rooms are decently sized and equipped with standard amenities. Our room had a beautiful view of the ocean but it was at the very end of the east wing; it took awhile to get back to it because it was so far... The property is massive! It looks like it's a mile in width! The hotel decor is classic and elegant but certain areas are beginning to show their age. The hotel also has a great spa (Portico) and fabulous recreational facilities! Large, and I mean large pool equipped with slides and a section for adults! The adult side was a bit boring though, I'd rather be in the other pool having fun! The beach is minutes away from the pool and we got to see a few monk seals sun bathe right on the beach.", "title": "Best place to stay on the island of Kauai!", "user": "AlohaGuest808", "date": "October 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 119874232}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The restaurants are yummy but a bit on the pricey side with beautiful views and decent selection to choose from. Staff at the hotel were pleasant and personable but I didn't interact with them much on this mini vacation. I do recommend renting a car for a few days because the location of the hotel (Poipu) is a bit isolated. You'll need a car to get to some really great eateries, stores, and hikes. If you are interested in hiking you absolutely must do the Hanakapiai trail, it's beautiful and has a waterfall at the end of one route. The hike is moderately difficult and is about 4 - 5 hrs long and takes approximately 1.5 hrs to get to the hiking location from the hotel.", "title": "Another very nice stay, but the extra$$'s really add up", "helpfulness": 1, "user": "jondf", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119864617}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Overall, great hotel! Nice place to relax and end a vacation :)", "title": "Grand Hyatt Poipu was the best", "user": "Alfdee", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119851327}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I had a wonderful time here.", "title": "Spectacular", "user": "PuritanRoad", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119957246}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The rooms are large and comfortable. The AC is the quietist I have ever experienced, the beds were extremely comfortable. The bath room has recently been renovated and was spacious with double sinks, bath/shower (with rain shower head), and separate toilet. Housekeeping was in and out, while leaving the room sparkling clean.", "title": "Whatta Place!More Like A Four Seasons!", "user": "c0r0nad0family4", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119948210}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The Hotel was spectacular; a multi level lobby that cascades down toward the ocean, lots of shops around the hotel, the pools were fun to explore, the restaurants we tried were fabulous.", "title": "Perfect for corporate event, family vacation or couples trip", "user": "beckyjane_81", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119947884}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Having driven around the Island I would say that the location of the hotel is ideal for day trips or just short excursions, there are a couple of malls with shopping and restaurants near by. There are also some lovely beaches close by", "title": "The Grand Hyatt is the best hotel Ever been to!", "user": "Travelgirl11700", "date": "October 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119914618}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Just finished a week here, had a fabulous time with. Family for 7 great nights. If you have kids , this is the place,.Free scuba lessons in huge salt water pool. Water slides and nice beach adjacent to property . Customer service more like Four Seasons than Hyatt. Ocean front rooms large and beautiful, great gym and spa w easy access from western portion of hotel. Great restaurants near by , didn't eat at resort as looked very expensive, but grounds are expansive w lots of places to chill.We had a wifi problem and were comped a huge gift basket for our trouble. received two nights free w Hyatt Visa card signup a savings of $700.00 to say nothing about the free spa access, ($60.00 value) This place rocks, especially for families w young kids.We look forward to returning soon!", "title": "Perfect stay at the Grand Hyatt", "user": "selise1222", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119914473}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "When you think of the perfect Hawaiian vacation, this is the place you see in your mind's eye. When you walk in and look across the lobby, you're greeted by a massive, open-air view of the Pacific Ocean. It gets better from there. The resort backs up against a quaint beach, great for sunbathing, a bit of swimming or some boarding. There are pools galore, a great golf course, nice tennis facility. Great food.. Immaculate rooms. Nice service. There was rain in the forecast on the night we scheduled the luau, so it was held in a banquet hall. Wish they'd given us a chance to get a refund. Also, the spa is outlandishly priced, even for the top-of-the-line facility it is. But these two minor missteps weren't enough to tarnish what will go down as one of our greatest vacations. We can't wait to return.", "title": "A week in paradise", "user": "holly049", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120045627}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Beautiful resort with clean spacious rooms and killer views. Lots to do on property when you just don't want to go anywhere.", "title": "Perfect!", "user": "trvler3254", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120031092}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "we had a blast on the 2nd part of our honeymoon at the hyatt in kauai in nov. '10. they LOVE honeymooners and give you some perks, including a free bottle of chamapagne! the property is large with mulitple restaurants and pools. a small but gorgeous beach is just a few steps away. definitely book an ocean facing room. the staff were extremely nice from check in to the bartenders at the tiki bar. they really make your honeymoon experience amazing. tidepools on the property is very good and actually very resonably priced!", "title": "amazing hotel", "user": "Whitney D", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120022586}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "we recommend renting a car to explore the island. the island is so beautiful and its a shame to spend all your days at the resort. drive up to the northern part of the island and see the beginning of the napali coast. go ziplining. eat at the beach house - best view!! - make reservation and request table with the best view. take a helicopter ride to view the entire island.", "title": "Elegant Hawaiiana", "user": "misskauai", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119988404}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is a beautiful property! It is elegant but feels homey. A real Hawaiian feel. As soon as you walk into the lobby you see the window to the ocean, Wow! There are waterfalls and Koi ponds and amazing grounds. The salt water lagoon is yummy! It's like floating in a warm soft water tub but you can here the ocean. It is my favorite spot. The Anara Spa has really special treatments in the Lokahi gardens that will take your breath away. Everyone wants to stay the night out there. If you want a special treat , treat yourself to the Garden!!", "title": "True Paradise!", "user": "Jtbrnc", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119966115}, {"rating": 5.0, "title": "Best on Kauai", "text": "This is a fantastic hotel, you can't find a nicer property on Kauai and maybe not in all of Hawaii. The grounds are beautiful, the pools and pool area, the heated saltwater lagoon and the beach are all fantastic. Great service, beautiful lobby and restaurants, tennis courts, proximity to golf, its all great, I cannot recommend this hotel more. The rooms are not at a 5-star level but we were not in our room at all the rest of the hotel is just fantastic, rooms are more like a 4 star.", "helpfulness": 8, "user": "adrock3000", "date": "February 5, 2007", "id": 6747992}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Overall, my husband and I enjoyed our time at the Grand Hyatt Kauai very much. However, for the price paid, the hotel did not deliver against my expectations. I should note that I am very particular about hotels. As a result, I splurge on luxury hotels for vacations and have stayed at some of the best properties in the U.S. The Grand Hyatt's price point puts it on par with hotels like the Park Hyatt, Four Seasons, etc., but the experience does not match those properties. With a few tweaks, the hotel could be 5- star, but right now, I would rate it 4-star.", "title": "Not Quite 5-Star", "helpfulness": 11, "user": "bp08", "date": "February 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6743349}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "First, I should note that the grounds are spectacular and one of the best I've seen. The service was warm and personable. I was in Kauai for my wedding anniversary and I was upgraded (after I asked) one level from a royal garden to a partial ocean view. I was also given a certificate for free champagne, which was extremely nice of the staff. The service was wonderful.", "title": "Beautiful grounds, rooms dissapointing", "helpfulness": 14, "user": "y2krep", "date": "January 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 6718891, "likes": {"liked": "— The grounds, views", "disliked": "— Noise!"}}, {"rating": 5.0, "title": "Great service", "text": "The issues are with the rooms - just average. As others on the board have noted, they need a makeover. They look dated (despite the fact I was told they had recently been renovated) and the beds were uncomfortable. The bedding was also not reflective of a $500+/night hotel. The sheets were particularly soft and the comforter was made of some itchy nylon fabric. I used a tip from someone on the board and asked housekeeping to make the bed with a blanket over the mattress pad to try to make it softer and completely ditched the comforter. It helped.", "helpfulness": 12, "user": "Travellingbug07", "date": "January 28, 2007", "id": 6705922}, {"rating": 5.0, "title": "Loved the Grand Hyatt", "text": "Also, it would have been great to have more service and better chairs at the pools. The only comfortable chairs are at the adults' pool. You have to set your beach chairs up yourself, which is not common at this price point. And, the staff actually asks you to return the towels to a central location, which can be a bit of a hike given the vast grounds. A waitress gave me the tip that I could just leave them and someone would pick them up.", "helpfulness": 14, "user": "lbgirl", "date": "January 19, 2007", "id": 6622595}, {"rating": 4.0, "title": "Spectacular", "text": "This place is amazing & were it not for the fact that my wife & I moved on to the Four Seasons - Maui, I would give this place 5 stars...but it just doesn't feel right. That being said....the sevice was amazing, the staff was very friendly & willing to please. Concierge was a huge help. We found the ocean view rooms to be pleasant - but nothing to truly brag about in the room. This is a big family/honeymoon kind of place, so if you're not looking for that then reconsider. The pool is tremendous. Coll lagoon for kids. The grounds are beautiful & we were able to always get a cabana (the free ones not the $100 daily rentals) near the upper more adult pool. You really cant swim in the ocean near the hotel - there are other beaches a short drive away. MY ONLY COMPLAINT was the pricing of food. This applies to not only the hotel but to surrounding area restaurants, I felt as though food was way overpriced, especially for the quality. The best deal was the breakfast buffet served in the hotel @ $25/person w/ an omelette station (our plan incl this - \"Sunshine breakfast\" plan). One last recommendation - hit the BEACH HOUSE for a sunset. Enjoy", "user": "taddona", "date": "May 12, 2005", "id": 3466126}, {"rating": 5.0, "title": "The Hyatt, It was just right for us...", "text": "We stayed at the Hyatt for 9 nights and enjoyed every moment. Short strolls on the beach, turtle and surfer watching are all within minutes from your room. Spectacular grounds, pools and food make this a resort difficult to leave. Since we had our 7 year old in tow, it was difficult to convince her to leave the majestic pools and waterslide for the tourist sights like Waimea canyon, SpoutingHorn, NapaliCoast, etc. That was it for the downside of the hotel, it was hard to leave the pools since we were all having so much fun. The food is great, especially the buffet breakfast at Illma Terrace which looks out onto the grounds and the ocean. Yes, the hotel is pricey, but you get what you pay for. I like the idea of a safe in the room, high-speed internet, and accomodating staff on-site.", "user": "Misterski", "date": "May 7, 2005", "id": 3447335}, {"rating": 5.0, "title": "Hyatt Kauai...Paradise Found", "text": "I had to submit a review of this resort because it is by far the most fantastic resort we have had the good fortune of experiencing. My wife and I stayed here for our honeymoon in June of 2004. We spent our first week at the Hyatt Maui and thought that was incredible and hard to beat. Well, the Hyatt Kauai just blew us away with its' magnificent beauty and attention to detail service. We found it hard to explore the rest of this gorgeous island because we didn't want to leave the resort, no kidding it's that nice. We did of course travel the island (how can you not) but coming back to the Hyatt was the highlight of the day. We loved our late afternoon drink(s) at Stevenson's Library and dinner on the outside terrace at Dondero's is a must. We are still talking about this place like it was yesterday. We will definitely return to this paradise in the Pacific someday. Don't hesitate in choosing this resort. Sure it's expensive but you will understand why when you get there. There is nothing left to the imagination, it's all right there for you.", "user": "brilan4", "date": "May 1, 2005", "id": 3429601}, {"rating": 5.0, "title": "Unforgettable experience", "text": "From the moment we arrived we felt relaxed and in awe. My wife and I spent our hoenymoon at the Hyatt and it was awesome. THe view of the ocean welcomes you as soon as you arrive in the hotel lobby. All of the architecture is stunning and open to the beautiful breezes of Poi'pu. The pools are extensive and there is an adult pool area for added privacy. The beach that lies in front of the property was not crowded and safe to be on even at night.", "user": "TexanForVacation", "date": "April 11, 2005", "id": 3350635}, {"rating": 5.0, "title": "The Hyatt continues to perform admirably", "text": "We had the sunshine on sale package and we enjoyed our breakfast each morning at the Poi'pu bay golf club. It was a great meal and wonderful service. Say hi to Willie for us. The view of the 18th green was spectacular even for a non-golfer.", "user": "Stumblefoot", "date": "March 24, 2005", "id": 3299675}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed at the Grand Hyatt for 5 days in February after spending a week in Maui. The resort was beautiful and we were treated to an upgrade to an Ocean Front 2-room suite when we had only paid for a Garden Room! We actually have no idea how that happened as we hadn't even had the opportunity to ask for an upgrade yet as we checked in. We felt very cared for during our stay. When you arrive at the resort for the first time or from an excursion the valet service is included and they even put our Jeep top up and down for us. Our room was absolutely amazing as it should be as its normal price is around $800 per night during the peak season. We had a living room/dining room, wet bar, beautiful bedroom and a luxurious bathroom with a Jacuzzi, dual vanity and flat screen TV! The bed was very comfortable and the turn down service each night was a nice touch. We loved our turn down attendant Olivia. She was so sweet and always made sure we were comfortable. We had a very large lanai overlooking the grounds and ocean. The pools as everyone else says are too amazing to explain in words. The lazy current can carry you from one pool to another and the salt water lagoon is so relaxing. We spent many hours just floating around on our rafts in the lagoon. We also enjoyed he water slide. We also spent time at Stevenson’s Library at night which is a lounge with live music and two pool tables that were never busy. The dinner at Tidepools was memorable mostly because our table overlooked the Koi Pond (most seats do) and we had a great time watching these large fish swim around, jump and eat. I personally fell in love with the tropical birds they have in the lobby. I HIGHLY recommend this resort and my husband and I are planning to return someday. I’d be happy to answer any questions anyone has.", "title": "Heaven on Earth!", "helpfulness": 3, "user": "BornToTravel", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14753785, "likes": {"liked": "— Relaxing Pools, saltwater laggon, our room!", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We went to the Hyatt last August, and despite a hurricane, had a wonderful time. We thought the lobby was unbelievable- they way it opened up to the beach, with a large balcony, and garden on the inside.", "title": "Wonderful, perfect stay - with great service", "helpfulness": 3, "user": "wvtraveler64", "date": "March 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 14670759}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Highlights", "title": "Hyatt Kauai", "helpfulness": 1, "user": "mayflower57", "date": "March 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14664473, "likes": {"liked": "— Gardens", "disliked": "— too big"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "*Wonderful, friendly service. The bellhops were great, as were the concierge services.", "title": "Truly World Class", "helpfulness": 1, "user": "sdbdj", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14621640, "likes": {"liked": "— Grounds", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "* Our room was always spotless, with a great bathroom with double vanity and a great closet", "title": "Absolutely gorgeous and relaxing...perfect location..but...", "helpfulness": 1, "user": "hyperchickmom", "date": "March 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 14564494, "likes": {"liked": "— The tropical setting and location", "disliked": "— musty room smell"}}, {"rating": 5.0, "title": "a piece of heaven on earth", "text": "I just returned from two weeks in Hawaii. Three nights in oahu, six nights in Kauai and five nights in Maui. The Hyatt in Kauai is definitely like heaven on earth. You feel as if the staff is there to cater to your every wish. So unlike that hell hole in maui which they call the Hyatt. That hotel is so overly crowded with people and you have to wait forever for anything. I should have stayed in maui first so I wouldnt' have been so spoiled by the service at the hyatt Kauai. The people there are amazing. They just want to please you in anyway that they can. I don't care what the cost of this place was it was worth every penny. The pools are so wonderful that my wife and i found secluded spots each and every day and felt like we were on a deserted island. It was like a second honeymoon and we have been married 27 years. I can ramble on and on but if you have any specific questions about either this hyatt or the one in Maui or the hilton hawaiian village in wakiki email me at marshall531@hotmail.com", "user": "A TripAdvisor user", "date": "March 22, 2005", "id": 3294752}, {"rating": 4.0, "title": "Beautiful pool but way too expensive and crowded", "text": "Family and I stayed at this hotel for two weeks in February. We had two adjoining rooms. As everyone knows, this Hyatt has ordinary rooms with extraordinary grounds. The pools are lovely and kids have a blast. However, even with the new \"mandatory resort fee,\" you are still paying way too much for what you receive. At $100 for a family breakfast, we quickly learned to head to Big Save (5 min away) for coffee, juice, milk, fruit, and baked goods. The hotel was also absolutely packed. There were times when you could not get lounges by the lower (kid's) pool. We ate in Stevenson's a couple of nights because the bar menu is a better bargain than the restaurants. Also, Donderos and Tidepools were sort of rushed, and not at all like what I remember from our stay in 2000. There is a ton of traffic on Kauai so beware of making far away dinner reservations. The Poipu area has many choices though, and Roys offered far and away the best food we ate. Just remember that the Hyatt gives away nothing for free - no morning coffee urns in the lobby (like at all other Hyatts and many hotels), no newspapers to peruse, lobby crafts (you need to tip the people there), no water toys or rafts, etc. It was actually so expensive that we couldn't fully enjoy the place. Good luck!", "user": "usact", "date": "March 17, 2005", "id": 3282214}, {"rating": 4.0, "title": "Incredible pool and grounds!", "text": "The Hyatt Regency Pouipu Resort has the most beautiful pool and grounds in Kauai. I have been to Kauai four times and this by far is the prettiest place we have stayed. The pool is tropical rivers that follows the entire back of the Resort with pools and waterfalls along the way. There is something for everyone. Quiet little private pools and spas appear while you are traveling down the rivers. If you have children there are slides and areas dedicated to children. In the evening, you can swim in the quiet salt pond that overlooks the beach and ocean lit only by the moon and torches. The hotel has clean quiet rooms with large baths and pretty views. The staff at the hotel is helpful and friendly. Highly recommend this beautiful resort.", "user": "notme11", "date": "March 17, 2005", "id": 3279559}, {"rating": 4.0, "title": "Good, but very expensive", "text": "I paid almost $400/night at this hotel; could have paid less and gotten more at the Ritz (maui) or Mandarin (Oahu). Service was good, but very impersonal. The staff did not address the guests in the hallways. The parking attendants were very cold. Not enough shaded areas by the pool. Grounds were beautiful. Rooms were above average, but nothing luxurious. The 6pm guitar performances were great.", "user": "jdsu", "date": "March 12, 2005", "id": 3268685}, {"rating": 5.0, "title": "Loved the service", "text": "Re: Grossmont Travel (-----------) Be very careful about booking with this company. They will pull a bait and switch technique on you. The agent will provide you with a package of hotel, air, car, and breakfast. He'll then ask you to make a decision right away so as not to lose this \"great\" deal. But what he offers in the contract, will be totally different than what he promised; I made the mistake of assuming I would get everything he offered, but it turned out that the earlier enticements were missing on the contract. I ended up paying for the same price and receiving less than promised. Then, he adamantly denied that he made any promises and treated me like a liar. Luckily, I had all the papers to prove his dishonesty. So, buyer beware, just be very careful and don't rush into any contract. I made a mistake of trusting their initial promises. And stay away from this company.", "user": "A TripAdvisor user", "date": "March 9, 2005", "id": 3262848}, {"rating": 5.0, "title": "fab", "text": "For a total beach-front resort package, this place can't be beat. We spent five nights here in February. The grounds are fabulously landscaped, and include pools and lagoons. There's lots of bird life. You'll never forget the view from the terrace bar. The beach is great. The entire resort is classy and quiet. Service isn't always the best--they could use some lessons on running a breakfast buffet. The cable TV system is poor. The place sprawls out so that you have long walks from your room to the restaurants. Be careful picking a room, there are a lot of rooms without good views. But if we were coming back to the island, we'd stay here.", "helpfulness": 1, "user": "bigredjohn", "date": "March 5, 2008", "id": 14082657}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Stayed at the Kauai Grand Hyatt last week for four nights in an oceanfront suite. The room was a bit outdated and the view was certainly NOT oceanfront.", "title": "We liked the Grand Hyatt but the rooms are a bit outdated.", "user": "Janiekins53", "date": "March 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 14045377}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The landscaping and grounds at this hotel are absolutely beautiful. We ate at Tidepools restaurants which was terrific.", "title": "One of the best", "helpfulness": 1, "user": "CA-MR", "date": "March 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14021184, "likes": {"liked": "— the grounds were beautiful", "disliked": "— price - everything is extra"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We would definitely stay here again.", "title": "Loved the Grand Hyatt, but watch your belongings at the pool", "helpfulness": 3, "user": "haledog", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 13997640}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The architecture of the Grand Hyatt is quietly beautiful. Unlike some of the glitzy places we saw on Maui, this hotel had unpretentious elegance. The beach, the pools, the gardens were all well maintained and seemed to epitomize why one goes to Hawaii. My only complaint is that it's expensive. After paying more than $300 per night, you would think we could print out our boarding passes without paying a minimum of $15. A small strawberry smoothie at the cafe cost $9. But Kauai in general is expensive. Anyway, the grounds are large, beautiful, lots of activities, and it never felt crowded.", "title": "Best on the island", "helpfulness": 4, "user": "andrew_branham", "date": "March 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 13954358, "likes": {"liked": "— pool", "disliked": "— rooms need updated"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Travelling from the U.K we wanted things to be perfect, and this hotel met that criteria.", "title": "One word - beautiful.", "helpfulness": 2, "user": "PlymouthPilgrims", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14543090, "likes": {"liked": "— Just a fine hotel with lovely staff.", "disliked": "— Too far away from U.K!!"}}, {"rating": 4.0, "title": "Beautiful grounds...ok room", "text": "Last year we stayed at the Moana Surfrider in Waikiki (again, wonderful) and the not so wonderful Westin in Maui.", "helpfulness": 2, "user": "lucks27", "date": "March 25, 2008", "id": 14508702}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "Kauai in our view if far more beautiful than Maui and the Grand Hyatt is heaps better than the bigger and brasher Westin Maui.", "title": "First Class all the way!", "helpfulness": 1, "user": "Lovehawaiisomuch", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14501015, "likes": {"liked": "— The atmosphere", "disliked": "— I loved everything"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Very well kept, lovely layout and the rooms were a credit to those that look after them.", "title": "Beautiful pool but flaws everywhere else.", "helpfulness": 3, "user": "Traveldiva1969", "date": "March 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14432434, "likes": {"liked": "— Pool is lovely-beds were very snuggly", "disliked": "— Lack of consistancy"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Last time in the Hawaiian Islands for us, as it is a very big planet out there, but Kauai was a big hit.", "title": "Vacation in Paradise", "helpfulness": 2, "user": "CRCMPW", "date": "March 20, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14413762, "likes": {"liked": "— Upper Class Setting and Luxury", "disliked": "— Front Desk at Check-In"}}, {"rating": 5.0, "title": "Outstanding!", "text": "We just returned from a 7 night stay at the Hyatt Regency Kauai. (2/19/05 thru 2/26/05) We travelled with a total of 13 people (8 adults and 5 kids). We were greeted by Mailika at the front desk and she was marvellous. Extremely nice, personable, and overflowing with the spirit of Aloha. Just what we needed after 20 hours of traveling. During our stay, we experienced the pools, lagoons, hot tubs, Tidepools Restauraunt, The Dock, Ilima Terrace every morning for breakfast, the Drums of Paradise Luau, Stevenson's Library, and the Anara Spa. The only thing that was less than FANTASTIC was the dinner at Tidepools. Service was only so-so as well as the meal. Everything else, room included, was exceptional. From the promptness of the valets to the warm greeting every morning at breakfast we felt like we were catered to. After the 2nd morning, if we had the same wait staff, they would already have our drinks waiting for us and would ask us how our activities from the previous day had gone. I can not imagine the bad experience others have listed because ours was almost flawless. The grounds were well kept and we ALWAYS saw someone trimming shrubbery, cleaning pools, or polishing brass. If there is anything negative to say, it's that it is expensive. Don't expect to eat, drink, or shop there if you are looking for bargins. However, if your budget allows, I would recommend the Hyatt to anyone (and everyone) I know. The adults loved it, and if possible, the kids loved it more. Between the lagoon, the pools, the slide, and the hot tub, I thought they all might start growing gills. Mahalo to the entire Hyatt Staff. We had a GREAT time.", "helpfulness": 10, "user": "OBHF", "date": "March 1, 2005", "id": 3238749}, {"rating": 1.0, "title": "disgusting, horrible service", "text": "Here it goes........ We arrived at the hotel in the afternoon and were greeted with leis upon entering. When our bellman escorted us to our room -- we walked for about 10-15 minutes to get there from the lobby -- there were bugs and geckos on the walls leading to our ocean-view-ground floor room. Upon entering our room we saw silverfish and mosquitoes on the walls, on the bed and even on the phone!! We called the front desk and we were told the manager would get back to us shortly. In the meantime, they sent over some housekeepers with bug spray to spray our rooms and kill the bugs. After a few hours of waiting we were getting hungry -- so we decided to order room service -- we ordered 2 salads and was told it would take 45 minutes to an hour for delivery ... fine.. We were starving and still waiting for a manager to get back to us so we didn't want to leave. After an hour and a half our salads came and the manager finally called us to tell us we would have to wait until the morning to get our room changed. The fact that we had to stay in that room for 1 entire night made me sick!! Also, by the time management got back to us the night was over -- we waited hours to speak to someone and ended up spending our first night in Kauai frustrated, upset and going back and forth with the front desk and a manager. We also noticed that other guests were stuffing the bottom of their doors with towels to keep the bugs and geckos from crawling in! They are supposed to be an above quality hotel, I nor any other guest should have to do this while staying there! The next morning, we spoke with 2 of the managers --Now a full night and the start of our first day relaying frustration to managers, we decided to forget what had happened and start fresh. The Hyatt made it impossible. EVERYDAY we stayed at this hotel it was miserable and a different occurrence happened. There were green bugs in my scrambled eggs at the buffet breakfast, the daiquiris tasted like sour pink lemonade, I had called the front desk to ask where the closest laundry facilities were to my room because I had 3 bags to carry. I was directed to a room in which there were no washing machines/dryers. There was a sign on the door that said it was being upgraded and to go to the other side of the hotel. This is frustrating since I called especially not to be inconvenienced, it also shows me that the staff is uninformed!! The next night we dined at Tidepools--my shrimp had to be sent back because, yet again, there were bugs in it. When we checked our car in valet it was put under the wrong name delaying us 25 minutes because my husband had to go with the man to pick out our car in the lot. During the next couple of days the managers did not even check in with us to see how everything was doing nor did they offer any compensation of any kind after the room incident--we did get to move our room to a higher floor in hopes of no bugs. The final straw was when we booked ATV tours and were supposed to get picked up at 7:45AM --we were out front waiting.....one of the valet men asked us if he could help us --I told him no thank you we were waiting for our tour to pick us up. At around 8:00 I went inside and asked the concierge if they would please call the tour company because they were late. The response I received was \"If you would have asked anyone they would have told you that you are at the wrong entrance.\" This response was uncalled for and rude!! When the tour operator came back to pick us up she told us she had called the concierge and valet to ask if anyone was waiting out front because apparently this happens a lot. No one bothered to check. We had to leave the hotel only to be irritated at the start of our tour and day--and LATE!! When we arrived back at the hotel we AGAIN had to spend time talking with the managers and informing them of what was going wrong with our stay. one of the managers asked us what he can do to make it all better. At this point we were leaving the next day and I told him that I only thought it was fair to comp us for our miserable stay to which we spent more time talking to their managers and being aggravated then enjoying the beautiful island of Kauai. he said he would talk to the manager above him and get back to us. We were again inconvenienced by having to make another appointment. The outcome was, the last day we were there, 1 hour before leaving, We were offered $150.00 in compensation for our horrible stay--this is a smack in the face and quite frankly an insult to my intelligence. When we expressed we thought this was unfair of course, the manager was unavailable. We paid in full with no compensation -- including $15.00 a day for valet. I have traveled all over the world--I have been to every island in the Caribbean, I have traveled extensively through Europe, North and South America --I HAVE NEVER RECEIVED SUCH BAD SERVICE AS I DID AT THIS HOTEL... I have stayed in Holiday Inns that had better management and staff. We spent a lot of money to stay at this hotel and as far as I'm concerned I have stayed at hostels that were better l!! I told my husband that I didn't think the manager would do much for us because he never followed up with us and didn't do anything for us from the start. What he did tell us was that the hotel was renovated and they didn't raise prices, is this the reason the quality has gone down the tubes?? We also were informed that management changes as many times as you change your pants. Many members of the staff were not helpful and were frustrated themselves at where they worked. Even more so, many people from the different tours we took were ex-employers of the Hyatt and were not surprised at how we were treated. Needless to say, time is precious, vacation time is even more precious -- it was one of the biggest disappointments of my life!! My husband and I are now in the process of contacting the regional director--(who, incidentally is new) I have 3 friends that are getting married next year, and going to Kauai and Maui, they will not be staying at the Hyatt.", "helpfulness": 31, "user": "A TripAdvisor user", "date": "February 27, 2005", "id": 3233060}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "This was paradise. My husband and I just returned from our vacation at the Hyatt. I would highly recommend this resort- especially to picky travelers (like myself).", "title": "Wonderful!!", "helpfulness": 19, "user": "kathryninfl", "date": "February 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 3211693}, {"rating": 5.0, "title": "The Best Resort on Kauai", "text": "The rooms were very basic, but large enough, clean, and laid out nicely. Our room tended to be a bit of a hike to the main lobby, but it was not bad and we liked the privacy. Plus, the hotel has open breezeways so even when you are walking inside it feels like you are outside.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "January 31, 2005", "id": 3101155}, {"rating": 5.0, "title": "See you next year in sunny Poipu...", "text": "The buffet breakfast was outstanding- with good selections and a highly professonal staff. We ate at the Italian restaurant one night but felt it to just be average. Tidepools had great atmosphere, food, and service.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 30, 2005", "id": 3100435}, {"rating": 5.0, "title": "Fantastic", "text": "My husband and I stayed here in November 2004. We travel often and this was one of our favorite hotels. An outstanding experience! Yes, it is expensive, but worth it. The staff is wonderful, the facilities are top notch. We are eagerly looking forward to our next visit.", "user": "mojitogirlChicago", "date": "March 5, 2005", "id": 3253991}, {"rating": 1.0, "title": "too noisy!", "text": "We paid over $500 a night for an average room....we were there to celebrate our 5 year wedding anniversary in February and we were looking for some peace and quiet...the adult pool was overrun by screaming/crying kids..(parents were oblivios) ....when we complained to the management, they advised we picked a bad week to come and should be understanding of the situation.....I also wote a letter to hyatt and received the same response....We travel alot and Hyatt has lost our business...Next year I will go to Maui instead and stay at the Westin...you get what you pay for there!", "user": "A TripAdvisor user", "date": "March 3, 2005", "id": 3250194}, {"rating": 5.0, "title": "Hyatt Regency is Awesome!!", "text": "My wife, step daughter, and I stayed at the Hyatt 7 nights from February 18th to the 25th 2005. We had an absolutely wonderful time. The staff was courteous and very pleasant. We called for room service the first night after a long day of flying and the service was outstanding. We had the breakfast buffet every morning and the staff were wonderful. Some even remembered our names. The food was delicious and I'm sure we gained several pounds. The layout of the hotel is stunning and I have convinced my brother and his wife to join us for a stay at the Hyatt next year.", "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3241269}, {"rating": 5.0, "title": "Heaven on Earth", "text": "Anyone who did not have an enjoyable vacation at the Hyatt either had some kind of unusual or bizarre experience or they are just unhappy people who can't be satisfied with anything short of heaven. We found it on Earth and at the Hyatt.", "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3241268}, {"rating": 4.0, "title": "Hotel beautiful but razor stubble in sink", "text": "The geckos are cute!!!", "user": "Slinky1", "date": "March 2, 2005", "id": 3240282}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 68, "average": 157, "very good": 529, "terrible": 29, "excellent": 1872}, "aka": "Grand Hyatt Kauai Hotel Poipu", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Find the true essence of paradise at Grand Hyatt Kaua’i Resort & Spa. Set on the soothing white sands in Poipu, on Kauai’s sunny south shore, this luxury resort unfolds on over 50 acres of lush gardens. The resort’s classic Hawaiian architecture with open courtyards and lush gardens welcomes the tropical breeze. Freshly renovated rooms blend clean simple lines with Hawaiian design elements to create a private retreat. A water wonderland awaits with a quiet adult area, lava-rock river pool, waterslide, and saltwater lagoon. Play championship golf at Poipu Bay Resort. Sample delicious island flavors at one of six restaurants. And for a spa experience like no other, visit Anara Spa where open-air treatments use island-fresh botanicals to refresh and renew."}