{"user_rating": 4.0, "review_count": 133, "name": "Grand Hotel Palace Thessaloniki", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We stayed here for a two night treat, and were virtually the only people in the hotel. This place is very new, huge and the service excellent. Room service was ultra helpful, providing ice buckets, champagne glasses, plates etc. for our own food. Very professional. The rooms were very plush, a great bathroom. The location is pretty crap, you over look industry, but there is a distant view of Mount Olympus!! You can catch a No.8 bus into the city centre from outside, whch only costs 50 euro cents, takes about 10 minuted. The business centre was cool, free internet and printing with fresh coffee and biccies provided :>", "title": "Great 5 Star Hotel & Service", "helpfulness": 9, "user": "perugirl", "date": "October 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4028014}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at the Grand Hotel Palace from March 14-22, 2007. The hotel was nice. We especially liked the breakfast buffet that was included. I wouldn't have rated it as a 5 star compared to hotels in the USA maybe a high 3. The bed was very comfortable and the bathroom facilities fit us 2 tall people. We also had dinner here twice which was very good but a little expensive. We used the pool twice which we had all to ourselves. You need to ask for the key to get to it as they seem to host a lot of large groups of high school age students and evidently don't let them use the pool or gym facilities. We were not bothered by the kids as they were on a different floor and the hotel has excellent soundproofing both from inside noises and the outside. The biggest downside was the location. It is not close to the town center or any restuarants or shopping areas. They do provide a shuttle every half hour until 11:30am to their sister hotel near the center, but we could have used it in the afternoon also. The number 8 or 12 bus is about 1 1/2 blocks away that takes you into town and the return drops you off right across from the hotel. Also, the smell of cigarette smoke as you walk in and in all the public areas was stifling at times, but the whole city(country?) smokes everywhere all the time. So, the hotel was nice but the location was not convenient.", "title": "Nice Hotel", "helpfulness": 3, "user": "Sky22", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 1.0}, "id": 7271487, "likes": {"liked": "— breakfast buffet", "disliked": "— cigarette smoke"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Check in was very quick, staff very frienly, rooms and bathrooom very clean (5 star quality), breakfast above average (but not 5 star quality).", "title": "Very good hotel a little bit far from the center.", "helpfulness": 1, "user": "mmarkopoulos", "date": "March 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 7236934}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The hotel is located far from the city center and especially from the Helexpo fair, but if you avoid the rush hours you can go anywhere in 20 minites by taxis.", "title": "excellent", "helpfulness": 4, "user": "athasofia", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6185099, "likes": {"liked": "— breakfast, room service, bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Perfect hotel, above average of Thessaloniki. Great breakfast, great service, parking available. Would definitely recommend it.", "title": "Great 5 * hotel", "helpfulness": 2, "user": "Amir R", "date": "August 31, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 5729619, "likes": {"liked": "— Great service free internet access", "disliked": "— A little of center"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Great 5 * hotel a little of center city but if you have a car then it's 3 minutes straught drive.", "title": "Great Hotel - location an issue", "helpfulness": 3, "user": "AlbertR", "date": "June 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5331022}], "location": {"country": "Greece", "region": "Central Macedonia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 9, "average": 25, "very good": 46, "terrible": 8, "excellent": 45}, "slim_ranking": 0.292307692308}