{"user_rating": 3.5, "review_count": 440, "name": "Gran Hotel Guadalpin Banus", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "There was 14 people in our party and we stayed for 3 nights, on the 1st night someone was robbed in their sleep (they had left the balcony door open) once everyone heard this we were careful, however the next evening while I was in our suite (which was amazing) I heard a noise, walked into our living area to find a man stealing my IPOD and purse - I screamed and thank got the man ran back out the baloncy doors. I rang reception very frightened and I couldn't believe how blase they were!!! They didn't even ring security , he near enough said it was my fault for having the balcony door open.", "title": "I got robbed and the Hotel didn't care", "helpfulness": 1, "user": "Lenny82", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 47310739}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Although most of the reviews I read were positive, there were a couple of negative ones which made me a little unsure, but based on photos and location we booked anyway. I am so glad we did as it was absolutely wonderful. I live in Dubai so am used to a good standard of hotel and wasn't disappointed with this hotel. We stayed in a Presidentail Suite which was amazing. Very spacious and with the huge terraces and rooftop sundeck and jacuzzi it was very romantic and the perfect place to relax and soak up the sun for 4 days. The seaviews were spectacular, the bed was comfy, the room was clean and the staff at reception were very helpful and friendly. The inclusive buffet breakfast was great and there was certainly something for everyone. The general setting is very pretty and romantic and is only a 10 minute walk into Puerto Banus (take a taxi back though) along the beach, which was quite lively for mid October, so was glad that we were not staying in the centre.", "title": "A wonderful hotel right on the beach!", "user": "Lyndadubai", "date": "October 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47086143}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Room service was very good. We had a burger and paella in the room and both were excellent. Mistral Bar, the beach bar outside the front of the hotel serves amazing seafood, but prices are not for the faint-hearted. We paid about Euros 100 for a seafood platter (which was Huge!) and 2 big jugs of Sangria, which although it was expensive was pretty much in line with the prices we pay in Dubai, and Puerto Banus is probably one of the most expensive places in Spain and we knew that before we went.", "title": "average hotel", "user": "UkLili", "date": "October 4, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 45787207}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Drinks average at about Euros 5 for a beer, but you can always buy a 6 pack for less than that at the shop down the road. My only complaint would be the Euros 6 we had to pay to have ice delivered to the room, but it was a huge bucket and we kept it in the fridge and it lasted us the 4 days, so no big deal really. I have spent a few summers on holiday in Puerto Banus and during July, August it seems very busy at this hotel and surrounding beach area. However, at the time of our stay it was very laid back and peaceful.", "title": "perfectly situated for the beach and pool but fails to deliver at the buffet", "helpfulness": 1, "user": "SharynWLondon", "date": "September 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 44765623}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "I would highly recommend this hotel based on our stay in a presidential suite, or any of the rooms with the roof terrace and jacuzzi, and would definately stay there again.", "title": "Paper thin walls, marble floors - so noisy!", "helpfulness": 1, "user": "lovetosea", "date": "September 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 42821570}, {"rating": 4.0, "title": "Great Vacation", "text": "Just returned from a weeks vacation with the hubby. I'm not sure what all the complaining is about. The hotel is nice- modern, conveniently located to all: Puerto Banus, Mistral beach (right out front), Buddah Bar, Ocean Club. Opted for the superior room which was nice-with large balcony and comfortable/cozy chaise lounge .The beach and pool are wonderful. You can open the door to the balcony and hear the ocean at night. The buffet breakfast was delish. You should rent a car to get around in general. Highly recommend Puro Beach Club. Staff was helpful with information, dinner reservations, etc (speaking/learning a little Spanish is respected and appreciated). Didn't eat at the hotel because there are so many other options in Puerto Banus and Marbella.", "helpfulness": 1, "user": "dc906", "date": "September 9, 2009", "id": 40458371}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The hotel is ok, but 5* it isn't! For the prices charged I would expect more from a hotel - there was no 'wow factor' at all.", "title": "Average - not 5*", "helpfulness": 1, "user": "KmacUK", "date": "August 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 39311204}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The worst thing about the hotel is actually the clientele - mostly drunken Brits from what I could tell; wannabe gangsters from London or Liverpool, but then that's Marbella, isn't it?!", "title": "Horrible Experience", "helpfulness": 2, "user": "LondonAmerican_9", "date": "August 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 38978479}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I have been to Marbella at least 10 times and decided to stay at the Guadalpin Banus due to its phenomenal location and price relative to Puente Romano (where I have always stayed in the past). I have to stay that I learned my lesson - you pay for what you get. This is clearly not a five star hotel. The service was horrendous - rude from the receptionist to the pool guy (who never seemed to have towels) to the waiter at the bar who yelled at us for asking him to bring us 5 bottles of water and 5 glasses of wine over the course of an hour. In addition, whilst the balconies are really nice, the rooms are outdated and ridiculously small. Clearly, this is not a place I would ever recommend to anyone. And it's a pity because it sits on bautiful real estate and has one of the best beaches in town.", "title": "pure unadulterated luxury .... extreemly relaxing atmosphere.", "helpfulness": 1, "user": "AmberGreen10", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 36742174}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Enjoy this smart hotel by completely relaxing and enjoying the spacious , luxurious ambience... the Beach Bar is totally tropical ... it has everything you need to get away from it all and yet is only 5 mins in a taxi to the Marina in Puerto Banus.", "title": "It is a SHAME", "helpfulness": 1, "user": "DOCTOMNABO", "date": "July 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0}, "id": 36125043}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed 11-20 October in Beachfront Banus Suite.", "title": "Definitely not a 5 star resort...", "helpfulness": 1, "user": "pelun", "date": "January 18, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 53811135}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Already when entering the lobby at Gran Hotel Guadalpin Banus it is clear this hotel does not have the quality and class of a 5 star resort. You will have to carry your luggage yourself. Slow and somewhat uninterested persons at check-in. No introduction of the hotel services, facilities, breakfast etc. Find your room on your own. What really chocks me is finding out this hotel opened in spring 2005!! How can you let a hotel run down so fast? The interior design lacks any design what-so-ever and is worn down with boring colors following you in the hotel areas as well as in the rooms. Our room had brown-beige colors; sofa, wallpapers, kitchenette and carpeting. Looked very old and is quite worn down. The “fully equipped” kitchen (read: kitchenette!) had no casseroles or any cooking tools. When asking for a casserole reception sent us a kettle. Sigh! Even though the bedroom and living/dining room were good size, the bathroom was tiny! No separate shower, just a bathtub. And again, really worn down. However, what made up for all the flaws was the remarkable floor-ceiling window view in the bedroom and living room. Furthermore, the suite had a large terrace with a magnificent view. The terrace was surprisingly nice decorated with comfortable sofa/sitting group and outdoor dining table. The half way open wooden shutters blocked most of the sun during day, but not the view. The room had some technical gadgets such as electric controlled curtains and possibility connect your mp3 player in living room or bed room for the built in speakers in the ceilings as well as on the terrace. No DVD player in the room or hotel. Our friends stayed in junior suite which was smaller but had a better kitchen and bathroom. Their terrace was smaller and not as private but with nice sea view. We visited one of the deluxe junior suites with roof terrace. In short: horrible! I wouldn’t sit in any of their worn down, dirty furnitures on the terrace and certainly NEVER set my foot in the Jacuzzi! It was filthy! The general service was slow and inefficient. A charge of 6 euro to get ice to the room (5 star hotel???). The buffet breakfast was excellent though. The restaurant was not. Instead of having the bar facing the ocean with a nice view, it was located by the hotel entrance with its terrace facing the taxi stop. The pool was of nice size with comfortable sun loungers. Pool bar close at 6. There is a beach bar but it was closed. However, the beach was good and nice swimming. No personal on the beach this time of the year so towels had to be collected at the pool area (the “towel card” only allowed one towel per person ) and any drinks or food to be ordered in the hotel. Location was good with only 10-15 minutes walk to Puerto Banus. The air-condition in the small gym was not working and never repaired despite several reminders. Staff in general friendly but obviously lacking the service level and knowledge of a 5 star resort.", "title": "Lovely public areas, tired, shabby and small rooms.", "user": "LoopyLoo_7", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 51397227}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "In conclusion: For our terrace, the views, pool and beach – Yes a nice and possibly 4 star quality. For the rest I would not rate it more than 3+ and with no renovations being done, I would think it will fall down to a 2 star quality rating pretty soon.", "title": "Luxury on the beach outside Puerto Banus", "user": "daisyrock", "date": "November 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49813538}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My husband and I stayed at the Guadalpin Banus to celebrate my 40th birthday and had a very enjoyable stay at this hotel. Whilst the public areas of this hotel are very nice, I feel the rooms are rather tatty and worn, certainly do not command a 5* rating and are in general need of a refurb. We stayed in a superior room, which was in our opinion very small, however it did have a lovely view of the pool and sea. On the downside every item of furniture in the room had at least one chip in it and two walls had watermark stains on the wallpaper. We had an inconnecting door in our room which did nothing to muffle the sound of our noisy neighbours. Food and drink at this hotel is also very expensive and heavily overpriced. We had requested a queen size bed and arrived to find wo twin beds. This was however rectified within an hour of requesting a queen bed. We also requested an iroing board and iron which was delivered within 15 minutes. Service wise I think this hotel rates very highly, the only downside was the cost of the food and drink along with the condition of the room.", "title": "Immaculate hotel with excellent service right on the beach.", "helpfulness": 1, "user": "goodtimes75", "date": "November 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48599782}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The hotel", "title": "Never again", "user": "Ginamelanie", "date": "November 4, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 48484480}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Loved the hotel and the amazing bathrooms, good service, booking restaurants etc for us. We had a junior suite which was definitely well worth the extra, though we got it at a great rate when the Pound was much stronger against the Euro. The bathroom was amazing and we had a huge square balcony with a sofa and dinner table out there.", "title": "Still one of the best holidays we have had", "helpfulness": 2, "user": "EEY", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 35535638}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Banus itself is a bit rough around the edges but if you want a week by the pool the Guadalpin in Banus is a great choice, its out of the town centre but near enough to walk in in the evening for drinks/ dinner.", "title": "Bring ear plugs! 3 stars pretending to be 5!", "helpfulness": 2, "user": "kene66", "date": "July 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 35316753}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The first thing to say is that the sound insulation between rooms is simply terrible so a big part of wether you will enjoy your stay will be pure luck.If your next door neighbour snores you are NOT going to get any sleep. Trust me on that one! I have also been entertained by an enthusiastic couple next door at 4.30am as well as by party goers at 2.30am.", "title": "rather 4 stars than 5, but valuable choice", "helpfulness": 1, "user": "pnacaf", "date": "July 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 35134285}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The pool is the best thing about the hotel but there are not enough umbrellas to go round (VERY important in 35 degree temeperatures) and some of those that are there are ripped and broken. VERY 5 star! The staff are friendly enough but management is clearly on an economy drive with room maintenance also fairly low down the list. When we arrived the toilet flush in one of the ensuites was broken, the telephone didnt work in the room, the TV had a big scratch down the middle and the room safe didnt lock. None of it very important but it gives you a feel of the general delapidation of the place. It all detracts from the general enjoyment of the holiday.", "title": "Great Hotel", "user": "cward0625", "date": "July 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34918027}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This hotel would struggle to be a 3 star.", "title": "Filthy hotel, mediocre service, expensive bill...", "helpfulness": 1, "user": "MadridMaldivesfan", "date": "July 12, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 34557211}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 59, "average": 79, "very good": 136, "terrible": 34, "excellent": 132}, "aka": "Gran Hotel Marbella", "slim_ranking": 0.441558441558, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Unbeatable location. This beachfront resort is only 15 minutes walk from the centre of Puerto Banus. Hotel Imperator Guadalpin Banus 5* has 181 exclusive rooms decorated with noble materials & luxury finishings, offering splendid views of the Mediterranean Sea in an atmosphere of privacy and rest. You can also enjoy an exclusive and varied gastronomic offer in an idyllic setting: the sea front in Puerto Banus. High Cuisine Restaurants & exclusive Bars, Beach Club & Pool Bar, Fitness Centre & Sauna, Children playground, complimentary Wi-Fi, Meeting rooms will make of your stay the most exclusive and relaxing holiday."}