{"user_rating": 4.0, "review_count": 309, "name": "Gran Hotel Conde Duque", "reviews": [{"rating": 1.0, "title": "Terrible AC, unhelpful staff, remote location", "text": "The hotel has terrible AC, and does nothing to help with it, including offering to re-set the thermostat (whole hotel is on one, not room-by-room), or to offer fans. Unwelcoming attitude by staff, and also a very remote location only accessible to major sights by subway. We changed hotels after one night, and were much happier.", "helpfulness": 5, "user": "boonyc", "date": "August 7, 2006", "id": 5575733}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled with friends", "text": "Sorry that I didn't write straight away - its just I'm booking another holiday and it reminded me how useful Trip Advisor was when we were looking for a hotel in Madrid.", "title": "Brilliant!!!!!!!!", "helpfulness": 4, "user": "loveisland", "date": "August 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5564251, "likes": {"liked": "— good value for money", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Great hotel in good location", "text": "We spent four nights in this fanastic hotel (early May time) it was a hen night (no bearing on the type of hotel) 9 women of varying ages 23-53, I think I speak for us all in recommending this hotel. Its set in a lovely quiet area, round the corner from El Corte Ingles shopping centre, its set slightly out of the hustle and bustle but its a gentle 15 minute walk to the Palace, cafes and bars all the way there so its no big deal. The staff were really helpful, they recommended the most gorgeous restaurant I have ever been to (been all around the world). La Casa Benigna - lovely lovely lovely! All the rooms were a decent size, very clean and good air conditioning! try and get a room facing the park area. The breakfasts were delicious lots of choice. I would not hesitate in recommending this hotel, its more luxurious then you would think for the price. Enjoy!", "helpfulness": 4, "user": "JJB", "date": "June 23, 2006", "id": 5375796}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "I booked through Venere and got a great deal for two rooms. We picked this hotel mainly because my friend is a very light sleeper and it turns out that we have made the right choice. Both rooms (one TW and one SGL) are very quiet and are clean and decent. Our rate does not include breakfast and it costs EUR12.5 pp so we did not try. The location, 5 minutes on foot from metro San Bernardo, is perfect both for sightseeing and shopping. I have stayed in a number of hotels in Madrid (incl the Palace) and I think Conde Duque remains a very attractive choice.", "title": "Simply Superb", "helpfulness": 16, "user": "Janie8204", "date": "June 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5343320}, {"rating": 5.0, "title": "Excellent Hotel", "text": "Having booked my 25yr old son into the Conde Duque for fortnightly business visits since February, I joined him for a 4 day break from 5 June 2006. My son has expensive tastes, is not a traditionalist and always likes to be 'cutting edge'; as his PA, I have booked him into many hotels around Europe and when in Madrid this is his favourite hotel. Normally he favours modern Intercontinental type hotels but due to the quality, value for money, location and atmosphere the Conde Duque meets all his expectations admirably.", "helpfulness": 8, "user": "Clematis1", "date": "May 20, 2006", "id": 5183464}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "We stayed for two nights at the Hotel Conde Duque in January and loved it! The rooms were clean and adequte size (especially for European rooms which are normally much smaller than American), and when we asked for a small change (one bed vs. two) it was taken care of immediately. The front desk staff was extremely helpful and gave us good restaurant and clubs to go to (check out Joy Eslava for a fun night of dancing). The bathroom was marble and spacious. Overall, we had a wonderful stay and would definitely go back.", "title": "Great Stay at the Conde Duque", "helpfulness": 5, "user": "EKB9", "date": "January 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3026357}, {"rating": 4.0, "title": "Pleasant stay at the Conde Duque", "text": "I stayed at the Conde Duque for two nights in December 2004. The service was unfailingly kind, and the double room was attractively decorated and very clean although small. Upon arrival, I mentioned my luggage had been lost, and the clerk called immediately to see about it. He followed up the next morning. My dinner reservation was also made for the following night. The breakfast buffet was better and more varied than at the expensive hotel where I stayed my last night in Spain. My only complaint was the small rooms. However, the pleasant decor and warm service made up for that. I would stay there again.", "helpfulness": 3, "user": "Elena M", "date": "January 11, 2005", "id": 3001401}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "I stayed one night at the Conde Duque (I was supposed to stay seven nights, but needed to go back earlier to Peru), after spending five nights at the Gran Melia Fenix. Unlike the Fenix (which is a most renowned and sophisticated hotel), the personal service at the Conde Duque is outstanding (at the Melia, an urgent fax I was expecting was lost, and none of the messages left to me at the reception were ever delivered!) The plaza in front of the hotel is a nice and peaceful spot (well, at least on a Sunday), and the metro station is only one block and a half away. Breakfast is not as good as other reviewers have commented; in fact, I would not recommend it. I agree with other opinions about the lack of noise insulation: you can hear everything happening on the room next door! Aside from this, the hotel is cute, rooms and bathroom are adequate and comfortable (and I got a back room), and as I said, personal service is honestly kind and unusually warm. I would definitively stay there again; fortunately I am not a light sleeper!", "title": "Nice hotel, great service", "helpfulness": 4, "user": "Sergioo", "date": "April 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4982326}, {"rating": 5.0, "title": "Great hotel, great location and good value", "text": "We spent a lovely weekend at the hotel set in this quiet oasis in the middle of Madrid. Good value, nicely finished rooms and good quality public areas. Not only were the breakfasts good with lots of choice to suit all tastes, but we also would recommend that you do not miss the the \"afternoon tea\" in the bar - something we did not expect in down-town Madrid.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 8, 2006", "id": 4447261}, {"rating": 5.0, "title": "Great staff!", "text": "All of the staff that we met were friendly and could not do enough to make our stay enjoyable.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "November 4, 2005", "id": 4085683}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We loved this hotel and would stay there again. Originally, we planned to travel throughout central Spain, traveling from city to city via train, but we liked this hotel so much we returned to Madrid and used it as our base, taking day trips to cities such as Avila, Toledo, Segovia, etc. The hotel's location is great. A metro stop--the San Bernardo-- is two blocks away and a short ride to all the major sights in Madrid.", "title": "great hotel!", "helpfulness": 3, "user": "milys", "date": "September 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3935747}, {"rating": 5.0, "title": "Fabulous, wonderful, helpful, made my trip", "text": "But what makes this hotel extra special is the staff. Their recommendations for restaurants, concerts, etc were excellent. I got sick with a bad cold during the last few days of my trip and they located a doctor for me (who made housecalls!) and did not charge me a fee.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "July 28, 2005", "id": 3708407}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 4, "variance": {"poor": 5, "average": 43, "very good": 139, "terrible": 3, "excellent": 119}, "aka": "Gran Hotel Madrid", "slim_ranking": 0.2647702407, "description": "A First Class boutique hotel with 143 rooms situated in a quiet gardened square in the center of Madrid. Close to main places such us Gran Vía, Plaza de España, Plaza Colon and Paseo de la Castellana among others. Totally renovated, the hotel keeps in all places a high level of maintenance. Very well comunicated, uderground at 200mts."}