{"user_rating": 4.0, "review_count": 99, "name": "Grand Hotel Sonnenbichl", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "This hotel is lovely but the service leaves something to be desired. First, let me talk about the pros.....they offer an awesome included breakfast and there was nothing better than sitting outside in the morning, with a fine view of the Alps, sipping my cup of tea. Beautiful view of the mountains. Great service for drinks at the bar, the cocktails they made at the bar were some of the finest I had ever had, especially if you like fruity drinks. I only ordered one thing for dinner at this hotel, the club sandwich, and it was delightful. The pool was so awesome with it's powerful jets and I enjoyed the sauna too, very nice facilities.....I only wish they had a hot tub.", "title": "Great hotel run by amateurs.", "helpfulness": 13, "user": "carolynweb", "date": "July 15, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3670904}, {"rating": 5.0, "title": "Beautiful Garmisch Property", "text": "The service from the beginning was horrible, maybe they were having a bad night but the front desk people were not only rude upon check-in but totally negligent. After check-in we called down to schedule massages for the next day. The next day, the massages were never scheduled or even recorded for the next shift. We were never given a visitor's card (which allows you to ride the bus for free and other tourists discounts) we actually read about it and then asked for it a couple days later. This hotel will ask for a deposit to use anything, like the safe in the room, internet etc. If you absolutely do not want to be disturbed, then make sure you hang the do not disturb sign on the door. The staff will knock once and open the door without waiting for you to say anything. The cleaning staff walked in on us twice during a nap and they also barged in very early in the morning while we were still asleep. The worst thing is, I asked for an iron and never got it and one day when we came back from site seeing, our room door had actually been left ajar by the cleaning staff. If you don't have a car, then the walk to downtown restaurants and shopping is 20-30 minutes. It was great exercise for me but would have been good to know in advance.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 23, 2005", "id": 3399527}, {"rating": 4.0, "title": "A hotel that time forgot", "text": "This hotel is perfect for people who want to be left alone, want some peace and quiet and good food. But for those looking for a great location with a little bit of excitement and people, this is not the place. Also, it was really disheartening to see such a fine hotel run by such amateurs, if they picked up the service a bit and focused on the details, we would have been a lot happier.", "helpfulness": 5, "user": "SimonLancaster", "date": "September 23, 2004", "id": 2595537}, {"rating": 5.0, "title": "Sun at the Sun", "text": "I enjoyed a lovely stay at the Grand Hotel while touring the Alpine Road in May of 2004. The Grand Hotel is seconds from the centres of Garmisch and Partenkirchen, and not far from the Olympic ski hill. The hotel offers beautiful panoramic views of the surrounding alps. The staff made my stay especially enjoyable as they are all very warm, helpful, and friendly people. My room was quite large and comfortable with a huge modern bathroom. Dining at either restaurant is highly recommended, as both offer a wide variety of choices including many wonderful local dishes. I prefer the smaller more casual dining room though, as it seems to be more traditionally 'alpine', and comfortable. All in all, my stay here was very enjoyable and memorable. I would recommend this hotel to anyone travelling near Garmisch and Partenkirchen.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 10, 2003", "id": 1278498}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This is a lovely old hotel with an exterior that could be improved upon to match the old-world interiors. It's in a nice location with great views. Our room overlooked a meadow with lambs grazing, with lots of mountains in the background. Lovely, and the room was fairly big. The bathroom was not bad, but could do with some upgradation and better plumbing.", "title": "Nice Hotel, but stay closer to town", "helpfulness": 3, "user": "sankar", "date": "September 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10014908, "likes": {"liked": "— Views", "disliked": "— Distance from town"}}, {"rating": 1.0, "title": "this is the most arrogant and rudess staff of any hotel, that i have ever been.", "text": "Breakfast (which is basic but tasty) overlooking the mountains is heavenly if the weather is right. A nice small pool and a great sauna which we loved using every night. Nothing to complain about on the service front - perfectly helpful staff, though I had to pay for room slippers and toothpaste, which is not really expected in a fairly expensive place like this!", "helpfulness": 21, "user": "cajunfrench", "date": "February 26, 2007", "id": 6840720}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The only problem is that this hotel is a 30+ minute walk into town, and there's really nothing near the hotel. There is a bus stop close by but buses are quite infrequent., so unless you have a car or are willing to pay 10 Euros each way for a cab, you will have to make the long trek.", "title": "Great Hotel, good deal through world hotels.com", "helpfulness": 1, "user": "Jimsreview", "date": "October 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 5980517, "likes": {"liked": "— views, location", "disliked": "— uncomfortable platform bed"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The city is where you would want to be in when you are not admiring the views - the restaurants (try Spago) and shops are wonderful and can take days to explore.", "title": "Very enjoyable short stay", "helpfulness": 4, "user": "swiss-mike", "date": "September 5, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5770205, "likes": {"liked": "— Location and staff", "disliked": "— Traffic noise"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Next time, I would stay closer to the city where there seemed to be a lot of good options in the same price or cheaper.", "title": "Very Enjoyable Stay", "helpfulness": 2, "user": "TokyoJoe", "date": "August 30, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5729152, "likes": {"liked": "— Dining", "disliked": "— location out of town"}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 21, "very good": 30, "terrible": 6, "excellent": 33}, "aka": "Grand Hotel Garmisch Partenkirchen", "slim_ranking": 0.488888888889, "description": "Grand chalet-style winter resort hotel with multilingual staff overlooking the town & mountains; 4 km from the train station."}