{"user_rating": 4.5, "review_count": 4297, "name": "Grand Bahia Principe Akumal", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We chose the Gran Bahia Principe Akumal Resort for our Honeymoon after reading all the reviews and studying the pictures of the resort. After staying four nights, I would recommend it to anyone looking for a great all-inclusive Yucatan Resort experience.", "title": "Amazing Honeymoon!", "helpfulness": 3, "user": "Robert B", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119572119}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "When we checked in we were upgraded to a Junior Suite just off the lobby and a short walk from the pools and beach. Upon arriving at our room we were almost overwhelmed when we found a path of red rose petals strewn through the room up to an iced bottle of champagne with two flutes, a tray with chocolate dipped strawberries, and a dozen red roses! Unbeknownst to us, a friend had emailed ahead requesting special treatment for “The Honeymooners” and the resort’s public relations staff accommodated wonderfully!", "title": "The Worst", "helpfulness": 6, "user": "Olivia M", "date": "October 21, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 119560996}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Because of our short stay - we met several couples staying a full week - we initially had difficulty making any reservations at the “a la cart” restaurants before 10 p.m. after we arrived – but a front desk manager intervened and we were able to be seated at the Japanese and Brazilian Restaurants at more reasonable hours. You may want to email ahead to secure yours before you arrive.", "title": "2nd time back, but there wont be a 3rd", "helpfulness": 10, "user": "Jennyren13", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119548766}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Despite what we read in some reviews, we thought the food at the buffet and restaurants was of higher quality than what you usually have at all-inclusive resorts – and we’ve been to several!", "title": "Great relaxing holiday - 2nd time here", "helpfulness": 2, "user": "LongToedMouse", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119534713}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Our summary would be that the facilities are almost new and very nicely designed, the rooms are nicer than they appear in the photos, the food and drink plentiful and the staff bends over backwards to make your stay as pleasurable as possible.", "title": "3rd time to the mayan,2nd time to GBP Akumal", "helpfulness": 4, "user": "DOmenic604", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119435278}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We went for two weeks in June 2011. Although the transfer is long, almost 2 hours, it is well worth it when you get there. The staff are friendly, complex very clean. Our group consisted of 7 people including 3 children and all were catered for. The food was plentiful and some much variety even for me, as I am particularly fussy when abroad. I would definitely return to this hotel and would have no hesitation to recommend to others.", "title": "Gran bahia principe Akumal", "helpfulness": 7, "user": "gazla", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 123516976}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "After reading many of the reviews on Tripadvisor for this resort we decided to give it a try. We received the best pricing on this property of all the resorts we looked at in the caribbean so that also helped the decision.", "title": "GBP Akumal January 2012", "user": "tactilesound", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123511929}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were looking for direct flights to minimise our travel time. We flew Transat and squeezed into the narrow seats. This was our 2nd trip on Transat and if I can find other options for direct flights out of Edmonton for a reasonable fair we will be taking them next time.", "title": "Extremely happy with our stay at GBP Akumel Jan 8 - Jan 15, 2012! (Privledge club sales tactics annoyed us)", "helpfulness": 2, "user": "JaniceRigby", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123501703}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Upon arriving at Cancun there was a computer problem at customs so all passengers had to wait for an hour until they started to manually approve entry. The time share sales men are out in full force as you make your way to your bus. The wait on the bus was about another 45 minutes until we were on our way. We knew that the resort was far from the Cancun airport so we did expect it to take some time to get there. It took about 2 hours as we were the last stop. Our flight left Edmonton at 8am and we arrived in our room at 6:30pm.", "title": "Can't wait to go back!", "helpfulness": 6, "user": "Leslie P", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123498960}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The check in at the resort was quick and we were very happy to find we had the best location, villa 47. The room was clean for our entire stay. You could hear the ice machine though the night as it was outside our door on the main floor but that was not a big deal for us. The 2nd or 3rd floor would provide a better ocean view. The bed was very firm but we slept well each night.", "title": "What a place", "helpfulness": 5, "user": "Geoff M", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123497845}, {"rating": 4.0, "title": "Nice Place to visit", "text": "Our whole family stayed at the Bahia Principe Akumal along with some friends from June 22-29. All in all we were 4 adults, three 15 year old boys, one 13 year old boy, and our 9 year old daughter. Yes the hotel is big, but it never felt crowded although the hotel was sold out. Service is courteous and mostly fast. In those rare occasions when it took a little longer than I would have preferred to either get a ride or a drink I was gently reminded that I was on vacation...what's the hurry. Those waits never exceeded 5 minutes for a drink or 10 minutes for a ride and hotel transportation schedules are clearly posted. I was dissapointed that although I booked the vacation more than 4 months in advance and I e-mailed the hotel at least 3 times prior to leaving the US to remind them of my preferences (building 47 or 48, top floor, king size beds) neither of those requests was granted. We were in building 81, bottom floor, single beds. So...we walked and it wasn't bad. At $5 a day the room safe is a necessary evil and should be included in the \"all inclusive\" plan. You'll need one unless you are really good at hiding your money (our son was not and he paid dearly when someone took his $85) The buffett is fantastic with something for everyone. The restaurants are a big dissapointment. Not worth making reservations and wearing long pants to eat basically the same food available at the buffet. Drinks are watered down but if you want to drink yourself to stupor you just have to drink more and eventually you'll get there. Yes the beach is rocky in places, but it is also smooth in others. If you enjoy snorkeling bring your own gear. Close to shore the rocks are home to quite a few fish but the coral is dead. Further out the coral is alive but there are lots of nasty sea urchins and the area is \"off-limits\" unless you pay a fee to tour with a guide (forget that and just be carefull where you step and don't touch the coral or you'll kill it). Take the colectivo (a van) from the entrance to the Hotel to anywhere you want to go for $2 per person rather than a taxi for $20. Xel-Ha is great but don't buy the \"all inclusive\" for $75. Catch the bus for $2 per person and buy the all inclusive when you get to Xel-Ha for $54 and keep the $20 per person to buy fake Oakleys in Playa del Carmen. All in all it was a great place for the kids with the 24 hour availability of hamburguers, softdrinks and fries at the Snack Bar, clean huge pools, and a million other things to see and do. Could have been better? Of course. For instance: having to carry regular keys with your room number STAMPED on them is not only a bad idea but also quite inconvenient. Same thing with the towel cards, what's up with that! The concert hall/auditorium needs air conditioning - heck everything should be air-conditioned. Good place to visit. Glad we went, but I am willing to bet that it is probably not the best \"all inclusive\" in the Riviera Maya.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 7, 2004", "id": 2282326}, {"rating": 4.0, "title": "Absolutely beautiful resort", "text": "Mayan Riviera is a beautiful laid back area of Mexico. Plenty of activities outside of the resort if you want to explore a little on your own. Akumal side of Bahia Principe was outstanding, grounds are beautiful, food was great, rooms comfy and clean, friendly staff. There were also plenty of onsite activities to keep you busy as well as ample space and accomodations for lounging by the pool or beach. Highly recommend it", "user": "A TripAdvisor user", "date": "July 7, 2004", "id": 2271849}, {"rating": 5.0, "stay_parameters": "Stayed April 2004", "text": "I stayed at the Bahia Principe Tulum from April 24th-May 8th. I travel a lot and I would have to say it was one of the best trips I have ever been on. The check in was very fast even though we came off of a bus filled with people. There are even staff at the front waiting for you so they could give you a drink! My husband and I got married on the beach in front of the Tequila and it was absolutely beautiful. 21 other people traveled with us for the wedding and they all said they have never seen such a beautiful resort. The food was fantastic, the staff were unbelievable, and the grounds were magnificant! The beach wasn't the greatest, but you have 3 pools to choose from so that was ok. A couple words of advice........if you want to go to Xel-Ha don't book through the hotel or travel guides. Take a cab there, pay your way in yourself and it will save you over 50.00 a person. Also.....if you want to go into Cancun don't take a cab. Go stand on the side of the road and wait for the white vans. It will cost you 2.00 to go to Cancun. A cab ride will cost you about 60.00. Overall it was a fabulous trip. If you have any questions please e-mail me. Or if your getting married there and want to see pics or ask any questions please don't hesitate to e-mail me!", "title": "Absolutely Beautiful", "helpfulness": 7, "user": "candy03", "date": "July 5, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2268593}, {"rating": 4.0, "title": "Very good apart from a few minor irritants", "text": "Candy", "user": "sjlkh", "date": "July 5, 2004", "id": 2268188}, {"rating": 2.0, "title": "Not what we expected", "text": "Stayed 8 nights from 19thJune thru 27th. Our 2nd time there. This time we were in the 6900 block on ground floor despite requesting an upper floor. The first time we stayed we were booked for a jnr suite and were given a standard room. They did change us to a suite the next day but only after much pressure from us.", "user": "A TripAdvisor user", "date": "July 4, 2004", "id": 2267014}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "My 4th stay at the BP Akumal wasn't as expected. Apparently, the hotel was only partially full, and several bars were closed for the entire week, such as the bar on the farthest beach south, right in front of our Villa. Food, on the other hand, although better than at most resorts, wasn't what it was on my previous trips. Not a lobster all week, not even shrimp, other than the few you would find in a Paella on Spanish night.", "title": "Not as great as usual during late September", "user": "HoracioR", "date": "October 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118998632}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Club Golden at Akumal offered tap beer in a container (warm beer), as their usual tap wasn't working. They also had the same person checking people in, and serving the bar. In other words, there was really no bar at all. The second on board there was quite clueless as well, and not very nice at all.", "title": "Another great all-inclusive resort", "helpfulness": 2, "user": "JimTheophilus", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118952105}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "I do have to say on the up side, that the new beach in front of Villa 66 (southern end of the property) is great, and a welcome improvement over the other fake beaches, that are so shallow you need to lie horizontally.", "title": "Great vacation resort", "helpfulness": 3, "user": "lori m", "date": "October 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118884823}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Another up side, is service at the Coba buffet restaurant, which was excellent. This is by far the best buffet, followed by the Tulum, and last, lagging quite behind, the Akumal buffet. They do this to offset the Coba's distance to the beach.", "title": "Worst Vacation Ever", "helpfulness": 2, "user": "ashley_chris", "date": "October 2, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 118869377}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I went to this hotel after spending a week at a Radisson in Panama City, so even though I'd been there before on 3 occasions, I found the rooms to be outdated, and feeling more like a Quality Inn, or a Holiday Inn, or something like that. Definitely not 5 star, so don't expect more than this. Not to imply the value is high, as the grounds are beautiful, and large enough not to bump into people at every turn, and the food is pretty good.", "title": "BEWARE of SAND FLEAS IN THE SAND ALL OVER THE BEACH AT THE RESORT!!!!", "helpfulness": 3, "user": "WineloversBC", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118868970}, {"rating": 5.0, "title": "The best holiday we've ever had", "text": "We booked our holiday 10 days before we went and got a great deal. (21st june- 5th July) We were very frustrated at the airport our suitcases were removed from the carosel and we did not know and then we had to queue for ages to have our luggages searched. Our thomas cook rep was brillant and our hotel was excellent. The staff were extremely friendly and when we went for meals our drinks were replaced with fresh ones immediatley sometimes before wqe'd finnished ours and asked for new ones. There is a wide choice of foods and even my fussy husband found something to eat. Our maid was brilliant and the towel animals were great. You go around the resort on willy wonka carts which makes life easier and it also gives you a good feel for the place and helps you find your way around.Everything is clean and tidy. We cant wait to go again. If you want to ask any questions and would like any tips just drop us an email.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 12, 2004", "id": 2290344}, {"rating": 5.0, "title": "Wish We Had More Time At The Bahia Principle Akumal", "text": "We stayed at the Akumal July 4th - 8th. The resort is beautiful. We really loved the hotel suite. Loved the marble floors. Lots of room to move around. Room was very clean. We received excellent service from checking in to maid service. We checked in early and was initially told our room would be ready by 3:00, however, within 10 minutes the front desk clerk find us because our room was now ready. The resort is huge and we still did not see all of it in the 4 days. You will definitely be walking alot or riding in the golf carts to move around the resort. No clock or iron in room. Mixed drinks were ok not great. Food was good with a huge variety at the Riveria Buffet. We loved eating on real china at every meal(that is rare at all-inclusive resorts). Definitely get the in-room safe. We travel every 4th of July to celebrate a friend's birthday and this is the first resort in 3 years that we would come back too. We definitely would return to and recommend the Bahia Principle Akumal to friends. Oh, just don't go in July if you can't take the heat.", "helpfulness": 6, "user": "travelgrl84", "date": "July 11, 2004", "id": 2289083}, {"rating": 5.0, "title": "Loved Bahia Principe Akumal", "text": "Travelled to BPA for first time with a group of 11 (3 couples in thier 40s, 5 kids ages 15-20). Stayed 10 days and did not feel ready to leave at the end of the vacation. We vacationed at the Moon Palace Sunrise with this group 2 years ago (loved it!) and had doubts about trying a new place. BPA is a wonderful family vacation destination and I would highly recommend it. The reviews on this site were extremely helpful and I hope this review will help some current, lucky trip-planner (its 60 degrees and cloudy in Michigan now...how I long to be back in the 90 degree sun of Mexico!).", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 8, 2004", "id": 2284380}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "AIRPORT: The Cancun airport has been totally redone since our trip 2 years ago. Very quick and easy though immigration and customs. As always, avoid the time share sharks.", "title": "Great for the whole family", "helpfulness": 1, "user": "rep99", "date": "July 8, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2284027}, {"rating": 5.0, "title": "Fantastic Trip for Parents, Teens, & Preteens", "text": "ARRIVAL: One hour drive to the BPA (OK, it would have been one hour if our driver didn't need to stop in PDC due to \"too many Mexican tacos\"!). Lomas travel does a great job, really. Check in took all of 2 minutes. We needed 5 rooms, so my sister and I were quite worried that we'd all be split up (teens staying in own rooms, so good reason to worry). However, we were greated at the desk by Stephan and Jerome (extremely nice, polite and helpful), and they gave us 4 rooms together in building 48 and one in 49. Now, we had actually requested buildings 65, 66 or 67, as they are right on the sea, but after a few days we decided we had the PRIME spot in the resort. The only building I would have traded to was #47. We were close to the pools, lobby, snack bar and restaurants. Perfect location! No ocean view, but we seemed to only be in our rooms to change and sleep.", "helpfulness": 11, "user": "cgmom", "date": "July 7, 2004", "id": 2282531}, {"rating": 4.0, "title": "the good and the bad", "text": "I booked this holiday as a late deal and got a great bargain.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 4, 2004", "id": 2266766}, {"rating": 5.0, "title": "We want to go back.", "text": "The only fault with Cancun airport is that it took a very long time to get our suitcases loaded on to the carousel. The most frustrating part is that they offloaded the luggage from two US flights that landed after us before offloading ours. We then had to endure sales reps who pretended they were airport security staff and demanded to see our reservation details. It was only five minutes later that I realised who they were.", "helpfulness": 3, "user": "diggerdel", "date": "July 4, 2004", "id": 2266244}, {"rating": 5.0, "title": "Second Visit Just As Good As The First", "text": "The transfer to the hotel was fine and we had a nice representative from the coach company. The initial problem we encountered is that you could not use phone cards in the hotel to inform your relatives in the UK that you had arrived safely. The options were to use your room phone and pay by credit card or reverse the charges. We did not have a tri band phone so we were unable to use our mobile. The good thing is that there is an internet cafe so you can keep in touch with anyone quite easily.", "user": "Cardinalfan", "date": "July 3, 2004", "id": 2265172}, {"rating": 5.0, "title": "Fantastic", "text": "The staff at the hotel were really friendly. There was alot of food on offer but not much for vegetarians unless you liked a lot of boiled veg, salad and fruit. It was good that you could wear shorts and vests at the main buffet restaurant. The down side is that the drinks had to be served by the waiters/waitress. There were no facilities to serve yourself. Sometimes it was a bit frustrating that you had to wait for drinks especially when it is hot. I stayed at the same hotel in the Domincan Republic and you helped yourself to the drinks.", "helpfulness": 8, "user": "Nibbles66", "date": "July 3, 2004", "id": 2264985}, {"rating": 5.0, "title": "A Great Way To Spend A Vacation", "text": "The entertainment was a bit poor. The theatre shows were repeated weekly which was ok if you were only staying for one week. The two blokes singing at the bar every night were not really my cup of tea. The entertainment at the Hacienda was really good and the staff really put their hearts in to their dancing. Everyone is invited to dance.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 2, 2004", "id": 2263928}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We just got back from a vaction yesterday. We had great time at this resort. Great weather!.. This resort along with the other two (Coba, Tulum) was immense. The transportion around the resort is very good. The food is good but gets a bit tiring after 5 or 6 days. The golf course is spectacular. Palya Del Carmen is a great place to visit as well.", "title": "Great Week, Excellent Service", "helpfulness": 2, "user": "ghuizer", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123849368}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We will go back, hopefully sooner than later.", "title": "I was ok...", "helpfulness": 1, "user": "MisterBigJunk", "date": "January 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123837634}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We went back in September of 2010...", "title": "6th Time at the Gran Bahia Principe Akumal & Can't Wait To Go Back!", "helpfulness": 8, "user": "MissingFunInTheSun", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 123801531}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This was out second trip and it was \"alright\"...", "title": "Great resort!", "helpfulness": 5, "user": "honeynveg", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123773812}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The resort in itself was awesome...it's a 4-part resort that joins with the Coba, Tulum and another one (can't remember) and you can go, visit, eat, and drink at any of them...the shuttle takes you to each one...", "title": "Best vacation yet! THIS is why I love Mexico!", "user": "akumal2012", "date": "January 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 123577503}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Booked through Apple Vacations for a 13 day trip. Apple Rep. Carlos Mendez is a real pro.....helpful, courteous and always available, three cheers for Carlos.", "title": "Excellente : - )", "helpfulness": 4, "user": "tony838", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123916674}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The hotel is top notch when it comes to management and facilities. Guest Service Manager Geraldo Alonzo Mendez and customer service rep Gabriella are two examples of employees who are at the top of their game. The rest of the staff I just can't praise enough for their hard work and friendly helpful attiude.", "title": "Great Vacation!", "helpfulness": 5, "user": "TravelGal66", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 123902275}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Hotel and grounds spotless, rooms always fresh not musty. Pool chairs can be hard if not impossible to get after 9:00am. unless you play the towel game, but now there is a new game in town, plastic clips of dolphins and flamingos that people clip to the backs of chairs to reserve.", "title": "Lovely holiday...", "helpfulness": 7, "user": "Kaseyjane", "date": "January 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123874745}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "If I had any disappointment it would be the swimming areas in the sea. The beach itself is beautiful with tons of chairs and ample shade. If you are looking to swim in a textbook mile long, half moon", "title": "Great Resort, Amzing shows, nice beach", "helpfulness": 2, "user": "vacationqueen82", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123860168}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "carribean sea you won't find it here.", "title": "Fantastic first time at GBPA!", "helpfulness": 1, "user": "pinkcess", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123859421}, {"rating": 4.0, "title": "Good hotel but too isolated for us!", "text": "We visited this hotel in June 2004, while the hotel is of a good standard, it is too far away, especially when travelling from england. The hotel is 2 hours from the airport and there is nothing locally, therefore you are stuck at the hotel pretty much all of the time. The hotel itself is nice, really good rooms and a la carte restaurants (although the main buffet restaurant is average with limited choice). The evening entertainment is ok, but not for you if you like lively nights out.", "user": "UKTravellercleveland", "date": "July 16, 2004", "id": 2302441}, {"rating": 1.0, "title": "BAHÍA PRÍNCIPE TULUM : TERRIBLE FOOD AND ANIMATIONS", "text": "There is plenty to do during the day and we really enjoyed a trip to Xel-ha, a natural waterpark with dolphins etc. Overall a good holiday and nice hotel, but a shame it wasn't situated a little better. One word of advise, take lots of mosquito repellant!", "user": "A TripAdvisor user", "date": "July 15, 2004", "id": 2301050}, {"rating": 3.0, "title": "The good and bad", "text": "In the case of qiue you have visited Dominican Republic, NOT GO to Mexico. The infrastructure of the Hotel is beautiful, the beach also, but with many rocks. The food is evil, the hygiene in the room, is also evil. Many days, only there was cold water in the room, not hot water. And the animation was VERY BAD, of the worse thing. The hosts of the hotel, do not have neither idea of what is the tropical happiness. Himself it cannot be compared with PUNTA CANA, cannot be compared with the members of the Dominican STAFF. All in all, holidays to forget and money lost without enjoying. Please, take care of its money, not go to the BAHÍA PRINCIPE TULUM.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 14, 2004", "id": 2298646}, {"rating": 5.0, "title": "Extraordinarily Wonderful Vacation Spot", "text": "Visited the Bahia Principe from June 17 to 24, through Apple vacations. I'm writing for those of you that are already booked to go to the Bahia and for those of you that may be thinking about it. Our experience at the airport on arrival was quick and and easy. Just watch for the men trying to carry your bags and keep your eyes peeled for the people in the floral Apple vacation shirts. The van ride was not the greatest. The AC was not working great and the check engine light was lit the whole trip. The driver also packed 11 people in a 8 passenger van. Be prepared for a long ride. Upon arrival, our hotel check-in was very smooth but we realized that the lobby didn't have AC. Being that the temp. was in the 90's and after a long van ride we were not very happy or comfortable. One of our rooms was not ready so we took all our bags to our son's room. The room were very nice and after we got the AC blasting we were quite comfortable. About the rooms. The hair dryer worked great but if you have anything to plug in bring an extension cord because none of the outlets in the bedroom are close to the mirror. Also we had trouble with any that had a large plug so an extension cord solves that problem. No other problem with our rooms but be warned that this hotel does not have air conditioned restaurants. Only the Don Pablo has air. The buffet and other restaurants all only have large windows that open and ceiling fans. At 90 degrees plus, it is very very hot and humid. The main bar and theater are not air conditioned either. so be prepared to be very hot and sticky. The food was only average, lots to eat if you are not picky but not of high quality. The drinks are watered down so ask for top shelf liquor and they will accomodate. Best place for breakfast and lunch was the Tortuga, same as the main buffet but cooler and a better breeze. Pools and grounds are beautiful . Take insulated cups for the pool or you will never have a cold drink for very long. The beach was great and not as rocky as expected in certain spots. Go to the pier with rolls or bananas and feed the fish. They come right up to you. The shows at night were very low quality and the theater is very hot. At night be sure to wear lots of bug spray or you will eaten alive. We had three 16 year olds in our group. They made the most of things because most of the kids were much younger or older. Also they were given alcoholic drinks very readily so watch out for that. Also being from the US we were not accustomed to topless sunbathing and we saw alot of that. Not just at the beach but at the pools also. So be forewarned. Now to the worst part of the trip. My husband got very sick. Vomiting and diarrhea. so bad that he had to see the doctor and stayed in bed for 2 days. We think it was the chicken in the paella at the pool. He wasn't using the water so we don't think it was that. The boys did drink water at the resort but other than more than normal bathroom runs they were not sick and neither were the other adults. But we did watch that we didn't eat raw vegetables or fruit with skin. Because of my husband we didn't take the Apple van back to the airport, we booked our own ride with another van service. Cost was $95 but we had a nice cool van and only an hour trip to the airport with no stops along the way. The Apple people at the resort were no help in arranging any alternative transportation. So if you have a trip booked you can look forward to beautiful beaches and grounds. And mostly friendly staff especially the entertainment staff. If you are looking for a place to go, remember no AC and very average food and drinks. Our whole party ,7 of us, agreed that we would not be going back to Mexico any time soon.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2294515}, {"rating": 5.0, "title": "Met our high expectations!", "text": "We stayed at the Bahia Principe Akumal from June 26th through July 10th, 2004.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2293416}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Arrived at the hotel somehow exhausted and instead of relaxing had to search for the travel agent (not related to the hotel) to confirm return transfer. He should have been at the sister hotel \"Tulum\" but was not there and also left out two consecutive appointments. This meant however to get used to the shuttle service within the enormous three-hotel complex. After this discouraging start the excellent buffet rewarded us with really amazing choice of good food. Room in Villa 50 was good and well equipped with coffee maker and ironing board. View not spectacular, but room quiet even if located near the main building. The sea-side is partially inaccessible due to rocks, and after an artificial sandy beach where water is about 1 m deep, certainly not a highlight, it was said that a natural beach is adjacent (Tulum part of the Hotel). At Tulum part there is a daily dolphin show. Otherwise, there are swimming pools with animation i.e. loud music etc. at the Akumal, as well as a beautiful swimming pool without animation, we only discovered after four days. There is a \"Hacienda de Dona Isabel\" within the complex, a replica of a Mexican town centre, all rather expensive souvenir shops and restaurants, also some apparently genuine artefacts for sale. There are shows at the Hacienda every evening, including a Fiesta Mexicana once per week (we missed). At the Akumal there is also a daily show in the evening with some professional artists, the most guests, as they were always addressed by the show master, came from Spain, UK, Canada, Mexico, Portugal and few from US. Be aware if you don't like to be on stage, as they always pulled participants out of the audience to \"act\" on stage, but they respect if you refuse. Back to the hotel ground. The shuttles circulate quite frequently and they are flexible and helpful to bring you to the place you want to go. There are snack bars where you can eat and drink (I believe) 24 h per day. Even though we didn't spot anyone exaggerating. While we always took the buffet option in the main building, we did not choose the speciality restaurants, but others said they were very good. When walking on the grounds you may also meet Geckos, or was it a Leguana? For nearby excursions, the monuments of Tulum (with a surprising beach) and Xel-Ha may be recommended.", "title": "Relaxing All Inclusive Hotel", "helpfulness": 3, "user": "Frequentvoyager", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119677406}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Just returned from our 1st trip to Bahia Akumal...... My Mother is 81 and uses a walker we were aware that there were trains to take us to the other 2 resorts but were not aware that we would have to take them within our own resort although the bus drivers were exceptional in looking after us. We were in the Golden we had requested and also e-mailed for a ground floor room....we were given a 3rd floor room!!!!!!! impossible for my Mother. Luckly for us other travellers swaped their ground floor for our 3rd floor. Some of the restaurants did not have ramps we had had to walk around the pool to get to one so we could go through it to get to the other", "title": "Bahia = Boo Hoo", "helpfulness": 1, "user": "Eileen B", "date": "October 24, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 119674214}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Many other things but surfice to say we would not recommend this resort to you if", "title": "gran bahian principe riviera maya - akumal", "helpfulness": 10, "user": "gail044", "date": "October 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119598249}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "1...you are older", "title": "First time and a last time.", "helpfulness": 2, "user": "kooljester", "date": "October 22, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 1.0}, "id": 119589414}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "2...the fact that you have to pay for safe key", "title": "Our Home Away From Home", "helpfulness": 5, "user": "BarrieGuy69", "date": "October 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119585822}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Been to mexico before so knew a little about what to expect.The 3 hotels that you can use are kept very clean at all times of the day.Any staff that we came into contact with were happy and friendly.Which bar or resteraunt i liked is irrelavant(one mans meat another mans poison)but the food is of a good standard.Nevertheless i believe the following to be fact.", "title": "good hotel as expected.", "helpfulness": 3, "user": "fillywidnesuk", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119250583}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The al acarte resteraunts should all be air conditioned,in some of them the food was very good but it was not comfortable to dine in that humidity.If some have air con then why not all.", "title": "Destination Weddings/", "helpfulness": 1, "user": "cindy B", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119242315}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The following did not bother me but if you like been around the pool then you will have to take part in the towel on the sunbed fiasco.We stayed in akumel so we just got a bed on the beach and walked the 20-30 meters to the pool no problem. if you want a bed at akumel set your alarm!.There are signs telling you not to reserve beds but like any other place in the world it is ignored and this hotel will not enforce the rule.This situation resulted in a fight between 2 men over a sunbed on our second week,not a good sight .Cant see how this problem will ever be solved but cant really hold the hotel responsible for the selfishness of some people.Went on one trip to Coba and Mayan village and it was brilliant.", "title": "A very good holiday.. and some things you need to know!", "helpfulness": 25, "user": "Ratbags", "date": "October 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119137691}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "My brother in-law used Honeymoon Consultants for their destination wedding. I was kind of skeptical about giving any kind of information to a third party but they were so professional and very helpful in every way. The only thing that I had to worry about was getting to the airport on time. Once we arrived at the resort, the staff were very friendly and helpful. They informed us this resort has 2 other resorts attached to it. Akumal, Talum, and Coba. All of which are beautiful. They have theme restaurants at each resort. You get 3 free when you stay a week. I recommend the Japanese restaurant as they put on a wonderful show when they cook in front of you and also the Brazilian restaurant. Everything was perfect! The room, the food, the beach, and the staff. Absolutely PERFECT!!! We had the most wonderful time there. I totally recommend this resort as well as the Honeymoon Consultants for a wedding planner. My family is thinking of going back to the resort next year.", "title": "Don't miss this one", "helpfulness": 4, "user": "Gaz56", "date": "October 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119116211}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Hubby and I have just returned from Gran Bahia Principe Akumel from a two week all inclusive holiday. We were after a relaxing and chilled holiday.", "title": "SO DISAPOINTED", "helpfulness": 3, "user": "voyiageur", "date": "October 8, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 119058261}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Just got back yesterday from a week at the GBP Akumal. Prior to this trip I had never stayed at an all inclusive and didn't think I would enjoy it as much as renting a condo, I was wrong! Two biggest complaints - its far from the airport but you can't fault the resort for this just expect a bus ride! Second would be there is a lot of rude people, not staff it's hotel guests who have ridiculous expectations and attitudes. Now to discuss the great- We tried 3 ala cartes (Brazilian, le gourmet and fruites del mer) all had great food. We chose not to use our final a la carte as we enjoyed the buffet much. Almost too much selection, do a lap before you start taking food! We went to the Coba buffet as well, it was also good but pretty much the same food as Akumal. - the rooms were very nice. Didn't try the jacuzzi tub but others did and they enjoyed it. Check where your shower head is pointed before you turn it on! The beds are very very hard, however never did I feel sore when I woke up or have any trouble sleeping. We tried to make sure we tipped the cleaning lady (thank you Julia) and the guy who restocked the fridge every day. If we forgot it didn't make a difference everything was well done we left a note in our fridge requesting only diet soda and that's what we got all week. - The grounds are very well maintained, and you can see a lot of animals! Tequila boom booms are still as powerful as just tequila so watch out. The bartenders are for the most part great, you'll just learn which ones pour heavy or light. The tram drivers are the greatest and will save your feet after a long day or help you make your a la carte in time. I'm sure there's more I could add but just know its a great place. Just remember you're in a foreign country expect that they may not speak English very well ( this really bothers me as I've never met a Spanish speaking person in Canada demanding perfect Spanish!) Also keep in mind that you're on holidays make the choice to enjoy yourself and don't sweat the small stuff!", "title": "Love love love!", "helpfulness": 10, "user": "Saskagirl", "date": "January 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 123429328}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "I rate this resort One of the best I have been to in Mexico", "title": "Had a blast in 2008 will be going again soon the shows where awesome food was great and staff made you feel like there family", "helpfulness": 2, "user": "cuttie68", "date": "January 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123332490}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We were at the Akumal back in November apparently just prior to the RUSH", "title": "Wonderful", "helpfulness": 2, "user": "frohls", "date": "January 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123321698}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Not sure I'd like to be there or in the area at High time.", "title": "Gran Bahia vs. Adventura Spa Palace", "helpfulness": 13, "user": "Harry K", "date": "January 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 123177359}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Regardless, No complaints, staff were attentive, polite, and helpfull, if your not interested in the time shares make them aware of it and they generally leave you alone.", "title": "Beautiful place", "helpfulness": 7, "user": "adj311", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123155782}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 178, "average": 385, "very good": 1155, "terrible": 93, "excellent": 2486}, "aka": "Bahia Principe Akumal", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}}