{"user_rating": 4.5, "review_count": 1006, "name": "Grand Hotel Minerva", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "We really like the Grand Hotel Minerva. It was our second stay and it won’t be our last. It has the feel of a business hotel but with grace and style. It’s right around the corner from the main train station and within a short walk of the Duomo and the Ponte Vecchio, in short right in the middle of everything. Our room was spacious and our bathroom enormous. A very nice breakfast was included in the reasonable price. In the evening they have a great free appetizer spread in their small bar. The public rooms are pretty and pleasant for sitting. It’s a great place for a group occupying 2 or more rooms. You feel very comfortable waiting for folks to gather at the beginning or end of a day of sightseeing.", "title": "Business hotel with elegant style, great for tourists too", "user": "FloridaTravelmum", "date": "December 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 90335265}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "This hotel is exquisite! It is our favourite in the World, we have stayed there many times and never been disappointed. The staff are extremely friendly and helpful, it is immaculately clean, the breakfast is great, location great. The icing on the cake is the pool on the roof, overlooking the Duomo, the pool is very cool and very welcome. We love it here so much that when we go to a different hotel in a different location we find ourselves pining for Minerva!!!!", "title": "MULTO FANTASTICO", "helpfulness": 1, "user": "Emma-RoseCaulfield", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90049888}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "If there was an Italian word for Welsh Hiriaeth, this hotel would have it!!!!! We cannot wait to return, again and again!!!", "title": "Exquisite! Best Hotel Experience Overall!", "user": "Jbratcher2544", "date": "November 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88290370}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We took a tour with Perrillo Tours in March 2010. This was our second hotel that we stayed at during your 10 day tour and I have so much to compliment this hotel on that I do not know where to begin. This is exactly what I imagined Italy. We got into our room that overlooked the Piazza Santa Maria Novella and our ceilings were between 10-15ft high and the windows went to the top. They were huge I opened the windows to allow the cool breeze in and you heard the church bells, people laughing, playing, the locals playing football (Soccer in USA). It was incredible. The next morining we awoke and had an amazing breakfast. Hotel staff was great. Right near the train station and the restraunt Boca Mario which was delicious! Near the shopping and the uffizzi gallery. No complaints at all! Room service was impecible. Would recommend this hotel to everyone! We loved it and look forward to our next trip! The only thing that was a bit of a concern were all the gypsies that flocked the area when they knew there were tourists. They would not leave us alone but that is no reflection on the hotel or the staff there.", "title": "Fantastic Hotel - an experience", "helpfulness": 1, "user": "adammatthew", "date": "November 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 88226059}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We came to Florence (Firenze) for a family wedding in late August - We booked this hotel in April and we did not expect too much but when we arrived we were absolutely overcome with how friendly the staff were - our room comfortable and the bathroom was fine. Breakfast is one of the best features as the food caters for EVERYONE (whatever diet) in a quiet and relaxing atmosphere. The roof top pool is pleasant (with fantastic views) although we never used the pool we did have a late night drink by it on a couple of occasions! Drinks are expensive and the Hotel do not do themselves any favours by charging so much - \"supply and demand\" may be a more profitable option for them as most guests choose to drink elsewhere at cheaper prices! The hotel could not be in a better position - central is an understatement - you have everything at hand - good restaurants and we found them not to be quite as expensive as we thought - for one of the better meals it cost (for 2 of us) about Euros 90 including a bottle of wine - but you can get cheaper for a lot less (they do have a McDonalds but not our scene!). A MUST if you visit Firenze is to take the open top bus around this beautiful city - there are two tours and I recommend you take both - Red tour and Blue tour - useable over 48hrs so you dont have to do both on the same day and extremely good value! - its the way to see Florence (Firenze). Hope my comments have been useful - We will certainly be going back again and when we do we will without doubt stay at the Grand Hotel Minerva - location, everything, FANTASTIC!!!!!", "title": "Great location and very friendly reception staff", "helpfulness": 1, "user": "Nazli93", "date": "November 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 87654902}, {"rating": 3.0, "title": "not terrible, but not great either", "text": "When we first checked in we were brought to a room that was right next to a side stairwell. WIthin the first 10 minutes of being in the room, we were already annoyed at the sound of people stomping down the stairs (no carpeting= loud, echoing stairwells). We asked to switch rooms and the lady at the front desk didn't seem pleased. First she said that there were no available rooms left- I told her that I didn't buy it. Then she said that she had a room overlooking the piazza but that it would probably be \"too noisy\" for us. She failed to mention that it was a smoking room- when we got the the room, and we realized it was a smoking room due to the smell, I had to ask for yet another room. I think she got sick of dealing with us, because the next time we were given a room with a beautiful view of the piazza and duomo! So, although the front desk lady wasn't happy, we finally were.", "user": "olliebaba", "date": "October 3, 2010", "id": 81984497}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The hotel has a very tired look. It seems that they probably tried to update it a few years ago but it just feels cheap. For instance, there are very strange pictures of doors plastered on the actual room doors- i think to hide the old, thin doors. Also, all of the wood in the room (such as the armoire and the molding) is painted to look like it is wood- the grain is painted on. Very strange. You can hear everything that is happening in the hall when you are in your room, because the walls and doors are so thin.", "title": "Great location, comfortable large room, good breakfast", "user": "msbend", "date": "September 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81115375}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "On our second night, we were laying in bed watching TV in our room when there was a knock on the door. Before we could even get up to answer the door, a maid walked into the room like she owned the place- unannounced. She seemed shocked to see us in our own room- it was 8:00 at night! There is no turn down service, so we were a little confused about why the woman was coming into our room at night anyway. Needless to say, it creeped us out. She apologized and practically ran away down the hallway. Very weird.", "title": "Wonderful", "user": "KLH120191", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80667768}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "There were three positives about the hotel-- the roof top terrace, which really is beautiful and relaxing, the breakfast which was very very good with many choices, and the location. We liked being close to the train station since we took the train to and from florence, and we were only a few blocks from the duomo.", "title": "Bad value for money", "user": "kitslovesitaly", "date": "September 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 80502863}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Otherwise- not sure if we would stay here again.", "title": "Comfortable, Quiet, Relaxing Hotel after several days of travel", "user": "jacygem", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 80437402}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Nice hotel, very well situated near Florence's central station. Nice breakfast, nice accommodation and very friendly staff - good value for money considering how central the hotel is. Absolute best bit was the roof top swimming pool - stunning view across the whole of Florence. It was the highlight of the hotel for me.", "title": "Beautiful roof top swimming pool and bar", "user": "susie0607", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 82951267}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This is by far the best hotel in Florence. This is our thirsd trip to this beatiful city and I must say this hotel exceeded our expectations.", "title": "the best hotel in florence", "user": "topochka", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82896838}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We traveled by train and hotel is 5-7 minutes from train station. Rooms are specious and clean. Hotel has outside pool and nice deck where you can bring your bottle of wine and relax in the evening. Staff will try to accomodote every request, from electrical adapter to bottle opening. Every room has kettle with tea and coffee. Prior to our trip we email request to make reservations to museums and everthing was done promptly.", "title": "Great location - Good Value", "helpfulness": 1, "user": "Trickster", "date": "October 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82758317}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "St", "title": "A four star hotel trying for five stars.", "user": "Japle", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82751557}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My wife boked the hotel as a surprise, in fact the whole location was a sprecial treat to celebrate my 40th birthday. Florence is a wonderful city, more of that later.", "title": "One of the reasons to return to Florence", "user": "ItalianMama0209", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82642274}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Superb hotel in central Florence. Perfectly situated to access all the sites, restaurantsetc on foot. Goodmservice, beutifully clean and tidy and a very good breakfast. Great location within walking distance of the railway station and perfect for a short break! Would recommend to anyone", "title": "Would recommend to anyone, great hotel in a great location", "user": "Lynda M", "date": "November 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86860994}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My wife and I recently spent 10 days in 4 cities and Italy, and the Grand Hotel Minerva was by far the best property stayed at. Only a short walk from the train station, it's within an easy walk to all tourist sites in Florence.", "title": "Customer Service Understood Here", "user": "FritzP", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 85547726}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The Hotel is very clean throughout, but the best part of the experience was the staff. They understood how to make you feel welcome, and were sincere all exchanges. The front desk helped us with reservations at museums and restaurants.", "title": "Stayed in the Summer and the Winter and loved it both times!", "user": "FishPicnic", "date": "October 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84479329}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Since the AC is off this time of year, rooms can get a little stuffy, but the Bellman brought us a small desk fan to circulate the air.....we didn't ask for this, but, he had the initiative to address the concern just because we asked about the AC.", "title": "Beautiful, clean hotel with a delightful roof-top pool.", "user": "singerlady", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83579738}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The Bartender was the most fun...not only did he know how to mix a drink, he did it with a smile and great conversation. We enjoyed him immensely.", "title": "Great view from the roof and comfortable surroundings", "user": "1soupdragon", "date": "October 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83555660}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 26, "average": 76, "very good": 345, "terrible": 14, "excellent": 545}, "aka": "Grand Hotel Florence", "slim_ranking": 0.117391304348, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Grand Hotel Minerva is a 4-star superior hotel in the heart of Florence's historic center in its illustrious Piazza Santa Maria Novella, which is close to the main railway station. Florence’s key tourist attractions are all just five or ten minutes’ walk from us as well as the Congress and Fair Center. The hotel boasts 102 rooms, suites and family solutions and a breathtaking rooftop terrace (open all year round) with an open-air swimming pool (open from May to September). It also offers a restaurant with its \"al fresco\" extension on the Piazza and five meeting rooms with day light. Wi-fi is free in all common areas and rooms."}