{"user_rating": 4.0, "review_count": 171, "name": "Grand Hotel de l'Opera", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "The location of the hotel is ideal being so very central. The staff were very helpful and attentive. The room was lovely. I did not choose to have breakfast as it would have cost 20 Euros !!!!! for not very much. Instead I eat breakfast at the small cafes close by. I really enjoyed my stay in this hotel.", "title": "Great location and atmosphere", "helpfulness": 1, "user": "notsomuch", "date": "May 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 108473310}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Wonderful hotel, absolutely beautiful, great location, rooms are beautiful and large, great beds (which is rare to find in Europe)....but if you are over 6'2\" then tell them ahead of time because some of the rooms added air conditioning which brought the ceiling down to 6'4\". Breakfast is pricey but only 5 euros for basic breakfast at the Florida Cafe right outside the door.", "title": "Best place to stay", "user": "Travelinggirly", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108472897}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "After taking ages to find the hotel which was mainly my fault we arrived at 1.45pm. The hotel stated that you could not go into your room until 2pm, although the porter took us up straight away. Lovely room. We then went to ask about lunch as I was very hungray having driven from Dept 47 for 2 hours and another 40 minutes around Toulouse. The receptionist informed us that the Lunch Restaurant had closed but the Brasserie was open. We came down from the room within 5 minutes of arrival and went to the Brasserie only to be informed it was now closed!!! What an awful way to treat guests who have just arrived. We then had a disgusting meal in some cafe as that was all that was open. On returning to the hotel at about 3.30pm. I asked if I could order a plate of sandwich (room service) and informed that no food could be served until dinner only a hot drink!! We then asked about taxis to which the receptionist (porter) said it would be 20 minutes. Having gone outside and walked round the square we found a taxi rank actually right outside the hote!!! We went and saw the faboulous Kylie in concert and returned to the hotel at 11.30pm. We went to the bar to get a drink to be told by the PORTER (no staff) that it was closed and we could not get a drink at all. Disgraceful. The service of this hotel was apalling!! Will not stay there again, and would not recommend it to any of my friends or family. Very expensive, hotel decor lovely. Service disgusting! Sally DAVIES.", "title": "Not very good", "user": "hattie", "date": "March 12, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 2.0}, "id": 99861254}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "I was there this fall initially by myself and as a marketing/pr person in hospitality can be quite particular. This hotel delivered on all fronts, from the location which enables one to walk out the door to everything to the sophisticated and friendly staff, especially at the front desk who honored all of my crazy requests with a smile. This is a property where the customer is always right, my room was enormous and so beautiful in typical French style, overlooking a courtyard with a beautiful marble bath. We even had a snafu with my rental car and the hotel GM quickly stepped up and paid the entire bill. where do you find that in france? Highly recommended. kh - santa barbara, ca", "title": "THE ONLY SPOT IN TOULOUSE", "user": "link2koli", "date": "January 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93898475}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "How may I say: I don't know, but it's a prostit***palace (?).", "title": "The worst in Toulouse at this price range you can get - bed bugs for free.", "helpfulness": 3, "user": "myreisen", "date": "December 8, 2010", "detail_rating": {"cleanliness": 1.0, "location": 5.0, "service": 1.0}, "id": 89352473}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I would not have bothered to write to Trip Advisor about the poor breakfast service, mould on the fruit and grey four day old fruit salad. However, a complete nightmare with their poorly designed Wifi system. The sign up which if you could get it working (after paying 12 euros and 16 didgits login and password, email address, and full name every few minutes) managed to deposit a virus on my computer that refused to remove the website sound. I spent five hours of my day trying to get rid of it. One bellman although apologetic, suggested I just turn off the sound on my computer. Eventually late in the night, Stephan and Christian two bellman sorted it out, as they had seen this issue before. Both very professional in a tough situation, but what a waste of my holiday!", "title": "Four day old fruit salad", "user": "gteg", "date": "May 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 64321035}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Not a bad location/decoration, lazy breakfast staff.", "title": "Beautiful hotel with poor service", "user": "Avega-Ra", "date": "April 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61938446}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "If you do stay don't use the internet and eat breakfast somewhere else.", "title": "Great location, average hotel", "user": "Traeth", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60567137}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "This is a beautiful hotel with cozy rooms and luxury decorations. The position is excellent – right on the central place of the city. It was a pleasant place to stay in.", "title": "Great Location, very flowery!", "helpfulness": 1, "user": "01stuff01", "date": "July 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 17554904, "likes": {"liked": "— location", "disliked": "— price and flowery wallpaper"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "But! From our point of view the service didn’t correspond at all to the level of this hotel.", "title": "Red Velvet Walls and Curtains- Help!!!", "helpfulness": 4, "user": "Dedphred", "date": "July 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8217606, "likes": {"liked": "— Pleasant staff and service personnel.", "disliked": "— The rooms, decor, noisy hallways, dated appearance."}}, {"rating": 2.0, "title": "Terrible climate control, very nice rooms and location", "text": "Location is outstanding and the hotel is clean and very impressive. We were there three nights and the air conditioning is terrible or really non existent! For this reason, we woould not stay again", "helpfulness": 1, "user": "rleb22", "date": "October 12, 2010", "id": 83177128}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Stayed here for just one night. on check in they gave us an upgrade to a suite as we had a young infant and they figured we could use the space.", "title": "a fantastic location with very friendly staff", "user": "stantheman2", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83043871}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "our room was oddly but lushly decorated in red....not to everyones taste but it worked somehow!", "title": "Good location, but........", "user": "eschatology", "date": "October 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82334896}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "the hotel is in a brilliant location. the breakfast was good without being amazing.", "title": "Charming hotel with perfect location and service", "user": "KirstenfromRWC", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77748069}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "overall i couldnt praise the staff highly enough - they were very helpful", "title": "Comfortable and well located hotel in the centre of Toulouse", "user": "Rob1010", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 67215557}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Lovely stay, room large enough, really great position. All the hotel staff were excellent and helpful, the only unfriendly one was not employed by the hotel but by the spa.", "title": "We really enjoyed our stay", "user": "ZeusnGoose", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117721392}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Very nice 5-star hotel in the center of Toulouse, with a real character. Most public areas are simply perfect, however with a very ugly breakfast room. Also breakfast quality is not as expected by this hotel level. Finally the spa facilities (sauna, etc.) are not well organized and quite difficult to use (small places, no service, etc.).", "title": "Very stylish hotel, some details need attention though", "user": "Vangelis31", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 117311134}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Extreameley central, quiet rooms. Ten minutes by taxi to aireport.", "title": "We loved it and we'll be back", "user": "elwahlst", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115957443}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This hotel is very unique and individual - the staff are friendly, professional and warm and all minor issues were dealt with immediately and effectively, didnt even need to say room number after the first day!! The rooms are nicely done in sumptuous reds with nice Matisse drawings on the walls. Free wireless throughout the hotel was a bonus. The location is fantastic -you could not get more central!! Lovely little 'tourist' restaurants on the main 'Place', with some lovely restaurants a few mins walk away from hotel in Place Wilson or Place George!!", "title": "Lovely individual hotel, lovely staff, excellent location - a pleasure!!", "helpfulness": 1, "user": "BABoySussex", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115363822}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We really enjoyed our stay in Grande Hotel de lOpera and would highly recommend it!!", "title": "Convenient hotel in city centre", "helpfulness": 1, "user": "BrandonDublinIreland", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 111840955}], "location": {"country": "France", "region": "Midi-Pyrenees", "continent": "Europe"}, "stars": 4, "variance": {"poor": 16, "average": 20, "very good": 68, "terrible": 6, "excellent": 61}, "aka": "Grand Hotel Toulouse", "slim_ranking": 0.107913669065, "description": "Deep in the heart of Toulouse in a picturesque setting, a former convent building dating back to the 17th Century is, today, one of the finest boutique hotels in southwestern France.With a reputation for luxurious living in exceptionally charming surrounds, Grand Hotel de l'Opera is the epitome of French country style and yet it sits in the epicenter of place du Capitole, the vibrant arcaded heart of France's fourth biggest city.Opposite the city's famous theatre, Theatre du Capitole, the stately hotel is perfectly placed to combine peace and tranquility with business matters or an exciting city break."}