{"user_rating": 4.5, "review_count": 243, "name": "Grand Hotel Convento di Amalfi", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Pros: wonderful views and location. hearty breakfasts. Comfy rooms - we had a terrace though the hotel has many public spaces for views. Facial and massage in spa were good. Friendly staff.", "title": "Fantastic views, comfy rooms", "user": "CPThomas", "date": "October 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182586253}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Cons: no tea or coffee making capabilities in room or iPod stations which I would expect for 5 star. Exorbitant parking fees.... Googleprivate parking instead. We did and paid eur 14 pd nearby instead of 25. Aactually, you don't need a car at all along the coast. We wldnt have one if we went back. The other con is that although the breakfasts were hearty, the cheese and ham options were not commensurate with 5 star (more akin to cheaper supermarket cheese).", "title": "Beautiful views", "user": "Jana T", "date": "October 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182540229}, {"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed at this hotel during our recent stay in Amalfi and loved it. Everything was as described on the website. The hotel and rooms have beautiful views and the hotel is centrally located in Amalfi. All the staff was extremely helpful at all times and always very nice and polite. Our room was also very nice with a quiet location, plenty of clothing space and a large bathroom. We will absolutely stay in the hotel again and will recommend to any friends traveling to the area. We ate dinner at the hotel our first night and it was fantastic. One of the top 5 meals we had over 10 days in Italy.", "title": "So stuck up!!", "user": "siobhan_flute", "date": "October 25, 2013", "detail_rating": {"location": 3.0, "service": 1.0}, "id": 182386408}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We are just back from Amalfi and this was one of the hotels we considered staying at so we were eager to have a look and see if we had chosen correctly to stay somewhere else. We also wanted to check it out for future trips to Amalfi. We were going to go to the bar for a drink. You enter the hotel from the road and have to get the lift up to the main hotel. There was no-one there to show us where to go so we thought we would investigate further. As the lift doors were closing the doorman came running towards us demanding to know what we were doing. We explained we wanted to go to the bar, and he said that was impossible. When we asked why he replied that the bar was closed. This was clearly a lie as it was not even 9pm. I don't know why we weren't good enough for this hotel (despite the fact we were staying 5* just along the road) but I can't stand attitudes like that. I name dropped the bar manager as we'd been talking to his wife earlier that day and she said we should definitely go. This seemed to give us the go ahead to go to the bar but after being treated like that there was bo way I wanted to stay there so we left. Rude, stuck up, pretentious, I'm so glad we opted not to stay there after all.", "title": "October stay", "helpfulness": 1, "user": "150Welltravelled", "date": "October 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182308799}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Superb location with stunning views over Amalfi and the coast. We were lucky enough to have an excellent private balcony but the hotel provides lots of pubic space to enjoy the views to. The breakfast terrace is peaceful and beautiful and serves delicious melt in the mouth pastries. Rooms are small but clean. No tea or coffee making provided in rooms but everything else was there and in good working order. No problem whatsoever with Wifi. The hotel staff were friendly and attentive and spoke English very well. The hotel could do with publishing it's GPS co-ordinates as a little difficult to find if arriving by car after dark as we did. Look for the entrance just before the second tunnel on the right as you leave Amalfi town. Valet parking is a bit costly at 25 Euro's per day but necessary. Hotel can only be entered via two lifts too take you up the cliff side. We did see a guest in a wheelchairs so disabled access must be possible, though you could not have accessed our room due to the stirs if frail elderly or disabled. Wonderful time of the year to visit (mid October) as still warm but not as crowded as in the summer. If comparing with 5 star in a major city then no it is not but comparable, but if you keep in mind that you are in an old coastal resort and you are paying for a clean well presented well sited hotel with very pleasant staffing you will not be disappointed. We will most definitely be thinking of visiting off season again.", "title": "Amazing views of beautiful little Amalfi", "helpfulness": 1, "user": "SMYong", "date": "October 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 182224142}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 5, "variance": {"poor": 12, "average": 19, "very good": 40, "terrible": 4, "excellent": 168}, "slim_ranking": 0.225806451613, "description": "Housed in a 12th century monastery featuring a 13th-century Norman-Arab cloister, the Grand Hotel Convento di Amalfi is found on the \"Loggia\" and the \"Passeggiata dei Monaci\" (panoramic walk overlooking the amazing Costiera Amalfitana; probably the most painted views in the world).The Grand Hotel Convento di Amalfi has been totally refurbished and harmoniously blends modern comforts with the hotel's historic past."}