{"user_rating": 4.5, "review_count": 1247, "name": "Grand Hotel Francais", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "This Hotel was perfect for us. Spotlessly clean, very comfortable and in a lovely part of Paris although not that close to main attractions the metro's were very close.", "title": "Perfect", "user": "Ang3", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63749508}, {"rating": 5.0, "title": "Fantastic Experience", "text": "The staff were most helpful and very friendly at all times. The breakfasts were lovely and set us all up for the days ahead.", "user": "BGMoss", "date": "May 9, 2010", "id": 63656687}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I would definitely stay here again if I were to visit Paris.", "title": "Very average hotel", "helpfulness": 1, "user": "iheartusc", "date": "May 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 63536926}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed at the Grand Hotel Francais for two weeks in April. We have traveled extensively in Europe over a 20 year period. The room, the service, and the assistance provided by everyone at the hotel, and especially Zyad, was unparalleled. While it is true that the hotel is far from the major attractions, it is just a block or two from two major metro stops. The neighborhood was full of great eateries, safe, and enjoyable.", "title": "Everything was fine until last day - manager/owner extremely rude", "helpfulness": 13, "user": "Juniegirl", "date": "May 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 63253774}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Why I loved this hotel and the wonderful service:", "title": "GOOD VALUE HOTEL", "user": "thomassino", "date": "May 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62934729}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This was my wife and I's first trip to Paris so we weren't too sure what to expect when it came to hotels, but we were satisfied. By reading all the reviews my expectations were very high. Unfortunately they didn't meet my escelated expectations, but the experience was still fine. The staff was average, nice and informative, just like any other hotel. The rooms were small yet nice...you don't need a big room when you are in Paris...you should be outside except to sleep. They were clean...housekeeping was alright...no shampoo/toothpaste. They wanted to charge us 10 Euros pp per day for breakfast, so we just walked to the local bakery every morning on the way to the metro and saved a bunch of money that way.", "title": "This hotel was just fine.", "user": "dannykessel", "date": "May 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 64205395}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The location was perfect, as before mentioned, 2 metro stations within walking distance and the Nation stop can get you anywhere from Disneyland to the airport to downtown. I probably would stay here next time, but I would spend a little extra time seeing if there were any other options in town first.", "title": "Our first trip to Paris was wonderful--thanks largely to this great hotel!", "user": "Shaw11946", "date": "May 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64165903}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "We picked Grand Hotel Francais largely based on two things: price and Trip Advisor ratings. It was our first trip to Paris (part of a dream swing through Europe), and we stayed three nights.", "title": "Can't even say how grateful I am to have been stuck here during the Volcano!", "helpfulness": 1, "user": "KimEandKarenM", "date": "May 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 64010357}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I'm trying to think of one or two negatives to make this an honest review, and I really struggle to come up with one. The room was small, but that's not unusual in any city, let alone Paris. But it was very comfortable and efficiently cleaned. We sprung for a balcony, which was small but a nice feature. The breakfast is nice--coffee, danish, cereals, fruit, yogurt. The hotel isn't much to look at from the street, but it's a nice, older building, and the interiors are quite modern and lovely.", "title": "At times it was like being in a Peter Sellers movie", "user": "Nosnom", "date": "May 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 63966376}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "Two big things I want to emphasize, after reading reviews here:", "title": "Very nice hotel", "user": "walvis32", "date": "May 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 63921016}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had a good one-night stay here, the last night of our Europe trip and our 8-year wedding anniversary. The room was nice, if small, with two cute little balconies. There was parking (expensive, but hey, it's Paris) nearby for our car. Great little neighborhood. Ok Metro access (though not at your doorstep). We didn't think that much of the breakfast compared to other places we'd stayed on our trip, and this was the second most-expensive hotel we stayed at. Overall, we recommend, but don't let the high TA ranking give you false expectations. It's a nice, serviceable hotel, but not exactly the Ritz. Not a great value, but you don't feel you overspent.", "title": "We had a fine experience here, but don't let this hotel's high ranking give you unreasonable expectations", "user": "jrf25", "date": "September 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 80984833}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My husband and I live in London and travel to Paris two or three times a year for leisure. Since discovering the Grand Hotel Francais in November 2008, we've stayed nowhere else in Paris. Zyad is the most gracious hotelier, the rooms are clean and comfortable, and we love exploring the 11th, with food hotspots on the rue Paul Bert within walking distance, and Le Chateaubriand also close by. On Sundays, the Vietnamese treats in nearby belleville are a good option, too. The 1 from Nation takes you easily to the Marais and Right Bank sights, and from a nearby bus stop, you can travel quickly to the Left Bank on mass transit.", "title": "Even after my sixth or seven stay, Grand Hotel Francais still impresses", "helpfulness": 2, "user": "RWAppleWannabe", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 80450321}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I'm not a huge fan of the ground-floor rooms since they get very little natural light (the 'rainforest' showers are superb, though), but otherwise, GHF really is the perfect hotel and excellent value for money. Our last visit in early September reinforced this impression once again.", "title": "A Great Base for Visiting Paris", "helpfulness": 2, "user": "mpalbuquerque", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 79960182}, {"rating": 5.0, "title": "super clean rooms & friendly staff", "text": "We booked this hotel to bookend arriving and departing for a couple of weeks we were in France for a wedding. It was very highly recommended by others on TripAdvisor. We totally second the motion. The beds were so comfortable that sleep was a dream. The rooms are small but very nicely appointed. The Owner and staff couldn't be more helpful, even when we had to chance one of our reservations after we arrived. Plus I personally really liked the neighborhood which is not touristy feeling at all but within easy access to anything we wanted to do. And there internet which was free, is the best I've had in any hotel anywhere.", "helpfulness": 2, "user": "pkk29", "date": "September 15, 2010", "id": 79713387}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The room was very, very clean. I am very sensitive about smells, but I had no problems with this hotel. The bathroom was tiny but very clean and modern as well. My only issue was the size of the room, but I think that this is pretty typical in Paris. The staff was also very helpful. They had maps of the city at the front desk. The hotel is very close to the metro and is surrounded by tons of restaurants, bakeries, and supermarkets within walking distance.", "title": "Hospitable staff", "helpfulness": 2, "user": "borgir72", "date": "September 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 79089606}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I came to Paris couple times now and always stay in different places.", "title": "My number one !", "helpfulness": 2, "user": "Lojerey", "date": "September 9, 2010", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 78930640}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "And Grand Hotel Francais was very very good hotel in my opinion. The staff was fantastic as they are all very friendly, accomodating. If any questions, i am sure they can help as they always volunteer with lots of helpful information. They helped me with directions, new places to eat and new fairs as well.", "title": "Fantastic!", "helpfulness": 2, "user": "ZWheeler", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78887995}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The single room i got was quite small but comfortable. In the end, i only need it for morning and late night sleep.", "title": "Nice Place at a reasonable rate", "helpfulness": 2, "user": "Willgetby", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78764912}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "One thing to note down is that i had internet there as well, useful thought from the hotel !", "title": "A very comfortable stay at the Grand Hotel Francais", "helpfulness": 3, "user": "RonJulia", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77381320}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "Anyway, i think this is a very good hotel and worth to visit and even come back for the second time!", "title": "Great Value in an idiosyncratic part of town!", "helpfulness": 4, "user": "crunchberry", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77167609}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "So, I am a bit late with my review, but I felt I needed to give Grand Hotel Francais the praise they deserve. This was my second time to Paris, the first time I stood in not such a great hotel. The second time, I made sure I did my research and I am glad I chose to stay here. It is a small boutique-like hotel. Very clean. The staff were great. The free wi-fi is a plus. Breakfast was good and plentiful. Location is convenient. (5 to 7 min walk to the metro). If I return to Paris I would without a doubt return.", "title": "Please book this hotel", "helpfulness": 4, "user": "V1210", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76685105}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel was very easy to find from Nation metro station, and we were greeted by a very helpful and friendly receptionist, who, as we discovered later on, always said hello and goodbye as we arrived and left. She gave us a map and told us the best way to get around, and which metro stations were closest to which sights. They were also very helpful in enquiring at our next hotel as we were checking out, as our French wasn't really up to it! The lift is a welcome sight, and the rooms are beautifully decorated and we had a little balcony over the road below. The bathroom was extremely modern and clean with a power shower, coming with the hotel's own slippers, and various little bottles of things! There was a TV on the wall and a safe in the wardrobe, the room was very comfortable and air conditioned, and also came with a fridge and minibar, which was ideal for cooling bottle water our excursions. The breakfast was great, with a nice variety of yoghurts, breads, pastries and cheese and ham, which was more than adequate for the day! We would definitely recommend this hotel, and hope to return if we're ever back in Paris, definitely worth more than its three stars!", "title": "Magnifique!", "helpfulness": 4, "user": "amex0410", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76343179}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My first visit to France and Europe was great fun. We stayed at this hotel for 4 nights and the staff were very friendly, helpful and entertaining. We found some really enjoyable restaurants/cafes nearby and some great meals with the help of the front desk. They helped us find wine and cheese shops and advised us on the best place to see the Tour de France. Yes the room was small but I suspect this is common in Paris. The room looked recently updated and was clean and comfortable. The breakfast was good. Time spent in our room was just for sleeping, so the location near the Nation Metro in a safe area, near food and shops was most important for us with only 4 days to see Paris. Our expectations were completely met.", "title": "Paris was great fun -- Grand Hotel Francais near metro with helpful and friendly staff.", "helpfulness": 4, "user": "ch3r0k33", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75854797}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We enjoyed our stay at Hotel Francais. When we booked in we were upgraded to a superior room. This was actually our last stop on our mini Euro-trip. The rooms were smaller than the other hotels we stayed at on our trip. The breakfast could have been better, we had better at our other hotels. It was included in our package so we went to have coffee and just some cereal. We picked this hotel because of the reviews. The service was one of the best. The rooms small but clean. I must say that I had the best night sleep at this hotel. I felt very comfortable asking questions. Whatever I asked I always got more than just my answer. Zyad is actually the owner of the hotel. He is there all day. He is very helpful along with his staff. He cares about his hotel, his staff and his guests. They also ironed my clothes and did my laundry(folded) for FREE. Wifi is also Free. We needed a charger for our IPod and they had that too. I think this hotel would be a 4 star hotel if the breakfast was better. I just feel there should be more options for breakfast if you are paying for it. Just had 2 kinds of cold meat, American coffee, 2 kinds of cereal, 4 or 5 kinds of Croissants, orange juice, apple juice, 3 kinds of cheese, and 2 kinds baguettes.", "title": "Great Hotel", "helpfulness": 5, "user": "lovetotravel12377", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75448801}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Location wise, it was fine. The metro was really close. It wasn't right in the center of any sights but Bastille was about 20 min walk. We took the metro everywhere, and no matter where you are, if you want to see other sights you would prob have to take some type of transportation. Everything was easy to find. The metro lines we used were really good to get to anywhere we wanted. We took a cab from the train station for about 13 euros. The cab to the airport was about 40 euros since there was no traffic.", "title": "Ideal, modern, conveniant Parisian Hotel", "helpfulness": 3, "user": "RobinHB", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75341519}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed in this hotel to celebrate our joint 30th birthday and really enjoyed our stay. The rooms were quite small but really well decorated. The location was good - there is a metro station opposite and is fairly close to the big interchange at Nation. There are also some fantastic pattiseries close by and a supermarket for your convenience. Staff were very friendly and helpful. We would definitely stay here again!", "title": "Lovely boutique hotel", "helpfulness": 2, "user": "vicki1978", "date": "October 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81697617}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed 3 nights at the end of 5 weeks in France. Chose the Grand Hotel Francais because of its excellent reviews on Trip Advisor, and we weren't disappointed!", "title": "Look no further for a great place to stay!", "helpfulness": 3, "user": "hooray4hollydaze", "date": "October 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81692550}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The hotel is clean and very well run, and concierge staff were very helpful, provided us with a list of local restaurants, called taxis and were very friendly and most charming.", "title": "Great Place to Stay In Paris-A Great Value", "helpfulness": 3, "user": "Texastraveler011", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 81259712}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We were upgraded to a superior room, which provides all you need for a stay in Paris - great comfortable bed, bath (or shower) with plenty of hot water, plus great water pressure, tasteful decor and nice quality toiletries. Rooms are a good size by Paris standards. The hotel is located within steps of the Paris Metro, so all the major tourist attractions are minutes away. This is really good value for money. Ten out of ten!", "title": "Great Experience", "helpfulness": 3, "user": "arosen52", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81139479}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "If you want a hotel that is not in the heart of the tourist area, yet convenient to the Metro, R&R, and other public transportation, consider this one. Zyad (owner/manager) and his staff do everything they possibly can to make your visit enjoyable. Very fluent in English (and several other languages), they go out of their way to be helpful. Rooms, while small, are entirely adequate and spotlessly clean. The shower is the best in Paris. This is a great place to stay particularly if your knowledge of the French language is as limited as ours.", "title": "Place to represent Paris", "helpfulness": 3, "user": "durkatheleen", "date": "September 26, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0}, "id": 81009776}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This Hotel should not be #7 on your top Paris Hotels list - it should be in the top 3!", "title": "C'est formidable!", "user": "NandDP", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 61801079}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "A really great little family run hotel. Extremely hospitable and helpful staff, spotless dining-room and bedroom and excellent breakfast. Book with confidence if you are happy to stay in this part of town.", "title": "Couldn't have found a better place in Paris", "user": "tvdudee44", "date": "April 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61781796}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "All the prior reviews for this hotel are all true it is a great place to stay and about two blocks away from the subway that will take you anywhere in Paris you would like. The staff was very helpful with directions or places to eat all with a smile. It is not true what they say about the French all the people I met could not have been kinder. The room was awsome on the 5th floor with a balcony that with a breathtaking view of Paris either day or night. The breakfast was a great way to strat each morning just have to make sure not to eat too much. The room looked like it had been remodeled not long ago and the bathroom had enough room with a great shower. There is no coffee or tea in the room which is the only thing I would have liked to see. If you want a nice hotel at a great price you have to check this place out you will not be disappointed!", "title": "A perfect minimoon!", "user": "Chica_Escocesa", "date": "April 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61609426}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "I booked this hotel for a mini honeymoon based on the other reviews from Trip advisor and was not disappointed! The hotel is located 2min walk from rue des boulets metro station which is great to use for seeing the sights. The rooms were small but you don't go toParis to stay in the hotel room! They have all you need: free safety deposit box, fridge, hair dryer, large flat screen tv... list goes on! Also, they were very clean. Breakfast was usual continental style and plentiful. The most impressive aspect of this hotel is the staff - very polite and helpful. I would definately recommend this hotel.", "title": "Cute little hotel", "helpfulness": 1, "user": "StephTravelin", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 61259717}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Nice little hotel out where the real Parisian's live. Or at least that is what we were told. The staff was very friendly and helpful. We upgraded to a room with two twin beds. Very much worth it if you are traveling with a friend. The room was tiny but had a charming little balcony.", "title": "Great Stay for Weary Business Travelers - We'll Be Back", "helpfulness": 2, "user": "vinyrdlady", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60570445}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We changed to this hotel midway through a two-week stay in Paris, and though the first hotel was a 4-star, this \"3-star\" hotel felt MUCH more luxurious!", "title": "Slightly sleepy neighborhood but outstanding hotel experience more than worth it!", "user": "jsbalach", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 62890148}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Location is decent, in the 11th arr. Kind of a sleepy neighborhood but one block from the Rue de Boulet (sp?) metro stop and a 10 min walk to the larger Nation stop. Also a very pleasant 10-15 min walk to the Bastille/ Marais location. Just on the other side of town from the museums, Eiffel, Arc, etc. But not really an issue because the metro stop is so close.", "title": "FABULOUS!", "helpfulness": 1, "user": "glitterverse", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 62470352}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Front desk is excellent- very helpful and cheerful. Rooms have great modern feel and though smallish (very good by Parisian standard) feel spacious. We were graciously upgraded from a standard to a superior room. Bed was REALLY comfortable and there is A/C in all rooms! Thoughtful free bottle of water and two cans of Perrier in the fridge, which is also nice and empty for the fruits and cheese you will probably buy (not full of crappy/ expensive liquor you won't drink)! and big plus- FREE WIFI in your room! (you just have to get the code to login to the password protected connection from the front desk)", "title": "Fantastic, Fantastic, Fantastic......", "helpfulness": 2, "user": "JaneySue", "date": "April 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62330416}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This was our first trip to Paris, I am so glad we chose this hotel!", "title": "Great location! Even better value for money.", "helpfulness": 1, "user": "hoosenpoon", "date": "April 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 62328552}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My partner and I stayed at this hotel for 4days/3nights.", "title": "Absolutely Superb", "user": "ClaireyCro", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61980421}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 14, "average": 52, "very good": 357, "terrible": 6, "excellent": 818}, "aka": "Grand Hotel Paris", "slim_ranking": 0.0167317345231, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Its individually decorated and personalized guestrooms and suites are soundproofed and offer elegant accommodation. Each room has air-conditioning, flat-screen TV and free Wi-Fi internet access. The well-equipped rooms feature contemporary decor and warm colours. The bathrooms include a massaging shower or bath. The Grand Hotel Français is situated in Place de la Nation, near Place de la Bastille, the fashionable Marais district and the lovely district near the Canal Saint Martin."}