{"user_rating": 4.5, "review_count": 877, "name": "Grand Hotel Savoia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "This was the first hotel I stayed in following several days of hiking in Cinque Terre. The hotel is very convenient to the Principe train station...probably just a couple of blocks from there to the hotel. It was so nice to have a large bathroom with a big shower and nice amenities. The room was furnished elegantly and the staff was extremely professional. In particular, Luca was an amazing bartender. The bar was a terrific place to relax after a long day exploring Genoa. Luca was a pleasure to talk with and compare stories of our favorite Ligurian locations. He is extremely knowledgable of not only the area but also the wines associated with each region. Cannot say enough nice things about this hotel and would definitely stay again!", "title": "Elegance in Genoa", "helpfulness": 2, "user": "Bella3106", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 165455401}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "So, basically, the hotel continental Genova is sister hotels with the Grand Hotel Savoia. When you book at the Continental, you actually don't know which one they will give you a room in once you arrive.", "title": "Not sure why it has a 5-star rating", "helpfulness": 1, "user": "MarlenaTeresa", "date": "June 27, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 165400978}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We arrived around 10pm, parked, dragged out all our luggage and walked into the Continental. The woman at the desk in a bored tone told us to walk over at the Savoia and check in there without explaining anything.", "title": "Superb would definately stay again", "helpfulness": 1, "user": "mikenandmarie", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165232330}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The Savoia is just beside the Continental so its not a big deal, however, it would have been nice to get someone to help us drag the luggage from one to the other, rather than just sitting there, chewing gum and watching.", "title": "Old times luxury", "user": "TravelerMUPU", "date": "June 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 165145150}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The Savoia is 5-star while the Continental is 4-star, so one would think that being surprisingly upgraded to a room at the Savoia would be a good thing. However, I would say the Grand Hotel Savoia is the worst 5-star I've ever stayed at and I\"m honestly not sure why they have that rating. Other than a lush front lobby, this hotel is NOT a 5-star in any shape or form.", "title": "Elegant. Professional service.Beautiful room. One of the best breakfast in Italy", "helpfulness": 1, "user": "Alessandro I", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 164300285}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Located in the heart of the city, even though difficult to find it with the car initially when we walked around we realised it was very central. Walking around the town center was very easy.", "title": "Very good location, very nice hotel", "user": "kidermit", "date": "June 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 164187322}, {"rating": 5.0, "title": "Lovely Hotel", "text": "Room was stylist, bit out dated for our taste but still with a sense of luxury. Stunning lobby and breakfast room, the whole of the hotel is like out of a time capsule. A lovely terrace where he had dinner, Hotel restaurant was very good and really good value for money.", "helpfulness": 1, "user": "Paul T", "date": "June 15, 2013", "id": 164021829}, {"rating": 5.0, "title": "Excellent value", "text": "The only negative thing is that there was no internet in the room. Even though the consierge, firmly insisted there is unfortunately there was no coverage! Also the fact that you had to pay for outdoors parking, just at the square below the hotel and actually quite pricey parking was definitely not a plus. Overall though it was a nice experience.", "helpfulness": 1, "user": "Fiona L", "date": "June 14, 2013", "id": 164008594}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Just returned from a five night stay at the Grand Savoia - what can I say apart from my wife and I were exceptionally pleased with out stay from start to finish. Room was a nice size with very comfy super king sized bed, flat screen TV, tea/coffee facilities etc etc - wife particularly liked the cleaners artistically arranging her dressing gown each day after cleaning the room. Loved the roof top jacuzzi's where we spent many hours relaxing after shopping. Stayed in many hotels round the world and happy to recommend this one.", "title": "Beautiful sanctuary in a busy city!", "helpfulness": 1, "user": "Morsy2010", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163983016}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "With last minute changes to our travel plans we found this hotel and booked while travelling. The booking process was prompt and very helpful. The proximity to the main railway station is excellent. We had a classic double room on the 3rd floor and were very impressed with the size and standard of the room. For a hotel of this standard we got an excellent room rate. The amenities in the room both toiletries and tea/coffee making facilities were very good and what you expect in a 5 star hotel. The staff were very helpful and the whole ambience in the hotel was very hospitable and welcoming. The breakfast was the best we have ever had in our travels and the hotel gets top marks for a lovely setting and excellent choice of food", "title": "Beautiful Hotel & Convenient for MSC Cruise Port", "helpfulness": 2, "user": "Carl082", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163895654}, {"rating": 4.0, "title": "Loved the hotel", "text": "I checked into hotel for 2 nights June 20 and June 21 before my MSC cruise. I loved everything about the place. The only unfortunate thing was when I got back home I found out that my credit card was copied and a total of $13000 went through. During my vacation I paid cash and did not use or present the credit card to anyone except the hotel. Even on the cruise I gave a cash deposit and they did not request a credit card. When you register at hotel even though it is pre-paid through expedia they request you present your credit card and you do not see behind the counter. A word of advice.....be careful.", "user": "SAMANABahiaprincipe", "date": "July 9, 2013", "id": 166969655}, {"rating": 4.0, "title": "Good quality central hotel", "text": "Stayed here just for 1 night before heading off around the coast. Checked into our room and realised the air con wasn't working, called reception and it was fixed in 5 minutes which was good. AMAZING bed - so comfy with very soft sheets, very good powerful shower too. Breakfast had everything you could want and it was a great location next to a train station and about 15 mins walk to some of the main sights. Would stay here again. Also try their restaurant next door.", "user": "CJ7777", "date": "July 9, 2013", "id": 166921156}, {"rating": 4.0, "title": "Luxury near railway station", "text": "A high-end hotel with all the bells and whistles. Rooms are very comfortable, as can be expected. There is a spa in the basement. Location is just a few steps from the railway station. In other words, not in the touristic centre of Genova, but in a rather run-down neighborhood.", "user": "Kjetil A", "date": "July 9, 2013", "id": 166886355}, {"rating": 3.0, "title": "Nice hotel, ok location", "text": "The staff offers you friendly, but not very personal, service.", "user": "Seasonedtraveller023", "date": "July 9, 2013", "id": 166884861}, {"rating": 5.0, "title": "Excellent Hotel in Genoa", "text": "The roof bar has a great view over the bay of Genova.", "user": "davidgeary274", "date": "July 6, 2013", "id": 166490057}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We stayed here for 1 night prior to getting our flight home, it is located right next to the main train station so a great position. a good impressive reception, we did book a triple room, but when we got in to our room the was only one bed, called reception who changed the room within 5 mins, and we were given the right room, (always good that they can sort things out quickly). The room had a massive king bed with the single be like a settee, the room had a balcony which had a great view over the city, personally I think the room could have done with a lick of paint, as there was plenty of scuff marks on the walls and skirting, apart from that it was a very nice room. We then went to the roof to have a go in the jacuzzi, the top floor would be very good if there could have been somebody manning a bar as it was hot and could have done with a drink, the rooftop has some great views over the city. When we came back from our meal we had a quick drink in the bar area, where it would have been nice to get waiter service we had to go to the bar to get our 5* priced drinks!! The breakfast room is impressive with a good selection that will keep you going for breakfast, all in all a very good city / port hotel a little bit of attention to detail would not go a miss.", "title": "good central position hotel", "user": "Lee S", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165946515}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "On arrival we were delighted to see that the hotel was near the train station. Which is perfect if traveling onto the Cinque Terre.", "title": "Nice hotel, but not 5 stars", "helpfulness": 1, "user": "LK2013975", "date": "July 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 165854656}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The receptionist who checked us in gave us a map etc of the area and tips/advice which was nice.", "title": "Nice hotel in a central location but not five stars", "user": "weegiexpat", "date": "June 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 165635464}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The room was small, poor lighting, a window that looked out onto a back street.", "title": "Neither luxury hotel nor 5 star hotel", "user": "Herosemi", "date": "June 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 165597548}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "There was no iron in the room.", "title": "were hoping for a great stay...got..BED BUGS!.", "helpfulness": 1, "user": "MarrakechGypsies", "date": "June 28, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 165513056}], "location": {"country": "Italy", "region": "Liguria", "continent": "Europe"}, "stars": 5, "variance": {"poor": 34, "average": 66, "very good": 274, "terrible": 10, "excellent": 493}, "aka": "Grand Hotel Genoa", "slim_ranking": 0.0114942528736, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}