{"user_rating": 4.5, "review_count": 126, "name": "Granville House B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We spent four days at the Granville House B&B this August and we were very pleased. The furnishings are nearly new and the hosts go out of their way to make you feel welcome and answer questions about Vancouver. We had the Master Suite (Cedar Room) which fronts on the very busy Granville Road. Despite our initial qualms about the traffic, that turned out to be a non-issue. Breakfasts are described as \"continental\" but were excellent including a delicious Quiche. The bed and bath are both state of the art and give an air of luxury. I had some issues connecting to the internet service, but they seem to be on top of that issue and I'm confident they will get it worked out. There is off-street parking and the electronic access system lets you come and go without a key.", "title": "This is a winner!", "helpfulness": 4, "user": "willisjw", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8514768, "likes": {"liked": "— Excellent bed and bath and great hosts"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "This is also a great location for Vancouver. Easy access to downtown, the University, or nice restaurants. We had our best meals at the Aurora Bistro near Broadway and Main sts. Absolutely excellent.", "title": "Luxurious stay at the Granville", "helpfulness": 5, "user": "MrsTaco", "date": "August 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8464861}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We spent two nights at the Granville House and it was by far the most luxurious place we stayed during our three-week road trip. Absolutely lovely with brand new, gorgeous linens, comfortable bed, very modern bathroom and everything was impeccably clean. We did have trouble checking in, because the electronic lock instructions went to our spam folder, but as long as you make sure you receive that email, it's fine. The owners are so nice and friendly and very knowledgeable about the area - they had great recommendations and we really enjoyed the restaurants they suggested (Vij's - great, interesting indian food, Chow - probably one of the best meals on the entire trip. superb) as well as the location near South Granville. The B&B is located on a busy street, but the interior is completely silent. The breakfast was also delicious!", "title": "What a fabulous find!", "helpfulness": 5, "user": "bakinzoda", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8116321, "likes": {"liked": "— cleanliness, location, staff and hosts, quiet", "disliked": "— n/a"}}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 3.5, "variance": {"poor": 4, "average": 6, "very good": 18, "terrible": 3, "excellent": 95}, "aka": "Granville House Hotel", "slim_ranking": 0.290322580645, "description": "Vancouver's only 2011 Canada-Select 5 Star B&B! Built in 1997, this Shaughnessy mansion was renovated in 2007 to provide modern romantic luxury in Vancouver's wealthiest neighbourhood. We provide free on-site parking, WiFi, local & long distance calling. Time sensitive door codes provide hotel security & allow access convenient to you. All suites have king bed, 32\" LCD TV with free HD programming and luxurious en-suite bathroom. Enjoy pressed linens, Hutterite down duvets and pillows. Room controlled Air Conditioning, fresh air exchange and heated floors. Deluxe breakfast buffet included, from 5-11am (hot dish served 8:30-10am). Vancouver's largest B&B breakfast area with 6 individual tables. Extremely central, on Granville Street (& 35th Ave), steps to transit, 5 minutes to downtown, 10 minutes to airport."}