{"user_rating": 4.0, "review_count": 485, "name": "Gran Melia Don Pepe", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I have just returned from another excellent 12 night stay at this lovely hotel. We were greeted on arrival by Ana, one of the Red Level personnel. We were booked in while enjoying a lovely glass of cold Cava. She then showed us to our room - wow!! We had decided to try one of their Grand Ocean Suites and it was truly amazing. (see photos). Last year the hotel took 14 rooms on the 7th floor and made them into 7 suites. We spent a lot of time enjoying this room and will certainly have no hesitation in booking one next year. Walk in wardrobe, lovely sitting area with balcony, huge bed (not two beds pushed together!), another balcony off the bedroom and an amazing bathroom with twin sinks, double rain shower and very large bath. The amenities were all Clarins. We were presented with a bottle of Moët, chocolate dipped strawberries and a wonderful arrangement of fruit. We're not sure if this was because I'm a Melia Gold Card holder or because we were returnees! We so enjoyed our first evening!! The housekeeping is excellent. Everything is so clean.", "title": "Wonderful hotel, staff and location", "helpfulness": 1, "user": "Speges", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164085347}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Breakfast is the best we've had anywhere with a huge selection of everything. We even heard people ask for things that weren't on show and they were produced in minutes.", "title": "Top!", "user": "Katrin B", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164076768}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We had dinner in the hotel restaurant one evening but we weren't very impressed. There are so many wonderful places to eat in and around the old town so that wasn't a problem.", "title": "It was a pleasant Vacation", "helpfulness": 1, "user": "manuelCEC", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164061872}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The gardens are lovely but Melia please put some solar panels in and heat the pool. It's so cold and under used because of the temperature. Rafael at the pool deserves a special mention as he seems to know what you need before you've realised it yourself. He loves his job and it shows in the way he deals with everyone. Thank you.", "title": "Excellent hotel", "user": "141037", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163781501}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Our only disappointment, apart from the dinner, was the closure of the spa pool. It's being renovated and will be super once it's finished. I enjoyed the spa pool last time because the main pool was so cold. Hopefully next time it will be up and running.", "title": "lovel hotel", "helpfulness": 1, "user": "johnrDurham", "date": "June 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163679651}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I was very pleased with the choice of this hotel. Great location on the beach. Easy walk to the beach/boardwalk and marina and to restaurants along the way. Easy walk to \"old section\" of town. Quick cab ride to Puerto Banus.", "title": "Great value", "helpfulness": 1, "user": "booyaboy", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161157567}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Staff was very helpful and friendly. Restaurant food was average. when i arrived, i dined at the restaurant and ordered a martini from the bar, and when it came, it tasted like water. I reordered three times, each tasted like water.", "title": "Indoor pool cannot be used !!", "helpfulness": 4, "user": "bingley", "date": "May 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 160032367}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "they finally tried it, and the vodka bottle was filled with water. when the bill arrived, and i saw the martinin on it, I suggested they remove that item. they did. food was average. The atmosphere...non existent.", "title": "Great location and lovely pool area - needs an update!", "helpfulness": 2, "user": "Michelle M", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 159969716}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Rooms were great. the balconies are great, but at night there are spot lights that shine on the building and onto them and into the room windows. nice pool, but cocktail service was SLOW due to ONE waitress on duty. Guests need to pay for beach loungers. nickel and dime stuff.", "title": "Do NOT Visit - NOISY/REFURBISHMENT", "helpfulness": 1, "user": "keith w", "date": "May 6, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 159840646}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "All in all....great stay. highly recommend.", "title": "Demolition of pool and party noise till late", "helpfulness": 4, "user": "leemap1", "date": "May 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 159714012}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We had a five night stay from the 20-25th April. We hadn't been to the Gran Melia for 7 years & there were some plesant changes & somethings which needed attention. Check in was quick & Efficient & we were offered a welcome drink.We had a Deluxe sea view room which although was adequate i feel was in need of refurbishment! The bed was two twins pushed together & was very uncomfortable.,In the photos of the room it shows padded hung cushions on the Head Board these weren't there & your hair stuck to the surface remaining!The Bathroom served it's pupose & there was sufficient storage space.No tea/coffee facilities which you do get in the next level of room but we didn't want to pay for room service everytime we wanted a drink especially first thing in the morning!", "title": "Very Relaxing", "user": "angela064", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 162110486}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The ambience of the Hotel was lovely especially when you walk down in the evening into the reception & bar area & the attention to detail excellent.", "title": "nice", "user": "Ane4ka", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162070952}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The decked area overlooking the sea was wonderful & very relaxing & the service by the pool attendant 5 Star.The addition of the Cappuccino Reataurant at the bottom of the hotel stairs overlooking the sea was a very welcome addition since we had last been.We had lunch & drinks there everyday & Dinner in the evening twice. Fantastic service from the staff, you didn't have to wait long for your order even though it was busy, & nice chill out music played. There was a wonderful selection at Breakfast & good service. (Apart from the timeshare Lady)!! The Location of the Hotel is excellent a 15min walk to orange square to some lovely restaurants & fabulous to walk down the Golden Mile.", "title": "Great holiday !", "helpfulness": 1, "user": "S M", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161848512}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "All in All a very relaxing Break would reccommend for a short break & in April lovely & quiet.", "title": "Club Melia- Not as bad as it seems", "helpfulness": 2, "user": "valeru2013", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 161778496}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Me and my collegue stayed in Gran Melia Don Pepe 2 nights. Beautiful hotel with excellent infrastructure, friendly staff, very good breakfast. In my opinion prices is too high though.", "title": "Let down by selling at breakfast!!", "helpfulness": 2, "user": "IHateSisu", "date": "May 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 161361895}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Just back from another good holiday at Gran Melia Hotel.The RED Level service is overrated and needs to be improved to be a meaningful and worthwhile service.On the other hand,the Ladies in red at breakfast ,we found were most helpful and polite.They certainly are not rude or try any hard selling in our experience.Quite the opposite,They are a friendly face and welcomed us with a smile every morning.", "title": "Club Melia", "user": "jrw10", "date": "June 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 163580061}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My only complaint is that having been a long term customer over many years and achieving a Platinum Melia card,that the hotel was not more proactive about ensuring we received our benefits.I am still awaiting a reply following queries I had to my entitlements when settling our bill.They seem to agree any benefits begrudgingly.#", "title": "Needs to try harder", "helpfulness": 4, "user": "fcg1959", "date": "June 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 163488109}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This will not put us off returning as we love the Hotel,particularly its position and staff like Rafeal at the pool ,Manuel the pianist and Fina 'the lady in red'.", "title": "Disappointing", "helpfulness": 4, "user": "DCG", "date": "June 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 163326229}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "JW", "title": "Lovely stay- highly recommended!", "helpfulness": 1, "user": "Rjex", "date": "June 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 163049087}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "On a previous visit to Marbella, we had admired this hotel for it's location on the beach front so close to central Marbella and so decided to book for a short break in June. We upgraded to Red Level as we thought that this would enable us to experience the best services that the hotel had to offer. Oh dear! If this is the best that Melia can do in their Grand Luxe 5 star hotels, then they need to re-think! First, check in was a let down. Indifferent welcome by reception staff, some inexplicable delay with their paperwork and no Red Level privileges explained. The room was on the fourth floor, in the centre of the curved building, with a sea view. Please note that although these rooms have balconies, their position in the block means that they don't really get any sun. Beds were reasonably comfortable but as other reviewers have mentioned, doubles are converted singles. There's a pillow menu. Bathroom was poor especially the shower which desperately needs upgrading! Red Level meant Clarins shower gel, shampoo, conditioner and body moisturiser which were replenished on a regular basis by housekeeping. TV was terrible - about half the channels didn't receive a signal. Wi-Fi was acceptable speed. Of the two wardrobes, one accommodated the safe and hanging space was limited, and the other had a rail running back to the front (very old fashioned!) which offered ridiculously limited hanging space. Minibar was well stocked if you like that kind of thing, but complimentary bottled water was in very limited supply. I wasn't aware there was an ice machine on our floor until another guest told me! The hotel should keep the information file in the room up to date.", "title": "Recent stay", "user": "AsItIs8", "date": "June 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162889644}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 5, "variance": {"poor": 22, "average": 64, "very good": 138, "terrible": 23, "excellent": 238}, "aka": "Gran Melia Don Pepe Hotel Marbella", "slim_ranking": 0.205128205128}