{"user_rating": 4.5, "review_count": 858, "name": "Gran Melia Fenix", "reviews": [{"rating": 4.0, "title": "gr8 hotel, good location", "text": "we stayed 2 times at this hotel, 1st stay check-in was very fast and the receptionist was very nice and had so much information to provide but the room we were given was very small and the bed was so tiny although we specified that we r honeymooners n would like to have a king-bed so on our 2nd stay we were upgraded to a king-size room with a jacuzzi in the bathroom without paying any extra charges!!! breakfast was excellent, many varieties from different cuisines", "user": "loola93", "date": "December 27, 2009", "id": 51953660}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "its location between a pizza restaurant and hard rock cafe really helped + it is close to shopping districts and malls AND the wax museum", "title": "They earn all 5 stars", "user": "onetreamigas", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 50399809}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "so if ur going there for a day or two i'd suggest u stay there, u'll save a lot on transportation", "title": "Not quite five-star but top-notch service", "user": "dseesel", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 49072819}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The Gran Melia Fenix is a great hotel. I recently stayed there with two other family members and we all agreed. The service is excellent. Our room was lovely, a bit small for three, but very nice just the same. Breakfast was great and the service was the best. They couldn't do enough for you. The hotel is located in one of the better districts of Madrid. Travel to sites via Metro, (bid red) bus, and cab was easy. All in all I recommend this hotel to anyone staying in Madrid.", "title": "Lovely Hotel - great food - no problems", "helpfulness": 1, "user": "TonyClark65", "date": "October 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48044802}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed at the Gran Melia Fenix for four nights at the end of a trip to Spain, and enjoyed it. The entire hotel feels a bit dated for something that was remodeled less than 10 years ago and the rooms are a tight squeeze (Spanish-style), but good value for the dollar overall. We found the staff consistently very prompt and responsive to any request (such as an ethernet cable...no wifi in the rooms), the location to be good despite the construction in the immediate neighborhood, and the buffet breakfast topnotch. Also enjoyed things like a firm mattress and great water pressure, which can't be taken for granted. A good deal especially when booked through Leading Hotels of the World.", "title": "Perfect luxury honeymoon / romantic getaway", "helpfulness": 1, "user": "TexasKPB", "date": "October 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47649808}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "The Fenix is certainly a fine property and earns its five stars, but I did find it to be under the average I've come to expect from Leading Hotels of the World and also a notch under the Ritz and Westin Palace.", "title": "Quite Nice, But Preferred My Stays at the Ritz and Westin Palace", "helpfulness": 4, "user": "TurtleCreekTraveller", "date": "March 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 59010292}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The rooms are comfortable and elegant, the Etro toiletries nice, and I found Samuel to be an excellent professional in handling all the needs of my stay, yet there were a few shortcomings that wouldn't necessarily prevent a future stay, but nonetheless detracted from the luxury feel I've come to expect from top-tier five star properties.", "title": "great hotel", "user": "JJFrier", "date": "March 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58112366}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "First, the room had several small maintenance issues such as cobwebs, dirty woodwork, and carpeting that had pulled back from the baseboards in places, exposing the subflooring. All in all, the room was attractive and the condition a \"B\", but certainly not an \"A\".", "title": "Very good", "user": "Gewitter", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55582962}, {"rating": 3.0, "title": "Hotels \"LOW RATE GUARANTEE\" is NOT Guaranteed.", "text": "Second, I was a tad offput by some of the features, such as the wall materials in the bathroom that were some type of faux-marble design, the smallness of the lobby, the morning paper at my door in Spanish which I couldn't read, and the fact that the concierge staff and cashiers seem to be one and the same, which resulted in long waits to ask a simple concierge question in the mornings.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 3, 2010", "id": 55057835}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Third, I prefer the location and curb appeal of both the Ritz and the Westin. While the walk to the Prado, Retiro Park, and Thyssen is reasonable from the Fenix, I prefer being right next door to several of the city's top attractions.", "title": "Service beyond belief and comfort in the face of adversity", "user": "BOBDNYC", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54048300}, {"rating": 4.0, "title": "Madrid Center Hotel", "text": "It was great size for European Standards. Nice part of town and very good overall. There were a few properties that went the step above (Don't forget Madrid was hopeful twice for the Olympics and built many hotels to show they could be ready).", "user": "RickW1973", "date": "October 21, 2009", "id": 47451584}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Fully worth its four star rating. Beautifully decorated, impeccably clean, friendly and knowledgeable staff, and the most comfortable beds we have ever slept on. Our room faced the street but noise was not a problem due to two double paned windows--yes, four panes of glass keep the outside world away. Though conveniently located in a pleasant area with upscale stores, it is a short walk to the usual tourist attractions--the Prado was a 15 minute walk and the Puerta del Sol was 20 minutes. These are easy and pleasant walks, but if that's too much the hotel is also right next to the subway which is fast, safe, easy to use and goes absolutely everywhere. Though the breakfast buffet looked lovely, we thought the 27E per person price was too much, and we had plenty of fine choices in the neighborhood, including one place right across the street from teh front door.", "title": "Great Hotel", "helpfulness": 2, "user": "siouxknox", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47147686}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "This hotel represents what service and attention are all about. The rooms are very comfortable and impecable. The staff is very efficient and cordial. We truly enjoyed our stay and we would recommend it to anyone visiting such a wonderful city.", "title": "Best in Madrid", "user": "lrincon", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46501832}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Stayed at the Gran for 3 nights for our first time to Madrid. The hotel itself is nice and quite opulent but the room we were alloced was quite small and overlooked a stairwell, but hey you are not there to look at the view. There was an unfortunate noise though in the middle of the night of what sounded like an ice making machine churning out ice and dropping in the containers. This happened on several occasions throughout the night, we were on the 3rd floor next to an emergency exit. We could also hear a slight hum of the air conditioning generators from the outside.", "title": "Nice hotel - a bit overpriced!!", "user": "montydogStAlbans", "date": "September 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 45483144}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "Breakfast was okay but a little strange on the cooked breakfast - pasta anyone???The breakfast room was quite small and staff took a little while to bring coffee to you, we heard a guy complain that he had been waiting almost 20 minutes for an eggs benedict. Breakfast was included in our package, I would have been very disappointed if I had to pay extra. There are lots of seated areas, an outside courtyard and we saw Fabio Capello have a coffee and a meeting with other gentlemen. He looked slightly miserable, maybe he had the pasta!!!", "title": "Perfect Hotel!", "user": "CCJB_9", "date": "September 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45072042}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We spent a week at the Grand Melia Fenix and enjoyed it a lot. Wonderful breakfast, excellent service, great ammenities and the best location. They made you feel at home. The rooms are small but elegant.", "title": "Great hotel & excellent service", "user": "RDSMexico", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53131489}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The parking was very expensive.", "title": "Not a 5 star!", "user": "StefR", "date": "January 10, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 53127167}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The Gran Melia Fenix is a perfectly fine hotel but it is by no means a 5 star property. We stayed over the New Years week and paid for an upgraded package that included access to the lounge.", "title": "Excellent hotel, with charm and character. Recomended!!!", "user": "Txiquitin", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52443187}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "While the room is quite nice, the service is lacking. The staff are courteous but not always helpful. Case in point there were never enough umbrellas (something other 5 star hotels seem to have no trouble handling), the limited options in the lounge were almost never stocked and finally the conceirge desk staff was rarely manned. I had to wait more than 30 minutes to check out and then had to point out that they had overcharged me. The front desk staff were not at all apologetic or quick about fixing the error.", "title": "Nice Hotel Good Location", "user": "BJGfrankfurt", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 51993000}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The hotel is situated in an upscale but slightly out of the way area of Madrid if you've come to visit Old Town Its about a 20-30 minute walk to the Prado, Old Town and other sites. There is a metro stop just 2 blocks away which requires you to transfer to get to Old Town but their metro is very easy to use so we had no issues getting around.", "title": "Madrid in Spring", "user": "tourists4ever", "date": "December 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51971410}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 5, "variance": {"poor": 12, "average": 69, "very good": 200, "terrible": 7, "excellent": 570}, "aka": "Gran Melia Fenix Hotel Madrid", "slim_ranking": 0.015350877193, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Uniquely located on the Plaza de Colón, the Hotel Gran Meliá Fénix is a reference of the finest in the city´s hotel industry, and member of the exclusive group of The Leading Hotels of the World. With its famous DRY Cosmopolitan Bar by Javier de las Muelas, it is the foremost example of luxury and service with all of the Spanish charisma.Its magnificent location in the exclusive Salamanca neighbourhood, in the heart of the financial district and surrounded by the famous streets of Serrano, Velázquez, Goya and on the Paseo of la Castellana."}