{"user_rating": 4.0, "review_count": 1178, "name": "Grand Lucayan, Bahamas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had a great time and really enjoyed our stay at the Radisson Our Lucaya Resort. The resort was very clean, the staff was very friendly and the views were breath-taking. My husband and I went to celebrate our anniversary and are so happy we did. It was a very relaxing, beautiful time that we are sure to remember!", "title": "We Loved It!", "helpfulness": 1, "user": "sheuer77", "date": "May 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 110837698}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Lucaya Resort surpassed my expectations. I went there expecting to have a good time, and I left having had a GREAT time! The staff was friendly and helpful and the resort was safe (didn't have to worry about unattended bags at the pool or beach, or look over my shoulder when walking around at night.) Memories include --- swim-up bar at the infinity pool (awesome frozen drinks and ice-cold coronas ... plus, the prices aren't too bad either!), water activities (you have to take the shark boat tour!), music coming from the steel drums in the lobby, short walk to the market (actually, right across the street!), conversations and a few too many drinks at Rum Runners (really cool bar in the market ... MUST GO!), breakfast at Cafe Breeze (you have to get the banana walnut pancakes), pizza at Neptunes (place was jamming ... get there early!), blackjack at the casino (i only wish that they had a swim-up table in the pool), and the nightly Bahama drum dance along the beach (I forgot the name of this, but it was a lot of fun to watch.)", "title": "So much to do ... so little time!", "helpfulness": 4, "user": "Getting0ut0fDC", "date": "May 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110718232}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "My husband and I stayed at Our Lucaya for 2 nights with 2 other couples for a quick getaway. We did it in conjunction with a 2 night cruise on Bahamas Celebration. We all agreed that if we do this next year we will skip the cruise and come directly to GBI! We were at the resort mid-week and it was very quiet. We walked across the street to the marketplace for meals and to have drinks after dinner. We never had a problem getting a lawn chair at the beach or in a shady spot at the pool. We enjoyed drinks at Billy Joe's, a shack on the beach at the far end of the hotel grounds and we had a nice dinner at Giovanni's in the Marketplace. If you want a more lively atmosphere I would recommend visiting on the weekend.", "title": "Excellent Value", "helpfulness": 3, "user": "FOV", "date": "May 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110545186}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We spent a week in the Radisson and the Hotel was great. Very well located just crossing the strert from locaya market, the best place for dining in the island. Great pools, beaches and very friendly people every where in the Hotel. There are only a few areas to improve: Food served at the pool is not very good...for that prices. I would be nice if they introduce happy hour!! and may be they need to increase the number of umbrellas to get sape with the burning Bahamas sun.", "title": "Great Hotel and very friendly people", "helpfulness": 1, "user": "emroig", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 110031991}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The rest of the Hotel is great, calm, and very relaxing.", "title": "Radisson-Our Lucaya - Great Island Atmosphere", "helpfulness": 2, "user": "off2bingo", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 109578710}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Overall: A few days ago we returned from a very relaxing trip to Grand Bahama (stayed at Radisson our Lucaya). We had a great time, enjoyed fantastic weather and loved the soft, white sand beaches. Unfortunately, the Bahamas, and especially Grand Bahama, is undergoing a major economic downturn which takes a toll on what is offered to vacationers. The economic situation is a result of less people coming to the island and so unemployment is high and a large number of restaurants, stores and even hotels are closed. While the island is not in its prime so to speak I would still recommend going if you are looking for a truly relaxing time. The fact that there are so few people works out well for those who hate crowds or shiver at the thought of having to wake up early to get a place to sit by the pool. We greatly enjoyed the quiet atmosphere and overall beauty offered by the Caribbean. The situation in general left us less annoyed at the small number of places to eat or closed hotel facilities for example, and more feeling sorry for the people who live there and have to deal with the unpleasant circumstances. As a bottom line, if your expectations are not too high and you can get used to the laid back, island attitude about it all, Grand Bahama is still a great destination.", "title": "Far from perfection but still had a great time", "helpfulness": 3, "user": "LoveTravels", "date": "June 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 112108413}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel: Radisson Our Lucaya was not all that we had hoped it would be. The service and attitude of hotel employees varied, from the unorganized at the front desk to more personal and sweet at restaurants, bars, towel shack and so on. Only one pool is open (and it is not the one with the Sugar Mill and cascading water), and most restaurants are closed, leaving the open ones to rotate opening days/times among. We stayed for 7 days and during that time only the weekends felt somewhat fuller, while during the week perhaps 5% of the rooms were filled. The food at the hotel (and at restaurants outside the Radisson) is also nothing to get too excited about. It is ok but certainly not a paradise for foodies. Diners with moderate expectations will also find that the food is unimaginative and simply blah, with a gem once in a while (try the Key Lime pie at Led Med). The hotel could also use a facelift as the rooms are clean but somewhat outdated. The grounds are nice but suffer from the lack of desperately needed money, cash that would allow for some extra sprucing up. The Lucaya Marketplace area where the Radisson sits is actually one of the best places to be. In the eastern part of the island you will find tiny vacation rentals that are truly secluded (as we found the one day we rented a car to explore). While the beaches there are nicer than the one outside the Radisson, there is nothing in terms of entertainment, decent dining options etc. If you really want something exceptionally low key, it would probably be a good place to check out for a few days. If you want some entertainment though and less seclusion, check into the Radisson.", "title": "Never Stay Here", "helpfulness": 7, "user": "loismorganNewcomb_Tn", "date": "June 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 111910688}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Excursions/Things to do: We really had a great time on the UNEXSO dolphin experience and on Pat and Diane’s Desert Island/Snorkeling Adventure (both highly recommended). Also if you can rent a car definitely go to the eastern part of the island. The deserted, calm-water beaches are stunning. Freeport, a short cab ride away from Lucaya Beach, also does not offer much. We went to the International Bazaar only to be really disappointed by the emptiness and mostly closed shops. On a different night we had the opportunity to take in Freeport again though when the 1st Annual Rush for Peace junkanoo parade took place. Junkanoo is a parade with costumes and music that takes places in the Bahamas (and a few other Caribbean islands) around Christmas time. Recently though Grand Bahama has started hosting one in June and since we were there we decided to take it in. It was fun to watch although took a LONG time to get started and was a bit unorganized.", "title": "This is the place to stay...RELAX", "helpfulness": 1, "user": "gs07jas", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111474783}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "My sons wallet got stolen out of the room on the first day there. when we checked in there was no mention of a room safe and after standing in the long line to even get a room we was so hungry we left and ate after we finally walked a block to get to the hotel from the check in place then came back and went to the beach for about 3 hours came back to go get a hot meal and shop for a bit to find out that his wallet with over 400.00 was stolen out of the room. took over 2 hours to get done with security and a plice report done only to be let down because we was only there for 3 days and they tell me that they have no security cameras to see who entered the room and then could NOT get anyone to call me back about the matter. the hotel is supposed to have insurace to replace his stolen money but they didn't even want to talk about it they knew our room was done paid and we had to board the ship within the next 2 days and didn't care. my son is 16 and had worked his tail off to have his own spending money for this trip. he had only bought 4 gifts the first trip to eat and they was for family members he had not bought hisself the first thing yet. just luckely i had kept his passport and drivers licenses when we arrived or he could have not got home without his passport that was the most scariest thing about it. but they could have cared less. then the hotel security tells us that if we could think of anything else to let them know and i found them later on that night to tell them that when he had come back to the room while we was on the beach to get some money to ride the banana boat he remembers seeing a male miad in the hall way about 3 doors down from or room and he spoke to him and the security officer i was gonna tell that too was so drunk he was screaming at me and other guests and smacking the table and hollaring it was awful so that is the kind of hotel security that this place has. i still have not been contacted about his wallet. but the funny thing was there was no reason for a maid to be down the hall we was at because the rooms there was done cleaned and get this we was missing a towel out of the bathroom that we had dried our hands on. so the police think that who ever stole the wallet either used the towel to wipe of thier finger prints or to wrap the wallet in to get it out without someone seeing them carry it out. so think twice before staying here it is so not worth your aggravation and we was not the only ones stolen from that same day the people on the floor below us was stolen from also out of their room safe and they couldn't even get the security to come to their room. it is a sad world when people can miss treat a kid but even sadder to treat people this way. so stay away from this place.", "title": "Not a 4.5 Star hotel by any means", "helpfulness": 12, "user": "knmille7", "date": "June 2, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 5.0, "value": 1.0, "service": 1.0}, "id": 111108130}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "the island itsself is beautiful and the people at the market place is so sweet they even told us that the hotel was lying to us that they knew for a fact they had security cameras. so choose wisely before taking a trip to this place", "title": "We loved it! Will be back again as soon as possible!", "helpfulness": 3, "user": "mtrocki", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110841554}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I read a lot of Trip Advisor reviews before we choose a location to go on vacation, however this will be my first actual post. We went to the Radisson Our Lucaya Resort on Grand Bahama for a friends Wedding in April/May 2011.", "title": "Huge Dissapointment", "helpfulness": 25, "user": "Mudbob", "date": "May 22, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 109380856}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Some generic info:", "title": "Great stay, very relaxing", "helpfulness": 1, "user": "LoriS8204", "date": "May 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108072027}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "My wife and try to take a trip at least 1 time a year, although it doesn't always happen. When we go on vacation we aren't super fancy, we don't expect the world, etc. We just want half decent service and a clean place to stay. My point is, after you read my review below, I want it to be known that it's not that our expectations were much different than the average traveler, but that the resort and island were that disappointing. To get an idea on where we have traveled and what we are comparing this trip to see the list below:", "title": "Great bang for the buck", "helpfulness": 1, "user": "ERS1633", "date": "May 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 107883509}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Cozumel Mexico", "title": "Beautiful resort, great value for a family", "helpfulness": 3, "user": "FriendsandFun", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 107520070}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Grand Cayman", "title": "beautiful hotel", "helpfulness": 1, "user": "bocaraton6", "date": "May 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 107227623}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I booked this hotel as part of a Cuise deal with Discovery Cruise line from Miami to Bahamas. It was only 2 nights and 3 days....but I was so blown away that I have t hout about it!", "title": "Great value.......beautiful resort......would recommend", "helpfulness": 2, "user": "bfab84", "date": "May 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 107217045}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "First of all, I have to say, that we only paid $129 for the whole trip ad so was no expecting too much, but just wanted to experience the Bahamas. The price included, the criuse to and from the Bahamas, Freeport, food on the criuse (all you can eat!!!) and 2 nights at Our Lucaya, Radisson.", "title": "Awesome, luxurious, has everything you want in a hotel", "user": "bobalicia1950", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106769958}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "Wow, the location, the resort, I miss it already! We were lucky to be bumped up to a oceaon view, so woke up to a beatiful view of the beach and the resort. The Bahamian people are very friendy, staff constantly asking how you are, the resort has such a great atmosphere, very family friendly, but great fo couples too. Nice spa (bit pricey though), great water sports on the beach, hotel right by the beach, it was just such a beautiful resort that you did not need to leave the resort and would still have a great time. The resort is very big, they had this secret nature garden, which was so peaceful and great for a walk......only downside is that I went with a friend, not my boyfriend :-(, its a great place for couples!!!", "title": "Great Service!", "helpfulness": 2, "user": "LMC025", "date": "May 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106354233}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Across the road from the resort, there are some nice restaurants were we had breakfast and dinner......nice local shops as well", "title": "Great oceanfront views!", "helpfulness": 2, "user": "GottaloveMaine", "date": "April 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106284108}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Freeport is a small island, and was only thre for 3 days so did not go around that much, but this resort was just amazing.", "title": "Better than Expected", "helpfulness": 2, "user": "over50traveler59", "date": "April 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 106270452}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 79, "average": 171, "very good": 455, "terrible": 43, "excellent": 430}, "aka": "Grand Lucayan, Bahamas Hotel", "slim_ranking": 0.222222222222, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Grand Lucayan is an elegant, serene AAA four-diamond resort set on 7.5 tropical acres of sandy coastline and spectacular oceanfront. As part of Grand Lucayan Bahamas Beach & Golf Resort, this 542-room hotel delivers the ambiance of the islands with all of the style and amenities you expect in a Resort destination."}