{"user_rating": 4.0, "review_count": 922, "name": "Grand Copthorne Waterfront Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "I was very fortunate to be on the Club floor where the service was outstanding. Quite disappointed with the room, it was quite small and smelt a bit musty. On the first night I found a cockroach or some such thing scurrying along the carpet, I pointed this out later and suggested that more attention could be paid to pest extermination in their warm climate. I was a bit sisappointed that I did not receive a reply to the client's report in which I relayed this info. Why go to the trouble completing these things if they dont reply to such complaints!", "title": "Not really satisfied but not bad", "user": "matgray", "date": "June 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 2.0}, "id": 33019418}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Because of the location, all travel had to be done by taxi.", "title": "Pleasant stay, friendly staff", "user": "ahar3", "date": "June 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 32677915}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Not a memorable experience except for the great service on the Club floor.", "title": "Loved the river view at the back", "user": "mana_Mumbai", "date": "June 8, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 31846594}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I stayed there for only two nights with my wife and two young children. Staff was friendly and always helpfull when needed. Hotel is located conveniently close to a shopping centre. Room was clean and bed firm. Our bed linen was in desperate need for a change. Blanked and bed cover were both ripped from old age. Room on river side was quiet. Was initially a bit hesitant about the hotel but would stay there again.", "title": "Loved the Waterfront view", "user": "NinuMumbai", "date": "June 6, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 31680558, "likes": {"liked": "— The Waterfront view", "disliked": "— Personal Touch was missing"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "NIce hotel...good location...The only problem is that MRT station is little far off... but u get taxies very easily...Overall a very nice experience.", "title": "Overpriced, supposed 5-star hotel", "user": "MrBrownMelbourne", "date": "June 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 31451664}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Staff at main lobby was unpleasant til they noticed we were club customers then immediately started to smile and get friendly. We were taken upstairs to club lounge for check in, there was no welcome drinks or anything. Staff did not explain the benefits of club privileges or where everything was. This is poor service for club rooms as you pay premium rate. The room it self was nothing exciting just extra corner for the writing desk. The bathroom was shocking and disgusting, it looks like its in middle of renovation. Tiles were falling of the bath tub. We then discovered the room did not have any bath towels or bath robes. Notify club manager and he was very apologetic and seem extremely embarrassed and offered free drinks to compensate. We did not take up the free drink offer but told them we booked the club room for a reason. But all the troubles and problems was soon forgotten after my husband and I had a great dinner and lovely wine.", "title": "Club room not up to scratch and not worth paying premium for", "user": "lobster1972", "date": "July 14, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 34718833}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Whilst the location is reasonably central, this is not the best-situated 4* hotel in Singapore. It's situated on a busy street (Havelock Rd) with the nearest shopping mall (Great World City) 2 large blocks away. This does not sound like much, but you'll still want a (cheap) taxi in wet/humid conditions, in which case you might as well cab it to the Orchard Road shops. It's a reasonably new hotel (9-10 years old) so standard rooms are small, and views not spectacular unless you're on the highest floors. Ask for larger rooms which have a brighter feel (e.g those ending in 04). The hotel backs onto the Singapore river, a very narrow but pleasantly landscaped channel with walkways but again, there's nothing noteworthy within walking distance. The surrounding buildings are mostly hotels of lower (3*) standard with some construction work on one side of the hotel (condominiums rising everywhere); late at night the area just outside the hotel entrance is infested with teens hanging out near the extremely popular 'Zouk' disco, so access to the hotel is by room key in the small hours of the morning; Restaurants are ok (Pontini is one of the better Italian restaurants); the conference floor on level 4 is always buzzing with exhibitors; Coffee shop / pastry counter in lobby; Breakfast buffet has a good selection; Maserati showroom just next door add some panache. More on the rooms: comments: standard rooms are not large; beds good; aircon works (3 fan settings & thermostat); bathroom has all the basics but again quite cramped for a 4* hotel; cleaners do an acceptable job, but could have more attention to detail. I found myself using a bathmat to seal off the rather large gap underneath the door, to stop draughts and to shut out noise (piped music in corridors is audible inside the room at night and can be a little irritating). If you are after a 4* hotel and this is going to be your only stay in Singapore, you should definitely choose a more central location within walking distance of the main attractions. However this hotel is -accordingly- reasonably priced.", "title": "not in a prime location", "user": "awayweekender", "date": "July 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 34448710}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We visited Singapore for the first time this year on our way back from Australia.Friends had recommended hotels on Orchard Road, but I am glad I ignored them as the situation of this hotel is far nicer - you are a $4 taxi ride from Orchard Road and to be out of the bustle and noise of the shopping centre  was worth every penny.Our room itself, although the furnishings were looking a little tired, was acceptable - the facilites were good and the view of the city from the 21st floor wonderful.There is a lot of building work going on around this hotel, but it didn't spoil our stay - in fact you would be hard pressed to find a hotel in  Singapore where there is no building work nearby,The breakfast in the hotel, although pricey is worth every penny and you can fill up for the whole day on the vast variety of food on offer.The Piano Bar is good for snacks - they serve until late at night.We didn't dine in the other restaurants at the hotel as we wanted to explore the city, but no doubt they were probably of the same high standard.The pool situated on the 6th floor is small but quiet as this hotel is used quite a lot by business people not interested in swimming ! However, you are aware of building noise here - though you do tend to not notice it after a while.However, the real stars of this hotel are the staff - nothing was too much trouble - every member of staff was helpful and friendly. I can't single out any one person as the quality of service was outstanding throughout.As an extra bit of information, a tour company runs tours from the lobby of the hotel, so you are able to book without any hassle and the tours are reasonably priced.I would definitely stay in this hotel again and recommend it to anyone who wants quality service, and  an oasis of calm in bustling Singapore.", "title": "If you want quality service - stay here", "user": "welshsioux", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 34124935}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Well this hotel was picked from reviews that I had seen on trip advisor. No complaints about the condition of the hotel or the very helpful and attentive staff who made us feel a valued customer. Room we had was on the top floor no smoking room and was set away from any other room on the 30th floor. Fantastic views of the city and the river. Main problem that for a 5 star hotel you only qualify for 2 hours free internet access a day (one hour per person). That aside the hotel pool was ok but the breakfast was a little bit cold for cooked items that have been standing for a while and there was no opportunity to get a freshly cooked egg if you wanted it. That said there was a very good selection for every taste and plenty available. Best way into the city was the river taxi. See the concierge for times or there is a free shuttle bus to Orchard road shopping every hour.", "title": "Nice Hotel", "user": "Alyn50", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33748629}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "In a place like Singapore where it feels like there are more hotels than homes you could be forgiven for believing that every hotel needs to be at the top of its' game in order to keep customers returning. Copthorne Waterfront (one of three Copthorne hotels on the small business island) Is a very pleseant hotel with good ammunities, location and staff. Breakfast by the river is a great weay to start your day and the staff are always eager but never pushy. There are more than adequate ways to pamper yourself with a nice sized swimming pool, spa service and numerous restaraunts however the rooms didn't have the feel of a 5 star hotel. There were no tea making facilities (even on the executive floors) and the furniture probably hadn't been retouched since the 1980's. Saying that the bedding was a soft a mid summers breeze anabling me to have a great night's sleep even after a frustrating day looking around the Singapore Expo. Food was also a suprising low point of the hotel. We had our breakfast included but after 5 days it became a little uninteresting. The breakfast was exactly the same everyday. The eggs were the same, as were sausages which only had one selection and even the bakery and Chinese food which you can usually find rotate on a daily basis even in 3 star hotel.", "title": "Good overall but still lacking", "user": "Ricbkk", "date": "July 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 33627984}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Having stayed at the Traders Hotel I expected great service in Singapore - I was very disappointed at the Waterfront.", "title": "Refurbished rooms with great views ruined by terrible service", "user": "PandEKew", "date": "October 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 1.0, "rooms": 4.0}, "id": 45598611}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "A great welcome was ruined by being offered the wrong bags, having to chase a package to be delivered to my room, no offer of tea or coffee at breakfast and the slowest and rudest check-out I have had in a long time.", "title": "Comfortable but too expensive", "user": "Hellywobs", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 39231025}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The views from the hotel are great BUT you have to get a cab o be anywhere...", "title": "A hotel for conferences and tour groups", "user": "Nightwatchman", "date": "August 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 39120312}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The only good point was Pontini's a gem of an Italian (pizza's a little basic) with fabulous service.", "title": "very disappointed!!bad location and service", "user": "piccaninny", "date": "August 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 1.0, "rooms": 3.0}, "id": 38908468}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "So in summary, though the rooms are large, the service is poor; I'd rather have a smaller room near to the town centre.", "title": "OK, but not spectacular", "user": "7piranda", "date": "August 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 37907524}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I was here for a business trip and the hotel served the purpose. The staff were really helpful. The breakfast was wonderful. I had very little free time and would have preferred easy access to the downtown area.", "title": "Nice hotel but far from main shopping area and transport", "user": "Alexandria-family", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 37033231}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I used a website where I got a rate just over $100 a night. I guess if I had paid the advertised rate, my review would not be so positive.", "title": "I got a great rate so it was a good hotel\"", "user": "AndrewinMiami", "date": "August 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 36460848}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "My room was big enough and bathroom was clean and well organized - not sure what the other guys rooms looked like I was in 1702 at the end of the corridor. A larger closet/more drawers might have helped but for a week I was OK.", "title": "Dismal", "user": "asia_traveller_2009", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 35717505}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Breakfast was included in the price and was a mega buffet of all imaginable tastes. Just wish they would have brought the coffee round a bit quicker. The bar is nice but pricey so I would not recommend eating at the hotel - use the 1 for 1 offers to get a reasonable priced cold beer at the ned of a day walking round in the heat/humidity.", "title": "Good for Stop over.", "user": "LloydNZ", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 35528023}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Location is a brisk 20 minute walk from Chinatown or cab ride. If you are going to walk, shorts and tee shirts are required and expect to be hot and sweaty. Its 20 minutes to the MRT but I was told there was a free shuttle which I never used.", "title": "Average", "user": "GemmaL0uise", "date": "July 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 35072004}], "location": {"country": "Singapore", "continent": "Asia"}, "stars": 4, "variance": {"poor": 72, "average": 178, "very good": 406, "terrible": 32, "excellent": 234}, "aka": "Hotel Grand Copthorne Waterfront", "slim_ranking": 0.270833333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}