{"user_rating": 4.5, "review_count": 2075, "name": "Gran Hotel Torre Catalunya", "reviews": [{"rating": 5.0, "title": "Thoroughly enjoyed it", "text": "Stayed in Gran Torre after reading reviews. We were not disappointed. The staff were so helpful. I learned a lot about Barcelona after reading through forums. It made my trip much more enjoyable and knew where to go and what to see. Don't forget to go to Placa Espana [ just a ten minute walk from hotel] and enjoy the wonderful display of the water fountain with the vibrant colours and wonderful music.", "user": "RconTipperary", "date": "August 28, 2007", "id": 8525220}, {"rating": 4.0, "title": "Brilliant hotel and great location", "text": "THe hotel is so well situated as it is a short journey on metro to centre and is a pleasure to return to a quiet restful room.", "user": "tina236", "date": "August 27, 2007", "id": 8515179}, {"rating": 5.0, "title": "excellent hotel!", "text": "Brilliant hotel across the road from the main Sants station and just a couple of stops from the centre. Dont miss breakfast on the 23rd floor restaurant the view is fantastic. When going out to eat go through the station and cross over the road at the front and go a few hundred yards up the straight and you will come to very reasonable Spanish Restaurants which do not rip you off they are not the tourist filled places but full of locals. Use the metro to get in to Sants station from the Airport get a 10 trip ticket if you are staying for a few days and this also covers your trip to and from the Airport. A 10 minute walk takes you to the Barcelona Fountains dont miss this free brilliant fountain show. Nightly during summer and weekends rest of the year.", "user": "bam49", "date": "August 21, 2007", "id": 8466251}, {"rating": 3.0, "title": "Not bad hotel", "text": "this excellent hotel had everything you could possibly need to enjoy your stay in Barcelona. It is ideally situated directly alongside the railway station, so you have great connections for the metro, the rail network the bus service and the bus touristic. the rooms are clean and fully equipped, the staff are helpful and efficient, and the breakfasts are to die for! eating on the 23rd floor restaurant was the best of starts to the day, and the meal kept us going until suppertime every day!!!", "user": "grs", "date": "August 17, 2007", "id": 8442004}, {"rating": 5.0, "title": "New Modern, Spacious Rooms", "text": "what more can i say? When I go back to Barcelona, this will be my first choice of hotel.", "user": "phworld", "date": "August 8, 2007", "id": 8373947}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "Great Hotel.", "title": "Great , Don't Miss It !!!", "helpfulness": 1, "user": "Dvir_s", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5837414}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "Clean, Quiet, Superb Service.", "title": "Positive lodgings in Barcelona", "helpfulness": 3, "user": "rmb48", "date": "September 4, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 5768172}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Big rooms, and shower.", "title": "Do not accept to move to Expo Hotel !!!", "helpfulness": 17, "user": "MARCOSTorres", "date": "September 4, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5766301, "likes": {"liked": "— Location", "disliked": "— Trial to move to another Hotel."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I think it's not a lie to say it is a 5 STARS hotel and not 4.", "title": "Nice place, a little off tourist tracks", "helpfulness": 11, "user": "RisingZen", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5717440, "likes": {"liked": "— Service", "disliked": "— Charge for Pool"}}, {"rating": 4.0, "title": "Clean, modern hotel with a great view", "text": "Book it ,", "helpfulness": 5, "user": "Wekiva", "date": "August 27, 2006", "id": 5714371}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "This hotel is conveniently situated within short walking distance of the Barcelona Sants railway station offering direct service from the BCN Airport. The hotel is a modern high-rise, with large contemporary rooms, efficient, helpful staff; and the included breakfast in a beautiful 23rd floor setting was among the best we have experienced in extensive European travels. Highly recommended for reasonable cost lodging in an expensive, beautiful city.", "title": "Modern, Well-Run Hotel", "helpfulness": 1, "user": "NJtraveler48", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10608275}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Just returned from a 4 night break in Barcelona, staying at Torre Catalunya. Very difficult to fault the hotel at all - every member of staff we came into contact with was polite, helpful and very friendly; the hotel is very modern (without feeling cold) and spotlessly clean; the views from the windows are pretty incredible. Our only complaint would be concerning the restaurant on the 23rd floor - fantastic views over Barcelona (especially at night) but the meal we had there on our first night was very expensive for what it was - and dare I say rather pretentious? The steaks we asked for \"well done\" were all very underdone and full of gristle - practically inedible! The desserts were OK, but one was served on a badly cracked dish - when we complained, they readily offered not to charge for any of the three desserts. Maybe we were just unfortunate to experience this, but we did not eat in the restaurant again during out stay. However, that said, the Lounge Bar on the ground floor serves a very good choice of meals at lunch and in the evening, and each meal we had there was delicious (and much cheaper!). Breakfasts (on 23rd floor) are great - everything you could possible want, from beautiful fresh fruits to bacon; pastries to cereals.", "title": "Lovely Hotel!", "helpfulness": 1, "user": "Mrs_TBristol", "date": "October 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 10354940, "likes": {"liked": "— Excellent room; lovely breakfast", "disliked": "— Construction work outside - not the Hotel's fault!!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The hotel may be a little too far away from the centre and the Port area for some, but it makes for a pleasant walk during the day - or an interesting ride on the Tourist bus (good value).", "title": "Nice features at the Gran Torre Catalunya", "helpfulness": 3, "user": "blonder_ambitions", "date": "October 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 10182772, "likes": {"liked": "— Conveniently located - just three stops by train from the airport to the hotel - and quality of service.", "disliked": "— location - there aren't any restuarants locally so you have to travel for these."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "After some considerable time trying to locate a good hotel in Barcelona, I settled on the Gran Hotel. I was attracted by the spa and other facilities, location and, of course, the price!", "title": "REALLY convient-completely recommed this hotel", "helpfulness": 1, "user": "urbanelectron", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10141087, "likes": {"liked": "— Conveniently located across street from major train station and subways. Exteremely safe and clean.", "disliked": "— Construction out front may be loud at times (but we did not encounter this)."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Whilst central (it's right by the main train station (Sants) in Barcelona) and about a 10 minute walk to Placa Espana and a few stops on the metro to Sagrada Familia or Las Ramblas, it is not within walking distance to the main touristy area. However, if you don't mind travelling a bit then this is a nice hotel. An added plus is that one of the \"tourist tour\" buses stops near the hotel (but get to the bus stop early as that gets busy - goodness knows what it's like at peak times in the summer months!)", "title": "perfect view", "helpfulness": 1, "user": "taroun7", "date": "October 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10069519, "likes": {"liked": "— the view", "disliked": "— the area outside- they are constracting a new train station"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We (my fiance and I) stayed at Hotel Torre Catalunya for three nights/four days and had a wonderful time from the moment we arrived until the moment we left. Every aspect of the hotel and service was 1st class and I wouldn not hesitate to stay here again.", "title": "Excellent Hotel with Brilliant Views of Barcelona", "helpfulness": 23, "user": "TravellersTune", "date": "November 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6142514, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Checking in was efficient and straight forward, no problems in this area. We were apparantly allocated a room on the 5th floor (I suppose they say this to everyone lol) and were asked if we would like to upgrade to a higher floor for an extra 10 euros per night. We were offered a room on the 19th floor, we upgraded. The views we had over the city were worth every euro!", "title": "Great Hotel", "helpfulness": 5, "user": "mssee", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6093800, "likes": {"liked": "— The room was spacious as was the bathroom. The beautiful views.", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The room was excellent, spacious, modern and very well kept as was the bathroom. The bathroom had a huge bath, seperate toilet area, twin marble sink and a brilliant power shower in a large marble enclosure. Loved the shower!", "title": "Wow!!", "helpfulness": 5, "user": "itchybasil", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6060060, "likes": {"liked": "— They had the football on mute in the bar", "disliked": "— They had the football on"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The bed was kingsize whilst the room had the extra's you would associate with a 4* hotel. Mini bar (very reasonable prices), complimentary drinks, in room safe (six digit coded), tv, phone and so on. No complaints at all with the room or any aspect to do with the hotel.", "title": "Nice hotel", "helpfulness": 1, "user": "ScottB4587", "date": "November 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6051747, "likes": {"liked": "— clean, modern, friendly staff", "disliked": "— expensive"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006", "text": "We stayed on a bed and breakfast basis. The foods available for breakfast were varied and well presented on the 23rd floor which provide super views over Barcelona.", "title": "Beware - this hotel overbooks - you may not get your room!", "helpfulness": 10, "user": "holidayqueen99", "date": "October 26, 2006", "detail_rating": {"front_desk": 1.0}, "id": 6015872}, {"rating": 5.0, "title": "what a great hotel!", "text": "We have not long returned from an amaizing trip to Barcelona (party of 4),were we stayed in the Grand hotel Torre Catalonia for 5 nights.", "user": "kat_storrier", "date": "April 10, 2007", "id": 7307756}, {"rating": 4.0, "title": "3 Days of Madness", "text": "I just have to slip this in, well in Barcelona we went to a football game and after it we were lucky enough to meet some of the football team including the man him self Mr Ronaldinhio!", "user": "WANDERERUK37", "date": "April 3, 2007", "id": 7276285}, {"rating": 5.0, "title": "Gorgeous", "text": "Now as if that wasn’t enough we stayed in the most amazing hotel. The rooms were great and very clean with beautiful views over Barcelona, the bathrooms were gorgeous! The staffs were very helpful and friendly and the beauticians are excellent, the gym and the health spa are also very good. I have to say the best thing about this hotel was definitely the beautiful breakfast on the 42 floor (which is the very top), the food is great! And the views over the whole city are spectacular! The breakfast is free for all guests! They also do evening meals up there at night; these aren’t free and are extremely expensive a meal for 2 set us back £90! Although we were glad we tried it as it was a really nice experience.", "user": "funkycrumply", "date": "March 30, 2007", "id": 7253004}, {"rating": 5.0, "title": "Genuine 4* Hotel", "text": "Although this hotel is not in the very centre of Barcelona it is definitely worth the 5mins tube ride! There is a subway station right outside!", "user": "Blackout", "date": "March 28, 2007", "id": 7239452}, {"rating": 5.0, "title": "fantastic", "text": "I would highly recommend this hotel to everyone! We enjoyed it that much we have booked to go again for September!", "user": "kickingkingNIreland", "date": "March 27, 2007", "id": 7231201}, {"rating": 5.0, "title": "fantastic, money well spent", "text": "if people can complain about this hotel they must be searching for something cause any complaints regarding this hotel have to be minor - what do people want for their money ??? the hotel is situated right next to the main train station making it simple to commute around. the hotel itself boasts great rooms, great bathrooms (huge) and a small but well equipped and very clean spa area. the staff are very friendly and cant seem to do enough. we asked for a room above the 10th floor as suggested by other visitors and got a room on the 18th (what great views) ok so the air con was alittle noisy, ok so there were 2 seperate beds (but there was room for 2 in the bath and the shower) for this money you would get a b+b break in a travel inn in the uk and maybe have a tenner spare in your pocket. dont be a fool and ignore this great hotel. barcelona is a great city there is so much to see and do, i will definatley go back and i wouldnt consider staying anywhere else.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 11, 2005", "id": 3893708}, {"rating": 4.0, "title": "Fantastic views of the city and great loaction!!!!", "text": "I stayed in the Gran Torre Catalunya hotel for five days in August with my boyfriend and we chose this hotel on the basis of reading other reviews on tripadvisor.", "helpfulness": 10, "user": "MissLALondon", "date": "August 30, 2005", "id": 3820850}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Situated 200yds from Barcelona's Sants Estacio central train station the Gran Torre Catalunya stands impressively tall in the Barcelona skyline and is visible from most of the city. We received a very warm welcome at reception and the girl on duty was only too eager to advise us on the best places to visit whilst in town. Every staff member we came in contact with had good English and like reception were friendly and helpful at all times.", "title": "Great city. Great Hotel.", "helpfulness": 1, "user": "BriandVee", "date": "November 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10875714, "likes": {"liked": "— Friendly staff, clean room and excellent transport access.", "disliked": "— View of the construction site."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "This hotel is awesome! its interior is one of the most modern and beautiful I have been. The room was breathtaking, it was huge, comfortable, clean, beautiful and well decorated. The bathroom was amazing, we actually took pictures of it because its design lol. The room had huge windows from floor to celling all around, with a nice view.", "title": "Wow hotel!!", "user": "Gremio", "date": "July 10, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 3.0, "value": 5.0, "rooms": 5.0}, "id": 8096328, "likes": {"liked": "— Room, location, design.", "disliked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The location of Torre Catalunya isn't the best. Although it was a fine neighborhood, the hotel was kind of far from Las Ramblas and the main city attractions.", "title": "Waste of money! ", "helpfulness": 2, "user": "breakingnews2012", "date": "July 4, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 1.0, "rooms": 5.0}, "id": 8054464, "likes": {"liked": "— The rooms are clean and large", "disliked": "— worst possible location to visit Barcelona, noisy rooms, no sleep, VERY far away for city"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Unfortunately we didn't spend much time in the hotel, so I can't say much about all its services. However our experience was great.", "title": "Great Hotel", "helpfulness": 1, "user": "ScotinEnglandRgf", "date": "July 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8039549, "likes": {"liked": "— The cleanliness and air conditioning!", "disliked": "— Probably the bed!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "We are, in fact >STILL here. We cannot wait to check out! Here´s the scoop. The hotel itself is clean, modern and the rooms are spacious. That´s as good as it gets. I booked my reservations through a travel agent in Scottsdale, Arizona and well, I should have done it myself because it would have been about the tenth of the cost and maybe it wouldn´t suck so much....", "title": "Would recommend this hotel", "user": "sibh22", "date": "June 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7940426, "likes": {"liked": "— Great access to public transport but not too close to the city centre", "disliked": "— the restaurant was overly expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Fisrt of all, if you speak English, they have people who speakit rather well. HOWEVER -- the people who work here do not like Brits, Americans, etc and will automatically give you the crappiest room available. Our room (along with any other English speaking patron) gets the WORST view amaginable. OVER THE CONSTRUCTION DUMP! We are on the tenth floor and haven´t slept a wink. The walls are paper thin, the windows might as well be open -- it´s THAT loud. There are teenage skaters all over the front of the hotel and they are dirty and they WILL steal your wallet! The person next to us had his taken out of his pocket!", "title": "Excellent staff!", "user": "mandi2doors", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7926982, "likes": {"liked": "— The staff...they were wonderful!", "disliked": "— I wish it had been located a little closer to Ramblas but the subway stops at least made it convenient to get there."}}, {"rating": 4.0, "title": "Great spacious hotel!", "text": "I've stayed here twice and have been really pleased with both stays.", "user": "RosieFlynn", "date": "March 9, 2008", "id": 14152376}, {"rating": 4.0, "title": "Great base to explore barcelona", "text": "The staff have always been very friendly and helpful and rooms are a great size. The bathrooms are what do it for me, they are really lovely (remind me of the Hyatt ones) large walk in shower and seperate bath tub, with a good selection of amenites.", "user": "mshel21", "date": "March 8, 2008", "id": 14133414}, {"rating": 5.0, "title": "fantastic hotel", "text": "There is is small workout area that I've used a lot but have never seem any one else in there, the pool area is nice too, great to relax after all the sightseeing.", "user": "pinkprincess50", "date": "February 12, 2008", "id": 13506269}, {"rating": 5.0, "title": "Terrific Hotel", "text": "There's a great restaurant on one of the top floors, providing amazing views of the city. I've only ever eaten breakfast here, which was great, a big selection of fruits, bread, pastries, hot food (eggs, meats etc) with tea & coffee served to you.", "user": "MDFE", "date": "February 11, 2008", "id": 13449981}, {"rating": 5.0, "title": "fantastic hotel", "text": "My only gripe is that it's not in the center of all the action, and there are very few places to eat within walking distance (not that I've discovered anyway!)...but taxis are always availble and very reasonable too.", "user": "pinkprincess50", "date": "February 5, 2008", "id": 13279386}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I stayed here for 1 night on 20 Feb 07 whilst on business. Although outside is not particularly special my twin bedded room was excellent. Spotlessly clean and large, with seperate power shower, bath and loo with bidet. All staff were extremely welcoming and polite, especially the English 'bellboy' working 7-15h. I would stay there again whether for pleasure or on business. I agree with the reviewer who styed on 16 Feb 07.", "title": "Excellent", "helpfulness": 5, "user": "senoritatraviesa", "date": "February 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6828965, "likes": {"liked": "— spacious and spotlessly clean room", "disliked": "— look of building outside"}}, {"rating": 4.0, "title": "classy & modern", "text": "we stayed here for our honeymoon and we were very happy with our choice. we were greeted at reception by a very nice englishman who straight away started to tell us how to make the most of our stay. the rooms were very clean and modern even if they were a bit on the small side but from reading reviews about other hotels in barcelona this seems to be the norm. the bathroom was spotless, large and came supplied with plenty of toiletries and towels. the restaurant should be classed as an attraction because of the amazing views from the 23rd floor. breakfast was plentiful with a great variety. the main train station is just across the road and as long as you get used to the metro system, the centre of barcelona is just 10 mins away. my only gripe with the hotel would be the bar is very limited in its range of alcohol and seems to be unstaffed most of the time.", "helpfulness": 4, "user": "xtradel", "date": "February 16, 2007", "id": 6800854}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "Stayed here on a business trip & what a hotel! my room was wonderful & the view out the large glass windows was amazing. If u are not frightened of heights go higher! & please take your camera.", "title": "excellent hotel & amazing views", "helpfulness": 12, "user": "HampshireDiamond", "date": "February 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6799589, "likes": {"liked": "— Very nice surroundings & great views of the city", "disliked": "— no compaints loved this hotel..."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "If you are reading my review dont waste anymore time book!! u will not be disappointed & I recommend that you have breakfast in the restaurant on the top floor over looking the city.", "title": "Best Ever Hotel Around, Loved It, The Min I Got There", "helpfulness": 3, "user": "nicku", "date": "February 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6796828, "likes": {"liked": "— would be the 23rd floor, panaramic views of barcelona", "disliked": "— the pool area"}}, {"rating": 5.0, "title": "Met all expectations", "text": "Well situated with a train station very close by", "helpfulness": 5, "user": "bwfcManchester", "date": "February 14, 2007", "id": 6788053}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "Excellent hotel, large rooms, fantastic retsaurant, convenient location. Best hotel I've stayed in for years (I spend approx 50 nights/year in hotel) Highly reccomended. Ask for a room on higher floors to get away from traffic. All hotels in Barcelona suffer from traffic noise - this one was very good by comparison. Buffet breakfast 14 euros - average price for the city - usual food. Taxi about 5 euros to Ramblas. Hotel is yards from Sants railway station (direct bus & train link to airport). Managed to get an autumn deal of 78 GBP per night.", "title": "Excellent!", "helpfulness": 4, "user": "gabsterUK", "date": "October 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3998962}, {"rating": 4.0, "title": "Good Hotel in Great City", "text": "+ Points", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 19, 2005", "id": 3914469}, {"rating": 5.0, "title": "Stay here when in Barcelona", "text": "Excellent location - great for the tourist bus, trains to Porta Ventura theme park, the Nou Camp and the Olympic Park.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "September 18, 2005", "id": 3913349}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Fantastic Rooms - the rooms are big and clean. The bathrooms are ernormous.", "title": "Wonderful Hotel with Great views", "helpfulness": 5, "user": "KevinBlackman", "date": "September 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3907886}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Great Views - go to the top floor for panoramic views of Barcelona.", "title": "do not believe any bad reviews, this hotel is excellent!", "helpfulness": 10, "user": "stroalki", "date": "September 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3905611}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Superb hotel with friendly, helpful staff. Rooms very modern and well serviced. Restaurant is good but a little over priced. Easy to get to from the Airport, easy to get anywhere in Barcelona, two tube stations within 2 minutes walk from hotel.", "title": "Excellent Hotel", "helpfulness": 2, "user": "kevrod79", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5985531, "likes": {"liked": "— Friendly staff"}}, {"rating": 5.0, "title": "Great Value, Fantastic!", "text": "Wonderful Hotel. Staff was excellent, rooms were modern and clean. Engligh well spoken. Restaurant was nice although a little pricy for breakfast but the view was worth it. Don’t go for the 6Euro breakfast, as it’s a bunch of dry bread. Shell out the 14Euros or go to a café. One nice touch is that they call you personally for the wake up, and ask you if you would like a call back in 15 min. Also, once we left the phone off the hook and the front desk staff actually came to our room to wake us. Very nice. Highly recommended. Spa was ok.. Us the pool next door for free if you would like some sun. Also ask for a room with a view.", "helpfulness": 4, "user": "Kip1", "date": "October 9, 2006", "id": 5932027}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My boyfriend and I stayed here for 4 nights last month and I really cannot fault anything at all. Our room was located on the 19th floor and boasted breathtaking views across the impressive city. The room was spacious, modern and impeccably clean, and the bed was huge and very comfortable. I have to say, the staff at this hotel are the best I've ever encountered and went out of their way to assisst in any way that they could (one porter actually walked off into the city and came back in a taxi for us to use). Also, the restaurant on the 23rd floor is magnificent, and again, the views are quite simply spectacular.", "title": "Absolutely Fantastic", "helpfulness": 6, "user": "Rebecca333", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5904026, "likes": {"liked": "— The quality of the room, the price, the staff, the loaction and the views."}}, {"rating": 5.0, "title": "Outstanding", "text": "Initially, I was a bit worried about the hotels location, and wondered whether it would be too far out from the main attractions. I needn't have been concerned. There is a Metro station located about 200 yards from the hotel entrance (Sants Estacio) and it's less than ten minutes to The Ramblas (about 4 or 5 short stops). The underground rail network is astonishingly efficient and so we waited no more than two minutes (literally) for a train to arrive. And, at just over one Euro per trip it is extremely good value for money. However, if you're wary about travelling on the underground (you needn't be) then there are thousands of taxi's around the city and you'll wait no more than a couple of minutes outside the hotel.", "helpfulness": 8, "user": "casjrg", "date": "October 1, 2006", "id": 5896297}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The city is tremendous, with a vibrant atmosphere and there is almost too much to do. This hotel is located in a very quiet district and so you'lll be far away enough to avoid the hustle and bustle, but close enough to access it within minutes. If we ever go back to Barcelona I would have absolutely no reservations about staying in this wonderful hotel.", "title": "great choice", "helpfulness": 1, "user": "redsox", "date": "September 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5888999, "likes": {"liked": "— location", "disliked": "— no dislikes"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We are a Singaporean family with a young one.", "title": "good service", "user": "donovanSY", "date": "June 17, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 3.0, "value": 3.0, "rooms": 4.0}, "id": 7867704, "likes": {"liked": "— next to train station for accessibility outside madrid", "disliked": "— non competitive rates"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Barcelona & this hotel was the first and last stop on our spain trip with Madrid sandwiched inbetween.", "title": "Sleek, modern hotel", "user": "lucawoolf", "date": "June 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7853452}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "1st 3days were in a double room on the 3rd floor & there was nothing to shout about. But when we compared the rates with the madrid hotel which was centrally located, this hotel's rates are much higher. Located on 3rd floor and faced the constructrion work to the front of the hotel. Fears of noise from this did not materialise as there seems to be little activities from the site when we are \"in\".", "title": "Excellent service and value for money", "helpfulness": 1, "user": "modernmiss", "date": "June 11, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 7833462, "likes": {"liked": "— The look of the bedroom and bathroom", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Upgraded the last 2 days to a superior room with a top up fee. The differences was apparent. Larger toilet, sofa area etc...view at 10th floor was towards another hotel. not scenic but ok.", "title": "A great choice", "helpfulness": 1, "user": "mulder1966", "date": "June 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0}, "id": 7829336}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "A must try is the resturant Visual on the top floor with a stunning view of that area of barcelona and great food and service.", "title": "Great hotel", "user": "wizbud", "date": "June 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7816647, "likes": {"liked": "— The service,views and food", "disliked": "— Noisy marble hallways."}}, {"rating": 3.0, "title": "Nice Hotel for European Standards, but with Problems", "text": "This hotel was very nice. The room we received was very large even for American standards and two walls were windows so we had a great view. The bathroom was sizable as well. There was a bathroom with lots of amenities and separate shower. There were large closets, two tables, two chairs, large TV, and even a radio. The only problem was that when I had switched on a light, the circuit blew and we ended up sitting in the dark, along with our next door neighbors. The hotel staff came in and tried to fix the lights, but they could not. They gave us another room. That room was equally large. However, the bathroom wreaked of sewage. It was disgusting. The room also faced Sants Station, which was another negative. After going through the fiasco of packing up and moving late at night to the 2nd room, we found that the construction was still going on and would keep us up, if the smell of the bathroom did not. We went back down and asked for another room. This time, we got a smaller one, but at least the bathroom did not smell and we weren't facing the construction. However, by the time we went to bed, it was quite late.", "user": "AnAmericanTourist", "date": "August 5, 2007", "id": 8352546}, {"rating": 5.0, "title": "Geat Hotel if you get it on a deal price", "text": "All in all, even though we had to go through this fiasco of changing rooms, the staff was accommodating.", "user": "weenzie", "date": "July 30, 2007", "id": 8262783}, {"rating": 5.0, "title": "Great City, Great Hotel!", "text": "The location of the hotel was convenient. Sants Station was just around the corner and you could get anywhere form there. The train from the airport went straight here as well. There was a supermarket next door to obtain any necessities or food that was desired. It was convenient overall.", "user": "DublinTourist78", "date": "July 29, 2007", "id": 8254145}, {"rating": 5.0, "title": "Great staff - good location", "text": "We got a good deal on this hotel through laterooms.com. We payed £530.00 and stayed for 5 nights. We paid the extra amount for the room on the higher floor, which was well worth it for the brilliant night views of the city. It was a great hotel in a handy location. It is not in the centre of Barcelona but is right beside both the underground and the train station. The rooms were a lovely size with a nice big bathroom, clean and fully equiped. The staff were lovely and very helpful. There is internet access on the basement floor, free for the first half hour! You could have wi fi access for 24 hours for about €10. This is very handy if, like us , you travel with the lap top. The restaurant on the top floor is worth checking out. Its a bit pricey, but worth splashing out on for one night for the fab. views over the city. The food was good and some nice wines. There is a free bottle of cava with the voucher they give you on check in, but you have to be seated before a certain time. I didn't eat in the hotel for anything else. Breakfast for us was in the cafe which is in the supermarket under the hotel, again very handy. This is a great hotel in a handy location. I highly recommend both the hotel and Barcelona which is an amazing city with so much to see and do. We are planning to return with our toddler son soon and will be checking out the Gran Hotel Torre Catalunya for our next good deal.", "user": "Carole17", "date": "July 19, 2007", "id": 8192101}, {"rating": 5.0, "title": "Great Hotel", "text": "Just back from 5 nights in Barcelona which has now become my most favourite city ever visited. What an amazing place! It had everything - culture, great food and wine, amazing shopping, friendly people, lovely weather, fantastic beaches(so close to city) and a brilliant transport system(so easy to get around).", "user": "matho13", "date": "July 18, 2007", "id": 8140989}, {"rating": 5.0, "title": "Great Hotel and great location", "text": "We had a 3 night stay at the hotel for a wedding present. The hotel is very nice and the service was incredible.", "helpfulness": 4, "user": "Ms247", "date": "January 18, 2007", "id": 6615565}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The hotel is right next to the metro and train station we were able to get around very easy.", "title": "Fabulous Hotel", "helpfulness": 10, "user": "Gill247", "date": "January 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6575195, "likes": {"liked": "— The View from the Restaurant", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The Restaurants was amazing as its right at the top of the hotel and the view is amazing.", "title": "Hmm........ not Bad", "helpfulness": 4, "user": "MSG-UK9", "date": "January 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6567476, "likes": {"liked": "— Good Size, and clean.", "disliked": "— Outside noise"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The room was clean and very modern :)", "title": "Great Hotel, Great City!", "helpfulness": 5, "user": "MagicDougal", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6561264, "likes": {"liked": "— Great executive rooms", "disliked": "— Spa pool needed a good scrub!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2004, traveled with friends", "text": "Location great and there is a hypermarket right next door so you can stock up on food and drink ideal if you are travelling with children.", "title": "A beautiful Hotel", "helpfulness": 6, "user": "Laboy75063", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6554931, "likes": {"liked": "— The rooms were beautiful. The location is awesome also. The views. I could go on and on.", "disliked": "— Can't think of anything right off hand. I guess it could have been cheaper. LOL"}}, {"rating": 5.0, "title": "Perfect Hotel", "text": "We stayed here 4 nights in feb 05. Very nice hotel, friendly staff. The room size is okay, bathroom very big and perfect. Nice view from our room. Location is a little bit far out from center (ramblaen) but metro, train and tour bus are going just outside, so its not a big problem. Dont forget to see the view at the restaurant at the top floor.", "user": "mesl27", "date": "March 19, 2007", "id": 7190804}, {"rating": 5.0, "title": "Great place to stay", "text": "We stayed at the Torre Catalunya for three days and had a terrific time. The hotel was amazing and had everything you could have wished for. It was totally spotless, everyone who worked there was extremely polite and it was in a good location.", "user": "Antonia1982", "date": "March 16, 2007", "id": 7171939}, {"rating": 5.0, "title": "Excellent - highly recommended", "text": "The hotel is situated literally a stones throw away from the station and metro that can take you into town and takes about 5 to 10 mins. We took a tour bus for two of the days and that was great and the stops were right outside the hotel. It's great that the station was so close as we didnt have to rush in the morning of our flight, we just walked a few seconds to the station, got on the train and the third stop was the airport and was so quick and easy to get to!", "user": "grrrl_friday", "date": "March 10, 2007", "id": 7009477}, {"rating": 4.0, "title": "Classy Hotel, Good Location", "text": "This is a gorgeous hotel to stay in. You even have a computer suite with internet access, a lovely beauty parlour with swimming pool and beauty room and also an amazing restaurant on the top floor of the hotel with amazing panoramic views across the whole of Barcelona! Definately 10 out of 10!", "user": "dukesy", "date": "March 8, 2007", "id": 6932825}, {"rating": 3.0, "title": "Too noisy", "text": "Booked the hotel through Lastminute and got a good deal. Having read a number of reviews on trip advisor we were concerned about the noise but this wasn't an issue as we were on the 10th floor.", "user": "penny29", "date": "March 7, 2007", "id": 6926419}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We have just returned from staying in this hotel with our 11 month old baby. The staff were fantastic and baby cot really nice but you may want to bring your own fitted sheet. Has a mini bar for storing milk and baby food!! SANTS station is undergoing major renovations and it was a bit dusty outside but not really much noise. this hotel is not really in central Barcelona and if you are travelling with a baby, not all metro stations have lifts so alot of stairs to climb!!! Overall a great hotel but a bit way out from the centre and sights. Also no nice restaurants in the local area so you have to go on train for something nice to eat. the lounge bar in the hotel is great and so is the spa. GREAT HOTEL lovely rooms!!! Also a supermarket below so great for stocking UP!!!", "title": "GREAT FOR A BABY!!!", "user": "nitadolly", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 7583114, "likes": {"liked": "— rooms lovely", "disliked": "— noise form Sants station"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "hi", "title": "very close to metro but restaurant dissappointing", "helpfulness": 1, "user": "AshbourneDublin", "date": "May 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7566530, "likes": {"liked": "— cleaniness", "disliked": "— price of the restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Just returned from bank holiday weekend in Barcelona , fabulous city, picked this hotel following reviews on trip advisor.", "title": "Excellent location", "helpfulness": 1, "user": "gilmorehill", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7565535, "likes": {"liked": "— The location and the views."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "hotel very clean, and rooms spacious, if yoiu like modern you will love it, very conveinent right beside metro/train station, now has tea coffee facilities in room and generally good", "title": "Just perfect!!!", "helpfulness": 1, "user": "GlobetrotterHasselt", "date": "May 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7544895, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "As good as it gets", "text": "only dissappointment was the visual restaurant very pricey and very small portions, I went for a take away following dinner ( not good for vegetarians, my portion of pasta was smaller than a starter portion in Ireland)", "user": "thomassmith200", "date": "May 1, 2007", "id": 7489204}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We were very lucky - but if you believe that then- we were upgraded to a suite at no extra charge 5 nights. I would stay there again tonight if I could!We were on the 19th floor and with a corner suite overklooking magic fountain to the S West and the sangrda familia to the south(excuse spelling please).", "title": "whatever else coulld you want", "helpfulness": 9, "user": "petepool", "date": "June 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3549292}, {"rating": 5.0, "title": "Awesome hotel!!!", "text": "PS if you like a beer the hypermarket next door sells the same brand as the minibar at 50cents a can not 3 euros", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 6, 2005", "id": 3534445}, {"rating": 5.0, "title": "Lovely hotel. Convenient location.", "text": "I am a 23 year old male and I went to this hotel with my boyfriend who is 25. The hotel is beautiful and very clean. The rooms are really clean and moder and they have the most perfect shower system. (Very nice to wake up to) I have to say the staff are amongst the most helpful I have ever come across. They are willing to go out of their way to help you with anything you need. They are lovely and polite. It is however a little business orientated with it's layout but this definately does not effect your stay. If you are there to see the city then it is great although you will have to get the train into the centre as it is too far to walk so bare that in mind. The train station is literally directly next to the hotel which is just perfect for those hoping to visit Sitges (which you have to see!). Sitges is 20 mins by train costing about 3 uk pounds. It is like the Spanish version of St Tropez I suppose and is full of beautiful people, lovely restaurants and shops and a row of different beaches. I say different because there is some nudest beaches and gay beaches. It caters for all tastes. A great place to visit! The hotel will tell you all you need to know. I would have preferred to stay nearer the centre slightly as there is not much to see around the hotel but the centre is only one stop on the train and is not much of a bother. The only annoying thing was when we wanted to eat locallu there was not much around. The trains there are amazing - they go everywhere in Barcelona. The food in the hotel is a little pricey but no more than any other. The pool and spa treatment is wonderful. They have the internet at a cheap price as well. Overall I highly reccomend this hotel but if you are looking for somewhere very near the city and the clubs then this one may not be for you. You could get a little closer BUT you will not be dissapointed with this hotel I guarantee you.", "helpfulness": 5, "user": "Ashley_Knight", "date": "January 31, 2007", "id": 6718890}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stay at Gran Torre Catalunya for a week during christmas, it was great, everything we expect and more. Very clean and modern. The bath room was big, with tub, and a toilet a part. The staff was friendly and helpful.We ask for wakeup calls and they call us as asked. We have once dinner at the Visual restaurat in the top, I recomend you eat there once, and make a reservation for a table near a window, so you get the spectacular city view.", "title": "Great Stay!!!!! If I go back to Barcelona, will stay here again", "helpfulness": 3, "user": "yasmarie98", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6635478, "likes": {"liked": "— Great location, great view from the top, confortable, clean"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My girlfriend and I really enjoyed our stay in the hotel for four nights at the end of September. We stayed in an executive double room, which whilst not particularly large, was well equipped and kept clean throughout our visit.", "title": "Amazing views and lovely rooms- great for couples", "helpfulness": 2, "user": "AndyShelleyHoliday", "date": "October 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 10043252, "likes": {"liked": "— well equipped rooms and service", "disliked": "— slight noise"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Although not especially close to many of the main tourist attractions, a Metro stop opposite the hotel provided quick access to the rest of the city at a reasonable price. Our room was situated on the twelfth floor and afforded beautiful views of the city and surrounding mountains- a bonus over more centrally located accommodation.", "title": "Good hotel but noisy", "helpfulness": 1, "user": "ian_ok", "date": "October 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 10036603, "likes": {"liked": "— Location to transport", "disliked": "— The noise"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Whilst not detracting from our own experience, the building work outside (including some work at night!) would deter us from recommending this hotel to light sleepers. Also, whilst the hotel caters well for people on business and couples, the lack of hotel based activities may not make it an ideal choice for families with young children. That said, with so much to do in Barcelona itself, this shouldn’t be too much of a deterrent!", "title": "Perfect Hotel -You must stay here!", "helpfulness": 6, "user": "busywhizzy", "date": "September 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8864073, "likes": {"liked": "— Amazing views over Barcelona", "disliked": "— The building work just outside"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We found the staff to be friendly, polite and hard working. All of the staff we encountered spoke good English, and whilst the hotel did seem fairly quiet at the time of our visit, credit should still be given the very efficient room service.", "title": "Fantastic views and a great location", "helpfulness": 3, "user": "Krissue", "date": "August 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8548900, "likes": {"liked": "— Awesome views", "disliked": "— Outside construction work"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "For couples, we would highly recommend the restaurant at the top of the hotel, which affords panoramic views of the city and serves delicious food. A note of caution, however, as it does come at a cost!", "title": "Excellent rooms and great location", "helpfulness": 1, "user": "babette62", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8535061, "likes": {"liked": "— Location, Rooms, Spa", "disliked": "— Sterile atmosphere, clenaing lady not always consistent in her cleaning"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel is conveniently located and is very near the Sants Station stop of the Blue Line of the Bus Turistic (i.e. the hop on and hop off tourist bus) which we spent most of the time in sightseeing in Barcelona. However, one will have to take the subway to Placa de Catalunya or a taxi to a nearby transfer point at Francesc Marcia-Diagonal in order to take the Red Line.", "title": "Good Hotel but bothered by the worksite", "helpfulness": 2, "user": "iulawr", "date": "June 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7789909, "likes": {"liked": "— The view at the restaurant floor.", "disliked": "— The noice from the work site at the front of our room."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "The breakfast is a buffet style with lots of food; the smoke salmon is even better than what we have in the cruise ship which we have just left. The magnificent view of Barcelona one can enjoy during breakfast is beyond comparison.", "title": "Very friendly", "helpfulness": 1, "user": "Gupta7", "date": "May 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7723328, "likes": {"liked": "— Clean, large bathroom", "disliked": "— breakfast hot veggie option could have been included"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The staff is polite and friendly. The bellboy is particularly helpful. He explained the various switches of the room when he delivered our luggage to us.", "title": "Hiccups..but excellent hotel!", "helpfulness": 2, "user": "ceadmile", "date": "May 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7694186, "likes": {"liked": "— The views", "disliked": "— Having to change rooms 3 times"}}, {"rating": 5.0, "title": "Great choice for Barcelona", "text": "The hotel should have been a very good hotel but for the work site situated right in front of it. We arrived the hotel after leaving the cruise ship early in the morning and arrived at the hotel some time after 9 a.m.. Despite my request to have a room at a higher floor, the girl at the front desk said I could only check into a room on the 3rd floor immediately, or I would have to wait until 12 noon, the regular check in/out time. for another room on the 8th floor. There was also a condition that I would not be able to change my room once I had checked into the 3rd floor room. Since I have only 2 days in Barcelona, I wanted to settle down as soon as possible so that I could start my sightseeing earlier, I decided to accept the 3rd floor room and was fully prepared to take this as a room without a view. However, we had overlooked one thing or had we been alerted at all, i.e. it faced the worksite in front of the hotel. At 4 o’clock in the morning, workmen started talking loudly outside the worksite and heavy machines were clanking up and it was just impossible to continue with our sleep. We did not negotiate with the hotel for a change of room because we would have to get up at 3 a.m. to catch a flight home on the second morning. I wonder whether the hotel will allow us to change our room even if we asked.", "helpfulness": 2, "user": "UKLondonLondon", "date": "May 15, 2007", "id": 7626103}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Another problem is the partition between the bathroom and the living area. Part of the partition is made of translucent glass. When I had to use the bathroom during the night, light came out through the glass partition and shone directly on the face of my wife and this woke her up. I cannot understand the rational of using the glass partition nor its location. If the designer wanted something translucent to create an ambient or what not, he should, say, use a translucent glass door, which faced the closet.", "title": "Pleasant Hotel Superb location", "helpfulness": 1, "user": "VinSErith", "date": "May 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7588428, "likes": {"liked": "— everthing", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Not having been to Barcelona in several years, I managed to get a cheap flight and boked this hotel very cheaply on the internet. Having paid through the nose in the past and stayed in some scary locations, I was somewhat apprehensive about returning to Barcelona. My wife however likes to shop and practice her spanish, and I would go anywhere rather than work! Enough drivel. The hotel is beside Saints train station. The train was free to and from the airport (only costs E2.50 anyway). The hotel has a metro nearby. Staff are very efficient. The hotel is of a good standard and worth travelling out of the centre of the town to. We found a good cafe/bar opposite the metro, which was really cheap, but really good, much better than stuffy hotel breakfasts. The bar has a wide range of drinks, but gave us cava rather than champaigne, yet charged the full price. On our second night there the station was having renovation work done. Builders worked throughout the night, VERY NOiSLY. Thank god I was'nt staying longer. I would definately go back once the building work was complete. Whilst it wasen't the hotels fault it is impossible to sleep through. Surely the locals can put a stop to this. Give it a month or two and it should be fine.", "title": "Safe Hotel in easy to get to location", "helpfulness": 1, "user": "sombochris", "date": "December 23, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 11917133, "likes": {"liked": "— Great views of Barcelona", "disliked": "— Beally noisy due to all night building work at nearby station (Temporary problem)"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Stayed here with friends after a transatlantic voyage for a few days in Barcelona.", "title": "Beautiful Hotel in Great City", "helpfulness": 2, "user": "Wendell B", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11475807, "likes": {"liked": "— Room", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "great staff", "text": "Very sleek, stylish hotel located near the train station, north in the city. Very friendly and helpful staff chekced us in very efficiently before we were escorted to our rooms.", "helpfulness": 1, "user": "cornwalls-hunny", "date": "December 4, 2007", "id": 11242400}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Very modern rooms with flat screen TV with multi language cable stations, remote control stereo system, two single beds (can be pushed together), lots of storage and massive bathroom (shower and toilet separated).", "title": "excellent on all counts", "helpfulness": 1, "user": "hildadajos", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11189788, "likes": {"liked": "— nice staff", "disliked": "— no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Excellent view of city from room and from the restaurant on the very top floor. Excellent food selection for breakfast, lunch and dinner.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "scooterguy", "date": "November 22, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 3.0, "value": 4.0, "rooms": 4.0}, "id": 10991655, "likes": {"liked": "— Mpdern, clean, spacious room", "disliked": "— Away from downtown, port and airport"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled as a couple", "text": "Went a couple of years ago to watch the Barca -v- Real Madrid game with partner.", "title": "Loved it, loved it, loved it!", "helpfulness": 2, "user": "Dreamer1980", "date": "January 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12771398, "likes": {"liked": "— The room and the bathroom", "disliked": "— Not many restaurants around"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Room - absolutely wonderful! Can't remember which floor but quite high up, with a great view and as they gave us a corner room, the windows went right the way around. Huge widescreen tv, massive bed, lovely linen, spacious, clean, modern.", "title": "A great hotel in a wonderful city", "helpfulness": 3, "user": "manutwo", "date": "January 17, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 4.0}, "id": 12720362, "likes": {"liked": "— Professional staff, good location", "disliked": "— Almost perfect!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Bathroom - probably the best i've seen in a hotel, walk in shower room, plus a big bath. Loo had a frosted door though which made me a bit conscious! But very clean, and modern.", "title": "Great Hotel", "helpfulness": 2, "user": "JQ25", "date": "January 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12557408, "likes": {"liked": "— The views and the restaurant", "disliked": "— building works on the new train station mean it is busy outside but didnt casue any problems or noise"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Staff - absolutely lovely. One of the guys who helped us with our luggage found out it was our first time and immediately took us to the restaurant on the top floor to show us the spectacular views, even thought the restaurant was shut at that time. Most spoke decent English too. Very polite and welcoming. Also gave us advice on where to go etc.", "title": "best hotel i've ever stayed in", "helpfulness": 2, "user": "ram_murdock", "date": "January 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12543244, "likes": {"liked": "— view, friendliness, food", "disliked": "— nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Location - not bad, we hired a car as Barcelona is so much bigger than we realised, woth so much to see and do. There was a train station outside but didn't use it.", "title": "Decent But Nothing Special", "user": "WhyFlyBy", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 12353069, "likes": {"liked": "— clean and large room", "disliked": "— bed not comfortable and a bit out of the way"}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 30, "average": 135, "very good": 766, "terrible": 19, "excellent": 1125}, "aka": "Gran Hotel Barcelona", "slim_ranking": 0.0478011472275, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "A Hotel beside Sants station. Access the centre of Barcelona in less than 10 minutes, or walk from the hotel to Fira de Barcelona. If you want to visit Catalonia or Barcelona, we are looking forward to seeing you in this magnificent 4-star hotel, perfect for visiting the city of Barcelona."}