{"review_count": 31, "slim_ranking": 1373.0, "name": "Granet al Roof Garden dell'Hotel Savoy", "reviews": [{"rating": 2.0, "stay_parameters": "Visited June 2013", "text": "I have delayed making this report as I have been in correspondence with the hotel since a most disappointing evening at the Savoy on the day my wife was 70. This was a dinner we had booked weeks in advance before we had travelled from England.", "title": "They spoilt my wife's 70th birthday!", "user": "jj-the-jetsetter", "date": "August 1, 2013", "detail_rating": {"value": 2.0, "service": 4.0}, "id": 170241313}, {"rating": 4.0, "stay_parameters": "Visited June 2013", "text": "The welcome from maitre d' Ambily assisted by waitress Agnesica was excellent and they worked so hard to try to put right all the wrongs of the evening.", "title": "Wonderful", "user": "welovetotravelslways", "date": "July 9, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 166939080}, {"rating": 4.0, "stay_parameters": "Visited June 2013", "text": "The first problem is that the restaurant is on the 6th floor and the actual roof terrace is on the 7th, although this I didn't feel this was too clear from the website, and from the promotional brochures, including the one I have in front of me now. Now this wouldn't be too much of a problem, as normally one can take pre-dinner drinks and post-dinner digestifs up some steps to the 7th. However, despite knowing of our intentions and advance booking, the 7th floor terrace had been let out for a private party and the staff told me that no-one was allowed up there, indeed I saw some diners turned away when they tried to go up. I have to say I did boldly go up just to see what we had missed - perhaps at my age, no-one was bothered to throw out this wrinkly old man in his stripey blazer......", "title": "Wonderful place to have diner", "helpfulness": 1, "user": "Francoise D", "date": "June 27, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 165412326}, {"rating": 5.0, "stay_parameters": "Visited May 2013", "text": "So, on the sixth floor you are partly open-air and have limited views if you stand up to eat - all I could see were pigeons on the next roof.", "title": "Unforgettable wedding reception!", "helpfulness": 1, "user": "Ela P", "date": "May 25, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 161803235}, {"rating": 5.0, "stay_parameters": "Visited May 2013", "text": "Next the Menu Degustazione/tasting menu that we had. Perhaps we should have been warned when the menu told us that egg-plant was in the first course and the fourth. What it didn't tell us was that egg-plant was also in the 2nd course. Surely you choose a Gourmet menu so you can taste as many different flavours and textures as possible?", "title": "Fantastic food, great service", "user": "Warren_Cox", "date": "May 9, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 160203720}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 1, "average": 6, "very good": 7, "terrible": 0, "excellent": 17}}