{"user_rating": 4.5, "review_count": 1038, "name": "Grand Hyatt Seattle", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Great downtown location, a clearly well-trained staff (at all levels) quite responsive and friendly, and decor manages to be quite modern but plush/warm/cozy too. Similar to other better hotels in area, offers loan of umbrellas, terry robes, etc. Turn-down-for-bed service appreciated. Note: proportion of sq. ft. in a 2 DoubleBR largely allotted to lavish bathroom as compared to living/sleeping space. (Not a problem if there are only 2 of you... we had a couple more!) Had north-facing room on 24th floor, so view of Space Needle and other high-rises with limited view of bay.", "title": "Treat yourself!", "user": "ClassicalEd", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115258894}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Walkable to Pike Place Market, more of a schlepp to Pioneer Square or ferry piers. Minor peeves: no free wi/fi; no coffee/tea apparatus; and mini-bar/fridge automatically charges if door simply opened for a little! These are odd cheeseparing touches to such a high-end-feeling hotel... but it has successfully won our business over from the nearby Westin, our previous stay, or even from the waterfront hotel simply because we were so comfortable. Starbucks in lobby not open late.", "title": "Good Hotel in a Great Location", "user": "1483", "date": "July 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115218676}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Great location. Lots of great shopping and restaurants nearby. Easy wandering distance to Pike Place Market, Pioneer Square and Belltown. Sara at the front desk found us a room with a view. All the staff were very nice, including the housekeeping staff. The bathroom was splendiferous with a soaker tub and a lovely stand up shower with great water pressure. As someone with sleep problems I appreciated the blackout curtain. The bed was very comfortable. It was great having a Starbucks downstairs.", "title": "Love!", "helpfulness": 1, "user": "trish72", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115171557}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Complaints we have are that you can't even open the bar fridge without incurring a debt. I guess this is to stop you from keeping beverages cold that you buy yourself. It just seemed petty. The hotel does offer to bring up a separate fridge, but for a charge. Also, although the room was nicely appointed, the carpet looked grubby and in need of replacing. We didn't use the valet parking. We found out there's a cheaper option. We parked in the public parkade around the corner, but in the same building with hotel access.", "title": "The bathroom itself is a spa!", "user": "cristacueto", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115163378}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Other than that it was a great experience and we would stay there again.", "title": "Luxury isn't always friendly", "helpfulness": 1, "user": "casabear", "date": "July 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 115140798}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We would definitely agree with all of the previous reviews - the Grand Hyatt is a wonderful place to stay in Seattle. From check-in to check-out we were completely pleased. Before our cruise we had a corner suite, which was spacious and spotless. Yes, the bathroom was huge! The bedroom is separated from the hallway by the sitting room, so it is very quiet. When we returned to Seattle after our cruise we had again reserved a corner suite. We arrived at the hotel very early (about 9:45AM), and there were no corner suites ready, which we had expected. However, Ryan at the front desk was determined to put us in a room right away, and he offered us a corner king at a much lower rate than the suite. This room was almost identical to the suite, except that the entranceway was a little smaller, and it was just as impressive! (For both of our stays we got very low rates with our AAA card.)", "title": "Outstanding in every way", "helpfulness": 1, "user": "Bandlady", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39399994}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Everyone we came in contact with was extremely professional and friendly. Special kudos go to Amanda and Ryan at the front desk, and Louise, the concierge, who was able to get us a table at the Sky City restaurant at the Space Needle after we had been told on the phone that there were no tables available!", "title": "Grand Hyatt, Seattle, WA - Wonderful Place to Stay", "helpfulness": 1, "user": "cruisegirls", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39263867}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We will definitely stay at the Grand Hyatt again if we ever return to Seattle.", "title": "wonderful hotel and staff", "helpfulness": 1, "user": "yellow1NewJersey", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39095825}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed here before our upcoming Alaska cruise. It was wonderful. Clean, modern, quiet. The marble bathroom had both a shower and a relaxing soaking tub. They provided bathrobes which were plush. The bed was comfortable and had a chair with ottoman. We definitely would stay here again.", "title": "The hotel staff made me feel like a VIP, even though the NY Yankees were staying there also.", "helpfulness": 2, "user": "boltontravellers", "date": "August 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38588018}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The hotel is updated and the rooms are very zen. Very clean and generally quiet, except for the shower plumbing. Unfortunately, I could hear whenever our neighbors took a shower, at 1:30AM, or 4:30AM. Everything else was wonderful.", "title": "Good location - friendly staff - loved it!", "helpfulness": 1, "user": "Lisaonthegoco", "date": "August 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38489140}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Location wise it is in the heart of the dining and shopping district of downtown Seattle. The hotel itself is average. Reception was cool and perfunctory. The rooms are on the small side but clean and understated and quiet. We had a wheelchair accessible bathroom and neither of us is disabled. You have to pay for WiFi: expensive and a rip-off. Nice that they have a Starbucks on the premises so you don't have to leave the building to get your fix. I guess some rooms have great views; we looked out over the roof and vents of the Ruths Chris restaurant (yes, whiffs of steak every now and then!) and an adjacent condo high rise (close enough that you could wave to the people living there!). Have stayed at better hotels in the area so I won't stay here again unless I'm desperate.", "title": "Great Location but Nothing Special", "helpfulness": 1, "user": "shep77", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 1.0, "service": 2.0}, "id": 115087911}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Nice hotel, room was high-quality suite-type room. seperate living room, bath, and bedroom. bathroom was luxurious and I do not use that word lightly...it was awesome. we had corner room that had windows facing city and right down to the pike market sign and elliot bay beyond. sat there a couple times and just watched the sound ferries going out and back. staff very helpful with room request, so try for whatever room you want. I'd stay there again next time I'm in seattle.", "title": "Great hotel, wonderful views of city and water", "helpfulness": 4, "user": "acposu", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114884366}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I recently stayed here on a business trip. I got a king sized room (prepaid) which ran me about $220 per night plus tax.", "title": "Standard high-quality hotel", "helpfulness": 1, "user": "curiousjayu", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114695287}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Overall, no real complaints about the hotel. The room was a nice size, with a large bed. The bathroom was huge, with a big tub and stand-up shower. Housekeeping service was excellent. Other nice small amenities in the room (such as an umbrella for the rainy weather).", "title": "Great hotel in downtown Seattle", "helpfulness": 2, "user": "johnathome", "date": "June 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114691700}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "If you stay here, I'm sure you will have a good stay. There is nothing really distinctive about the lobby, and the restaurant is a standard steak house.", "title": "Perfect Stay", "helpfulness": 2, "user": "ancoraimparo", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114684605}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We spent 2 nights in this hotel on our vacation as we passed through SEattle. This was definitely one of the top hotels we've ever stayed in. Absolutely 5 star in every sense of the word. Gorgeous rooms, staff extremely attentive. A quick example - while doing on line check-in for our flight in the main lobby, my daughter coughed once. A staff member came over to her with a cup of water. Whenever we return, we will positively stay at the Grand Hyatt!", "title": "WOW", "user": "PAJAY", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36429519}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I stayed at the Grand Hyatt for 3 nights in July 2009. I was impressed with all aspects of the hotel. The front desk was professional and helpful, the room was large, spotless, and well-furnished, the room-service was outstanding, and the rate was very competitive. The hotel is centrally located in downtown Seattle and convenient to shopping, attractions, etc. There is a Starbucks in the lobby of the hotel.", "title": "Great hotel in Seattle", "helpfulness": 1, "user": "TMichael2", "date": "July 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36236832}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband, daughter and I stayed at The Grand Hyatt in Seattle for a few days before our son's wedding at Mt. Ranier. We were on the 27th floor in a corner suite with a lovely view. The room was very spacious and comfortable. The bed was great as were the amenities. The service was excellent. We treated ourselves to room service one morning and we couldn't have had a better experience. Our daughter and our niece stayed in a separate king bedroom and that also had a nice view. The bathrooms were large with separate shower and bath. We would definitely recommend the Emerald Suite. Everybody we came into contact with was extremely helpful and friendly!", "title": "Wonderful experience!", "user": "eslteach", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36045651}, {"rating": 5.0, "title": "Hip and Luxurious", "text": "I stayed at the Hyatt for 3 nights based on TripAdvisor reviews - and am so glad that I did. I paid government rates for a fabulous room on the 14th floor that was whisper quiet and very roomy. I loved the special pushbutton room-darkening shade - wow, wish I had one at home! There were special touches throughout my room - beautiful stone light fixtures, artistic lighting - that provided a low-key, zen-like atmosphere.", "user": "j0yrenee", "date": "July 25, 2009", "id": 35729361}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I worked out everyday and loved the health club facilities - chilled towels, headsets, filtered water - but especially prized the ability to watch a TV within the treadmill.", "title": "A relaxing place.", "user": "HappyScotGlasgow", "date": "July 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35532664}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "From the moment we drove up to the hotel, we were more than thrilled with the customer service. The nice girl at the front desk (Amanda?) was so sweet. When the hotel found out we were celebrating my sister's 40th, they sent up a complimentary bottle of wine. The bellman (whose name escapes me) was a DOLL! He was hysterical and went out of his way to say hi to us when he saw us in the lobby over the weekend. If we needed anything, bam, it was provided. We stayed in the 1 bdrm suite and they brought up 2 rollaway beds for us (to accommodate the 4 of us) and it was perfect. My sister was in awe of the beautiful bathroom! =D The only drawback was that you had to pay $10/day for wireless. Seems odd when you could literally walk into the lobby at get it for free at Starbucks. Oh well. Would definitely give it two big thumbs up! (By the way, it was on the same block as the Cheesecake Factory and right down the street from lots of stores - PERFECT location!)", "title": "Couldn't have been nicer!", "helpfulness": 1, "user": "JustYourAverageJoe", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38212663}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I've stayed at the Grand Hyatt two or three times before, both personal and business trips, and it continues to be a very classy hotel. I never actually saw them, but I heard that the Yankees were staying there at the same time we were, and some in our group reported riding up the elevator with Kate Hudson (who is dating Alex Rodriguez). I guess if the hotel is good enough for them, it's good enough for me.", "title": "Very Classy hotel", "helpfulness": 2, "user": "Brian_NVA", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37855248}, {"rating": 3.0, "title": "It's all about marketing", "text": "Self parking is available in a garage behind the hotel (entrance on 7th Avenue) for $28.00 a day and no free in-and-outs. It's pricey, but not bad if you plan to walk most places. Valet parking averages about $38.00 a day with in-and-out privileges.", "user": "chiliyo", "date": "August 13, 2009", "id": 37592793}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The sleeping rooms have a nice, modern decor with a flat screen TV. I liked the large, well lit bathroom with a big bathtub and separate glass enclosed shower (nice soothing spray). There were lots of amenities that you don't get everywhere, like toothpaste, an umbrella, bathrobes, and a lint remover.", "title": "Elegant pampering", "user": "cobblehill", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37250651}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I found all of the staff to be helpful, courteous, and friendly. They went out of their way to try and beat me to the front door so they could open it. I liked the boarding pass kiosk in the front lobby, but didn't like that I had to go to the front desk for my bill when checking out (the hotel is trying to be green).", "title": "Perfect End to a Perfect Road Trip Around Washington/Oregon", "user": "freshfields98", "date": "August 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36483155}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We had a wonderful time at the Grand Hyatt. We stayed in a suite on the 28th floor with a beautiful view overlooking the city of Seattle. I would definitely recommend and stay there again.", "title": "Lovely", "user": "Tashakane", "date": "July 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35510739}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at the hotel for two nights before a cruise. We booked a corner suite, and WOW, the view. City view, since this hotel is about five or six blocks from the waterfront.", "title": "Beautiful Hotel, but five or so blocks from the Market Place.", "user": "pampered11", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34870430}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The room was very quiet,because of the bedroom being far from the door. Awesome bathroom too. The staff was very cordial, but some spoke broken English and hard to understand. It is located near alot of the big name stores. The only negative thing I can say is they need a restaurant other than Ruth Chris's. Somewhere to eat lunch or a breakfast that wont' break the bank. And a shuttle service would be nice since the cruise ships are so dominant in Seattle. Also, the internet was not free.", "title": "WOW! What a wonderful hotel to begin and end a vacation at", "helpfulness": 1, "user": "MGRHIlton", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34732966}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I have never traveled to Seattle, but decided to take a cruise out of their beautiful port to Alaska. We arrived at the Grand Hyatt a day early to ensure that we arrived on time for the cruise and when we returned from the cruise we decided to stay over the July 4th weekend. The staff at the Hyatt were some of the nicest people we encountered in Seattle. The front office staff and the concierge were all 10's, they remembered all of our names each time we went to the desk for anything. They were helpful, efficient and happy. The rooms were nicely appointed, spotless and clean. The hotel is within walking distance of just about every attraction in Seattle, if not it was a cheap cab ride to the event. They have Ruth's Chris inside the hotel, wow what a place to have breakfast much less dinner. am in the business and run a 1600 room competitors hotel in another city. I have never written a review before, but thought they deserved the accolades. The GM should be proud. The only suggestion I have is for them to provide transportation to the Cruise Ship Terminal", "title": "Better than a 4-star", "user": "calvino", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34404474}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My conference was at the hotel. I was thinking of saving a little cash (not so very much) by staying nearby, but decided to go for it. And I'm glad I did. This is the nicest Hyatt I've ever been in. All the fixtures are of the highest quality -- marble bathrooms hard wood furniture, Toto plumbing, etc. (even in the public areas) -- that it just plain makes you feel good to be there.", "title": "Nice choice in good location", "helpfulness": 1, "user": "Todnick", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 34318005}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "My husband was in Seattle for a meeting, I got to go for fun and shopping. The location of the hotel is fantastic. Walking distance to major shopping and Pike Place Market. Also close to the monorail to Seattle Center. The bathrooms are huge - with a separate soaking tub and glass shower. The rooms are a nice size and have blackout screens. Check-in was fast and the people are very friendly and helpful. We will be back on our next trip to Seattle.", "title": "Most wonderful bathrooms!", "user": "Kpatton19", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115550038}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "grand hyatt is grand, good location, spotless, and has friendly efficient staff. We must say thank you to rowda at check in desk she sent up a bottle of wine & chocolates to us as it was a combined 50th birthday & 31st wedding anniversary. We were very suprised and grateful. The luggage porter Mike was also very friendly he gave us plenty of information and tips on the best tours eateries ect. Conceirge was efficient and friendly helped with our requests. We had a nice room on the 21st floor with a view of the lake and city we had no trouble sleeping in Seattle if we ever come here again we would definately stay at this hotel. Thank you to all the staff who made our stay memorable.", "title": "just loved this hotel", "user": "PerthElvis", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115434515}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We were disappointed with our stay at this Hyatt. It is in a nice location in downtown Seattle. I also have to say that I was impressed with the room. We did have a nice corner room with a view of the Space Needle. However, the furnishings in the room are outdated and need to be replaced.", "title": "Just an average place, nothing special", "user": "Shannon2007", "date": "July 16, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 3.0, "service": 3.0}, "id": 115432003}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "My other complaint is that the hotel is in need of a bar. Maybe in the lobby? There is a Ruth's Chris with a passable bar that offers happy hour food and drinks. However, I would have expected a roof top bar or at least an upscale lobby bar for a hotel of this \"quality\".", "title": "Close but pricey", "user": "Momwith2teens", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 115339204}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Finally, what really did it for me was housekeeping ringing the bell just before 9:00 a.m. I cannot imagine what they wanted but they did go away when they discovered the deadbolt. Keep in mind that we were only there for one night and had not checked out. Unfortunately, after waking us up, she came back about twenty minutes later to see how long we would be. Friendly, but still....", "title": "worst overnight trip ever!!!", "helpfulness": 4, "user": "ferrismm", "date": "July 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 115264545}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I spent three nights at the Grand Hyatt Seattle for a conference. I paid $300 for a Regency Club room, actually a Corner Suite. I'm not sure if all Regency Club guests get these rooms or what. The hotel is conveniently located, although all of downtown Seattle seems to be under construction, and the street in front of the hotel is totally dug up. This means noise. The interior of the hotel is teaky wood, modern and uncluttered. I found the staff to be young and a little inexperienced, but generally fine.", "title": "Really good ... but not perfect", "helpfulness": 5, "user": "Spacrawler", "date": "March 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7210207, "likes": {"liked": "— Bathroom with great soaking tub and separate shower", "disliked": "— Cramped, dark, and stuffy corner suite"}}, {"rating": 5.0, "title": "Some Additional Details....", "text": "There were two things I wish could be better about the property. First, my corner suite was cramped, dark and stuffy. There is only one little tiny window that opens, and with the construction noise, I didn't open it. There is a funky cooling system in place, such that you can only turn the temp down so far, then you can not set it to run and cool constantly. Often it was on auto and thus the stuffiness. The lighting in the room was poor, except for the bathroom, which had great lighting. The carpet was worn and stained in places. A couple of other points - you will pay for internet access; you will be charged if you move anything in the minibar (you can get a fridge for $5 a day), and you will be disappointed with the old fashioned TVs, if you like to watch the tube. On the plus side, the bed, the linens, and the bath with separate tub and shower were fantastic.", "helpfulness": 9, "user": "tonymoco", "date": "March 17, 2007", "id": 7179231}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The other issue I had was with dining options - or the lack thereof. There is a Ruth's Chris Steakhouse in the hotel, but their menu is pretty limited (especially for breakfast) and very pricey. I wish they had a restaurant that was less clubby with more choices. if you don't eat meat, you will not have much to choose from.", "title": "Superb Downtown Hotel", "helpfulness": 6, "user": "evvtraveler", "date": "March 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7149163, "likes": {"liked": "— the surperb location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I guess I would stay at this hotel again, but not for the price I paid. I researched my options very carefully, and I beieve that I got the best of what was available. Others at the conference stayed at the Sheraton, which is under a major renovation, and the Westin. Neither excited my colleagues.", "title": "How definitely GRAND it is!!!", "helpfulness": 8, "user": "D-fine", "date": "March 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6900643, "likes": {"liked": "— Location", "disliked": "— Gift shop hours"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Perhaps Seattle is ripe for a true luxury hotel - wonder why the Four Seasons abandoned ship and the famous Olympic Hotel is now being run by Fairmont?", "title": "Second Time Visit! Great!", "helpfulness": 10, "user": "Mike_the_traveller", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6553806, "likes": {"liked": "— Location", "disliked": "— Small Lobby, Expensive Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed in the Grand Hyatt Seattle on Pine Street. Once more we were stunned by the Hyatt quality and comfort. The hotel was excellent, the room was spacious, comfortable and well decorated. Location was great as well, it was walking distance from the famous Pike Place Market and many other attractions. No doubt it was a great choice.", "title": "Beautiful room", "helpfulness": 2, "user": "Gremio", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8092469, "likes": {"liked": "— Room, location, design.", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The location is fabulous. Walk to everything . Great gym at the property. Ruth Chris is attached and has two Happy Hours each day. Check it out! My one complaint was that housekeeping really did not do a good job. I kept asking for extra towels, turndown service, shampoo, coffee........ They just could not get it right. Asked for hangers, took three calls to get hangers. Other than that, the place was wonderful. Would stay there again.", "title": "Great location", "helpfulness": 3, "user": "Greekchick", "date": "July 9, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "business": 3.0, "cleanliness": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8087567}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We stayed at the Grand Hyatt Seattle for six wonderful nights at the end of June. This is one of the BEST hotels I've ever enjoyed!", "title": "It's truly GRAND!", "helpfulness": 2, "user": "wvchick", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8052264, "likes": {"liked": "— Rooms, beds, huge bathtub, Regency Club, service, location", "disliked": "— Nothing - everything was perfect!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We upgraded to a Regency Club room and were given a corner room on the 20th floor. Great view! We loved the layout. As you enter the room, there's a small living area with a couch/chair/desk/TV. Turn down a small hallway to reach the bathroom and bed. Oh the bed! It was so comfortable! What a great way to end the busy day...just sinking into it and surrounding yourself with the many pillows.", "title": "Distinctive Upscale Hotel", "helpfulness": 5, "user": "Andaltex", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7955878, "likes": {"liked": "— Overall excellence", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Speaking of beds...we requested a rollway for my young daughter. It was already in the room waiting for us. That's a first! I always have to call for it wherever we stay.", "title": "Fantastic Getaway at the Grand Hyatt", "helpfulness": 3, "user": "waimeawishes", "date": "June 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7952343, "likes": {"liked": "— The bed", "disliked": "— The view"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I stayed at the Grand Hyatt Seattle while attending a conference and could not have been more pleased. It was one of the best hotel stays I have ever had.", "title": "One of the best hotels EVER", "helpfulness": 8, "user": "rugbyshirt", "date": "May 16, 2007", "detail_rating": {"front_desk": 4.0, "value": 4.0, "location": 5.0, "business": 5.0, "rooms": 5.0}, "id": 7631442, "likes": {"liked": "— beautiful, comfortable room", "disliked": "— pricey, but worth it"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room was absolutely gorgeous ... I honestly don't think I've ever seen a more attractive hotel room. It was like something out of Architectural Digest. Beautiful furniture, wall coverings, window treatments, everything. I loved the automatic blackout blinds over the gigantic windows (I could see the top of the Space Needle from mine) -- you can raise or lower the shade without getting out of the very comfy bed. Lots of nice little touches; I liked having a little \"do not disturb\" light you can turn on rather than hanging a sign on the doorknob -- very convenient and classy.", "title": "Wonderful Stay...", "helpfulness": 6, "user": "fez030303", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7615450, "likes": {"liked": "— Everything!!", "disliked": "— nothing...."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The bathroom was ENORMOUS, and stunning. Marble, brass, huge glass shower, beautiful fixtures. The tub was so large and inviting that I couldn't resist taking a bath, and I'm not even a bath person.", "title": "Classy and Contemporary Hotel!", "helpfulness": 11, "user": "september2374", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7471872, "likes": {"liked": "— Style, View & Cleanliness", "disliked": "— EVERYTHING in this hotel is expensive...but also well worth the money, if you have it."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The location was wonderful -- about a block from the convention center, and tons of dining and shopping options within easy walking distance. Loved the Barnes & Noble across the street and the Starbucks you can get to directly off the hotel lobby.", "title": "Wedding Night Bliss", "helpfulness": 5, "user": "tiffanyg54", "date": "April 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7381539, "likes": {"liked": "— The room", "disliked": "— Checking out"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "The desk staff was friendly, professional, and helpful; I never had to wait in line to be helped. The lobby has lots of comfy seating and is a great place to meet friends and chat. This feels like a boutique hotel -- you never feel like you're in some huge monolith. The hotel is actually quite compact, so you're never too far from the elevator (though I never heard it, or much of anything else, from my very quiet room).", "title": "A Wonderful Experience in Seattle", "helpfulness": 8, "user": "VacationPlanner", "date": "March 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7258850}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We have stayed at many Hyatts for many years, and have generally been very pleased. Grand Hyatts are expected to be high standard (just below Park Hyatts), and this one met expectations. Calmly elegant in a sparse, modern way. Very friendly service. Comfortable and well-appointed rooms with especially comfortable bathrooms. Showing just a bit of wear and tear. Some rooms have wonderful view; many do not. We stayed here once before about a year ago and had a very similar, positive experience. $45 valet parking (about $50 with tax) is not outrageous for central hotels in big cities, but it does discourage people who are traveling by car. Perhaps that is so small a % of this hotel's business that they don't care, but it will keep us away next time we drive to Seattle to visit friends. We'll return to our mainstay, the Hyatt Regency Bellevue.", "title": "Meets Grand Hyatt expectations", "helpfulness": 1, "user": "hcajones", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115869072}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed here beginning of this year for a night. Room and bathrooom was spectacular. Even though the standard room was a bit crampy, it was exceptionally clean. Bed was very comfortable and fits a 4 star hotel. They have a pretty decent bar in the hotel itself.", "title": "Great room, but view was not good", "user": "lizzy_sj", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 115773796}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Only thing I did not like with the stay was the view from the room was not good. We could only see the roof and chimney of the next building.", "title": "Excellent service", "user": "ringluvr", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115773263}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My husband and I spent 4 nights at the hotel July 7 - July 11th. The staff was so friendly and helpful. The restaurant in the hotel is Ruth Chris Steakhouse. Fantastic! And there is a Starbucks in the building. We had a standard room with a great view. The room was clean and the bed was heavenly.", "title": "Great service, great room, great location", "user": "marianaflorida", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115660790}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "GREAT fitness center there too. Probably the best I've ever seen in a hotel.", "title": "Total Relaxation Always!!", "user": "Jazzierose1", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115551605}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "My mother and I stayed here during her husbands week-long conference at the Westin and am kind of on the fence about how I feel about the Grand Hyatt.", "title": "Awesome Rooms, Not So Awesome Service", "helpfulness": 6, "user": "WaterfallsLover", "date": "June 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7819559, "likes": {"liked": "— The amazing marble bathroom and the overall design of the room.", "disliked": "— Customer service"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The rooms are fabulous. I want this bathroom in my house! The housekeeper was terrific and the beds are super comfy with down comforters. Also, the hotel is close to everything!", "title": "Comparison: Grand Hyatt & Sheraton", "helpfulness": 5, "user": "Riverspots", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7780845, "likes": {"liked": "— Great bed, great bathroom", "disliked": "— Dark interior, Internet charge"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We ran into a couple snags - otherwise I would have rated this hotel a 5.", "title": "nice hotel and friendly staff", "helpfulness": 3, "user": "pugmix", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7769386, "likes": {"liked": "— the location of the hotel and nice rooms", "disliked": "— lack of automatic entry doors"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "First, the concierge's at this hotel were not helpful at all. Maybe we would have been treated differently if we walked up to the desk in business suits. Scott, the night time concierge told us that all of their pamphlets were moved around but he would provide us with information on Victoria, we gave him our room number and nothing. Not even a telephone call. There was one woman that was helpful and we wish that she was there during the other times we needed help. We actually received better assistance at the Westin and we weren't even staying there!", "title": "Labor Day Fun", "helpfulness": 2, "user": "roomandbored", "date": "June 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7730985}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Second, upon leaving I tried to use the elevators only to find out that there was some kind of fire alarms going off. I thought this was odd since the fire alarm lights near the elevators were not flashing. I called down to the front desk and was told that the fire department needed to turn off the alarms and should take place by 6:00 a.m.. When I tried to go down again around 6:05, the elevators still would not work. I told her that I needed to leave in order to catch my flight and asked her to send up someone to bring down my luggage. She said OK but after 5 minutes, I had a strange feeling that I wasn't going to get any help. So, I lugged my suitcase down 10 flights. I guess I was kind of lucky, some guests had to come down as far as 26 flights of stairs. When I got to the last set of stairs, someone from Hyatt asked if I needed help. Yeah, OK. It's a little late for that! Later, I was told that the bellboys didn't even start their shift until 8:00 a.m.. I would have waited an aweful long time by the elevators if I hadn't decided to walk down the stairs!", "title": "Disgusting!", "helpfulness": 6, "user": "ArizonaSenor", "date": "May 28, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 7708561, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and I checked in for a one night stay for our 21st wedding anniversary. We reserved a king room with a water view. When we got to out room, it was looking at the freeway, nice room but not the view we were looking for. We went back down to the desk and told them this was a very special anniversary night and could we please have a water view. She did a little checking, apologized and said we would be very happy. We went back to our new room and it was the top floor executive suite, nicest room I think we have ever stayed in. I would definetely go back to the Hyatt Seattle. This is a beautiful hotel and the staff is very accomodating. We went to Ruth Chris for dinner and also told them it was our anniversary and they decorated our table gave us complimentary appetizers and two glasses of champagne. They were very nice also, but the dinner was too expensive for what it was.", "title": "Above and beyond", "helpfulness": 6, "user": "legendtraveler", "date": "December 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6485563, "likes": {"liked": "— the bathroom", "disliked": "— hotel restaurant"}}, {"rating": 5.0, "title": "Excellent service", "text": "Arriving at noon, the front desk staff checked us in without any", "helpfulness": 5, "user": "meklof", "date": "December 13, 2006", "id": 6438310}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "problems and even gave us a water view room.", "title": "Great Hyatt", "helpfulness": 2, "user": "AFrequentTraveller", "date": "December 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6334333, "likes": {"liked": "— The quality of the accomodation and the central location", "disliked": "— No on-site bar or restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The included continental breakfast at the hotel restaurant Ruth Chris Steakhouse was delicious.", "title": "Truly grand!", "helpfulness": 6, "user": "Amanita", "date": "December 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6321230, "likes": {"liked": "— The room/bathroom", "disliked": "— The view is not great."}}, {"rating": 5.0, "title": "What They Said", "text": "When the front desk staff found out ,upon check out, that we were unable to check in at their online kiosk, they quickly forwarded us to the concierge who took care of this with a smile!", "helpfulness": 4, "user": "Layover", "date": "December 2, 2006", "id": 6317380}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "My wife and I have stayed at the Hyatt many times, But even when we haven't been back for a year they tell us \"welcome back\" before we even get out of the car! They have a way of making you feel like their favorite guest. You will not find a better view or nicer rooms, I love the fact that with a flip of a switch the blinds go up to feveal the down town sky line. Also the pollow top beds are sent strait from heavan! We have stayed at almost all the fine Hotels in Seattle, but we always seem to come back to the Hyatt. I tell all my friends about the Hyatt and many of them have come down and had the same experience. I honestly can't think of one negative thing to say about our experience's at this hotel. Room service was very fast and staff very helpful.", "title": "The Grand Hyatt is just that..Grand !!", "helpfulness": 4, "user": "colby_Tim", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5905624}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We have spent many anniversary's there, and will be coming down for our up coming 25 th. To the staff Keep up the good work !!", "title": "We would happily recommend the Hyatt", "helpfulness": 7, "user": "Laonie", "date": "October 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5897698, "likes": {"liked": "— Convenience", "disliked": "— The mini bar"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "sincerely Tim and Melanie", "title": "Excellent Hotel", "helpfulness": 4, "user": "AlanSusan", "date": "September 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5818788, "likes": {"liked": "— High Quality", "disliked": "— No ice machine on every floor"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The Grand Hyatt was our arrival point during a recent trip from Australia to Canada and Alaska. Check-in was quick, even though we were initially allocated a room with twin beds instead of the requested king plus rollaway. The error was corrected immediately and we were shown to a pleasant room with city views. The bed was comfortable and made up with very good quality white linen, which is always nice. The rollaway bed for our son arrived very quickly.", "title": "Lived up to its great reviews...", "helpfulness": 4, "user": "Mandirae", "date": "September 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5799368, "likes": {"liked": "— Classy accommodations, comfortable bed. Beautiful view. Great location.", "disliked": "— Expense of Valet parking"}}, {"rating": 5.0, "title": "Spectacular in every sense of the word", "text": "The spacious marble bathroom had double basins, a huge shower & great water pressure and was stocked with products we actually enjoyed using.", "helpfulness": 6, "user": "Mr&Mrs23", "date": "September 10, 2006", "id": 5786985}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "This is our second time staying at the Grand Hyatt and have enjoyed it again. The staffs are always friendly and the views from the bedroom are spectacular.", "title": "All-round fabulous experience!!!!!", "helpfulness": 8, "user": "luvgreathotels", "date": "January 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6539804, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "title": "The Modern, Comfy (Elliott) Grand Hyatt Seattle", "text": "PROs:", "helpfulness": 17, "user": "BSA126", "date": "December 28, 2006", "id": 6510829}, {"rating": 4.0, "title": "Great Hyatt", "text": "One of the nicer Hyatt's on the west coast. Bathrooms are absolutely amazing. Very modern bath fixtures with the largest tub I've ever seen in a Hyatt. The bed was comfy, room service excellent and the location cannot be beat. Whether you come to Seattle for vacation or business, this hotel is worth every penny. Skip your car rental, make transportation arrangements with a transfer company or taxi - you will not need a car when staying at this hotel. ). I was there in September and every day was sunny and cool. Not what I expected for 5 days in Seattle.", "helpfulness": 4, "user": "swimnski", "date": "November 6, 2006", "id": 6079541}, {"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "I stayed at the Grand Hyatt on business for 5 nights in October 2006. My family came with me for two of the days and at check-in they easily upgraded me to a corner suite for a few dollars more.", "title": "First Class Hotel", "helpfulness": 6, "user": "SouzaKH", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6034746}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Check-in was one of the smoothest and friendliest I have ever experienced. The clerk called me in my room a few minutes later to see if everything was okay.", "title": "Great Stay at the Grand Hyatt in Seattle", "helpfulness": 10, "user": "Karroons", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6025225, "likes": {"liked": "— Proximity to other attractions", "disliked": "— That my room was not ready when promised."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The rooms are great, the corner suites are very nice with an entrance and sitting room well separated from the bedroom by a long hallway.", "title": "Fabulous Hotel", "helpfulness": 4, "user": "fromArizona", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5965474, "likes": {"liked": "— View"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Why didn't I give the Grand Hyatt 5 stars?", "title": "Excellent Hotel, Down to Earth Staff", "helpfulness": 8, "user": "IADTraveler", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5944082, "likes": {"liked": "— Quality, Staff, Location", "disliked": "— Nothing"}}], "location": {"country": "United States", "city": "Seattle"}, "stars": 4, "variance": {"poor": 21, "average": 51, "very good": 304, "terrible": 12, "excellent": 650}, "aka": "Grand Hyatt Seattle Hotel", "slim_ranking": 0.129032258065, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Grand Hyatt Seattle will satisfy even the most sophisticated business & leisure travelers. Centrally located in downtown Seattle, next to the Washington State Convention & Trade Center, the hotel redefines the hospitality standard in the Pacific Northwest. Open spaces with a friendly accommodating spirit and high-tech wizardry, the hotel was created with meetings in mind. Its ballrooms, prefunction rooms and more than 25,000 square feet of meeting space feature marble, fine woods, and rich fabric decor."}