{"user_rating": 4.0, "review_count": 275, "name": "Grand Hotel Santa Lucia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We spent four lovely nights in a beautiful room overlooking Vesuvius and the Castel dell'Ovo and the marina. Reception and Concierge staffs were very helpful and most friendly. The front desk provided lots of support with restaurant reservations.", "title": "A Truly Grand Hotel", "helpfulness": 3, "user": "Mel_Paris", "date": "February 15, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 24581004, "likes": {"liked": "— Large, elegant room", "disliked": "— Breakfast buffet service and selection"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The room was large, clean and well furnished. Had a large, flat screen television. (We found a proposed 4-Euro charge for music ridiculous!) The room had electrically operated shudders that blocked almost all the street noise. The bathroom was large, well-lighted with a \"jacuzzi\" type tub large enough for four people.", "title": "Great end to a perfect honeymoon", "helpfulness": 3, "user": "DH76", "date": "February 2, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 24097828, "likes": {"liked": "— Location/views", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Small problem with the breakfast that often had been picked bare by 9h30 on Friday and Saturday, and was not replenished. It was off season.", "title": "Very Romantic", "helpfulness": 2, "user": "Jetdriver21", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21470508, "likes": {"liked": "— location", "disliked": "— had to leave before breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The concierge didn't bat an eyelid when we wandered into the hotel's marble foyer, in crumpled clothes and dragging old bags after a week's sailing. He still smiled at us the following day when we returned from a trip up Vesuvius and round Herculaneum, dressed in shorts and sandals, covered in volcanic dust and slightly sunburnt. They upgraded us to a suite, because we were on our honeymoon and the bath tap was dripping in the first room they showed us. We didn't eat at the restaurant, but breakfast was fine. If I had to nitpick, the bar is not very welcoming. Go for a room with the seaview - it's worth the additional few quid.", "title": "charming", "helpfulness": 1, "user": "sfollett", "date": "October 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20761003, "likes": {"liked": "— the italian decor and friendly staff", "disliked": "— the price"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This place is a gorgeous old building sitting on the water front across from an old castle. Very romantic area. Lots of shopping and great restaurants up and down the coast. The interior is very beautiful with lots of traditional Italian décor – like and old mansion. Staff is excellent. Rooms are very large suites (stayed in the deluxe room). Had a study/office section, a bedroom section and a giant bathroom. Each room had its own flat screen TV as well as surround sound. Bed was great – slept very well. Bathroom had lots of granite and ceramic everywhere – big mirrors for the chic’s.", "title": "Great Room w/ a water front view", "helpfulness": 2, "user": "dufflebag", "date": "September 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20474277}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Myself and Hubby stayed here for one night recently, on our way to a week's stay in Positano on the Amalfi Coast. This hotel was such a fabulous start to our holiday! We arrived at about 10.30pm and the hotel was quiet, but no problem at all checking in so late. Very professional at reception, and any extra information that we needed (eg, how to get ferry to Positano next day) was provided with a smile. We had booked a \"Delux Sea-View\" room from the hotel's own website, at €190 per night incl. breakfast. The room (509) was much bigger than we expected, and had the promised sea view - in fact it couldn't possibly have been a better sea view. The room itself was directly opposite the lifts on 5th floor, which concerned me at first in case there were noise issues, but we heard absolutely nothing. On entering the room, you are first in a kind of lobby area with 2 double wardrobes with full-length mirror fronts (handy for the ladies!), there is a door from this area into the bathroom - marble, has everything you'd want - and then there is a large opening into the bedroom area, which has a couch and armchair, a table and 2 chairs, a large telly, full mini-bar, tea & coffee facilities, lovely big bed, and 2 floor-to-", "title": "I LOVED this hotel!", "helpfulness": 2, "user": "TinyLittleFeet", "date": "July 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17883026}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "ceiling doors, each to a small balcony - and the view! So amazing! The sea is right across the road, loads of boats in the harbour, a big old building which is a monument of some kind - a Moorish Castle, I think (apologies, we absorbed so much in the following week in Positano that I've forgotten some details!) - please note that this building looks so much nicer in real life than the photos show. Anyway, the room is huge (for something that isn't even a suite), has fully-effective air conditioning and electrically-operated (from the bedside switches - that took us a while to find!) black-out shutters etc. We had a quick drink in the beautiful marble bar area before bed - massive measures! Breakfast in the morning was in the beautiful main restaurant - buffet style with hot and cold dishes - different to what Irish and English people are used to, but it'd be no fun if the food was the same all over the world! If you have a sweet tooth, you'll be delighted with the selection of cakes at breakfast! Again, the service was exemplary. We really couldn't complain about a thing. They ordered a taxi from the street for us to get to the port, about 5 minutes drive away. I would so recommend this hotel. I have no comments on Naples itself, as we literally only saw the hotel and the port, but let me tell you all - Positano is a gem of a place!", "title": "Chaotic city, lovely stay", "helpfulness": 2, "user": "waytogohome", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14540358}, {"rating": 5.0, "stay_parameters": "Stayed June 2004, traveled with friends", "text": "My partner and I spent four nights at the Grand Hotel Santa Lucia in early March of this year, and we could not have been better served. Our room was luxurious and comfortable -- we were in a front corner on the third floor, glorious views from two balconies out over the bay of Naples to Capri and (just around the corner) a peek at the slopes of Vesuvius, an extraordinarily comfortable bed, and a jacuzzi tub large enough to swim across. The staff could not have been more helpful, pleasant and accommodating. The hotel is within an easy walk of three terrific and highly rated restaurants (we had fine meals at Bersagliara, Antonio y Antonio, and Mussels and Soul) and at least ten more scattered all across and around the waterfront, right at your doorstep. We'd read some reports of street noise creating problems for sleepers, and although this might be a bit more of a problem in high season during the summer, we never had an issue with it, and slept with the balcony doors open each night. Our room rate included the buffet breakfast at the hotel -- quite a variety, beautifully served, and the milk which accompanies the coffee is hot and frothed. We did a fair share of traveling during our visit -- to Pompeii, out to Sorrento, the Amalfi coast and Paestum -- but for shorter trips and the airport, the taxi stand is located right next to the hotel. This is a quiet, relaxed, elegant place. We really could not have been happier with this hotel -- highly recommended.", "title": "A grand hotel indeed", "helpfulness": 2, "user": "cg40gb", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13936303, "likes": {"liked": "— the bathtub", "disliked": "— the overpriced taxi from the airport"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008", "text": "This hotel is certainly what it says on the tin; grand. I had a junior suite with a sea view. The room was remarkably spacious with sitting area, desk and a monster of a bed. The bathroom however was sublime, with a jacuzzi tub you could have done laps in. The front windows opened onto a small balcony with a view of the Med. It's a great value for the price. The staff were charming and the location is wonderful, near several lovely restaurants. While Naples isn't everyone's cup of tea it is a vibrant and living community with lots of treasures for those with enough travel savvy to seek them out. When you've had enough of the chaos of the street the Santa Lucia is a wonderful refuge and worth every penny.", "title": "Gorgeous Location, Fabulous Service", "helpfulness": 1, "user": "LFaith", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12389005}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We just returned from two days at the Grand Hotel Santa Lucia. From the moment we walked in -- where Francesca provided fantastic service at the desk, made perfect restaurant recommendations, and found us a very knowledgeable guide, to the rooms with amazing views of the Naples Harbor and Mount Vesuvius, the birthday cake they sent up for my husband (without being asked), the sumptuous breakfast buffet, collecting our kids' errant ball from the restaurant awning -- it was a wonderful experience. The only drawbacks were the noisy fan and some peeling wallpaper over the windows in our room. But they did not in any way detract from our lovely stay at Santa Lucia.", "title": "5 Stars? May be, if you are careful", "helpfulness": 3, "user": "luxuryhotelsdreamer", "date": "January 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 12217427, "likes": {"liked": "— Location", "disliked": "— Room"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We fancied visiting Napels - big mistake - a terribly dirty city with graffiti just about everywhere. We booked into the Santa Lucia based on the reviews on TA. The hotel was very tired, the bar was empty and had no atmosphere whatsoever - the silence not even lifted by some music! The restaurant was closed in the evening (no prior warning given at time of booking with expedia). We had a problem with no hot water in the washbasin, which was eventually fixed, apart from having a bed for the evening you may as well have been anywhere.", "title": "Tired and lacking in atmosphere", "helpfulness": 3, "user": "BlondieMo", "date": "August 26, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 19370279, "likes": {"liked": "— Leaving", "disliked": "— Arriving"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We also popped along to Pompei - on the train. It is worth going this way if only to experience how dirty the whole place is - just about every station is covered in graffiti along the journey. Even our train was covered in it - so much so you could not see out of the windows!. Pompei is amazing though - well worth the trip.", "title": "Any hotel must be struggling to survive in Naples!", "helpfulness": 2, "user": "ClaireyEngland", "date": "August 19, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 19108898, "likes": {"liked": "— Views of the Bay", "disliked": "— The city it is in."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Nothing else to say about Naples except there are far too many beautiful and interesting places to go in the world rather than waster your time here!", "title": "Beautiful hotel", "helpfulness": 2, "user": "Michelle66Canberra", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18401941, "likes": {"liked": "— The suite was beautiful, comfortable, well equipped"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Oh, and by the way, the taxi drivers try to exploit you at any given opportunity so watch out!", "title": "Relaxing stay", "helpfulness": 2, "user": "Azuremeg", "date": "July 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18167675}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "4 of us stayed for 2 nights at The Santa Lucia. The hotel itself was OK but showing signs of lack of up keep. Staff were polite and helpful. Unfortunately we picked the wrong weekend to stay as alot of the city was shut for holidays, and the hotel was desserted - no atmosphere at all. Naples is an absolute dump - we knew there were rubbish issues but there does not seem any attempt to clear it all. Got the impression that nobody cares about Naples which is a shame as there is alot of potential. It was a shock after spending the first days of our holiday on the Amalfi Coast. The hotel breakfast was nothing outstanding - the hot buffet consisted of scrambled egg, bacon, sauasage, carrots, peas and green beans! The veg looked as if it had been there for days. We had rooms on the 5th floor - well appointed with large beds and efficient air conditioning. Large bathroom but with a very small jacuzzi bath with shower over. The hotel overview says there is swimming nearby - we could not find any! Not unless you wish to swim in the marina and surroundings with all the rubbish floating in the water. Absolutely disgusting. If you are thinking of going to Naples I suggest the best thing to do is keep going and head out to the Amalfi Coast instead.", "title": "Pleasantly surprised with Naples", "helpfulness": 2, "user": "Victoria003", "date": "July 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18127740}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 4, "variance": {"poor": 18, "average": 39, "very good": 94, "terrible": 13, "excellent": 111}, "aka": "Grand Hotel Naples", "slim_ranking": 0.167512690355}