{"user_rating": 4.0, "review_count": 864, "name": "Grand Park City Hall", "reviews": [{"rating": 3.0, "title": "Overpriced", "text": "We stayed here for 4 nights on our way to the UK.", "helpfulness": 4, "user": "flossieChristchurch", "date": "June 20, 2007", "id": 7940071}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The stay in this hotel has been most disappointing, particularly as I rated the standards of Singapore hotels having stayed in Clarke Quay 3 weeks earlier on a two night stopover. It is rated as a 5-star hotel, but the room provided felt more like a 2-star hotel. The location is great and the hotel lobby looks presentable, but once you get to the hotel rooms, it is very disappointing. We were first offered a disabled room (my wife is partially sighted) and I think they thought they were doing us a favour. We had actually booked a Superior room and were informed that this room was a Deluxe. We immediately rejected this room as it smelt of damp & stale smoke. We were then provided with a 'Deluxe' room on the sixth floor which was drab and equally disappointing in its appearance and cleanliness. The carpet was dirty and does not appear to be vaccumed, the sheets and valance looked grubby and all in all the room had a tiredness to it.. The bathroom had no fan, there was mildew and mould over the grouting and wall tiles. The grouting looked as though it had been done by an amateur. The kettle did not turn off , so could have boiled dry if left.", "title": "Disappointing, after 4 weeks of good quality hotels.", "helpfulness": 1, "user": "aholden862", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 58821102}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "Front of house were courteous and efficient and I have no problem here.", "title": "Excellent hotel", "helpfulness": 1, "user": "Ozzie003", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58764015}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "As this was our final leg of our months holiday and our second stop in Singapore, it took the edge off what had been a great trip, having stayed in a number of better hotels and apartments.", "title": "Loved the Grand Park", "helpfulness": 1, "user": "SaurabhNayar", "date": "March 4, 2010", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "rooms": 4.0}, "id": 57681267, "likes": {"liked": "— Location, Cleanliness", "disliked": "— Small rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I really enjoyed my stay at the Grand Park City Hall. Without exception all the staff I dealt with were friendly and very helpful. My room was clean, of a good size and with nice furnishings. The breakfast that was included as part of my room rate couldn't have been better. Grand Park is in an excellent location, being an easy 5min walk from the City Hall MRT station, very close to Clarke Quay, lots of shopping complexes close by and various other attractions all in walking distance or an easy ride on the MRT. A big plus for me was being away from the rat race of the Orchard Road hotels. I would definitely stay again at Grand Park City Hall.", "title": "Shame about the room, restaurant, TV, Internet, and shower", "helpfulness": 2, "user": "cbsteh", "date": "March 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 57490902}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "I booked this hotel after seeing reviews on tripadvisor.com. I must say that I am very much satisfied with the hotel and its location. The room and bathroom are pretty clean and but little small. The hotel location is in middle of business center and you can get anything from the nearby stores, even for local travel, MRT station is at walking distance. Being an India and a vegeterian the hotel has some Indian restaurants nearby which are good for daily meals. Overall its was a great experience living here and would definitely like to stay here again.", "title": "Very disappointing for a 5-star hotel by Singapore standards", "helpfulness": 1, "user": "LLG27", "date": "March 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 57399009}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed here in March and May this year, and were more than pleased with everything in this fine Hotel which is very conveniently located, just a short distance from Clark Quay, the river, Raffles and many other places.", "title": "We will certainly stay here again", "helpfulness": 2, "user": "flossieChristchurch", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66269244}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Due to a slight hitch with our room in March, it mean we had to stay on a smoking floor for the first night. To compensate for this slight inconvenience, we were given access to the Crystal Club facilities on the 10th Floor for the rest of our stay. The Front Office Manager, Kent Law, did everything he could to ensure that we were happy, and the Club facilities certainly made up for any inconvenience. Mr. Law also told us that we would be upgraded on our return in May.", "title": "Comfortable stay in fantastic location", "helpfulness": 1, "user": "GemmaSydney", "date": "May 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 65871375}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "On our return from the UK in May we were delighted to find that we had been ungraded to a Premier Room, and again had the use of the Crystal Club facilities for the length of our stay. I must give credit here to the wonderful staff who work in the Crystal Club. Nothing was too much trouble.", "title": "Memorable Visit", "user": "Eaton Bray Globetrotters", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65361606}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The Hotel staff were, without exception, absolutely first class. Bob, the Concierge, did a great job in ensuring that we were checked in for our flight back home, and had the seats we requested. This is a huge plus for someone who is not totally computer literate!", "title": "Good location, nice spa, but good sized bedroom a little tatty", "user": "Alistairio", "date": "May 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 64491231}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I would have no hesitation in recommending this Hotel to anyone.", "title": "Great location and excellent staff", "user": "Poppet12", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63793459}, {"rating": 4.0, "stay_parameters": "Stayed August 2009", "text": "The Best point about this hotel was its prime location.", "title": "Grand Hotel In City Center", "helpfulness": 1, "user": "Hemant_Agrawal", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57010215}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The service was very good.Only there was no complementary water (in Singapore tap water is portable, but for a water fearing Indian, i still prefer bottled water)", "title": "Good central hotel, very tired and fusty smelling rooms", "helpfulness": 2, "user": "ParisChristina", "date": "February 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 56050735}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "An excellent spread for the morning Buffet.", "title": "Great place to stay in Singapore", "helpfulness": 2, "user": "jillyportsmouth", "date": "February 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55869802}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "Very close to the prime shopping locations and wide range of multi cuisine restaurants(Decent number of vegetarian restaurants with McD, KFC, SUBWAY thrown in at Furan Mall).", "title": "High quality and excellent staff", "helpfulness": 2, "user": "akl_traveler36", "date": "February 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55682223}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "Boogey Street which is next metro stop is an excellent shopping for cheap street stuff.", "title": "Fantastic service from great staff!!", "helpfulness": 4, "user": "Empirera", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55032030}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Spent 10 nights at this wonderful hotel and it surpassed all expectations . Had seen some reviews here which were a mixture of opinions so not sure what it would be like. We arrived very early in the morning so did not expect to have a room straight away . However we were able to get into our room by midday which was absolute bliss after a 14hr flight from the UK. The room was spacious and spotlessly clean as was the rest of the place. Extremely luxurious given the price . Breakfast from the buffet ranged from traditional English to local specialities with plenty to choose from . We were very well looked after by very attentive and friendly staff. All in all I can highly recommend the Grand Plaza on Coleman street", "title": "Wonderful Hotel", "helpfulness": 8, "user": "montymuffin", "date": "October 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10075876, "likes": {"liked": "— spacious room", "disliked": "— nothing to dislike !"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I stayed in this hotel during a conference and a few holidays. The location is not bad, close to Singapore river (walking distance of Boad & Clarke Quays) and City Hall subway station. The hotel is quite an average business-type hotel. Breakfast is very expensive if not included in the room rate (S$ 29). The room was OK, nothing special. Lots of mould in the bathroom though! Staff is very friendly and helpful.", "title": "OK hotel", "helpfulness": 1, "user": "KarinSl", "date": "October 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10048286}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Cannot believe this Hotel is rated only 18th in Trip-advisor, the other 17 must be absolutely fantastic. My wife and I stayed here for 4 nights on a stop over to Australia and thought this Hotel was fantastic. The rooms, restaurant, reception and pool area, were excellent; but above all the staff were friendly, helpful and very professional. If possible have the breakfast included when booking as this will set you up for either a days site-seeing or shopping, depending on your preference. Singapore can best be described as a Botanical Garden where people live and work. The whole island is spotlessly clean and perfectly safe of a night. The hotel is located very close to the river where restaurants are bars are not in short supply. We liked this Hotel and as our daughter now lives in Australia I am sure we will be making this our stop over destination again, hopefully very soon.", "title": "First class location", "helpfulness": 6, "user": "Hammers", "date": "September 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10007031, "likes": {"liked": "— The location is ideal to explore Singapore", "disliked": "— Nothing the Hotel ticked all the right boxes"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2003, traveled with family", "text": "Stayed in this hotel with my parents for four nights. I really liked this hotel. Great lobby and pool area. Very polite and professional staff. Rooms were clean, convenient and well decorated. Very good location.", "title": "Nice stay", "helpfulness": 6, "user": "antic", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8664533, "likes": {"liked": "— Pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We love Singapore!!! We did a lot - Sentosa, Orchard Rd, Bugis, Night Safari, Clarke Quay, Night clubs, etc", "title": "Wonderful hotel", "helpfulness": 7, "user": "summerdaisy77", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8218982, "likes": {"liked": "— clean room with good facilities and attractive decor, great hotel location, great gym and nice pool area", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Excellent comfy hotel, helpful staff, good rooms, location faultless, near Boat Quay. Taxis nearby. If you have late flight, they don't only store your luggage, they give you a room to shower in before you go the airport!", "title": "Just the job", "user": "HHandGH", "date": "May 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63672725}, {"rating": 4.0, "title": "My 2nd Time at Grand Park", "text": "When my folks told me that we were staying at Grand Park City Hall, I thought it was a familiar hotel. Then when I actually went there, it indeed was. I knew it as the Grand Plaza Park Royal. It is at the heart of the city so Clark Quay, Raffles City, Funan IT Mall and some of the museums were less than 10 minutes away by foot.", "user": "jpmlim", "date": "April 23, 2010", "id": 62274387}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Their TVs were upgraded from the last time I stayed there, LCDs and more channels. You had plenty of food to choose from for breakfast.", "title": "Excellent location, great value for money.", "user": "JJ181", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60161179}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Overall, it was a good experience.", "title": "Quite well situated but in need of maintenance and renovation", "user": "franb51", "date": "March 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 59381241}, {"rating": 3.0, "stay_parameters": "Stayed March 2010", "text": "A very comfortable and well located hotel. Transport, attractions, food and shopping are all within walking distance, and the staff are friendly and helpful. Rooms are comfortable and well appointed, and it was good to have a separate bath and shower. Breakfast was well presented, with a good range catering to all tastes, though the icing sugar on the French toast was a little odd. Good coffee too. The pool was a tad small but clean and well maintained. Only major gripe would be the drink prices, but that's common in Singapore.", "title": "Mildewy", "user": "ShortChang", "date": "March 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 59286361}], "location": {"country": "Singapore", "continent": "Asia"}, "stars": 4, "variance": {"poor": 34, "average": 145, "very good": 359, "terrible": 25, "excellent": 301}, "aka": "Grand Park City Hall Hotel Singapore", "slim_ranking": 0.194444444444, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Grand Park City Hall is an architectural gem strategically located in Singapore’s Civic District and a short five minutes’ drive from the Central Business District. Whilst the harmonious integration of century-old conservation shophouses with modern architectural style has earned us the prestigious Architectural Heritage Award, our impeccable service, coupled with the recently refurbished rooms, meeting spaces, gourmet cuisine and Spa, have won the hearts of many who have stepped through the doors of our 333-room hotel."}