{"user_rating": 4.0, "review_count": 561, "name": "Grande Centre Point Hotel Terminal 21", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed at this hotel for 3 nights in June. It may not be a true 5-star hotel, but considering the very competitive room rate (comparable to Courtyard Marriott), I bumped this property of a 5-star rating.", "title": "Location can't be beat", "helpfulness": 1, "user": "AKLVancouver_Canada_", "date": "July 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133789940}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Location: you can't find any hotel with better location. It sits right above the brand-new Terminal 21 mall, which is connected to the Asok BTS station (and maybe 2 min walk to the MTR subway station). That means a lot of savings on money (and the hassle that comes with) using taxi. And I was told that you can even take this sky train and get to the airport via their new train service. We also visited the food court in the mall daily to satisfy our mango sticky rice craving. There's also a spa/massage place that is in the mall, with a direct access from the hotel elevator. On top of that, there are lots of good restaurants close-by (e.g. Je Ngor). And a Tops supermarket right next door.", "title": "Very nice residence and hotel complex", "helpfulness": 3, "user": "tsaltmarsh", "date": "July 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133588184}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Room: Not the biggest or most luxurious. It's more of a contemporary modern design. Love the Japanese style toilet, but we found it weird that they only provided one roll of toilet paper (no extra in the cabinet). We did not encounter any water temp. problem like some people did. But I did notice that it took a while for the water to get warm. Also, our room does not have a bathtub. If it bothers you, make sure you choose a room type that has it. However, it doesn't bother me. By the way, our room faced the pool and got an incredible view of the park.", "title": "Great location with excellent service and facilities", "helpfulness": 1, "user": "Kutoid", "date": "July 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133222927}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Restaurant: Only 1 outlet that is dedicated to the breakfast buffet. Items are quite heavily catered to Asian palate (reflected by the clientele as I believe 90% are Asian). Staff to guest ratio is very low, so don't expect a lot of service. I found myself getting my refill of tea as I don't want to wait for the waitress to appear. One big complaint I have is about one elder lady working the egg station. I asked for egg-white omelette for health reason, and when I asked for a second one because my Mom ate half of the first one, she gave me quite an attitude. First she acknowledged my order, after that I went back to check 3 times in 5-min intervals, it was still not ready. All three times, she saw me standing there and never asked me anything. Finally after the third time, I asked her if my egg-white omelette was ready, and she said she didn't know I ordered it. And then when she started making it, she was putting in the fillings without checking with me (and of course she put in the items I specifically asked not to put in for my first order). And the next day she was working there again. I asked her for an egg white omelette, and then she asked her co-worker to do it instead, even though she was not busy. Other than that, the food quality and quantity were up to par. However, I did notice that once after 8:30am, a queue started to form at the entrance of the restaurant. So be there early if you can to avoid long wait, especially for the weekend.", "title": "Extremely Overrated/Boring rooms", "helpfulness": 39, "user": "Tommy W", "date": "July 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 133144116}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Facility: the pool and gym are amazing. The pool is facing South/West, and got lots of sun exposure from the morning on. Bonus for the changing room facilities that include steam room and dry sauna, as well as a small jacuzzi. And the couple times I used it I was the only one there.", "title": "Excellent Location", "helpfulness": 4, "user": "mutkit", "date": "June 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132662401}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Booked this hotel for its convenience. It's a new hotel and it's spotlessly clean. Rooms are great and modern. However there are many \"hidden\" compartments which were not properly explained by the hotel staff who showed us the rooms, hence we couldnt find the tea spoons etc. We travelled in 4 and asked for rooms adjacent to one another and were given exactly like what we asked for. View was great from the room too! Also loved the free flow of drinks and different types of coffee in the lobby. Free wi fi available throughout the hotel although the network was a bit slow. Room service was not very consistent though. Our room got shower gel and shampoo replenished every day but the other room did not.", "title": "Nice stay", "user": "angry_bird01", "date": "May 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130549123}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Hotel is linked directly to the newly opened Terminal 21 shopping mall as well as the BTS and MRT stations with covered walkways which make it very convenient be it raining or scorching hot outside.", "title": "Location, Location, Location", "helpfulness": 5, "user": "pje39", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 130160415}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Stayed 2 nights in May. The location is perfect for accessing Bangkok. The hotel is joined to the BTS Asoke station and also the MRT Sukhumvit. The room we had a standard room was on the smallish size but was adequate for a couple of nights. The toilet is just amazing and is great fun! However the bed was actually quite hard for westerners. The infinity pool is really nice and you get a good view of the Bangkok skyline from it. The breakfast was excellent however it was very busy mostly with japanese and Korean visitors we were the only westerners at breakfast time.The staff were really welcoming and the hotel was spotlessly clean. One word of warning though is that the taxi and tuk tuk drivers didn't really know where the hotel was ( probably because it is so new) our advice is to get a location card from the concierge if you venture too far at night and need a taxi back. Soi Cowboy can be reached in 3 minutes walking and can be done in the rain without getting wet - just use the the subway for the Sukhumvit MRT. We would probably stay here again if in Bangkok.", "title": "Good rooms and convenient location", "helpfulness": 1, "user": "TheProbe", "date": "May 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130046689}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This is a new serviced apartment complex and hotel on top of Terminal 21 shopping mall next to Sukhumvit (MRT) and Asoke (BTS) stations. I had what I suppose is a standard room - a decent size with good size bathroom (separate bath and shower, high tech toilet). You also get a microwave oven and a washing machine (neither of which I used).", "title": "Quite acceptable", "helpfulness": 3, "user": "FrustratedTravelor", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129503232}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Breakfast is perfectly adequate, and there's a large swimming pool.", "title": "Excellent Accommodation - Superb Location", "helpfulness": 3, "user": "Peter W", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129173211}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Location is perfect right next to the skytrain and just a door to Terminal 21 shopping mall.", "title": "Superb location, bad service", "helpfulness": 3, "user": "Mantaray_74", "date": "June 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131884299}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Rooms are more apartment style but nice and clean. Pool and gym was nice.", "title": "You are wonderful", "helpfulness": 4, "user": "clchin96", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131862517}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Breakfast average. Service is really bad. The reception staff is really unfriendly and not service minded at all. It feels like they put kids in the reception without any experience at all.", "title": "No Service. Won't stay again", "helpfulness": 39, "user": "wmscec", "date": "June 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131607486}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Reached Suvarnabhumi Airport, took Airport Express to Phaya Thai (BTS Skytrain) station, then took Skytrain from Phaya Thai station to Asok BTS Station. Got off the train, walked down a flight of stairs, you can see Terminal 21 shopping complex on your right and this hotel is attached to Terminal 21 shopping complex as well as Asok (BTS Skytrain) station and Sukhumvit (Mertro) station. It is that easy to reach here from the airport.", "title": "above expectations", "helpfulness": 2, "user": "manvinderdawer", "date": "June 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131251513}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Wonderful is the word to describe this hotel. As you walked in, grand and well lighted lobby. While waiting to check in, you can help your self to hot and cold beverages at the lobby. My checking took me in less than 5 minutes. You can help yourself to the drinks anytime.", "title": "Shopper's Paradise", "user": "Elaine T", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131171024}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Just go to BKK for a short break, Overheard a new shopping arcade called Terminal 21 just new open for coupons of months. try to stay this hotel. hotel it's good, which closed to BTS / Asok a polite security guard at the flyover/ entrance of the hotel. hotel lobby is great and free coffee provide.", "title": "GOOD new hotel for relexxxxxxxx & Convenience", "helpfulness": 1, "user": "Emaxr228", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132154156}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "The room is lovely, i stayed on 11/F, which overlook the whole swimming pool (Invinity pool), room is great with a table and sofa like some restaurant. clean & clear, the elcetric curtain is Q and useful.One dispointed is bathtub not avilable. Swimming pool & Health Club is great. Breakfast ok la, if more western style or bread will be better. General is ok.", "title": "An awful hotel in Bangkok", "helpfulness": 1, "user": "Eric_Sun", "date": "June 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 132106481}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The other good things is shoping arcade next to hotel and also some night life around the station Nana, which you can walk from hotel, not need to take cab, make sure you are noit drunk.", "title": "Modern, Bright, and perfect location", "helpfulness": 2, "user": "LondonTLeaves", "date": "June 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132088166}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I had been went to the new night market by boat, it's convenience", "title": "Really great!!!", "helpfulness": 2, "user": "Kel P", "date": "June 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132082522}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "It;s a good place for releaxxxxxxxxx", "title": "Great location and nice room", "user": "TT_andaman", "date": "June 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132072038}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 20, "average": 68, "very good": 193, "terrible": 11, "excellent": 269}, "aka": "Grande Centre Point Sukhumvit-Terminal 21 Hotel", "slim_ranking": 0.152380952381, "description": "Extravagant ConvenienceGrande Centre Point Hotel Terminal 21 is the luxurious hotel in a convenient location that suits all types of lifestyle, either business travelers or tourists alike, In just a few steps out, you can enjoy shopping or browsing around for more attractions with the nearly BTS (Asok Skytrain Station) and MRT (Sukhumvit Subway Station)."}