{"user_rating": 4.0, "review_count": 619, "name": "Grand Mercure Beijing Central", "reviews": [{"rating": 5.0, "title": "Great value, friendly and conveniently located hotel", "text": "I booked the marco polo hotel using airline network and for £68 per room per night including breakfast it was by far the cheapest price. The hotel is 5 minutes walk from a Tube station and a shopping mall is also close by. Due to Beijing being so big and the sights so spread out we found being close to the tube extremely convenient and at appox 30p to use the tube a cheap option to get around. The reception is beautiful and all staff were very friendly and helpful even allowing us to leave our cases there for 2 days whilst travelling to Xian. On our first 2 nights stay we were upgraded to the continental suite which was on the 10th floor. The only real difference to standard rooms was a larger bathroom and shower cubical. The rooms were spacious with extremely confortable beds. You have a mini bar and free water along with all the usual free toiletries. The breakfast was lovely with a choice of fruit, breads, meats, cooked breakfast, cereals etc etc what you would expect from a 3-4 start hotel. My husband and I would certainly stay there again and would recommend it to our freinds and family.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5287518}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Got a great rate for the Corporate Floor from the Marco Polo's internet site. Included breakfast, laundry and pressing service, afternoon tea, evening drinks, chocolates on the pillow, etc. Room, bed, shower, internet access, all great. Check-in and check-out very efficient. Hotel staff very helpful in getting taxis and ensuring destination was understood by the driver. Hotel is situated between two subway lines - 3 minute walk to either stop. Second floor restaurant a little slow but reasonable prices. All in all, I highly recommend based on my experience.", "title": "Great stay for business travel", "helpfulness": 7, "user": "Sara10", "date": "May 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5204644}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Hotel is clean and quite well situated.No hotel meets all normal criteria for location in Beijing, and this one is fine for taxis to central sites, and for Summer Palaces. For Chaoyang (entertainment district= red light area in a very mild way) it's a bit of a hike. Room on 9th floor had queen bed and was a no-smoking room.", "title": "competent hotel", "helpfulness": 8, "user": "ethelman", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5188806}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Room cleaning was efficient- going to breakfast leaving the \"please make up\" sign meant it invariably was.", "title": "Complete Mediocrity", "helpfulness": 10, "user": "vanagon", "date": "May 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 5046026}, {"rating": 4.0, "title": "Recommendable 4 star hotel in downtown Beijing", "text": "accessible location. friendly staff. the hotel would have been best is wifi is available all throughout the hotel premises and not only on certain areas of the hotel.", "user": "Mckris", "date": "April 29, 2010", "id": 62747183}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Grand Mercure Hotel Xidan, Beijing (formerly the Marco Polo Beijing) is a 4 star hotel located in the Xidan district, about 15 minutes walk from the Forbidden City. There are several shopping malls located nearby, and a metro station is only 5 minutes walk away.", "title": "Conveniently located for Tiananmen Square and the Forbidden City", "helpfulness": 1, "user": "Toujours_plus_haut", "date": "April 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60703448}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I was travelling with my parents, and my sister with her husband and 7 months old baby. By pure luck, I managed to book very cheap rooms because of a 3 days super sale on their website, so we ended up paying around 350 rmb (abt US$50) per night including tax. This price is a real bargain, so it's worthwhile checking their website for future promotions. Despite booking such cheap rooms, the hotel offered my sister and her family a free upgrade to a slightly larger room, because they were travelling with the baby. We really appreciated this nice gesture.", "title": "Excellent Stay in the Grand Mercure", "user": "CouplefromCardiff", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60177525}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The hotel has a fitness area, and a business centre on the ground floor. I did not use the internet while I was there, but I noticed several people sitting with their laptops down in the lobby area. I don't know if the internet connection is free or whether you have to pay for it.", "title": "nice hotel, good location and food, friendly staff", "user": "Biff'ed", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 59395321}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "There are a couple of restaurants and a lobby bar at the hotel. The lobby bar is quite a lively place without being \"too much\", and they had musicians performing every night while we were there.", "title": "I checked the rate and decided to stay in this hotel in Beijing Again", "user": "StephenChan", "date": "March 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 58335595}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed at the hotel for 3 nights in September 2009. We found it to be quiet, modern, very comfortable and with great service and overall excellent value. Beijing is a large city so it is impossible to be perfectly located for all attractions, however we were able to walk to Tiananmen Square (about 30 minutes walk) and from there to the Forbidden City. The area felt very safe. Concierge can also get you a cab quickly and the cabs are very cheap.", "title": "Good hotel for business and leisure trips", "user": "Holiday_Hunter123", "date": "December 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 51665904}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "We visited the buffet restaurant one night and found the food to be good quality (particularly compared to subsequent buffets that we ate in China on this trip). The lobby bar was a relaxing place to come back to after a day's sightseeing. We were able to organise private tours easily through the business centre and these were good value too.", "title": "Good value for money in the center of Beijing", "user": "stefqatar", "date": "November 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 49171781}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "Rooms were compact (not too small though) and had good quality furnishings and were comfortable. Overall excellent value and would highly recommend.", "title": "A comfortable place to stay", "user": "cyberman09", "date": "November 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 49154039}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "This hotel 20 minutes walk of Tienanmen Sq and 5 mins to metro station.", "title": "Good location, nice staff, rooms were WARM", "user": "SchonWeiderReisen", "date": "November 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 48586297}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "100m to shopping mall with cafes and restaurants.", "title": "Close to many things..", "user": "Ryguy7", "date": "October 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 48207603}, {"rating": 4.0, "title": "This is very high international standard...", "text": "This is very high international standard hotel. Did not however appreciate the call at 8.30 am asking what time we would like our room to be cleaned! Otherwise is quite ok and good value for money.", "user": "Ozejim", "date": "July 2, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 69424332}, {"rating": 4.0, "title": "nice hotel close to the forbiden city \"close to\"nothing is !", "text": "nice hotel good staff understand english well, nice restaurant good menu but wat you read is not allways wat you get, but just think your in china and it will be fine ! beijing is BIG the bulding the road and if you look at the map and you think its \"close to\" think again, but the taxi are good and cheap so jump in it and enjoy.", "user": "A TripAdvisor user", "date": "June 21, 2010", "id": 68153090}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Pros:", "title": "Good choice for foreign travelers", "user": "junglyhh", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65885600}, {"rating": 4.0, "stay_parameters": "Stayed April 2010", "text": "1. It's located in the center of Beijing and you can ever walk to Tiananmen Square if you are tough!", "title": "free internet at the hotel lobby... excellent service!", "user": "Naty833", "date": "May 7, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 63537092}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "2. Rooms are clean, staffs are welcoming. There is no free in-room wifi, but you can always bring the laptop to the lobby and use wifi there.", "title": "This hotel has convenient location, comfortable room & great breakfast.", "user": "2Goers", "date": "May 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63251199}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Actually, I'm still staying at the hotel, and I agree with most of the reviews--this is a comfortable hotel with attentive and helpful staff. The breakfast buffet is generous and offerings vary daily (although weekend staff don't get you coffee very quickly and didn't offer any cream--but the weekday staff are superb), the Cantonese restaurant had great food at reasonable prices (although there was a loud--in fact literally--with an amplified microphone--party full of drunk men near to vomiting as they passed our table, which is weird in a restaurant where someone puts your napkin on your lap for you), and the rooms are comfy and well-appointed with fluffy towels and good pillows. Do note that the free wifi touted on the website applies only to the lobby and executive lounge--in the rooms there is only ethernet and for a cost. The hotel is bordering on luxury, as one reviewer remarked, but fails to reach that because it is visibly shabby and aging throughout--the carpet in our room and in the hallways is heavily stained, tiles on the floor near the restaurant are coming up or missing, the walls are scuffed, etc--basically one big updating of the surfaces would make a huge difference in one's sense of the quality of the hotel. I would happily stay here again despite these small problems, and I recommend the hotel itself wholeheartedly. It is a mere 5 minute walk to two subway lines and a 10 minute walk to another, between the two of which you can cover much of the city.", "title": "Great hotel--terrible tour desk.", "user": "BurgessMebane", "date": "January 29, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54720513}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "But avoid at all costs the \"tour desk\" in the lobby. We were quoted, in writing on a sheet on the desk, a price for a private tour of the Great Wall and Ming Tombs. The cost was on the steep side but we were strapped for time and decided it was worth the convenience. We were then told we must pay in cash, which we did--foolishly, I'm afraid, so that was our stupidity. The tour was perfectly fine--the tour guide was friendly and helpful, the driver a bit all over the road but not unusually so. However, on our return to the center of the city, the tour guide offered to make a special stop for us at the Olympic buildings--we thanked him but said no, we were tired. Then he got on the phone and we recognized the words for \"2 Americans\". Without being asked, we were suddenly pulled into an unplanned stop--at a \"historic teahouse/silk museum\" we had not requested at which we were treated to an aggressive (even by Beijing standards) sales pitch and insistence on purchasing silk goods on display. We left quickly (and politely) without purchasing and waited in the car for the tour guide, who did not follow us out but spent the next 20 minutes on his cell phone in the lobby. Things went from bad to worse when he finally rejoined us, offered another teahouse which we rejected, and then relented to take us back to the hotel. The sheet on the tour desk which was shown us for pricing that morning did/does not mention something we found out only at this point--that all the entrance fees to each site (two for one part of the Wall, one to go up, one to go down, and then for the tombs) were NOT included in the price we had paid in cash at the outset (and these totaled 1/3 again the price of the tour, so they weren't minor). We were then told in the car that we had to pay these fees to our guide, again in cash, immediately. We had just enough cash on us to cover this plus a small tip, luckily. We apologized profusely for the small tip but explained that we hadn't been told there would be further fees and hadn't brought much cash. The guide said it was okay by him, but the (non-English speaking) driver would be furious and we really needed to tip more, so he would be happy to take us to an ATM to get more money! This after we had asked the tour desk staffperson and she had informed us that tips were optional, and said if we were *especially* happy, to tip the amount we already had (10%). We of course did not consent to this. When we got to the hotel, the tour guide took us in to the tour desk staffer so we could \"tell her how he was as a guide\" (while he stood there); she told us that although the sheet she provided didn't mention added costs for our tour, that entry fees were only included in the cost of the *other* tours on the sheet--and that we had been an \"emergency\" tour because we had come in after 8am (although she never mentioned either of these things when demanding our cash earlier, and neither is mentioned in any way on the information sheet). By this point between disingenuous apologies both were beginning to create contradictory excuses and we were too exhausted to fight with logic. We're taking it as our own stupidity for not having insisted more on what was presented in writing and on challenging the \"cash only\" requirement while sitting in a well-stocked business office in a big hotel, but we thought we should warn others. I've had tour guides (in larger bus tours) who were clearly on the \"take\" before, but nothing like this in terms of direct pressure and embarrassment--and both the guide and staffer told us that their company was unaffiliated with the hotel so there was no recourse that way (this was one of their excuses for the added costs)--apparently the tour company just rents the space in the lobby (although the hotel lists this as one of their services). Caveat emptor.", "title": "Great place to stay for good money", "helpfulness": 1, "user": "RutgerD", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53834544}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "Hotel is great! rooms are comfy, breakfast is great, service from bellboy even better. Check in and check out within five minutes! I arrived at 23:00 due to airchina, gave hotel one call and room was already arranged when i arrived. Swimming pool also very nice! 40 degree jacuzzi was to hot for me. Together great stay for 480rmb a night incl breakfast. Only bad thing, internet 80rmb a day is too expensive. It is not that fast", "title": "Excellent value and service", "user": "LinRathe", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 53671616}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I booked this hotel three months in advance through hotel.com and got a wonderful deal. The room is impeccable, comfortable, bordering luxurious : ) and the service is phenomenal: I borrowed their wrapping tape right off the concierge desk; asked for an adaptor and a sewing kit in all different occasions and their response rate, friendliness and efficiency are phenomenal! Unfortunately I didn't get a chance to use the gym and the pool, but was extremely impressed by the facilities (including spa-like shower area and sauna) when I checked it out. HIGHLY recommend it!", "title": "Nice business hotel in the center of Beijing", "user": "junglyhh", "date": "December 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 51939233}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "pros: This hotel is well located in the center of Beijing, walking distance to Tiananmen Square. It has a nice swimming pool (although small), a fitness center and free wifi in the main lobby. Breakfast is great if you'd like to taste Asian food.", "title": "Excellent all-round; highly recommended", "user": "LanPing", "date": "December 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51820153}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "When you step into the lobby it looks acceptable but it stops there.", "title": "look elsewhere", "helpfulness": 7, "user": "utravel", "date": "October 26, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6013764, "likes": {"liked": "— The Lobby", "disliked": "— The entire experience"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The rooms are dated and very worn, the towels were ragged and torn. The sheets and beds were scary. Dirty carpet.", "title": "Hotel was average", "helpfulness": 7, "user": "********************", "date": "September 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 5811815, "likes": {"liked": "— Breakfast and friendly staff", "disliked": "— Room Airconditioning and Location"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "The location is in the middle of nowhere, i know that beijing is not central but dear god atleast a little restaurant or bar nearby would be cool. All the previous posts on the concierge are correct - they are of no help.", "title": "A nice place overalll", "helpfulness": 6, "user": "Aussie_traveller", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5726254}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "As a bonus - they checked another guest into my room at 630AM in the morning by mistake, a nice Japanese gentleman barged into my room key in hand - needless to say it was the cherry on the sunday.", "title": "So so", "helpfulness": 6, "user": "cybertraveller696", "date": "August 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 5561111}, {"rating": 3.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "I guess the only positive is that it forced me to stay away from the hotel - so i got to experience a good deal of the city.", "title": "Not a 4 star hotel", "helpfulness": 7, "user": "aknight", "date": "July 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5503790, "likes": {"liked": "— Location was close to Tien An Men square/Forbidden City", "disliked": "— Dark unattractive rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The good:", "title": "Rate it 7 out of 10", "helpfulness": 26, "user": "AlexGosu", "date": "October 13, 2005", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4019039}, {"rating": 5.0, "title": "Marco Polo? Marco Polo!", "text": "1) Spacious rooms, nice linen, and the concierge will be quite keen to upgrade you if you are not happy with your room. All you need to do is politely complain, and they will come to your aid. We got a room facing an enormous construction site, and since they work 24/7 in Beijing, we decided to complain. We got a fancy suite facing the main street, which was quiet; the bathrooms are quite large with both a shower and a bath-tub (bath tub not reccomended though - black spots spitting out of the faucet and yellow water put us off a bit)", "helpfulness": 23, "user": "A TripAdvisor user", "date": "October 12, 2005", "id": 4017623}, {"rating": 5.0, "title": "New hotel in Beijing", "text": "2) People are bangig on about location in some of the reviews. I seriously don't understand the complaint. Mind you, Beijing is an enormous city, and ridicolously crowded, which in itself makes it a hard place for pedestrians; furthermore, taxi's are affluent and so cheap that it is hard to believe. We never paid more than about 2 USD almost anywhere we went, so in my world, it doesn't really matter where you are in this city, as long as you are somewhere inside the city, and not out by the airport or near a cest pit somewhere. Taxi is your key, and the easiest way to get around. Bring a map to show to cab drivers with names in Chinese - it will make everything a lot easier.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "October 10, 2005", "id": 4005576}, {"rating": 4.0, "title": "Lovely Boutique Hotel in the Middle of Smog City", "text": "3) Staff was helpful, albeit language is an issue - but that was expected, so it didn't really matter.", "helpfulness": 15, "user": "travellingincognito", "date": "October 6, 2005", "id": 3996708}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 42, "average": 114, "very good": 293, "terrible": 21, "excellent": 149}, "aka": "Grand Mercure Beijing Central Hotel", "slim_ranking": 0.0421354060135, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Grand Mercure Xidan Beijing is located in the commercial and retail heart of Beijing, walking distance from Tiananmen Square and only 45 min from the airport. The hotel offers 290 rooms featuring city views, as well as a cafe restaurant, lobby lounge, fitness centre and swimming pool. With exceptional service and facilities, the hotel is perfect for that special weekend holiday as well as an ideal conference venue for business travellers."}