{"user_rating": 4.5, "review_count": 530, "name": "Grand Hotel Europe by Orient-Express", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "This was one of the best hotels that I have stayed in, the food in the Italian Restaurant was excellent. My room was a good size and very comfortable.", "title": "Most Beautiful Hotel", "user": "sunshineParma", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133899387}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Just walking around the ground floor is an experience, the architecture is wonderful.", "title": "A Grand hotel", "user": "Oriental88traveller", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133750412}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Service was slow at times in the mezzanine restaurant at lunch times, but just relaxing there was worth waiting for.", "title": "Excellent Ambience", "user": "opanky", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133345340}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Breakfast choice was vast, and it was nice to have a girl playing the piano in the background.", "title": "5 star service in ho-hum hotel that's seen better days", "user": "jason a", "date": "June 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 132965005}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The wi-fi was spot on all over the hotel.", "title": "Worst hotel experiencie in Russia", "helpfulness": 5, "user": "Ferdinand L", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 132930931}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This was one of the finest hotels at which we have ever stayed. The staff was extremely knowledgeable and helpful. The accomadations lovely. The location superb, just off NevskyProspekt, right by the Russian Museum (Mikalovsky Palace) and the Kazan Church. Just a stones throw from the Church of Spilt Blood. The interior was gorgeous. The breakfast buffet was sumptuous with table after table of choices, all in a beautiful setting and a pianist performing in the background. (It is important to have breakfast included in the reservation. Otherwise $60 per person, Expensive but understandable.) We have stayed at many fine hotels throughout Europe and the US and this ranks up there with the best.", "title": "Grand Hotel Europe St Petersburg", "helpfulness": 1, "user": "flyfishr", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131844396}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We spent 4 days at the Europe and thoroughly enjoyed it. The restaurant (with the exception of a disappointing experience in the Italian coffee shop) were excellent and the breakfast buffet was quite incredible! The only two negative remarks I would make: Our air conditioning did not work, and although a technician tried to fix it, it never worked for the entire stay and the decoration would deserve a refurbishment.", "title": "Great location, excellent restaurants and outstanding, but costly concierge services!", "helpfulness": 1, "user": "swisscheck", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131499584}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed at this hotel on a business trip in February 2012 for 4 nights.", "title": "Short business trip", "user": "Poel", "date": "June 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 131386949}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Don't really have anything bad to say about this hotel. The only thing I can think off is that the bed wasn't the most comfortable and the pillows were too fluffy for me ;-)", "title": "The lack of assistance in unacceptable for this type of hotel", "helpfulness": 1, "user": "Fixou483", "date": "June 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 131258298}, {"rating": 5.0, "title": "Excellent", "text": "Staff was very friendly, food was excellent and plenty off it.", "user": "OneAdvisedTraveller", "date": "June 3, 2012", "id": 131179099}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband and I were lucky enough to stay here for four nights. Our Junior Suite was huge, incredibly well fitted out, light and spacious. A big bonus was free fast wifi that worked whereever you were in the hotel. The breakfast buffet is one of the best I have experienced. The concierges were spot on with their advice and could answer all our questions quickly and efficiently. St Petersburg is a grand city with incredible history, it is only fitting that we stayed at one of its grandest and most historic hotels. It really made our stay! Tours and transfers arranged through the hotel are expensive, but they are just as happy to book a normal taxi for you as well.", "title": "Loved Grand Hotel Europe and St Petersburg", "user": "jmlparis", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135120826}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I was fortunate enough to stay at the Grand Hotel Europe in St Petersburg when I participated in a Fair held there and it was a delightful hotel. The staff were friendly, helpful and willing, unlike many other Russian hotels, so well done on the great customer service! The hotel is clean, and classy, and modernised. The breakfast buffet was great, too. The Grand Hotel SPb even has a beautiful scent to it, and smells fantastic. They even have DVDs you can watch in your room, if you so wish. It is in a good location, near to many nice restaurants and attractions, too. I would stay there again, if I can get the group rate, otherwise, if you are on a budget, you should look and stay elsewhere as it is expensive!", "title": "One of the best hotels in the world!", "user": "Denise P", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134556212}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Wow! What a glorious hotel. From the fabulous and historic rooms and suites to the best breakfast ever (including blinis with salmon roe!) and outstanding restaurants and ballrooms (especially try The Caviar Bar which includes other options than caviar). The bar is super-sultry - try the St Petersburg Sling. The service is excellent with special chocolates or biscuits delivered in the afternoons. The rooms are spacious and very comfortable including wonderful bathrooms. The gym is reasonable and there is a spa. My massage was average. The mezzanine restaurant was rather slow for lunchtime but apart from that it was perfect and, of course, the location is outstanding.", "title": "Wonderful hotel, great position, food and service", "user": "Tania d", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134525572}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Recently stayed a night at this beautiful hotel in St. Petersburg. We stayed in a Belle Chambre Junior Suite and if you like to have lots of space, this is the room to have. Beautifully furnished with elegant decor and a comfy bed. The bathrooms are large and elegant as well.", "title": "5 star all the way", "user": "docjennings", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134436682}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "We only got to stay at the hotel one night, but were very impressed with the service, the lobby bar (quite the scene actually) and THE ABSOLUTE BEST breakfast buffet EVER!! I could not believe the elegant, large room, with everything you could possibly imagine! Not to mention the classical pianist, and the waiter with his ballet slippers on prancing within the tables as a waiter. Caviar, crepes, omelets....they had it all. Seriously - if you want to have a ridiculous brunch even if you are not staying at the hotel - check it out.", "title": "Spectacular experience", "user": "louisec11", "date": "July 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134367579}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Europe show s , how russian culture in Hotel and Restaurant perform in a traditionally, conservative , but full service feeling way. The coffeeshop placed in the charming atmosphere of covered atrium creates the nevsky cafe feeling even during wintertimes , when the outside is cold and louzy. Rooms are traditional but charming depending where selected. Team is friendly and serviceminded. Prizes typical for russia..", "title": "The Grand in SPB", "user": "Peter_0n_Trip24", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132841415}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Tasty breakfast. There is no aggressive noise (the hotel is in the center of the town). Best service!", "title": "Very good!!", "user": "margoshyk", "date": "June 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132689587}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Sure this hotel is expensive, but at the end the quality is so high that you exit from there thinking: \"I've spent but I've passed the best moments in an exclusive place\".", "title": "Fantastic", "helpfulness": 1, "user": "mc525ix", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132578901}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Really exclusive, for the location, for the building, for the service, for the cure in every detail, the courtesy, everything ...", "title": "Exceptional", "user": "chicabianca", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132553185}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "A wonderful experience.right in the heart of a lovely city. Everything you expect of a 5 star hotel.very clean,beautifully decorated, rich breakfast...and more. My husband had his birthday during our stay,they noticed it on his passport and surprised us with champagne and chocolates.the only things that bothered me were the bathroom amenities( one set for 2 people,we had to share) and the cleaning lady that collected my used shower cup and put it back on the box instead of replacing it.also,i do not appreciate my coffee being served in a tray with leftovers and dirty plates from the neighbouring table.staff does need better training but really minor details,overall,go for it.", "title": "Good, but lets itself down", "user": "Nigelreynolds", "date": "June 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 132079816}], "location": {"country": "Russia", "region": "Northwestern District", "continent": "Europe"}, "stars": 5, "variance": {"poor": 9, "average": 40, "very good": 98, "terrible": 12, "excellent": 371}, "aka": "Grand Hotel St Petersburg", "slim_ranking": 0.0200803212851, "description": "Grand Hotel Europe enjoys an exceptional location in the heart of historic St Petersburg on Nevsky Prospect. The embodiment of grand Russian style, it is the ultimate in luxury and timeless glamour.Since 1875, the hotel has preserved its unique heritage with acommitment to the highest standards of comfort, cuisine and intuitive service. It remains a favourite of those who appreciate the finer things in life.Offering 275 breathtaking rooms and suites inspired by imperial Russia, Grand Hotel Europe has long enjoyed a reputation as one of the world's most iconic hotels. Many of its rooms are known for their unique character, featuring antique furniture and exceptionally comfortable beds and furnishings, alongside state of the art technology.Indulge in one of our superb suites: all come with a personal butler, ready to take care of your every wish and ensure the perfect stay.Grand Hotel Europe embraces a unique collection of St Petersburg's most fashionable dining experiences. These include the Caviar Bar and Restaurant, the only venue in the city to offer caviar alongside a selection of over 50 of the world's finest vodkas. Leading ballet stars perform at L'Europe, Russia's oldest and most historic restaurant. With five bars and restaurants to choose from, you are certain to find your perfect place to relax, dine in style or celebrate with friends and family."}