{"user_rating": 4.0, "review_count": 1840, "name": "Grand Hyatt San Francisco", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "I had read the reviews before my stay and I was expecting the worse ...... But it was fantastic!!!!!", "title": "Amazing views", "helpfulness": 1, "user": "jooleye", "date": "June 16, 2007", "detail_rating": {"cleanliness": 5.0, "service": 5.0, "location": 5.0, "business": 4.0, "rooms": 4.0}, "id": 7857958, "likes": {"liked": "— club facilities", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We upgraded to use the club facilities on the 32 floor and this proved to be a really good a short stroll from our room with a casual but hearty breakfast buffet with amazing views over the city and Bay. Also good for tasty nibbles early evening ahead of a big night out.", "title": "Good location", "user": "obdocSanJose", "date": "June 13, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 4.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 7842771, "likes": {"liked": "— location", "disliked": "— dirty bathtub with hairs from prior occupant"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "I will definately stay there again.", "title": "Great experience", "helpfulness": 1, "user": "GreatTravel", "date": "June 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7802879, "likes": {"liked": "— The excellent concierge service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I stayed at this hotel June 7-10 for a conference. The location is great, a block to Union Square, approx. 7 blocks to the Metreon and Moscone convention center. The conference facilities were fine. There is a Starbucks across the street, a drug store a block away, and two private garages within 2 blocks of the hotel. Hotel parking is available too at $50/night. The room was not as nice as I had expected. The good part was it was quiet and the bed was very comfortable. The bad part was after check in (exhausted and wanting a hot shower) I discovered hairs in the tub. The was also mildew on the soap holder. One phone call did not correct the problem promptly. A second phone call to the operator did bring a housekeeper to my room within 10 minutes to repeat the cleaning of the bathtub. The towels provided were nothing special. The bathroom was clearly in need of renovation but the water pressure was decent. Another good thing about the hotel is the exercise room - top of the line equipment, in good quantity and complimentary access. Another poor point for the hotel was the SLOW elevators. I don't know if some elevators were not working, if the hotel was full to capacity, just older and slower elevators - every time I had to wait more than usual for an elevator to arrive. I didn't eat at any of the hotel restaurants so I can't comment on them. Overall a decent stay and great location. Just be on the lookout for dirty tubs!", "title": "Can't be any happier .. LOVED It!", "helpfulness": 3, "user": "emiems124", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7710623, "likes": {"liked": "— location"}}, {"rating": 4.0, "title": "Great view...if you're lucky enough to get one", "text": "Stayed for a long weekend and was pleasantly surprised. Rooms were clean and beds are the most comfortable I have ever slept in. The best part of this hotel is the concierge service. They give perfect directions to every tourist attraction and are very professional. Loved that they recommended a chartered shuttle back to the airport at a discounted rate. This is the perfect location - close to every mode of transportation, coffe shops, quaint bar a block away, awesome shopping all around. Tip: Buy the 3 day muni pass which is good for any muni bus, train or trolley. It will save you tons of money. Don't waste time on a cab.", "helpfulness": 1, "user": "TxAggieGirl", "date": "April 16, 2007", "id": 7374431}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "First, our room was not ready when we arrived there at 4:30pm. We were told it would be ready soon, so we went to our kids' room and waited for an hour. Came back--still not ready. We were told, again, it would be ready soon, so we went out to our dinner, came back and--still not ready! Turns out the previous guest had not checked out yet! Well, they finally kick that person out, so we finally did get into our room. The gave us half-price on that room for the 3 days, but things got off to a shaky start.", "title": "Typical HUGE Hotel--good services, but no charm", "user": "joeinva", "date": "August 11, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 1.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 8395732}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This is a BIG hotel, with lots of people working there, and staying there. I didn't like it--very impersonal--but what they do, I guess they do well. The concierges were helpful, and they basically tried to do a good job.", "title": "Great Hotel - Great Location", "helpfulness": 3, "user": "12112012s", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8372490, "likes": {"liked": "— Location", "disliked": "— Parking Charge"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Another day during our stay our room was not cleaned until--again--after we got back from dinner!", "title": "Great hotel!", "helpfulness": 2, "user": "peenali", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8252873, "likes": {"liked": "— rooms", "disliked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "It is a good location for SF sightseeing, and there are plenty of dinner and other places nearby.", "title": "Very nice hotel, but DO NOT drive there!", "helpfulness": 2, "user": "doctorfloyd", "date": "July 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8225031, "likes": {"liked": "— Location", "disliked": "— Price for parking"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My wife and I spent four nights at this hotel at the start of a West Coast tour. We were not disappointed. We have reserved a Regency Room. These are located between 31st and 36th floors and permit access to the Regency Club lounge. That was great as complimentary breakfast was available every morning and soft drinks throughout the day. The views from there were spectacular.", "title": "Great City Centre Hotel", "helpfulness": 1, "user": "leesville", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8203283, "likes": {"liked": "— The lounge with fab views and the great personal service throughout the hotel.", "disliked": "— The beige tiling in the bathroom."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Have stayed a lot of places in San Francisco, and finally found a keeper.", "title": "The staff really made the Grand Hyatt Grand", "helpfulness": 4, "user": "Liontamer", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10694188, "likes": {"liked": "— The amazingly friendly and helpful staff, plus lots of elevators -- no waiting!", "disliked": "— You could hear a club across the street closing at 2am Monday morning"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Staff upon check-in was great - was using the kiosk, and the guy at the front desk said \"let me check that it gave you a good room\". My room was quiet, and an okay size for SF. The gym was smallish but VERY well-equipped, and no fee (unlike the Westin St. Francis). The concierge was very helpful, and her recs were similar to those on Chowhound (so she wasn't just sending me to the places that paid her best). The location is perfect for where I go to work, and would be wonderful for a tourist as well (close to Union Square and to some amazing restaurants). No time to wait for the shared-ride van, so the", "title": "Not Good - Stay Away", "helpfulness": 5, "user": "The_Big_Bad", "date": "October 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 2.0, "rooms": 1.0, "location": 2.0}, "id": 10350750}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "doorman immediately got me a limo to the airport for the price of a cab ride.($45 flat)", "title": "An excellent experience", "helpfulness": 9, "user": "gasman", "date": "October 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10159624, "likes": {"liked": "— The views, staff and comfortable room", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Mark Hopkins had nicer bathrooms, but it was noisier & pricier, and the St. Francis nickels & dimes you plus their check-in line is appalling. Next trip to SF: Grand Hyatt", "title": "Satisfied for priceline price", "helpfulness": 1, "user": "miaminemo", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 10063392}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I've stay here three times in the last month. Two out of the three times upon check-in I was informed that they were \"overbooked\" and asked whether I wanted a double bed room, a room with a pull-out bed, or a smoking king room. The double bed room has no work desk, and this past time I was stuck in a smoking king room. That's right, people still smoke. And I could tell. Horrible experience. Oh, and by the way, the furnishings are dated. Looked nice in 1990, I'm sure. But not today when flat screens and such are commonplace at competing hotels.", "title": "Great Location", "helpfulness": 3, "user": "sb_tor", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10036541}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The Grand Hyatt exceeded my expectations! We checked in early during a busy summer week without waiting in line. Staff was courteous and attentive. Place is clean and well maintained. Maid service was a little quircky. Views range from nice to outstanding. It's in a perfect central location that allowed us to stop in for breaks and unload purchases during our busy days. My teenagers loved the place. And there were no surcharges on my final bill!", "title": "High Quality, Central Location", "helpfulness": 1, "user": "vjwalsh", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8116868, "likes": {"liked": "— Central location near all transportation", "disliked": "— cost"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I stayed at the Grand Hyatt San Francisco for two nights over a weekend. This hotel should be better than it is. It's got many of the pieces of what could be a great property, but it's still missing a couple of vital ones.", "title": "Not the worst, not the best either.", "helpfulness": 1, "user": "paubri", "date": "July 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8097725, "likes": {"liked": "— Location!", "disliked": "— Poor service, cleanliness issues."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The check-in process was brusque but efficient. I was offered an upgrade for an additional charge, declined, and went to my 12th floor room. The room was nicely appointed with a well-lit desk and a good work area. My room had a decent view of San Francisco, and noise was not a factor. The bed was comfortable and there were plenty of pillows.", "title": "Pleasant Stay in S.F.", "helpfulness": 1, "user": "ReadHere", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8083845, "likes": {"liked": "— Safe and very convenient location", "disliked": "— Breakfast waiting times"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Furnishings in the room appeared to be relatively new, though there were holes in one of the sheets on my bed. Upon taking a shower the next morning I also found hair from the previous occupant(s) of the room. There was more than one hair in the bathtub, along with hair stuck to the back of the door. More unnerving than the lapse in cleanliness was the poor service that went along with it. My first call involved a front desk clerk who rushed to get me off the line rather than solve my problem. I was transferred to housekeeping, who promptly hung up on me after I asked to have extra attention paid to my room when next cleaned. When I called the front desk back and asked to speak to a manager I was told that there wasn't one on duty and that the clerk was not sure when there would be. Eventually housekeeping took care of the problem and I received a call from a member of housekeeping management apologizing for the problem (and offering a room change - which I declined). This was only after multiple calls on my part to resolve an issue which should have been dealt with in just one call.", "title": "Disappointed", "helpfulness": 1, "user": "annekr", "date": "July 7, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 2.0}, "id": 8073087}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I've stayed in other 4-star properties in the area that offered much better consistency of cleanliness and service. In the future I would probably choose one of those as my first option. If I knew that the service and cleanliness at the Hyatt had risen to the level of those properties, however, I'd be willing to give it another shot.", "title": "Nice Hotel, Great Location", "helpfulness": 2, "user": "onoman", "date": "July 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8068250, "likes": {"liked": "— Location", "disliked": "— Rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Our stay at the Hyatt got off on the wrong foot when check-in told us that they could not put a roll away bed in our room even though this was part of the reservation. The excuse was that this was the national web site and it did not know that the rooms in the SF Hyatt are small and there is not space for a roll away bed. Pretty lame for an organization as sophisticated as the Hyatt, and really amounts to bait and switch. They did offer us a second room at a discount but this was more than the original reservation plus the surcharge for a roll away. The nickel and diming continued. Parking was $55 plus tax and tip. The internet connection was $9.95 per computer. My wife and I both travel with our own laptops. Although we decided to share one connection, it meant that one of us did not have our files and environment when answering email. There is also a surcharge for the exercise room.", "title": "Great locatoin but noisy and in need of work", "helpfulness": 5, "user": "a2djs", "date": "September 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8737807, "likes": {"liked": "— Location", "disliked": "— Bait and switch on reservations and all the extra fees"}}, {"rating": 4.0, "title": "Ideal location", "text": "Our room was on the 32nd floor overlooking Union Square. The night we stayed, a construction crew was installing an awning for an exhibit, and we heard beams clanking and truck backup warnings all night.", "helpfulness": 6, "user": "Kentishwanderer", "date": "September 13, 2007", "id": 8705651}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Hotel also needs a renovation. The bathroom \"featured\" a 5\" CRT television which when it was installed must have been the height of tech, but now looks more like a museum piece.", "title": "Nice hotel, nice location", "helpfulness": 2, "user": "CSwan", "date": "September 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8676973, "likes": {"liked": "— location", "disliked": "— thin walls"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "On the positive side, the location is great and the 32nd floor Regency Club offered a good continental breakfast and the staff was cheerful and helpful.", "title": "Great Stay...", "helpfulness": 1, "user": "arb59181", "date": "September 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8659163, "likes": {"liked": "— bed, view, size of room, clean room", "disliked": "— walls a little bit thing - but wasn't a huge issue."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "For first time visitors this was a perfect location, walking distance from many attractions and close to public transport links, including cable cars if you don't mind the long queue.", "title": "Convenient place to stay", "helpfulness": 1, "user": "Cambria2002", "date": "September 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8602148}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We had a AAA package that included breakfast. Breakfast was very good and their dining area on the 36th floor has wonderful views. We were on the Regency Club level and had access to the lounge. It was nice - again, great views. It was also nice to be able to go in there and get bottled water (no charge) during the day and evening.", "title": "Expected more from a SF Hyatt", "helpfulness": 3, "user": "coolchik808", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8589226, "likes": {"liked": "— Staff", "disliked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "It was not an \"amazing\" hotel experience, but it was nice and worked just fine for our vacation. It definitely was not a negative hotel experience. We wanted to stay in a good hotel in the downtown area at a \"reasonable\" price and I think we did that. I would stay here again.", "title": "Great Location and Staff", "user": "Kaileygirl", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8537366, "likes": {"liked": "— Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "After recovering from knowing that valet parking will cost us $50 a day (you need valet if you want your car back to cruise around town, $30 across the street but no in/out priveleges), we were welcomed by a very friendly staff and helped by a friendly bell boy to our room. We have a room with 2 beds, very tight! The view overlooking Union Square was spectacular. I hate to admit, but after being in the room for an hour, I started to notice things that I would not expect for the price that we paid for. AC was not functioning properly. Chair upholstery very poor and bathroom tiles grungy (minor maintenance needed and probably affordable by a Hyatt), closet doors were pretty banged up, no microwaves, no refrigerators and the worst, couldn't get any sleep at night due to construction (jackhammering) until 11 at night. We wanted to check out the following day, only to find out that they will charge us for the day and $50 penalty charge for checking out early.", "title": "Reservations are merely \"preferences\"", "helpfulness": 1, "user": "Clay_Oahu", "date": "August 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 8518782, "likes": {"liked": "— Good location, rooms are well-appointed", "disliked": "— Botched my reservation"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "It's the Grand Hyatt! We've stayed at cheaper places and had better quality of rooms. Staff was excellent though, from the very second you get there.", "title": "Great, centrally located hotel.", "helpfulness": 1, "user": "HAFSTBS", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8511116, "likes": {"liked": "— Location and proximity to Union Square shopping", "disliked": "— prices for food"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I LOVE Hotwire! Grand Hyatt was not only a great deal, it was everything that it claimed to be in terms of being a customer favorite and having a wonderful location. Sometimes I have experienced a feeling of being put in a less than wonderful room (paranoia perhaps?) for my Hotwire purchase, but not here. Valet was expensive at $45, but was timely and nice to have. The room was nice and luxurious for the money.", "title": "Great deal through hotwire!", "user": "janeyinphx", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7330636, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "I just returned from a long weekend for Easter in San Fran. While I had a fantastic time touring this amazing city, the hotel experience was AWFUL. First, I'm not one of those picky travelers who complains about anything and everything. I travel frequently, US, Europe, Africa, Carribbean but I've NEVER had this bad of an experience and rarely ever felt the need to get online to write a bad review. But this, I had to let people know.", "title": "Terrible - Don't ruin your San Francisco stay!", "helpfulness": 9, "user": "Liliye", "date": "April 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 7311705, "likes": {"liked": "— Location", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "First, just as the reviewer below me said - I also arrived late, and the hotel was dead. I had to wait a few minutes to see one front desk person show up finally. No bell person, nothing. So I figured ok, it's late, doesnt matter. She gave me my room info and I head up, with no offer of assistance or anything. As a single traveler, it definitely was the least welcoming hotel I've been to. I head up, and get into the room, it was just very plain and very dated. A little depressing frankly, but I figured I wouldn't stay in my room all day anyway. I decided to lock the door but in doing so, first I tried to open it and it wouldn't open at all!! I was locked in from the inside!!! I couldn't believe it. I tried and tried, nothing. So I called the desk, they sent a bell guy up and I had to SLIDE the card through the door for him to open door!!", "title": "Excellent", "helpfulness": 1, "user": "lscaldwell", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7308232}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I'll make it short, because it really was incredulous. So they gave me another room: Change 1.", "title": "Great stay at Grand Hyatt", "helpfulness": 2, "user": "kimberindiana", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7302826, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The next days, I changed rooms THREE times. The shower wasn't working properly in the room I was moved in: the water was lukewarm atbest. The engineer couldn't fix it, so they sent me to another room. Change 2. I couldn't believe it. When I got to that room, I started taking a shower : and to my shock, same issue!!!! only this time, it was COLD - no hot water at all. The front desk guy apologized and said He guessed the engineer didn't check before moving me. I'm thinking, it's YOUR job to check, not his!!! So the guy says he has a great room with a better view of Union Square for me, and that the next morning, I should go up and get complimentary breakfast and ask for the manager, because he (the front desk guy) arranged for it personally. I just couldn't believe that all they offered me was lame breakfast!!!! for making me move three times in 2 days!!!!", "title": "Not Bad, Not Good !", "helpfulness": 5, "user": "Nick R", "date": "March 22, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 7202285, "likes": {"liked": "— Gret Bed !!", "disliked": "— Dated Rooms Especially Bathroom !!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Stayed at the Hyatt on Union Square for my girlfriend birthday party and had a great time. The hotel staff was very helpful and friendly. One of the reasons I selected this hotel is it's location....close to everything. The Powell Street cable car that takes you to Fisherman's Wharf is just a block away. Chinatown is just a few blocks away and you are right in the middle of great Union Square shopping. Have stayed here before at Christmas time to do some shopping and enjoyed that experience also.", "title": "Great time at the Grand Hyatt", "helpfulness": 2, "user": "Csora2547", "date": "August 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8500723, "likes": {"liked": "— location", "disliked": "— parking fees"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I was able to book the rooms and get breakfast included, so be sure and check to see if they are still running that special. The breakfast is on the top floor and has a fantastic view of the city. They served eggs, potatoes, bacon, fresh fruit, pastries etc. a good way to start the day. At the end of the day we had drinks in the top floor bar and enjoyed this also.", "title": "Good Beds and Great Views", "helpfulness": 1, "user": "jordydog1", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8496747, "likes": {"liked": "— Nice Room", "disliked": "— The weird sound we heard in our bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The room itself was fine. Comfortable beds, desks and big windows that give you a wonderful view of the San Francisco skyline.", "title": "Great Hotel!", "helpfulness": 1, "user": "TheGlobetraveler", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8489750, "likes": {"liked": "— View, Location, Comfort.", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "The only thing I didn't like was the parking fees.....$45 a night to park a car! I heard there is a public lot near by that charges $30 so you might want to check that out.", "title": "Weekend in San Francisco, US - Grand Hyatt San Francisco", "helpfulness": 3, "user": "Aksel", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8484053, "likes": {"liked": "— location", "disliked": "— Old bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The concierges were very helpful in assisting me plan my birthday party. They suggested restaurants and activities to make the event extra special.", "title": "OK Hotel; High Price", "user": "Millsmom", "date": "August 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8399499, "likes": {"liked": "— location", "disliked": "— Price and location"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My SO and I decided to stay here for Christmas Eve and Christmas just to relax and have a mini getaway from our apartment in the south bay.", "title": "Lovely Stay at Grand Hyatt", "helpfulness": 1, "user": "epiphaneia", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11987627, "likes": {"liked": "— The location and views of SF.", "disliked": "— The room was very average."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We booked through the hyatt website with a AAA discout that included full breakfast for two in the Grandviews restaurant/bar.", "title": "Over rated, Terrible, terrible service", "helpfulness": 1, "user": "Roamer18", "date": "December 26, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 1.0, "cleanliness": 1.0, "rooms": 1.0, "location": 4.0}, "id": 11967616, "likes": {"liked": "— Nothing!", "disliked": "— Hated it!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Grandviews is aptly named, located on the 36th floor of the hotel, it has an amazing and beautiful view of the bay and the city.", "title": "Right place for theatre and shopping", "helpfulness": 1, "user": "segraves", "date": "December 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11699053}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Grandviews is worth visiting even if you aren't staying at the hotel.", "title": "Grand Views!", "helpfulness": 1, "user": "blondeegal", "date": "December 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11561443, "likes": {"liked": "— View", "disliked": "— Paying for Wireless Internet Service"}}, {"rating": 3.0, "title": "Average hotel, NO customer service", "text": "Our room was on the 17th floor and had a decent view of the bay through the tall buildings. The bed was very comfortable, with a down comforter and plenty of down pillows.", "helpfulness": 6, "user": "TravelPlanner8", "date": "November 20, 2007", "id": 10938584}, {"rating": 5.0, "title": "Clean &Comfy", "text": "Perfect location on the northeastern side of Union Square, very safe, convenient to everything, near all the best shopping and close to Chinatown Gate. Everyone who worked there was most pleasant, friendly, and helpful.", "helpfulness": 1, "user": "tinastubs", "date": "July 2, 2007", "id": 8042007}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Just back from a two night stay at the Grand Hyatt San Francisco, June 23rd & 24th, 2007. I really have no complaints about this hotel. Valet parking at the entrance was always very convenient. Was able to call from the room to have the car at the door in 10 - 15 minutes. Pricey parking at $43.00 per night, plus tax, but not much more than the other garages around the hotel. I liked walking out the door and climbing right into the car each time we needed it. Front Desk staff was courteous and efficient. Our room on the 26th floor faced West and had a beautiful view. Room was clean, nicely sized with a King bed, large desk, two comfortable chairs, and adjustable end table. Furniture a bit dated and worn, but nothing I would complain about. Bathroom was roomy and clean, albeit again a bit dated but decent. Marble counter in bath. Excellent shower head with great pressure. Love the Portico bath products! Small, funky looking TV that I enjoyed watching the news while using the bathroom. Hallways were kept clean. Generally very quiet. No issue with noise. Elevators didn't have unreasonably long waits, usually under two minutes if that. Property was generally very well kept and felt upscale. Not top notch luxury, but very nice for what it is. Ate breakfast both mornings at the Grandview restaurant on the 36th floor. Most incredible views of the city. I suggest going up there just to have a look. Food was pricey as is usually the case at a hotel restaurant, but we wanted the convenience of being able to grab a quick bite as we had a busy schedule. Wait staff was very good and friendly. Food tasty, no complaints. We paid $159.00 for our room booking directly on the Hyatt website, using the Senior Citizen rate. I believe the AAA rate is the same. For the money it was an excellent value. I recommend this hotel and most likely will consider this hotel as a first option on future trips to San Francisco. Best point, location, location, location, and if you can get a high floor, the views.", "title": "Excellent value, views, location", "helpfulness": 3, "user": "LeoLion69", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8015641, "likes": {"liked": "— Location, views, and staff", "disliked": "— A little dated in room decor, price for food in restaurant"}}, {"rating": 3.0, "title": "Great Hotel...But The Extras??", "text": "Stayed at the Hyatt 1 night on our tour of California.The hotel itself was of a high standard as you would expect,but from the moment we arrived I felt like money was falling through my hands with all the various \"add ons\".The valet parking was $40 a night.In the room the bottle of water on the side had a note on them saying $5 each.I went to use the internet in the lobby and was told \"its $5.95 for 15 minutes\".I went across the road to the Holiday inn...where its free!", "helpfulness": 3, "user": "Yesman78", "date": "June 23, 2007", "id": 7969847}, {"rating": 4.0, "title": "Good location & great views", "text": "When we went out at night we had to wait 15 minutes for the car as the valet was so busy bringing eveybodys car up,me I would rather just park my own car,its a lot easier but I know in the US they seem to be big on the valet thing.", "helpfulness": 1, "user": "PSLondon1", "date": "June 20, 2007", "id": 7942234}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We couldnt fault the location,and the beds were awesome,but I dont think I would stay here again as all the add ons put me off.", "title": "Excellent location", "helpfulness": 2, "user": "paultlaf", "date": "June 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7939828}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Hotels which are part of large chains tend to be impersonal & homogenous, and in this sense the Grand Hyatt was no exception. However, that aside it's hard to criticise.", "title": "Perfectly convenient", "helpfulness": 2, "user": "TravellingCarlito", "date": "June 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7873012, "likes": {"liked": "— Great views and convenient location", "disliked": "— Small size of business lounge"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 66, "average": 240, "very good": 745, "terrible": 38, "excellent": 751}, "aka": "Grand Hyatt San Francisco Hotel", "slim_ranking": 0.11914893617, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Located in the heart of the city, the newly renovated Grand Hyatt is steps away form World Premier Shopping, cable cars, Chinatown, the Convention Center. Guests at Grand Hyatt enjoy exquisite comfort & amenities including a complimentary Fitness Center, daily newspapers, free internet access at OneUP restaurant and lobby area and the ultimate sleep experience in a \"Grand Bed\"."}