{"user_rating": 4.0, "review_count": 105, "name": "GrandStay Residential Suites Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I have just returned from my weekend trip to Santa Barbara and we had stayed at this hotel on Saturday, July 14. I absolutely loved it! This would be my second favorite hotel after the Woodfin in San Diego.I am a huge fan of tripadvisor so whenever we go on vacation I always check the reviews on hotels here first before booking a room. I wanted to stay in Santa Barbara but most of the rooms were booked so the closest city with available rooms was in Oxnard. If you are on a budget I would say that this hotel would be a good base but driving to Santa Barbara would be about 30-40 minutes. But this hotel is a great value ! I only paid $129 plus tax for a Saturday stay (AAA rate). I got a queen bedroom suite which had a kitchen and seperate living room, 2 tv's ( one in bedroom and other in livingroom) and a sofa bed. Having a kitchen is so important when you have kids because they get hungry and thirsty at all times of the day and night. The room seemed spotless. I did not feel that the bed was very comfortable though. I have stayed at other hotels with better beds. And the bedsheets weren't as nice and soft as other hotels that I have been at. That was probably the only 2 things I did not like. The room was a decent size. In the back of the hotel you will find a small rectangle pool (nothing special)with jacuzzi, a half size basketball court and a wooden playset (just basic). The playset would be for older kids though not for toddlers. And on one side of the hotel is a Gold's Gym and on the other is a 7-11 Gas station, across the street and in back are just businesses. You can just walk over to 7-11 if you need to buy anything although the hotel did have a small pantry where you can also purchase items like sundries, snacks, drinks, ice cream and some frozen food. Oh, and they also had a continental breakfast in the morning ( very basic). The hotel is also situated right in the middle of a business district so it's a pretty boring area but they do have shops within driving distance. It's an easy freeway access. And for those with kids there is a Chuck E, Cheese about a 5-10 min drive on the freeway. You can take the kids there at night when there's nothing else to do. I was very pleased with my stay up until midnight when my car alarm went off. I went to my window to look outside and saw an extremely noisy car with a loud muffler had pulled in right next to mine. There was 2 drunk men and 1 drunk woman in it as well. I was really concerned that they might do something to my car so I just sat at my window waiting to see what it is that they were going to do. They spent about 20 minutes in the car from what I can see was taking photos because I kept seeing flashes. Finally they got out of the car and was extremely noisy. Other guests must have called the front desk to complain because I know I must not have been the only guest that was woken up by them. They had entered the hotel and about 10 minutes later they were back out with a hotel staff yelling at them to leave the property and made them aware that the cops have been called. They left and as soon as they reved their engine my car alarm once again went off but I was so relieved that they were gone. I was not able to go back to sleep until 4AM because if my sleep is disturbed then I have a hard time going back to sleep.The hotel staff did an excellent job of immediately removing them from the property and letting them know that they are not welcomed here. I am sure that this was just one of those rare instances because like I said this hotel is in a business district so I don't think it would attract people like that. The next morning I found out from the front desk that those people had damaged some hotel property before leaving. The girl had kicked in the air conditioner and the 2 men did some other damage as well because they were told to leave. I did hear police sirens last night and the front desk told me that as soon as those people got in their car the police was had caught them. I am so glad because they were driving drunk and they can do some harm to others. Also this hotel seems to get alot of late night NOISY arrivals at least the night that I had stayed. I saw many people arriving after midnight up to probably about 2:30AM. You may want to get a room in the back of the hotel if you do not want to be disturbed by people arriving in the middle of the night. If I should visit Santa Barbara again in the future I will definitely stay here again for it's value and great room! I would highly recommend this hotel especially for people with kids ! I hope my review will help you with your decision!", "title": "The best place for families !", "helpfulness": 1, "user": "momma3boys", "date": "July 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 8126013, "likes": {"liked": "— room with kitchen", "disliked": "— midnight disturbance"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Stayed two nights while visiting Port Hueneme Navy base. Hotel is about 15 minutes from main gate and is located off the 101 freeway in an office park area.", "title": "Grand stay at the GrandStay", "helpfulness": 1, "user": "jmpg", "date": "June 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 7936822, "likes": {"liked": "— room with kitchen", "disliked": "— Location...away from any activities."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Very nicely appointed rooms with a separate bedroom. Room was spotless minus the cigarettes that the last unthoughtful guest stuffed in the window tracks. Spacious bathroom with nice Bath and Bodyworks soaps and shampoos. Staff was very nice and efficient. I had to change my reservation at the last minute and they were very helpful. When I notified the front desk of the cigarettes they seemed really concerned and apologized.", "title": "Nice place!", "helpfulness": 2, "user": "kuma668", "date": "March 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6917863, "likes": {"liked": "— Very clean", "disliked": "— Very slightly more expensive than a regular hotel room, but this is more than a regular hotel room."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We stayed one night at the Grandstay Residential Suites to accomodate", "title": "Great welcome from Norma and Laurie", "user": "susiesguy", "date": "November 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6088414, "likes": {"liked": "— Quality accommodation with back up service from excellent staff", "disliked": "— Close to major road (but that could be an advantage for some)A"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "my sister, who is a Grandstay regular. We had a 1 bedroom suite which was nicely appointed. The room has a full sized refridgerator with icemaker, two burner electric stove, microwave, coffee maker, small sink, and dishwasher. The living room area has a small sofa, TV, easy chair and end table, with a long counter-style table between the kitchenette and living room. The sofa folds out to a sleeper (according to the room info sheet). The wireless internet had a good signal all throughout the room.", "title": "Wrong place at the wrong time", "helpfulness": 2, "user": "seemelater", "date": "August 29, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "location": 1.0}, "id": 5723459, "likes": {"liked": "— kitchen in room", "disliked": "— everything else"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We stayed here for a wedding that was being held at the La Crosse Center. We were able to walk it was just a few blocks. The hotel was being renovated but it did not affect us. We had a 2 bedroom studio, large enough for 2 adults, a toddler, and a teenager. Room was clean, quiet and comfortable. The only thing I did not like is the kitchen had no plates, glasses or silverware. Not much of a help with 2 kids and food. The kids used the pool and had a good time even though it was small they did not care. Right across from the Octoberfest grounds.", "title": "Great Area Large Rooms", "user": "jenai23", "date": "December 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187328138}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "When we travel we always try to book a 2 bedroom suite. We found one at the GrandStay & were anxious to try a new place. It was very disappointing. Primarily, the rooms were small. The bedrooms in particular were very small - in the 2nd bedroom one had to walk sideways between the bed and the wall to exit the room. There was no desk in the unit - the kitchen counter had to suffice (no room). In this 2 bedroom unit there was one bar of soap - all had to share for showering and general washing up purposes. The plastic cups were so thin that it was hard to hold one with water in it without crushing it. There was no grab bar in the shower, the tub was slippery, and there was no bathroom fan. To top it all off, the free internet came with a 15 minute limit after which you had to sign on again. This hotel was clean and the lobby was nicely decorated, but the room was cramped and there was an obvious effort to build it as inexpensively as possible. We will not stay here again.", "title": "Disappointing", "user": "sandibea44", "date": "November 26, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 4.0, "value": 3.0, "rooms": 2.0}, "id": 185943374}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We spent a week here during the summer while we were house hunting in the area and will definitely stay here again. The staff was pleasant and helpful and the 1-bedroom suite was comfortable and well equipped for preparing simple meals and snacks. The best feature of the hotel is its location...just a few steps from the Mississippi River and a beautiful river front park.", "title": "Best Hotel in Town", "user": "trailman1943", "date": "November 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183676524}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "There were several oddities about the site. One was the absence of free newspapers. I think that the front desk had one copy that you could borrow after promising you would return it soon. There were no newspaper racks where you could buy a paper. Another was that there was not a dresser in the bedroom, which meant we had to keep some clothes in suitcases. I think the property is undergoing a renovation in the fall of 2013 so perhaps dressers will be added. Also, the windows could only be opened about an inch (for safety, we were told) which meant we had to run the AC & fan more than we liked.", "title": "Some good, some could be better", "helpfulness": 2, "user": "rcpeterson", "date": "October 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 182270837}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "[Note - I'd really give this a 3.5 if I could. I don't think its quite 4, but it didn't dissapoint me enough to drop to a 3]", "title": "Great Deal For Dog Lovers....and Everyone Else", "user": "RadiantPath", "date": "October 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179796431}], "location": {"country": "United States", "city": "Oxnard"}, "stars": 2.5, "variance": {"poor": 8, "average": 10, "very good": 32, "terrible": 7, "excellent": 48}, "aka": "Grandstay Residential Hotel Oxnard", "slim_ranking": 0.466666666667, "description": "Now open! Oxnard's newest hotel! Conveniently located off the 101 freeway between Los Angeles and Santa Barbara and just minutes to the beautiful west coast beaches. The GrandStay Residential Suites combines all the comforts of home with the services of a grand hotel. We specialize in taking care of guests requiring extended stay accommodations, or whether you're in town for a seminar, special project, or relocating to the area."}