{"user_rating": 4.5, "review_count": 631, "name": "Granville Island Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I've stayed at this hotel twice now; the first visit was a few years ago and the room we got was amazing, with great views of False Creek and the water. Service seemed fine enough then, although we had no reason to really deal with them. The second time I stayed there was a marked contrast -- so much so that I'm not sure I want to stay there again. We requested a king, but were booked into a room with two double beds, overlooking a boardwalk so we couldn't open our curtains. When we saw a couple check out, we asked if we could be switched to their room instead (we were just there for one night) and were told the same \"sorry, we are fully booked.\" I don't quibble with hotel management since I'm sure they have reasons for doing things the way they do, but I don't like being lied to. Some kind of simple explanation would have satisfied us instead of a template response. When we were leaving to go the airport, we asked for a cab, to be met with the response, \"oh, there are always cabs outside.\" After waiting 10 minutes outside to no avail, we decided to hoof it to the nearby cab stand. Amazing that the hotel staff couldn't even be bothered to call for a cab on a quiet early Saturday morning. When we stored our bags in the hotel's baggage area, one of the bags' handles was damaged when it was returned to us. After the annoyance of being treated rather shabbily we decided to forego complaining, cut our losses and learn from this experience. What a shame. Fortunately, Granville Island and Vancouver as usual did not disappoint.", "title": "Mixed experience", "helpfulness": 3, "user": "TorontoFrequentrvlr", "date": "May 30, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 16516920, "likes": {"liked": "— Location: right on Granville Island", "disliked": "— Staff attitudes, shabby room (older furnishings), no privacy (people walking by could see into our room)"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The room was so tiny we could hardly fit in it. No carpet on the floor, hardly any outlets and the bathroom was too small. We requested a larger room, since we were a group of three, previously booked and wanting an adequate room. We were told none were available. The room was small and dark and old. In no way was this a three star hotel. We left that night for a better place.", "title": "Sub Par Hotel for us", "helpfulness": 4, "user": "esperansi", "date": "May 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 15977249, "likes": {"liked": "— I didn't like it", "disliked": "— The room was horrible"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "This was a nice little hotel on Grandville Island. Convenient for shopping on the island. Be srue to plan time to spend there. The market there is nice, cute shops, and good resturants. Central enough that driving to downtown, other touristy areas or the airport wasn't too far.", "title": "Nice hotel with good location", "helpfulness": 1, "user": "cpyoon", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 15069022, "likes": {"liked": "— Location", "disliked": "— Room a bit dated"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The hotel itself is a bit hard to find on the island. Once you find it and walk in, the inside is nice. It use to be a brewery so you see it as you walk toward your room. Kind of neat actually. The lobby is nice and clean with the rich dark red wood... The room itself is decent but nothing great. Furniture kind of dated and getting old. Same with the bathroom. We had a nice view from the balcony which has 2 chairs for you to sit on. Bed was comfortable enough.", "title": "The Good and the bad", "helpfulness": 1, "user": "Rolsma", "date": "April 14, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 15018750, "likes": {"liked": "— rooms, romantic and clean", "disliked": "— Help at the front desk"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Service was very good. We knew before arriving that we had to leave a day early and they were very understanding and helpful in helping us try to confirm our partial refund with www.hotel.ca and confirmed that it's ok with hotel policy. The manager was even willing to speak with them if necessarily and luckily so because they did want to speak to him to confirm it.", "title": "We love Granville Island", "user": "ROSIEW", "date": "April 8, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 14881179, "likes": {"liked": "— The location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Perhaps people in Canada just go to bed very early, I don't know, but you would think a hotel that caters almost exclusively for holiday makers would have come across people who liked to have a drink after a day's sightseeing.", "title": "Not a place for late nights", "helpfulness": 1, "user": "newgrange", "date": "March 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14467088, "likes": {"liked": "— Location and price", "disliked": "— Odd bar hours - no resident's bar."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I was part of a group of fifteen, all staying a minimum of five nights in this hotel - the hotel itself was fine, but their attitude to us when we requested a drink at 10.30pm (hardly the middle of the night) was not exactly welcoming - in fact one night it was suggested we go to another establishment on the island. They were happy enough to take a large amount of money from us for our accommodation and meal costs, but it was too much trouble to serve us one drink at half ten?", "title": "Great Location, Dated Hotel", "helpfulness": 1, "user": "Adam R", "date": "January 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 12989518, "likes": {"liked": "— Location", "disliked": "— Cracked bidet"}}, {"rating": 4.0, "title": "Nice hotel and location", "text": "Now in case you think we were a group of lager louts, we were almost all women, with an average age of about 40 - we were unlikely to start wrecking the place or puking in the corridors. We wanted one or maybe two quiet drinks before bed and it was quite irritating to be made feel so unwelcome.", "helpfulness": 1, "user": "sarahjane198", "date": "October 27, 2007", "id": 10374641}, {"rating": 4.0, "title": "Mostly the Location", "text": "The rooms in the hotel were lovely. In general the staff were most accommodating, but to be made feel like some sort of rowdy alco for wanting a glass of wine at night was most unpleasant.", "helpfulness": 7, "user": "Canucks07", "date": "October 14, 2007", "id": 10078534}, {"rating": 5.0, "title": "Perfect 25th Wedding Anniversary Choice", "text": "This hotel couldn't be in a better location. Granville Island is a wonderful attraction for visitors and locals. In addition to the large market, there is also a kids market, shops, water taxis, theatre, art school and other attractions for people of all ages. It's also a lovely place to sit and watch the world go by.", "helpfulness": 2, "user": "SuePhoenix", "date": "September 18, 2007", "id": 8752438}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We booked the hotel on Hotels.ca for two days.", "title": "great location for a wannabe 4 star with 2 star service", "helpfulness": 1, "user": "meggotty", "date": "August 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 19388641, "likes": {"liked": "— location", "disliked": "— staff was not helpful"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The hotel is in a great location but needs some serious updating, sound proofing and desk staff needs an attitude check towards guests. The floors throughout are marble with an occasional scatter rug. Our room was adequate. Kind size bed, tv, marble floors small scatter rug on either side of the bed.", "title": "Bedbugs", "helpfulness": 1, "user": "Bombonero", "date": "July 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 18225814}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We could hear chairs and people moving around in the adjoining room as if it was in our room mostly because of the echoing from the marble floors.", "title": "Granville Island", "helpfulness": 4, "user": "kathleenmarie", "date": "July 18, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 5.0, "value": 2.0, "rooms": 1.0}, "id": 18022010, "likes": {"liked": "— location", "disliked": "— the room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The room was in a very quiet section of the property but the noise factor was a problem because of the large space in the threshold of the door and the rooms on either side. The elevator groaned when in use which was kind of scary.The pay per view movie was not working the first night, worked the second.", "title": "LOVED this hotel!", "user": "lmnparade", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17654344, "likes": {"liked": "— The incredibly friendly and welcome service, the luxurious, high quality penthouse, convenient parking", "disliked": "— The beignets at the restaurant were disappointing, but all the other food we had was perfectly delicious"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We were charged $12 per day for parking and in-room water. The website's info said $8 per day for parking and complimentary in- room water.", "title": "Made our stay", "user": "ArwenStAlbans", "date": "July 2, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 17451113, "likes": {"liked": "— Location", "disliked": "— Only one bedside table"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "A hotel with its own brewery, how can you go wrong?", "title": "For the Location", "user": "SeattleRican", "date": "January 21, 2009", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 23762325, "likes": {"liked": "— Location on Granville Island", "disliked": "— $12 a day parking"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Seriously, we go to Vancouver BC at least once a year and have been staying at the Granville Island Hotel for the past four years. The top reason we continue to choose this hotel is its location. We love Granville Island and everything it has to offer--the botique shops, public market, restaurants, theaters, and its central location in Vancouver.", "title": "Five of last six Christmases at Granville Island Hotel", "user": "cassarooni", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 22187402, "likes": {"liked": "— the waterfront atmosphere, the views, the staff", "disliked": "— cannot always be assured of specificaly-requested room from time of reservation to arrival"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "We reserved a room with the internet special price of $135 CN through the hotel's web site. Our room was clean and comfortable with a king-size bed. The hotel's lobby was undergoing renovations at the time but it never created any issues with our stay. In fact, I'm anxious to see how it looks the next time we stay.", "title": "Great hotel", "user": "Papa_JCalgaryCanada", "date": "October 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20888104, "likes": {"liked": "— The view", "disliked": "— the dining room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "We're the sort of travelers who aren't interested in luxury and a lot of amenities with our accommodations. We use hotels to sleep and shower when we're on vacation. We value location and a clean and comfortable place to stay. If you're that sort of traveler, too, this hotel is a great option for your trip to Vancouver.", "title": "Great Location: Shops, water, views, walks, pond, brewery, arts", "user": "LindaRan", "date": "October 13, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 20849952}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "In 2004 my daughter was back East with her dad's family for Christmas and I just couldn't stomach the idea of spending another holiday with my then-significant other's nice but guarded family in an overheated home where conversation never goes deeper than discussion of recipes, jobs and weather.", "title": "Too expensive for what you get", "user": "RM2007QuintanaRoo", "date": "September 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 20375675, "likes": {"liked": "— Location", "disliked": "— Price"}}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 3, "variance": {"poor": 23, "average": 52, "very good": 202, "terrible": 7, "excellent": 347}, "aka": "Hotel Granville Island", "slim_ranking": 0.237113402062, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The Granville Island Hotel, a boutique hotel, offers a one-of-a kind experience. With welcoming staff to greet, a restaurant and lounge to entice, and a luxurious room to make you feel at home, the Granville Island Hotel is Vancouver’s best kept secret. With endless opportunities to dabble in local art & cuisine at the famous Public Market or to explore Vancouver by bike or kayak, the Granville Island Hotel offers something for everyone. Located just minutes from the village, the Granville Island hotel is the perfect get-a-way spot for couples looking for a quiet alternative to staying downtown."}