{"user_rating": 4.5, "review_count": 4088, "name": "Gran Porto Real Resort and Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My girlfriend and I stayed at the Gran Porto from 4/28/07-5/5/07. We arrived after a long day of travel and were pulled off to the side and told they had no rooms. So we put up a good fight and they kept denying us a room and I was done wasting more of my vacation time. They told me they'd put us up at The Sandos Caracol Beach & Spa for 1 night and also comped us a lobster & champagne and a Xel-ha/Tulum guided day trip. So they had me sign a form stating all of that and off we went to Sandos. Needless to say, we were not happy, but once we got to the sandos it was alright. We cleaned up and went swimming, got drinks and food. The hotel was nice, a little too big for our liking but nice enough. The next morning we chose to get a taxi and get back to the gran porto at 7AM. When we first arrived, they told us we were supposed to be their for two nights and we flipped. I then just kept going up to the front desk and hounding them about a room. In the meantime we ate and got chairs out by the ocean. One thing that helped I think is I walked through the halls of the hotel and saw which rooms were being turned over, not just cleaned. Then went and told the front desk the room numbers and said we would take any of those rooms. Anyway, by 11am we had a room and our vacation started, the rooms are great, very spacious and clean. We stayed in room 246 which was toward the far end of the hotel, facing the royal. The view of the ocean was great for a \" jr. oceanview suite\". The staff are very friendly and always help in any way they can. The beach is ok, it does have sandbags and a lot of coral/rock once in the ocean, I have been to better but is ok if you get out pretty far. The beach at the royal is much better and we went over there a few times to enjoy. The spa is great, we got massages and my girlfriend got her nails done. They gym is sufficient, could use another treadmill or so but are usually free on the odd hours. The food was good, breakfast was excellent and the reservation restaurants are nice. Our favorite thing is too just hang on the beach and get sun, so we did not do too much. I can't say I would go back unless the overbooking thing was fixed, even though it doesn't happen to everyone, its just not worth the stress and aggrivation. So all in all, its a very nice place and its proximity to 5th ave is awesome. Go there, its real fun!!", "title": "Nice hotel but overbooking is just not right", "helpfulness": 4, "user": "MA623", "date": "May 11, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7589046}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at the Gran Porto April 28th thru May 5th. We had no problem getting our room but others that came in the same time as us did have problems,they wanted to book them across the street at the Royal for 5 days and then back to the Gran Porto for 2,they refused and got their room for the full week at the Gran Porto. Our room was gorgeous,we had the ocean front suite,the service was great,drinks were awesome and the hotel and pool was gorgeous! The beach was very nice also although there are sandbags along the shore to prevent further erosion.We have no complaints at all. Food was very good,in fact is was the best buffet food we have ever had at an all inclusive,and we have stayed at quite a few over the years.", "title": "Excellant Hotel", "helpfulness": 2, "user": "Rocko55", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7586119, "likes": {"liked": "— Location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The location was excellant,just a short walk to 5th ave which we walked to almost everynight just to absorb some of the local atmosphere and enjoy the various bands that were playing up and down the entire length of the street. We would gladly stay at this hotel again but I can understand others frustration if you had showed up expecting to stay there and was told they had no room for you. All in all it was a very enjoyable vacation experience for us and we would gladly book this hotel again!", "title": "Great Honeymoon", "helpfulness": 4, "user": "devilray", "date": "May 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7572683, "likes": {"liked": "— All-Inclusive.", "disliked": "— The bed was a bit hard."}}, {"rating": 2.0, "title": "No rooms at the Real", "text": "My wife and I just returned from our Honeymoon (4/29 – 5/5/07) at the Gran Porto Real and it was great! In the months leading up to our trip I read a lot of reviews and many worried me, but once at the hotel all those worries were forgotten.", "helpfulness": 4, "user": "playajon", "date": "May 6, 2007", "id": 7551149}, {"rating": 1.0, "stay_parameters": "Stayed April 2007", "text": "Check-in was a little confusing by American standards, but as my wife reminded me you're in a foreign country they do things different here. While our room was not immediately ready they did give us access to the buffet for a bite to eat while we waited. It was worth the wait! From the balcony of our Jr. Suite we had a magnificent view of the beach.", "title": "Never Got To Stay here - Beware!!!", "helpfulness": 5, "user": "rocnfred", "date": "May 4, 2007", "detail_rating": {"front_desk": 1.0, "location": 3.0, "value": 1.0}, "id": 7545426}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We stayed from Apr 22-29 for our daughter's wedding. The main problem with this resort is they are famous for overbooking. Some of the people in our party were given rooms in the \"frat house\" area of the hotel, totally unacceptable. After complaining the hotel staff finally looked after everyone, but this should not have happened in the first place. The food is quite good, and they keep the resort very clean. The evening entertainment is horrible, even tacky. They really need a nightclub, not everyone is ready for bed at 10:00 pm! The wedding was lovely, no problems there. Personally, I would not go back to this resort.", "title": "Terrible Overbooking problem", "helpfulness": 5, "user": "mungi", "date": "May 16, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7632708, "likes": {"liked": "— Junior suite ocean front are lovely"}}, {"rating": 5.0, "title": "Stayed at the Gran Porto Real - April 2007", "text": "I spent a week at the Gran Porto Real in Playa del Carmen in April 2007. My sister and I wanted to take our 80 year old mother somewhere special, so we picked this hotel through internet. Some previous Trip Advisor reviews were helpful as I contacted the hotel via email and telephone to ensure our rooms would be ready for us, i.e. that we wouldn't be in the \"overbooked\" group.", "helpfulness": 5, "user": "Cora740", "date": "May 15, 2007", "id": 7627774}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Found once we finally got through the line to check in(not many front desk staff on duty) and to our rooms , we had a very excellent week. Waiting in line was softened by a welcome mimosa or two. During our stay the staff made extra efforts toward greeting our mother and gently teasing with her. Great nightly entertainment pool side that we could view from our balcony. Food very good. One nice touch was that there was no restriction on the number of times you could dine in the adjoining restaurants. You just can't beat the location. Beach a little rocky right off shore but further down (not far) it is wonderful.", "title": "Over Booked", "helpfulness": 4, "user": "theezen", "date": "May 14, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 7615913, "likes": {"liked": "— Pool", "disliked": "— Check in"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Yes, every morning I rec'd and ignored the invitation to move across to the new \"luxury\" Royal property . Would we return? ... definitely.", "title": "Stay AWAY!", "helpfulness": 8, "user": "VenusSurf", "date": "May 14, 2007", "detail_rating": {"front_desk": 1.0, "location": 4.0, "value": 1.0}, "id": 7605140}, {"rating": 4.0, "title": "Surprise, overbooked", "text": "My husband and I travel every year at the same time. The end of April. When we arrived at the airport we were told that we need to fine the green shirt, we did and our name was not on the list waited 1 hour brfore we could leave. Then when we got to the hotel we were bumped to another resort. They tried to get us to stay at the other resort for 3 day of our 7 day trip, but I did not let that happen...", "helpfulness": 5, "user": "RayVToronto", "date": "May 12, 2007", "id": 7591790}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This was one of three properties my husband and I stayed at during our mid-May vacation. We enjoy visiting various locations and enjoying a variety of accomodations. Admittedly, we prefer fairly upscale hotels and great boutique hotels but are open to a wide range as well.", "title": "A Dump", "helpfulness": 7, "user": "freqtrav88", "date": "June 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 7925590}, {"rating": 4.0, "title": "Nice", "text": "The minute we checked in we were disappointed. We did not have any overbooking issues. In fact, my husband decided to surprise me by upgrading to a beach front room. We got to our room (probably last decorated in the late 70s/early 80s), opened the doors, and had a terrific view of some guy's big belly hanging out outside our door on a hammock - beautiful! Outside the sand and pool were filthy. Small boats were docked up and down the coastline so you certainly would not want to go for a swim. We decided to have lunch near the pool and enjoyed lsitening to several wonderful classy ladies yelling and cursing at their kids.", "helpfulness": 5, "user": "winniems", "date": "June 18, 2007", "id": 7925430}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We had dinner at the Italian restuarant which was one of the worst dinners I have ever had. It is hard to go bad with Italian but they certainly did - the most bland food. Don't even bother with the wine - do not bother. Just order up one of the few beers you can get (they do not have a large range).", "title": "Fantastic", "helpfulness": 4, "user": "aussieinturkey", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7837520, "likes": {"liked": "— the staff", "disliked": "— the internet connection"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "My husband who never ever complains lost his mind during the evening. He woke with bug bites. He spent several hours complaining on the telephone and in-person and asked for a transfer to the Royal. After hearing \"No\" many times, they finally agreed to move us. Just know, if you want to move, and they tell you that you cannot, be persistent. The move is well worth it. The Royal across the street is a major improvement.", "title": "Will be returning", "helpfulness": 2, "user": "mamackaes", "date": "June 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7834273}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "As soon as we got to the Royal, everything was much better. Even the ocean seemed cleaner across the street. Resturant options were better, the pool was cleaner, and the rooms were brand new. Do yourself a favor, skip the Gran Porto and head for the Royal. Maybe I am a snob but avoid the Gran Porto at all costs.", "title": "Beware!", "helpfulness": 8, "user": "Familyvactioneer", "date": "June 11, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 7833797}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I booked at the Grand Porto Real because I was traveling with my sister and mother who is not very mobile. I have stayed at the Iberostar Quetzal/Tucan and loved it. However, for having a non-mobile 65 yo mother with us, the GPR was perfect. The rooms were very spacious and well equiped. The food was well above average for an all inclusive. The pool is small but sufficient. Beaches are not as nice as Playacar but OK. The location is PERFECT! Right off 5th but away from the crowds. The staff took care of us with a smile and a \"no es nada\" or \"de nada\". The buffets and al la carte restaurants were varied and tasty. The resort is truly beautiful. The architechture is unbelievable. It is probably not best for young kids but everyone else should be thrilled!", "title": "GPR is great!!!!!!!!!!!!!!!", "helpfulness": 5, "user": "LovePlayacar", "date": "June 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7796643}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Just got back from Playa Del Carmen. Stayed May 24th through May 28th. The Gran Porto Real was great. We stayed in Jr. Suites with walk outs. The other couple that went with us, had a room right at the pool. We were on the beach. They were both excellent rooms. No problems with check in or out. Speedy on both. The resort was very clean and neat. Rooms were very comfortable. Bed could have been a little softer, but didn't keep us from sleeping. Never had a problem with maid service. Food was great at all the resturants. Mexican and Itailian were our picks. The snack bar on the beach was perfect. Service for drinks, couldn't have asked for better. As soon as you walked out of the room by the pool, or even close to the pool you were greeted by some of the most personable and friendly servers. (Jesus) was the best. The location of the resort was perfect. We were 2 blocks from 5th street. We will definitely return to this resort.", "title": "Great Experience", "helpfulness": 5, "user": "TravellnHog", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7720809, "likes": {"liked": "— smaller resort", "disliked": "— would have liked to have seen more of the beach from the pool area and our room"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We arrived in Playa last Saturday 05/12/2007. We had booked a JR Suite oceanfront for 7 nights. Low and behold the reviews were right! Paco-the service associate checking us in said they were overbooked and we were being upgraded for free to The Royal. It was my wife and I so it was nice to be upgraded to Adults only. Ok anyways, we get to the Royal they claimed their computers were down, hmmmm. Please keep in mind we were traveling from Oregon, so we are talking it's 7 o'clock at night and had started our journey at 3am the same day. Once their computers were \"back up\" they checked us in and I asked before we left \"this is an Ocean Front, correct?\" They said no it's partial.....That's when T-rav got [--]. So, I called Paco from the Royal because the manager did not want to be involved, again what is with that? I ask for Paco and told the lady I was the U.S. Embassy. Paco gets on the phone and starts saying how EXPEDIA doesn't understand Ocean front means partial, so I hung up.", "title": "PACO-is a liar!!!", "helpfulness": 7, "user": "qflihl", "date": "May 21, 2007", "detail_rating": {"value": 1.0}, "id": 7667677}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Kids, Adults and everyone in between. Here is how to resolve an issue like this......Call your credit card company tell them services were not rendered and advise that the Hotel was unwillingly to work it out or offer a refund. They will credit your account back, but it also triggers who ever you booked through to make contact with you...You will be very surprised how quickly you get your Ocean Front that you paid for.", "title": "No overbooking, but we got sick.", "helpfulness": 7, "user": "rick830", "date": "May 20, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 7654758, "likes": {"liked": "— location", "disliked": "— food"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007", "text": "P.S. -The Royal is the most immaculate and cleanly All inclusive I have ever stayed at.", "title": "Just like advised on reviews, PROBLEMS with OVERBOOKINGS", "helpfulness": 3, "user": "gruss_69", "date": "May 16, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7632849, "likes": {"liked": "— The friendliness of the staff, rooms and activities - 5th avenue so close", "disliked": "— room availabilities, front desk (no help)"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 258, "average": 319, "very good": 930, "terrible": 174, "excellent": 2407}, "aka": "Gran Porto Real Hotel", "slim_ranking": 0.382653061224, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}