{"user_rating": 4.5, "review_count": 41, "name": "Grand Sal Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We booked this hotel at the last minute. I had requested, online, a room close to a lift or ground floor. When we got there the room was the first one in the hallway from reception which they said was as per my request. That already impressed me because people often miss that. The staff was so friendly and stressed to the person checking in before us and to us that they wanted us to have a relaxing stay. The room is decorated in relaxing colors and we loved the big wood door for the bathroom that had holes at the bottom, presumably for steam. We opened the window to a lovely view, sat on the bed \"for a few minutes\" and proceeded to fall asleep! So yes, it is a relaxing atmosphere. After a tasty dinner at the restaurant we went to the jacuzzi. You can reserve the jacuzzi for your own party (seats up to about 6 if I remember right) and the sauna for 1 hour. We woke up to a nice breakfast with a good amount of variety. They let us check out a little later since we were going on a tour of the mine that morning. The hotel can arrange tickets for you but we had reserved already. Overall we loved the atmosphere at the hotel and would happily stay there again. The price was reasonable too. And if you are touring the mine (which you should!) it is right next to the entrance.", "title": "Beautiful hotel, perfect location for the mine", "helpfulness": 1, "user": "SJNK", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173252149}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We went there at the end of July, it was very hot so air conditioning was very welcomed. Room was spacious, well furnished, very comfortable with a huge bathroom. Bedding was changed after 3 days and towels every day including cleaning.", "title": "Very good hotel", "user": "Helena W", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172671862}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Reception stuff very helpful, polite and friendly, restaurant a bit expensive for Poland but included breakfast buffet was great. We stayed there 6 nights and enjoyed it very much, Salt mine entrance next door, tickets arranged at the reception. We couldn't fault it, greatly recommend it and definitely would go there again.", "title": "Treats all-in guests as second class citizens.", "helpfulness": 1, "user": "Traveller-on-Tyne", "date": "June 22, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164813981}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "As the result of some very positive reviews on here, we decided to spend the final night of our visit to Krakow at the Grand Sal, Wielicka. We booked their dinner, B&B and entry to the saltmine all-inclusive offer in advance. This turned out to be a mistake.", "title": "Worth having a night stop if you visit the Mines", "user": "camok", "date": "June 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163965913}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "When we went down to the restaurant in the evening we were shown to our table - but instead of being given the menu/wine list, as is usual in virtually all restaurants, we were simply asked verbally whether we wanted soup, fish or meat. When we asked to see a menu we were told that there wasn't one, even though other guests seemed to be choosing from one. Eventually after questioning the waiter (he didn't volunteer the information) we ascertained that the \"fish\" was perch and the \"meat \" was duck - but we were not told how they were cooked nor given the opportunity to order side dishes. After asking if there was a wine list we were simply given the option of \"red\" or \"white\" with no indication of the choice, if any, in either category.", "title": "Distinguished", "user": "Wisloki", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163683813}], "location": {"country": "Poland", "region": "Southern Poland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 0, "very good": 7, "terrible": 1, "excellent": 32}, "slim_ranking": 0.1, "description": "You will find the Grand Sal **** Hotel exactly in the picturesque St. Kinga Park. The hotel is situated next to the Danilowicz shaft by means of which tourists enter the historic corridors of the Mine. The building of the former Saline Baths existing at the turn of the 20th century was reconstructed to become a luxurious hotel. Its interior emphasizes the hotel’s links with one of the most beautiful and unique places in the world which is the Salt Mine in Wieliczka. Grand Sal**** Hotel offers 18 rooms of the highest standard and 1 apartment with a view towards the historic park and water fountain. Toiletries produced from Wieliczka salt are a pleasant surprise found in every hotel room. The Grand Sal restaurant serves chef de cuisine dishes as well as the specialties of the regional Malopolska cuisine and various European dishes. The picturesque and idyllic hotel surrounding, the adjacent historical Mine and the elegant hotel interior all allow our guests to find peace and quiet permitting them to rest completely. On the other hand conferences and various kinds of meetings can take place in a most extraordinary environment."}