{"user_rating": 4.5, "review_count": 262, "name": "Grape Leaf Inn", "reviews": [{"rating": 4.0, "title": "Relaxing Fun", "text": "My husband and I had a wonderful stay a week ago for our anniversary. Our room, the Roussanne, was very well appointed and decorated. The fireplace wasn't much to speak of but the room itself and the bathroom were charming. The tub was huge. The breakfasts were, as noted by others, VERY yummy. The wine tasting in the speak-easy wasn't quite as informative as we'd hoped but we had a very nice time in any case.", "helpfulness": 3, "user": "maw8", "date": "April 18, 2005", "id": 3372737}, {"rating": 5.0, "title": "Best 25th Anniversary!!", "text": "The staff was wonderful and helped to book tours and dinners for us. We really loved our dinner at a new restaurant, Cyrus. It was out of this world in terms of service and the menu was terrific. It'll be the next French Laundry. It was VERY expensive -- $300 for two of us. We'd do it again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 30, 2005", "id": 3311171}, {"rating": 5.0, "title": "Loved the place", "text": "In contrast, we ate at Chateau Sauvereign the next night and were very disappointed. It felt like we were in a hotel dining room and there were some tour buses who were eating dinner in large groups in the room as well. At 9pm they actually turned up the lights and started taking down tableclothes and tables while we were still finishing our dinner.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 22, 2005", "id": 3294960}, {"rating": 5.0, "title": "We have traveled throughout the world and the Grape Leaf Inn is at the top of our list.", "text": "Richard and Kate made us feel like we were at home when we were at the Grape Leaf Inn. My husband and I were celebrating our 25th Wedding Anniversary in September. We stayed at 3 different places and Richard and Kate's was by far the best. The room was immaculate, the food was delicious and Richards wine tasting room was fun and felt like an adventure as we went downstairs behind the bookcase to get in. What an amazing room. They were both so helpful with directions and setting up dinner reservations. I would put the Grape Leaf Inn at the top of my list of places to stay when we go back to Napa from Wisconsin. We met some very nice people at the same time. Wish it hadn't taken me so long to write this review, but better late than never.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3283694}, {"rating": 5.0, "title": "Absolutely Fabulous", "text": "My fiancee and I were travelling in the Napa/Sonoma region, and were not even planning to stay in Healdsburg. However, the hotel we had found in santa rosa was terrible and we had to make a last minute change. The Grape Leaf was recommended by a (sold out) nearby hotel. What a joy. We ended up staying a couple of days. The owners are fantastic (try the 5:00PM wine tasting in the basement!) and the rooms are just great. As runners, we also enjoyed the location, with backroad access to great running roads. Did we mention the amazing breakfast ?", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 19, 2004", "id": 2899576}, {"rating": 4.0, "title": "Not Just An Old House", "text": "It was my first visit to the wine country in Sonoma Valley and I found my stay at the Grape Leaf as part of an overall experience. The old victorian is in excellant condition with special attention given to restoration, landscaping, and on-site parking. Staffers Carrie and Amy represented the Inn well and owners Richard and Kae took a hands on role in the daily operation. Stayed in the S. Blanc room and the bathroom was a little small with steam from the shower causing the smoke detector to go off. The location was perfect for a short walk into town for shopping and eating, as well as driving to the local vineyards. Fresh baked cookies, gourmet breakfast, and evening wine tasting in the \"speak-easy\" set the inn above others that I have stayed in. I will definitely go back and recommend to friends and family.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 19, 2005", "id": 3575702}, {"rating": 3.0, "title": "An ok stay at the Grape Leaf Inn", "text": "We just got back from Healdsburg California and a stay at the Grape Leaf Inn. Unlike most of the reviews I read I can not rate the Inn excellent. Let me start with the good stuff. The innkeepers were friendly and the breakfasts were great all fours days while at the B&B. The gardens surrounding the property were beautiful. Unfortunately, we did not like our room. Our room was called pinot noir. The air conditioning did not function, it was very cramped (bathroom sink next to the bed), very small bathroom with poor water pressure. I hate it when it takes me 25 minutes to wash the shampoo and conditioner out of my hair. For $200 a night I expected more. While at the inn we had a chance to look at some of the other rooms. Many of them were spacious, beautifully decorated, etc... The inn has the original building then there was a new addition added. I really think the rooms in the addition were nicer.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 29, 2005", "id": 3508234}, {"rating": 5.0, "title": "Absolutely wonderful! The Best!", "text": "If we ever went back to Healdsburg I would stay were our friends stayed. It's called 410 Mathison. This property was impressive. Our friends were staying in the bungaloo. It had a kitchen with a subzero fridge and a viking range. The bungaloo was right next to the in ground swimming pool and jacuzzi. The main house was beautiful. Two big fireplaces with enormous couches and leather chairs. Definitely 410 Mathison if we get out to Healdsburg again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 2, 2005", "id": 3431116}, {"rating": 5.0, "title": "perfection", "text": "What a marvelous B&B! We loved every minute of our weekend here. The small touches in the rooms like Aveda products and Frette linens, and the beautiful antiques and charm throughout the inn make this an exceptional place. The afternoon wine tasting, and the fabulous breakfasts were icing on the cake! We will definitely come back to celebrate our third-year anniversary, and our engagement!!! Kae and Richard are excellent hosts.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 19, 2005", "id": 3389282}, {"rating": 5.0, "title": "relaxing,comfortable inn in a great location", "text": "The Inn is beautifully restored and run by a very friendly couple (and other staff) just a few blocks from the Healdsburg town square. The breakfasts are among the best we have ever tasted anywhere. The wine tasting each evening is an added plus -- the region is well known for its expanding wineries. The beds are comfortable and it is quiet. And good coffee with the New York Times each morning sealed the deal. You won't go wrong -- lots of interesting galleries and restaurants in the town and surrounding areas. We also took a hike in Armstrong Redwood Grove -- that rivals Muir Woods except far fewer tourists. Massages are available on site. \"worth a detour!\"", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 8, 2004", "id": 2812474}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 9, "average": 13, "very good": 29, "terrible": 4, "excellent": 207}, "aka": "Grape Leaf Hotel", "slim_ranking": 0.6875, "description": "A luxury 12 room Inn in the heart of the Wine Country. Enjoy the ambiance of our award winning property, absolutely sumptuous breakfasts and ultimate comfort, amenities and our special hidden Speakeasy where we serve the best California wines, cheeses and fresh breads daily. Walk to fine restaurants as well"}