{"user_rating": 2.5, "review_count": 49, "name": "Green Lantern Inn & Suites", "reviews": [{"rating": 4.0, "title": "Got a great deal on the room with heart shape Jacuzzi", "text": "My girlfriend & I were in Lake Tahoe area last week and were looking for a place with in room jacuzzi to stay during a weekday. Just looking around we found Green Lantern & got offered a great deal in their Honeymoon suite. Room had a huge King bed, refrigertor,microwave & the biggest inroom jacuzzi we had ever seen. Our best stay in Tahoe ever. Great deal for in room jacuzzi for $89. Will definitely go back.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 15, 2005", "id": 3008608}, {"rating": 1.0, "title": "Emergency - Cancellation Policy", "text": "My two friends ride their bicycles from SF to South Lake Tahoe. For many, many years the Green Lantern has been their destination. This year's Tour needed to be aborted because one of the cyclists became sick--an emergency situation approaching the summit the Friday morning (day before their Saturday night reservation). An immediate call was made to the Green Lantern to cancel the reservation because of the emergency. The cancellation policy was recited; and they were informed that they would still be charged for the room ($100), which they were.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 7, 2004", "id": 2428019}, {"rating": 2.0, "title": "Dirty Dirty Dirty", "text": "The reality: We miss Jean and Drax VERY, VERY MUCH. We will never return to the Green Lantern.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 8, 2004", "id": 1770150}, {"rating": 4.0, "title": "Perfectly satisfactory", "text": "I stayed at the Green Lantern twice in the early 90's. The first time I had no complaints...which is why I chose to go back. The second time, however, was very disappointing. Cleanliness was definitely a factor.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 12, 2004", "id": 1647504}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "I had considered booking this place but after reading reviews of another hotel with similar rating, I felt it safer to book elsewhere. After a disappointing night at another hotel, me and my girlfriend decided to try the Green Lantern. We looked at the Honeymoon suite and were very impressed with it. The room is quite large with a comfortable king bed. It also had a refrigerator, microwave and DVD player! And let's not forget the bathtub! The heartshaped jacuzzi tub is very nice for a couple. Especially after a day up in the slopes. The also looked very clean and the furniture did not look worn. I do feel that housekeeping needs better training though. We found a dirty towel that had been left behind the open bathroom door. There were also some condoms in nightstand drawer (luckily they were unused and still in their package.) The next day it appeared that they had not spent very much time cleaning the bath tub. They do not seem to be great on customer service. They provide a plunger for toilet and items to remove snow from around your vehicle. Did not bother with their continental breakfast, preferred to get complete breakfast at a restaurant. Apparently there are stairs right behind this room and you can hear people going up and down, but it is not as bad as in other places. I would definitely stay at the Green Lantern Inn again, in the honeymoon suite of course, (we also looked at their two bedded suite and were equally impressed, would stay there if travelling with kids or friends, don't know if their standard rooms are equally clean and comfortable)I would definitely have them better train their housekeeping staff though. Overall, felt that it was great value since we only paid $30 more that the original place and got so much more.", "title": "Very impressed with the room, their service could use some work", "helpfulness": 2, "user": "travelSanFrancisco", "date": "January 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 2.0}, "id": 4385765}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "We only stayed at Lake Tahoe for one night and had pre-booked the Green Lantern. We were quite disappointed overall, the service wasn't great, the room was ok, but didn't seem clean enough, and the shower definitely looked like it could do with a good scrub. The bottom sheet on our bed was too small for the mattress and moved around in the night, meaning we had quite an uncomfortable night's sleep. Breakfast was nothing but coffee and sticky cakes, and having stayed at other similar priced motels around california, we were used to much more. Driving around Lake Tahoe, there were so many motels that looked much nicer, that we wished we hadn't pre-booked.", "title": "Not impressed", "user": "serap", "date": "October 17, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4028020}, {"rating": 4.0, "title": "A Little Gem", "text": "We recently went up to Tahoe and while driving around choose to stay at the Green Lantern. It turned out to be one of our best experience of the trip.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 3, 2005", "id": 3247618}, {"rating": 4.0, "title": "Not bad for the price", "text": "While asking about Heavenly ski prices we were offered discount lift ticket which we bought there directly and saved us money and time the next day too (didn't have to wait in long lines to buy tickets at Heavenly). We were struggling to get the chains off our car when one gentelman that worked there hepled us out. The room was clean and comfy. As the saying goes you get what you pay for but in this case we got a lot extra. Will be back and staying here again. Keep up the good work.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 1, 2005", "id": 3238457}, {"rating": 1.0, "title": "No Service", "text": "I stayed at Green Lantern Motel in South Lake Tahoe last week with friends. I was a bit apprehensive at first after reading all these reviews but found the place nothing like these reviews described. It was a fairly clean place, walking distance to casinos & Heavenly Gondola, friendly staff, coffee in the room, decent breakfast in the morning. I would definitely be back.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 4, 2005", "id": 3161031}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 7, "average": 11, "very good": 14, "terrible": 14, "excellent": 3}, "aka": "Green Lantern Inn And Suites", "slim_ranking": 0.884057971014}