{"user_rating": 4.0, "review_count": 351, "name": "Greensprings Plantation", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Our vist to Greensprings was awesome! The Staff are polite and the facilites are well appointed. The style is a little dated, but still luxurious. The suites a fully stocked with a full kitchen (all you need to do is bring your food). Near by is a series of shopping town centers. The location is at max 15 mins away from almost everything. There's ample parking. It's not exactly the most LGBT friendly check in, but it's the South, everyone was polite, it was just awkward. Now, on to the Sales pitch, well, unless you want to buy into the place when the people asked you do you want the tour say no. They told it would be a 60-90 min presentation. The company seems great; there was a very informative movie, but the sales agent's put car salesmen to shame. I have no doubt there is value in this time share and I have no doubt the folks who buy-in are happy as peach punch, but after 3.5 hours and 2 reps, 1 manager, and 1 QA person we literally had to say we want out.", "title": "Very Relaxing Weekend, (Avoid the Sales Pitch)", "helpfulness": 1, "user": "Robert M", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126654250}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "It felt like a bizarre game, you say no, they sweeten the pot, etc, but at some point, you simply want to go. They could have offered it to us for a dime, the answer was going to be no due to all the pressure. The worst thing for them I think they could get is a buyer with buyer's remorse, but there wasn't a grain of interest in our comfort level. They simply wanted to record a sell, any sell, for any amount. We left there tired, and frankly felt dirty. The first sales person was cool, she tried the hard sale on the tour (good), but it's her job so that was cool. The second sales rep assisted her before the tour was very good. We felt really no pressure from him, his approach could have worked. After the tour was the manager seemed to need to sell his pushing just made us want to leave right then (I get it, it's what sales people do, but shouldn't buying be a pleasurable experience). The QA person was nice but she went in to speel #5 or #6 we almost banged our heads on the table.", "title": "A wonderful time", "helpfulness": 2, "user": "jaytam", "date": "March 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126367677}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "In summary, great place, wonderful staff. If you bought in you probally made great choice. But if your interested in buying, go online talk to friends, don't take the tour, it's not worth the door prize.", "title": "Weekend getaway with spouse", "helpfulness": 3, "user": "intrepid_flyboy", "date": "March 4, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 125601431}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My family just spent the weekend at Greensprings and I cannot wait to return. It was just a great time all around. Even on off season, there were things to do. We played miniature golf, swam in the pool (indoor).. outside was ice cold, enjoyed a little tennis and some pilates by the pool. None of the main attractions (Busch Gardens) were opened yet so we stayed close to the redsort, other than venturing out for some shopping at the outlet mall. The condo was fabulous. It was super clean and very large for our family. We enjoyed the outside deck and the flat screen televisions and dvd players were a nice surprise. There were also movie rentals available. We loved the jacuzzi tub and the kitchen was well equipped. Please note that you will have to pay extra for wireless but there is free access in the main clubhouse. Great time had by all!", "title": "Nice! The Refurb Will Make it Nicer", "helpfulness": 1, "user": "mebejim", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125484075}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My wife and I saw an advertisement on Living Social for Greensprings. Having never been to Williamsburg, we decided to take a chance; we're glad we did. Although located about six miles from Merchants Row and Colonial Williamsburg, it is a straight shot and traffic was non-existant. As for the compound: Rooms were clean, bed was comfortable, jacuzzi hot tub was outstanding and the living room -- to include gas fireplace -- very comfortable. Drawbacks were dated living room furniture and very aggressive sales pitch. If you don't yet know, it is a time share affiliated with Diamond Resorts. They called us prior to our arrival, made a pitch when we arrived and called us in our room to make a subsequent pitch. They had trouble taking no for an answer.", "title": "Diamond resort owners 7 out of 10", "helpfulness": 9, "user": "vacritic", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124547735}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Spent a weekend in Williamsburg at the Greensprings Plantation. The unit was squeeky clean and very well appointed. I spent two nights on the pullout as we had five people. It...was actually very comfy especially with the fireplace at my feet. The weather was terrible, but the unit was warm. If I was going to spend a week there, I would be very comfortable as the kitchen was well appointed. Unit was very roomy and had a deck overlooking the golf course. I will return!", "title": "Greensprings - Nice 'n Clean", "helpfulness": 5, "user": "macfanmd", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119964015}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at this resort in early August. We had 3 criteria for our stay - close to Busch Gardens, a pool and enough room for 6 people. A clean, safe place is a given.", "title": "Good for what we needed", "helpfulness": 2, "user": "DukeNC", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119952317}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "When we checked in, we did receive the obligatory sales pitch which we quickly deflected and were never bothered about again. I was apprehensive about the condo due to other reviews, but our unit, while dated, was clean and in working order. It was also spacious and the small appliances in the kitchen were brand new Cuisinart.", "title": "Needs better management", "helpfulness": 6, "user": "drmom23", "date": "October 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 119629647}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The resort has very easy and quick access to Busch Gardens, local restaurants and grocery stores. We had several visitors while staying here and the security process was very easy and responsive in getting them into the resort and directly them to our unit.", "title": "Great Stay", "helpfulness": 1, "user": "13WorldTraveler13", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119259883}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The pool was fine, but could use a face lift. Frankly, everything could use a face lift at this place as it is all dated and showing age. Having said that, we felt comfortable, safe and had no regrets to booking this location.", "title": "Great Accommodations", "helpfulness": 4, "user": "Chooie13", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118579609}, {"rating": 4.0, "title": "Williamsburg getaway", "text": "My wife and two daughters, ages 10 and 7, joined a family friend and her daughter, age 7, at Greensprings Resort in Williamsburg, VA this past week. This was my family's first trip to the area. Our friend is a timeshare owner with Diamond International which owns the property, so we were her guests and had committed to a one-hour timeshare presentation upon arrival.", "user": "Farmerica", "date": "April 3, 2012", "id": 127195414}, {"rating": 2.0, "title": "Our Unit was horrible!", "text": "The Pros: the property is a gated resort conveniently located about a 10-minute drive to either downtown Williamsburg, college, the Colonial area and the Jamestown settlement exhibits. The outlet shopping mall is about 15 minute drive. The property itself was spacious, it had all of the recreational amenities- indoor and outdoor pool ( though it was not very warm during our stay), tennis, basketball, golf course, mini-golf, hiking and running trails, etc. It did not feel crowded and appeared to be well staffed.", "user": "jaugusti1950", "date": "March 30, 2012", "id": 126981045}, {"rating": 5.0, "title": "Close to Everything Historical", "text": "Our check in was efficient and quick. We stayed in Building Two in a 2BR unit overlooking one of the golf holes. Our friend was in the unit above ours and so we essentially had the entire side of one building to ourselves, so the kids could go back and forth as if we were staying in one large duplex. I am assuming that we were in an \"owners'\" building because everything was new and updated. And there was a closet full of old model television sets being stored there. The unit was very large, the beds and sofas very comfortable and each bedroom had its own bathroom; including a jacuzzi tub in the master. Our kids room did not have a TV in it which was fine for us. My only complaint about the accommodations are that the hvac unit was a little noisy and our toilet had a sewage smell coming from it throughout our stay. It was not very noticeable, but it became a distraction after a few days of going in and out of that bathroom. Also, the floors/ceilings are thin. We could hear our friends above us anytime they walked around and if there were smaller children running around regularly, it would have been very disturbing.", "user": "RugbyKP", "date": "March 28, 2012", "id": 126852353}, {"rating": 5.0, "title": "Wonderful Resort", "text": "My Con is focused on the timeshare presentation. We arrived in Williamsburg around 12:30 and had a 2PM appointment. Verbally, we were told one-hour. The sign-in card they give you says in small print ( which we unfortunately read afterwards ) that the \"presentation is 90 minutes to 120 minutes.\" They provide snacks and daycare service for kids ( coloring books and videos to watch), but do you want to start your vacation dropping your kids off in a room to color for two hours? So, this I would have planned differently in hindsight.", "user": "Brenda46", "date": "March 27, 2012", "id": 126794578}, {"rating": 5.0, "title": "Great place especially for the price!!", "text": "Our sales person was very good ( Theresa) and I found the presentation very informative and without a lot of doubletalk or fake marketing buzzwords. However, they don't adjust their presentation or pick up on cues to move ahead or skip to the next part of the script. There is a tolerable set-up followed by a short movie to watch, color brochures and maps to review, then a driving tour of a sister property ( Powhatan), then an internet demo, then the drop-ins by the manager, and so on. We started a little after 2:00 and were still trying to get them to wrap it up at 5:30. ( remember, our kids are being held in a daycare room all this time after a four hour car ride!) It felt like a day of work and ultimately cost us our first half day of vacation. So, again, I would have planned that obligation a little differently and take some responsibility for not having a hard stop. However, they made us a good offer to join and I would consider it for next year, but the timing for that financial commitment this year is not practical. BTW, you receive resort coupons and dinner vouchers, which we did use in Colonial Williamsburg the next evening.", "user": "Stephthomas", "date": "March 27, 2012", "id": 126771068}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This past weekend my boyfriend and I and another couple stayed in the 2 bedroom condo. We got one of the newly renovated rooms and it was PERFECT!. Everything was clean and in order. The only thing I would say is try to get a 3rd floor unit. We were on ground level and the people above us walked like elephants disturbing my beauty sleep. Other than that great place and is centrally located. We like it so much we may be coming back this weekend ;)", "title": "Couples Retreat", "helpfulness": 5, "user": "future08nelly", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 124532656}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Large two bedroom condos in a beautiful setting conveniently located just a few miles from The College of William and Mary. This is my third time staying in this resort and each time my family and I have enjoyed it very much when we visit our daughter at The College of W&M. The only drawback is that they make you stop by the concierge desk after check in where they try to get you in a timeshare program which I'm really not interested in. I wish they would just stop doing that specially if they know you've been there a few times. I try to be polite in declining but sometimes you just have to get your point across. This is the only reason I didn't give them 5 stars.", "title": "A family retreat....", "helpfulness": 2, "user": "GMatSP", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124528061}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Nice place, would highly recommend it. Looks like they try to keep everything repaired and kept nice.", "title": "Williamsburg retreat.", "helpfulness": 1, "user": "traveler4times", "date": "February 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124369365}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We just stayed in the Greensprings Resort for a short vacation to the Williamsburg area. We had never stayed in a Timeshare Resort before and weren't sure what we were in for. Overall, the experience was very pleasant.", "title": "Worked for Us", "helpfulness": 13, "user": "TinaReads", "date": "November 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 120119339}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We didn't get one of the newly renovated units, but I was quite pleased with the third floor unit that we stayed in. There was a wonderful jacuzzi tub in the bathroom and that alone made up for many minor quibbles we may have had. It was quiet and was within 15 minutes of everything we wanted to do in and around Williamsburg, another plus for the resort.", "title": "A Great Place to Stay", "helpfulness": 3, "user": "Snowhater11", "date": "November 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 120015691}], "location": {"country": "United States", "city": "Williamsburg"}, "stars": 3, "variance": {"poor": 26, "average": 53, "very good": 124, "terrible": 19, "excellent": 129}, "aka": "Greensprings Plantation Hotel Williamsburg", "slim_ranking": 0.271604938272, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "In the heart of Williamsburg."}