{"user_rating": 5.0, "review_count": 282, "name": "Green Palm Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "After much review of B&Bs on TripAdvisor, my husband and I settled on the Green Palm Inn. Everyone had such great things to say about it, we thought we could not go wrong, and we were not disappointed. It is so nicely decorated and just as pretty as in the pictures on the inn website. We stayed in the Royal Palm Suite, which is HUGE! In-room fridge stocked with water and tea, two fireplaces, comfy bed, jetted tub. Diane, the owner, truly made us feel so comfortable (a B&B with only 4 rooms put us a little out of our comfort zone, so we were a bit nervous, but we felt right at home). She is an awesome cook, and we didn't think about food again until after 3:00 we were so stuffed. The snacks available any time of day were much appreciated by my sweet-aholic husband. Diane put out wine and other snacks in the evening, but if you missed it while you were out, you're free to hit the fridge when you get back and pour yourself a glass - loved that, since we are usually out all day and don't come back until late. I don't usually take the time, but I felt compelled to write a review, we liked this place so much. We will surely go back again next time we go to Savannah.", "title": "Loved, loved, loved it!", "helpfulness": 5, "user": "crabmanbc", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8588656, "likes": {"liked": "— huge room, good food, great host", "disliked": "— street noise at night"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This was our first trip to Savannah, and our first stay in a Bed and Breakfast Inn. We didn't know what to expect. What we found was a beautifully-appointed, clean home, with all the privacy and comfort of the best hotels, but with the added benefit of a wonderful innkeeper: Diane. Diane instantly made us feel at ease and gave us several suggestions for dinner on our first night. Her breakfasts were hearty and delicious. Her blueberry bread pudding is amazing! Diane is also very knowledgeable about Savannah, and helped us choose the best way to go about our sightseeing during the course of our stay. The Inn is in the city's historic district and we found it within easy walking distance of most of the district's must-see destinations. The Inn is right next to one of Savannah's prettiest squares, Greene Square, and I enjoyed having my morning coffee there. We will definitely choose the Green Palm Inn for our next trip to Savannah, and warmly recommend the Inn to readers of this review.", "title": "Awesome Experience!", "helpfulness": 5, "user": "dr-rmb", "date": "July 31, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 8268124, "likes": {"liked": "— Location and treatment by the Innkeeper (cooking, advice).", "disliked": "— We'd really have to work to come up with this one...."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "What can I say that hasn't already been said. This Inn is great!", "title": "Fantastic!!!!", "helpfulness": 1, "user": "travelpro47", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8001242, "likes": {"liked": "— Everything!", "disliked": "— There is nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Diane is the best hostess and the location and decor of the Inn is very welcoming!! We have been to many B&B's and this is a 10!! We will definitely be back!!", "title": "Wonderful Stay", "helpfulness": 3, "user": "kimmer455", "date": "June 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7803429, "likes": {"liked": "— Clean, Large room, quite, food and wine, great hostess, location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My daughter (18) and I decided Savannah would be a great destination for a mother, daughter trip and we could not be more pleased with our choice of B&B. Diane is a wonderful hostess and great chef. We stayed in the Royal Palm suite with a king size bed and a daybed. The room was huge and very clean. The bathroom was large and had a jacuzzi which was very welcome after a long day of walking. The inn was very quite at night so we sleep soundly. Diane's breakfasts were large and yummy. My daughter who is rather picky ate every bite. The wine and cheese spreads were great at the end of the day. We only had to eat out once a day, usually a late lunch. Diane knowledge of Savannah was a great help and we recieved great tips as well as what to avoid. The Inn's location is great. Both my daughter and I felt very safe. Miss Betsy is an asset to the Inn. So friendly and helpful! There is ample parking if you rent a car and Diane gives great directions. I would not think twice about where we would stay if we return to the lovely City of Savannah, the Green Palm Inn!", "title": "The Green Palm Inn Was Wonderful", "helpfulness": 3, "user": "travelbugdfw", "date": "June 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7796226, "likes": {"liked": "— The Innkeeper"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "What can we say about Diane that hasn't already been said? We stayed at the Sabal Palm suite as a surprise for my wife. It was just a fantastic experience. Diane's knowledge really made our first trip to Savannah go off without a hitch. Usually I just book the cheapest hotel we can get and wander around the city aimlessly for hours with no idea where to go. This trip we decided to take advantage of local knowledge and we weren't disappointed. Breakfast is great and filling. If we wanted to, we easily could have skipped lunch each day after Diane's meal! At one point we wanted to get picked up by a petticab but I had no cash. Diane actually lent my wife a jacket so she wouldn't get cold! She wouldn't even accept no for an answer. Can you really get more welcoming and helpful than that!?", "title": "All the good parts being at home with none of the bad", "helpfulness": 1, "user": "wplacrosse26", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121632128}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Stayed at the Inn for two nights.Suprised my wife with trip to Old Town Savannah.Got her to the Philly airport with no idea where she was going. We arrived at the cozy Green Palm Inn and met Diane the innkeeper. Also met her assistant Tammi. These two are definately in the right business. Thats the people business. The Inn is very clean,well maintained and very romantic says my wife. Fireplaces in the dining room and living room. The inn is decorated first class, with a touch of class. Our room was not ready when we arrived,(actually we were told that ahead of time) so we sat with Diane and she oriented us as to where to go and what to see. Savannah is easy to navigate and we had a great time. When we returned that afternoon, the staff had prepared appetizers and we snacked and had some wine by the fire.", "title": "25th Anniversary could not have been better", "helpfulness": 2, "user": "pga81", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121296458}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We headed out for dinner in the rain and and then headed home. Diane was kind enough to place a bottle of Champagne in our room for our 25th anniversay, which was thoughtful. The next morining we had a superb breakfast for the two of us, did I mention that day we had the Inn to ourselves. Diane reccomended that we see some history so we toured a home and two museums. Then some drinks and shopping and back home for more hors douvres. For dinner, if you want upscale dining try Noble Fare which Diane reccomended. Small but romantic restaurant, great drinks and food. She also told us about Soho for lunch which was great too. She knows the best spots in Savannah. That night Tammi arranged a taxi to take us to dinner and a car for the next am to take us to the airport. I researched many B&B's on", "title": "Thanksgiving at Green Palm", "helpfulness": 1, "user": "jjpinney", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121201716}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "here and you cannot get any better then the Green Palm Inn. Its all the ambiance, Diane and Tammi and making you feel welcome and I say without hesitation, stay here and you will be glad you did. Thanks Diane and Tammi and I still think that glass moved by itself!!!", "title": "very friendly host", "helpfulness": 1, "user": "lvtraveler0389", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120722546}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Diane was absolutely wonderful. We stayed in her 2 bedroom cottage over Thanksgiving weekend and couldn't have asked for more. Great location, highly recommend", "title": "What a wonderful way to experience Savannah!", "helpfulness": 1, "user": "NARFlizzy", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120417823}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My boyfriend and I stayed at the Green Palm Inn over Labor Day weekend. Diane was a warm and welcoming hostess, and prepared us with a detailed map of where to go to eat, drink and be merry throughout Savannah. (I can't forget to mention her culinary prowess!)", "title": "In Savannah for Labor Day weekend", "helpfulness": 1, "user": "suemars", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118117055}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "The inn itself was beautifully decorated, and the staff was extremely helpful and accommodating. We stayed in the Sago Palm suite and loved everything about it.", "title": "August in Savannah", "helpfulness": 1, "user": "auntwhezer", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117149473}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The convenient historical location was within walking distance to everything, and even returning home late was not a problem due to the central location.", "title": "Outstanding in every way", "helpfulness": 3, "user": "RaleighTravelers", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116863780}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "If I were to go to Savannah again I would definitely stick with the Green Palm Inn. It truly gave me an understanding of \"Southern Hospitality\"", "title": "Wonderful!", "helpfulness": 2, "user": "wilpstew", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116340014}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This is my 6th trip to Savannah and I have always stayed at the Green Palm Inn and once again I was not disappointed. Lovely flowers on the grounds, great food, and wonderful service. The location to all the river front and downtown is all within walking distance so need worries to find parking. Always a pleasure to stay with Diane in her Inn. Her service and hospitality gets better with each visit", "title": "Fabulous Honeymoon!", "helpfulness": 2, "user": "sharp70joc", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115657751}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I spent a weekend at this beautiful home. Everything a great B&B should be. Comfortable, clean, great food, great location, and a very helpful owner. Enjoy!", "title": "Wonderful Bed & Breakfast", "helpfulness": 1, "user": "MickeyT78", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119744544}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I had been to Savannah several times, but this was the most memorable. My wife and I spent the weekend at this lovely B&B and had a really enjoyable time. The host was gracious, knowledgable, and very accomodating. The room itself was small - but that wasn't a bad thing. If anything it made the stay more intimate and romantic. Having a fire going in the fireplace and a bubble bath waiting was nice after a long day of exploring the city. Speaking of which, Gail at Discover Savannah Tours knows this place well and met us in the lobby to begin our walking tour of the historic squares - not to be missed!", "title": "Beautiful stay", "helpfulness": 1, "user": "Brian W", "date": "October 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119221063}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The rooms are wonderful, the inn-keeper Diane is remakarkable (from her hospitality to her scrumptuous breakfasts), and the price is quite good in comparison to other B&B's in the area. My wife and I actually stayed here 3 years ago as part of our honeymoon trip, but I did not leave a review at the time. After staying at a few other B&B's the past few years, I felt compelled to write a review for Green Palm Inn. It is a top-rate place to stay, and I HIGHLY recommend it to anyone visiting the Savannah area. Class, class, class ...", "title": "Simply Delightful", "helpfulness": 1, "user": "doctimothy", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119166107}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We couldn't have chosen a better place to celebrate our 35th wedding anniversary! This was our first trip to Savannah and we loved it.", "title": "Wonderful Anniversary at the Inn!", "helpfulness": 3, "user": "lovemytraveling", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119117193}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We chose the Green Palm Inn based on the Trip Advisor reviews and we were not disappointed. The Inn is located on a quiet street next to the Green Square and it's within a 10-minute walk to the City Market area where a lot of the restaurants are located. Upon arrival, Diane's warm welcome made us feel at home right away. She sat with us and showed us where everything was on the map, places to eat and attractions.", "title": "Outstanding, friendly, and yummy!", "helpfulness": 1, "user": "JCPals", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118541496}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "We arrived in Savannah from the West Coast late on Thursday December 27th. We stayed at The Green Palm Inn and can’t stop raving about it. The inn is beautiful, the innkeeper Diane is gracious and welcoming, the location is perfect for exploring and the breakfasts are to die for. We were booked into the Royal Palm Suite which has a Queen bed as well as a twin daybed. The room is huge with a fireplace, armoire with television, dual closets, writing desk and a mini-fridge which Diane keeps stocked with water and iced green tea. There is also a coffee pot with various teas and coffees. The bathroom has a Jacuzzi tub, fireplace and is stocked with shampoo, conditioner, soap, bath soaks, a blow dryer and plenty of towels. As an example of the wonderful hospitality, Diane knew our plane was very late in landing, so after her partner Gary had kindly taken our over-stuffed luggage upstairs, Diane insisted on driving us to our restaurant so we could make dinner. In the afternoons, Diane puts out plates of cookies, chocolates and various goodies. You are encouraged to help yourself to a glass of wine , and the treats are left in the dining room if you don’t make it in the afternoon. If you have the good fortune to visit Savannah, you simply must try the Green Palm Inn.", "title": "Stop searching! Can't do better than The Green Palm Inn", "helpfulness": 5, "user": "mayson12", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12363828, "likes": {"liked": "— The hospitality", "disliked": "— Nothing bad to report"}}, {"rating": 5.0, "title": "Simply the Best!!", "text": "To quote Tina Turner - Simply the Best!! Great location, great innkeeper! Great hospitality. What more can one ask?", "helpfulness": 4, "user": "mike3513", "date": "November 28, 2007", "id": 11119907}, {"rating": 5.0, "title": "Wonderful place to stay", "text": "mike & ursula senior", "helpfulness": 5, "user": "rocky26", "date": "November 27, 2007", "id": 11096375}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We just returned from a long week end at the Green Palm Inn. We can't say enough about the genuine hospitalilty and the wonderful atmosphere we experienced at the inn. Diane, the innkeeper made us feel right at home. Her breakfast in the mornings was always something to look forward to. Fresh biscuits, blueberry bread pudding, fresh fruit. We looked forward to the late afternoon wine and cheese and all the home made goodies which were different each day. Diane also has a great deal of knowledge about the areas and steers you in the right directions for sight seeing and restaurants. Wonderful place and would return with no hesitation.", "title": "the green palm inn is the best in savannah", "helpfulness": 6, "user": "petropolis77", "date": "November 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10944986, "likes": {"liked": "— EVERYTHING", "disliked": "— NOTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "My wife and I just returned from Savannah last night and I had to leave a note behind right away as it was the many comments about this wonderful Inn on this site that made me call right away for reservations. This was our fist experience at a B & B and to Savannah. and we were so happy it was such a great one.", "title": "Wonderful memories of Savannah and the Green Palm Inn", "helpfulness": 5, "user": "pmhdznr", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10777813, "likes": {"liked": "— The hostess and the location", "disliked": "— not a thing!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We spent a couple of nights here in October for our first visit to Savannah. We have stayed in few B&Bs over the years partly because our experiences were mixed, but this changed my opinion. Diane is a gracious host, and a phenomenal cook. From her gourmet quality breakfasts to afternoon cookies to evening wine, cheese and hor d'oeuvres, it couldn't have been better. We also enjoyed chatting with her as well as the other guests.", "title": "Perfect!", "helpfulness": 1, "user": "mfnyc", "date": "February 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124265399}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Our room was very comfortable, and the location very convenient. Almost everything is walkable, and with all the squares, there's plenty of places to sit and rest your feet.", "title": "Southern Hospitality on Greene Square", "helpfulness": 1, "user": "PallasAthena08", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124176363}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Overall we thoroughly enjoyed Savannah and our stay at the Green Palm was even better than we expected!", "title": "Wonderful 40th Birthday", "helpfulness": 1, "user": "Renee W", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 123210362}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "What a beautiful property in the midst of bucolic Greene Square in the heart of Savannah! Owner Diane was the perfect hostess, remembering my gluten free, nut free diet each morning and supplying a delicious hot breakfast, as well as cocktail hour hors d'oeuvres. We were there at the end of June so the city was all but deserted which made it even more romantic. We stayed in the Sago Palm suite in the back of the house and were delighted to have utter comfort and privacy. A five minute walk from the property brought you either to the river or towards the center of the city's historic district so it was nice to be a bit removed from all of the hotels and larger inns.", "title": "Quick trip through Savannah", "helpfulness": 3, "user": "TeamKozikowski", "date": "January 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123085525}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "We would recommend the Green Palm to anyone looking for the comforts of home with a dose of historic charm.", "title": "Great Holiday at the Green Palm Inn", "helpfulness": 2, "user": "auntwhezer", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122973383}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The Green Palm Inn is a great choice for a Savannah B&B. We loved touring Savannah & Tybee, and the Inn made for a perfect and comfortable home to return to after long days on our feet. Diane even accomodated an early breakfast time for us on our last morning so we could get out the door for an early flight.", "title": "A great choice.", "helpfulness": 2, "user": "jimnamy", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7754521, "likes": {"liked": "— Comfortable, clean room, great breakfasts and treats.", "disliked": "— Small shower."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My husband and I just returned from a trip to Florida and on our way we decided to spend a night in wonderful Savannah, Georgia. We wanted something quaint, charming, cozy, near the historic district, clean, and not cost us an arm and a leg. We found all of this and more at the Green Palm Inn.", "title": "Green Palm Inn: We loved it !!", "helpfulness": 4, "user": "Shar0nOntari0", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7485632, "likes": {"liked": "— Immaculate, beautifully furnished, close to historic downtown", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I loved it the minute I saw it with it's pretty porch and hanging flower baskets. It is much bigger inside than it looks from the outside. The place is immaculate and lovingly restored, elegantly furnished and very handy to walking to the historic areas, Colonial cemetery, waterfront, etc.", "title": "Loved the Green Palm Inn", "helpfulness": 3, "user": "cedargirl", "date": "April 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7403201, "likes": {"liked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "The host and hostess are very friendly and make you feel right at home. Diane is very knowledgeable and can offer many pamphlets and information about the area. The goodies, candies, and desserts that were set out on the buffet for the guests to enjoy was a special touch. Also at 4:30 p.m. Diane provides chilled wine with cheese, crackers, snacks for the guests. We had just returned from a lot of walking by 4:00 p.m. so it was very nice to sit with the other guests with a glass of wine and socialize.", "title": "The Best B&B in Savannh", "helpfulness": 4, "user": "mlsdacula", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7271851, "likes": {"liked": "— The beds", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Pretty perfect", "text": "We stayed in the Royal Palm Room. It was lovely and very large with a huge 4 poster high bed, lots of pillows and cushions, gleaming hardwood floors with lovely area rug. A fireplace in the bedroom as well as the bathroom with votive candles added a cozy feel. The room was very quiet. I never heard a sound from outside or inside, even though I was listening for ghosts. (Savannah is supposedly the most haunted city in the country).", "helpfulness": 8, "user": "elliott6184", "date": "March 14, 2007", "id": 7162172}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Everything about our stay at the Green Palm Inn was wonderful. The room was gorgeous, romantic, and cozy. Breakfasts and afternoon snacks were delightful. We stayed for 5 nights for our honeymoon and could not have asked for better service and accommodations.", "title": "Wonderful B&B", "helpfulness": 5, "user": "ebb11307", "date": "November 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 10774814}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband and I spent 5 days at the Green Palm Inn in early Oct. and just loved it. The location was within the HIstoric District but a bit on the edge so it was very quiet and we didn't have to deal with tour trolleys or a lot of foot traffic. Diane is a wonderful hostess, breakfasts were huge and delectable and she was a great source of information. We had some wonderful meals and, to counteract all the calories, I ran for an hour on several days. Running through the historic district was so interesting and gave me a real sense of the layout of area.", "title": "Kudos to Diane and the Green Palm Inn", "helpfulness": 7, "user": "KathyDuluth_Mn", "date": "November 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10761012, "likes": {"liked": "— Location, Comfort, Price"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Loved the Green Palm Inn! Diane was a great hostess, very hospitable and gave great recommendations for restaurants. Excellent breakfast in the morning, inn was very clean and homey. Would definitely recommend!", "title": "Loved the Green Palm Inn!", "helpfulness": 4, "user": "Willy100", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10430417, "likes": {"liked": "— Location, great service."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband and I celebrated our 4th Anniversary at the Green Palm Inn in Savannah. The Inn is so amazing. It's tastefully decorated, feels like you're at home, and very comfortable. Diane was an amazing hostess and cook. She spoiled us with great food and drink during our stay. She also gave us much needed advise as to what to see while we toured Savannah's Historic District. Our room (Palmetto Palm) was absolutely lovely and perfect for us!", "title": "What a fabulous Inn!!!", "helpfulness": 3, "user": "welchies", "date": "October 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10384783, "likes": {"liked": "— Friendliness, cleanliness, service, and price"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We had such an amazing stay and if we ever find ourselves back in Savannah we're definitely booking at the Green Pam Inn again! We also are recommending to everyone we know. It was perfect!!!", "title": "Perfect!", "helpfulness": 3, "user": "MB6td", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10299580, "likes": {"liked": "— Breakfast!", "disliked": "— The walls were a little thin."}}], "location": {"country": "United States"}, "variance": {"poor": 2, "average": 2, "very good": 7, "terrible": 2, "excellent": 269}, "aka": "Green Palm Hotel", "slim_ranking": 0.230769230769, "description": "Fodor's guide calls the cozy Green Palm Inn a \"pleasing little discovery.\" Exuding a calm, homey yet smart atmosphere, the little Savannah B&B haven reflects the well-traveled innkeepers' devotion to guests. The family-owned Victorian cottage resides in the Savannah historic district along boundaries of colonial Savannah's palisades; near the Savannah Riverfront, Factor's Walk on Bay Street, and concert venues; and, just steps away from patriotic Greene Square park, one of historic Savannah's world-famous garden squares."}