{"user_rating": 4.5, "review_count": 26, "name": "Green Turtle Bay Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband found this on the internet - and surprised me with it for a Memorial Wkd getaway. We had a 2 br condo with limited view of the lake. That was not a problem since we were on our boat on Lake Barkley each day, but if I go back, I will ask for a better view. The condo was clean, well appointed and nicely decorated with a nautical theme. I believe all condos are privately owned, and this one is well maintained.", "title": "Thrilled with this spot", "helpfulness": 3, "user": "gee_ess61", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 65965544}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The grounds of GTB Resort are also maintained. Flower beds, hanging plants, etc make this resort a little extra special than your typical lakeside spot. There were American flags gracing the property for the holiday weekend which really added a nice touch.", "title": "Room without a view. TVs unacceptable by anyone's standards.", "helpfulness": 3, "user": "GreatVacation84", "date": "May 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 64247502}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Everyone we came in contact with was very friendly and helpful. We thought the resort was laid out well, very user friendly. You can park your car and walk everywhere. Guests can rent golf carts to use around the property and are also allowed on the public roads into town (just a short distance away from resort)", "title": "Intersting Place to visit - Condos not so...‎", "helpfulness": 8, "user": "GastonBicyclist", "date": "March 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 58042552}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The town of Grand Rivers has capitalized on its quaintness and it is very tourism oriented. It is just a small town but it has a nice feel. Tourists walk up and down the main street visiting antique stores, bakery, etc. Yes, visit Patti's 1880's Settlement...it's not the best food in the world, but it is good and definitely part of the attraction of the town. Everyone will ask you if you went there, so you should.", "title": "No Better Place", "helpfulness": 1, "user": "RR_Traveler", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46773678}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The resort has a nice restaurant which we enjoyed ( this is a dry county, so bring your own alcohol.) The restaurant - The Yacht Club- allows you to bring in your own alcohol without any trouble. There is a regular crowd of club members who are luxury boat owners that rent slips from GTB and stay on their boats during the weekends. We met several one night and really had fun with them. A very friendly crowd that enjoys socializing. We fit right in!", "title": "Great Family Getaway", "helpfulness": 5, "user": "annabethsmom02", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15596864}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We have family in the area so we stay here often. We love this place. There is plenty to do, from shuffleboard to tennis, fishing or just hanging at the pool. We enjoy renting a golf cart and driving into town to eat at Pattis, going shopping and just tooling around. If around be sure to hit the LBL (land between the lakes) its a great area!", "title": "Wonderful Family Getaway", "helpfulness": 4, "user": "dpuck1998", "date": "November 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 10636524}], "location": {"country": "United States", "city": "Grand Rivers"}, "variance": {"poor": 1, "average": 3, "very good": 8, "terrible": 0, "excellent": 14}, "aka": "Green Turtle Bay Hotel Grand Rivers", "slim_ranking": 0.5, "description": "Vacation condominium, marina & spa resort on beautiful Lake Barkley in Western Kentucky. Located in the unique Village Between the Lakes, Grand Rivers, KY. Amenities also include Jade & Earth Spa, indoor pool and health center, walking trails, beach area, boat rentals and much more."}