{"user_rating": 4.0, "review_count": 97, "name": "Greshornish House Hotel", "reviews": [{"rating": 5.0, "title": "Best Place We Stayed in Scotland", "text": "Skye is a very dramatic place. It's wild, windblown and not convenient... exactly the reasons we love the place.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "December 3, 2005", "id": 4159608}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "I found Greshnorish (pronounced Gresh - nesh)on the web. It sounded like a place we'd like so we made our web reservations. The directions there were clear and easy to follow but I must admit there were times I wondered if all of the sheep we encountered on the lane were leading us to a sheep farm, not a hotel.", "title": "A Welcoming Idyll", "helpfulness": 10, "user": "AutumnTour", "date": "October 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4075152}, {"rating": 4.0, "title": "Perfect tranquillity", "text": "We pulled into the grounds and were amazed with the beauty of the place. But best of all, we ran right into Neal, the owner and host saying goodby to departing visitors and there to welcome us.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 17, 2005", "id": 4029331}, {"rating": 2.0, "title": "Don't Even think About Dinner", "text": "While the Greshnorish House was really beautiful, the hospitality is what we'll always remember. Neal was a great host, bartender and history teacher. That should be no surprise since he is a retired Eton teacher!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 13, 2005", "id": 3900106}, {"rating": 5.0, "title": "fantastic food , rooms full of character", "text": "Oh yes, the food was fantastic. Every meal was supurb. The morning we departed they even got up extra early so that we could eat and still catch the car ferry to the Outer Hebrides.", "helpfulness": 5, "user": "macsuperfly", "date": "August 24, 2005", "id": 3802430}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I stayed in August for one evening. The approach to the Greshornish was amazing - long dirt road full of sheep and beauty. Both innkeepers (husband and wife) were terrific. Be prepared for a typical small inn type of room (although told would have tv, the cable seemd to be out for some time, so no tv). The lack of tv was actually a bonus as it gave my husband and I time to relax. You will certainly feel at home and the dinner was fantastic. After a week of terrble food in Scotland (as one might suspect), we were happy to have a truly delicous dinner. I cannot say enough about our charming hosts. We loved our stay and it was worth making the trip!", "title": "Fabulous!", "helpfulness": 1, "user": "freqtrav88", "date": "September 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5799447, "likes": {"liked": "— The owners", "disliked": "— Size of bathroom and tub only"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Unlike many of the reviews here, we had a decidedly mixed experience at this hotel and I'm not sure it warrants being the #1 ranked hotel on Skye (as it is at the time I am writing).", "title": "Tempered enthusiasm", "helpfulness": 2, "user": "CapitalTraveler", "date": "September 12, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 5.0, "location": 5.0}, "id": 5794755, "likes": {"liked": "— Setting", "disliked": "— Service"}}, {"rating": 4.0, "title": "Wish we'd stayed longer", "text": "The setting is, indeed, beautiful. On an isoalted peninsula on the very far north end of Skye, it overlooks a loch and has the feel of being on a remote farm in the beautiful countryside. Sheep roam the access road, and there are some stunning walks to be hand in the area.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 8, 2006", "id": 5439712}, {"rating": 5.0, "title": "Peace and Tranquility", "text": "Our room was also one of the best of any B&B we stayed at during our trip to Scotland. On the large side with a modern bathroom and nice furniture.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 13, 2006", "id": 5338848}, {"rating": 4.0, "title": "Comfort in the back of beyond", "text": "The service and food, however, were a bit mixed. Some of the staff were incredibly welcoming and always inquired into our well-being. Others, however (including one of the proprietors) were the kind of B&B staff we have run into on occasion: makes you feel more like an intruding relative than a welcome guest. I guess this is understandable, given the difficulty of running a B&B, but a real pro should never let it show. We got a couple of stern responses to innocent questions, and once had a staffer complain to us about the behavior of her guests.", "helpfulness": 6, "user": "ask_a_local", "date": "May 23, 2006", "id": 5203913}, {"rating": 5.0, "title": "Beautiful Hotel looking over the water..", "text": "A beautiful large estate looking over the water.The house looks like something out of an Agatha Christy novel.Warm fires await you in the drawing room where tea is served in the afternoon and drinks in the evening before and after dining.The cuisine is expertly prepared by their own chef and naitive Calin Gillis.His creations range from fresh mussels(harvested right in the waters off the estate) and the best I've ever had!!! to venison, pheasant, fresh salmon, trout etc. ect...it's too lengthy of a list. Every dish was superbly prepared.It's no wonder why people from other Inns make reservations there just to experiance it.The proprietor Jane is witty and a wonderful hostess and her son Boyd Marshall a great host.There is a billiard room and a bar . It was my favorite place in Scotland because of the kind people and breathtaking landscapes.Roddie Gillis is the chef's dad and also is able to taxi you around and gives wonderful tours!!! I'll forever treasure my experiances there.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 14, 2004", "id": 1785059}, {"rating": 1.0, "title": "Dark Skyes", "text": "OK so it is a lovely looking place, but it is run by the most draconian people on the face of this earth. It is totally impossible to relax and there is an insistence of being piped in to dinner.I would recommend the Skye Inn, much, much more relaxed and welcoming.Stay away at all costs!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 5, 2004", "id": 1629320}, {"rating": 5.0, "title": "A haven of tranquility!", "text": "What can we say? What a beautiful place. the hotel is tucked away in an", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 21, 2004", "id": 1560553}, {"rating": 4.0, "title": "It grows on you!", "text": "idyllic spot, right next to the shore. It is so quiet and peaceful. My", "helpfulness": 1, "user": "sudu99", "date": "January 4, 2004", "id": 1536770}, {"rating": 4.0, "title": "Great food & wacky service in a breathtaking setting", "text": "fiance and I spent three nights here and didn't want to leave. It felt", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 19, 2003", "id": 1398292}, {"rating": 5.0, "title": "Magical Greshornish", "text": "Travelling alone I stayed in the Garron bedroom of Greshornish Hotel last week. Perhaps I was just fortunate to have had such great weather but my five-day stay at the hotel was simply incredible. Despite arriving late on the first night, Rosie and Neil (the hosts) were extremely welcoming and I was soon enjoying a game of snooker against Neil having enjoyed an absolutely fantastic dinner (the quality of which did not dip once during my stay). The atmosphere of the hotel is such that you can easily strike up friendships with fellow guests over a coffee by the fire in the gracious sitting room. As such, I soon found myself a tennis playing partner for the rest of my stay. Besides my tennis exploits, I found the hotel to be the perfect launch-off point for a number of expeditions, including a visit to Skye's two great castle's - Dunvegan and Armadale. Indeed, perhaps what I enjoyed most were the walks direct from the hotel itself. As they say, when the sun shines in Scotland there is simply nowhere more beautiful on this planet. In short, if you are looking for a seductive cocktail of warm hospitality, quality food and outstanding natural beauty, then look no further.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 19, 2005", "id": 3682000}, {"rating": 5.0, "title": "Fantastic Greshornish", "text": "My wife and I stayed at the beautiful Greshornish House Hotel for 5 days last month (May) and genuinely had one of the best holidays of our lives. There's so much to see and do in the area, and even on the two days when the weather was not so pretty (it is Scotland after all!) we were more than content to pass hour after hour reading in front of the hotel sitting room's lovely open fire, and enjoy the faultless hospitality of our hosts. The new owners took over the hotel about this time last year, and they have done a fantastic job. And I haven't even mentioned the food yet... Although I had considered keeping the secret to myself, anyone thinking of making the trip to Skye (highly recommended in itself), should certainly give Greshornish House Hotel a ring to see if you can get a room there.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 17, 2005", "id": 3573519}, {"rating": 4.0, "title": "WARM, WELCOMING", "text": "Stayed at the hotel in Sept 04 for a long weekend as a 50th birthday treat. The food was superb and hospitality faultless. Hope to return soon and would highly recommend this quaint, picturesque hotel.", "helpfulness": 6, "user": "dizzylizzie378", "date": "January 16, 2005", "id": 3010947}, {"rating": 4.0, "title": "Treat yourself !", "text": "This is one of the most relaxing and friendly places I have stayed in Scotland. The staff were welcoming and we found the room to be pleasant and quiet, and the standard of service and the food excellent.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 13, 2004", "id": 2877518}, {"rating": 3.0, "title": "Not as good as we expected", "text": "We understand that the hotel has recently changed hands, and we judge past comment on this site to be rather unfair to the the friendly and curtious family who are working so hard to restore the reputation and excellence of the Hotel.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 31, 2004", "id": 2131996}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 7, "average": 14, "very good": 16, "terrible": 5, "excellent": 55}, "aka": "Greshornish House Hotel Edinbane, Isle Of Skye, Scotland", "slim_ranking": 0.555555555556}