{"user_rating": 5.0, "review_count": 81, "name": "Grizzly Bear Ranch", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My wife and I spent 3 days with Julius & Kristin in this truly wonderful place in a log cabin by the river. The cabin was large and very clean with comfortable beds and an excellent en-suite bathroom. Kristin served up excellent home cooked breakfasts and dinners (with wine and/or beer included) and provided great packed lunches each day.", "title": "True Canadian Wilderness with added comfort", "user": "Dave_Pollard", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33590289}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We spent our days sailing on crystal clear lakes beneath snow topped mountains and scouring the backwoods for bears and other wildlife with Julius who is extremely passionate about the bears and the very knowledgable Gillian. At the end of each great day we returned to sit on the deck outside our cabin watching the river tumble by, listening to the birds sing and watching humming birds fight each other for access to the sugar syrup provided by Kristin.", "title": "An amazing wilderness adventure", "user": "AlWheatley", "date": "June 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32745598}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Would I recommend this place you bet!", "title": "Stay here if you want to experience the Canadian wilderness!!!", "user": "EllenvanG", "date": "June 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31780897}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This is a long overdue review, as we visited way back in 2007 as part of our honeymoon in British Columbia. I just wrote a long, witty and extremely gracious review to make up for lost time, but unfortunately, since I have fat fingers, I managed to navigate to another website while writing and deleted my entire contribution.", "title": "The bear facts - it's fantastic", "user": "Jimbob72", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41404515}, {"rating": 5.0, "title": "An intensely wonderful experience, 4 very special days in the wild heart of BC.", "text": "Suffice to say, my wife and I had a fabulous time at Grizzly Bear Ranch. Julius is an extremely knowledgeable, passionate and percpetive guide and Kristin is a brilliant chef and all-round ranch-keeper. We were blessed to have them to ourselves for four brilliant days. The Grizzlies stayed away until we were gone (clearly recognising the presence of an alpha male), but one little black bear was kind enough to stop by for some snaps and the weather was kind. The eco-cabin, in which we stayed, was cozy, comfortable and soothed by the roar of river rapids, just a short stumble from the campfire. And the food was uniformly superb.", "user": "TelLondon", "date": "August 27, 2009", "id": 38975823}, {"rating": 5.0, "title": "'Awesome'!", "text": "We can't recommend GBR highly enough and would love, one day, to head back there for some serious bear action.", "user": "ashbyLondon", "date": "August 26, 2009", "id": 38914085}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Julius and Kristin are the perfect hosts, they welcomed us to their ranch, into their lives and shared their love of this beautiful part of BC. The days are filled with great experiences and the evenings with conviviality. The home-cooked food is delicious and plentiful. The cabins are very comfortable and no expense has been spared on providing domestic amenities that can cope with such a remote spot. We knew that early August was not the best time for bear watching but we topped off our visit to the Ranch with a brief encounter with a young Black Bear a few miles down the track on the drive back to \"civilisation\". We will be back! Terry & Jackie, London", "title": "Magical experience of British Columbia", "user": "GeorgeDerby", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35371497}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "No bears - but we weren't expecting any as wrong time of year, but a fantastic break which more than lived up to expectations. A very relaxing time in wild, pristine surroundings with expert nature guidance and delicious meals. The hospitality of Julius and Kristin was far more than is normally expected of such a holiday - and our knowledge and experience of grizzly bears and rafting is much expanded!", "title": "Peace and Tranquility at Grizzly Bear Ranch", "user": "Husley", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34213817}], "location": {"country": "Canada"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 81}, "aka": "Grizzly Bear Ranch Hotel Kaslo", "slim_ranking": 0.142857142857, "description": "Grizzly Bear Ranch is a small, private lodge hidden away in a remote BC valley that offers specialist grizzly and black bear-viewing holidays. The ranch opened in 2006 and is run by Julius, Kristin and an exceptional team of experienced and certified bear-viewing guides who will take you out on foot, in 4x4s and on river rafts to view the region's bears."}