{"user_rating": 3.5, "review_count": 81, "name": "Guangzhou Bauhinia Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "This hotel is clean and comfortable; also in a convenient location to everthing. We stayed during the Canton fair, when all the hotels in the city are very expensive, the Guangzhou Bauhinia was more reasonably priced. Included is breakfast which is very basic but suffiecient. Mostly I found the staff to be helpful, there was always someone on the desk who could speak english, and there is a business center that helped us book travel arrangements and can exchange money for you, that was really helpful as language was a barrier for us. They even arranged a car to take us to the train station as the taxis don't have enough room for 3 suitcases in that city.", "title": "Clean and comfortable", "helpfulness": 2, "user": "aussiemumGoldCoast", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120441836}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Its a nice hotel. good clean rooms. I was given free upgrade to Standard room. booked through agoda. Room has free wired internet, but Wifi is preferred. Its little far from Haizhu Metro station (12 min walk) but you can reach station while looking at various shops. We wanted non-smoking , but were given on 5th floor, and after coming out of the lift, it smelled very bad. .", "title": "Good Hotel. Good Value for money. Good service", "helpfulness": 1, "user": "sanjeev_abhish", "date": "November 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120379318}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Its very near to many wholesale markets, at Haizhu Square and also near to Guangzhou Railway Stn., which has many wholesale markets.", "title": "Relaxing stay in busy city", "helpfulness": 1, "user": "ElsaJo", "date": "November 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120104165}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Buy Yang Cheng Tong (羊城通) card for travelling in Metro trains.", "title": "Not fancy but efficient and clean.", "helpfulness": 1, "user": "macbcmini", "date": "November 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120090459}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Hotel is located near MTR which makes moving around easy. Rooms are clean and pleasent. Staff is friendly and speaks english. Nice place to stay, not probably the best but we had no complains about our stay there.", "title": "simply loved this hotel... staff spoke english well", "helpfulness": 1, "user": "angeladelmar", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120002461}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I totally agree with the previous comment saying that this hotel is very calculating. But more on that later.", "title": "NEW IS NOT ALWAYS BETTER; this hotel needs improvement", "helpfulness": 1, "user": "roo e", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 2.0, "service": 2.0}, "id": 117729080}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Due to our late flight, we had no choice but to take a taxi to the hotel because the MTR is closed and the BRT is also closed. The hotel is located along Jiefang Lu, which gets a little busy during rush hour, making it VERY hard to hail a cab. Our room was paid already but they still asked for a deposit. The front desk was not the friendliest we've encountered and they SHOULD IMPROVE on that. The elevator required the room card for it to function, good for security. The hallway smelled of new paint and varnish. We had an executive room, which was rather spacious and clean. The extra bed was hard as concrete. I would have been happier to share a bed with my mom since we are really petite but upon seeing us three, the front desk made it a point to charge us an extra bed. The breakfast was really basic and repetitive, after the first day, it just gets tiring. The bathroom had no bidet, which was rather questionable because it's a fairly NEW and modern hotel. There's a construction going on the upper floors so each morning, we were greeted by THE SOUND OF DRILLING AND HAMMERING. What we really hated about this hotel is that they ACCUSED and tried to charge us of stealing two face towels and a pillow. How dare them. Why would we even take interest in their stuff? Why would we pay for something we didn't really take? It was only late and upon inspection by the manager till they realized that they really did not put face towels on the second day and the pillow was just around the corner beside the extra bed that they charged. They kept on insisting that we should pay for it and all. We were really disappointed. This hotel must undergo intensive employee training because they CAN'T provide good customer care or service. The front desk employee should first check her English before she goes arrogant on us. The housekeeper must make sure to know the root of the problem, and to open her eyes during the inspection because it occupied our time, time which we can spend somewhere productive. What if we had a flight to catch within an hour? That face towel incident will cause our delay? What is this trickery?", "title": "I really love this place and I'll be back for sure", "helpfulness": 2, "user": "circusnight", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117301286}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The location is \"convenient\". Convenient here denotes that hailing a cab takes about 10-15 minutes. Locals are not very courteous of this principle because they take the cab that you were supposedly waiting for 10 minutes for. We tried to walk to Beijing Lu, it was okay, but our legs were battered.", "title": "Convenient, clean but too calculating", "helpfulness": 4, "user": "Just_my_views", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116924891}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "They should not label their hotel as \"business-leisure\" because it's clearly for business. The hotel may be clean and new but the service is a complete juxtaposition. I think there are better hotels out there with better service and better value and not just some novice and arrogant employees who will charge the hell out of you.", "title": "Excellent value, good service", "helpfulness": 5, "user": "viaducttravel", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 105034000}], "location": {"country": "China", "continent": "Asia", "city": "Guangzhou"}, "stars": 3, "variance": {"poor": 2, "average": 18, "very good": 44, "terrible": 5, "excellent": 12}, "slim_ranking": 0.0439359267735}