{"user_rating": 2.5, "review_count": 28, "name": "GuestHouse International Hotel & Suites", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I booked a room at the GuestHouse in Upland for my Son and his young family who were coming to town for a wedding. I had stayed at the property years ago, and it was a good experience. Prior to their arrival I called the hotel several times, went by the property three times, and was shown several rooms. I upgraded the room, and the week of the wedding phoned and again went by to insure that my family was given a nice, clean room. The day they arrived was hectic, and although the room was dirty--soiled carpet, run-down, mold and mildew in the tub/shower, etc--they chose to stay rather than move to another hotel. The fees included breakfast, but when they arrived at the breakfast room the next morning--Wedding Day--the beverage dispenser was broken, only muffins were offered, and they were told that \"we are waiting for the truck to arrive with breakfast.\" Oops. No breakfast, and a long day to come... After the wedding I checked out the room my family was given and spoke to the manager and the desk clerk. The room they were given was NOT the one I had booked! I was told that there were two other rooms, and that they could move to a different room. Upon inspection, the rooms were all dirty, with soiled carpet, mold and mildew in the bathrooms/shower enclosures, and generally run down--peeling paint, poor caulking, pretty nasty. Kitchenette was small, dirty, and uninviting. Dinette was missing two chairs. All in all, a very poor experience in spite of my efforts. I would have moved them to another hotel nearby but all similar hotel rooms were booked AND the hotel would not refund our money... DO NOT STAY HERE IF YOU WISH A CLEAN, QUIET LOCATION or if you want breakfast... I later learned that although they had a smoking room several people stood outside their door or nearby and smoked, and the smoke from those \"guests\" other nearby smoking rooms was disgusting.", "title": "Worst experience in the last decade!", "helpfulness": 3, "user": "Donald I", "date": "October 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 142919024}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed four nights at this hotel and the good news isthere was no bugs. The place was reasonably clean and the pooland spa were fairly nice.", "title": "An okay place to stay.", "user": "rblbab", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 140559685}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Not so great was the breakfast was a joke. They have a dinner there, but they only serve these tiny muffins (which don't taste very good) and some 'off-color' fruits; along with coffee and juice. Also, the water pressure in the shower was not very good...but it was nice and hot.", "title": "HUGE IMPROVEMENT", "user": "Badit01", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134130376}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The UGLY...a maintance guy walked right into our room without even knocking! He said he came to fix the shower, he did fix a small leak and then left. It really bothered me that he just walked right in like that. So, I advise you NOT to leave anything of value in the room just in case.", "title": "Needs updating", "helpfulness": 1, "user": "kablasha", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 128006549}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "THE REALLY GREAT...the lady at the front desk was super nice and helpful.", "title": "Last minute stay - very helpful", "helpfulness": 3, "user": "mary g", "date": "January 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122624873}, {"rating": 3.0, "title": "Good enough.", "text": "We spent three nights here. The room was equipped with a coffee maker, fridge, microwave oven, sink and stovetop, but no tools or dishes beyond styrofoam cups. A continental breakfast is included, which the clerk at check-in neglected to inform us about (it's from 6 - 9am in a small room off the lobby).", "user": "Kitsilano", "date": "February 26, 2007", "id": 6843088}, {"rating": 3.0, "title": "A Pleasant Surprise", "text": "The bathroom was showing its age, and the carpet needed cleaning, but the bed was comfortable and you can get a nice cross-draft with front and back windows open (if you hate air conditioning like we do).", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 21, 2005", "id": 4254506}, {"rating": 3.0, "title": "Not Sure What To Expect", "text": "The small pool and spa area was pleasant. There was also an exercise room. Free wireless Internet is a nice touch.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 26, 2004", "id": 1671266}, {"rating": 2.0, "title": "Expected more", "text": "The walls could stand to be a bit thicker; you could hear the phone ringing in the next room.", "user": "topkatluvr", "date": "November 12, 2003", "id": 1483668}, {"rating": 1.0, "title": "Obnoxious desk clerk", "text": "We had stayed in this same hotel ONE NIGHT 16 years ago. At that time it was a DUMP! My husband forgot that we had stayed there when he made the reservation over the telephone, but we both remembered it as soon as we drove up. It was late in the evening and we thought that just one night wouldn't hurt us. We were pleasantly surprised. The new management has cleaned and refurbished the rooms. The bathrooms had new tile and fixtures - they look like they were done within the last year. They were nothing special, but they were cleaned each day, and were clean - not just a 'lick and a promise.' The pool was clean, the hot tub - not so clean the day we arrived, but cleaned before we left. The rooms were quiet, the beds comfortable, the staff helpful. It's a budget place to stay, but overall a good value. It's conveniently located to Upland and San Antonio hospital. There was a bike tour the first weekend we were there, but at night it was quiet. We will stay there again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 26, 2003", "id": 1422407}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "My husband and I had booked a room at this hotel due to it being close to where we needed to be for business. Upon entering the neat and spacious reception area we thought that we made a good decision in choosing this hotel for our 2 night stay....We Were Wrong. We entered the room which was dated to say the least...then we checked the bathroom and that was a mess!! Unfortunately due to the hour of the night we just decided to tough it out. The next day we debated on finding another hotel and since neither of us were familiar with the area we sadly chose to stick it out. When we returned, we came back to a room that was completely untouched! Housekeeping entered the room but never so much as emptied a trash can. I called the front desk to get the matter resolved but I got nothing but excuses - \"If there are bags on the bed they won't make the bed.\" So when there are 2 beds and only one has bags on it because it wasn't slept in the housekeeping person just takes a peek and moves on to the next room (allegedly)? Their remedy was to send a guy to our room who said, \"What do you want?\"... I said to him, \"A room that has been serviced.\" He then left and returned with a trash bag containing towels (I won't say they were clean because a hand towel had some type of stain on it), toilet paper, and some basic toiletries. Never once did an employee provide an apology or provide an ounce of customer service. If You Stay At This Hotel... You Will Regret It.... We Sure Did!!! (We also notified via email their corporate office...no response from them either....Surprised?? I don't think so.)", "title": "Save yourself the trouble!! Do Not Stay Here!!", "helpfulness": 3, "user": "imouttie", "date": "July 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 165986112}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We took a group to this place, and it was a disaster. Every room had problems. One room was over a party with strippers. One person had to change room three times because there was ants in one room and smoking in another. One person had to endure a barking dog all night. What we learned as that this place was used for section 8 housing and a lot of families were living there semi-permanently. The breakfast consisted of danish from a bag and some apples and oranges. It is not a place to bring the kids.", "title": "WORST PLACE EVER", "helpfulness": 2, "user": "Collette K", "date": "June 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 165446467}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Driving solo, cross-country (East-West) car trip. Stopped in Upland, CA to meet some people who were staying at this hotel, otherwise would not have chosen this motel. First time stay at this motel and probably the last. Requested non-smoking. Was assigned a double bed non-smoking with a small fridge. Rooms are somewhat dilapidated. The young lady at the front desk was helpful and accommodating yet slow at processing registrations. Took 15-20 minutes. Wifi okay. Breakfast served but did not partake.", "title": "Meeting Place", "user": "gonzdom", "date": "May 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 162357691}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "This hotel is in serious need of updating and cleaning. The rooms are filthy. The rugs are dirty, there was hair on the bathroom floor, and mold on the bathroom ceiling and walls. The sinks, countertops and bathtub were not very clean. I did not dare take off my shoes to walk around the room and would have worn flip flops to shower if I had brought any.", "title": "Dirty and Noisy", "helpfulness": 1, "user": "LHHWA", "date": "April 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 158399407}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "One of the worst things is that the light above the bathroom sink has a motion detector. My husband got up in the middle of the night to use the bathroom and the light turned on, flooding the room with light and waking up the rest of us. What were they thinking?!", "title": "Bugbites and mold", "user": "Gessihressi", "date": "March 18, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 154917616}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We arrived late and spent one night in the hotel, then found roaches in the bathtub. We notified the staff. They offered us a new room. We opted to leave the hotel.", "title": "Roaches in the bathtub", "helpfulness": 2, "user": "Jane B", "date": "December 13, 2011", "detail_rating": {"cleanliness": 1.0}, "id": 121705155}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "This is an older motel that has been refurbished. The rooms are on the small side, but ours with two queen beds, had plenty of space for 4 adults. There was a refrigerator, microwave and coffee maker in the room. The bathroom was very small, but clean, sink was outside of the bathroom.", "title": "Perfect Location, Great Staff, Good Value", "helpfulness": 6, "user": "msudon", "date": "June 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31590429}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "This motel is well located for people coming from the Ontario airport. It is located on East Foothills Boulevard (Highway 66), but because it sits back off the road, we found it to be very quite. The outdoor pool is small but clean and a welcome respite from the 90 degree weather.", "title": "Much worse than previous stays", "helpfulness": 3, "user": "whereyagoinnext", "date": "June 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 16620437, "likes": {"liked": "— convenience to family; comfortable beds", "disliked": "— run down; not kept up; lack of good maid service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The continental breakfast was more than adequate, considering the price of the accommodations. They had something for everyone. Waffle maker, cereals, toaster, bagels, fruit, yogurt, hard boiled eggs, juice and coffee. And the rooms it was served in are nice.", "title": "Would stay there again!", "helpfulness": 1, "user": "chrisgrand", "date": "October 8, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 5.0}, "id": 10056106}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The best thing about this place was the staff. Every person we dealt with from the front desk to housekeeping was friendly and helpful.", "title": "Decent accomodations at a fair price", "user": "TravelerKC", "date": "June 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 7870232, "likes": {"liked": "— Convenient location; overall value", "disliked": "— Sometimes noisy neighbors"}}], "location": {"country": "United States", "city": "Upland"}, "stars": 2, "variance": {"poor": 3, "average": 7, "very good": 5, "terrible": 10, "excellent": 3}, "aka": "Guesthouse International Hotel And Suites", "slim_ranking": 1.0, "description": "Hotel DescriptionLocated in Southern California just 4.5 miles from the Ontario International Airport, situated at the base of the San Bernardino Mountains, conveniently close to Mt. Baldy and just a few minutes from Rancho Cucamonga and San Dimas. Additionally, the hotel is just a short distance from all of the outdoor pleasures of the San Bernardino Mountains and approximately 30 miles to Disneyland, Knotts Berry Farm, and the Hollywood Wax Museum. Local activities include the Upland Lemon Festival, a variety of year-round activities at the Pomona Fairplex, racing at the California Speedway, including Nascar, and local baseball games featuring the Rancho Cucamonga Quakes. The hotel offers an outdoor pool and Jacuzzi, complimentary breakfast, fitness center, high-speed Internet, refrigerators, microwaves in suites, coffee makers, iron and ironing boards, and hair dryers."}