{"user_rating": 3.0, "review_count": 60, "name": "Guesthouse Inn & Suites at Vanderbilt", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "This hotel and the people who worked there (except for two) were nasty and downright rude! As we walked in, a vagrant asked us for bus money. We then arrived to a front desk attendant who kept walking away while we were trying to ask questions. No welcome. No smile. An extra blanket was pulled out, wadded up and thrown on the lobby couch for some poor requestee. The lobby was ok but the floor we were on smelled and the room smelled even worse. I don't know if it was smoke or what. After I cleaned some mysterious stains off the bathroom sink and walls myself, I then had to go to the front desk and ask for some shampoo b/c there was none in the room. The next morning, the waffle lady complained about having to make waffles, get plates, clean tables and whatever else she was required to do. If you asked for a waffle at the wrong moment -- you heard about it! I also heard it from the housekeeping staff person for our floor when I asked for a few more minutes to get out of the room. How dare I? Apparently they \"clean\" (and I use that term loosely) the rooms when THEY are ready, not when we are. I could go on but I will suffice it to say that I was happy to leave. Find another hotel !", "title": "Mean and Nasty", "helpfulness": 3, "user": "lovetotravel050", "date": "March 9, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 7007475, "likes": {"liked": "— not one thing", "disliked": "— everthing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Decided to surprise my granddaughter and daughter, who live in Alabama, with a trip to see the world famous \"Rockettes\", and then onto the Opryland Hotel for a Christmas treat. What a great location.", "title": "Great Location", "helpfulness": 1, "user": "nanapoopy", "date": "December 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6432581, "likes": {"liked": "— Location, Location, Location!!! The breakfast, and front desk staff.", "disliked": "— Although the rooms were great, the bed, for me, was hard."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Staff very friendly, made you feel as part of the family. Very neat and well kept hotel. We felt very secure in this hotel, and the shuttle service to the Grand Ole Opry, Opry Mills, and Opryland Hotel was an added plus. We left our car parked in the parking garage, and never moved it until we left.", "title": "Bait and Switch 2", "helpfulness": 2, "user": "CAhoosier", "date": "October 26, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 6014531, "likes": {"liked": "— Miss Pearl - the woman who makes the waffles", "disliked": "— the front desk staff"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "The continental breakfast was great. They had everything from cereal to making your own waffles. Which that line was pretty busy the whole time, but well worth the wait.", "title": "Nothing Special", "helpfulness": 3, "user": "irene102655", "date": "October 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4037021}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "Would defintley stay here again.", "title": "Nothing Special, but not the worst!", "helpfulness": 2, "user": "nlm888", "date": "June 17, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3571426}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed in Nashville for only one night and this hotel was a joy.", "title": "exceptional Value", "user": "LiverpoolVonny", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10018223}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The staff where incredibly friendly and helpful and the room very clean.", "title": "wondeful hotel", "helpfulness": 1, "user": "marylandarmymom1017", "date": "June 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7858406, "likes": {"liked": "— the location and the staff and the breakfast", "disliked": "— had to keep getting key card activated over again. strip bad."}}, {"rating": 5.0, "title": "A \"Vacation Oasis\" in the West End !", "text": "The entertainment in the lounge bar was good fun too.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 20, 2007", "id": 7404047}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We really enjoyed our stay here.", "title": "Many great stays at the Guesthouse", "helpfulness": 1, "user": "winbaby", "date": "March 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7153675, "likes": {"liked": "— friendliness of the staff and well kept rooms"}}, {"rating": 5.0, "title": "Guest House Inn and Suites - home from home", "text": "this hotel was way more than i expected it to be. staff was very friendly and helpful was very close to everything. directly behind the grayline tours company. very wonderful quiet hotel with a excellent very nice deluxe breakfast every morning that was delicious.", "helpfulness": 3, "user": "MillieLondonEngland", "date": "March 13, 2007", "id": 7153669}, {"rating": 4.0, "title": "Great Location", "text": "The location is great. It is only three blocks from Vanderbilt and many excellent locations are in walking distance. The room was large and has a refrigerator, microwave, cabinet space, and kitchen sink. The bathroom was very clean. The breakfast is excellent. The breakfast includes waffles prepared by a hotel employee, cereal, muffins, grits, oatmeal, fruit, juice, milk and coffee. It is much better than the standard continental breakfast fare. I have stayed there twice and have been pleased both times.", "helpfulness": 2, "user": "pcbdoug", "date": "January 3, 2005", "id": 2971964}, {"rating": 4.0, "stay_parameters": "Stayed May 2003", "text": "During the year proceeding my marriage (in August 2003), I spent many weekends at the Guest House Inn when I visited my fiance. I always had a clean, comfortable room nicely equipped with a refrigerator, microwave and coffee maker. Clean towels and sheets every time. No problems with noise coming from other rooms. With my AAA rate, I always got a very good rate as well (about $60 a night). The staff was also courteous and helpful. My only suggestion is to put a few more icemakers on the other floors beside the only one in the hotel, which is in the lobby.", "title": "Guest House Inn a hidden bargain in Nashville", "helpfulness": 2, "user": "Peachyswan", "date": "October 2, 2003", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 1373529}, {"rating": 2.0, "title": "Bait and switch", "text": "Would not honor confirmed room rate as posted on internet. I received confirmation of room and rate via internet. When I arrived at hotel they did confirm my reservation. On checkout they refused to honor the confirmed room rate even though I showed the desk clerk a copy of the confimation I had printed out. The print out gave all details of the reservation confirmation. Desk clerk did not dispute the printout but would not honor it. I do not think I will use this service nor the hotel chain again. Occured April 11th and 12th.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "April 14, 2003", "id": 934096}], "location": {"country": "United States", "city": "Nashville"}, "stars": 2.5, "variance": {"poor": 8, "average": 13, "very good": 13, "terrible": 16, "excellent": 10}, "aka": "Guesthouse Inn & Suites At Vanderbilt Hotel Nashville", "slim_ranking": 0.702702702703}