{"user_rating": 5.0, "review_count": 67, "name": "Guesthouse Mazaraki", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed in Elia (i.e. olive) suite, which was absolutely great! Everything in cream and olive colours, details of olive leaves everywhere, nice fireplace (the guesthouse provided the wood free of charge), coco-mat mattresses and products, very warm and cosy. The Breakfast was served in the room in a basket with all the food requested the earlier day (and at the time requested). All natural local products, very tasty! Close to the guesthouse is a restaurant that is related to it, called Chromata, with great food! The best we tasted in the area!", "title": "Excellent A class accommodation!", "helpfulness": 1, "user": "Interallia", "date": "August 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116415965}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "You will definitely enjoy your stay there!", "title": "Fantastic-truly a special place.", "helpfulness": 1, "user": "rebmax", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113272421}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We were on a month long trip to Turkey and Greece and we had stayed at some great hotels, but when we drove up to Mazaraki, I knew it wouyld be probably my favorite hotel on a trip of great and charming hotels.", "title": "INTERIOR DESIGNER'S DELIGHT", "helpfulness": 2, "user": "wanderingbasque", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110107206}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "First, the drive up to Mazaraki is magnificent.Up through the mountains which tower above Sparta and Mystras.(our hostess recommends coming up through Mystras, but we didn't get that message due to e-mail problems on my part. Either way the drive is magnificent.) We pulled up ( very easy parking as there are few people about) and the Guesthouse was perched on a high hill (mountain?) with magnificent views over the town of Mystras, Sparta and moist amazingly the fort at the historic site of Mystras. We were blown away.", "title": "Beautiful guesthouse", "helpfulness": 1, "user": "UtrechtAnke", "date": "December 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91215743}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Next, the Guesthouse itself is charming. Several 2 story creamy local stone cottages climbing a very gentle hill. All cottages face the magnificent view and have wonderful (and good sized) patios or balconies (with chairs,tables and candles) on which to have breakfast, cocktails or just sit and drink it all in. (There are only 4 or 5 cottages each with only 2- 4 units, making the place very intimate. No big tour buses here.) The cottages are new, but built by artisans with ages old stone techniques.The grounds are also charming, with stone walls, olive trees and roses (in bloom when we were there).", "title": "A little paradise in the heart of the Peloponnes", "helpfulness": 1, "user": "kizkouz", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84640195}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The view over the Sparta valley to the mountains is breathtaking; the stone houses are stunningly beautiful with attention to every detail, including a delicious breakfast. Staying here was an incredibly aesthetic experience and Asimina's welcome was very warm & gracious. The open fire on an inclement day was simply gorgeous. To be so close to the extraordinary Byzantine town of the Mystras was simply wonderful. The Mystras was a highlight of our travels and staying at Mazaraki is an experience not to be missed!", "title": "A magical experience in the Mystras", "helpfulness": 1, "user": "Peter_Joan", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120186321}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The Mazarati Guest House is the most wonderful rental we have had, over many years of experience. You can believe the pictures of the rooms. The view of the valley and Sparta below is spectacular. The quiet is profound (the buildings are 50 yards from the road, but there is almost no traffic) We have never had such over the top hospitality. The Guest House is very near the Mystras ruins, an extremely captivating acheological site. Some wonderful hiking near by. This rental get an 11.", "title": "The best!", "helpfulness": 2, "user": "Paul787", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119870182}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed at Mazaraki for 2 nights beautiful guesthouse and quiet location, we also ate at the restaurant up hill, so serene at night and good food!", "title": "Very nice", "user": "BickRoss", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119072717}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I can only say, the revues are all true.", "title": "A Real Treat", "helpfulness": 1, "user": "petlin561", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118803386}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "But to top it off, we went up the hill to the affiliated restaurant (great view, lovely people,very rustic) and enjoyed the best food we'd had on the trip. But take cash as no card facilities.Don't miss it!", "title": "A very nice place", "user": "Jaco1969", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 116508846}, {"rating": 4.0, "stay_parameters": "Stayed March 2010", "text": "A nice stone-maded place good located near to Mystra's archeological area with a wonderful view to the Eurota's valley and city of Sparti. You have the oppurtunity to visit Mount Taygetos and have a great time to the greek nature. The building is match perfectly with the surounded nature and offers you a relaxing holiday.The rooms are very comfortable , clean with different designed theme in each of them. Breakfast is hand made with traditional products.The stuff is very kind ,hospitable and ready to help you .Nearby in walking distance there is a modern ''tavern'' -Chromata- that you can taste greek traditional and modern suggestion , its not a suprise that the restaurant belong to the same person!", "title": "Relaxing in Mistra", "user": "thanos1979", "date": "June 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67012979}], "location": {"country": "Greece", "region": "Peloponnese", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 8, "terrible": 0, "excellent": 59}, "slim_ranking": 0.333333333333, "description": "The Mazaraki Guesthouse is located in Pikoulianika, the nearest village to the castle of Mistras. This superb location is at a distance of 230km.away from Athens (approximately 2 ½ hours drive) and 4km. away from contemporary Mistras and 9km. away from Sparta. It is located at an altitude of 600m., in a wooded area with an abundance of mountain springs and streams,overlooking Byzantine Mystras,the valley of the Eurotas river, in addition to Sparta . Built to the highest standards,it combines superb contemporary/traditional design."}