{"user_rating": 4.5, "review_count": 158, "name": "Gurda Tango Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "My wife and I stayed at the Gurda Tango for almost a week and were thoroughly impressed with virtually everything except the neighborhood.", "title": "Quaint hotel, great staff, great location, average neighborhood", "user": "Bird_Eyes", "date": "March 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59698546}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Location:", "title": "Tranquil, charming B.A. base", "user": "GTPhoneHome", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59486348}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The hotel is conveniently located in the historic San Telmo neighborhood of Buenos Aires. You can walk north to Centro (which includes the Casa Rosada, Plaza de Mayo, etc.) in just 20 minutes. Walking south about 10 minutes you'll reach El Caminito and the Boca Juniors soccer stadium. There are several restaurants and ice cream parlors nearby, along with a laundromat around the corner ($12 pesos per basket for wash and dry) and a place on the same block for a 90-minute evening tango lesson for $25 pesos per person. Several bus lines pass by the hotel within just a couple blocks. You can use the bus/train system to get anywhere in Buenos Aires. If you plan to use it extensively, I recommend purchasing the locally-sold Guiate which includes a detailed map of the capital and lists all the bus routes (there are hundreds of bus lines) so you know exactly which bus to use and where to get on and off.", "title": "The staff of this hotel could not have been more helpful", "user": "killenbeck", "date": "March 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58683571}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Neighborhood:", "title": "Best place in San Telmo", "user": "MiguelNewYork", "date": "March 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58542646}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "The neighborhood is my only complaint. Although substantial litter and graffiti are commonplace in Buenos Aires, the street the hotel is on and the surrounding area are, unfortunately, no exception. The area felt safe during the day, but I was somewhat wary to take my wife out at night (I lived in Buenos Aires for several years so I feel like I can be fairly objective about the neighborhoods). We did go out at night, but felt like we had to be aware and cautious. It wasn't a bad neighborhood, but it didn't feel above average either for the touristic areas of Buenos Aires. Use common sense and good judgment.", "title": "Outstanding service, great location", "user": "pedrotheviking", "date": "March 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 58293016}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Karina and Karolina were both a pleasure to deal with...... they made our visit to BA a wonderful experience, giving us advice and recommendations.", "title": "super service", "helpfulness": 1, "user": "k1k", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 57891882}, {"rating": 5.0, "title": "Great location, great hosts, comfortable rooms", "text": "Breakfast was good, with fresh fruit in season.", "helpfulness": 1, "user": "Annaram", "date": "January 31, 2010", "id": 54855894}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Our room was small but adequate and really quiet.", "title": "It's True, the Service is Outstanding", "helpfulness": 1, "user": "AmatuerTraveler", "date": "January 18, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 53793169}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My friends and I stayed at the Gurda Tango Hotel for 3 nights, the first night being New Year's Eve. We booked this hotel based on Trip Advisor reviews and were very happy with our stay. The hotel is in a great location and we were able to walk to many areas, including La Boca and the Plaza de Mayo. There are many good restaurants in the area and the hotel is about 2 miles from Puerto Madero which has a lot of excellent restaurants. Karina greeted us when we arrived and gave us an excellent overview of the city and marked a map with all significant areas to visit. All through our stay we were made to feel warmly welcomed by Karina, Karolina and Norma. They were also very helpful with recommending and making reservations at restaurants, a tango show, etc. Our rooms were very clean and comfortable and roomy. There was a good selection of items available for breakfast: eggs, cereal, pastries, bread, juice, coffee, tea and more. I will definately stay at Gurda Tango again if I return to Buenos Aires.", "title": "Wonderful staff", "helpfulness": 1, "user": "henry1003", "date": "January 18, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53782729}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I am always impressed when a hotel staff person takes a chunk of time to provide sightseeing assistance. The staff at the Gurda Hotel was immensely helpful. If you are an independent traveler, you know that an efficient day of sightseeing usually means preparation. Well run boutique hotels such as this one help you maximize your valuable time, making arrangements and providing useful insights. The room we had was clean and comfortable. It was also a bit quirky with an odd loft providing a second bed. A more ideal location would be closer the main square in San Telmo, but the 3 or 4 block walk was fine by us.", "title": "Made to feel like a visiting VIP", "helpfulness": 3, "user": "Casualist", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 53667801}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Well-located across from Parque Lezama, next to cultural centers and charming restaurants, the hallmark of this hotel is the personalized service and attention provided by its staff in all ways. The rooms are average, facing onto an outdoor hallway, somewhat dark and without cross-ventilation, but for the price it is an adequate, comfortable place. One really feels at home here. The staff caters to the rhythms of the guests, not vice versa. San Telmo is very charming and interesting, from the street vendors to the high park and parillas. The streets are entertaining all the time. We recommend Cafe Lezama for its good parilla and other items. Check the calendar of Torque Tasso a few doors down for good nontouristy cultural events.", "title": "Personalized attention is its hallmark", "user": "vanholt", "date": "May 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 65655744}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "A faultless hotel with excellent attention to all of our needs. Location opens on to the cobbled streets of historic San Telmo & is only 20-30 minutues walking distance to many city sights including La Boca.", "title": "A home from home with an excellent location", "user": "Alan031", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 65020193}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "A selection of great parillas are only a stone's throw away.", "title": "Simply the Best", "user": "kingpinneworleans", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64550167}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "My girlfriend and I stayed at the Gurda Tango Boutique Hotel on our 8 day visit to Buenos Aires. This small intimate hotel was a great find, located in San Telmo next to Parque Lezama and just 5 blocks from Plazza Dorrego, home of the lively Sunday antique market. The wonderfully bohemian location was great, but it was the professional and helpful front desk staff that made our stay so comfortable and enjoyable. Karina, Carolina and Florenzia had a wealth of knowledge about Buenos Aires and were so willing to take the time to share it with us. They were always on target with their advice on restaurants, bars, bus routes etc. etc. Simply the best!", "title": "All we can say is wow!!!", "user": "Danswed", "date": "May 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 63883635}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "After looking at a number of hotels and not finding what we were looking for,we Came across this beautiful place with awesome staff and after a 4 night stay we could't be happier we the choice we made. The hotel is located in a historical building full of charm and it is an oasis in a hot and bustling city. The room was spotless clean with high quality furnishings, and very quiet. The service was out of this world. The staff, specially Karina and carolina, are so charming and fun to talk with and yet very professional and knowleadgable. They couldnt do enough to make us feel comfortable. Thank you all! We'll come back!", "title": "Wish I could have stayed longer...", "helpfulness": 1, "user": "kaybee_7", "date": "May 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 63465676}, {"rating": 5.0, "stay_parameters": "Stayed January 2010", "text": "We stayed here over the New Year and my daughter even celebrated here 12th birthday at the hotel. The rooms are lovely--all with a different theme. The beds are comfortable, rooms spacious (by city standards), the breakfast is varied and interesting. The hotel is quiet and we slept very well. The neighborhood is safe and fun--there is plenty to see and do and there is some excellent shopping in the area.", "title": "Top Notch", "helpfulness": 2, "user": "Washboardmary", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53366403}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Do eat at the Hippo on the corner--great food and atmosphere!", "title": "Awesome service, great location, romantic place!", "user": "mountainman1968", "date": "January 7, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 52807983}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "But the most important thing to mention is that the staff is incredibly friendly and helpful. After a long flight, they are there to make you comfortable and help you relax. This hotel is a must-stay.", "title": "Superb service in a wonderful hotel", "helpfulness": 1, "user": "YOW76", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52350995}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "We miss Argentina already! Buenos Aires rivals Paris for food, fashion, and pure class.", "title": "The charming staff made us instantly feel at home.", "user": "JuanyPam", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 50465112}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My wife and I, and Brother and his wife spent 4 nights at this charming boutique hotel in BA located in a special neighborhood called San Telmo. Lots of amenities, restaurants, boutiques, and things to do in this area. Also it's only a short cab ride to the more bustling parts of BA.", "title": "Great value, outstanding service", "user": "DBK_L0nd0n", "date": "November 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50031224}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "variance": {"poor": 2, "average": 5, "very good": 40, "terrible": 0, "excellent": 111}, "aka": "Hotel Gurda Tango Boutique", "slim_ranking": 0.152272727273}