{"user_rating": 4.0, "review_count": 3068, "name": "H10 Rubicon Palace", "reviews": [{"rating": 4.0, "title": "Great Hotel", "text": "Spent 1 week at the Rubicon Palace hotel. We had read the reviews of the Hotel before we went so we knew what to expect. We booked flights with Thomas Cook and the Hotel with Relaxabroad and think we got quite a good deal. We went All Inclusive. The Hotel is situated in Playa Blanca but is quite a walk into the centre but a taxi only cost us a few euros so it wasn't a problem. The Hotel itself was very nice lots of pools and a spa plus the food was very good with lots of choice. The entertainment team were fab too but the rooms were quite basic and in need of updating. This did not spoil our holiday and we would go back.", "helpfulness": 14, "user": "MB40", "date": "October 31, 2006", "id": 6033489}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I picked Lanzarote as we wanted a holiday in october, not too far from home and with good weather. On looking through the guide book after booking the holiday i was disappointed, the island didnt seem to have much to offer in the way of beauty and scenery, so it was with trepidation that we arrived.", "title": "above expectations", "helpfulness": 8, "user": "ooop", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6028376, "likes": {"liked": "— clean, spacious and wonderful view.", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Firstly the hotel was wonderful, we had a seaview room, with two large double patio windows, a large balcony and the biggest bed i have ever seen. The room was spacious, brightly decorated and spotlessly clean. The view from the balcony was looking over one of the 7 or so swimming pools, this was a quietish one which pleased us.", "title": "Bit of a disappointment", "helpfulness": 8, "user": "Wedded", "date": "September 28, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 5885336, "likes": {"liked": "— The Venecia Restaurant", "disliked": "— Too Many Children, Not Luxurious Enough, Too Big Of A Hotel Resort"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The food, entertainment, staff etc were all of a high standard. It didnt bother us that it was mainly in Spanish.", "title": "fantastic", "helpfulness": 4, "user": "yorkshire", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5809672, "likes": {"liked": "— comfortable", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "There were a lot of families with babies in pushchairs and toddlers, all fitted in with the rest of the holiday makers.", "title": "fantastic all round", "helpfulness": 7, "user": "msflocks", "date": "September 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5800181, "likes": {"liked": "— spacious clean quiet", "disliked": "— long walk from main parts of hotel"}}, {"rating": 4.0, "title": "Much better than expected", "text": "We chose this hotel after reading the reviews on here and comparing with other hotels on the island. We then found an excellent all inclusive deal with Travel Republic. It turned out to be much better than we expected. First impressions were incredible. It looks stunning compared to other hotels on the island. Our room was huge and very clean. Staff were all very friendly. Plenty of activities to do within the hotel. Spa was nice and relaxing. Lots of food and drink although the buffet did start to taste a bit bland towards the end of our holiday and there is a lack of decent cocktails on the menu. There is one complimentary night of dinner in the a la carte restaurant which was very nice. Night entertainment wasn't to our taste as it was catered more towards middle-aged/elderly and the very young kids. Overall, a very good valve for money hotel!", "helpfulness": 3, "user": "nutmeg321", "date": "January 25, 2013", "id": 150612259}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This was our fifth stay (two weeks, all-inclusive) at the H10 Rubicón Palace and each stay seems better than the last. We had a lovely sea view room and- as H10 Grand Class Club card-holders (via points accrued from our repeated stays at H10 hotels), and especially because of the generosity and kindness of various staff members, we had lots of perks which helped to make our stay so lovely. We were treated like royalty. We always make an effort to get to know the staff as individuals, not just as ‘employees’, and to show our appreciation for their efforts, courtesy, care and friendship. They make us feel special.", "title": "Another fabulous stay", "helpfulness": 3, "user": "a2b2a", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150610271}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "No hotel is perfect, and no hotel can please everyone equally, but the fact that we had such a wonderful stay, and that the hotel was full during our stay, is evidence that the management and staff are doing quite a lot of things ‘right’. We heartily recommend the H10 Rubicón Palace. This memorable holiday was particularly welcome after a difficult time we had been through following the death of my wife’s father.", "title": "An Excellent Holiday!", "helpfulness": 1, "user": "Ian-king32", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150579019}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We have just returned from a two week all inclusive break. The food is excellent although the restraunt does get very busy at peak times. The professional shows were all very good, although the shows put on by the animation team were mediocre, best spend those evenings in the Piano Bar where some very good musicians and singers entertain. We found all the hotel staff friendly and efficient. The animation team use a tannoy system near the pool which is far too loud and can be heard throughout the hotel grounds, which are massive. Why they think the whole complex wants to hear the bingo numbers or them singing 'In the pool' baffles us!", "title": "Excellent week - shame about the pools.", "helpfulness": 3, "user": "Ady M", "date": "January 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150562226}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Have just returned to the UK after staying at this wonderful hotel for a week with my wife and daughter who is two years old next month. The weather was as expected for January with the the last three days mainly overcast and very breezy which seemed to affect a lot of other guests attitudes in a negative way. The food was plentiful, if not a touch bland and most options were catered for. The highlight of the holiday was undoubtedly a combination between the entertainments team and to all who worked within the Miniclub team who kind of operate under the same umbrella. Pier (head of ents team) deserves a special mention for being able to keep a crowd of people laughing out loud in three superfluent languages, none of which are his native tongue! Hats off too to the FRAM (French animation????) team for their selfless dedication to the effort. Again the Miniclub was a revelation. We wasn't aware before travelling but you can actually leave your child (ages 1-3) for up to seven hours a day with this reliable team. Although we chose to stay with our daughter throughout the holiday we still used all the excellent facilities that the nursery had too offer. Unfortunately, there is a downside to the holiday. The bar staff were generally unmotivated and quite dour in demeanour which I do sort of understand after listening to the way many of the customers spoke to them. However, I can find no reasoning to ease my disappointment over the temperature of the swimming pools. Before travelling, and possibly my main reason for booking this particular hotel was the picture in my head of my daughter dragging one or both of us up and down that slide relentlessly, until exhaustion kicked in. Alas this was not to be. The water was far too cold to be in before turning blue after a minute or two, the sea was considerably warmer. On a final note, we met a lovely family from Kent ( a similar make-up of our party) and was asked on the coach back to the airport \"Would you book this hotel again\"? My response: \"Not in Winter\". Because of the pools, not the weather.", "title": "wonderful hotel", "helpfulness": 4, "user": "1ScarletRibbons", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150540474}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We have stayed at this hotel on 2 other occasions and the standards and cut backs were very apparant, the food was very good but the service towards english guests was very poor Spanish guests come first, on almost every time i was waiting to be served not once in 2 weeks was i served in the correct order queue they don't know the meaning of the word, the rooms are looking tired and basic the wardrobe space for a 2 week vacation is not good, if you have 4 in a room you have to live out of your suitcase, the entertainment is the biggest dissapointment mainly in spanish, after complaining they said we have had many complaints maybe they will rectify this for next year.", "title": "very dissapointed", "helpfulness": 2, "user": "Gerard49", "date": "September 6, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 5774348, "likes": {"liked": "— very little", "disliked": "— the accomodation"}}, {"rating": 3.0, "title": "good for a week", "text": "On my honeymoon, first time to Lanzarote, Canary Islands for the both of us. reading other reports on here i wouldn't say dont go there or stay away. its great for a quiet break away with very little to do if your after a rest its the place. Food was great, room great,", "helpfulness": 12, "user": "EunanOD", "date": "August 23, 2006", "id": 5701134}, {"rating": 5.0, "title": "difficult to fault", "text": "I found the Palace to be geared more towards spanish guests oh and guests that are all-inclusive, trying to get served at the bar became difficult 'people with wrist bands come first.' this did happen. seemed reluctant to serve you with no wrist band i found this strange when the only business on the island was tourism !!", "helpfulness": 8, "user": "morseey", "date": "August 18, 2006", "id": 5622175}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "waiting staff where great all ways on the ball just a little problem with no english But i'm not at home so we can't complain.", "title": "A Great Holiday", "helpfulness": 16, "user": "kazmat", "date": "August 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5608320, "likes": {"liked": "— Spacious and Luxurious", "disliked": "— Request a Sea view if possible."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Dont get me started on the sun beds beside the pool it was the same poeple that had them reserved all day everyday, one day i decided do get down early and join the Rat race and put my towel on a sun bed 7:30 i was down and i'l tell you must of them where reserved already... i expected this from a 3 * * * hotel not a 4star. we went here cause of the great pools at the hotel but it makes you angry that you have to get up at 7:30am on your holiday to reserve a place. towels laid on beds for hours on end Hotel staff NEVER check NEVER.", "title": "Brilliant holiday", "helpfulness": 10, "user": "Brodazz", "date": "August 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5575047, "likes": {"liked": "— The food and swimming pools", "disliked": "— Spanish entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My wife & I have just returned from 1 weeks all inclusive at H10 Rubicon. The hotel is very good, beautifully laid out & right on the promenade - walk to Playa Blanca is 45 mins. Room we had was large, clean & well equiped (fridge a must have!) Staff stated that temperatures had reached 46 degrees the previous week but it was 23 to 27 degrees for our week so nice for us. Cloudy mosts days and very windy most days. However this did not spoil a really enjoyable week. The piano bar is an excellent place to chat & relax in the evenings. Food was good - sometimes very good. Always someting to eat - loads of prawns, mussels & fresh fish with themed nights on some nights. Staff are all very friendly & helpful. Being \"all inclusive\" but not \"priveleged\" (cost E20 pp per night!) sometimmes felt like a second class citizen as not allowed into restaurant etc but not too noticeable overall. Glady recommend & wife & I are planing to go back next year - when weather not so windy! Thank you for a good break.", "title": "Windy City", "helpfulness": 3, "user": "AstonClintonMackem", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130573282}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Great hotel, the pictures dont do it justice. Got a cheap flight from Ryanair, transfers via lastminutetransfers.com (only cost 40 euros return), 20 min drive to the hotel, and stayed 7 days half board. First night was fine, however signing for drinks at the bar became tiresome, and cut into our valuable drinking time - so opted to upgrade to all inclusive (cost 22 euros each per day). This was much better, and it seems most people are AI anyway.", "title": "Fab break!", "helpfulness": 4, "user": "charrison77", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 130469267}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Hotel has 5 pools, we prefered the smaller one with a waterfall near the dive center. There is a full week of activities set out, with lots to do for the kids. It is a very family orientated place, so if you prefer peace & quiet, maybe not the place for you (were were young couple, no kids). The rooms were great, i signed up to H10 membership and emailed in advance - got upgraded to a premier room, with all the trimmings. We were in room 9926 above the Volcan restaurant. Ignore the bad reviews, we had no problems sleeping and no noise at night.", "title": "Nice holidays", "user": "JeanL579", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 130430285}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "There are two main restaurants for buffet meals, i have incuded pics of typical days food, even the most fussiest of eaters will be fine, as there is plenty of choice.", "title": "Rubicon @ Easter", "user": "Steven L", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 130384027}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Outside the hotel is limited without a car - we didnt bother but there are hoards of rental places at the airport if you fancy it. Playa Blanca is a 30min walk from the hotel, with a nice beach and a nice Irish bar (The Irish Anvil), not much more - the rest is the usual brits abroad type shops and cheap restaurancts.", "title": "A hotel to suit families and couples", "helpfulness": 4, "user": "helen2122", "date": "May 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130370144}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Just returned from one weeks stay at Rubicon Palace. Excellent hotel very sprawling but could easily find our way around. Liked the fact that rooms were dotted around and no long corridors of rooms. We were opposite the large pool but was very quiet at night and slept well. Entertainment in Piano Bar was good but not our taste in the family bar ok for the kids though. Food excellent second half of week got really busy felt they should have opened up the second restaurant earlier to deal with the rush at lunch times especially. Overall a very enjoyable week and would definitly return.", "title": "Time to unwind", "helpfulness": 3, "user": "Janet P", "date": "May 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130332653}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "just enjoyed a week here and wanted to stay on for more. ive never wanted to go back to same destination before, let a lone the same hotel but this one could certainly twist my arm maybe for two weeks next time. I have twin boys 3yrs old and they loved the drop in kids club and the evening entertainment too. Hotel was huge but didnt real too large just giving you space to move around and explore. food was fantastic each day couldnt be faulted, even kept children happy. Perfect holiday, staff were lovely and accommodating. we changed rooms to be closer to friends that were there and this was done with no issues, smiles all round. Rooms were cleaned daily, immaculate. we had spa treatments and although pricey so worth it", "title": "Just enjoyed a week here", "helpfulness": 2, "user": "sammyxxxx", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130215596}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We had an absolutely fabulous time at this hotel. As we arrived off our shared transfer we were greeted with a very friendly recepionist and reception drinks. Even though it was one o'clock in the morning! Having champagne on arrival really made the experience fantastic. Me and my friend I went with were 19 and felt thoroughly looked after!", "title": "Such a lovely hotel and a lovely holiday.", "user": "emca32", "date": "May 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130207235}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The food was very good. Being all inclusive meant we could do as we please. The only reason I gave this hotel 4 stars is because as part of your stay at the H10 Rubicon Palace you get a complimentry evening meal in their Italien restaurant. The Italien restauarnt was such a lovely setting but the food howevere was not great! We had to send our food back twice. I am not fussy when it comes to food but the lasagna we had ordered was cold, we then sent it back and it came back coiling hot but then we tasted it and it was all mushy as it had been in the microwave too long! It is such a shame as the buffet and over places to eat there the food was fab.", "title": "Very Relaxing", "helpfulness": 3, "user": "magsmcdermott", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 130153532}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We had a fantastic holiday and would return again and again.", "title": "Relaxing break to re charge", "helpfulness": 1, "user": "Slinnie", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 130145528}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Since january i have been keeping a close eye on the reviews posted on this website for this hotel & i pormised no matter if it was good or bad I was going to write a review when i got back!", "title": "Fantastic Place!!", "helpfulness": 10, "user": "Fiona_Mor", "date": "June 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5360041}, {"rating": 5.0, "title": "Fantastic time had by all", "text": "We've just returned from one week all inclusive at the rubicon palace in playa blanca. This was my familys 10th time in Lanzarote. We've stayed in lots of four star hotels and really found this to be by far one of the best!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 13, 2006", "id": 5339547}, {"rating": 5.0, "title": "Best Place vistsited inn my life!", "text": "When we arrived we were taken on a mini train journey from the main bulding to our room which was one the club palaces on the sea front. We had two rooms one was a twin & the other was a double they were both very spacious & confortable. We were on the ground floor & had a small problem with ants but we informed receiption & that solved that! Other than that the rooms were very clean!", "helpfulness": 4, "user": "masterreviewer", "date": "June 13, 2006", "id": 5339509}, {"rating": 5.0, "title": "Fantastic holiday!", "text": "The pools again were very clean in all I counted eight pools. The Main pool is actually three pools that are seperated under the bridges! One of which is heated we didn't spend much time in that one. I found that the other pools weren't that cold. There is a problem with getting good beds around the main pool alright! But we had an earily riser in our group who got up at eight every morning so we always got the bed's we wanted.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 10, 2006", "id": 5329055}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The food was great very tasty & lots of choices we had everything we needed and more. The staff in the restaurnts were good but very busy as the amount of people in this hotel was huge. But since we were all inclusive there was a help urself service on the drinks which taste just the same as at home no difference. I don't drink but The others found them to be excellent not watered down as stated in another review i read recentally.", "title": "Fantastic holiday!!!!!", "helpfulness": 18, "user": "Gemma28", "date": "May 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5203887}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Nice hotel, clean and well maintained, huge space to walk around and few swimming pools around the big garden so never gets too busy. Nice polls for children one with a pirate boat to keep them busy. Good choice of food, drinks and sacks, everything delicious :) Almost an hour drive from the airport. Beautiful views towards the ocean, nice to walk outside towards the harbour. cheap and easy to get to he harbour by a taxi. Friendly stuff.", "title": "Good hotel, great food.", "helpfulness": 5, "user": "HendonLondon", "date": "May 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 131039190}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "this is our second trip to the Rubicon Palace and we really enjoyed it again. Check in was well organised and our bags delivered to our room while we had a drink (nice touch). Good value for money, the food is very good and there is always a lot of choice. Good range of drinks available including some international brands. there is a piano bar, a show bar and a pub on site which is also inlcuded in all inclusive. Two evenings there were theme nights in the courtyard, at which there was entertainment, drinks and food from the theme countries, a nice touch.", "title": "Good hotel, value for money", "helpfulness": 4, "user": "mersey21", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 130969973}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "the only criticism I have is this visit, the pool bar has stopped allowing self service on beer and soft drinks and this has made queueing a problem during the day.", "title": "How sad to see a once great hotel in decline", "helpfulness": 4, "user": "turfc", "date": "May 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 130885176}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Rooms are airconditioned, large and comfortable, with flat screen tvs and some english TV channels available.", "title": "Wont find a better hotel", "helpfulness": 5, "user": "Hazel B", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130836123}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "overall though good hotel, value for money and good service and I would recommend.", "title": "Excellent hotel", "helpfulness": 3, "user": "AndyC24392723", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130795457}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Check in was poor, we waited for 55 mins to be checked in, drinks were offered on arrival but processing the check in was very slow even though there were 5 desks open. We were then told to get on the train which would take us to our rooms but by this time it was full. A full scale argument errupted when someone got really cross as they had been sitting on it for 25 minutes. Eventually we were put in a car to be driven approx 2 minutes!!! But this is my only complaint about the hotel.", "title": "Nice hotel, shame about the resort", "helpfulness": 3, "user": "S.S.S.M.L.A", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150920301}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Our room was very nice, clean and comfortable. The bathroom was good with an impressive shower, clean towels every day if you want them, toiletries were good too and replaced every day.", "title": "Excellent holiday", "helpfulness": 3, "user": "Mar078", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150917913}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Food and choice of drinks was very good, but I did think that there wasn't enough staff in the Piano Bar, they were rushed off their feet and some people got a bit cross but I felt sorry for the staff as some of the customers treat them very badly - manners go a long way and get you served quicker!", "title": "Great, We are booking again for the summer", "helpfulness": 1, "user": "lee6590", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150913413}, {"rating": 5.0, "title": "Smashing", "text": "The hotel grounds and swimming pool were really lovely, pools and patio areas were cleaned every day.", "helpfulness": 1, "user": "Harry_R_Soles", "date": "January 27, 2013", "id": 150781453}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The food was good and varied, a choice of restaurants opening at different times of the day so there is always somewhere to get food and drink. You won't go hungry here, we had our A'lcarte meal which was lovely, good menu and the food was piping hot and service was very good. If you fancy a night out away from the hotel there is an Argentinian Steak house within walking distance along the promenade which we decided to visit - lovely food.", "title": "perfect winter break", "helpfulness": 6, "user": "lynnmills17", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150773333}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Just back after spending a week at this fabulous hotel. Have to say that the check in was quick and professional complimented by a glass of champagne .Our room was of excellent size and a great view from the balcony over looking the sea.We used the all inclusive option from the package and to be fair we were not disappointed with our selection.Food was excellent all the time and a full activity theme was available day and complimented with music in the bar every night.There is also a sports bar on sight and a cinema .Included in the complex are two swimming pools complete with pool side bars. The rooms were attended to every day and the whole hotel was immaculate .As this holiday was in January we were surprised at the amount of activity that was available . Just to make people aware this hotel is about twenty minutes walk along the sea front from Playa Blanca. There is a local bus every twenty minutes just at the entrance to the hotel to Playa Blanca centre and then goes on to the local port with it fabulous restaurant . A great weeks relaxing holiday with a excellent hotel .Well done to all the staff there", "title": "Excellent hotel", "helpfulness": 3, "user": "Berlitz", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150760545}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed at the Rubicon Palace 17-1-2013 --- 25-1-2013, this was our first time in Lanzarote and what a hotel to choose! We went all inclusive and privilage and it was well worth the extra money. The room was gorgeous, the view of the sea and Fuerteventura was fabulous, the privelage louge is a nice peaceful quiet place with a self service bar and all branded drinks, also at all other bars whenyou are privalege you get served branded drinks. The staff are very friendly and helpful, nothing is too much bother for them,the animation team are fantastic and work very hard to make sure everyone enjoys themselves. Heated pool is fine but main pool was very cold but it was january! Food was gorgeous always plenty to choose from, we had a few cloudy days, a few spots of rain here and there, and a bit windy but still warm enough to come home with a nice tan. All in all had a fabulous week and are looking to go back for 2 weeks next January.", "title": "absolutely fabulous hotel", "helpfulness": 1, "user": "tracyandwilly", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 150732359}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "My family and I stayed at this hotel last week and found it be lovely. Cava on arrival while waiting on the train to take us and our luggage to our room, great idea the kids loved it! Rooms were immaculate and very large. Hotel grounds are beautiful a pleasant walk every morning to go to breakfast. Food at the hotel is lovely fresh omelettes every morning made by a chef as well as fresh pancakes plenty of fresh fish and salads, meats soups breads etc even the desserts are great which is unusual as I usually don't like the desserts on holiday. We were all inclusive which we found up to a High standard- some cocktails are included as well as some branded spirits. Entertainment is great the blue team work very hard and get most people involved. Shows at night are brilliant but we found the kids club to be the highlight. Out daughter loved the kids club and mini disco at night with daisy. They do a brilliant job entertaining the children it is definitely a family hotel. The hotel is a short walk from playa blanca and is a lovely walk along the sea good to burn off all the extra food! Staff here are very helpful and a trip to the spa is recommended! We are already looking to book another holiday here again.", "title": "Fabulous hotel", "helpfulness": 4, "user": "Claire-Louise W", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150722421}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The possitive things about the hotel is that,the food is good,great animation for the kids and older people.Clean rooms and a verry nice service at the reception where you can ask all kind of questions.The only down side of it is it's location,if you want to go to the center you need to take a taxi or bus,but if you want to see the island the cheapest way is to rent a car and find out of your own.I had a car for one week for 100 euro's.", "title": "Verry good stay !", "helpfulness": 3, "user": "gunk67", "date": "January 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 150706560}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Visited in Sept 2012 with husband and two kids, 6 and 2. The hotel is spread over a vast area, you have to get a little train on wheels to your room. Having said that, rooms really nice, lovely views of sea. Five pools in all, great pirate ship pool for the kids. Restaurant lovely and food good and varied all week. lots of different bars. Midstream were mixture of nationalities, Italian and Spanish, really nice and lots to do. Kids disco extremely repetitive, but aren't they always? Overall, would highly recommend.", "title": "Lovely hotel, great holiday", "helpfulness": 5, "user": "CatherineRipponden", "date": "January 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150660169}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "had a fantastic family holiday at the Rubicon, we had a junior suite on the bottom floor and could walk right out to one of the many swimming pools, we where AI which is good especially if you have kids, spotless clean hotel , food was ok there was always plenty to chose from, would certainly recomend the hotel to others", "title": "great family holiday", "helpfulness": 1, "user": "foxylady2010", "date": "January 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150519519}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Christmas in the sun. A new experience for the whole family. Older teens and 5 year old twins.So it was with some trepidation that we began our 11 night stay. We should not have worried. From start to finish it was a complete success. Accommodation, location. staff, food, entertainment, facilities were all 4 star plus. Particularly good were the Miniclub, which we could not drag the twins away from, and the childrens pool area. The miniclub team here were excellent and worked really hard even on Christmas day ! Our older girls and my husband had a great diving experience. and even though the hotel seemed huge the lay out of pools, gardens, terraces etc, meant that that you felt you were in a much more exclusive environment. The Christmas gala dinner was also excellant although lacking sprouts!!", "title": "\"Simply had a Wonderful Christmas Time\"", "helpfulness": 2, "user": "Andrea_G24_13", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150515124}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We will be recommending this hotel to everyone we know wanting this sort of holiday.", "title": "Wonderful holiday", "helpfulness": 2, "user": "Jenniferedith", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150487841}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Thank you and well done Rubicon palace.", "title": "Good hotel but no heated pool at all!", "user": "Paula M", "date": "January 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150485021}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We visited the second week in January with our daughter, partner and baby grandson. This hotel was first class and excellent value for money We booked through Thomas Cook and this was our first ever all inclusive holiday and we were not disappointed. The hotel and our room were spotlessly clean. Our room was very spacious (a large 6ft wide bed) flat screen TV with a lovely balcony accessed from 2 sets of sliding patio doors. The bathroom had a shower, bath, toilet, basin and bidet. Also a nice selection of toiletries. We had requested a quiet room and and the location was perfect with a lovely south facing balcony. The restaurants were fabulous and the choice of dishes each day was varied and delicious. I agree with a previous critic who said the Chef’s deserve a pat on the back. The menus reflected the fact that they are catering for the Spanish, German, Dutch tourist etc as well as us Brits. There was no shortage of fresh fruit, juices, different types of bread, pastries cheeses and an omelette station in the mornings (including everything for a full english breakfast). Each evening is loosely themed ie Mediterranean, American and the food is continually replenished. The bars all served premium brand drinks and very generous measures! Red, white, Rose wine Sangria and beer were available on tap in the restaurants along with soft drinks and still and sparkling water.", "title": "A wonderful experience", "user": "GaryandCarol52", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150422231}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We have just returned from a 10 days all inclusive holiday, On first impressions the hotel seems quite good, but underneath there is room for improvement. We had to be at the pool by 8.00am at the latest to get sunbeds with umberellas as there was a severe shortage of umberellas. The pools were uncomfortably cold and hardly anyone ventured in them.", "title": "On the whole OK", "helpfulness": 11, "user": "DARBZ", "date": "July 22, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 5497427, "likes": {"liked": "— The brochure pictures", "disliked": "— The cleanliness"}}, {"rating": 4.0, "title": "doesn't quite meet the four star rating", "text": "The restaurant chairs were very dirty and could do with replacing. There should be more toilets in the main building and especially round the pool area. There is only one toilet to serve the whole pool area. The food was plentiful, but several people were ill, including my daughter. This was reported to the rep who said the hotel was aware of a problem. The entertainment was pureley aimed at the Spanish, who we found to be very rude people. Our rooms weren't cleaned very well and we had water leaking through a hole in our bathroom ceiling. The courtesy room provided on the day of departure was disgusting, we had to use it with about 12 other people at the same time.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 7, 2006", "id": 5437491}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The walk back from Playa Blanca is at least 1 hour and do not do it in the dark as there were no lights in several places. You are very isolated at the hotel because it is so far away from everywhere. We went to a 3star hotel in Majorca last year and it was of a much higher standard in cleanliness and choice of food.", "title": "Standards have slipped a little ...", "helpfulness": 8, "user": "Kelly_Berkshire", "date": "June 22, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5374177}, {"rating": 3.0, "title": "Have been to better places", "text": "We would not visit this hotel again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 21, 2006", "id": 5369571}, {"rating": 2.0, "title": "Not up to advertised standards", "text": "We stayed at this hotel recently for two weeks and on the whole thought the hotel was very good, although there were a few areas that could do with bringing up to scratch to really suit the four star rating.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 19, 2006", "id": 5362356}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "long weekend away with freinds, great hotel & location...upgrade to the privilege rooms etc well worth every penny even if only to use the beautiful peaceful privilege bar where all drinks & snacks are free!!", "title": "great hotel", "helpfulness": 5, "user": "Tracey J", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130733177}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "had a week there on 13/5/12 and could not fault it in anyway.all the staff were brilliant,food was great and the hotel was spotless.the animation were really friendly and were not pushy in any way.always loads of sunbeds to choose from.4 pools to choose from,childrens pool and then 3 bigger pools,one of which is a salt walter pool so you can float as much as you want!!!!!!", "title": "great holiday,first class on every thing", "helpfulness": 6, "user": "gordon c", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130641714}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "loads of things for adults to do aswell,water polo,archery,air rifle shooting,keep fit,crazy golf,football,olympic games,darts.animation team were brilliant.loads of food to choose from,each night was themed ie arabic,chinese,americain,indian.also good selection of kids food.", "title": "First class stay", "helpfulness": 2, "user": "Claire A", "date": "May 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130637569}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "all hotel staff were excellent.when we were there the temprature was in the mid 30s and NO BREEZE.", "title": "Great holiday", "helpfulness": 4, "user": "jimbo047", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 130635614}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "so pack plenty of sun cream.", "title": "Highly recommended..", "helpfulness": 3, "user": "auntyeese", "date": "May 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130616179}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 4, "variance": {"poor": 147, "average": 391, "very good": 1059, "terrible": 82, "excellent": 1389}, "aka": "h10 Rubicon Palace Hotel Playa Blanca", "slim_ranking": 0.297297297297, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}