{"user_rating": 3.0, "review_count": 320, "name": "H TOP Pineda Palace", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My wife and I have just returned from a two week holiday at this hotel, 16th March to 30th March 2013.", "title": "Cheap but not cheerfull!", "helpfulness": 2, "user": "inkingskin", "date": "April 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156416864}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The good things about this Hotel are:", "title": "Pleasant enough - But not for families", "helpfulness": 2, "user": "CD67", "date": "March 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156143364}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "1. Reasonably cheap on the face of it. You only get what you pay for although not with the", "title": "top hotel.", "helpfulness": 2, "user": "nobbyone", "date": "March 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156100287}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "H Top Hotel Group.", "title": "brilliant hotel", "helpfulness": 1, "user": "brackenEngland", "date": "March 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155817642}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "2. Be carefull when booking a H Top Hotel out of season because very rarely do you arrive at", "title": "Pleasant Stay", "helpfulness": 2, "user": "shirleyfromshirley", "date": "March 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155108050}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "It's a quite area best tailored for the older (over 60's) not a suitable hotel for young ravers coming from UK. Food was mostly cold we had to microwave it but if you love fish there is a cooking station to your right. Be friendly to the receptionists and they will look after you..wink wink! Free jacuzzi and sauna if you not all inclusive (book it in advance because its an hour a day) perfect for couples as its private. If you are a couple you can visit the Promenade It's just a few mins away from the hotel, they do the best cocktails and good value wine bottles. Night time local artists come to perform at the Promenade so sneak out the hotel and experience it. Train station is literally outside the hotel 2 places you can visit Santa Sussana, calella and lastly you can visit Barcelona for less than ten euros. Ask for a sea view 626 and 625 perfect view, not an ideal place for all inclusive.", "title": "Nice hotel but it's a bit tired needs updating in most things", "helpfulness": 1, "user": "cherrowne", "date": "March 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 154559466}, {"rating": 4.0, "title": "Great Hotel", "text": "My Wife and myself have stayed at The Pineda Palace Hotel twice, most recently last September. Excellent reception staff very helpful. The main problem we found was that the week we were there, there was a fun fair right outside the hotel (same week every year) this caused a parking problem as you cannot park outside for a total of 2 weeks however they have got private parking at a cost of 10 euros per night. Food was quite good with certain things being cooked fresh while you wait. If you are on an all inclusive basis drinks are ok but the beer is served in half pint plastic tumblers ( to stop people going mad). Overall a very pleasant stay.", "helpfulness": 3, "user": "Martin T", "date": "February 25, 2013", "id": 153040393}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Overall the hotel was good, The food wasnt great but edible. The gyms an absolute disgrace, its got only 3 very out of date equipment. The rooms were nice and the sea view was beautiful from the balcony. The train stations 2 mins away which is a good thing as you can get into barcelona and the night lifes brilliant", "title": "Pleasant", "helpfulness": 8, "user": "Reiss55", "date": "December 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 147894574}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Hotel was great value for money but unfortunately was not suitable for two 21 year old girls. The hotel had quite a lot of older quests and not very many bars or restaurants near by. The pool area was lovely but a very small pool so may not be suitable for everyone, also the pool bar was closed so we had to go down 8 floors ( in a towel or bikini) to get a drink which was very frustrating as there was a pool bar but it was used for storage! I was very please with our room and had an amazing view. Would stay again if I was looking for an easy, quiet holiday.", "title": "Very good value for money but in the middle of no where", "helpfulness": 1, "user": "Chonnie J", "date": "December 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 146787366}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Speedy check in- room was supposed to be disabled and sleep 3 adults. No disabled facilites and 3rd bed was a chair bed! After advising reception our 18 year old grandaughter was given this room to herself and we were moved to a room with a bathroom suitable for a wheelchair user. Restaurant was like a cattle market so decided to wait an hour before going in. No one helped with the seating and we found it difficult to get round in a wheelchair. Food was cold at every serving so had to trapse round to find the microwave each meal time. Food was not good. had to eat out several evenings despite having all inclusive; The glass system was stupid... We were unable to get any drinks on our leaving day despite arriving late on our arrival 11.30pm Drinks were stopped at 10am so really lost a day of all inclusive. Hotel was clean but not friendly staff .", "title": "Not what we expected", "helpfulness": 2, "user": "chippyc1953", "date": "October 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 143642910}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Arrived at the H Top Pineda Palace & had a speedy but non talkative check in, we had requested a high floor & sea view. We got the sea view but not the high floor.", "title": "OK for the price", "helpfulness": 1, "user": "Sjslew", "date": "October 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 142959561}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We were allocated a room on the 1st floor just above the bar/outside seating area, because of this as you can imagine with people wanting to sit out in the evening until approx midnight our room was quite noisy.", "title": "SUCH A SHAME , SHOULD AND COULD HAVE BEEN SO MUCH BETTER.", "helpfulness": 1, "user": "DukeRomsey", "date": "October 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 142954113}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The food was nothing special, typical H Top standard, I don't think there was enough space on the buffet counter to serve the amount of people in the hotel, I/we had to stand or return on a few occasions to wait for fresh food to be brought out due to the trays being empty.", "title": "cold food", "helpfulness": 2, "user": "suzanne p", "date": "October 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 142422601}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The rooftop area is very nice, but again the hotel was probably 95% full & not once did the rooftop bar open.", "title": "Good apart from the food", "user": "Sparky1343", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 142320582}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "So it was a bit of a drag having to go up & down 8 floors everytime you wanted a drink!", "title": "don't do it!!!!!", "user": "zobo001", "date": "October 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142184900}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We paid £240 each for a 4 night all inclusive break which included flights, luggage allowance and transfers. We read the reviews and decided the hotel was in a reasonable area, it was clean - which We never compromise on - and the rooms seemed to offer a fair amount of comfort. For the price we paid, we were happy to just have some drinks at the hotel and planned to eat out.", "title": "A good base if you get the right deal", "helpfulness": 2, "user": "magspool", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161876722}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Once there, we found that the hotel was just over the train tracks from the spotless beach. The rooms were comfortable with a fridge to keep your drinks in. Toiletries were provided in the bathroom along with Fresh towels everyday and the shower was always hot.", "title": "Not a holiday hotel!", "helpfulness": 2, "user": "666Jade123", "date": "May 20, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 161313925}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We had two breakfasts at the hotel, I am a coffee and toast person so I wasn't looking for a great breakfast. We had one evening meal at the hotel and it was reasonable, the chef cooked fish on the grill so we ate that with some salad. We tried some chocolate mouse for desert and that was delicious. Overall, most people who ate at the hotel complained that the food was rather bland and only ever warm, so my tip would be if you have to eat here - try and eat what is being cooked in front of you at the Grill, that way it is guaranteed to be hot. The drinks were fine, if you wanted branded drinks you had to pay approx €2.20 for a branded liquor with a mixer. Entertainment was Spanish orientated as most of the cliental was elderly Spanish. We never had a problem with this as most nights we ate out, but on the whole, we found most people at the hotel to be friendly. We never used the pool, but it looked clean enough and there was plenty of sun beds although you had to go downstairs for your drink. I understand some reviewers were not happy with the glass cards, but I think this works very well as it means all the tables are always clean and free from empty dirty glasses at all times.", "title": "counting the days to home time", "helpfulness": 1, "user": "157Bernie", "date": "April 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 158919502}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The whole area is very clean, the beach is beautiful - there is also a little beach bar there if you want a drink whilst listening to the crashing waves. You will find the train station is a 5 minute walk. We paid €10 each for a return ticket to Girona which is a wonderful medieval city. You can also get the train into Barcelona. If you are up for a walk, Callela and Santa Suzanna are about a 25 minute walk from the hotel where you will find quite a few bars and shops. If you are a power walker or jogger you will find a jogger/cycling/walking path running through the resort.", "title": "Great Experience from Mauritian Couple", "helpfulness": 3, "user": "Yogesh_R3", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 156905497}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "On the whole; the hotel offers a good base for exploring the area if you are able to budget for some meals out.", "title": "Great value for money", "helpfulness": 4, "user": "Wendy O", "date": "April 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 156689623}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 57, "average": 69, "very good": 102, "terrible": 49, "excellent": 43}, "aka": "Pineda Palace Top Hotel", "slim_ranking": 0.578947368421}