{"user_rating": 4.5, "review_count": 147, "name": "Hacienda San Jose, a Luxury Collection Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We just came back from our romantic getaway to HSJ, absolutely fantastic!!", "title": "Magic Place", "helpfulness": 3, "user": "Spaniard", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5716955, "likes": {"liked": "— Size and details in rooms", "disliked": "— Pool Service"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We drove from CUN to spend 2 nights and honestly I would have stayed the whole week....", "title": "The Cancun Antidote", "helpfulness": 14, "user": "JediNight", "date": "March 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4587710}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We booked a Junior Suite with plunge pool, the suite is nicely decorated, huge bathroom, CD player etc...", "title": "A mexican Gem!", "helpfulness": 8, "user": "Dapa95", "date": "March 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4580332}, {"rating": 5.0, "title": "Speechless!!!", "text": "Very nice details in the room and a very corteous but discreet service.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 7, 2006", "id": 4445921}, {"rating": 4.0, "title": "Fantastic hotel but the food is not just what it should be", "text": "The hotel is fantastic what more can I say about that. But the restaurant, as charming as the setting is, does not match the surroundings. The wine list is poor and the food quality just ok. This is why I can only give 4 points.", "helpfulness": 6, "user": "travelwineandmore", "date": "October 10, 2007", "id": 10062343}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "A note for all spider hating people: Wear closed shoes for dinner as there can be some spiders like tarantulas visiting the restaurant.", "title": "a tranquil paradise", "helpfulness": 3, "user": "p-hooleia", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8395401}, {"rating": 5.0, "title": "A romantic and peaceful escape", "text": "Hacienda San Jose is incredible. There is honestly something magical about it -the restored, half-ruined hacienda, the lush grounds, the lights on all the pathways at night. Its so different from anywhere you could stay in the United States. We had thought we might get bored there after a few days, but honestly, we loved just sitting by or in the pool, going for walks around the grounds, and relaxing in our plunge pool.", "helpfulness": 2, "user": "SusanGlobalGallop", "date": "July 29, 2007", "id": 8253036}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The service was also amazing- very attentive and very friendly, even though our spanish wasn't so great. This was especially true of the ladies at the front desk. One night, we had dinner out under the stars, and the staff was so flexible and accomidating after a rain storm in still trying to make the night perfect for us.", "title": "Third stay as good as it gets", "helpfulness": 1, "user": "fancode", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7331566, "likes": {"liked": "— spacious, clean and authentic Mexican environment", "disliked": "— Having to depart the property"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "One word on excusions- we didn't really like the city of Merida very much. We loved Izamal, however. To see a beautiful, restored but very real Mexican town, go there. While Chichen Itza was fun and interesting, in retrospect I think i would have chosen to go to one of the other, less crowded ruins, like Uxmal.", "title": "An Incrdible Experience", "helpfulness": 3, "user": "gadflyparexcellence", "date": "March 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7210379, "likes": {"liked": "— Everyhting was taken care of.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "It's pretty hard to read the reviews on this site and not have your expectations set pretty high. Ours were and this property and staff still exceeded them. We had reserved a Mayan Villa (MV) and upon check-in were informed that they were full and they were upgrading us to the \"Patron\" suite. This suite is huge and has its own private pool and very large patio. We liked it, but after staying there one night, we decided that we really did want the privacy and seclusion of the MV, so we ran into the manager (Bellen or Belen) and she said she would see what she could do (btw, she gave us a very informative tour of the grounds, too). We were called back in about an hour and we were moved to the MV later that day (as a funny aside, we were switched with a couple that indicated that they didn't really like the MV...we chatted with them later in the week, put 2 and 2 together and found they had switched us, and they LOVED the Patron suite). The MV was exactly what we wanted. Very private, very romantic. The positives are so numerous. First, the maid service is excellent, always perfect, always clean. The turndown service was such a nice touch...always a new trinket of some kind on the pillow, always flowers everywhere. The food at the restaurant was outstanding. We ate every dinner for 5 nights there and did not tire of it. The winelist is not huge, but it's got some decent selections on it. We also brought some wine and there was no corkage fee and certainly no hassles with them serving it to us. The prices are not cheap, but I thought the value was good. We had a dinner prepared for us on the grounds, which was also very nice. The thing that impresses me is that the service was outstanding, but not overly intrusive, which seems to be hard for most to replicate. All of the staff were able to pull this off. The grounds were, of course beautiful and the whole experience was just so laid back and relaxing. We will defintely be back, maybe nextime with our kids.", "title": "What more is there to say?", "helpfulness": 3, "user": "aj_stl", "date": "February 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6786480, "likes": {"liked": "— The beautiful, serene setting", "disliked": "— none"}}, {"rating": 5.0, "title": "This is a must visit hotel and location", "text": "My wife and I stayed in the Hacienda for 3 days in mid-December. Had we known how wonderful our experience would have been, we would have stayed longer. First, make sure you follow the directions that take you toward the town of Izamal and look for the turnoff to Citilcum, which is before Izamal. Stay on this road through both towns, Citilcum and Calcachen. A few miles outside of Calcachen, you will see a sign for the Hacienda San Jose.", "helpfulness": 4, "user": "kelvinf", "date": "January 17, 2007", "id": 6612121}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed in the master suite, which was spacious and well appointed. The local grounds are well maintained and the staff quite friendly. Make sure you listen to their recommendations, as they know the area well and were right on the mark about Merida and Izamal, we preferred the latter. My wife enjoyed their spa treatments and we both had a wonderful time in their beautiful pool. We had room service delivered to our very private patio, which was very romantic. The food at the hotel is perfect, both in presentation and taste. The small number of rooms, eleven I believe, adds to the quaintness of the resort. We plan to visit each of the Haciendas to see if they are all as beautiful as San Jose. Please check out the pictures!", "title": "Amazing", "helpfulness": 7, "user": "BodenseeAustria", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5974545}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My wife and I stayed at the San Jose for our honeymoon in early October. We were in one of the Junior Suites (#11).", "title": "Beautiful spot!", "helpfulness": 3, "user": "opusedward", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5790578, "likes": {"liked": "— Spacious and private, elegant"}}, {"rating": 4.0, "title": "LIke in the movies", "text": "The San Jose is amazing. The grounds are beautiful and perfectly kept...the gardeners seemed to be working around the clock.", "helpfulness": 7, "user": "Impresions", "date": "September 8, 2006", "id": 5782838}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 5, "variance": {"poor": 5, "average": 3, "very good": 18, "terrible": 0, "excellent": 121}, "aka": "Hacienda San Jose, a Luxury Collection Hotel Yucatan, Mexico - Tixkokob", "slim_ranking": 1.0, "description": "Hacienda San Jose is an emblematic building erected in the 18th century that, even after undergoing restoration, preserves the pastel blues of its facade, its decoration, and the murals in the chapel. Located just a 45 minute drive from Mérida’s International Airport, this place is perfect as a starting off point to visit other sceneries such as the Balancanche caves, Izamal or the mythical Pyramids of Chichén Itzá. Lavender blue colors are all around the corners of Hacienda San Jose. Its 15 rooms and suites, spread around a colonial patio with captivating ambience, will take you back in time to the past but with the amenities of this century. The former vegetables garden of the old residence is currently a site for a fantastic pool and Jacuzzi that, along with the surrounding Mayan palapas, present guests with a unique life experience."}