{"user_rating": 4.5, "review_count": 173, "name": "Hale Ohia Cottages", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My boyfriend and I stayed here for three nights, beginning the night before Thanksgiving. We thought it was very nice, extremely quiet and comfortable. The breakfast, whcih consists of papaya, banana, a little pineapple, fresh baked sweet bread, and POG (passion fruit-orange-guava juice) was probably my only complaint--as I dislike both papaya and banana I often felt rather hungry. However, this was a very minor complaint, and most people would not have this problem!", "title": "Quiet, peaceful stay", "helpfulness": 8, "user": "Nopinks", "date": "December 6, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 6340522, "likes": {"liked": "— Access to Volcanoes National Park.", "disliked": "— Breakfast was fruit."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "What I particularly appreciated was how accommodating they were for our arrival. Yes, they do have a time they prefer that you check in, but this is pretty standard with B&Bs, who don't have a staff like a big hotel--they have to sleep and go grocery shopping like everyone else! Nevertheless, we arrived well after midnight on Thanksgiving morning and had no trouble finding the key that was left for us or getting into our room. After a long flight from New York and a three hour drive from Kona in the dark, it was a great relief to have it be so easy.", "title": "Loved It!", "helpfulness": 6, "user": "dwilli10", "date": "November 19, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6152762, "likes": {"liked": "— The location relative to the volcanoes and the historic architecture", "disliked": "— The hot tub was broken"}}, {"rating": 3.0, "title": "Cute place but a bit of a pain", "text": "They are very near the Park and the small village of Volcano is charming. The room was clean (we stayed in the Camellia room), the bathroom was spacious, though the shower was small. The bed was comfortable. The walls were a bit thin--we could hear murmurs from the room next door, but as there's no TV in the rooms this was not a huge problem. The grounds are very pretty and well-kept, and Dixon the cat is adorable.", "helpfulness": 3, "user": "Rose411", "date": "October 24, 2006", "id": 6008280}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "Overall this was a lovely, peaceful place to stay, and we would definitely return. Its easy access to the Park is ideal--it's only a mile; it's hard to get any closer.", "title": "Wonderful Stay", "helpfulness": 7, "user": "Westby", "date": "October 10, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5935825}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed at the Hale Ohia in November, 2006. We really just needed a place to shack up in order to see the Volancoes, but Hale Ohia turned out to be a very charming experience. The house and grounds were beautiful. The architectural details of the house were stunning. The bed was one of the most comfy I've experienced (other than $400/night places). The breakfast of fresh fruit and bread was left in our room the night before so we could dine at our leisure (although, being from the midwest, I admit we were not quite sure what to do with the papaya). The whole HVNP area is a rain forest and it did rain quite a bit while we where there. The property has a real challenge on its hands trying to manage the moisture, but they did a great job. It was also very private and quite - a real nice getaway overall.", "title": "Lush property on the big island", "helpfulness": 10, "user": "foodexplorer", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5538989, "likes": {"liked": "— The beautiful location. privacy", "disliked": "— The shower head"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We stayed with 8 family members and took the Ohia suite and the two rooms below for two nights. Everyione loved it. Rooms were interesting and unique with unusual paintings, interesting books, stained glass windows, etc. The Ohia suite had three bedrooms, a living room, kitchen, and fun board games to play. Perfect for a family. Beds, bedding, and bathrooms were modern and high quality. Grounds were outstanding. Fresh banana bread, guava juice, and coffee is provided each morning. Volcano Village with stores and restaurants is about 2 minutes down the road. Can't imagine staying anywhere else if you want to see the volcanoes.", "title": "Perfect and charming", "helpfulness": 2, "user": "krtman", "date": "July 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3635888}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "We stayed in Cottage #44 in late May for one night. If you're going to see the volcano, we would recommend this place - it's about a mile up the road from the park entrance. Cottage was very clean, bathroom was remodeled and the bed was super comfortable. Dixon the cat was a great host. If you need absolute quiet to sleep beware as the area is quiet, but brush would blow out of the tree on to the metal roof over the bed from time to time. I imagine the rain would be quite loud as well. This did not bother us - after hiking to the lava flow, we slept very well.", "title": "Nice Place", "helpfulness": 6, "user": "Kauai777", "date": "June 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3516736}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "This is a beautiful property in a wonderful location. We had a great suite and were very pleased with the general level of cleanliness, etc. This is a B&B, so facilities and service are obviously limited. However, if you are looking for a great place to curl up with a book after a long day of hiking the lava, then this is the place for you.", "title": "Great Property", "helpfulness": 5, "user": "chavgopal", "date": "March 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3305545}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "My husband and I spent 4 nights here after spending 4 nights at Kona Village. What a change! We were greeted by Dixon the cat. Our cottage #44 was very cute and cozy. We too took advantage of the jacuzzi tub and the fireplace. I had a very bad cold and stayed one whole day in the comfortable bed with the fireplace going. I felt well enough after that to go hiking on the lava at VNP. What a sight! And the best thing was not having to drive all the way back to Kona at night. They have an annoying rule here about removing your shoes before entering the hales. If you have cold feet like me-be sure to bring slippers. The food in Volcano is extremely limited (especially if your husband refuses to eat Thai) and like everything else in Hawaii, expensive. The bread and fruit the management provides is nice, but you'll probably have to go to a grocery to survive. (and get some food for Dixon while you're at it) Please note that the cottages and rooms are much closer together that I imagined after seeing the photos on the web. All and all, Hale Ohia is a very nice place to stay while exploring VNP-clean and cozy.", "title": "\"Snug as a bug..\"", "helpfulness": 13, "user": "pooh219", "date": "March 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3292226}, {"rating": 3.0, "stay_parameters": "Stayed February 2005", "text": "We stayed at Hale Ohia for one night on our trip to Volcanos National Park. We stayed in the Master Suite. Although the room was clean and adequate, one thing that irritated us was all of the rules and fees. For example, the hot tub (a teeny tiny ancient one) was open from a meager four to six hours a day, if you stay one night you pay extra, if you pay with a credit card you pay extra, etc. You go through this whole rigamarole of authorizing the credit card via email, and yet they charge you not what you authorized (the credit card authorizing form had not accounted for the fee that is charged when you use a credit card. it doesn't make any sense!)", "title": "Cute, but....", "helpfulness": 18, "user": "toastqueen", "date": "March 8, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3259870}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This is a wonderful place from which to explore Volcano National Park. The entrance to the Park is about 2 miles away. Our cottage was extremely comfortable and cozy. It had a fireplace, which I laughed at when we arrived (It's Hawaii, right?) but which I was glad to have the second night when the temperature dipped into the 50's. Breakfast was delicious. They put it in the cottage every afternoon so we could have it when we liked in the a.m. Mike baked the bread himself. He was also a terrific host, a source of much very valuable information which guided our investigation of the whole area. I can't think of ANY reason not to give this place 5 stars. The only even mildly negative thing I can think of is that it's only 50 yards or so off the highway and we could hear cars passing during the day. At night, however, there was no traffic and the place was extremely quiet and peaceful.", "title": "Excellent spot!", "helpfulness": 14, "user": "jbullock47", "date": "March 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7153717}, {"rating": 4.0, "stay_parameters": "Stayed March 2007", "text": "Stayed at the Hale Ohia Cottages March 3 to 5th, 2007 and adored every minute of it. Although we were only there to sleep - spent all our day time hiking around the volcanoes - it was incredibly quiet, peaceful and beautiful. Highly recommended.", "title": "Loved this B&B and property", "helpfulness": 10, "user": "PamelaOttawa", "date": "March 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7148827, "likes": {"liked": "— the property and proximity to the NAtional volcano park", "disliked": "— the breakfast"}}, {"rating": 5.0, "title": "great locale", "text": "The only draw back is that the breakfast is a Small loaf of (very good) bread - cranberry/orange etc. - and a few bananas and papayas. This isn't the place to stay at if you have a family with children and expect a larger local breakfast, unlike other b&b;s we stayed at on the Big Island.", "helpfulness": 7, "user": "YpsiRt", "date": "January 28, 2007", "id": 6709703}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "I would definetly stay here again, the owner is very accomadting and nice.", "title": "Perfect base to explore an amazing place", "helpfulness": 9, "user": "A1Dan75", "date": "January 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6574639, "likes": {"liked": "— Staff, locatoin", "disliked": "— Plan your eating carefully - there's not that many places around there and they shut a lot!"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Pamela", "title": "Still a great location, but look out for the weather!", "helpfulness": 2, "user": "gbtraveller", "date": "December 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 6472083, "likes": {"liked": "— Location and unique style", "disliked": "— It didn't deal very well with damp weather conditions"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "My husband and I stayed in the Iiwi suite for 2 nights in April 2006. Our stay was great! The room was cute and cozy. Breakfast is delivered to your room the afternoon before so you can start your morning whenever you want. It consists of fresh bread (we had banana one morning and an orange/coconut combination the next - both were yummy), juice, fresh fruit and coffee (coffeemaker and fixins' are in the room). There is also a small frig in the room where we kept our water bottles. Dixon (the cat) is a charming gentleman and visited us in our room for a couple of hours one night. The hotel is only about a mile away from Volcanoes National Park and even closer to the little town where there are a couple of stores and several restaurants. All in all, a very nice place in a good location. We would definitely stay here again.", "title": "Great place!", "helpfulness": 11, "user": "Kirkland_Traveller", "date": "May 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5043433}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "My husband and I spent 2 nights at Hale Ohia while we visited Volcano National Park. The whole place was charming - really! We stayed in Cottage 44 which was unique (in a good way) in design. It was very comfortable with a cozy sitting area with gas fireplace, small kitchen with some basic cooking tools in case you needed to cook. Breakfast is simple consisting of juice, coffee, and fresh baked bread and fruit that are left in your frig so you can start your day at your convenience. Dixon the cat was very friendly. It was raining one evening and we were concerned about the rain on the tin roof over the bed, but after a long day of hiking, we didn't even notice it. The bed and breakfast is very conveniently located just a couple of miles away from the entrance of Volcano national park. Would definitely stay here again if we return to see the Volcanoes.", "title": "Would love to return to Hale Ohia", "helpfulness": 10, "user": "Vamama853", "date": "March 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4581491}, {"rating": 5.0, "title": "Vive Dixon!", "text": "My husband and I had a great time at the Hale Ohia Cottages. We spent two nights in the Iiwi suite - not very large but cute and cozy. We had read a great deal about Dixon the cat on the net (in fact we had chosen Hale Ohia Cottages because of him) and we were not deceived. This cat is the first working cat we've ever met, the most charming host possible, greeting his people when they arrive,visiting them at night, sharing their delicious breakfast, and escorting them upon departure (please see picture). From a morning hike in the Kilauea Ike crater to the long long trek to the lava flow at night, our stay in Volcano National Park was delightful.", "helpfulness": 8, "user": "MinouBoston", "date": "October 10, 2005", "id": 4004376}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Michael Tuttle, you're a gem. We stayed in the Dillingham at this B&B and it was gorgeous. Having no TV was the greatest experience of my life. It was serene, quiet and very romantic. My husband and I were here on an 18 day excursion of Hawaii for our 30th anniversay and we couldn't have asked for more from the Hale Ohia. The room was beautiful and I just fell in love with this place. I loved the Volcano and I loved the tiny village. We had a blast and wished we could of stayed longer. TRULY PARADISE. Thank you. We'll be back.", "title": "What a Gem", "helpfulness": 11, "user": "LindaCCarolStream_IL", "date": "August 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3781550}, {"rating": 5.0, "title": "Heavenly!", "text": "We spent 2 nights in Ihilani Cottage and it was just the cutest thing! It's perfect for a couple looking for a quiet, romantic place to be. It's not fancy, but Michael has done a great job making it homey and comfortable. The enclosed porch with furniture, plants and a fountain is a great place to sit, especially during the frequent rain showers. It can get chilly even with the fireplace and a heater so take your warmer clothes. If you are allergic to cats, don't stay in this one because it's open enough that Dixon the cat comes and goes as he pleases. He slept with us both nights which we loved! It has a great proximity to the park entrance and the town of Volcano too. Be aware that restaurants in Volcano operate on very regulated hours. If you need to eat between 1:00 and 5:00, it's difficult. And take your water and flashlight to the lava flows...it's a LONG hike (2.5-5 miles 1 way depending on how close you want to be).", "helpfulness": 11, "user": "Libguppy", "date": "July 28, 2005", "id": 3713158}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 16, "very good": 46, "terrible": 4, "excellent": 104}, "aka": "Hale Ohia Cottages Hotel", "slim_ranking": 0.157894736842, "description": "A Volcano Hawaii vacation retreat offering an intimate destination at Hawaii Volcanoes National Park."}