{"user_rating": 4.5, "review_count": 1393, "name": "Halekulani Hotel", "reviews": [{"rating": 5.0, "title": "Unreal massage", "text": "So my parents flew us all to Hawaii to celebrate their 35th anniversary and we stayed at the Halekulani hotel. Hotel was gorgeous, people were friendly. We ate at their restaurant La Mer two nights. It was as delicious as everyone proclaims it to be. One of the chefs actually came out at the end of the meal and gave us dessert on the house for my parents' celebration. However, better than all the views, the food and everything was the massage I got at the spa there. So unbelievable, better than any massage I've ever gotten. No wonder it was ranked so high in magazines! Highly recommended!", "helpfulness": 20, "user": "kate145", "date": "June 23, 2006", "id": 5376608}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I have had the privilige of staying at this Gem several times over last few years. It is one of the finest hotels in the US: If not the world. Service is the gold standard of a great hotel and this hotel is Fort Knox.", "title": "Absolute Best", "helpfulness": 25, "user": "billyar", "date": "June 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5376021}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "First let me say that the Halekulani would be rated #1 if not for the disturbingly similar and scripted negative reviews dissing the Halekulani for noise, or a small beach or the decor then go on to say how the Kahala Oriental was better. I thibk there are some overzealous employees at the Kahala.", "title": "Fantastic", "helpfulness": 14, "user": "ScotandHelen", "date": "May 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5049364}, {"rating": 5.0, "title": "fabulous Hotel -- be aware of the 'dress code'", "text": "Now, on to the Halekulani legendary service. On one visit I took the back of the house tour offered once a week. I discovered they control EVERY aspect of the operation, from the in house Swiss Chocolatier, to Hotel printing, to the florists, to maintain total quality. Nothing is done outside of their oversight. I am still awed at the dedication to total perfection.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5041251}, {"rating": 3.0, "title": "Watch out for the Construction!!!", "text": "One example: Their turndown service is a two person operation that is as beautiful as ballet to watch. Two impeccably dressed and cheerfully polite housekeepers work together to completly refurbish every aspect of the room, everything restocked, cleaned and a different gift every night on the pillow. They do it quickly and seemingly effortlessly. Every employee seems so proud of his or her job and the Hotel they work for.", "helpfulness": 11, "user": "HAPPYBIRDJZ", "date": "April 29, 2006", "id": 5019204}, {"rating": 3.0, "stay_parameters": "Stayed April 2005, traveled with family", "text": "I felt compelled to share my thoughts on Halekulani. I just don't get the hype about this hotel. My husband and I chose to stay here last year based on rave reviews in travel magazines, and it was not our first trip to Hawaii. If it had been I doubt we would return. We are in our 40's and have stayed at some top-notch resorts, and as a senior executive he travels extensively.", "title": "Disappointing", "helpfulness": 13, "user": "bdouty", "date": "July 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5520652, "likes": {"liked": "— Staff", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "The hotel is in the midst of the hustle and bustle that is Honolulu/Waikiki. But my impression as we drove into the area is that it is NY with palm trees - traffic, noise, congestion. Not at all what we expected. The hotel itself is peaceful, but the rooms and facilities are nothing special. Our room had a decent view but nothing compared to what we've had at other resorts in Hawaii. The pool area is OK, very little beach of its own, and the adjoining beaches/hotels are jam-packed. So when you're lying by the pool you get to listen to a constant parade of tourists who make loud and often obnoxious comments as they walk by on the public beach walk right next to the pool area. You can't even see the ocean because of a row of hedges. Not at all what we had in mind.", "title": "It really was 'heaven'!", "helpfulness": 6, "user": "redriverrose", "date": "July 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5518686, "likes": {"liked": "— Service!!", "disliked": "— Absolutely nothing!!"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The service was very pleasant and efficient, but nothing better than we've had at less highly-rated hotels.", "title": "Disappointing, second-rate rip-off", "helpfulness": 14, "user": "TiaMariaMummy", "date": "July 26, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5513707, "likes": {"liked": "— Dated, colourless and substandard for this class of hotel"}}, {"rating": 2.0, "title": "3 Star Hotel, 5 Star Service", "text": "I must honestly recommend that if you are considering a trip to Hawaii and are looking for its true natural beauty, serenity and culture, try the north coast of Kauai or Lanai. If you want action, people- watching and shopping on par with Rodeo Drive, then you'll love Waikiki. I'm not a negative person, but we were genuinely disappointed with our stay here.", "helpfulness": 18, "user": "jessica8376", "date": "July 21, 2006", "id": 5495644}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "We spent a week at the Halekulani, and it was a \"five-star experience,\" from service, to rooms, and dining. We could not find a single fault with this superior hotel. No wonder it is ranked third in the United States and nineteenth in the world by Travel & Leisure magazine. Our partial ocean view room was perfect, and amenities were plentiful. There was a lovely gift morning and night and there was twice-daily housekeeping. Upon our arrival we found a lovely fruit platter, Halekulani chocolates and a complimentary, well-stocked refrigerator. The highly-acclaimed restaurants were as good as I had heard and read about; however, the 24-hour room service was the best we've experienced anywhere. This hotel has everything and the service is second to none. Yes, it's expensive, but there is so much value for the cost, that we both rank it in the top two or three hotels in the world that we have visited. Five stars for the Halekulani; no, make it six!!", "title": "Halekulani is simply the best", "helpfulness": 11, "user": "AlanLight", "date": "July 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5436898}, {"rating": 3.0, "title": "Don't stay here EAT HERE!", "text": "Halekulani, is just flat out overated. I enjoyed my time at the J.W. Marriot (formally the Ihillani Resort) much better. Rooms are very average, no cosmetic updates since we first went in 2000! My wife and I will only visit the Halekulani for Le Mer now when in Oahu. The best meal possible. We dropped over 200$ for dinner, but money never tasted sweeter. 5 diamond restaurant to a tee. The first time we ate there we actually learned alot about proper dining etiquette if 5 star restaurants. Little things like never use your napkin more than once or twice, turn you fork upside down on plate when finished so server knows your finished, expect a hot towel when returning from restroom, you'll get more than you order because they just kept bringing us samples of apps, entrees, and dessert, and I learned I don't like truffles no matter how much they cost! Overall save money by staying somewhere else, personally I think you should get away from Waikiki, and stay on more remote parts of the island, and stop in for a bite at Le Mer. You feel like royalty staying there because everyone knows how much it costs, but be the wiser and stay someplace less expensive and know you made the right decision.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "April 25, 2006", "id": 5008584}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We just returned from our first trip to Hawaii and am thrilled to say that the Halekulani is probably the most beautiful hotel we've ever stayed. I was concerned about some of the reviews I read but soon found out that those people must have been staying somewhere else. The Halekulani is just magnificent. From the minute we walked in the staff was extremely attentive.", "title": "Magnificent hotel", "helpfulness": 19, "user": "cathybSavannah_Ga", "date": "April 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4997645}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The in room check-in is great and we got a great tour of the property. The staff could not have been any more helpful. The concierge desk was most helpful in arranging transportation for us and getting reservations at good resturants.", "title": "We absolutely loved the Halekulani", "helpfulness": 10, "user": "rmdtkk", "date": "April 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4896266}, {"rating": 3.0, "title": "This diamond is losing its once brilliant shine", "text": "We booked 2 rooms ( one for the kids ) and were hoping they would be connecting. Soon found out they don't have connecting rooms, but what we had was better. There was a seperate door from the hallway that you could close ( almost like a foyer ) and that allowed us to keep our room doors open. It was very much like having a large suite.", "helpfulness": 18, "user": "hele-on", "date": "April 4, 2006", "id": 4895257}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We also found the rooms to be quite lovely. All white and very elegant. The bathrooms are perfect. Very large. A somewhat small shower but the great water pressure more than made up for the size.", "title": "Top of the list", "helpfulness": 28, "user": "Pir8guy", "date": "March 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4587049}, {"rating": 5.0, "title": "Service beyond compare", "text": "No doubt about it, Halekulani's service motto of \"Anything for you\" is represented through each hotel employee on staff. What a relaxing week we had! Thank You!", "user": "quakerguy2", "date": "October 26, 2010", "id": 84929228}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "I just returned from a wonderful 10 night stay at the fabulous Halekulani and can’t rave enough about it.", "title": "\"Paradise In Paradies\"", "helpfulness": 2, "user": "TwinTourists", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84382085}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "The honeymoon couple who spent only two nights at the Halekulani and gave a negative review, either are very young, unsophisticated travelers or are so picky that nothing can please them. The Halekulani is the top hotel on Oahu.", "title": "I'm spoiled for life now.", "helpfulness": 1, "user": "soledee", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84277354}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Other hotels give you a lei upon arrival. It’s a common practice, but not every five star hotel does that. If you never heard of the Halekulani, why expect the lei? At the Halekulani, there is tropical fruit and chocolates waiting for you in your room instead of a lei. Having a staff member escort you to your room is different than just shoving a key in your hand and pointing the way. It is a personalized way to check in. Not like the Hilton Hawaiian Village where the reception desk staff doesn’t even look at you.", "title": "The best!", "user": "ElMelbourne", "date": "October 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84163366}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I don’t know about any ant problem. I stayed at the hotel for 10 nights and did not encounter any ants. I find it interesting that the honeymoon couple complained to the owner of the hotel when in fact, it is owned by a corporation in Japan.", "title": "Best Hotel in Honolulu by a long shot......nothing compares!", "user": "AusGoldCoast", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 83443659}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I hadn't been to Honolulu in many years, and was somewhat reluctant to spend precious vacation time to go there, but when the opportunity came up recently, we decided to take the chance. I was really pleased with our decision, and the Halekulani was a big part of that reason. The hotel is not \"drop dead\" fabulous as you go in, but the quiet elegance and quality become apparent quite shortly.", "title": "Didn't disappoint", "helpfulness": 2, "user": "kingsroadgal", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160321977}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Our Diamond Head view room was not large for three persons, but it was very high quality, with a very comfortable bathroom. What made it quite bearable, however, was the fabulous balcony and killer view. We were lucky enough to have a balcony that had a high degree of privacy because the hotel jutted out a little further on the right side, which gave us the ability to be out there without anyone really overlooking us. I would definitely inquire as to whether one of these types of rooms was available should I check in again. And I loved sitting out there day or night and watching the passing scene on Waikiki. Our housekeeping service was flawless and prompt, which is another big plus for this hotel.", "title": "Best experience of my life!!!", "helpfulness": 1, "user": "Cuisinequeen2", "date": "May 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160299653}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The restaurants at this property are top notch. I could have been happy eating only at the hotel. The House Without a Key was a great casual venue. We had a good lunch and dinner there, and their drinks are great. Only downside is that the evening entertainment only lasted until 9 p.m., and I would have been happy to sit out there listening to Hawaiian music much later.", "title": "Quiet and Elegant", "helpfulness": 5, "user": "Griswalds2074", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160022964}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "The Orchids restaurant is a step up in quality and atmosphere. Such a pleasant patio. Very reminiscent, for us, of some great Asian hotel. Absolutely cannot recommend the breakfast here highly enough. The madacamia nut pancakes with coconut sauce were so good, and didn't drown you in sugar. All the baked goods were super high quality, and the service was wonderful. We were here on an American Express Platinum rate, and could have had the all-you-can-eat breakfast at House WIthout a Key as well, but Orchids was just too wonderful. The building in which Orchids is located is just a lovely venue, with a gorgeous lounge area and La Mer restaurant is located upstairs. We didn't eat there, but it looked beautiful.", "title": "Amazing, Best Hotel I have been to in Years!!!Thank you Halekulani", "helpfulness": 1, "user": "anniestirling", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159786206}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I actually loved the whole relaxed and elegant pace at the Halekulani. It definitely insulates you from the masses at Waikiki, and that is welcome! The only other place I would consider staying in this area is the Royal Hawaiian, as that is so unique, but it would be hard to pass up the Halekulani should we return. Definitely a relaxing and wonderful way to reacquaint myself with Honolulu. Now if United hadn't made us 4 hours late on our return, the trip would have been perfect.", "title": "Very Nice, but very expensive", "user": "Bjr-au", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159736773}, {"rating": 5.0, "title": "Holiday accommodation perfection", "text": "This hotel is the ONLY place to stay in Hawaii if you value good 5 star accommodation. Recently refurbished, the hotel exudes class in every way. I always enjoyed returning to my hotel after days out touring. The hotel and its position is like a calm oasis that allows you to escape the noise and chaos of Waikiki whilst still being the action. Wonderful service where nothing is a problem, I will be booking my next vacation at Halekulani should I ever visit Hawaii again. Simple stunning.", "helpfulness": 1, "user": "mlmgl", "date": "May 4, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 159636567}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Stayed at this five star hotel for six nights. Years ago it catered to those who wanted to experience the best that Honolulu had to offer. Now, seems to be filled with those who can just pay the prices. Very little discrimination. Witnessed a group of young Japanese berate a staff member. We later spoke to the manager on duty defending the staff. Very sad to see some guests who leave their rooms at 7 am to place towels everyday at the exact same spot around the pool. No class; or, if any, third. Food was excellent in the dining room; jackets are required even for lunch. The more informal restaurants are good too. The pool attendants are professional; the general manager was very accommodating for special request that we made. All staff are very deferential, which in the case mentioned above, was disappointing. This \"Gateway Befitting Heaven\" has slipped over the years. Now catering to nouveaux riche. Those who understand who they are would do better at the Ala Moana.", "title": "Better than most; not what it use to be", "helpfulness": 2, "user": "BenMerrill", "date": "May 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159579120}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "What a joy it was to stay at the Halekulani! This was our first trip to Hawaii and we did a lot of research about where to stay but this hotel far exceeded our expectations. We felt so special here and the warmth from staff at all levels was genuine.", "title": "A little bit of paradise", "helpfulness": 1, "user": "katie_dollHongKong", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159203533}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We booked through Amex and on arrival we were upgraded to a partial ocean view room which was just beautiful. The outlook owas over both the pool area and out to the ocean. As preferred we were given our two double beds and there was ample space in the closet for two people. Decor is fresh, bright and simple. It was a pleasure to be in the room.", "title": "A fun and romantic getaway!", "helpfulness": 1, "user": "hrdirsteins", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159187654}, {"rating": 5.0, "title": "First class at its best!", "text": "The ambience of the grounds and the pool area are so peaceful and serene but also luxurious and glamorous. The pool is lit up beautifully at night and we very much enjoyed the bands that played in the House with a Key. Service by the pool was outstanding. We were not left long to wait for drinks or food. Eric the waiter was very charming and helpful!", "helpfulness": 1, "user": "Ayrwaves", "date": "April 23, 2013", "id": 158633966}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Honolulu is too crowded, but at Halekulani, it really doesn't feel that way. Not everyone can afford it, but if you can even afford the first night there, and the rest at a budget hotel, it is so worth it. You really pay for what you get.", "title": "Absolute Paradise", "user": "whatthebluth", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83145298}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We found ourselves eating at the hotel a lot, because there isn't a lot of great food in Honolulu, but my God, the Halekulani's food is fantastic.", "title": "Beach holiday in the city", "user": "Rod333", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83097928}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We arrived at Halekulani after visits to Peninsula Beverly Hills and Wynn Las Vegas so it had a lot to live up to. To be frank the room could not compete but the casual style and ambience were what a holiday is all about. Great pool which appears to be the most private in Waikiki, terrific fitness facilities and food of consistent,outstanding quality.", "title": "Halekulani Fantastic Hotel for Discerning Travelers", "helpfulness": 1, "user": "TRCNYC", "date": "September 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81537822}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Restaurants include Nobu across the road which was sensational.", "title": "Perennial favorite", "user": "luvzparis", "date": "September 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80864180}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "A great hotel for a quick escape in Waikiki", "title": "A GREAT EXPERIENCE", "user": "irote", "date": "September 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80860637}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "My fiance and I stayed here for 7 nights. When we arrive we were escorted by very friendlt and knowledgeable staff to our gorgeous room on the 17th floor (top floor) such an amazing view. The room was spacious and very clean. Massive bathroom and lovely bright airy feeling. The first 5 nights we stayed in an Ocean View room. So gorgeous.", "title": "Most amazing hotel in Waikiki", "helpfulness": 2, "user": "Noise_Natzi", "date": "November 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 87635046}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "The pool was great. Pool boys let you choose a sun lounge and they lay a towel down for you and bring you water and ice blocks! Great pool menu too with fast service.", "title": "I though this was a 5 star hotel.", "user": "HawaiiMan1979", "date": "November 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85918117}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "After 5 wonderful nights at this paradise we had unfortunately prebooked 5 nights at the Hilton Hawaiian Village for the remainder of our stay in Waikiki. We didn't want to leave! Our beautiful hostess, Joy, invited us to come back for the last 2 nights so we only had to stay at the Hilton 3 nights. Thank god! The Hilton was pretty terrible. No service at all. Our \"ocean view room\" was not what I call ocean view at all. Had a view of the man made lagoon. Not impressed. Our last 2 nights at the Halekulani were bliss! We were upgraded to ocean front again on the top floor. Again amazing service. We can't wait to return to this beautiful hotel. Fabulous location right near Waikiki's best restaurants and faultless service.", "title": "Wonderful hotel and fabulous service", "user": "yellow1NewJersey", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 85644334}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I was visiting Honolulu to meet out of town friends, and decided to splurge on a stay at the Halekulani. The rates are high, but I knew that a head of time, and I wanted to just relax. The hotel, and the rooms, were just great, but the service leaves much to be desired. The weekend concierge was quite rude and totally clueless. She seemed more interested in assisting the Japanese tourists rather than all guests. I will have to strongly urge people to avoid the staff if you stay there.", "title": "Excellent hotel", "user": "kidsgoneAz", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85519039}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "The hotel is lovely and an oasis in a very busy area. The only negative is the street noise which the hotel has no control over. Every morning starting at 4:30AM, the trucks came; garbage trucks, delivery trucks. Then the tour buses. The noise just climbs all the cement walls and unless you are facing the ocean, you will hear the noise.", "title": "Best place in the world!", "user": "eter2010", "date": "October 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 85070389}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "This is not a 5-star hotel!!! After reading so many good reviews about this hotel including those on TripAdvisor, I booked this hotel and thought I would be staying a luxury property. Don't make the same mistake. The rooms and furniture are outdated and worn. The toiletries in the bathroom are Super 8 quality. The HWOK restaurant is under renovation and we had to eat breakfast in a conference room with stackable catering chairs - It was disgusting. I tried the spa and it was very average and very overpriced. There is decent shopping nearby and we had a great dinner at Nobu across the street.", "title": "Not a Five Star Hotel", "helpfulness": 8, "user": "tmlowe", "date": "November 13, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 10795719, "likes": {"liked": "— Location to shopping", "disliked": "— Disgusting accommodations"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I would never stay here again. I would give this hotel a 3+ star rating and consider that generous.", "title": "House Befitting Heaven", "helpfulness": 22, "user": "mrslucyk", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10697958, "likes": {"liked": "— The service", "disliked": "— Leaving for home!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Halekulani - House Befitting Heaven - The hotel name says it all.", "title": "Love the Halekulani!!!", "helpfulness": 30, "user": "meechmom", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10225577, "likes": {"liked": "— The grounds and room", "disliked": "— House without a Key Renovation"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007", "text": "We decided to get married in Hawaii and chose Halekulani as it looked like a wonderful place to stay. We were not disappointed in any way.", "title": "Horrible Customer Service", "helpfulness": 10, "user": "TravelhelpfromLiz", "date": "October 18, 2007", "detail_rating": {"service": 1.0}, "id": 10124707}, {"rating": 5.0, "title": "Best on the Beach", "text": "ARRIVAL: After a very long flight from the UK (via LA), we arrived at the hotel in the evening, longing for a relax. A lady from reception (Mika) escorted us to our room, on the 15th floor, via a mini tour of the hotel where we were checked in whilst in the comfort and surroundings of our room. They say first impressions count and they certainly did on this occasion.", "helpfulness": 25, "user": "LARQuincy_IL", "date": "October 18, 2007", "id": 10117812}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "If you're looking for a Four Seasons luxury type of hotel, then the Halekulani isn't for you. But if you want a hotel that has more of a local sensibility, then consider the Halekulani.", "title": "it's about service and location, not amenities", "helpfulness": 12, "user": "mizlizNYC", "date": "September 17, 2007", "detail_rating": {"business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8735592, "likes": {"liked": "— good service", "disliked": "— outdated furnishings"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I'd heard such great things about the legendary Halekulani that I was surprised to see white wicker furniture in our room, and that the \"wall\" separating the living room from our bedroom was actually french doors, making it completely unsoundproofed. And the beach was almost nonexistent. But then, this isn't a resort a la Maui or the Caribbean. It's a hotel in the middle of the city! In fact, the Halekulani is in a great location, with prime shopping areas nearby.", "title": "Not a Five Star Hotel", "helpfulness": 16, "user": "dsibilla", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 8681341}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The Halekulani isn't about amenities. It's about service, and Hawaiian hospitality, which it offers in abundance. The staff is unfailingly polite, and always smiling. Housekeeping was perfect, and room service was also. The restaurant staff always tried to accomodate our needs. The concierge suggested activities for us, and places where we could try local food. They happily booked all our restaurant reservations.", "title": "Wonderful!", "helpfulness": 14, "user": "laurenlovesparis", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8655711, "likes": {"liked": "— service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "So the service is great. All the Halekulani needs is to update its rooms, and expand its spa, and it could easily become a world class hotel.", "title": "Truely Befitting heaven", "helpfulness": 9, "user": "Adelinna", "date": "September 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8604232, "likes": {"liked": "— bathroom", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This hotel was nice, but definetely not a five star as rated. The staff was very nice. As with most of Hawaii, the pool area is extremely crowded. Pool chairs cover every inch of ther pool and grass. And the beach is extremely small... not somewhere that you want to swim. The furniture in the room was very dated and again, not five star.", "title": "Halejulani-true 5 star in my book", "helpfulness": 15, "user": "kimmie49", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8460966, "likes": {"liked": "— service", "disliked": "— beach accessability"}}, {"rating": 5.0, "title": "Impeccable Service, World-Class Hotel", "text": "From the moment you step inside Halekulani, you are whisked away into surroundings where you are coddled, pampered, and every concern is addressed beyond your expectations. Every effort is made to make you feel special during your stay, from the welcome package of chocolates and fruits, to the meticulous housekeeping service, to the attentive reception/concierge staff who address you by name. The hotel, right on Waikiki Beach, is top-notch. Nothing short of perfection, please do yourself a favor during your vacation and stay here.", "helpfulness": 2, "user": "Charles K", "date": "April 23, 2013", "id": 158617290}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel is the ultimate. The surrounds and hotel itself are absolutely beautiful, that goes without saying, but it is the staff who really make this place. They treated us like royalty and I can't speak highly enough of the whole experience. Spending a week at the Halekulani to celebrate our 25th wedding anniversary exceeded our expectations on every level. From breakfast at Orchids, drinks at House Without a Key, to dinner at La Mer followed by a nightcap at Lewers Lounge, it was perfection. We would go again in a heartbeat. 60th birthday, here we come!", "title": "Best Hotel Ever", "helpfulness": 1, "user": "Joanne L", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158420303}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Our one week stay at the Halekulani earlier this month was a wonderful experience. Having stayed in many hotels around the world we feel that this hotel is certainly one of the best if not the best.", "title": "Simply the best", "helpfulness": 1, "user": "Ozzietraveller22", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158271853}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our time at Halekulani was magical, all of the staff we encounted during our stay could not have been more helpful, whether room service, housekeeping, concierge, valet, reception or restaurants, we were always greeted in a most friendly way and quite often by name as well.", "title": "House Befitting Heaven", "helpfulness": 1, "user": "Phil D", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158192045}, {"rating": 4.0, "title": "Missing something....", "text": "Our room was fabulous, very roomy, comfortable bed, excellent bathroom and what a view!!", "helpfulness": 3, "user": "goof87", "date": "April 18, 2013", "id": 158080694}, {"rating": 3.0, "title": "Great hotel and staff but the surrounding area!", "text": "We are staying here with some friends, and have returned to this spot for 10 yrs. However its important we touch on the pros. The rooms lovely, staff wonderful, indoor outdoor feel, fantastic with views of the ocean and Diamond Head ! We were at the Sheraton 1st with our kids. That was decent with the new rooms and very simple Sheraton standards. We did not like the same thing there as we are finding here. The beach area and surrounding us is horrible! Construction everywhere. And at nite the streets right in front of our hotel, feel like ny alley ways at nite. What has happened to this place. It has a sense of danger, we saw someone in the water right out front screaming at a man on the beach going through his bag(homeless). Then a photographer from the Mai Tai who we found very aggressive and rude when we went for a sunset cruise, well now he was yelling at the poor guy who was the victim in the water! So if you want a peaceful tranquil ocean, this is not for you , we found the beach people, surf instructors, mai tai , and alot of the people right outside this hotel to be very rude and hostile! I hope next year is better, we will not give up on the Halekulani, but I do think they need to clean up the surrounding areas, in means of crime, and comfort! There wasnt even room for us to sit on the tiny little beach due to all the surf boards and extremely rude surf instructor, he said he was Halekulani, we found out different , its a public beach and anyones allowed! Like the homeless/robber going through some guys bag! Need beach security. And no hustling .", "helpfulness": 8, "user": "30000ft", "date": "August 1, 2006", "id": 5538355}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "My husband and I started our honeymoon here and it was amazing. There were 3 people to meet us at our car door when we pulled up. One to open my door, one to open my husbands and one to open the trunk and carry our bags. You go to the front desk and right away you are taken to your room to checkin. We were upgraded to the oceanview and it was amazing. The lobby was very grandeur with the most beautufl flowers. The room was fantastic, the bed was comfortable, the view was amazing and it's a great location - within walking distance to all the major stuff to do in the area.", "title": "Great start to our honeymoon", "helpfulness": 11, "user": "Kosco", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5536355, "likes": {"liked": "— the whole experiance", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I highliy recommend this hotel and I am a travel agent and I'm always on the look out for imperfections - I didn't find any here.", "title": "Finest there is", "helpfulness": 16, "user": "SunnySanClemente", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5534931, "likes": {"liked": "— Immaculately maintained and the unbelievable staff - everyone is cordial and goes out of the way to ensure that guests are happy and taken care of."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "We just returned two weeks ago from our weeklong stay and cannot stop thinking about what a wonderful time we had. This was our second stay here and if you like under-stated but luxurious accommodations, then there is no place better in Hawaii than the Halekulani. The setting is like an oasis in the midst of the hustle and bustle of busy Waikiki. Our requested ocean view room in the \"makai\" building afforded us a lovely view of the pool too - and what a pool it is! The rooms, like the rest of the property, are pristine, well appointed and extremely comfortable. The housekeeping services here are exemplary and they made certain that we had everything we needed, replenishing fresh ice, amenities, towels, robes, and sheets daily. All of the food service outlets are superb as well. The breakfast buffet in House Without a Key was a feast each morning, meals at Orchids were terrific, room service was outstanding, and our celebratory dinner at La Mer was one we will never forget.", "title": "The best only gets better!", "helpfulness": 7, "user": "tomaui", "date": "July 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5527344, "likes": {"liked": "— complete relaxation with maximum security", "disliked": "— lack of late afternoon casual bar"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The ambiance each and every day by the pool and small beach reminded us why we had come to Hawaii - to rest and relax without a care in the world. All of the poolside attendants work very hard to ensure that guests are happy and have everything they need. We were set up each morning in our desired location with towels, chaise covers, water, and magazines. Later, more water, drinks and food, cold hand towels, complimentary popsicles or ice cream, and fresh towels.", "title": "Quite disappointing, really", "helpfulness": 6, "user": "esla", "date": "July 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 5525001, "likes": {"liked": "— La Mer", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "As said in the title line, the service at The Halekulani was absoluteley excellent, what it did was wash over some of the areas that may have challenged this hotels rating as a top place to stay in Waikiki.", "title": "Excellent Service", "user": "HKPlum_Bum", "date": "December 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 90644956}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The conceirge desk helped us every time to arrange tours, taxis, cars, drinks, whatever and it is everything I would expect from a top class hotel. They are, without question, the best face of this place.", "title": "Perfect start to the Honeymoon", "helpfulness": 1, "user": "villdre", "date": "December 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 90546134}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "As for thr rooms, well, we had a Junior Suite and it was perferct for what we wanted. Balconies (Lanai) on 2 sides, superb sea views, what more could you want? If there was one thing that could be improved then the bathrooms are looking a little dated. No Jacuzzi spa bath and fairly austere decor and hilariously, those funny \"wash one's bottom\" type of toilet seats which I thought were a 1970's Japanese style joke.", "title": "An Oasis in Waikiki", "helpfulness": 5, "user": "PortlandORGirl", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 88670962}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The restaurants, it has to be said were excellent - best crab sandwich ever (order Jo's surprise on bread) with gentle, Hawaiin style evening entertainment. This really make it a true Hawaiin experience for us non-locals.", "title": "Unbelievable stay", "helpfulness": 3, "user": "edward v", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88486404}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Apart from that the gym is OK if you get in there on your own and open the windows to get the full pool-sea view experience.", "title": "Amazing", "helpfulness": 2, "user": "LJB84", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87940177}, {"rating": 5.0, "title": "Wonderful, blissful experience!", "text": "We stayed here for our annual family vacation this year and the experience did not disappoint! With easy access to the beach, wonderful service, great food and spotless rooms, this was a hotel to remember.", "helpfulness": 2, "user": "Mobile P", "date": "April 16, 2013", "id": 157923137}, {"rating": 3.0, "title": "Very nice hotel", "text": "We stayed at the Halekulani for 8 nights. Lots of good things about the hotel: the service is excellent, particularly the concierge; our ocean view room was great, beautifully appointed with awesome views and in great condition; breakfast at House Without A Key was exceptional, a really good buffet in a nice location; awesome location right on the beach and close to town. All of these were promised and delivered, as they should be for the price.", "helpfulness": 1, "user": "IanB1965", "date": "April 16, 2013", "id": 157890718}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The hotel is largely occupied by Japanese getting married, I must have seen 7 brides a day, they are beautiful and very nice people and, older rich people. I say this because it is not a particularly lively hotel or one for families, nor does it pretend to be. The pool is an old, but beautifully maintained small oval one, with no swim up bar it does however, have great service. I have four teenage children and I would not bring them here, it is not a hotel for families.", "title": "Love Everything!", "helpfulness": 1, "user": "Hamasan123", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157874394}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The hotel has three restaurants. The middle one is Orchids, I was dismayed to find that whilst on holiday I must wear long pants, not interested. Further if you choose to have breakfast there, which you can, you have a budget of $31 a head, that should be plenty but it's not when juice is $8 and I got charged $15 for a triple espresso. That said, the other buffet for breakfast is excellent.", "title": "Amazing staff", "helpfulness": 1, "user": "SGTampa", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157582821}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "In summary, this is a beautiful hotel, with exceptional service at a very steep price. It is perfect for some however, I won't be returning.", "title": "Simply the best!", "helpfulness": 2, "user": "Elagabulus", "date": "April 11, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 157452489}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at Halekulani for 7 nights the first week in August. Everyting was great, the services were great. They answered any questions that we had. We needed a rent car they had it already for us in very short time. My girls wanted to swin with the dolphins, they set it up in mintues. It is those little things that matter when you are on vaction. The rooms, clean all the time, the beds were great. They even printed our bording passes. We would go back the Halekulani.", "title": "Great Beds", "helpfulness": 10, "user": "bella13Mass", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8422829, "likes": {"liked": "— The beds", "disliked": "— Beach"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We held our destination wedding in Hawaii and stayed at the Halekulani. It was an INCREDIBLE experience that is unlike any other five-star resort. Upon arrival, we were greeted with a fresh plate of fruit and gourmet chocolates, and they also sent us a beautiful bottle of champagne to congratulate us on our wedding. Each night, there would be a poetic momento and note on our pillow for the evening bed turn-down. The breakfast downstairs at Room Without a Key is amazing -- I only wish that they would make Portuguese Sausage a staple in their selection of omelet ingredients.", "title": "Incredible, one-of-a-kind experience", "helpfulness": 11, "user": "paradisetraveler1", "date": "July 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8245923, "likes": {"liked": "— Gorgeous, gracious luxury", "disliked": "— The price is a bit high, but worth it"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We also went to the Halekulani Spa, which was an experience unlike any other. The staff is incredibly courteous, gracious, and really cater to all of your needs - even the ones you did not know you had!", "title": "Pure perfection!", "helpfulness": 7, "user": "Angeleve76", "date": "July 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8242147, "likes": {"liked": "— The service", "disliked": "— The small non-private beach"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We thought a lot about which hotel to stay in during our wedding, and we know that we 100% made the right choice by staying at Halekulani. It is no wonder that it is one of the leading hotels in the world.", "title": "Serene Oasis on busy Waikiki Beach", "helpfulness": 10, "user": "FL_songbird", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8231148, "likes": {"liked": "— understated elegance", "disliked": "— Neglected to bring ice twice daily as requested - could not find ice machine"}}, {"rating": 2.0, "title": "Double standards", "text": "If you have a special occasion, such as your wedding or honeymoon, it is certainly worth the splurge!", "helpfulness": 27, "user": "Traveller5star", "date": "July 23, 2007", "id": 8219629, "likes": {"liked": "— Views", "disliked": "— Pool staff and waiting for breakfast"}}, {"rating": 5.0, "title": "You can't do better for luxury/price", "text": "We stayed there in late September . This does seem to be an ideal time to go to Hawaii as we were upgraded , without inquiring , right away . As the previous poster mentioned , the 9th floor is a gem . Fortunately we had both a Diamond Head and ocean view . The room was up to most Asian pricey hotel standards which is very high , folks , not a thing out of place , nor even a slight stain to be found . Housekeeping and maintenence, can be applauded here for sure ! The room was modern ( AC turns off automatically if you open the vernda doors ) , and the bathroom wonderfully relaxing with lots of nice ammenities , such as fine bath salts , etc .", "helpfulness": 29, "user": "Tsukubaman", "date": "October 18, 2007", "id": 10106141}, {"rating": 5.0, "title": "Wonderful stay at the Halekulani- we'll be back!", "text": "Check -in is very personalized ; almost to the point where you would like them to just let you be . Kudos , however, for their efforts - we were just a bit tired I guess , and I'm sure most people would appreciate it more than I did .", "helpfulness": 26, "user": "afc76", "date": "October 11, 2007", "id": 10068420}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The grounds are lovely , small , but personal , in that as a guest ,one feels comfortable and relieved to be there and out of the daily Oahu/Waikiki grind . Not as many sight-seers combing the grounds 24/7 as at The Royal . The staff seem to know or sense who is a guest and who is just having a look . In fact , one of the elevator features only allows registered guests with a room card to use the elevators , keeping non-guests confined to the lobby and open spaces . It does add to quietness and comfort if that is what you are looking for .", "title": "A nice hotel", "helpfulness": 25, "user": "squirrelone", "date": "October 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10052279, "likes": {"liked": "— Views from the balcony", "disliked": "— Small pool"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The pool is lovely and the beach is smaller than what other hotels have for an ocean frontage . However , Waikiki is huge - so take a little walk , if you must , a few minutes or so , and you'll have all the sand you could wish for .", "title": "Fantastic", "helpfulness": 22, "user": "Sm0", "date": "October 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10045692, "likes": {"liked": "— sea view from bedroom", "disliked": "— visible security -"}}, {"rating": 3.0, "title": "Racial profiling by security guards!", "text": "The Restaurant Le Mer is not to be missed . You will pay top dollar , but if you aren't in Hawaii that often - what the h*ll ?! Right ?! If a few bucks on the menu make you irritated , pause, and try to think of a better setting for a lovely meal and what you may pay for that . The service and food are world -class , and I hope you enjoy your meal as much as we did . Try to get a table with a open window - which usually means taking the earliest sitting at 6:00pm . Mai-Tai's at the Halekelani are also superior to any of the other hotels I've tried in Waikiki .", "helpfulness": 17, "user": "Ginnie234", "date": "September 20, 2007", "id": 8828262}], "location": {"country": "United States"}, "stars": 5, "variance": {"poor": 34, "average": 92, "very good": 246, "terrible": 22, "excellent": 999}, "aka": "Halekulani Hotel Honolulu", "slim_ranking": 0.0240963855422, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Halekulani has been hosting visitors to Waikiki Beach for nearly 100 years. Today its reputation for gracious hospitality, impeccable service and magnificent cuisine is unequaled on Oahu and renowned, throughout the world."}