{"user_rating": 4.0, "review_count": 28, "name": "Hamaca Loca", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "There's quite a bit of buzz regarding Hamaca Loca on the Internet, and so we decided to stay here for four nights, from July 10-14th.", "title": "Hidden Gem", "helpfulness": 8, "user": "Armchairshrink27", "date": "July 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8211975, "likes": {"liked": "— The beach!", "disliked": "— Lack of ambiance on grounds"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "For starters, this is absolutely THE best stretch of beach in Tulum. A few other hotels share this area (Tierras Del Sol and Casa Magna, both of which also which also looked lovely) but Hamaca Loca was the best deal. For only $75/night we had a spacious cabana closer to the beach than anywhere on the Tulum strip. Did I mention this was the best beach?", "title": "Great location", "helpfulness": 3, "user": "catpaw", "date": "June 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7817924}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "There are some things to be aware of, however. This is not luxury. The constant wind from the sea is what keeps these places bearable without A/C or ceiling fans during the muggy summer months, and yes, the wind and waves are loud. We loved the sound but others have complained that it's too noisy. We saw a few bugs, in particular a giant centipede. This can't really be avoided - the palapa roof lets the wind in, but also critters! Luckily the mosquito netting above the bed let us sleep in peace and we didn't get a single bite while we were here. As is typical in Mexico, the beds are hard, and due to the graywater system the shower water (as well as most likely the washing water) is salty, meaning the sheets and towels were a bit stiff. Like I said, this isn't a 5 star hotel. There's an element of roughing it here that isn't for everyone.", "title": "A little bit of paradise!", "helpfulness": 6, "user": "GlobetrotterNYC", "date": "April 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7382196, "likes": {"liked": "— quiet, small, great views of beach, low key and not touristy"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "However, if you want solitude and peace as well as a great value, this is THE place in Tulum. The owners were nice despite our language differences, although they no longer offer breakfast like they did previously. There's a grill and a dining area, and they might let you use it to grill something up if you asked. The property is narrow and this is apparent when you're walking from your car to the cabanas, but once you're in the cabanas you feel very isolated, which is great.", "title": "Amazing Beach - Great Cabana", "helpfulness": 11, "user": "Rebecca W", "date": "March 21, 2007", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 7197452, "likes": {"liked": "— The privacy and the beach", "disliked": "— can't put toilet paper in the toilet...oh well."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The owners could do a few simple things to spruce up the place - installing better lights instead of the ugly and dim fluorescent ones they currently have, or just doing away with the lights entirely and outfitting the rooms with candles (we used the gas lamp that was provided as opposed to the electric lights) and adding some torches or luminaria around the property would be very inexpensive and add immensely to the romantic appeal of the place at night. There's no bar, but we brought a cooler with our own drinks, and if we wanted something fancier we simply walked down to one of the several hotels nearby to get a mixed drink or food.", "title": "A wonderful find.", "helpfulness": 7, "user": "BPCanada", "date": "March 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6966886, "likes": {"liked": "— Small intimate ecological place", "disliked": "— No complaints"}}, {"rating": 4.0, "title": "Loved Tulum", "text": "We stayed in Cabana Pirata del Caribe last february. It’s a small place at the far south end of the Boca Paila.", "helpfulness": 7, "user": "GiGi2006", "date": "March 4, 2007", "id": 6909303}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Writing this review is a little bitter sweet. Hamaca Loca is a treasure that I don't want people knowing about in the future; but, they deserve an honest review because it was simply paradise.", "title": "Hamaca Loca es el mejoooooooor!", "helpfulness": 4, "user": "chicagotvd", "date": "March 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 25837067}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "We stayed in the Caracol Cabana while a friend stayed in the Pirata Cabana. The Caracol is situated just off the beach. The sliding glass doors were kept open most of the trip to enjoy the warm breeze and the sounds of the sea. There is an excellent sea view through the trees which can be enjoyed from either of the beds or lounge area just outside the cabana. The Cabana was clean, although there are a few bugs (ants) but you need to expect that in a thatched roof cabana. Caracol Cabana was everything we needed - although the wife complained that the bathroom mirror was two small.", "title": "Quaint rooms - but midst construction", "helpfulness": 3, "user": "malisaAz", "date": "March 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 25480028}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The Pirata Cabana was just as nice as the Caracol although situated back a little further from the beach. This Cabana was just as large and had a little better daylight. The bathroom mirror was also larger. We never slept in this cabana so we can't comment any further.", "title": "Loco for Hamaca Loca", "helpfulness": 1, "user": "TheSkipperToo", "date": "January 8, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23377150}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "The beach at Hamaca Loca is absolutely stunning. You feel that you are alone on the beach - besides the two resident dogs - and have your choice of lounge chairs. There is no need to get up with the sun to save your spot for the day! The beach is cleaned daily and is immaculate. We stayed in February and did not have a problem at all with mosquitoes.", "title": "Great secluded place", "helpfulness": 1, "user": "Cfritz75", "date": "December 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 22897206, "likes": {"liked": "— Very quiet and fantastic beach", "disliked": "— no restaurant or water"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The Cabanas are at the end of the main Tulum street which keeps it far from the Hotel zone of Tulum. This is also a slight downfall because they do not have a kitchen on premises meaning you have to travel at times for food. Have no fear though, A Mil Amores Hotel is just two properties south and they have an AMAZING breakfast and dinner.", "title": "this is paradise", "helpfulness": 6, "user": "lanik23", "date": "January 12, 2008", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 12560263, "likes": {"liked": "— proximity to perfect beach", "disliked": "— distance from town"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "variance": {"poor": 1, "average": 2, "very good": 11, "terrible": 1, "excellent": 13}, "aka": "Hamaca Loca Hotel", "slim_ranking": 0.672413793103, "description": "Our ecologic hotel built with natural materials and resources of the region counts 3 cabanas beach front with a breathtaking view directly from your bed. Private and comfortable, with living room, bedroom and bathroom with hot water. The light is provided from solar panel system. Surrounded of coconut palms and tropical vegetation. Solar panels and proper treatment of the drain. For an ideal vacation in total respect of nature."}