{"user_rating": 4.0, "review_count": 863, "name": "Hamilton Crowne Plaza Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Great location! Close to White House and other monuments. Lot's of cafes and shops nearby. Classy rooms, even though they are quite small. The rooms were very clean. Staff was very helpful and friendly. We definitely are going to stay there on our next trip to Washington.", "title": "Cozy and classy", "user": "Marina K", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154777267}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I am an IHG Priority Club member. This is not a great Crowne Plaza. Rooms are very, very small. If you get a double, they really mean double: 2 double beds, NOT 2 queen beds. No free wifi. And the wifi is slow and not very reliable. Breakfast was good, but they charge a \"champagne brunch\" surcharge on Sundays. Even at 7:15 AM. Seriously should consider a standard buffet option. Only additional stuff was champaign (which I was never offered) and peel and eat shrimp. Neither stuff I consume at 7:15 AM. Costly hotel. Very expensive parking. Forego the hotel parking ($50) and park around the corner in the office building ($27).", "title": "Not cheap. Small rooms", "user": "MLG18104", "date": "March 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154213832}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Excellant location at a resonable price.", "title": "Excellant LOcation", "helpfulness": 1, "user": "carlston13", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154199023}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Walking distance to all the \"Must See's\"", "title": "Perfect place to stay!", "user": "travelnylady", "date": "March 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154189396}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Room was clean and tiday and staff very helpful.", "title": "Great historic hotel close to the mall and whitehouse.", "user": "Ron B", "date": "March 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154111357}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "DC is a must visit, and if you can schedule your stay when congress is on holiday you can save big. The Hamilton is a beautiful hotel, close to the subway and the Mall. We were there during some remodeling, but the noise never bothered us a bit. The staff went out of their way to make sure we were comfortable and well looked after.", "title": "Visit DC when Congress is not is session", "helpfulness": 1, "user": "bwhorne", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155995217}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Fresh squeezed OJ at the attached restaurant went perfectly with a glorious breackfast buffett.", "title": "Great Location", "user": "1travelingDad", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 155860835}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I usually steer clear of ALL buffetts, but this one was so nicely stocked with fresh produce you could tell it was top notch.", "title": "Great stay at the Hamilton Crown Plaza!", "user": "ohsusanna733", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155709791}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I only ranked rooms very good due to their smallish size and the fact that ours didn't come with a built in refrigerator. (the staff did bring up one very quickly BTW, so I'm not complaining)", "title": "Breakfast", "user": "Diane C", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 155240176}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "What really made me rank this stay high was the price I paid (congress was off) for such luxurious accomodations staffed with such friendly and professional people.", "title": "Great location and helpful staff", "user": "blondebass", "date": "March 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 154805910}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I work at a hotel, so I can be a bit critical when we travel. However, our experience here was great! It was my birthday and our first night away from our baby, so we wanted it to go well. We arrived early to drop off our luggage, not expecting to be able to check in early. Joseph, at the front desk, was extremely helpful. He got us a room on the 10th floor and it was beautiful. My only complaint was that we were hoping for a great view but got one of only a couple of rooms that has a sort of concrete barrier outside of the window. We could still see the park beside the hotel and the Washington Monument in the distance, but you had to look between the pillars.", "title": "Great Experience!", "helpfulness": 1, "user": "thelasteast", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153885118}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "We had drinks in the bar (which were very pricey) and the brunch on Sunday morning. Brunch was well worth the experience! It consisted of a variety of fruit, biscuits and gravy, omelets, shrimp, bagels, lox, sausage, bacon, pancakes, french toast and more!", "title": "Poor service, broken computer", "user": "Amjur", "date": "March 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 153771042}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "This is now our \"go to\" hotel when we visit DC.", "title": "Meetings in DC", "user": "aquarianmark", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153714029}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "No maid service in morning, nap in afternoon. Couldn't get promised service later. Wouldn't even bring fresh towels!! The location is good for convention center. Noone to help us get cab this morning.", "title": "Solid Hotel in Good Location", "user": "WARSAWRUN", "date": "March 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 153442436}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed for 4 days for the second time and was pleased that I had come again to this hotel. The hotel has a pleasant character and not a typical of modern 4 star hotels. Whilst I did not check out the history the hotel is a renovation od an old hotel and has a charm not seen in modern hotels. The room was very comfortable, great bed, nicely furnished and with the normal facilities one would expect. The wi-Fi was a bit patchy in the room and much better in the foyer or restaurant and bar. The staff were particularly helpful and the hotel very well located for my meetings at the World Bank - $7 cab ride and not too far to walk either. The restaurant was very good both for breakfast and dinner.", "title": "\"Classic Hotel, Convenient Location\"", "user": "vistacruiser69", "date": "February 27, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 153258645}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I must say, that after our stay at this hotel over this Easter weekend i believe it is one of the BEST hotels we've ever stayed it!! The service and staff were second to none! The hotel itself is centrally located and beautiful! But the staff is AMAZING!! We gladly accepted the skilled help of both gentlemen in the concierge position and both were extrmenly helpful and friendly. The lobby bar is beautiful, with a great Happy Hour menu and,again, wonderfully staffed. The front desk, most especially Mallory, were delightly and helpful at every encounter! I recommend this hotel wholeheartedly!!!", "title": "Hamilton Crowne Plaza Hotel- the BEST!!", "helpfulness": 1, "user": "lswg", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156439508}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I stayed here for 4 nights in March of 2013. The room was tidy and pleasant but quite small for the rate, in excess of $200 per night. This could have been due to a conference that was in town nearby. The location is very central and within walking distance of most of the major attractions, including various museums, the Lincoln Memorial and the White House. There aren't many places to eat nearby so if you get the munchies late at night, good luck! It was pretty noisy in the alleyway outside my room at all hours of the night. The The staff was pleasant and the exercise room was excellent with numerous treadmills, bikes and weight machines. Overall, a good experience but the value was only average given the high room rate.", "title": "Convenient central location, great exercise room", "user": "Joel H", "date": "April 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 156308633}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Booked our room on Booking.com for a 4 night stay. After checking in, Kalala did a superb job getting all of our gear and luggage to our room, but we quickly realized it was not the room we had booked. Kalala immediately called the desk and explained the problem and set the wheels in motion to get us a different room. At the front desk Ravi and Lisa explained the online booking sites sometimes use misleading photos of rooms that are not from the hotel being booked The reception desk staff could not have been nicer or more understanding of our situation. Being Easter weekend, all the rooms were occupied. A Special Thanks goes to Ravi and Lisa for salvaging our vacation.", "title": "Great service", "user": "c lynn r", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156198448}, {"rating": 4.0, "title": "Good location, nice room but only after manager made things right", "text": "The hotel restaurant, 14 K, served an excellent Easter Brunch. We want to give a special \"shout out\" to NELSON for taking such good care of us.", "user": "jkwasnick", "date": "March 30, 2013", "id": 156085409}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Went here for the night after reading reviews of the hotel. Booked through Priceline. Originally requested a pet friendly room which is only the third floor. Then after further reviews I read that lower level floors were noisy. So I left doggy home and called the week before to ask for a room on a higher floor away from elevator. They said they put the notes in the system.", "title": "good location", "user": "drillerkc74", "date": "March 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156020776}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3.5, "variance": {"poor": 57, "average": 141, "very good": 344, "terrible": 30, "excellent": 291}, "aka": "Crowne Plaza Hamilton", "slim_ranking": 0.449612403101, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "A restored 1920's architectural gem, the Hamilton Crowne Plaza Hotel offers refined accommodations and modern meeting facilities in the heart of the nation's capitol. Gracing the corner of 14th & K Streets, NW, this Washington, DC hotel places you in the ideal location whether you're traveling for business or pleasure. Just 5 blocks from the White House, 7 blocks to the Washington, DC Convention Center, 1 block to the McPherson Square Metro Station, minutes from the National Mall, Smithsonian Museums, and local dining and entertainment, the Hamilton Crowne Plaza Hotel is perfectly situated to make your visit a productive and memorable experience. The Hamilton's own 14K Restaurant and Lounge offers a contemporary American dining experience to guests and local DC residents alike. Perfect for people watching, entertaining, or unwinding after a day of meetings, 14K Restaurant and Lounge is the choice for casual meals or private gatherings."}