{"user_rating": 4.5, "review_count": 421, "name": "Hampton Inn New York Seaport / Financial District", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "One of the nicest places I've stayed in New York City.", "title": "Really nice place by South Street Seaport", "helpfulness": 2, "user": "Henry F", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16821327}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I try to find places that aren't too expensive. We stayed a night at the Hampton for $249. At the time, the weekday rate was $429! For the price we paid, this was a really nice experience. And included the usual hampton inn breakfast. Our room was on the 2nd floor and faced a busy street so I was worried about noise but we heard NOTHING -- amazing. Bed was very nice. Room was small but that is too be expected in NYC.", "title": "Noisy Little Hotel", "helpfulness": 1, "user": "rkaradi", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 1.0, "rooms": 1.0}, "id": 16804415, "likes": {"liked": "— Freindly staff", "disliked": "— Too noisy/small room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "I've seen other people say they paid $135 with AAA. That would make the membership worth it with one night. This would beyond a steal at that price.", "title": "Nice little hotel in the middle of the big apple", "helpfulness": 1, "user": "007DAWG", "date": "June 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16722616}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I was looking forward to staying at this hotel because of all the positive reviews, and after staying here for two nights this month, I will never stay again. First off, I must say the hotel is very clean and the staff incredibly friendly.", "title": "Great location in nice quet NYC area", "helpfulness": 1, "user": "ywi", "date": "May 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16434069, "likes": {"liked": "— The location", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Great stay", "text": "My wife and I got there at around noon and were told my assigned room was not ready yet, and in fact the people hadn’t checked out yet (this was not a big deal to me since check in was 3 PM and I was just hoping to get a room earlier). They said if we wanted a room now, we could get one on the main hotel floor otherwise wait till check in. Since we had flown in on a red eye from San Francisco we opted for the room available now. Needless to say it was the smallest room I have ever stayed in, even for New York standards it seemed small, the door to the room almost touched the bed. We were about 50 feet from the check in desk and it was just plain noisy at all hours of the day. We were woken up by lobby nose both nights from arriving guests between midnight and 3 am several times (it seemed like people coming home from parties or a late night) who didn’t realize people might actually be sleeping. It was downright ridiculous. I would have changed rooms after the first night, but because we were there for only 2 nights it was too much of a hassle. Also the room had a window that looked onto the balcony of two other rooms, and there were no privacy curtains, just drapes. So you had no choice but to close the curtains if you wanted privacy. I’m use to most hotels having sheers and then curtains, but not this room, so basically we had to keep the drapes closed at all times. Also there were only 3 outlets available in the whole room. Two in the bathroom and one at the desk, all others were used and behind furniture. So trying to charge two computers and cell phones was nearly impossible, plus you had to work at the desk if you needed to plug in. For a newer hotel and a Hampton I was very surprised at the lack of plugs.", "helpfulness": 2, "user": "Portia1972", "date": "April 29, 2008", "id": 15452149}, {"rating": 4.0, "title": "Wonderful Little Hotel, Great Location", "text": "A little gem of a hotel steps away from the Seaport, literally 2 minutes away, but tucked away on a side street so guests are not subjected to the late night raucous merrymaking. The rooms & facilities are exceptionally clean and well-maintained. The individually climate-controlled rooms are very pleasant and astonishingly quiet, although I did find them a bit small. The staff goes out of their way to accomodate guests. We were checked in immediately and courteously although we were significantly early. We took our bags to our room, left immediately as we were running late for an event, and did not return until late evening, at which time we inspected the room and realized that it would be uncomfortably tight for my husband, 7 year old daughter and I. We requested a larger room, and were instructed to take our bags to the 9th floor. Upon entering the room, it was obvious that no housekeeping had been performed since the departure of the previous occupants. We then had to move our bags to another room. However, they restored our good humor when they voluntarily reduced our rate by half in redress for our inconvenience.", "user": "TingWashingtonDC", "date": "October 18, 2007", "id": 10116854}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My 7 year old daughter has forged a special friendship with Anthony, the bell captain/doorman/provider of anything else you need. The desk staff is always pleasant. A word of warning about their complimentary breakfast buffet--quite bad.", "title": "Awesome Little Hotel...Great Location!", "helpfulness": 3, "user": "Audthang", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10058401, "likes": {"liked": "— Location and Rate", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Great Hotel! Absolutely loved the location, literally right next to the Brooklyn Bridge. I would have thought it would be noisy. But I never even heard a car, compared to usually staying in mid-town where it is extremely noisy. The room was small, but very clean. Absolutely comfy bed. Loved the flat screen TV.", "title": "Great location, friendly staff, comfortable bed", "helpfulness": 3, "user": "lindsay43", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 10037610, "likes": {"liked": "— The bed was amazing!", "disliked": "— The room was a little small, but a lot for the price."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "Glad I switched from my first choice of a usual mid-town hotel to this one. We were looking for something near SoHo as we were meeting up with friends coming in from LA who booked their hotel at 60 Thompson ($$$). We wanted to be close but couldn't afford those rates. We paid $197 + tax for the Hampton Inn!", "title": "The staff are special here", "helpfulness": 2, "user": "JFMCL", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8823998, "likes": {"liked": "— The staff", "disliked": "— The internet was not working when I stayed"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The Hampton Inn is right next to the South Street Seaport and the water taxi. Loved being down by the water...its just a totally different atmosphere.", "title": "Good hotel with a great location", "helpfulness": 5, "user": "hjn0901", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8676622, "likes": {"liked": "— Location and Service", "disliked": "— No guest laundry"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at this delightful little hotel (a real find in NYC in our view) during Christmas week of '07 (just last week!) and would return here in a heartbeat. While the rooms and closets are definitely small, this being NY after all, the hotel itself is an excellent value for the city. The beds are extremely comfortable and the bathroom is quite large, and always well-stocked. There is free internet connection in the room, and a flat-screen TV on the wall, and local calls are all free. Every business day there is free delivery of both the Wall Street Journal and USA Today!", "title": "A Wonderful Little Hotel in Lower Manhattan!", "helpfulness": 2, "user": "Surbs", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12363825, "likes": {"liked": "— Location, Cleanliness, Staff Service, newspapers, Internet", "disliked": "— Small Rooms; Lack of Hot Vegetarian Options at breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The breakfast buffet is quite okay, though my wife being vegetarian would have welcomed some hot meal options for her. Every day there are two hot meal choices, usually sausages and eggs, but otherwise the bar is well stocked with fruit juices, bagels, bread, fruit, cereal, and tea, coffee and hot chocolate is availabel 24 hours a day!", "title": "Not cozy or romantic, but problem free and friendly staff!", "helpfulness": 4, "user": "timbuk2", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 12343194, "likes": {"liked": "— friendly staff and clean room", "disliked": "— no pay movies"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel is also in a safe neighborhood adjacent to the South Street Seaport and about a 5 minute walk from the subways, both the A train that connects to JFK thru the Air Train and the cross-town 1,2,3 trains for the rest of Manhattan. We walked the streets quite safely even after 10pm at night, and returned home after 1am on New Year's Eve, and it was quite safe. Within walking distance is the Financial District, Battery Park, and Ground Zero, and the rest of Manhattan in minutes thru subways.", "title": "Good value for NY", "helpfulness": 1, "user": "lauryij", "date": "January 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12305047, "likes": {"liked": "— Clean accomodations for the money", "disliked": "— Only average desk service, slowest elevator in the world"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The staff at the hotel is excellent, from room service to the doormen and front desk, especially Jackie who checked us in very efficiently and with a welcoming smile, and made sure our entire 8 day stay was well taken care of!", "title": "Typical NYC Hotel - Small Room, Convenient Location, Scandalous Price", "user": "TomMQuinn", "date": "January 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 12232057}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I stayed at this hotel for the final 2 nights of my trip. Upon reflection, there was nothing special or unique about this hotel and I know I wont really think back on my stay here or remember it down the road. There was no nice view. No pay-movies. No restaurant or bar. The room was small and clean. It didn't look as slick as the pictures on the website, but it was pretty close. On the flip side, there was a complimentary water waiting for me when I first arrived to the room, there was complimentary breakfast available in the morning, and there was pleasant and professional staff working at all times of the day. So although there really isn't much I'll remember about this hotel, this might just be a very good thing to some folks.", "title": "Better than expected", "helpfulness": 2, "user": "Revfan", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 11252649, "likes": {"liked": "— Convenience, cleanliness", "disliked": "— Price (seasonal), lack of amenities such as restaurant, bar, fitness facility"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I am usually not the type to give a Hampton Inn such high reviews but the incredible staff make this hotel a complete joy - Larry and Ruth are the best. It is easy to get to from the financial district or the seaport, so is great for either work or leisure. The rooms, though on the small side, are not lacking in anything. My one complaint is that my room was too near the elevator. This is an absolutely must stay for those traveling to NYC on a budget.", "title": "Great location, great staff, great hotel", "user": "Lang C", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134900388}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Beautiful clean room. Great breakfast. Hot and cold choices. The service was exceptional! A phone call after check in to make sure that we were happy with our room. I have never received such attention... even in five star hotel. Will return!", "title": "Spectacular Service!", "user": "Judy F", "date": "July 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 134862263}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Negatives first, room a little on small side but comfortable and clean. A touch of mold in the shower, and the shower curtain is too short! Water from shower easily gets to floor. TV had no channel guide, you have to search each channel for programing, yeah I know it's picky.", "title": "What a Staff!", "helpfulness": 1, "user": "thunderbird64", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134764452}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "That's all my negatives. Now I get serious. Upon our arrival I found out I had no reservation due to previously cancelling at a high rate, to obtain a lower rate. I thought I had rebooked through the front desk at that time. Nope, due to miscommunication we had no rooms, must admit it was pretty much my error. Jennifer to the rescue, she was able to accomodate us and was just great. First night first floor rooms with a view of the black netting, due to renovation project and a neat courtyard. Next two days on 8th floor with a balcony, that was really great. Rate was fantastic, using AARP. Rooms were very clean and comforatable, but could be alittle snug for some. My feeling is I only plan to shower and sleep in the room, rest of the time out on the town. I have seen smaller rooms, Microtel chain. Also my friend said he has been in smaller rooms in NY, on business trips.", "title": "Excellent Seaport/Fulton Street location, clean, very comfortable, helpful staff.", "helpfulness": 1, "user": "MountainJitney", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134586431}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Location convenient to 9/11 Memorial, Wall Street, Battery Park, Chelsea Market plus many more destinations. We used cabs for all our trips and had no problem getting one in front of the hotel.. Restaurants everywhere, prices typical New York but food very good. Pier 17 fun place to visit and an easy walk from the hotel. Brooklyn Bridge also very convenient if you want to walk across.", "title": "Good value hotel in lower manhattan.", "user": "rsruss", "date": "July 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134555508}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the Hampton Inn, NYC Seaport, in July 2008 for just one night but we enjoyed the stay quite a bit. The hotel is small and the rooms are tight but it was very clean and the price was right. We spent the entire day on Governor's Island for a concert, however, we found that the beds were exceptionally comfortable as we all (my wife and I were there with two friends) very well. I would definitely stay at this hotel again and its proximity to the Seaport is the best amenity considering it's just one block from the shops and restaurants. They do have parking which is discounted if you're staying at the hotel although it's down the street. We missed it and ended up parking right next door for a few more dollars but it was worth it.", "title": "Nice Little Hotel", "helpfulness": 1, "user": "ardmoreflyer", "date": "October 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20680292, "likes": {"liked": "— Proximity to the South Street Seaport", "disliked": "— Smaller rooms, no balcony"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I booked this hotel after reading the reviews on Trip Advisor and I am so glad that I did. My husband and I spent a night here last weekend for our anniversary. We got a great rate and I couldn't have been happier with the hotel. I have lived near NYC all my life and worked there for about 8 years, so I am familiar with the city and the prices, and I have to say this was a great deal for the money - especially compared to the overpriced mid-town hotels.", "title": "Excellent Hotel!", "helpfulness": 1, "user": "Vasari2003", "date": "September 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20496832}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "First of all, the service was amazing - everyone was so friendly and helpful. So much so that the place really had a small hotel or inn feeling about it. Parking was super convenient and inexpensive for Manhattan. The location was wonderful - nice neighborhood, a couple blocks from the Seaport and a couple blocks from the subway. And it is convenient walking distance from anything downtown - Seaport, Battery Park (Statue of Liberty Ferry), Ground Zero, Little Italy, China Town, etc.", "title": "Functional, not fancy", "helpfulness": 1, "user": "Westportia", "date": "September 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 20152141, "likes": {"liked": "— The bed was very comfortable", "disliked": "— Decor seemed a little institutional"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We had a room on the 8th floor. The room was small (typical NYC) but very nicely decorated - everything looked updated - and immaculately clean. We had a small balcony off our room from which we could see the tall ships in the Seaport and part of the Brooklyn Bridge. Nice bathroom amenities, flat screen TV in the bedroom, beautiful linens on the bed, wireless internet access. The hotel also has a complimentary breakfast each morning which was very nice and 24 hour coffee service.", "title": "Decent Hotel - Good Value", "helpfulness": 1, "user": "BrlDsguise", "date": "September 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 19819777, "likes": {"liked": "— Location, Value", "disliked": "— Room was drab"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I would stay here again in a heartbeat!", "title": "Great place to stay", "helpfulness": 1, "user": "4biegeglboys", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0}, "id": 19348704, "likes": {"liked": "— price and location", "disliked": "— liked everything!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Our family stayed at this very nice Hampton Inn during a recent stay in New York (April 18 - 22). The location is wonderful - in close walking distance to all lower Manhattan locations. The rooms, while tight on space, are very clean with new amenities. The breakfast was standard fare - but plentiful and well done. But the real standout feature of this hotel is the staff. From the moment we arrived (at noon, without requesting early check-in in advance) they bent over backwards to accomodate us. We were not even checked in and they were handing out candy bars and teddy bears to the kids. Throughout our stay, they repeatedly checked to see how they could help us. They took great interest in our trip and offered assistance and recommendations at every turn. They even helped to re-arrange our travel plans to extend our stay at the hotel - and actually took care of cancelling our other reservations for us. We loved our stay and will definately be back!", "title": "Terrific Stay at Hampton Inn Seaport/Financial District", "helpfulness": 2, "user": "explorer1905", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 15414156, "likes": {"liked": "— Great value!", "disliked": "— Rooms are small"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Usually when hotels show great photos on a website, but you get there and it doesnt look any where near as nice....... Well, not this Hampton...It was so beautiful and looked just like it did in the photos. The Front desk staff (carlos Mostly and Jonathan is who i spoke with) were amazing....so friendly and Helpful! The room was spotless. Great view! 10 minute walk to Chinatown, 5 minute walk to the Seaport, restaurants and shopping, also a quick 12 minute walk to the financial district and the Huge discount shopping store on Trinity place/cortlandt called Century 21! Fulton st. subway is right there so you can take a quick 15 minute subway trip uptown to the garment district, penn station and madison sq. garden. You will love this hotel! I found it on my website www.time2gotravel.org", "title": "Excellent Hotel", "helpfulness": 2, "user": "time2gotravel", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15050210, "likes": {"liked": "— Loved it all!! Really loved the decor of the room and the cleanliness", "disliked": "— I couldnt stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Heather/travel agent", "title": "A Wonderul Place To Stay", "helpfulness": 2, "user": "mrqewd15", "date": "April 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14709524, "likes": {"liked": "— Clean, convenient location, great staff and excellent view", "disliked": "— Subway rerouting"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "The photo of the room i took with my camera phone", "title": "Great little hotel", "helpfulness": 3, "user": "gabsterUK", "date": "March 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14362745, "likes": {"liked": "— Service", "disliked": "— Wait for Breakfast table"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I stayed at the Hampton Inn Manhattan/Seaport/Financial District from March 23-28 and had a wonderful experience. The hotel is clean and the staff gives excellent service. My room was cleaned everyday and I had a spectacular view of Brooklyn, Brooklyn Bridge and the Seaport. Breakfast was served every morning which was very convenient for me considering I stayed there for business and did not have a lot of time in the morning to stop and get something to eat outside of the hotel. The doorman gave me precise directions to get anywhere I wanted to go. It was a pleasure staying at this hotel and I would certainly stay there again. The only thing that I did not like is that if you use the Fulton/Williams Subway station near the hotel during the day time, then don’t always expect for it to be open late night after 12:00 midnight. The station was usually closed late night for maintenance during my stay or I would need to make a transfer to another train because the trains are rerouted after midnight from this station. I would have to find an alternate route or catch a taxi back to the hotel. This was not really a problem at all it’s just that I had to walk a few extra blocks by using another station. The fitness room is small and only has one treadmill so I had to wait until the person using it was done. They also have a spin bike as well. The hotel is 3 blocks from the Seaport for shopping and fun. But if you are looking for a clean hotel with comfortable beds, excellent service and breakfast with a smile then I highly recommend this hotel. I can’t wait to go back!!", "title": "great lower manhattan location", "helpfulness": 2, "user": "enaj47", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14307764, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "It was a decent hotel for the price. It is in a good location that is easy to get to by car. There is a parking garage down the street the hotel stamps at. You can leave the car there for your whole trip for $20 a day. The rooms are small, but clean. There is no frills, nor amenities like a fitness center, but it is a good price, and the hotel staff was pleasant. I felt safe at the hotel and in the area.", "title": "Good home base", "user": "Michaela M", "date": "August 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 173595711}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Stayed at this hotel overnight while in town for business. FYI, there is a Pearl Street and a Fulton Street in Brooklyn too which took me on a slight detour while on my way to this hotel ;-) Regardless, the room was descent sized by NYC standards but most of all the staff was awesome! Extremely friendly and full of helpful information on where to grab a bite to eat nearby. Located very close to the pedestrian entrance to the Brooklyn Bridge in the event you want to walk over to Brooklyn.", "title": "Incredibly friendly staff!", "user": "Chad C", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 172888659}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Great location, easy walk to subway, easy walk to financial district. Easy walk to high end grocery store (55 Fulton Market). Good complimentary breakfast. Clean, spacious room, especially for the price and location. Staff was very friendly and helpful. I would definately stay here again.", "title": "Great Location and Value", "helpfulness": 1, "user": "David T", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 172613000}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "We've stayed at other Hampton Inns before and was disappointed that this one was not in line with the other Hampton Inns.", "title": "This Hampton Inn does not do the Hampton Inn line justice", "user": "Travel11Bug", "date": "August 15, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 172441073}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I understand that this is NYC and space is a premium, but we were disappointed in the overall experience.", "title": "Great service, okay hotel", "user": "RebeccaKruse", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 172043097}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Breakfast was free., again, not a Hilton spread but perfectly OK. Breakfast room would get busy and i would have to wait a few minutes for a table ~ only slight criticism.", "title": "A very nice place to stay", "helpfulness": 1, "user": "DelphineDS", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 13990375, "likes": {"liked": "— The staff - friendly and helpful, the beds, sooo comfortable", "disliked": "— the lack of storage place"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Location suited me. The area is reasonably quiet at night! There are plenty of restaurants close by including the excellent Bridge Cafe ~ lovely food! Comfortable walking distance to Ground Zero, Ellis Island ferries and the 'trendy' districts of Little Italy, China Town etc. Nearest tube stations are a 5 minute walk and will both take you to almost anywhere. Taxi to Times Square was only about $12.", "title": "clean and wonderful in manhattan", "helpfulness": 1, "user": "melissalenahan", "date": "February 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13744399, "likes": {"liked": "— Clean, and very comforatble", "disliked": "— Learning the Subways and other forms of Public Transportation"}}, {"rating": 5.0, "title": "Wonderful place to stay!!", "text": "Ask concierge to arrange a car to the airport rather than get a yellow cab.", "helpfulness": 3, "user": "babs61954", "date": "February 4, 2008", "id": 13263043}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Excellent location next to the Brooklyn Bridge (nice walk and views), near the Staten Island Ferry (free ride and good views of the statue of Liberty), Wall Street with all it's architecture, new and historic. Also, close to Fulton Street subway lines and supermarket, Chinatown and Little Italy (less than a mile from all the above).", "title": "Hotel Downtown Manhattan", "user": "Casper B", "date": "August 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 172003371}, {"rating": 4.0, "title": "Almost hidden downtown gem", "text": "Close to financial district and City Hall, near Seaport - area still recovering from Sandy but the hotel is in great shape and very courteous staff. The complimentary breakfast was great and provided some variety from day to day. Will stay here again on future NYC trips.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 2, 2013", "id": 170528582}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Great location to visit all of NYC from. Access to excellent restaurants in Red Hook. Close to \"Citi-Bike\" dock for eco-travel to Little Italy, China Town or to the bike path along the Hudson! We took the bikes over the Brooklyn Bridge to bike along the new Brooklyn Bridge Park!", "title": "NYC", "helpfulness": 1, "user": "Mary Anna B", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170384625}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This was out second trip as a family (13 year old son). Since we were not necessarily focussed on the mid-town attractions it was a great location. Easy walk to the Brooklyn bridge, Chinatown, Little Italy and near the Fulton street subway junction of multiple lines.", "title": "Great base for trip 2", "user": "JKNTravellers", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169996171}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "When we arrived, it looked like there was a shortage of twin rooms and we agreed to switch to a queen room w a roll-away....but with a TERRACE that had views of the bridge and Freedom Tower! Room was very spacious with a large bathroom. Compared to our last stay in the MSG area this was very quiet. The Seaport area is still gaining its feet after Sandy, but there were still many food options around, as well as a Fulton Market and a Duane Reade. The area is clean and relatively quiet, safe and for a little action, you can go to the Seaport Smorgasbar run by Brooklyn Flea.", "title": "SEAPORT HAMPTON INN", "user": "Jamie G", "date": "July 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169838609}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I'm more concerned with value than price. If I pay $60/night, I expect a $60/night experience. If I pay $500/night, I expect an experience to match. This hotel was a great value for what I paid, and I felt safe enough to walk to and from the Financial District after 10 p.m. I'll stay here again if I need to be in South Manhattan.", "title": "GREAT value", "user": "Randy S", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169559328}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed for two nights in a twin room. The super comfortbale beds, genuinely friendly and helpful Front Desk staff, complimentary wifi and the perfect complimentary breakfast make this hotel the ideal base to explore the exciting city of New York. We found no issues with noise or elevator waits. The entire downtown area is within walking distance and the rooms are super clean with excellent newly renovated bathrooms. Great value for money, to be recommended.", "title": "Perfect base to explore NYC", "user": "Marcusw69", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169383214}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "From the moment we entered the hotel lobby doors we felt as if we were some superstar guests they were waiting for. From check-in, to helpfulness in getting us around town and supplying maps, to answering our many tourist questions, to fixing the A/C problems, this hotel staff was simply AMAZING. The accommodations were comfortable, the breakfast sufficient and varied. We could not have asked for more. Even the price of the parking ($20/day) was low for the area. The location was great for us as well.", "title": "Over the top in Customer Service", "user": "Stefan B", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168499417}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed here for three nights and were happy with the entire visit.", "title": "Great Location Value. Very Clean and Comfortable.", "user": "AmyFlossy", "date": "July 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0}, "id": 168304501}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Pros:", "title": "Staff was intimidating when rooms were not ready!", "user": "Linda L", "date": "July 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168259852}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Great hotel in a great area. Close to Wall St, World Trade Centre, Battery Park etc. Lovely room, big enough for three of us. Only complaint, the computer in the lobby was hard to get going but the wonderful manager at the time was good enough to lend me his own laptop, which was much appreciated. Would definitely go back again. Lovely, helpful staff.", "title": "Seaport area hotel", "user": "Geraldine C", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136705233}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I don't even know where to begin with this report. This hotel is not only centrally located to just about everything but the service is outstanding! The staff deserve an award for how they care for the guests. The breakfast in the morning was great, the front desk staff is out of this world fantastic! The rooms are gorgeous and very clean. There is nothing this staff won't do to ensure that you have a great stay at their hotel. I will definitely be back there again. Thank you to Jennifer and all of the staff who made my stay so awesome on 7/22/2012!", "title": "The most fantastic service of any hotel I have ever stayed in", "user": "SueS7", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135479539}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "finding this hotel was a bit of a challenge. we made several calls to the desk and the staff member actually came out and crossed the street waving his arms to help us find the place! it was a tight room - not a lot of space to walk around so we had to place our luggage strategically. very neat. nice staff. too bad there was no pool.", "title": "great staff", "user": "RamonaLP", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 135386438}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The staff was amazing! They went out of their way to accommodate me during a stressful time. I noticed that they went the extra mile for other guests as well. This was definitely a family friendly hotel and I hope to stay again when in New York. Thank you Luisa, Dahiana, Jennifer, Jose, Pedro, Ruth and the rest of the wonderful staff!", "title": "Great staff and accommodations", "user": "Lynn H", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135282940}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This had to be one of the best hotel stays I have had, and I have stayed at a number of hotels. My wife and I stayed three nights and the staff was excellent. They made it an excellent experience. Can't say enough about how nice and helpful they were. I had opportunity to meet Elizabeth the GM, Ruth and Jennifer at the Front Desk and Pedro. There were others as well, but I didn't get all the names. It was like visiting with family. When we returned from walking in the city on a very hot day, Pedro met us at the door with ice cold bottles of water. There were cookies at check-in. The breakfast was excellent and the menu was different each day. We were always greeted as we entered and left the hotel. When we checked out, the staff called a taxi for us.", "title": "Great Stay and Excellent Staff", "user": "kmurf49", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135013809}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We arrived earlier and they found a room for my family. All the staff was very helpful. I wil recomend if you are staying in the area. The location is perfect, you can walk to a lot of place like 911 memorial, Seaport, City Hall, Trinity Church, etc.", "title": "Excellent Service", "user": "Robert M", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139436012}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Breakfast was good and plenty of food. I will use the next time we stay the this area of NY.", "title": "Dishonest and Poor Customer Service", "user": "Jorge M", "date": "August 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 138899679}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I stayed here last spring and after a night out, returned to my room and found it flooded with water. When I went downstairs to check, they told me the toilet had overflowed because I put too much toilet paper in the toilet. I asked for a new room and they said they didn't have one and I would have to stay in the room I had been in. I complained and they offered a full refund. I asked what else they could do and the night manager said he'd have someone call me. When I went back upstairs, I discovered that the toilet handle was faulty - whenever you flushed the toilet it remained pressed down and that's what caused the flood. I called downstairs to explain this but the night manager didn't seem to care. After spending the night in the flooded room, the next day I got a call from the day manager. She reiterated the claim that it was my fault that the toilet flooded - I explained once again that the toilet was broken. After some back and forth, she agreed that they would refund me and also issue a one night free voucher. Fine. We hung up. Months later, I received the free night voucher but the charge was never removed. After calling several times they stopped returning my calls. I finally filed a dispute with Amex and in their response, the Hampton Inn's report was full of lies and exaggerations. This is how they treat their hotel guests (and I am even a Gold HHonors member)? So disappointing.", "title": "great seaport location and more", "helpfulness": 1, "user": "scott1459", "date": "August 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 138034464}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "great seaport location", "title": "Great Hospitality", "helpfulness": 2, "user": "Chris R", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137277802}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "price and service were great. room a little tight with 2 queen beds in there ,but very clean with no problems. my bed was a little 'springy' though. the staff were very accommodating and always met with a smile. easy walking distance to seaport glitz and 15min. walk to little Italy. parking garage across the street was a big plus. make sure to get front desk to validate it.", "title": "Excellent value (for NYC!) and location", "helpfulness": 2, "user": "FlamingoJohn", "date": "August 14, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 137195219}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I was skeptical when I first looked at the hotel website, but what the hotel lacks in facilities and ambience it makes up for in comfort and good service.", "title": "Great Location", "helpfulness": 1, "user": "deborah.w", "date": "August 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19176419, "likes": {"liked": "— Comfortable beds", "disliked": "— The lift - it's very slow, and get busy during checkout time so you have to be patient."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "Breakfast is served in a small area adjacent to the reception area and can get quite busy. However, there are lots of places to eat locally so you should be able to find somewhere to eat quite easily if you choose not to have breakfast at the hotel.", "title": "Excellent NYC bargain", "helpfulness": 1, "user": "Trish0928", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19036272, "likes": {"liked": "— Location, outstanding staff, clean comfortable room", "disliked": "— breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "The rooms are very comfortable and perfect for a short break.", "title": "couldn't beat the price", "helpfulness": 1, "user": "bojette", "date": "July 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18443943, "likes": {"liked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The reception staff are particularly helpful. Would definitely recommend.", "title": "Great Location", "helpfulness": 1, "user": "deborah.w", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17015521, "likes": {"liked": "— Comfortable beds", "disliked": "— The lift - it's very slow, and get busy during checkout time so you have to be patient."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We stayed at the Hampton Inn Seaport during our tenth anniversary weekend. I'd booked it through hilton.com and got an outrageously good rate, $171/night (thanks to my husband being considered elderly we got the AARP discount), which is practically unheard of for a decent Manhattan hotel. The staff, as many have mentioned before, are outstanding. We had a room on the eighth floor. Since it 's New York the room was small but it was clean and nicely decorated, a deep-blue wall giving it a boutique look. The bathroom, also small, still had a marble counter and floor and the shower was more than adequate. The room was quiet, the beds comfortable and the climate control was good. The hotel is adjacent to the South Street Seaport and the Fulton/Nassau Street subway stop is maybe a ten-minute walk. The neighborhood is relatively decent so don't worry about coming back at night. The free internet worked fine (although if you're off it for any length of time you have to log back in). The free breakfast was meh, but it was free. If you're looking for luxury surroundings go uptown, but for a place to crash you're not going to do much better than here.", "title": "So pleased we believed the reports on this site", "user": "Roxy-Popsy", "date": "June 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16926684, "likes": {"liked": "— Cleanliness, location, plentiful breakfasts & helpful friendly staff.", "disliked": "— breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The Hampton Inn in the Financial District is a newer property and features very comfortable rooms, nice bedding/linens, flat screen TV's mounted on the wall, and nice bathrooms. As far as Hampton Inn's go, this is a very nice property.", "title": "Great Room, noisy & not the best location", "helpfulness": 1, "user": "ohbuddy18", "date": "November 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 11164106, "likes": {"liked": "— great, modern rooms, affordable price & excellent staff", "disliked": "— had to subway/cab everywhere - area around hotel is still developing (but getting better!)"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The Service was excellent. There is a doorman, whose name escapes me, who was very helpful and had very good local insight. He gave us detailed directions to everywhere we wanted to go. The front desk staff and everyone else was very nice.", "title": "Can't understand how it is rated so highly", "helpfulness": 2, "user": "BuffaloNYTraveler", "date": "November 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 11093917, "likes": {"liked": "— Convenient to shopping and restaurants", "disliked": "— the hotel itself"}}, {"rating": 3.0, "title": "Clean, good bed, tiny room, overpriced", "text": "The only negative was that the way the rooms were situated was such that all room doors on a floor opened into a common area - there was no hallway. So, if people are going out for a nightcap at 1,2,3am, you can easily hear slamming doors, cell phone conversations, etc...this is more of a \"heads up\" not a reason not to stay here at all.", "helpfulness": 1, "user": "jdrive", "date": "November 8, 2007", "id": 10693116}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Also, the location was good for history buffs (wall St., financial area, 9/11 memorial area, south street seaport) but we didn't really find a whole lot to do within a short walk from the hotel. There were 2 subway stops close by, and both were easy to get to and made transport into mid/upper Manhattan easy. Just know that you're going to have to ride the subway or take a cab to get anywhere other than the few blocks around your hotel (chinatown/little Italy is about a mile walk - not TOO bad...) If you're OK with that, this hotel is an excellent and affordable choice (we paid $179/night over Thanksgiving weekend!)", "title": "Excellent Hotel", "user": "SimonHunter", "date": "November 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10569845, "likes": {"liked": "— Great room and fantastic staff", "disliked": "— nothign really - perhaps a little walk to tube station"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I fully recommend this hotel!", "title": "What a great find.", "helpfulness": 2, "user": "CoffeemonsterUk", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10169278, "likes": {"liked": "— Amazing bed!", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We travel alot to NYC and usually stay at the Hampton Soho. This was my first time to this property. At first we found the location to be too far out of the way and away from our friend's who live in the City, but after we got used to the location and the subway stops, that worry faded away.", "title": "Large Room, Excellent Staff, Noise is a problem", "user": "Lauraloha", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 174748384}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "This location is very close to the Seaport area, WTC, Century 21 and believe it or not, only 5 minutes walk to Mott Street and the heart of Chinatown where you can easily walk to Soho or LIttle Italy.", "title": "Seamless & Flawless", "user": "Magdalana S", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 174773073}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The staff was amazing, more than accommodating. The room was HUGE for NYC, we were on the sixth floor on the corner and enjoyed a king size bed, view of the new Freedom Tower and a large bathroom with lots of counter space.", "title": "Great Value", "user": "luvthebigapple", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174606107}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The only drawback and this might be a deal breaker for some, was the noise. They are doing construction right outside the window and it is noisy. One night, we came in at 1 am and there was a large generator going all night long. Earplugs are a must. Aside from that if there are children on the floor running around and yelling, you can hear everything. I was shocked at the noise level at times. Perhaps this is a temporary issue, not really sure.", "title": "Awesome staff and great location!", "user": "Annamarie A", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174605031}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Hampton Inn is known for the free breakfast, however, we never eat it as it is not the quality of food we enjoy. We found more than one excellent coffee place and breakfast in the neighborhood. Fulton 55 is a full service grocery store with deli that is very very close.", "title": "Hidden Gem", "user": "MaineCardlady", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174249395}, {"rating": 3.0, "title": "Good location,great staff, little sleep", "text": "We had a double queen overlooking the street. The room was amply spacious ( for 2 adults+2 kids),newly renovated, clean and very comfortable but noise was a problem. If you are not on a high floor at the back of the hotel, you won't get much sleep.Unfortunately, the hotel was full, so there was no chance of a change of room.", "user": "fraire", "date": "September 14, 2012", "id": 140256718}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "On a more positive note, the breakfast was really quite good,despite the lack of seating at some times, and the staff were welcoming and friendly at all times.", "title": "Great hideaway", "user": "808carolynb", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140145873}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My cousin and I stayed here for 4 nights at the end of August. There was construction outside, but besides seeing it from the window, we would've never known otherwise. Larry and the staff were amazing, from helping us with the 9/11 Memorial tickets, to telling us the best subway line to get somewhere. And hailing us a cab back to the airport. Breakfast was in a small space, but plentiful in selection. Great for those picky eaters. Room was super clean, small, but what do you expect in NYC? Overall, the best hotel experience I've had. Would definite stay again if I ever get the chance to visit again!", "title": "A NYC Labor Day weekend celebration", "user": "WANNA2travelMORE", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139682393}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "In NYC for 5 dys. with my 80 y.o. parents, celebrated their 63rd wedding anniversary. Loved, LOVED this Hampton Inn. Staff remembered to give a bottle of wine to my parents. Everyone, including Nino, Larry, Freddie & cleaning staff, were so helpful. The breakfasts were fantastic: omelettes, pour your own waffles, yogurt, fresh fruit, fruit cubes, danish, toast, 3 types of cereal, choices for coffee, tea & hot chocolate. Neighborhood incredible, friendly, safe...complete w/couples w/strollers. Close restaurants run the gamit fm \"Grandmothers House\" to high end foodie joints. Rm beautiful, little tight, wish there were dresser drawers. My little doxie liked it too. Again H.I. staff VERY accommodating w/dog. Would definitely stay here again. I hope sooner than later!! SATISFIED!", "title": "Has a lot going for it", "user": "HiltonHonors25YR", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 139529051}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This is a typical NYC hotel in that it has small rooms in a small, almost obscure, building but it has a lot more going for it. Great front desk service, great location with lots of good restuarants in the area. It's clean and relatively new, with a decent breakfast, comfortable but almost too soft beds and cold quiet AC's. Downsides are loud banging doors and nightly construction next door (tearing down the old post office in Manhattan) but the hotel can't control that. The fitness center consists of two pieces of equipment, stationary bike and a treadmill, in a room the size of my closet at home. This is New York . . . forget about it (working out that is!)", "title": "Long Week-end", "user": "Yann2002", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139504160}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 22, "average": 44, "very good": 135, "terrible": 6, "excellent": 214}, "aka": "Hampton Inn New York Seaport / Financial District Hotel", "slim_ranking": 0.349887133183, "description": "Opened in 2006, this New York City hotel is in Lower Manhattan's Financial District. The South Street Seaport is just two blocks away.The Hampton Inn serves a complimentary On the House hot breakfast buffet daily. Guests in a hurry can grab a complimentary On the Run Breakfast Bag weekday mornings.Complimentary wireless Internet access is available in the lobby, meeting rooms, and guestrooms. Each afternoon, the hotel provides complimentary warm cookies with milk in the lobby."}