{"user_rating": 4.5, "review_count": 80, "name": "Hampton Inn Clarksville", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "After a long, rough day of traveling and sitting at a standstill on I-40 east of Little Rock, I was delighted to find a Hampton Inn at such a wonderful price. I did see the renovation sign but we were not bothered by any dust. Not very much to eat nearby except Hardee's and the food there was terrible. The pool area was very nice and the beds were very comfortable. Front desk staff were professional yet friendly. In addition to their coffee there was also peaches and fresh summer tea available. We would not hesitate to stay here again.", "title": "Would stay again", "user": "Stacie A", "date": "July 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135630121}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Spent one night at the Clarksville Hampton Inn. A large sign at the front desk said to pardon their dust, renovation in progress. This sign was not there when we checked in, but was present the next morning. Our room was very clean, beds comfortable, and the price was great. However, by the middle of the night, the dust really began to bother us. Had to get up early and leave in order to breath normally. The hot tub was out of order, not a good thing. The employees were professional and friendly. I am sure this will be a nice place to stay once the renovations are done, but if you have any type of respiratory problems, this is not the best choice at this time. This is our first unpleasant stay at a Hampton Inn, and hopefully it is only a temporary thing for this hotel.", "title": "Under Renovation", "helpfulness": 5, "user": "rqw", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 130240634}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "A vacation destination? Probably not. (Even though it did have a nice pool area). Clean, great place to stay when traveling on I-40? You bet. Friendly staff. Clean rooms and bathrooms. My room even had a welcoming towel sculpture like you might find on a cruise ship. Nice personal touch. The building is not your typical cookie cutter Hampton, but an earlier model. Nicely renovated, however. 4 - star instead of 5 just because it's right on the interstate which limits its exterior atmosphere, but I didn't notice traffic noise.", "title": "What you've come to expect from Hampton. Worth a stay.", "helpfulness": 2, "user": "OnTheRoadAgain38654", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 128625249}, {"rating": 3.0, "stay_parameters": "Stayed December 2011", "text": "On my stay it was $15 cheaper a night than Russelville' version of Hampton just 20 minutes down the road. I was on business, but wouldn't hesitate to stop with the family. Kids would enjoy the pool", "title": "Interior still in 80s country setting", "helpfulness": 1, "user": "Fredbroncos", "date": "December 30, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 122273260}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "This Hampton was clean and staff was very nice. The outer appearance of the hotel and the lobby are modern. The rooms are a throw back to some of my older relatives homes I have stayed. The only updates to the rooms has been the shower stall. If you want a clean place to stay then the hotel is fine but it is a little behind the times with other Hamptons that I've stayed in.", "title": "Gem of a hotel", "helpfulness": 1, "user": "Debi B", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121970229}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We have stayed at the Clarksville Hampton Inn numerous times over the years. Our recent five week trip started, and ended with stays there. We are always extremely pleased with our accommodations and the staff there. I'm not sure how they maintain that \"new\" look but the place always looks like it just opened. We paid three times as much at some places and some were fancier but none was any cleaner, more comfortable or had a nicer staff than Clarksville. Keep up the good work Nancy and crew.", "title": "Same high quality", "helpfulness": 1, "user": "R&MRich", "date": "November 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48571651}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This was one of the best accomodations we've stayed in on all of our travels. The staff at the front desk as well as the breakfast bar attendant were extremely courteous and friendly. After we got settled in our room, the front desk clerk called and asked if everything was o.k.. We were very impressed.", "title": "Friendly Staff - Clean Comfortable Room", "user": "cowboy6278", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46576703}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Enjoyed the breakfast, the room, decor - everything. Actually, we enjoyed the \"cowboy bordello\" look, especially after we toured the Miss Laura's Visitor Center in nearby Ft. Smith.", "title": "Hire a real decorator", "user": "DeAnne44", "date": "December 21, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 22899714, "likes": {"liked": "— Lobby decor"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "This motel was a short drive to Mount Magazine State Park as well as five local award-winning wineries.", "title": "Absolutely Brilliant !", "helpfulness": 1, "user": "Ozcfied", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21914496, "likes": {"liked": "— The staff are this motels biggest asset", "disliked": "— Having to leave..."}}, {"rating": 5.0, "title": "Wonderful Hotel!", "text": "The real commodities: comfortable bed, clean room, working heat and air were fine, but the decor in the hotel lobby looks like a bordello in a cowboy movie set. It kind of gave me the creeps every time I walked through it. I had forgotten that I had stayed there before and said I wouldn't be back because of it. I was there with numerous relatives and most of them had the same reaction.", "user": "araemck", "date": "October 17, 2008", "id": 20949258}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "We stayed here 3 nights while visiting family. Hotel is currently renovating, but we never heard anything or inconvenieced in any way. Hotel was super clean, comfortable newly renovated rooms, terrific fresh and hot breakfast, friendly staff, and all at a reasonable price. Great stop on I-40!", "title": "Great Hampton Inn!!", "user": "Tessa C", "date": "November 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146070127}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My wife and I stayed one night at the Hampton Inn-Clarksville on October 28, 2012 while on a Fall Foliage Roadtrip in northern Arkansas. The motel was very easy to access from I-40. The front desk personnel were friendly and efficient. We enjoyed the free breakfast the following morning which offered a good variety of choices. Nice quite, comfortable stay. Would choose them again it we are in the area.", "title": "Comfortable and Clean", "user": "BankguyArkansas", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145446784}, {"rating": 4.0, "title": "Exceeded Expectations", "text": "Lovely clean room, comfy bed, quiet, kind helpful staff and a really nice breakfast. Hotel appears to be fairly new with stylish decor. Note that there is a nifty light near the desk that adds a dim illumination along the crown molding of the closet and desk area above the curtains. This jernt is now a staple for our many journeys out West! WE WILL BE BACK!!", "user": "bcy1111", "date": "November 5, 2012", "id": 144624887}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Staff very friendly. Good refurbished rooms. Very comfortable bed. Good variety for breakfast. Quiet relaxing atmosphere just what we wanted after a long drive. Fridge and microwave in room Would definately stay again", "title": "Enjoyable stay", "user": "1hd", "date": "October 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 144033164}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We really appreciated the welcome we recieved. Even an invitation to eat Natchos as an evening snack as we checked in. Staff could not have been more friendly and helpful.", "title": "stop here if you can", "user": "Dave C", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140598964}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Clean and comfortable rooms. Very good breakfast. Responsive and caring staff.", "title": "Excellent Choice for Ozarks' Parents and Visitors", "helpfulness": 1, "user": "Sam3854", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118757829}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We have stopped here many times over quite a few years (on I-40 to and from Texas) and have always made this our half-way point because we know there will be great accommodations and friendly staff. We think it is worth our time to get on Tripadvisor and give the hotel and staff an excellent rating. We have nothing negative to say - Clean comfy hotel (we LOVE the new decor), friendliest of staff, and very reasonable rates.", "title": "Excellent every time", "helpfulness": 1, "user": "Suzanne E", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117773305}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "I was visiting friends at the University of the Ozarks and this was a perfect place to stay. The room was clean and comfortable. Breakfasts were good and I liked it that they even had breakfast to take out ready for those who didn't have time to sit and eat and only could grab a bag to go.", "title": "Nice little hotel", "helpfulness": 1, "user": "CruzC", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 5.0}, "id": 113147266}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I liked this place. It was fairly quiet, with some slamming doors late at night. The room was comfortable and clean, the staff friendly. It was well located for my purposes, right off the freeway and close to my workplace. There were not any good restaurants nearby but it was a quick trip down the freeway to the next exit for that (well, as good as restaurants get in Clarksville, AR). My only complaints were: I killed a giant bug in my bathroom the first night that was absolutely disgusting; there was no fitness center BUT the hotel has an agreement with the Holiday Inn Express next door to let their customers use their fitness room; and they had only an indoor pool while the Holiday Inn next door had an outdoor pool, and I was there in hot, sunny weather. I wouldn't have discovered the outdoor pool next door if I had not used the fitness center there (2 treadmills, 1 elliptical, maybe a bike?). When I had come over from Hampton that morning to work out, Holiday Inn workers gave me a key card to use to get into the fitness center. So I kept it and went back that afternoon after work to use the pool. I was the only one there and no one said a word to me (no one even saw me as far as I know). But I felt a little guilty, and next time I'd do it legally, just stay at the Holiday Inn, IF I thought it was going to be swimming weather. If I didn't care about an outdoor pool or it wasn't going to be swimming weather, I'd definitely stay at the Hampton again. It seemed friendlier. The breakfast was very good; biscuits and gravy, eggs, etc. plus all the usual cold choices.", "title": "Nice comfortable place to stay", "helpfulness": 1, "user": "saraallison", "date": "July 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 73177994}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Although the lobby is a bit overdone it still looks cute. They are always friendly and we plan on staying there on our trips west and on the return east. Nice business center for a small motel. Rooms are always clean and the staff is exceptionally pleasant.", "title": "Cute, clean with reasonable prices.", "helpfulness": 1, "user": "Captain113", "date": "February 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 54917333}], "location": {"country": "United States", "city": "Clarksville"}, "stars": 2.5, "variance": {"poor": 2, "average": 4, "very good": 24, "terrible": 1, "excellent": 49}, "aka": "Clarksville Hampton Inn", "slim_ranking": 0.142857142857, "description": "The Hampton Inn Clarksville offers free hot breakfasts and WiFi as well as a host of convenient amenities and comfortable guest rooms."}