{"user_rating": 4.0, "review_count": 234, "name": "Hampton Inn Flagstaff", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "A comfortable, clean hotel that is a little difficult to find appatently due to local sign restrictions. The staff we encountered were helpful and polite. My wife and I spent one night there en route to the Granc Canyon. We were completely satisfied.", "title": "Flagstaff Shelter", "user": "Bear27K", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 157914940}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Thank goodness for 100% guarantee! Our room had peeling wallpaper, reeked of wallpaper glue from the hallway, and the duvet had been washed so many times that each square was puckered and bumpy. This is not the highest quality Hampton.", "title": "Check Around First", "user": "Elaine R", "date": "April 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 158145458}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The desk associate on our arrive was very pleasant and helpful, and called us after settling in to see if every thing was fine and if there was any thing else she could do, highly recommend. Very clean rooms pool and jacuzzi was great and the morning buffet was well taken care of.", "title": "Our recent Hampton Inn experience", "user": "Westerntraverlers4", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157222918}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The desk help was outstanding, the women that stocked the café was a hard worker and did her job well. The overall appearance was not good at all. The pool area was run down as was the hallways on the 2nd and 3rd floor. Noise level for sleeping on the second floor was very loud most of the night. The food was not always to my liking. Location was good, parking poor. We stayed two nights while visiting the Grand Canyon, first night was bad enough to make me consider cancelling the second night. While there, and this has never happened to me before, I had been in my room for less than a half hour and I got a call from the front desk, asking me if I was satisfied with the room! VERY NICE.", "title": "My recent Hampton experience in Flagstaff", "user": "Billybob2689", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 156646391}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "We enjoyed excellent service during our stay. Specifically the front desk associate, Claudia and breakfast service by Irma was outstanding. They were very helpful in checking food safety for our daughter who has severe peanut and tree it allergies. Irma and Claudia were kind, courteous, and knowledgable. We appreciated their assistance!", "title": "Excellent service at Hampton Inn Flagstaff East!", "user": "Globetrotters38588", "date": "April 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 156490236}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Very friendly staff; the woman working the front desk upon our arrival made conversation with us and made sure we knew where we were going before heading downtown. Great breakfast in the morning, a woman named Irma was friendly and helpful to my dad and I. Great service all around. Clean rooms. We'll be back!", "title": "Short trip on way back from Grand Canyon", "user": "meghan q", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154403110}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Didn't have much time to interact with staff, but they were professional and courteous upon check in. Breakfast was simple but nutritional. Hotel needs some touches and updates since Hampton has possession over the property but in general conveniently located to the Mall and restaurant areas, a way cheaper and available than other lodging businesses in Sedona.", "title": "on a way to Sedona", "user": "Vlahov", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154390703}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The young lady who checked us in and helped us get settled was wonderful, Her name is Haley and she was such a nice and helpful person she has made our stay here in AZ. one we will not forget. She really knows how to make guests feel right at home. Thanks Haley", "title": "Haley", "user": "RunnelRiley", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154311636}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We found nothing to write home about this facility. It provided what I expect Hampton Inns to have, so only rates an average from me. There was nothing that stood out. From some reading that I've done, we probably would choose the Hampton that is in the west part of Flagstaff for our next stay. It didn't look as fresh as it could. There was neither a mic nor fridge in the room. They are something that I like to see, even if I don't need them that night.", "title": "An average stay", "user": "JohnDeere63", "date": "March 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 154097900}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We would like to Thank Haley for the awesome cookies we were greeted with she was wonderful and so helpful. The room was clean the food was yummy and we had a wonderful time even with the snow which I haven't seen in years! AGAIN Thank you Haley we loved our stay! Keep up the great work.", "title": "Haley", "helpfulness": 2, "user": "RunnelRiley", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154088716}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stay in Hampton Inns a lot - driving highway 40. They are always decent and reliable, but! This last trip, we accidentally made a reservation at the hotel above - We couldn't find it readily because it was not one we had stayed in before. What a surprise and a pleasure. This particular Inn was in the trees, and so charming. The furniture was light wood. The bathroom was wonderfully lit. It was rather small - more boutique than 200 room in and out. We loved it for one night and will certainly return to spend 2 or 3 nights the next time we visit the area.", "title": "A Franchise Hotel With Charm and Personality", "user": "JJtheScrivener", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161336558}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "More Lodge than drop in to sleep place - A real discovery.", "title": "Wonderful stay!", "user": "TravelLove21", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161040180}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "I stayed three nights at the Hampton Inn while visiting Flagstaff and the Grand Canyon earlier this month. It was absolutely the best place I stayed at during my two week trip. Since I first arrived until check out, we were given top notch care. I have nothing but great things to say about the entire staff who were extremely welcoming the entire time there. When checking in I had misplaced my wallet and Jonathan and Claudia at the desk went above and beyond to help me look for it outside in the dark. After a long drive it felt great to be greeted so warmly at the front desk. Claudia was especially friendly and helpful. She not only calmed me down about my missing wallet (which I eventually found) but was extremely helpful and informative about things to see in the area and regarding any other questions or concerns we had about our stay and room. The hotel room was fresh and clean. All the bedding appeared brand new and I was well rested with the comfortable and fluffy pillows and blanket. Breakfast was delicious with a great and satisfying selection. I looked forward to the scrambled eggs each morning! Although I never used them, the breakfast to go bags that were available up front are a fantastic idea! A decent selection of teas and coffee were readily available 24 hours down at the lobby and cookies at the front desk in the evening! The pool and jaccuzzi were warm and clean. Great location if you're looking for some place to drive from to visit the Grand Canyon, Sedona, and the Arizona/southern Utah area. I couldn't recommend this hotel any more!! It was like a home away from home.", "title": "trip homeward", "helpfulness": 1, "user": "bjbernath", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160326302}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "front desk was very enthusiastic in accepting and discharging my visit; room was very clean and bedding was fresh and comfortable; quiet location; breakfast could use a little more variety on the eggs, potatoes, bacon, etc. maybe omelets...", "title": "Quiet, Not next to the Interstate", "user": "Stevi C", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 160194927}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Positives are that the staff is friendly, helpful and professional. Early check in was not a problem. The room was adequate and had the amenities we requested. The hotel was quiet, not the road noise you get close to the highway. However, the hotel is hard to find. The facility is old and looks like they might be trying to do some maintenance or small upgrades. The sheets and towels had a very bad odor, especially when wet. I believe it was the cleaning supplies used for the laundry. The odor was not as offensive to my husband as it was to me but was still not very pleasant. We choose Hampton's when we travel and will continue to do so.", "title": "Another great night with Hampton Inn", "user": "texaslady523", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159802910}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Many of the hotels in Flagstaff border the freeway and the railroad. This Hampton sits back a bit hidden behind the Days Inn and is pretty quiet. For whatever reason, the City of Flagstaff hasn't put enough pressure on the railroads to not blast their horns as they roll through town (I know; fed regulations blah blah) and you will hear them, but at least in this hotel it'll be fairly muted.", "title": "Almost Hampton", "helpfulness": 1, "user": "24601JB", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 159623168}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "As a Hampton devotee, this property really surprised me in condition. The breakfast was not even close. But Jesse and Jonathan and the rest of the staff were excellent. Renovations are underway but the property owners need to step it up.", "title": "Don't be fooled by the shiny sign!", "helpfulness": 1, "user": "Denise M", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159138796}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "What a wonderful stay! Clean, new, and a good value. Made the mistake of going one exit down and being persuaded to stay at another brand's hotel due to the new \"shiny\" sign. What a mistake! The place was old, dirty, and a disappointment from the lobby to the rooms ... and I paid the same price!", "title": "Love the setting, service and location", "user": "swabby1976", "date": "April 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 158718516}, {"rating": 5.0, "title": "Great service great facilities", "text": "We booked two nights (so a Grand Canyon day could be in between) and was not disappointed. Staff was very friendly .. the setting in the pines so peaceful .. and the location was perfect .. just off the old Route 66. The breakfast was good .. not like the Homewood Suite chain but the staff did their best with what they had. Great memories.", "user": "A TripAdvisor user", "date": "April 20, 2013", "id": 158419073}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel staff are very good at making you feel welcomed and accommodating. The rooms there are very clean and comfortable. Over all a great experiance and would recommend this hotel for the price and the service.", "title": "Worst hampton I've ever stayed", "user": "j l", "date": "April 18, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 158156812}], "location": {"country": "United States", "city": "Flagstaff"}, "stars": 2.5, "variance": {"poor": 20, "average": 44, "very good": 73, "terrible": 8, "excellent": 89}, "aka": "Hampton Inn Flagstaff East Hotel", "slim_ranking": 0.184615384615, "description": "Enjoy a warm welcome and friendly service at our convenient Hampton Inn Flagstaff hotel. Unwind in a comfy guest room and watch TV, catch up with work using the handy lap desk, or stay connected with free high-speed WiFi internet access. Surf the web in our free business center offering free printing services, or work out in our fitness center. Start your day right with Hampton’s free hot breakfast and make sure you try our famous waffles. If you’re in a rush, grab a healthy Hampton On the Run® Breakfast Bag on your way out the door, Monday through Friday. Unwind after an eventful day with a relaxing swim in our beautiful indoor pool and whirlpool."}