{"user_rating": 4.5, "review_count": 134, "name": "Hampton Inn Phoenix - Midtown -Downtown Area", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We were traveling through Phoenix on the way to California and wanted a hotel that was nice, in a safe area, not overly expensive, close to I10 access and with a free morning breakfast so that we could get up early and jump on the road. After doing a little research this hotel seemed to fit the bill so we booked a two queen room. The rooms are plain with a large bathroom, both were very clean and everything worked. There were several places to eat within a few miles of the hotel and several museums. The pool area is small but perfect for a quick dip. The free morning breakfast was very, very good. It had everything from cereals to make your own waffles. This hotel was perfect for what we were looking for since we were just passing through. Another reviewer commented on the helicopters landing on the adjacent hospital and of the noise. Several helicopters did land while we were in the pool however that was the only time we actually noticed them. I did notice that we were the only family there with children at the time (5 yoa and a 10 yoa). During breakfast, I could see that this hotel's main clientele is business travelers and those which are visiting the hospital. If we were to be staying in Phoenix longer, then we probably would have gone with a different hotel since this one is a bit bland and almost feels like you need to be whispering so as not to disturb anyone.", "title": "Nice, Quiet Stay", "helpfulness": 1, "user": "Distant Lights", "date": "June 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 67479716}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The staff was very personable and helpful. The room was well-appointed, very clean and the beds were super comfy! And, to top it off, the breakfast was very yummy; my kids enjoyed making their own waffles every morning:-) Then, we enjoyed a relaxing and quiet day around the pool & jacuzzi. Thanks, Hampton Inn staff!", "title": "Extremely pleasant stay!", "helpfulness": 1, "user": "zkatro", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59373253}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Our adult son was scheduled for brain surgery at Barrow Neurosurgical Associates, part of St. Joe's Hospital. We were a little unsure of staying at the Hampton, which is so close to St. Joe's, it's almost connected. It's actually on hospital grounds. The reviews in Trip Advisor were mixed. What we found was a very nice, clean, room with a decent-sized bath, desk and comfy chair, 27\" TV with a fairly good array of free channels. The beds are super comfy and the all-cotton puffy bedding is even better. Pillows are super soft. A full breakfast is available, free of charge, including fresh fruit salad, make-your-own waffles, egg omelets, meat which varies day by day, cereals, yogurt, various breads, bagels, etc., coffees, teas and juices. The staff is very courteous and the location is absolutely perfect if you have to go back and forth to the hospital. I'm a very light sleeper and had no trouble getting to sleep, because the room was quiet. There are enough restaurants within a short walk to survive -- Italian, Mexican, Thai and a Deli. There's also an egg place with breakfast, lunch and dinner plus a really nice smoothie place and a coffee shop. Can't go wrong with this hotel, and the prices were good too for the proximity to the hospital.", "title": "Perfect accommodations and location for someone accessing St. Joe's Hospital.", "user": "navyguyNewBern_Nc", "date": "March 18, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 58908052}, {"rating": 3.0, "title": "I'm a Hampton fan, but this one needs work.", "text": "Stayed overnight on a business trip, top floor. The hall and room had that sour, musty smell from cigarettes and beer. Had to keep the window open on a cold night. Carpet was worn; bathroom shabby. Helicopters landed and took off all night from the hospital next door. Attention Hilton: this one needs a makeover, soon!", "user": "BobG44", "date": "February 26, 2010", "id": 57189083}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed at this hotel because my fiancee could use his Hilton points. The hotel was fine. The room was nice but a little dark in terms of the color scheme. I've never been to Phoenix before, but even thought the location is listed as downtown, I felt like we were no where near downtown. We were surrounded by the hospital. And driving around on a Saturday night, we didn't encounter much of anything that was open at 8:30pm. They had a decent breakfast in the morning and free coffee/tea in the lobby (a Hampton Inn standard). The staff was OK. Nothing really impressive across the board. Overall, I would only recommend this hotel for overnight stay or business travel. Because there isn't much to say good or bad about his hotel.", "title": "Nice for one night", "helpfulness": 1, "user": "QueenSybase", "date": "May 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 31252841}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Great room, free parking, good breakfast, clean and tidy", "title": "great value and clean", "user": "bitterntraveller", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121820723}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I haven't stayed in a Hampton in recent memory, so I was pleasantly surprised at my experience at this property. The rooms were large and clean and recently redone. Though the toiletries offered were not fancy, the rooms were nearly as nice as the Hilton Garden Inn chain at which I frequently stay. The free breakfast was adequate, and while I didn't use the pool or hot tub, they looked inviting. Give this property a try!", "title": "Hampton Inn is better than I remember!", "user": "DCmetrodogmom", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121606339}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The hotel was under renovation which we knew before we checked in. We called ahead and Chuck gave us a room on the 4th floor (it was already done being renovated). Very nice!!!! Nice decor, nice room, nice breakfast. Parking was fine. It is next to a hospital; however, we never heard any sirens. We enjoyed our stay here. Easy location to I-10. Our only complaint would be my boyfriend didn't like being told he couldn't watch the t.v. in the lobby after midnight.", "title": "Nice Hampton Inn (under renovation!)", "user": "Karla75", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120687574}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Stayed only one night because my convention hotel was full... but wished I'd not. Granted it was incredibly hot outside but I truly expected to check in and cool off. Çheck in went fine. But when I got to the room on the 4 th floor it was 90 inside the room. When the ac was turned on full and the temperature went higher...I figured I had a broken air conditioner. Went back down to reception and was told it was probably just me because it was 110 outside and heat rises. Eventually got a different room on same floor with a functioning air conditioner. But the halls and elevator were hot hot hot. Room was not particularly clean but seemed old and worn out. Afraid to take my slippers off as the carpet was not clean. However I was exhausted and slept ok. Breakfast was nothing special ... Altogether, I don't think I'll be staying at Hampton inns anywhere if they're like this. The smell of the halls alone were a turn off.", "title": "Not for pleasure", "user": "TravMuch", "date": "October 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 119058211}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "After a scary week of doctor consults and tests, my husband was scheduled for surgery at St Joseph's Hospital. He was going to be kept there for a couple of days, so I booked a room across the street at this Hampton Inn. Not only do they give a special rate to families of hospital patients, the parking was easy and free, and I could walk across the street to the hospital without having to drive. My room was excellent (all rooms are non-smoking), and included a microwave, fridge, flat screen TV, and free wireless internet. If you didn't bring your laptop, there is a computer in the lobby for guests' use. Free breakfast is available starting at 6 a.m. with goodies including a fruit bowl and lots of coffee, muffins, etc., A newspaper is waiting outside your door each morning. Free local calls, and the desk staff are kind and accommodating. All together, this hotel gave me the opportunity to focus on what was important without any distractions. Thank you Hampton Inn.", "title": "Hampton aids families of patients at St Joseph's Hospital", "helpfulness": 1, "user": "GoldilocksArizona", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116528303}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My husband and I stayed at this hotel for the night we arrived at Phoenix, and the night before leaving. The rooms were clean, but it seems like the structure itself is somewhat old, and we could hear the floor noise from the people in the room above, and bathroom noises. We also noticed that the toilet kept flushing by itself, and the bathroom sink drained very slowly. It did not bother us much, though. Breakfast was ready on time, and staff was friendly. Despite being next to a large hospital, it was rather quiet and we did not hear much outside noise although we slept with windows half open. We would definitely consider staying here again.", "title": "Typical Hampton Inn", "user": "Fortwood", "date": "March 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125989035}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I had a family member admitted to St. Joseph's Hospital right across the street (a huge convenience and reason for my choosing this hotel). The owners and staff members of this particular hotel are especially considerate of people like me: they have created a special rate for those of us who must have an extended stay, and they work with St. Joseph's Concierge Services to make the stay pleasant and reasonable. Weekend and weekdays vary in discounted amount. MUCH APPRECIATED.", "title": "Special Consideration for Hospital Visitors", "helpfulness": 1, "user": "yosidoming", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124973344}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Every morning, I used the small but adequate gym facilities: elliptical, treadmill, and one other piece of equipment I can't remember. TV w/remote, towels and water available in the gym. This small but significant convenience helped me face the stresses of the day. Of course, the Hamptom always serves up a very nice breakfast spread. And at the end of the day, I could count on a wonderfully comfortable bed, clean bathroom/tub, and quiet floor (2nd floor) to unwind. Room w/ king bed big enough to do yoga (unlike other newer Hampton's where a king room is a tight fit--Alpine, TX, for example)", "title": "Solid choice for business lodging", "user": "TechSMU", "date": "February 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 124349995}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "Stayed one night on recent business trip. Rooms were clean, staff very helpful and breakfast above average. Would stay here again.", "title": "Great value but noisy", "user": "Cheryl F", "date": "January 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 122732964}, {"rating": 3.0, "title": "What you'd expect", "text": "Stayed here January 2012. Similar to lots of revamped Hampton Inns. Rooms clean but sparse (no pictures on walls!) and lots of noise from helicopters flying into nearbY hospital (about 8-10 per day). Hotel had no firm pillows? Workout room was clean and the temperature was cool.", "user": "234stevenz", "date": "December 25, 2011", "id": 122095802}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel is a wonderful find. it's very clean, the staff members are on the ball and very helpful. Our only complaint: the smell of someone's cigarette smoke coming through the vents into our room and into the bathroom when we arose in the morning. I'm not sure what can be done about that, however. We didn't have the opportunity to have the complimentary breakfast, as we had to leave early, but it looked very good.", "title": "Great Place", "user": "Grmpmbl", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115288030}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I stayed here based on previous TA reviews and responses from the GM and I was not let down. I was checked in by Mary Beth, who I had heard of in previous posts and she is just as wonderful as everyone else has said. Everything was fine, from check in to the room, location, breakfast, etc. In fact I had to laugh...in the middle of the night I woke up....thinking I was at home.....the room next door started playing loud music around 2am. I called the desk and twenty seconds late I could hear the phone ringing in the room next door! Not another noise from the the rest of the night!!! You guys are better then the cops in my home town, lol!!! Thank you for a lovely stay....will be back in a week to round off our vacation.", "title": "Comfortable and friendly", "user": "rsilly11", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101814761}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This was my first trip to AR and I was very pleased with my stay. The hotel was clean, comfortable, located in safe and convenient location, and had the continental breakfast. I am a huge coffee drinker and the free ALL DAY and NIGHT coffee was HUGE for me. lol The staff was very pleasant and helpful with all of my questions regarding restaurants, sights to see, etc. I was very impressed and will stay here again...", "title": "fabulous stay", "user": "ga_girl1969", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97291603}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "It is apparent to me that the computer in the lobby/dining area needs to be upgraded.", "title": "Comfortable, clean and very hospitable. Chuck in particular does a very good job.", "user": "ConsultantVLHS", "date": "January 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93975496}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I went down here for the SME conference it was very close to the tramline which could take you just about anywhere you wanted to go. It was also very close to the hospital. Fresh cookies were always a nice treat in the lobby. It was not attached to the conference, but for $2.00 a day I didn’t mind taking the tram. The room was always clean. The hotel appeared to have 100% occupancy because of the conference but service was great.", "title": "Great for a convention", "helpfulness": 1, "user": "Sara_Kadow", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 85510443}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 3, "average": 17, "very good": 40, "terrible": 2, "excellent": 72}, "aka": "Hampton Inn Phoenix Midtown (Downtown Area) Hotel", "slim_ranking": 0.107344632768}