{"user_rating": 5.0, "review_count": 303, "name": "Hampton Inn Bangor", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Whilst I am not a fan of chains of any kind (restaurant, hotel etc.) the one thing that they bring is consistency, or at least they are supposed to, and Hampton Inn in Bangor does not dissapoint.", "title": "Brand new property.", "user": "chipmanh", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151293074}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "This is a very new property, replacing their former location across the street. It is off the beaten track and is quiet and well done.", "title": "The Best!", "user": "judylivestotravel", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150617543}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "What a wonderful stay. The staff was the best. We often stay at Hampton Inn and I must say this recently opened Inn has to be the best ever. The hotel was quiet and the staff bent over backwards to make sure every need was met. My mother, granddaughter and I spent 3 nights. They serve a nice breakfast in the morning and cookies every night. Rooms were clean and fresh every day. We used the business room for the computer and also toke advantage of the guest laundry area. We were able to wash our clothes before leaving. We really enjoyed our stay. Our room was a nice size and we had plenty of room for a cot.", "title": "Well worth the money", "user": "Cuzinclem71", "date": "January 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150547998}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "I stayed there January 22 to 24, 2013. I paid their web price of $109/night. With an adequate free breakfast each morning, free cookies, coffee, tea or hot chocolate whenever. Free wifi. Pool, hot tub and exercise room on site. Very good value. Not to mention complimentary offerings each night with the manager. One night was beer/hot wings. Next night was chili, followed by wine and cheese the next.", "title": "Staying for 60 nights!", "helpfulness": 1, "user": "Brian M", "date": "January 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150540470}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "All staff were pleasant and always said hello. Funny thing is a lot of the clients were the same. I guess it is catching.", "title": "Awesome Stay over Christmas", "user": "mseckora", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150496325}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "A basic Hampton Inn that has the bonus of being less than a year old so everything is nice and shiny. Added benefit of it being new is that it was not that busy the two nights I stayed there. The pool is very nice and the floor around the pool soaks up water - very cool. Okay gym. Breakfast was the same as other Hampton Inns - reheated precooked eggs etc. If you want a larger room ask for the second floor near the elevator. For some reason those rooms are larger than average. Very quiet hotel when i have stayed there. Good value for the money.", "title": "A New Hampton Inn - stay on second floor.", "user": "chickydoo3", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150446454}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Hampton Inn in Bangor is new - summer of 2012 and shows it. Beds are great. The decor is fresh. My one complaint is that the rooms have one adequate desk chair with arms. The only other chair in the room is a straight chair, located in a corner with no light or table nearby. It is useless. If there are two people in the room one must sit on the bed. Breakfast is standard for Hampton chain. I request the Bangor hotel add hard boiled eggs. The phony eggs are awful. They did have wonderful donuts though!", "title": "Comfortable, Clean and Convenient", "user": "Birdwalk48", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150422141}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at the Hampton Inn in January for two nights. Although I had been unable to enter my CAA details when booking online, on arrival the very helpful receptionist was happy to do it for me, thus giving me a better rate for the room. We had a king room on the ground floor and it was very spacious, comfortable and very clean. The hot breakfast was great. Most importantly, the staff were all friendly, professional and very helpful which is not always the case in even so-called top quality hotels. Ok, so as one reviewer wrote \"it's a Hampton Inn\" - yes, it is, so it isn't going to the Ritz but why would you expect it to be? It is excellent value for the money and we were very happy with our stay. Nice job, Hampton Inn, Bangor - very well done!", "title": "Excellent Value", "helpfulness": 2, "user": "Margaret S", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150345412}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed at this hotel 1/18-1/20, 2013. It is a brand new facility. It is extremely clean and comfortable. The rooms are large, the beds are very nice, and there was a fridge and microwave in the room. They offer free cookies at night. They have free coffee, tea, and hot chocolate at all times. The saltwater pool is great. The free breakfast has a great variety of hot and cold items. It seems like a great place to work as every staff person was very polite and helpful. For the money, it would be hard to beat this hotel. It is definitely the best Hampton Property that I have stayed at to date.", "title": "Quality is Outstanding for the Price", "helpfulness": 1, "user": "rshaw24", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150267828}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This Hampton Inn is brand new (built last July, I believe). Everything about it is terrific. I certainly hope the management keeps it up because there are so very few hotels that are worth going to these days. Great job, Hampton!", "title": "Great Experience", "helpfulness": 1, "user": "dammish30", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150159669}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Make no mistake, there is a reason why this hotel is currently one of the top hotels in Bangor (according to all the latest reviews). With people using words such as “bright”, “clean”, “new”, and “service”, this hotel certainly lives up to the expectations. I have stayed at all but 3-4 hotels in Bangor/Brewer over the last few years, and this hotel is, without a doubt, on my top three list. The hotel is very clean and bright. The rooms are spacious and the beds offer a wonderful night’s sleep. Very rarely do I have a night in a hotel without some anxiety… but not here. The sheets, pillows and cover were clean and new… even after careful inspection. The décor throughout the hotel is current and slightly above par for most new American hotel trends; trends which have still not found their way to most of the hotels down on Odlin Road. I really enjoyed the regional décor highlight the state of Maine, particularly with the room number plates (see photos). The morning breakfast is wonderful as well! There are plenty of selections that will provide an adequate start to any day (without having to find breakfast elsewhere!). Another plus is the staff at the hotel: All the staff greeted me with a smile and hello. It was apparent that the hotel was well staffed and even the breakfast team was efficient and friendly, even visiting each table to ask if everything was fine and giving guest a box of mints. The hotel's location is a short drive to shopping and likely most area hotels, is unable to offer much for interesting views. If I had one complaint, it was with the pool: the chlorine was a bit much and it wasn’t long before most of the children were coughing in rhythm. But if this little issue was taken care of, the pool would certainly be one of the best hotel pools in Bangor. Perhaps the hotel might be a bit over budget for some vacationers. However when you factor in the gracious breakfast and the top-notch condition of the rooms and beds, you might come out on the losing end if you choose another hotel (what price do you put on cleanliness and a worry-free sleep?). The people have spoken; Hampton Inn Bangor is the best choice in Bangor!", "title": "Top Hotel in Bangor", "helpfulness": 3, "user": "StandingRoom", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152284979}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Our stay was perfect from the time we called reservations until we checked out. The employees of this property are beyond wonderful. Every one of them are cheerful and pleasant.", "title": "THE BEST!!!!!!", "user": "emilytuttle40550", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152264412}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Be ready to be pampered when you stay at this hotel!", "title": "Superb customer service", "user": "Bossyboss", "date": "February 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152196523}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "My stay at the Hampton Inn in Bangor was the most comfortable as well as relaxing experiences away from home I've ever had. I was blown away by how kind and friendly the staff and especially management I was very impressed!!checking in was quick and smooth and I also had the best cookies while checking in I highly recommend the oatmeal raisin ones so delish!! The breakfast was A+ loved the pool and jacuzzi of course the floor that soaks up the water in pool area was so neat I could go on forever but bottom line is I loved my stay and will definitely be returning to Hampton Inn Bangor Maine!!", "title": "Excellent Hampton Inn!", "user": "ValcourSJ", "date": "February 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151982236}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Stayed at this beautiful Hampton Inn before our flight to Florida and on our return back.", "title": "Blizzard Angels", "user": "Michael W", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151844258}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Just has two nights in the Hampton Inn Bangor with my family. The hotel is very convenient, just off the I95, and very close to big box shopping and lots of restaurants. The rooms and common areas of the hotel are very clean. The staff are very friendly and seem to be proud of their work.", "title": "Clean and Convenient", "user": "NIP777", "date": "February 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 151776758}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The free breakfast was fantastic and the kids really loved the pool.", "title": "Great Place to stay on Bangor", "user": "William S", "date": "February 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151750844}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I'd recommend this hotel for business or family travel.", "title": "Brand new building, helpful staff", "user": "JRS326", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 151629613}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Front desk staff were very friendly and helpful. Do to arriving late and having a pickup truck with a number of items in the box with a cap I preferred a room on the front overlooking parking. I called and with no problem was guaranteed a room in front. Coffee and tea in the lobby was. Terrific breakfast with a good selection of items.definitely a great place to stay.just too bad Bangor hotel prices are so much higher than a little further south.", "title": "Best hotel, best staff and an awesome general manager!!", "helpfulness": 1, "user": "suz42177", "date": "February 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151460195}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I stay in Hampton Inns all over the country for work, and this one is one of the best I've seen. It helps that it's less than a year old. The staff is incredibly friendly and helpful. The fitness center was also pretty impressive for a Hampton Inn. Definitely staying here again next time I'm in Bangor for work!", "title": "New in Bangor", "user": "doctorfat", "date": "February 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151397345}], "location": {"country": "United States", "city": "Bangor"}, "stars": 2.5, "variance": {"poor": 2, "average": 4, "very good": 47, "terrible": 3, "excellent": 247}, "aka": "Hampton Inn Bangor Maine", "slim_ranking": 0.0416666666667}