{"user_rating": 3.5, "review_count": 260, "name": "Hampton Inn Fayetteville I-95", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed here two overnights enroute from the northeast. Okay hotel. Nothing exceptional. The entry to these rooms is from the outside, like a motel room. The air conditioner was set at 62 or so when we got there. Was freezing cold. When we raised it up a little the AC did not seem to get rid of any humidity. I just think something was not working too well with that AC.", "title": "Overnight stay", "user": "JCCCLC86", "date": "August 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 138320858}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I missed having a desk in the room. Used the computer on the coffee table.", "title": "Worth the affordable price", "user": "sink-me", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137770922}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Staff was fine, both at the desk and breakfast area. The breakfast area, however, is very small. The food was pretty good, although no fresh scrambled eggs as some Hampton Inns have.", "title": "Friendly staff", "user": "Bountiful-IA", "date": "August 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 137664493}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Was across the parking lot from Ruby Tuesday so that was convenient.", "title": "Very nice and staff excellent", "user": "skylar64", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137639789}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I have stayed here on business several times. The location is very convenient to I95, the rooms are clean, the staff is very friendly, and the distance to the important sections of Fayetteville are easy to access. I will stay here again. The only negative is the outside entrance to each room although I have never felt unsafe here. The property has always been quiet for me and there is a national chain restaurant across the parking lot that makes a quick meal available.", "title": "Great value!", "user": "Katyb4843", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137621422}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "There is not too much to say about this property. It is a roadside motel. It is clean and the staff are friendly. Perhaps this is one of the best choices in town, I am not sure. Still I would risk it and stay somewhere else next time.", "title": "The staff was friendly- roadside motel", "helpfulness": 1, "user": "kelibundi", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 136485954}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I booked through hotels.com. They said one of the amenities was a detachable shower head...wrong. The shower head was very much attached to the wall.", "title": "An Original", "helpfulness": 2, "user": "jcc_dad", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136432549}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "It’s not often one gets to stay in an original. In fact this hotel bills itself as one of the original Hampton Inns. Historical value aside with a number of positives and some negatives I can recommend this hotel if you can find discounts before staying.", "title": "Updated Review of This Hampton", "helpfulness": 2, "user": "FLAlly", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135922185}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "This was a convenient halfway point for my family during our drive to and from Orlando. With quick and easy access to I-95 and with a gas station right next door, the location makes for a great overnight pit stop. There are also a number of restaurants nearby as well as a grocery store within 10-15 minutes drive.", "title": "Great for a stopover on your way to Florida.", "helpfulness": 1, "user": "ramones07628", "date": "July 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 135334074}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Front desk staff were friendly and efficient during both our visits, getting us quickly checked in even when we pulled in behind two or three other cars. The rooms were a good size for a family of four. No there are not any elevators but the hotel only has two stories so unloading the car was not a problem. However if you have any limitations you may want to request a first floor room. Even with the outside facing doors we were not disturbed by noise.", "title": "Great stay", "helpfulness": 4, "user": "Dbruni", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134614908}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This hotel is right off interstate 95 along with several other hotels, it's an older Hampton inn but very well kept. The doors open to the outside, but clean, fresh walkways, and at no time did I feel insecure. The breakfast area was well run, even with many travelers there. The room was clean and the bed was very comfortable. There is a pizza hut down the road, I got take out, and took it back to my room, enjoyed relaxing in room till hitting the road again.", "title": "close to interstate", "helpfulness": 1, "user": "OvertimeAtDuck", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134272883}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I have stayed at many Hampton Inns and this place seems like it was once a Days Inn or Super 8 - it was not even close to the quality of a Hampton Inn. The hotel is clean and convenient to I-95 but we did not find the staff friendly or overly accommodating AT ALL! I had to call 4 times over a 4 hour period to request a mini-refrigerator in our room before I was finally told that none of the refrigerators can be moved. They moved our room but did not offer any assistance with the move. My partner was not there at the time, so I had to move everything from the 2nd floor to a new room on the bottom floor while 4 housekeepers stood by watching me struggle and asking me when I would be done so they could get in to clean the old room - NEVER once offering any assistance. I would not stay here again and I would not recommend it if customer service is important to you.", "title": "Glorified Days Inn!", "helpfulness": 2, "user": "CaseyandLaurie", "date": "June 27, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132926040}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This hotel is a treasure! Super clean, well-appointed, with large, comfortable rooms, and very pleasant staff. For an extremely reasonable price, we had a great bed, good linens, and an expansive complimentary breakfast with lots of hot offerings (freshly made Belgian waffles and a variety of microwavable foods like breakfast sandwiches, hot cakes, burritos), as well as fresh fruit, yogurts, cereals, and appealing breads/pastries. We truly felt that this hotel welcomes its guests and cares about their comfort. The location, right off I-95 and surrounded by restaurants and gas stations, makes it ideal for travellers, but it is a rare and wonderful thing to find a hotel offering such quality accommodations to its guests as well as convenience. Kudos to the management and staff for providing us with a terrific experience.", "title": "Great hotel, great value", "helpfulness": 1, "user": "Jsan3", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132047963}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed at this property overnight during a weekend road trip to SC. The location was ideal for my needs and the rate was very reasonable compared to nearby properties. This is not your \"typical\" Hampton Inn, but I was appropriately warned on the web site. This is an older property with outside corridors. However, the property was clean and quiet, the room was clean and the staff I meet were very friendly. The only complaint I have is the comfort of the bed. It may have just been our room, but the bed was much less comfortable than what I have come to expect from Hampton Inn's. My Wife and I both woke up with sore back and shoulders. Again, may have just been the bed in our room.", "title": "Older property, but Clean", "helpfulness": 1, "user": "sonofjs", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 132019670}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed at this Hampton Inn midway through a drive to Florida, and I was very pleased with our experience....I'd had the room held for a late check-in, which ended up being just after midnight. We dragged our sorry tired behinds inside to check in, and the clerk at the desk (I believe her name was Crystal) greeted us as cheerfully and pleasantly as if we were rolling in midday. The room was quite small, but everything was immaculately clean and despite our closeness to I-95, it was perfectly quiet as well. In our hurry to get moving the next morning we didn't take advantage of the breakfast, but it looked like they had a nice variety of tasty offerings. Would recommend!", "title": "Clean and comfortable, Grade A staff", "helpfulness": 2, "user": "BearsGirl_WV", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131977736}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "First, understand this is a two story hotel with no elevator and exterior room access...if you find it difficult to haul bags upstairs on your own, this is not the hotel for you. BUT -- it is clean, conveniently located, the staff is nice. Lots of channels available on the TV, free internet, in-lobby free coffee and a limited menu hot breakfast. Next door to a Ruby Tuesday restaurant and to a service station, and less than a block to I-95. Nice pool (exterior, so don't plan on a mid-winter dip!)... and price is quite reasonable.", "title": "Convenient location - but old-style hotel", "user": "EJPVA", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140996412}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Friendly staff, clean rooms, decent free breakfast, conveniently located.......comfortable beds, nice tvs.......isnt the nicest Hampton I have visited but is better than most, and reasonably priced, its definitely worth staying here", "title": "CLEAN AND CONVENIENT", "user": "doc491002", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139809776}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Close to the interstate, clean room, friendly staff, good breakfast! Our only complaint was again: bad pillows! Must be a Hampton thing! The room was slightly updated, the bed was comfy, but our 2nd stay at a Hampton Inn with awful pillows! Otherwise it was great!", "title": "Nice staff, clean room", "user": "Melanie G", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 139589115}, {"rating": 1.0, "stay_parameters": "Stayed September 2012", "text": "This room was utterly gross! First of all it was small and overcrowded with too much furniture. Not to mention the clump of hair on the bathroom floor. You couldn't shut the bathroom door because it was broken. The air conditioner blew out damp cold air and adjusting botox did nothing. It was so damp that the towels and sheets felt wet. We couldn't sleep. Finally fell asleep at 3 and was out of there by 7am. Hampton Inn should be ashamed of themselves. Beds were small and mattress was springy and lumpy. Should have stayed at Holiday Inn next door. Spare yourselves!", "title": "This place is gross!", "user": "kc0512", "date": "September 3, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 139240000}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Our family of 4 stopped by for a night on our way back from Florida. We had a king bed and a pull-out sofa room, which was perfect for my husband and I, and our 2 girls.. The room was very clean, and the bed comfy. The staff was very friendly and tried to make us as comfortable as possible. The complimentary breakfast was probably the best we ever had while staying in a hotel- a really great variety of foods to choose from! Also, they had complimentary 24-hour tea and coffee station in a lobby, which was great. The only issue was is that we were next to a smoking room and the smoke was getting into our room because the two rooms were adjacent, so it was kind of bad, but other than that, no issues! All in all, we felt very welcome and taken care of. Will definitely stop there again, if we're passing through the area in the future.", "title": "Clean room, awesome breakfast, friendly staff!!!", "user": "sunnybaku", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138607314}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 28, "average": 50, "very good": 91, "terrible": 21, "excellent": 70}, "aka": "Hampton Inn Fayetteville i-95 Hotel Fayetteville", "slim_ranking": 0.270833333333}