{"user_rating": 4.0, "review_count": 95, "name": "Hampton Inn Shreveport Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I decided to stay at this hotel because of its proximity to the airport, and it was reasonably priced. The hotel was very clean, and the front desk staff was nice and helpful. The room was typical Hampton Inn room that I'm used to. Clean room, free internet access, free breakfast, and for being close to the airport, it was fairly quiet. I guess Shreveport airport isn't all that busy. The only concern with this place is that it didn't look like a very safe location, at least not safe enough for a woman to go for a run during the day. While I had no problem with the hotel, I might look into a different area next time I visit Shreveport.", "title": "Typical Hampton Inn", "user": "Fortwood", "date": "January 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 12338634, "likes": {"liked": "— Cleaniless of the hotel", "disliked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Stayed here for 2 nights. Tried to book the Tac-Air (general aviation) rate, but the clerks were having trouble with it, even though we were assured they knew exactly what it was and how to do it. Finally they had to shelve the matter until the manager arrived the next morning and they did indeed have it correct at the time of our check-out.", "title": "Middle of the road", "helpfulness": 1, "user": "KYknowitall", "date": "December 3, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 3.0, "value": 3.0, "rooms": 4.0}, "id": 11230829, "likes": {"liked": "— good price", "disliked": "— front desk staff cluelessness"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The hallways were being remodeled with new carpet, and the adhesive and new carpet smelled terrible, off-gassing their toxic stew of vapors. However, the odor did not permeate the rooms, so I suppose they had some good ventilation being applied.", "title": "Almost Nice Stay", "helpfulness": 3, "user": "revkws", "date": "September 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10004935, "likes": {"liked": "— Proximity to Airport", "disliked": "— No Treadmill, No internet access."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The bed was nice, as it almost always is in Hampton Inns. The bathroom was average. Mostly clean, good toiletries, adequate shower. The workdesk was quite nice, rounded and with lots of room to set up my computers and equipment. The breakfast bar was also average Hampton Inn fare. Well tended by the friendly lone breakfast hostess. One evening we asked for directions to an area with a selection of restaurants. The directions given to us took us almost 1/2 hour, and took us through some undesirable areas. Later, upon inspecting a map, we saw that there was a quite more direct route using the interstate, but the clerk seemed a bit confused and/or 'out-of-touch'. Perhaps he did not live in Shreveport. If I am in Shreveport overnight in the future, I will likely try another property nearby but would not hesitate to stay at this Hampton again if the price is right.", "title": "3 good separate stays!", "helpfulness": 1, "user": "PickyHotelGuest", "date": "July 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8209985, "likes": {"liked": "— The comfy bed", "disliked": "— None"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "My wife and I stayed at this Hampton Inn near the airport for five nights. It is very close to the airport and easy to find. It is close to some restaurants and a Walmart is a couple exits to the West. The staff was friendly and wanted to be helpful, but could not fix some of the most basic of problems. An avid walker, I wanted to use the treadmill each day, but it would not work at all. I had to walk around an industrial area that I was unfamiliar with. The staff offered no real solutions. Buy a new treadmill. I could not use the high speed internet at all. I spoke to the tech people on the phone for over an hour and they told me to use the business center. I did enjoy the room itself and the value, but with just a couple of easy fixes this could be a treasure!", "title": "Good Selection Near Airport", "user": "Triplewin", "date": "June 24, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0}, "id": 7975179}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I stayed at the Hampton Inn, Shreveport Airport for two days in early April. The hotel is new and was great for my business stay.", "title": "Great stay on business, highly recommended!", "helpfulness": 2, "user": "TG-ATL", "date": "April 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7280552, "likes": {"liked": "— Room quality, Internet speeds, TV channel selections", "disliked": "— Breakfast was typical hotel continental, nothing special"}}, {"rating": 1.0, "title": "Extremely disappointed", "text": "Rooms: Large, very comfortable. Rooms come with a 4ft fridge and microwave, next to the 27\" TV. TV has HBO in addition to about 60 channels. There is a large desk with power and ethernet Internet access, along with a nice office chair. WiFi is available in the lobby and throughout the hotel. The beds were very comfortable and include a lap desk. Room decorations were nice and made the room feel cozy and relaxed. Each day I was given a small bag of cookies, candies, and a bottle of water from housekeeping. The bathroom was very clean and well stocked with towels. Also, I never heard any planes even though the hotel right outside the SHV airport.", "helpfulness": 1, "user": "hmr414", "date": "March 11, 2007", "id": 7013478}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Service: front desk employees were very friendly and helpful.", "title": "Good Stay", "user": "OutlawCruiser", "date": "January 4, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 6552339}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Location: Right outside the airport, free parking. There are a few places to eat although there is a better selection one exit west on i20.", "title": "Good place to stay", "user": "pkp", "date": "January 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 6548595}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "Price: $100/night booked directly with the hotel", "title": "Stunning!", "helpfulness": 5, "user": "jdbhouston", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5700024, "likes": {"liked": "— It exceeded any and all expectations."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "The airport Hampton Inn Shreveport is an excellent motel, and getting to the airport is easy as falling off a log. It is about 3/4 of a mile from the airport, just across the road. After staying at the Days Inn on Monkhouse Drive, the Hampton Inn was paradise. The rooms were clean, sparkling, and neat - just what you expect from a modern motel. Do yourself a favor and stay at the Hampton Inn if you need quick, easy access to the Shreveport airport. If there was one drawback to the location it would be the lack of good fast food restaurants in the area. Travelers must go back to the freeway and drive 2 miles west to exit 10 for a quick lunch.", "title": "Great Place to Stay !!", "helpfulness": 3, "user": "DakotaPrairieDrifter", "date": "June 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5291809}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "This is an excellent hotel, built just 1 1/2 years ago. Our room was large, very clean and very quiet. We could see the airport from our hotel but we heard absolutely no sound from outside, or from other rooms. All of the staff was very pleasant and gave us suggestions on where to eat (and where not to eat), as well as directions to the casinos in the area. Breakfast was excellent, with hot scrambled eggs, biscuits & gravy, plus all the standard cereals, breads and rolls. The hotel fully met all of our expectations for Hampton Inn quality and we very definitely would stay here again.", "title": "Excellent hotel", "helpfulness": 7, "user": "like2travel1", "date": "June 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3610306}, {"rating": 5.0, "title": "Much better than the Bossier City HaMPTON INN", "text": "I was wondering why the other hampton inn was giving me a hard time when i showed up to the wrong one. This hotel by the airport will please the guest at any cost. The rooms where so modern with really nice artwork and color schemes. I really enjoyed the reception with all the different snacks, plus i meet really interesting people in a great atmosphere.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 3, 2005", "id": 3117127}, {"rating": 5.0, "title": "Best hotel in town!", "text": "It was the best hotel i have ever stayed at. Since it is only six months old, the management is spending extra money on the guest. Free Beer and Wine along with 4 different types of snacks at the Manager's Reception. I could log online in the Lobby with the Wireless System. The staff went out of the way to make me happy. They even went to the store to find my favorite Wine. I could not believe the effort this hotel put out for me. I know where i am staying next time!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 31, 2004", "id": 1622980}], "location": {"country": "United States", "city": "Shreveport"}, "stars": 2.5, "variance": {"poor": 4, "average": 8, "very good": 36, "terrible": 2, "excellent": 45}, "aka": "Hampton Inn Shreveport Airport Hotel Shreveport", "slim_ranking": 0.138888888889}