{"user_rating": 4.5, "review_count": 448, "name": "Hampton Inn & Suites Williamsburg-Central", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "If you are going for colonial Williamsburg, this is an excellent place to stay. Service, comfort, cleanliness, bed comfort, and everything else was an A++++. I slept like a baby on the very comfortable beds. The lady who oversees the breakfast was TERRIFIC. I'm extremely glad I stayed here, and if I ever go back to Williamsburg, I will be booking here. In case you cannot tell, I highly recommend this place.", "title": "Best place to stay in Williamsburg", "helpfulness": 3, "user": "Cyberdaddy", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115668595}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed for 2 days during the 4th of July holiday. The hotel was very nice, comfortable and clean. Our room had plenty of room for relaxing. The out door pool was nice, a little on the small side, but not overly crowded. Highly recommend this hotel and will stay again.", "title": "Great Hotel", "helpfulness": 2, "user": "dduckie", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 115609118}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed in a King Suite with two toddlers. The hotel suited our needs perfectly with the sink, microwave, and refrigerator. The room was very nice. The room and hotel was very clean, it had an indoor and outdoor swimming pool. The location was very convenient for our needs of traveling to the parks with ease. The only downside for us was the speed of the internet. My husband teaches online and had some difficulty with the internet service. I would recommend this hotel to a friend or family member. I would also stay at this hotel specifically when we are back in the area. Overall is was a very good experience.", "title": "Fantastic Hotel", "helpfulness": 2, "user": "Nicole08302008", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115490364}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This Hampton Inn was very clean and conviently located to everything Williamsburg has to offer! Breakfast was great, staff was pleasant, pools were nice...overall great stay, would stay here again!", "title": "Fantastic hotel!", "helpfulness": 2, "user": "pontihouse", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115328334}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Great hotel. Nice room, even had rollaway bed in room when we checked in as we requested online. Breakfast was good. All around great property!", "title": "Wonderful Experience!", "helpfulness": 1, "user": "Rorick11", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115266214}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Check in was a breeze. We were initially given a room near the elevators. I quickly went to the front desk and asked for a different room away from elevators. Christina was very accomodating and pleasant.", "title": "Clean and Courteous", "helpfulness": 1, "user": "HKitchen", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103938736}, {"rating": 4.0, "title": "Pleasantly surprised", "text": "We were surprised at the large size of the room, even with two Queen beds. Very spacious... Great updated bathroom!! And clean...", "helpfulness": 2, "user": "silver028", "date": "April 7, 2011", "id": 103207781}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The only downside was breakfast. The food is not very good. At one point, the attendant brought out a carafe of milk that was frozen. When I approached her about the milk, she said that it should be fine to drink. The problem is that it didn't look very appetizing, and there was very little melted volume to pour.", "title": "Non smoking room not guaranteed.", "helpfulness": 6, "user": "gymnastmom12", "date": "March 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 5.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 101267512}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Overall, a great hotel!", "title": "Nice, Clean Hotel", "helpfulness": 1, "user": "Run26miles", "date": "February 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97889777}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My husband, 8-year old daughter and I stayed here for 3 nights in March. We had a very nice experience. Overall the room was more than fine. Clean, nice bed/pillows, no bed bugs (and believe me I checked). Perfect location for going to Colonial Williamsburg and out to dinner. The room was very well-priced and included a decent little breakfast in the morning. What this place has going for it is that is relatively new. btw.. check out a great little restaurant nearby called \"Food for Thought\"....and there's an awesome \"pirate themed\" Miniature Golf place for the kids a short drive away. Enjoy!", "title": "Very nice family hotel, great value", "helpfulness": 2, "user": "ootanaboot", "date": "January 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 94790652}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "This hotel had a great location. It looked new and well-maintained. Our room was spacious and clean. The free breakfast in the morning was good. The hotel staff was friendly and helpful. My only complaint was that the pool was a little greenish.", "title": "Clean, comfortable, would stay again!", "helpfulness": 2, "user": "IrishGirl2006", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115069715}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The Hampton Inn provided a very enjoyable vacation. We had a king suite which was very nice- it had a kitchenette (sink, microwave, refrigerator, and coffee pot ), sofabed, desk, and chair as well as a vanity area. The breakfast was very filling and was different each day, with a few staples each day- cereal, oatmeal, yogurt, muffins, pastries, and fruit. Each morning they also had a hot option ranging from scrambled eggs and bacon, a western mix and potatoes, and individual omelets. The staff was very friendly and accommodating- gave great suggestions for restaurants and attractions. They even printed out our Busch Gardens and Water park tickets. My son loved the outdoor pool as it was much warmer than the indoor option. Overall an affordable, clean, well appointed family friendly hotel close to all attractions and restaurants. Would highly recommend to all!!!", "title": "Nice experience", "helpfulness": 3, "user": "kimbers312", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115050185}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Loved the decor and very roomy. Overall nice and quiet, however I agree with the other comments on the loud A/C unit. For the money you can not beat it and they throw in a nice breakfast as well. No regrets here very pleased. Thanks Hampton!", "title": "AWESOME ROOM FOR THE MONEY", "helpfulness": 2, "user": "halebrat", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114931083}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I just returned from a stay 20-24 June with my 4-year-old and mother for a family vacation. We had a wonderful stay! We booked a king suite to take advantage of the microwave and refrigerator. Both came in handy while there and saved on some of the eating out costs that can be incurred while on vacation. It was actually the same price as the double when we booked!! Upon checking in, the front desk was friendly and attentive. My mother appreciated the freshly baked cookies greeting the guests as they arrived. We were about ten to fifteen minutes early for check-in, but the room was confirmed as ready for us.", "title": "A great and comfortable hotel with friendly and professional staff", "helpfulness": 2, "user": "johnstonsm", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114800610}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "In our room, we found ample space, a comfortable climate (AC was a wonderful blessing because it worked SO well!), and most importantly--a comfortable bed! We didn't use the pull out on the couch, though it was an option. The bed was big enough for all of us. We always fell promptly asleep whenever we lay our heads upon it! The room was clean and the housekeeping staff were always pleasant and friendly. We always looked forward to greeting them in the mornings on account of how friendly they were.", "title": "Really nice hotel, very helpful front desk", "helpfulness": 7, "user": "Gary_from_Bristol_UK", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 112779482}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed here during a quick jaunt to Williamsburg to go to Busch Gardens. I picked this hotel because of the tripadvisor recommendations. It was nice and new, and the rooms and bathrooms were clean and well maintained. The A/C in the room was cranking, which I love! When we checked in, the hotel was very quiet, but the next morning, the lobby was packed with families heading out for the day. We tried to grab breakfast around 8:30, but the breakfast area was mobbed with kids, so we ended up driving down the street to Manhattan Bagel. Only drawback is that it's really not on the \"strip\" where most of the restaurants and other hotels are located (so you can't walk places), but its a quick car trip away. Driving by other hotels in Williamsburg, I was really glad we picked this place!", "title": "Nice, new, good value for the money", "helpfulness": 3, "user": "lrs153", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 110426411}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed here when visiting Colonial Williamsburg. The hotel is literally a five-minute drive from the Visitor's Center. If they had a pathway through the woods we could walk there.", "title": "Great value; a pleasant surprise", "helpfulness": 1, "user": "lisag67", "date": "May 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 106568952}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I thought the room was very spacious and clean. Quiet also; the housekeeping staff was vacuuming in our hallway and we didn't realize it until we opened the door to our room. Our room included a kitchenette and fold-out couch but not all of them do. The front-desk staff is friendly and accommodating.", "title": "Comfortable", "helpfulness": 3, "user": "Jazzer1", "date": "April 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106100635}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Our daughter loved the indoor pool and whirlpool (as kids usually do). I had concerns at first as the water looked murky, but the man at the front desk explained that it was a salt-water pool and that with all the spring break travel the sediment had been stirred up. He assured me that the pool was clean. They often didn't have towels in the pool room in the AM but when I asked for towels someone brought them immediately. They have an outdoor pool also but it wasn't open yet when we stayed there. Overall I thought the pool was in better shape than at some hotels where I've stayed in the past.", "title": "Okay stay, noisy air conditioner ruined sleep quality", "helpfulness": 4, "user": "jdsFlanders", "date": "April 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 105319965}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "They also include breakfast in the price of the room. I'll be honest, I didn't really care for the food too much. I'm kind of picky about my food so what bothered me might not bother others--like I don't want American Cheese in my eggs, or too much salt, or corn syrup instead of maple syrup for the waffles, or fruit salad from a jar instead of cut fresh. But that's me. Most people seemed to enjoy it just fine. They have a big basket of apples that's out all the time, a nice touch, though unfortunately the apples aren't very good, and they also offer hot drinks all day, which was nice.", "title": "Great location. Nice hotel", "helpfulness": 2, "user": "puffingirl", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104762635}], "location": {"country": "United States", "city": "Williamsburg"}, "stars": 2.5, "variance": {"poor": 12, "average": 37, "very good": 149, "terrible": 5, "excellent": 245}, "aka": "Hampton Inn & Suites Williamsburg-Central Hotel", "slim_ranking": 0.111111111111, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}