{"user_rating": 3.5, "review_count": 79, "name": "Hampton Inn Lexington South", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I've stayed at many Hampton Inns and usually really enjoy them - but this one does not live up to their standard. The rooms were outdated and a little dirty and the front desk service was not very good. I recently returned to Lexington for another work trip and stayed at a different hotel.", "title": "Needs an update", "user": "CASRunner", "date": "March 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 125777105}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We visited Lexington and found that BOOK EARLY is the key when Keeneland last weekend and UK are playing. Oh My do they Jack their rates. This is a run of the mill Hampton Inn - nothing to right home about and like any college town on lovely fall weekends... they jack the rate to unrealistic for a franchised hotel. The rate is usurious so be wary - this hotel is nothing more than a $100/night place.", "title": "OK, But.....", "user": "RalfJamerson", "date": "November 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120025082}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "By the way - Lexington is a GREAT place to visit - UK, the horses, history and great food.", "title": "OK, but better options available", "user": "Beverlyw8", "date": "July 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 5.0}, "id": 115888225}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My family and I stayed in this hotel for one night. The staff was friendly and welcoming, and the breakfast was good, but one of our rooms had the odor of stale air freshener, and the furniture and room decor could definitly use an update. This hotel was the best one available for booking at the last minute and if you have more planning time there are much better options in the area.", "title": "Clean, comfortable", "helpfulness": 1, "user": "AuntGloria", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114777292}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed at the Hampton Inn - Lexington South for a weekend trip to Lexington. The hotel was quiet, clean and comfortable. Convenient to downtown and other parts of Lexington due to the nearby Rt 4, Lexington's outer-belt. The breakfast is nothing to write home about but it's decent and fresh. The pool area looked clean although we did not use it or the exercise facilities. There are restaurants within walking distance of the hotel.", "title": "Great Location for Keeneland", "user": "YoungDubFan", "date": "April 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103689800}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I have stayed at many Hampton Inns before, but never one where I could not get at least a decent nights sleep. After watching the news, I tried to go to sleep as I had an early business meeting in the morning. I had heard some commotion outside during and after the news, but didn't think too much about it as there were some restaurants and businesses across the street from the hotel and figured that they would be closed shortly as it was a mid-weekday. Well, it was well after 2AM and I was still awake as apparently there is a LOUD karoke bar directly behind the hotel in the strip mall. I tried calling the front desk to see if there was anything they could do as surely they must be aware of this situation and I could not possibly be the first guest to complain. The woman said she was 'sorry and understood' but there was nothing she could do as they were 'not affiliated' with the hotel. I also tried calling the bar itself several times, as the number is listed in the guest packet inside every guest room, but only received busy signals. So by including the bars information and menu in their guest room, it would sure appear as if Hampton Inn is promoting their guests to use this establishment. As for the hotel itself, it is convienent to the highway, but the carpet in the room was dirty and the variety for the breakfast buffet was weak. You can tell they only do an overview of vacuuming as it was dirty around the night stands, in the corners and around the air conditioning unit. There are other hotels nearby that are not located across from this bar. So if do not wish to sleep through the night, stay here. Otherwise go somewhere else.", "title": "Sleepless Night", "user": "Travelarch1", "date": "September 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 141467937}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "This Hampton needs a major renovation! The staff is okay, but the manager (can't recall his name... young African American) is not professional. I can tell he tries, but I don't appreciate, as a professional, being called \"man\" or \"buddy\" at the front desk. My last name was on his screen, and it isn't \"buddy\". Breakfast service was great, but the food was lacking.", "title": "Rough example", "user": "Jon H", "date": "August 16, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 137376397}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "There are three brand new Marriott properties surrounding this hotel, that look way more appealing for the price.", "title": "Good location and staff", "user": "ld4ivy", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136753191}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "This is a rough example of a Hampton.", "title": "Great experience!", "user": "Angiefarmdog", "date": "August 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 136066626}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We decided to stay at this Hampton Inn based on price and location. We were pleased with the prompt and friendly service, the breakfast and the room. When I asked about nto being able to get the AAA rate online, the person at the desk immediately offered another rate at a similar discount. I would recommend this hotel for sure and stay here again.", "title": "Location is good, hotel upkeep is mediocre", "user": "Traveler2350207", "date": "August 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 136056783}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We chose this hotel as it was a good value and close to my family that live in town. Check in was expedient and the room was very clean and comfortable. The staff was friendly and besides having coffee available all day they had a large container of ice water available that was a blessing when coming inside with temperatures over 100 during our stay.", "title": "Clean, comfortable and convenient", "user": "Pamski", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133937173}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "They had a nice breakfast including a \"to go\" brown bag and the guess all seemed to be enjoying these. Since we were in town to visit my parents we didn't partake but I'll be staying at the Hampton Inn Colonial Blvd. in Ft. Myers, FL. this coming weekend so I can check it out without upsetting my Mother,", "title": "Very comfortable but not fancy", "user": "RERD09", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 132021106}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "As a side note, my brother and his family stayed at a more upscale Hilton property the same long weekend and I heard a lot of complaints from them. I think we made a good decision choosing the Hampton Inn.", "title": "Only as a last resort", "user": "HoptownTraveler", "date": "May 28, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 130816403}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "We stayed here with family and had 3 rooms. All were clean and reasonably up to date. The housekeeping staff was very friendly as was the lady serving breakfast. Jennifer, who was at the desk, was very helpful and even ran an extra key up to our room when we had a problem with it.", "title": "Nice staff but property very 'tired'", "helpfulness": 1, "user": "Kristina K", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 128388641}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The rooms were comfortable and my grandson enjoyed the indoor pool. The breakfast was varied and tasty.", "title": "Nice place to stay.......", "user": "Charity B", "date": "April 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 128281065}, {"rating": 3.0, "title": "Sure, maybe needs upkeep - but best night of sleep I've had in at least a week", "text": "It's a sad statement on my work travel calendar, but I now sleep better in a Hilton / Hampton than I do in my own bed.", "user": "Gemutlichkeit", "date": "December 7, 2012", "id": 146928452}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This Hampton is conveniently located to several Lexington spots, including the airport. It *is* a little loud, as others have commented on. But I did *not* have the karoake issues or undue rowdiness issues that others reported. Maybe because at 10:00, I was out and slept straight through until 5:30. Fabulous.", "title": "Convenient to Keenland Race Track", "user": "WInston91", "date": "October 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 143794455}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Yes, this hotel is older. But I don't know that anything \"needs\" an update. I'm not a fan of just sending stuff to a dump and buying new just because the furniture is 10+ years old. It is what it is, and its price point matches what you are getting, imho.", "title": "Beware of black mold", "user": "fordtraveler56", "date": "October 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 143652612}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Yes, the manager is informal. I did not mind it as some others did. And, I am impressed by what hands-on service he provided. He not only handled my check-in, but he also came to the room later in the day to check on a service ticket (related to plumbing) that was apparently still unresolved for this room. Should that have been handled before I checked in? Absolutely. Was it a big deal? No. (Was it weird that they \"solved\" a plumbing issue by using Liquid Plumr? Yes.)", "title": "Great Place", "user": "NitaSpringfield_TN", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142904144}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Elevators are super-slow. Fortunately, the property is only 3 stories and the stairs and broad, carpeted, and easy to access.", "title": "Awesome staff", "user": "mcdillpickle", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 141832198}], "location": {"country": "United States", "city": "Lexington"}, "stars": 2.5, "variance": {"poor": 13, "average": 16, "very good": 26, "terrible": 4, "excellent": 20}, "aka": "Hampton Inn Lexington South Hotel Lexington", "slim_ranking": 0.446153846154, "description": "At the Hampton Inn Lexington South – Keeneland/Airport hotel, you are guaranteed a comfortable stay and great value. Only four miles from historic downtown Lexington and the Lexington Airport, you'll be at the heart of the action with exciting local dining and shopping nearby. During your stay, don't miss the nearby highlights that make the state famous, including the Red Nile Racetrack, Keeneland Racetrack, and our area’s many bourbon distilleries. Just five miles from the beautiful University of Kentucky campus, this Lexington, KY, hotel is a great place to stay if you are in town checking out colleges, taking in a game or visiting the kids."}