{"user_rating": 4.0, "review_count": 132, "name": "Hampton Inn Dallas / Addison", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "My family had booked 2 rooms. The pillows in one room smelled like bad body odor. I booked my stay through advance purchase and 3 weeks after the stay I discovered I had been billed for both rooms a second time by the hotel. It took 5 phone calls and 10 days to get my money back.", "title": "Check your credit card statement carefully!", "user": "OK_taqi", "date": "December 2, 2009", "detail_rating": {"cleanliness": 4.0, "service": 2.0}, "id": 50496973}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This Hampton does not live up to the chain's reutation. First of all, it's very difficult to find - I had to call the front desk twice to find the place. The front desk staff was pretty disinterested - they didn't seem to care about their guests or their property. And they coulnd't figure out how to check me out when I left. The rooms have been beautifully redecorated, but ... The room felt damp and musty my entire stay - even with the air-conditioning on. The towels were damp and I wasn't sure the sheets were really clean. They were damp and icky, too. The breakfast was mediocre and the wake-up call I requested never came. When I complained to Hilton corporate (customer satisfaction surveys apparently having been discontinued), they were relatively responsive. But, then they e-mailed me to say that hotel had said it had contacted me directly, which was not true. I travel a good deal on business and usually look to stay at Hampton given their consistency, but I'll avoid this property in the future.", "title": "There are better choices", "user": "ItchyFeetBTS", "date": "November 22, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 49839741}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I have stayed at this Hampton Inn 3 times in the last 2 years and have had no problems what so ever. Our corporate office meets there and we usually have around 90-100 people staying there at a time. Everything so far has gone smoothly.", "title": "Great for Business Travel", "user": "pcbtmmgr", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 30858198}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Each morning, I would get up around 5am to beat the breakfast rush. I would get there and everything would be ready and pretty good for a cont. breakfast. There was always someone there cleaning to make sure everything stayed nice. The only problem would be if you wait until around 7am to eat, there was a large line and everyone trying to elbow you out of the way.", "title": "Hang on to your purses.", "helpfulness": 3, "user": "skaiwi", "date": "November 13, 2008", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "business": 3.0, "rooms": 2.0}, "id": 21834662, "likes": {"liked": "— location", "disliked": "— The fact that we were stolen from."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "In the evenings when we would return, the hotel was quiet and seemed like in a good neighborhood. The rooms were always cleaned and plenty of fresh towels. There was always a paper each morning at the door during the week.", "title": "Great Hotel - Don't put guests next to renovations in-progress though.", "user": "Mike W", "date": "August 31, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 19582940, "likes": {"liked": "— The newly renovated rooms and LCD televisions are very, very nice.", "disliked": "— Why would you put a guest next to an area where they'll be renovating in the morning?"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I thought this was going to be a typical cookie cutter hotel but was pleasantly surprised. Nice spacious rooms, slightly bigger-than usual bathrooms, good breakfast in nice lobby, easy computer access, generous parking and amazingly comfortable high quality beds and up-market bed linens. Great location - very easy access to shopping, restaurants and I-635.", "title": "Very nice!!!", "helpfulness": 2, "user": "J_Sapphire", "date": "November 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6305503, "likes": {"liked": "— comfortable beds, good free breakfast"}}, {"rating": 5.0, "title": "best value", "text": "Stayed for a week. Awesome beds and bedding.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 3, 2006", "id": 5031355}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "Very helpful front desk personnel.", "title": "safe,dependable choice", "helpfulness": 4, "user": "figgyburn", "date": "January 18, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4361232}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Stayed here recently with my small children on a quick trip through Dallas. The location is wonderful, very close to food, shopping and business as well as the N. Dallas Tollway. Rooms are very clean, updated and beds are comfortable. The staff was fabulous to my kids. I had called around 1PM to note I was a late check in and said I'd be there around 7:30. I did not arrive until 8 and the desk clerk kidded me a bit about being late.", "title": "Better for Business", "user": "vlfair", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 73527427}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "However, as other reviewers have noted the rooms are very small as is the bathroom. I had to take the coffee pot off the vanity and store underneath in order to set my curling iron down. The breakfast area is also pretty small.", "title": "Small Rooms and Tiny bathrooms", "helpfulness": 2, "user": "lillah19", "date": "April 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 62204433}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "There were no small child friendly TV channels available (Cartoon Network goes pretty adult in the evening). I got the feeling that I had the only kids in the entire hotel.", "title": "Good Option for the Price - TINY Rooms", "user": "pcsanity", "date": "April 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 60130613}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Overall this is a great hotel if you're on business but if you're traveling with kids, stay at the Homewood Suites across the street.", "title": "Good, convenient hotel- excellent prices!", "user": "jansenKansasCity_MO", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58773810}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This Hampton is different from most of the other Hampton Inns I have stayed in. The room does not have a fridge or microwave and the bathroom is tiny. I stayed in a larger room which made me wonder how small standard rooms must be.", "title": "Perfect - exactly what we needed.", "user": "SiskFamily", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54337305}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I stayed at this hotel a few times for work. It is a standard Hampton Inn. Free wireless and breakfast. Staff was friendly. Nice location off of Beltline. Clean. My only complaint is the air conditioner and heater. I just don't like the window units but not enough to stop staying at the hotel. As a single woman traveling good place.", "title": "Nice hotel", "user": "Me9247", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14685016, "likes": {"liked": "— The bed", "disliked": "— Air conditioner"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "This is an older Hampton Inn but I found it to be comfortable, clean, and homey. The service was friendly. The beds were the best part, very comfortable. I did not want to get up in the morning. The air conditioner was a little noisy, but you'll find that in most hotel rooms.", "title": "Older hotel but good stay", "user": "swandive208", "date": "February 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13340772, "likes": {"liked": "— Friendly service and clean hotel", "disliked": "— Older property, needs updating"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Overall, it was a very good stay.", "title": "Convenient Location...great price an location", "helpfulness": 1, "user": "Ebazinam", "date": "January 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12959667, "likes": {"liked": "— Great price, nice touches like cookies, coffee etc.", "disliked": "— The bathtub was stained, could be just that room though."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We stayed in this hotel over the long holiday weekend (MLK holiday). We booked with no problems through the hilton honors website. When we arrived our keys were waiting on us, check-in took less than five minutes. In the lobby, the hotel had hot coffee, cookies, milk and bottles of water. Very nice touch. When we got to the room, the heat was already turned on, more water was in the room and everything was in order.", "title": "Needs a Texas-sized Renovation", "helpfulness": 1, "user": "DCBuffalo", "date": "September 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8613168, "likes": {"liked": "— Friendly Staff", "disliked": "— Rooms need renovating in a bad way!"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007", "text": "Check in: Fast and convenient", "title": "Not what I expected", "user": "jimthestonemaker", "date": "July 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8204060}], "location": {"country": "United States", "city": "Addison"}, "stars": 2.5, "variance": {"poor": 6, "average": 24, "very good": 41, "terrible": 2, "excellent": 59}, "aka": "Hampton Inn Dallas / Addison Hotel Addison", "slim_ranking": 0.315789473684, "description": "Position yourself on the edge of Dallas in Addison, a tranquil suburb that still offers easy access to all the big-city thrills. The Hampton Inn® hotel in Dallas/Addison is located in the heart of North Dallas, just minutes from the North Dallas/Addison Business District, about ten minutes from Love Field Airport and twenty minutes from DFW Airport. A short drive into Dallas brings you to the Dallas Convention Center, the Dallas World Aquarium and the Dallas Arboretum and Botanical Gardens. They are all within fifteen minutes of our Dallas/Addison hotel. Get a sense of poignant history in Dealey Plaza and the Sixth Floor Museum... Take a tour of the Old Red Museum of Dallas County History and Culture... Or commune with nature at the International Wildlife Park. Our Dallas/Addison hotel also puts you close to pro sports events at one of the local arenas or stadiums, and masterpieces at the Dallas Museum of Art. A short ride into McKinney brings you to the Heard Natural Science Museum and Wildlife Sanctuary... And everyone will love the Hawaiian Falls Water Park in the Colony, near Lewisville. Do a round of shopping at the nearby Galleria Mall... Or play a round of golf at the nearby Heritage Ranch Golf Course. Get more tips on all the local sights from the friendly team at our Dallas/Addison hotel. Services & amenities: Here at the Hampton Inn Dallas/Addison, we're passionate about taking good care of you. That's why we offer a broad range of services and amenities to make your stay exceptional. Whether you're planning a corporate meeting or need accommodations for a family reunion or your child's sporting group, we're delighted to offer you easy planning and booking tools to make the process quick and organized."}