{"user_rating": 4.5, "review_count": 225, "name": "Hampton Inn & Suites Syracuse Erie Blvd/I-690", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Just held a two day meeting at this location. Rooms were excellent and location is very good. The hotel was opened this year. The hotel appears to be understaffed and appears to be focused on managing costs with a \"no-frills, basic\" breakfast offering. Less than desired when starting a business meeting and no other restaurants available for breakfast in the area. The staff was flexible for accomodating my meeting requirements. I would consider the hotel for future meetings!", "title": "Very good choice for business meeting", "user": "rhajah", "date": "August 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75578288}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "A great hotel for family vacations as it has a nice pool and whirlpool facility. A good choice for business meetings which could be easily upgraded to great with just a few tweaks!", "title": "Very nice hotel on the road", "user": "YoYu", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75374365}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed here for one night on our way to the Finger Lakes.", "title": "Good hotel overall", "user": "Blueskynet", "date": "August 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75057603}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Overall the hotel is very nice, we really liked the room, we had the king suite and it was quite large and well organized.", "title": "Very good overall and would stay here again.", "user": "BirdGuy-7", "date": "August 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 74336544}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "For dinner we asked the front desk for deliveries and she had a menu for us, I don't remember the nane of the place but probably the only they recommend, the food was good (I had Tuna sub) and arrived fast.", "title": "Clean, friendly hotel", "user": "AuntieAnna", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74319983}, {"rating": 1.0, "stay_parameters": "Stayed April 2011", "text": "we paid $131 for a one night stay the beds were hard as rocks! We all were up the majority of the night tossing and turning. The 3 adults all were in agony in the morning! I complained to the front desk and they said sorry there is nothing we can do. VERY disappointing we will NEVER stay at a hampton inn agian!", "title": "Horrible beds!", "user": "canucme278", "date": "April 3, 2011", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 102613133}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "A nice Hampton Inn. the sign for the hotel is too small and completely unlit, so finding the place after dark is a challenge. The hotel has been fighting with the city about the problem and this may improve. The rooms were clean and the staff were very friendly and helpful. I would stay there again.", "title": "This is a nice place to stay, but the signage is inadequate and the entry to the place is HARD to see.", "user": "Expvalue", "date": "March 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 101404130}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Stopping in Syracuse for some shopping. This hotel was located close to many restaurants and shopping, and near major roads. Yet, on the top floor, it was still very quiet. Rooms were very clean, nice duvets and pillows, HDTV, spacious bathroom, and decent pool. Very good selection in the morning for the included breakfast. Also got a late check-out without even a hint of difficulty.", "title": "Excellent stop-over", "user": "SDubord", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100831871}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "A friend and I stayed at the Hampton Inn and Suites for one night during a Christmas shopping excursion. This hotel looks brand new...beautiful lobby and rooms, comfy beds, spacious bathrooms. Our CAA rate was $122/night and I don't think we could have done better in the area. Breakfast was included in their spacious lounge, lots of choice and good coffee. There is also free Wi-Fi and a business center with a computer you can use. The location was ideal for shopping...only a 10 minute drive to the Carousel Center and handy to Target, restaurants, etc. The only thing missing was my friend and I were hoping for a glass of wine after a long day of shopping. None available at the hotel we would have had to go to the nearest bar. Next time we will be prepared! :-)", "title": "Great Hotel! Great Choice for Syracuse Shopping Trip", "user": "HernameisRio", "date": "December 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 90190573}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I should also add, I am usually weary of chain restaurants, but we had a great meal at the Ruby Tuesdays at Carousel Center. Good service and yummy food. Enjoy your trip to Syracuse!", "title": "Good Value", "user": "Weerobbie", "date": "November 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 86450576}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "This Hampton Inn & Suites is much like any other new HI - very clean & incredibly comfortable beds. The rooms had the usual fridge, microwave and coffee maker. I was really pleased to see they were using paper coffee cups and paper water cups. No more plastic and styrofoam! I do hope this is a chain-wide change.", "title": "Convenient and New", "user": "ldygrdnr", "date": "October 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 85491511}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "There was a mixup with keys when I checked in. My key didn't work, the front desk reissued it and when I tried the key, the door was latched and someone hollered. The room was occupied. Fortunately they'd latched the door. A most apologetic desk clerk took care of the problem and gave me the keys to the proper room. I wish this wasn't an unusual event. I've been on both sides of this sort of thing and not just at Hampton Inns.", "title": "Very accomdating staff!", "user": "JeanOPA", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 83521015}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "That aside, the hotel was fine. I rely on Hampton Inns for many of my hotel stays, they're clean, convenient and comfortable. I just with they'd serve healthier breakfasts.", "title": "Check your doors, people!", "user": "BBTripper", "date": "October 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 4.0}, "id": 83260190}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Nice hotel east of town. Staff was extremely helpful allowing us to check in early AND control the remote in the wee hours of the morning! Appreciate the 24 hour coffee. Not thrilled with the room layout, (TV in furthest corner), but made do. Only negative was the eggs the next morning.", "title": "I can't say enough good things about this place...", "user": "gareauk", "date": "October 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81776844}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This is a very clean, well appointed hotel that lives up to the Hampton standard in comfort.", "title": "Clean and New", "user": "love_it_at_the_lake", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77471279}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "My daughter and I stayed here for one night on a college visit. The hotel is easy to find, right off the highway. Check-in was quick and we received the type of room we had requested. The room was clean and sheets and towels were fresh-smelling. We found the beds to be perfectly comfortable.", "title": "Nice, typical Hampton Inn", "user": "Bandlady", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 113534964}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Breakfast was typical Hampton Inn, but they did not have any decaf coffee. When I asked for it, they first said they were out of it, and that I could make it in the room, but, of course, I did not want to go back up there just to do that. However, after a couple of minutes, the breakfast attendant brought out a cup of decaf for me, and, eventually, an entire pot was put out. I'm not sure why they didn't have it to begin with!", "title": "Typical of Hampton Inns Generally-- with one exception...", "user": "Cusevisitor", "date": "May 31, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 110747433}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "All-in-all, our stay was perfectly pleasant, and I'd stay there again.", "title": "Great", "helpfulness": 1, "user": "hturedal", "date": "May 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 109377874}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "... I stayed there three nights and the last night the housekeeping staff failed to make up the room- have stayed many nights at a number of Hampton Inns and never had that happen before. Otherwise, clean, up to date (the hotel is only about a year old), nice staff, the typical Hampton breakfast as described in other reviews-- did not find the beds uncomfortable as some other reviewers complained.", "title": "Terrible beds!", "user": "beepee9", "date": "April 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 102703398}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "A great hotel with a terrific front desk...a great breakfast and was varying each day. The hot items were hot and the cold were cold. A great start to our busy days.", "title": "My stay...was awful.", "helpfulness": 1, "user": "carenzalynn", "date": "April 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 102615705}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 7, "average": 24, "very good": 83, "terrible": 2, "excellent": 109}, "aka": "Hampton Inn & Suites Syracuse Erie Blvd/i-690 Hotel", "slim_ranking": 0.0967741935484, "description": "Stay at the Hampton Inn & Suites Syracuse Erie Boulevard /I-690 hotel and enjoy free high-speed internet access in every room. Have a good night’s sleep in a clean and fresh Hampton bed® and enjoy our range of thoughtful services and amenities. Keep on top of work in your room with our handy lap desk, or relax with your favorite shows on the LCD flat-screen TV. Upgrade to a suite for separate living and sleeping areas, more space and flexibility. Take advantage of our range of efficient services to make your stay more comfortable. Start each day with a delicious Hampton’s free hot breakfast and taste our world-famous waffles. Even if you're in a rush, don't miss the most important meal of the day. On your way out, simply grab one of our free Hampton On the Run® Breakfast Bags, available Monday to Friday, for a quick, healthy meal to go. Swim laps in the indoor swimming pool after a long day."}