{"user_rating": 4.0, "review_count": 229, "name": "Hampton Inn Suites Poughkeepsie", "reviews": [{"rating": 4.0, "title": "Friendly staff, clean rooms, non-memorable stay", "text": "Sometimes, when you are a business traveler and you can't remember a particular hotel, that can be a very good thing. Because it was probably laid out in exactly the way you expected, and you didn't get frustrated looking for things. Because the staff probably had everything ready for you and you didn't have to ask for anything. Because you probably got a good night sleep and didn't need to ask for special accomodations.", "user": "Gemutlichkeit", "date": "September 19, 2013", "id": 177840739}, {"rating": 4.0, "title": "Close to CIA, FDR, Vanderbilt", "text": "That was my experience here -- front desk staff had my reservation ready and waiting for me, they were smiling and friendly, bill was accurate, and when I needed plasticware for my delivery food, they were happy to go into their kitchen to find some for me.", "helpfulness": 1, "user": "fluffnfold", "date": "September 18, 2013", "id": 177706275}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "All in all, a not-particularly-memorable hotel stay -- which I mean in a good way! Would definitely stay again.", "title": "Average", "user": "setter3", "date": "September 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 176940879}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "p.s. Watch finding this place when using GPS. There is a cut-away in the road where you can turn directly into the property, even though the GPS wants you to drive an additional mile further down the road in order to turn around.", "title": "Satisfactory", "user": "Maria L", "date": "September 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176829265}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "My spouse and I stayed for 1 night at the Hampton Inn & Suites Poughkeepsie in mid-August 2013. The hotel has 129 rooms, including 8 Whirlpool Junior Suites as well as other types of suites. Rooms ending in 01, 02, 31, and 32 are corner suites, and rooms ending in 03, 04, 29, and 30 are also suites. The hotel has five floors and two elevators, and there are ice and vending machines on each floor except the first/ground/lobby level. The hotel has an indoor pool and Jacuzzi, and there is a small outdoor space with tables and chairs accessible from the pool area. It also has a small fitness center and business center. The hotel offers the standard Hampton Inn breakfast, with both hot and cold options. The hotel provides freshly-baked cookies in the late afternoon. We did not see a pantry area where you could purchase snacks, but it may have been hidden. There are plenty of convenience stores, gas stations, shops, and restaurants nearby, so you can buy whatever you need very close to the hotel.", "title": "Family Stay", "user": "Susan B", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176560108}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "It did the job for an overnight stay. Nice was fast, and met the requests when I made the reservation online. Nice job Hampton! Room was large and modern, although the lap desk was filthy with some black stuff on it. Ew. How did housekeeping miss that? Large bathroom, too. Breakfast was also great, like all Hamptons. The breakfast attendant was very nice. Close to Vassar College, too.", "title": "Overnight Stay", "user": "Hotelman325", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171369940}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Was at this hotel for a weekend baseball tournament, hotel staff very helpful to our team's needs and hotel very centrally located to all areas shops and eateries, rooms clean,breakfast good would stay here again", "title": "Parent of my Son's Baseball Team", "user": "Thomas O", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 170647836}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "5 + false fire alarms resulting in 3+ hours sleep, and only 100 dollars off room.I understand this was a mechanical problem however they did NOT honor 100% satisfaction guarantee. It was hard to drive home after only 3 hours sleep.", "title": "No 100% satisfaction", "user": "Gregory L", "date": "August 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 170384562}, {"rating": 2.0, "stay_parameters": "Stayed July 2013", "text": "I traveled to the hotel to visit the CIA in Hyde Park, and I was unfortunately disappointed by my stay at this hotel. We arrived by train, and called the taxi service recommended by the front desk at the hotel, but they never showed up to the station. When we finally arrived we opened our hotel room door to find stained carpets and a musty smell. The front desk employee upgraded us, which we appreciated, but although the room was bigger it was not much better. The smell still filled the room and the carpets were oddly damp. Other disappointments included- waiting an hour for towels, no cookies in the lobby, and the maids opened all the window drapes while cleaning, exposing our bags to anyone passing by. The highpoint of our stay was that the front desk employes who were very nice and courteous, but as for the hotel- it needs serious updating if I was ever going to return again.", "title": "Missed the mark", "user": "Grace_wedding-planner", "date": "July 30, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 170068604}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed here July 15 through July 19, 2013.", "title": "Good but needs refreshing", "user": "frequent_travler123", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 168686941}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I would second all the favorable comments from preceding reviews. Numerous restaurants/diners from which to choose nearby. Large breakfast room; no problem finding an open table. The Vanderbilt Mansion, Eleanor Roosevelt's Valkill, and the FDR Home, Museum and Library very short drives from hotel. For me, the one outstanding feature of this Hampton Inn is the large bathroom with a spacious, walk-in shower at floor level and MANY pegs and racks to hang your wet towels. How often do you find that anymore?", "title": "Another very fine Hampton Inn ...............", "user": "Terry U", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116541333}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This particular Hampton Inn in Poughkeepsie New York is a central location and easy to get to shopping (great Home Goods store nearby) and the Galleria Shopping Mall. Also easy access to IBM and Vassar College. The staff is friendly and the rooms are quiet and clean. I usually travel with a family member and like the queen bed suite with large shower. The downside is they won't negotiate on price for this level room approximately $157 same room at other locations much cheaper.", "title": "Consistently good service and nice room", "user": "singerUtica_NewYork", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 115980014}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My family and I stayed at this hotel for the about 4 nights early in July. It was our first time here, and what a pleasant stay. As other reviewers have said, the rooms are spacious, the entire facility is very clean and modern, the breakfast is free and really nice, the staff was very friendly and helpful... all of the things that lead to a great review.", "title": "\"Excellent!\"", "user": "Terry U", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115972703}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Here are a few things that are special about this place... Each evening, they have fresh popcorn, but don't get there too late! I'm not sure what the stop time is, but this seemed to be a popular feature with an \"oops, too late\" point. The night we rolled in, they also had some amazingly delicious cookies.", "title": "Very Nice Hotel", "user": "vacationqueennh", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115858036}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The breakfast area faces east, and the windows are, well, if not all of the way to the ceiling, they are very large, so the room is very cheerful in the mornings. The breakfast offers many choices. Some things are offered every morning (cereals, yogurt, fresh fruit (whole and a wonderful cut-fruit medley). The sweet breads (danish, muffins, etc.) and hot offerings were different each morning we were there. I assure you, I could rave a while longer about the food!", "title": "Great hotel - quiet and clean", "helpfulness": 1, "user": "TexasTraveller56", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 114986785}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Hampton Inn Poughkeepsie is an excellent mid-price hotel that is an excellent stopover for travelers headed to New York City from the North, and Vice Versa. Vassar College nearby has an excellent museum. Free breakfast is very ample and can serve as a brunch for those who wish to skip lunch.", "title": "Excellent short stay hotel", "user": "Herman C", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173889273}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "If you want a place to just rest your head.. then this is the place.... If you rather an Experience... go elsewhere! There is no restaurant nor Bar. The closest bar is a HUGE dive and to be honest very scary!", "title": "hmph... could be better", "user": "Gail M", "date": "August 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 173596888}, {"rating": 4.0, "title": "Good service", "text": "Friendly desk agents; fine array of breakfast items; good mattress; perfect location for meeting family from NYC; close to tourist interests (FDR Hyde Park, pedestrian bridge over the Hudson, hiking in hills, West Point). Would definitely return.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 21, 2013", "id": 173443473}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I stayed at this hotel in past 3yrs over 6 times. Last time in past March and my stay was always great; however this time around was horrible. The staff was not as pleasant as before. Front entrance was clatter with dirt and garbage all over. Ask to talk to manager was told no one is available to talk to me. At 920 am on Saturday there was no hot breakfast left had to wait for almost 30min for eggs. Lobby had moldy smell and pool water was yellow. I am not sure what happen to this hotel it feels like people who work there before are no longer there and those who work there now don't know how to smile. will never stay there again", "title": "Disappointing", "helpfulness": 1, "user": "Grzegorz S", "date": "August 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 172405340}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The accommodations at the Hampton Inn were very nice. Staff was nice, but could have been more accommodating with their guests. The breakfast is good, but a step up from the usual would really enhance the experience. The hotel needs to take some lessons from the Culinary Institute up the road.", "title": "A Night in the Hamptons", "user": "Anne D", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 172003332}, {"rating": 3.0, "title": "Pretty good", "text": "The price is high for a Hampton Inn but it seems all the accommodations in this area are pricey, maybe because of the colleges nearby. The Inn and the room were very clean--I like Hampton Inns' policy of changing the duvet cover as well as the linens after each guest. For the second time in a row (last time was a Holiday Inn) I found no soap or shampoo in my room. But after calling down they were quickly delivered with an apology. No biggie but makes me wonder if this is a way hotels are trying to save money? The room was pleasant and clean with free wifi (love that!) and a large flat screen TV. Breakfast is also free, and while nothing to write home about, was a welcome convenience since I had to leave early in the AM. The staff was exceptionally friendly and very helpful.", "helpfulness": 1, "user": "Dreaming", "date": "September 13, 2011", "id": 118087615}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My overall impression of this hotel was a very positive one. It's near the mansions of the Hudson Valley, Hyde Park, the new renovated pedestrian bridge over the Hudson River from Poughkeepsie, Vassar & Bard & the CIA & Suny New Paltz & Marist. The (allegedly) largest beer store in the country is a five minute drive away.", "title": "Nice but pricey.", "helpfulness": 1, "user": "molacde", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117543717}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Service: The staff was very very nice. No problems there.", "title": "Great starting point for Hudson River Valley", "user": "leslie06", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117475141}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "VALUE: At close to $160 per night, it's not cheap. But it's modern and clean and I got some HHonors points.", "title": "A little suprised", "helpfulness": 2, "user": "H T", "date": "August 20, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 117009652}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "SLEEP QUALITY: I slept very well. Very comfy bed.", "title": "Best of Poughkeepsie", "user": "hlughod", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116707553}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The perfect place to stay, anywhere in the country. Over the years, I have always been 100% satisfied with Hampton Inn and staff. I will continue to do so, and recommend to anyone else to do the same.", "title": "Excellent, hassle free stay", "user": "Daveunmiss", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176137563}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Clean hotel. Great indoor pool and spa. Close to Hyde Park. Enterprise Rental Car was within walking distance from hotel. Friendly staff. Breakfast is routine. Fourth visit to this hotel. Would stay again.", "title": "College visit", "user": "Michael B", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175594903}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The staff was friendly and the hotel was clean. Would def stay again. Super nice that the hotel offers FREE wifi and breakfast. I was welcomed and checked in quickly and efficiently. There was no issue with the bill. If you're in the Poughkeepsie area and looking for a great place with great value to stay, this is your best bet. It's not city center, but most likely you'll have a rental car in Poughkeepsie, which shouldn't be a problem.", "title": "Great service, great hotel", "user": "Hai H", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175195626}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed here for a recent Saturday night in August. We arrived around 11:30pm after a long day of sightseeing and visiting family near Vassar College. Because of our Gold status, we were upgraded to a higher floor. The room was plenty comfortable. There are no views here to speak of, but Breakneck Mountain is only 30 minutes away and the Bear Mountain Bridge 45 minutes south has gorgeous views so we weren't worried about the scenery. Otherwise, the hotel pool deck is nice and the workout facility suitable.", "title": "Very pleasant stay", "user": "RobertaN252", "date": "August 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174584226}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The breakfast buffet on Sunday was good. There were a lot of people about, seating was tight, but we got we needed and the staff was keeping up. I like that Hamptons offer two varieties of coffee, Robust and Regular.", "title": "Wedding Weekend", "user": "blacksheepmary", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174605854}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We stayed here in early May for a family function near by. The hotel is very clean and the staff helpful. The rooms are spacious, very clean, modern and comfortable. The beds were very very comfortable, a great sleep. They have an extended continental breakfast that was terrific. In the evenings they have dinner Mon-Thur which we did not get to experience as we were there on Friday.", "title": "Wonderful hotel, Convenient location", "helpfulness": 2, "user": "Softball4ever", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113648028}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Great place to stay if you are in the Poughkeepsie area. There are many resturants and a lot of shopping near by.", "title": "Good spot for weekend reunion", "user": "fastlaner", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 113106421}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Highly recommend.", "title": "Hampton Inn Poughkeepsie", "helpfulness": 1, "user": "jacklbarnhart", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111412691}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My wife and I stayed here for a Vassar reunion weekend. We got upgraded to a suite - very nice. Hotle very friendly and seemingly well managed.", "title": "Pleasant one-night stay", "user": "NotWorldTraveler_11", "date": "June 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0}, "id": 111014485}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Hampton Inn Poughkeepsie is a pleasant surprise. The location is convenient. The staff is very friendly. The value for the hotel is outstanding. The rooms are large and super clean. The rooms are exceptionally quiet. This is one of the best Hampton Inns I have visited. I stay in about four Hampton Inns per year. This is a great deal for the Poughkeepsie area.", "title": "Nicer than I expected", "user": "abby081", "date": "May 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 110146187}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Hey, it is what it is. Clean; small rooms; plain, very plain decor; pleasant kids running the place; inexpensive; free parking; on a commercial strip just outside of the abandoned wasteland that is Poughkeepsie; free b'fast that was definitely OK. If you're visiting Vassar, the Culinary Institute of Am., Hyde Park, IBM, etc., this is a good place to stay.", "title": "Perfectly Executed Three-Star Hotel", "user": "Bosman", "date": "May 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 107862721}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Traveled here recently over a weekend. Staff at the front desk very nice. Room was very clean, and housekeeping staff helpful. Only criticism would be to monitor sports teams that come in and take over at breakfast. Some local school teams were there ?? I think taking advantage of breakfast,,and they were not hotel guests! I am sure that is hard for the staff to monitor, but it made breakfast too crowded and food was all gone quite quickly. My husband chatted with a few of the team members and discovered this fact. We did not make a fuss about it at the time, but I think management might want to be aware of this.", "title": "Very Nice and Convenient", "user": "chigagotraveler", "date": "May 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106673381}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Otherwise, very nice place to stay. It was quiet on the back side of the hotel.", "title": "Check around the immediate area first.", "helpfulness": 1, "user": "mostly_happy_camper", "date": "April 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 2.0, "location": 3.0}, "id": 102755373}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "This hotel/motel is on Route 9 where there is no shortage of rooms in the immediate vicinity. The location is near West Point and IBM. Do some shopping around and price comparisons.", "title": "The best hotel in Poughkeepsie", "user": "serek", "date": "March 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 99832961}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This property is fine if the price were around $89 a night. Seems geared to business travelers. Well equipped business center. Free wireless (not stupendously fast); Acceptably clean, but not spotless. Very comfortable beds; good maid service. Very quiet heater/air conditioner, this is a real advantage over the clunkers groaning and rattling in most motels. Swimming pool and whirlpool nice enough. Nothing to complain about with the complimentary breakfast, including waffles and eggs, etc. But lacking in all the details that would warrant a price over $120/night.", "title": "Great, Comfortable Stay", "user": "mercurius_1", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 99322053}], "location": {"country": "United States", "city": "Poughkeepsie"}, "stars": 2.5, "variance": {"poor": 11, "average": 25, "very good": 77, "terrible": 13, "excellent": 103}, "aka": "Hampton Inn Suites Poughkeepsie Hotel", "slim_ranking": 0.384615384615}