{"user_rating": 4.5, "review_count": 207, "name": "Hampton Inn Christiansburg/Blacksburg", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Another great stay. Hotel and room were spotless; location is close enough to VT as well as nearby dining and shopping options. Breakfast was good but crowded - to be expected when the hotel is sold out. Beds were comfy and the internet connection was strong. Front desk staff were very friendly and helpful and we love those cookies. We'll be back!", "title": "Another great stay!", "user": "JohninDC", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143832887}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This is the first time we travelled with our pet. The staff at the Hampton Inn made it so easy and they were very friendly. There was no lecture on how the pet has to behave and what we can and cannot do. The hotel was extremely clean, and the furnishings were up to date. The hotel is very nicely decorated and it has a homey feel to it. Even though it is a pet friendly hotel, there were no smells or scratched furnishings. We really liked it and we will come here again, when we visit our son at Virginia Tech again. The breakfast had a good variety.", "title": "Friendly staff, clean hotel, homey feel", "user": "Sibylle K", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143558599}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I will be staying at this hotel eveytime I visit my son at VT. The hotel staff were courteous and professional. The rooms were nice and clean. The complementary breakfast was great! They even offered bag breakfast to go. (fresh fruit with muffins). The hotel is only mins. from the Mall, Target, and Walmart. Several restaurants are located close by. Also, the hotel was very quiet at night.", "title": "VT parents this is the place to stay.", "user": "BJG2012", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143399500}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "My daughter attends Radford University and I went to visit her. All the hotels were booked in Radford, so I booked at the Hampton Inn. Boy, was I happy there! The hotel was beautiful! We walked into the lobby where we found complimentary drinks (non alcoholic) such as tea, coffee and hot chocolate as well as chocolate cookies. Check in was painless, the room was nice, the bed super comfortable and the bathroom very clean and a nice size. I was impressed with the complimentary breakfast, which served hot foods. The breakfast area was also very nice. Needless to say, when I go back to Radford, I will be staying here!!", "title": "Great hotel!!", "user": "Patricia P P", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142300895}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "Very clean with nice sized rooms. Consistent with the quality of other hampton inns. Free coffee was actually good. Not far from Roanoke airport. Large in room fridge. I only spent one night and didn't have time to try the breakfast.", "title": "A good place to stay", "helpfulness": 1, "user": "PeppeWrangler", "date": "September 27, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 141438203}, {"rating": 5.0, "title": "Good value", "text": "First rate, very comfortable. We booked a king jr suite. At check in we were warmly welcomed. The room was huge, well appointed, very clean and quiet. The breakfast area is attractive, the staff friendly and they offered a wide selection. I will stay here again.", "helpfulness": 1, "user": "Milesaday", "date": "June 17, 2012", "id": 132144122}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "This was a nice stop while traveling through. Lobby and main floor are quite nicely decorated and staff was super friendly. The room was dated but clean. Bed was more than adequate and the hotel itself very quiet. The only thing that stands out as a negative was the morning breakfast. It was truly horrible. The staff was in their little prep room discussing weekend plans while guests tried to figure out if this was the actual food or a joke. Egg and cheese omelette were cold (like possibly straight from freezer), bread stale, hard boiled eggs frozen, fruit salad soupy and sausage type product was flavorless. Lots of restaurants nearby just to one of those instead.", "title": "Above average", "helpfulness": 1, "user": "MommyWentBananas", "date": "June 15, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 132069771}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "This Hampton Inn was a pleasant surprise. Right off the highway, but quiet. Near malls and shopping and restaurants. Wonderful beds and linens. The workout room overlooks the outdoor pool. But the real treat was the covered patio near the back of the hotel. Just lovely to have coffee outside in the morning and get some fresh air.", "title": "Great location, nice outdoor seating area", "helpfulness": 1, "user": "biztrvler", "date": "June 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131935517}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Several of us stayed at the Hampton for my niece's wedding in Christiansburg. (We had 3 rooms) The location was very convenient for us. The hotel was clean, the beds were comfy and the rooms were quiet. The kids swam in the pool. It is a nice pool. The water was still cold but that was because the weather was wonderfully cool while we were there. I used the gym a couple of times. It had 2 treadmills, 1 elliptical and 1 recombant bike. It also had a cable weight machine and medicine balls. The breakfast every morning was good. The hotel also had a very nice seating area outside near the pool and gym. The weather was so cool and dry we really enjoyed sitting outside.", "title": "Nice hotel for family", "user": "Hestia_55", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131895076}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My mother and I stayed at the Hampton Inn Christiansburg for two days in May while visiting a family friend. The hotel is located in a newer area of Christiansburg (box stores and businesses - an Outback Steakhouse is just across the street) and is accessible to both Christiansburg and Blacksburg via 460. The property is very well kept and the room was very comfortable. We had stayed in two other hotels on our trip and my mother commented how nicely decorated the room was - very calming colors. The room and bathroom were very clean and the room had no odor at all. We had two dogs with us and the hotel is very pet friendly. Fridge and microwave in room, and a nice grassy dog potty area complete with a bag/trash station. When I checked in they said that guests with pets are on the first two floors, although we did not see anyone else with a dog. The elevator is very fast and the door closes slowly, both good when traveling with dogs. All of the outside doors (except front) are locked at all times and you had a feeling that the hotel is very secure. We did not use the outside patio area/pool/lounge but many guests were using them. Coffee/hot water are available 24/7 and the breakfast was very nice. Our only complaint (very minor) is that you rarely saw the person manning the breakfast area - at other Hampton Inn's I've stayed at this has not been the case. But all the meal choices were available and we did not need anything - just an observation. Overall a very nice stay.", "title": "Very nice stay at a pet friendly hotel", "helpfulness": 1, "user": "Calisto18", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131479444}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We've stayed here twice and will be back. Hotel and rooms were spotless -- if it is not new it has been recently renovated or well maintained. Breakfast was over run by a teen-age swim team, but 15 minutes later it was quiet and fully restocked. Easy access with lots of dining options close by (Outback is across the street) and close to VT. Great hotel and great service from the staff.", "title": "Spotless hotel in a good location.", "helpfulness": 2, "user": "JohninDC", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135314137}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Before my son and I arrived at the hotel, I called the front desk of the hotel to ask various questions. I was fortunate enough to speak with Kathleen at the front desk. During our conversation it became clearly apparent that Kathleen is a representative who truly loves her work. The following morning upon our unexpected early arrival, Kathleen arranged for us to check into our room as fast as she possibly could, as the hotel was fully booked. While we were waiting we were offered breakfast, and were able to check in to our room by the time we had finished. Kathleen is a true reflection of what the Hampton Inn brand stands for. I do hope that she rises through the hotel's corporate ranks. She would be wonderful in a position training other front desk representatives in your region.", "title": "Fabulous Front Desk Service!", "helpfulness": 1, "user": "HasFourKids", "date": "July 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134669553}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "All the staff in the hotel were friendly and accommodating. The hotel room was large and had a generous size refrigerator and microwave in it. The bed was extremely comfortable, and the television had many channels to choose from. The breakfast buffet had a good array of choices. The freshly baked chocolate chip cookies in the evening were the perfect touch.", "title": "return vistor", "helpfulness": 2, "user": "travelingalColorado", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134631590}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "When we return to Christiansburg again, we will definitely stay here again.", "title": "Have been staying here for years", "user": "Misspriss0183", "date": "July 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 133890164}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "My family and I have stayed here several times. We have never been disappointed. The rooms are clean, the staff is great. I've used the fitness center and the machinery is always in good condition and clean. Easy on and off the highway and very close to all amenities. Breakfast is typical Hampton Inn fare.", "title": "Great room, comfortable bed only topped by great front desk service", "helpfulness": 1, "user": "OJMarge", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132150212}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My daughter goes to Virginia Tech and we went to visit her. We decided to stay overnight and rent a room in Hampton in. We had very good experience. Our room was very clean and quite spacious. Toilet was also very decent. They serve com[complementary breakfast and it is fabulous. Parking space is also satisfactory. It also located very close to popular restaurants and shops. Overall i must recommend this hotel if someone is visiting this area.", "title": "A decent place to sleepover.", "user": "jic2863", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141232935}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "My son and I visited VA Tech for a weekend and stayed at this property. It is a wonderful place to stay. Freshly baked cookies were available at the front desk at check-in, coffee and hot chocolate were available 24/7 in the lobby. Beds were comfy and very cozy, clean! Good water pressure in the shower, towels were fluffy and absorbent. There was a nice supply of shampoo, conditioner, moisturizer, mouthwash, AND shower gel. High def 1080p TV impressed my teenage son! Refrigerator, microwave and single-cup coffee maker impressed me. Breakfast was far superior to other similarly-priced hotels. Scrambled eggs with steak and cheese, homemade oatmeal (not instant), and fresh fruit -- all to be enjoyed in a lively breakfast room with flat-screen TV. It is just off the interstate, near shopping and restaurants (Target, Olive Garden, etc). We will never stay anywhere else when visiting Blacksburg/VA Tech!", "title": "Won't stay anywhere else when visiting VA Tech", "user": "AZSportyMom", "date": "September 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139747775}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I don't know if this Hampton is new, but if not, I'm sure it has been newly renewed.", "title": "Good Hampton standard on fresh building", "helpfulness": 1, "user": "DavidKB", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139110109}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "You should expect a Hampton. Nice very clean room, big white clean feeling comfortable bed, lots of pillows.", "title": "Very clean hotel, close to Tech and shopping centers", "helpfulness": 1, "user": "JessicaM6", "date": "August 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 138424109}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Convenient clea bathroom.", "title": "Great stop while traveling 81.", "helpfulness": 2, "user": "DebraS23", "date": "August 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 137443216}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I were heading to Washington, DC and stopped to visit friends en route. The Hampton Inn and Suites motels are usually very good but this one is excellent. It is super clean, super sleek and the staff are very friendly. Hampton Inns have larger refrigerators than most motel chains and the room was large and comfortable. Microwave, desk, sofa, cocktail table and large tv made us very comfortable. The complimentary breakfast was very good and they even offered \"to go\" bags. They offer coffee free of charge 24/7 in the lobby. Great location. I would stay again. It is also close to restaurants.", "title": "Great Place to Stay on the Way!", "user": "Patroberts_11", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131466960}, {"rating": 5.0, "title": "Great Hotel for the Family", "text": "This is our second time here. The property is immaculate and the staff is professional and very helpful. The gym and pool are very well kept and clean.", "user": "WickedTravelah", "date": "June 1, 2012", "id": 131103285}, {"rating": 4.0, "title": "Very convenient and good instalatiosn", "text": "The hotel IS pet friendly. You would never know it, as the property and guest rooms are always pristine.", "user": "DavidKB", "date": "May 18, 2012", "id": 130158750}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Great location too....plenty of restaurants and stores within walking distance and up to 1/2 mile drive.", "title": "Beautiful hotel, can't go wrong!", "helpfulness": 1, "user": "ADoerr", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128110730}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Well located, roght in front os a shopping mall, all different restaurants very close by.", "title": "Another great reason to choose Hampton Inn", "helpfulness": 1, "user": "drrosenthal", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127868371}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This was an extremely clean Motel located in a good area for restaurants and close proximity to the downtown Christainsburg area. They offered a good breakfast each morning and at times had fresh bakd chocolate chip cookies in the lobby. The Lobby always had hot coffe, hot water with tea.", "title": "Excellent Stay", "helpfulness": 1, "user": "JiamesB", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125236597}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "the people at the front desk went out of their way to make everything as good as possible.", "title": "It's the service stupid!", "user": "VGraphas", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125054484}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "When you arrive for the night at a mid-priced hotel, road weary and anxious to flop on the bed, call delivery and pass out watching Chopped!, all you need is a little civility; a clean room, friendly staff and something that goes beyond \"friendliness\". Let's call that attentiveness or even babying. We showed up after driving from Alabama. The room looked great, but unfortunately the standard poodle found the trash can still with garbage in it. I picked up the phone, called the desk and explained the situation. Within 2 minutes, the desk clerk retrieved the can with apologies. Two minutes later, he was back with the can. He ran off and came back two minutes after that with four cokes and popcorn. Now that's what I am talking about! It would have been nice to have started with the clean trash can, but mistakes always happen. How many hotels do you go to that would take care of customers like that? Trust me, I travel a lot. Go to this place. You other hotels, pay attention.", "title": "I enjoyed my stay...", "user": "itiswrtn", "date": "February 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124893202}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The staff was great. I really had a comfortable stay..", "title": "A hidden gem near VT", "user": "Allen W", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124887916}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "It's a shame I didn't find this hotel two years ago when my daughter was a freshman, but better late than never. I echo the other reviewers sentiments about staff friendliness, hotel cleanliness, breakfast quality and hotel comfort. However, we had a dog on this trip and, after this visit, this hotel will be added to our dog's Christmas card list. They reserve rooms on the first and second floors for pets so they are close to a large, lit and clean dog area with poop bags and disposal locations. On top of that they keep dog biscuits at the front desk and asked us to bring our dog up to meet them as \"they just love dogs!\"", "title": "I will stay here again", "user": "canelle2903", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124463276}], "location": {"country": "United States", "city": "Christiansburg"}, "stars": 2.5, "variance": {"poor": 0, "average": 9, "very good": 40, "terrible": 2, "excellent": 156}, "aka": "Hampton Inn Christiansburg/Blacksburg Hotel Christiansburg", "slim_ranking": 0.0769230769231, "description": "Located in the heart of Christiansburg’s commercial and retail districts, the Hampton Inn Christiansburg/Blacksburg is the perfect place to rest after a day of business meetings or hiking. From the New River to the charm of downtown Blacksburg, there is no shortage of things to do or places to see. While you stay at the Hampton Inn Christiansburg/Blacksburg, enjoy a free hot breakfast each morning, complimentary high-speed internet, pool, fitness center and a clean and fresh Hampton bed."}