{"user_rating": 4.5, "review_count": 316, "name": "Hampton Inn & Suites by Hilton Halifax - Dartmouth", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This Hampton hotel is in a great location for family. Shopping near by movie's with many great and new titles in walking distance. Many slections of places to eat. The Hampton was easy to find and check in was fast and easy.", "title": "Great location", "user": "Howard J", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168940533}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "no problems, was what I expected, value for your money, would stay there again, good location, friendly staff, lots of free parking, lots of restaurants close by, close to great shopping district with plenty of store choices", "title": "good hotel", "user": "John H", "date": "July 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168806367}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "My children and I stayed at the Hampton Inn Dartmouth for two nights in early July and had a wonderful stay.", "title": "Great stay. Great waterslide! Great location.", "user": "Gogojanet", "date": "July 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168631414}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel rooms were very clean and comfortable. The pool and hot tub were well used, and my children loved the waterslide.", "title": "Personal", "user": "Milton B", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168663563}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Breakfast was good with scrambled eggs, hash browns, sausages, oatmeal, assorted breads and fruit salad. Breakfast staff were very friendly and helpful in helping us to identify gluten-free options.", "title": "Great Hotel, Excellent Location", "user": "Barry H", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168042824}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Very helpful staff, yes it is clean, well situated in a shopping & entertainment area. Two issues, the breakfast is free, but a bit pedestrian. The shower heads deliver just enough water to keep one damp, you never get a feeling on any pressure, I felt like Kramer on the Seinfeld episode. The place has no bar. It is really good for families on vacation.", "title": "Could be better", "helpfulness": 1, "user": "GeoffL", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 173366534}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We chose this hotel to stay in at the end of our two week holiday primarily for location. That sometimes is not such a great idea but we were pleasantly surprised this time. The hotel was exceptional. We enjoyed our stay very much. Complimentary breakfast was the best I've had anywhere. We would definitely stay here again.", "title": "Pleasantly surprised", "user": "Wade M", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173112923}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This is our \"go to\" hotel in the Halifax area, its close to shopping, you can send the kids to the movies (they can walk) Lots of places to eat, but yet still close to Halifax. There is a good breakfast included with your stay, lots of parking, awesome pool. If you stay in the summer, there is even a BBQ you can use.", "title": "Repeat customer", "user": "Sillypeigal", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173016030}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Comfy beds, clean hotel, fast service if you do have any issues. Overall an awesome place to stay.", "title": "Disappointed", "user": "Lisa A", "date": "August 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173112579}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We normally love this hotel for its cleanliness, great breakfasts, pool fun for the kids and proximity to shops in Dartmouth Crossing. We have stayed many times and were quite impressed each time. However, this time, our experience wasn't as positive and we left disappointed. Perhaps the hotel didn't have enough staff on hand to accomodate the number of guests staying during those days. Cleanliness and overall service were issues for us. Hopefully this won't repeat itself because normally the hotel is top notch.", "title": "Enjoyed our visit", "user": "Sparkyont", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 172905407}, {"rating": 4.0, "title": "Great Hotel, Great location!", "text": "This is a fairly new Hampton Inn which is located adjacent to a shopping center called Dartmouth Crossing which has shops, restaurants and a movie theatre. Very convenient location. Also, there is a biking/walking trail that is accessible right from the hotel. It's about 15 minutes from downtown Halifax . Rooms are clean and nicely appointed. Hampton beds are the best. So comfortable. Makes for a great nights sleep. The breakfasts are typical of Hampton Inns--i.e. an arrary of either scrambled eggs, omelets, sausage,bacon, fruit, breads and cereals, coffee, tea, milk, juice, yogurt, etc. More than adequate. There is a rather large indoor pool with a nice slide. We didn't use the pool but noticed that all the kids were lined up for the slide and having a blast. The lobby and breakfast are are cozy spots for eating or lazing about. There is a fireplace that adds to the charm. All in all, a great place to stay.", "user": "jonsha", "date": "July 29, 2013", "id": 169780135}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We loved this hotel. It is a newer property in the chain, and it shows. Everything was sleek, clean, and modernized. The pool is gorgeous. Our room was very comfortable and clean and we were pretty thrilled after a really long drive. Here's the hidden gem of this property: there is an amazingly fun walking/hiking/biking trail located behind it. Just look off to the western end and see what looks like a sidewalk on a small hill. Follow it over the overpass and then down onto the trial. You can actually walk to downtown Halifax from there, if you have the time. We just meandered around two lake neighborhoods and saw a huge variety of wildlife and friendly folks out getting exercise. The trail is well-marked and has some amazing views of natural and man-made items. I cannot recommend it enough. We felt perfectly safe on it.", "title": "Fantastic Stay!", "user": "Visitor_041998", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169482085}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Near the hotel is also a large entertainment complex with movie theater, shops, and restaurants. All of the shops were closed when we were there, because it was after 6 p.m. on a Sunday evening. We found a nearby restaurant, ordered take out, and brought our goodies home.", "title": "Staff Was Unhelpful and Indifferent", "helpfulness": 1, "user": "TDRamsey", "date": "July 26, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 169222225}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "All in all, a great stay at a beautiful property. Even if you are planning on hanging out in Halifax most of the time, I don't think you can go wrong with this hotel. Kudos to the management and staff.", "title": "A reliable place to stay", "user": "mikeymaki", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169047611}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We booked a room for 2 adults and 2 teenagers (2 queen beds) for a 1 night stay on the weekend. A few days before our trip my niece asked if she could go with us. We called ahead to let the hotel know we would have a 5th guest in the room and asked about a cot. They explained the 5th person was no problem, but couldn't guarantee a cot as they are \"first come, first served\", which is understandable. She told us to simply request the cot when we arrived.", "title": "Amazing Hotel, Great Stay!", "helpfulness": 1, "user": "Chrissyrich", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168918453}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This is our third or forth visit to this hotel - it's our go to hotel in the Halifax area.", "title": "Great Hotel.", "user": "nunopaixao", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171911699}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Nice big room. Nice Pool. Nice breakfast.", "title": "Top rated for a reason", "user": "Clara C", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171451475}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Good location if you're destination is shopping in Dartmouth.", "title": "Anniversary", "user": "Joel L", "date": "August 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 171238384}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Decent Wi-Fi.", "title": "Favorite Place!", "user": "hchilek", "date": "August 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170770693}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "We'll be back.", "title": "Excellent stay, sapcious room, comfy beds", "user": "hcvoyageuse", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169816907}], "location": {"country": "Canada"}, "stars": 2.5, "variance": {"poor": 13, "average": 16, "very good": 87, "terrible": 3, "excellent": 197}, "aka": "Hampton Inn & Suites By Hilton Halifax - Dartmouth Hotel", "slim_ranking": 0.0833333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Hampton Inn & Suites Halifax-Dartmouth is located in the heart of the city of lakes, Dartmouth, Nova Scotia and the popular shopping district Dartmouth Crossing. The only Dartmouth hotel in the Crossing, the Hampton Inn & Suites is 15 minutes from Halifax Stanfield International Airport, 2 minutes from Burnside Business Park and 10 minutes from downtown Dartmouth and Halifax for attractions, restaurants and the lively Halifax waterfront. One of the newest hotels in Nova Scotia, the 163 room hotel, a combination of spacious guestrooms and suites, offers a 100% non-smoking environment, modern amenities, an indoor oversized pool with a 150 ft. waterslide, a fitness centre and is pet friendly. Convenient self parking is plentiful as well as valet parking. Guests can enjoy the Hampton on the House full hot breakfast complimentary or take advantage of the Hampton on the Run breakfast to go. The Hampton Inn & Suites on-site convenience store makes it easy for guests who wish to take advantage of the amenities in their suite such as a fridge and microwave to dine in the comfort of their stylish suite and enjoy their favourite TV show or on-demand movie on the large screen TV. For long term stays, coin laundry and valet service make it easy to maintain your wardrobe even while away from home. Business travelers will especially enjoy the business centre with complimentary printing services and meetings bookings are made easily with the Hampton Inn and Suites on-line booking tool."}