{"user_rating": 4.5, "review_count": 318, "name": "Hampton Inn Kalispell", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My wife and I like to stay at Hampton Inns when we travel and we really enjoyed this one.We spent 3 nights here and found it to be pleasant, clean and very comfortable. We also found the breakfast to be better than other Hampton Inns we've stayed at. So if you you are looking for a nice place to stay near Glacier NP, this will suit you well.", "title": "Very Enjoyable Stay", "helpfulness": 1, "user": "Michael P", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 166957099}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We recently stayed at the Hampton. Grounds and appearance are very nice. Room was very good and quiet. Breakfast was decent and they mixed things up every day. Overall a nice hotel. Not sure why the review must have 200 characters as a minimum...what else is there to stay. I guess go to Mooses for a beer and the best pizza in western Montana.", "title": "Nice stay", "helpfulness": 1, "user": "Paraic N", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 167004542}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I have always enjoyed the Hilton Brand -I booked two rooms for a family trip to Glacier National Park. My family was very impressed with the quality of the rooms. Clean and quiet. We always appreciate a free breakfast and the food was good (for a freebie). Although we were 30 minutes from the park - we have no regrets. Great hotel - would highly recommend it if your in the area. We stayed using free points so can't comment on the value.", "title": "Excellent Hotel", "user": "hounddog87", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167004115}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Hilton is my brand of choice, and I really enjoyed this Hampton Inn. Lovely room (all room requests fulfilled), great staff, good location, and the breakfast seemed better than usual. Would return in a heartbeat.", "title": "A great Hampton Inn", "helpfulness": 2, "user": "Aimless", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166866389}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Stayed here for my trip to Glacier Park. Very good hotel and I liked the convenience of it to the rest of Kalispell and Glacier. I would definitely stay here again. I'm not sure when it was built but it felt newer. The beds were comfortable. The breakfast is typical for Hampton but wasn't bad.", "title": "Good experience", "helpfulness": 1, "user": "Carl H", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 166697253}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We had a joint room with family and we had a blast! The Hotel staff were very nice and the pool was awsome. We loved how it was open 24 hours :) We would stay there again the breakfast had a lot of selections as well and very good.", "title": "Excellent Hotel", "helpfulness": 1, "user": "Dale R", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 164767343}, {"rating": 4.0, "title": "Lifesaver", "text": "WE were on the east side of Glacier Nat'l Park, and all booked into a place that turned out to be a DUMP. Too scared to stay there, we called the Hampton, 2 hours west, and headed out. What a nice place this is. Many people to check you in, all the amenities travelers need. VERY clean, friendly, and I will definitely be putting Hampton on my \"list\" for the future. I want these points!", "user": "Kaardiner", "date": "June 18, 2013", "id": 164446312}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband checked us and since I do our reviews, I asked how it went and he said the service was very friendly and quick so we started off with an immediate positive impression.", "title": "Central location with notable service points.", "helpfulness": 2, "user": "1happyrover", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164322018}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "When we entered the room, I could smell it was clean (with my sense of smell, I can often tell when things are \"off\"). The room was large and I was appreciative that they use a white duvet cover with a note that it was cleaned prior to our check in. Most of those hotel expose shows have highlighted that the top decorative bedspread in hotels are rarely washed (we usually fold them down so we don't have to touch them) so to use white ones that can't hide dirt and stains and leaving a note that it had been cleaned, is a smart and progressive touch.", "title": "Mixed review", "user": "Carlos C", "date": "June 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 163743896}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Regarding the room décor, it wasn't exactly my taste (wallpaper borders should be banned) but it was large, otherwise inoffensive and clean. The one area that could have been improved was storage. We stayed there for a week and the room could have used a few more spots for our items. The toilet and shower was separate from the sink and vanity area and being separate, it really would have benefited from a shelf or small bathroom cabinet. There was plenty of space to provide storage and it would have been useful. In the living area, there was a sofa in front of a large LCD TV but no coffee table. On at least one evening, we had planned to bring dinner back to the room for a break from restaurants but it wasn't practical with no logical place to put food and drinks.", "title": "Nice hotel and very good value", "helpfulness": 1, "user": "JJRG", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 163395673}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Our 4 day stay could not have been better. Facility is well off the road insuring no road noise at night allowing for a great night of sleeping. Breakfast selections varied from day to day, housekeeping was prompt and the staff did everything possible to make our stay enjoyable. Everyone had a great time from 82 to 5.", "title": "Kalispell family reunion", "user": "Paul F M", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166361963}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "As with most Hampton Inns we received a warm welcome (even though all the freshly baked cookies had been eaten), reception was clean with plenty of luggage trolleys on hand. Our room was more than adequate, spacious, clean and with an oh so comfy bed. Breakfast was good, plenty of choice so no complaints.", "title": "Comfortable place to stay after a long drive", "user": "madorabaybums", "date": "July 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 166239683}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This hotel was the base for our family reunion. The staff was wonderful and very accommodating. My only (very minor) complaints are that the elevator was extremely slow, and that the housekeeping staff sprays the room with strong air freshener which causes me some breathing problems as I have chemical sensitivities. But for people without my problem, this is a wonderful hotel. And I thought it was wonderful too, but wish that air freshener weren't automatically used.", "title": "Great place for a family reunion", "user": "Lynne C", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166241033}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I stayed here during a brief trip to Kalispell. The service is friendly and the room was clean. Per TA recommendations, I booked a suite and was very happy. The room was clean and modern, the balcony plenty large enough to enjoy our morning coffee. The “view” was simply the front of the hotel, looking out over highway 2, so nothing terribly special but still it was nice to be outside. I had requested to be away from vending machines and the elevator, and we were at the far end of the hall so it was very quiet. The bed was comfortable and the room was filled with nice touches, from the artwork on the walls to the double-head shower to the bottles of water left in the fridge and the microwave popcorn left for us on the counter. Despite being somewhat close to highway 2, we heard no traffic noise at night. (The free breakfast had a reasonable selection, although we didn’t eat there. We also didn’t use the in-room Jacuzzi.) I would definitely stay here again.", "title": "nice place!", "helpfulness": 1, "user": "bettibiz", "date": "June 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 165614288}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "While I was there for business i had the plesasure of staying at this hotel. I had no problems that did not get answered and very helpful on destinations and how to get there. I would stay here again if I was ever back in the area.", "title": "Great Place To Stay", "user": "Mindy W", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165275349}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We booked this hotel for two nights while visiting Glacier Natl Park. It's about a half hour from the park entrance. Just a bit west of downtown Kalispell but not really walking distance unless you REALLY like to walk! Beds were very comfortable and the room was a decent size. The kids loved the indoor pool and hot tub. Breakfast was the standard \"continental plus\" breakfast with a few hot items as well. Parking was free and ample. My only complaint was that the toilet paper and Kleenex were the super-cheap and rough variety, like what we had in school growing up. I can't remember ever staying at a hotel with these cheap paper products. However, I would recommend this hotel and would definitely return if we visit the area again, I will just bring my own TP and Kleenex!", "title": "Great stay, just bring your own paper products!", "helpfulness": 1, "user": "HMTY", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 168247223}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We enjoy staying at Hampton Inns because of their consistency. This Hampton felt a cut above our usual stays and had a \"good feeling\" about it. It's larger than other Hamptons in similar-size cities. It was clean, nicely furnished, comfortable bed, quiet, easy check-in and check-out. A standard breakfast served early enough for our early morning departure to Glacier National Park. I was sorry we could only stay one night. A positive experience with absolutely no complaints.", "title": "A cut above", "helpfulness": 1, "user": "travel_is_fun1000", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167732739}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "This facility provides a very good base of operations for visiting GLacier Nat'l Park and the surrounding area. The location, on US 2, is convenient to most of the areas points of interest and is an easy drive to the park entrance.", "title": "Visiting Glacier Park", "user": "Bill P", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167745525}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed here for 2 nights while we were going to the Bison range and to explore Whitefish, MT. Beds and room was very comfortable. Breakfast was your typical Hampton in Breakfast which was served early enough for us to get out to the Bison Range. No complaints at all.", "title": "Hampton Inn Kalispell perfect for our needs", "helpfulness": 1, "user": "LINYdeb", "date": "July 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167595136}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Hampton Inns are a standard when my family travels. Hampton Inn Kalispell fits the bill.", "title": "Great Hampton Inn", "helpfulness": 1, "user": "Doug V", "date": "July 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 167219344}], "location": {"country": "United States", "city": "Kalispell"}, "stars": 2.5, "variance": {"poor": 3, "average": 24, "very good": 102, "terrible": 0, "excellent": 189}, "aka": "Hampton Inn Kalispell Hotel", "slim_ranking": 0.181818181818, "description": "When you're traveling for business or that much-needed vacation, you'll want to find a Kalispell hotel that offers modern amenities and stellar service. And that's just what you'll find at the Hampton Inn® Kalispell hotel. We're conveniently located off Highway 2, only nine miles from the Glacier International Airport. Whatever your pleasure-from snow-skiing to shopping, boating to picnicking-you'll find it all just a short drive from our comfortable Kalispell hotel."}