{"user_rating": 4.0, "review_count": 109, "name": "Hampton Inn Marion", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Hampton's my first choice for business travel, and the Marion is a good example of why. Spotless rooms, friendly staff. Several restaurants within walking distance, and a Wal-mart and mall a couple of minutes away. Applebee's just steps away. Convenient to the highway.", "title": "Quiet, Just Far Enough Off the Highway", "user": "Accidental_Turista", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128978895}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Furniture in pretty good shape, the carpet was nice blue/green and plenty of hot water. Internet nice and fast. Front desk staff pleasant and efficient (online check-in available). They had a Mon-Thu evening social going with a free drink a couple appetizers; nice touch but don't know if it's a permanent thing. Would definitely stay again if in the area", "title": "a better hampton", "user": "braneout", "date": "April 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 128623039}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stopped at this hotel for an overnight stay while traveling. Hotel was clean and accomodating.The manager was friendly and was kind enough to recommend a nice restaraunt, the 17th st Grill which was within walking distance. Breakfast was ok, although, the eggs could have been warmer. Overall, this made for a nice break from the road.", "title": "Friendly for travelers", "user": "popenny", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126967346}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I usually have good experiences with the Hampton Inn but this stay was very different. We came just in time for the last room, which didn't have a TV and they gave us a discounted price which was great. The room was okay until we found a bug on the night stand. But we weren't too picky about it because it can happen, even in the cleanest rooms. Then we started to see more and more ants crawling on the night stand. We also found 3 ants on top of the covers on one bed and 2 ants in the covers on the other bed. It was very disgusting and when we talked to the front desk about the problem she gave no apologies and just said she would not charge us for the room. When we later called the manager to make sure they did not charge us for the room he also offered no apologies and said that they have been having ant problems lately. Definitely will not be back to the Hampton Inn.", "title": "Won't be back", "helpfulness": 1, "user": "Samantha B", "date": "March 18, 2012", "detail_rating": {"cleanliness": 1.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 126279491}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The hotel is solidly built, with ample free parking, friendly check-in, some sort of free food in the evening (I was not able to partake), a solid free breakfast, a good sized room with a slew of cable channels on the flat panel tv, plus a refrigerator, and microwave. I would definitely recommend this hotel.", "title": "Nice place to stay", "user": "Charlie500", "date": "March 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125949061}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "No big surprises one way or another - the hotel seemed to be clean, the room was clean and tidy. The front desk gentleman was very helpful in suggesting restaurants to a tired traveler. Bed was average - nothing special. But it met my basic needs as a business traveler and I slept fine. I didn't have time to take advantage of anything more than a cup of tea on the way out the door in the morning but the breakfast looked appetizing.", "title": "Reliable Hampton Inn", "user": "PrincessKatja", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 140527828}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I was pleasantly surprised with my stay at the Hampton. I usually stay in a Hilton property (I'm a point junkie), but usually they are \"ho-hum\". This one was different. Maybe it started with the complimentary cocktail at the \"Manager's Happy Hour\". But it definitely ended with one of the BEST breakfast buffets! The western omelette was very, very tasty, the sausage patty had just the right amount of spice and the biscuits were hot and fresh tasting. All-in-all...very, very happy.", "title": "One of the BEST Hampton Breakfasts!", "helpfulness": 1, "user": "itchyfeetx2", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136092726}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My only \"learnng\" was to always ask for a room away from the stairway. There was lots of noisy activity in the morning...good thing I wanted to get an early start for home.", "title": "Great Stay", "user": "Karen J", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135463686}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Enjoyed our stay at Hampton Inn in Marion. The room was very clean. They offered a great breakfast and the menu changed daily. For our evening meals we had lots of great restaurants within walking distance of the hotel. The property was well maintained. The hotel was easy to find from the interstate and easy to access.", "title": "first and last hampton inn", "user": "lela m", "date": "July 22, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 135068013}, {"rating": 3.0, "title": "you can get more for your money somewhere else.", "text": "expensive!!! 119 dollars but we were tired .. very clean very nice room but if you cant sleep", "user": "TravelingSarahC", "date": "July 14, 2012", "id": 134351899}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Great place to stay. We enjoyed it so much, the staff was wonderful.The breakfast was great. We have all ready booked for the weekend after Thanksgiving. We plan to make this a special retreat for our family and our church family.", "title": "Great place To stay", "user": "happy015", "date": "October 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10079200, "likes": {"liked": "— clean", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We choose this hotel because we wanted to drive a part of the Blue Ridge Parkway the next day (and would like to avoid busy Asheville). We had a coupon and luckily they still had a room for one-night. The hotel is close by the highway but far enough to hear any noise. The lobby is spacious and nice decorated. The girl behind the desk was friendly. Our room wasn’t ready; so, with her good assistance and a given map, we decided to drive to the tourist center first. There are no restaurants or shops on walking distance; from the hotel it is approximately a 5-minute drive to town. We also got two cold bottles of water when we arrived, a very nice gesture, as it was hot that day.", "title": "Can fully agree with all other reviews, a great Hampton Inn", "helpfulness": 4, "user": "BA-traveler", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8256239, "likes": {"liked": "— The friendly staff, the free small gifts and the lovely patio", "disliked": "— Cannot think of anything"}}, {"rating": 5.0, "title": "Excellent everything", "text": "Upon return we could enter our room. It was a pleasant room on the ground floor with, although de window was small, a nice view on a green area with grass and trees. The furniture was dark, the bed and sheets of top-quality and there was a comfortable recliner with ottoman and work desk with chair. We had a microwave and refrigerator as well. What made this hotel so wonderful were the forthcoming and friendly staff (not only at the front desk but they were all very kind) and the small details. Of course the free water upon arrival and in our room we found free cookies and two small packages of chips with compliments from the management. In the lobby were free bottles of cold-water available for all guests and in the afternoon freshly baked cookies and chips. There is no separate business center; in the lobby is a working desk with computer and printer.", "helpfulness": 1, "user": "Grabben", "date": "January 20, 2007", "id": 6628867}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "There is a swimming pool inside, no outdoor pool. But there is a lovely and quiet patio in the garden, with tables, chairs with tick comfortable cushions and parasols. It was great to sit here in the late afternoon.", "title": "Best Mid-Price Hotel I've Ever Stayed In!", "helpfulness": 2, "user": "We'reAlmostThere", "date": "November 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6171203, "likes": {"liked": "— Feeling like I was an honored guest staying in the home of a friend", "disliked": "— Can't think of a thing I didn't like"}}, {"rating": 5.0, "title": "We loved the Hampton Inn in Marion & Charles' Gem Mountain we're moving ASAP!", "text": "Breakfast was good, many items to choose from. Only the ‘hot items’ were frozen and had to be micro waved. (We were in several Hampton Inns along our route and it was funny that almost every where we had the same stuff available with breakfast, although the items are numbered from 1 to 10 and change every day.) In all ways it was a comfortable and relaxing stay in a fantastic Hampton Inn.", "helpfulness": 1, "user": "DIANASIMMONS", "date": "October 24, 2006", "id": 6007373}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Our families and us stayed here during the weekend of our wedding. First of all, it was a breeze to block rooms off. The hotel staff was very accommodating when we needed to makes changes or add rooms. Our families ended up staying two nights and enjoyed to pool, the free cookies, and a nice hot breakfast in the mornings. As I mentioned before, the staff was very helpful and in some cases went above and beyond our expectations! When I checked in, they even had made a note that I was the bride and had prepared a plate of cookies for me and my bridesmaids! Nice little stop, highly recommend!", "title": "Great staff, great hotel", "user": "Mrs_AJMoo", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130862769}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I stayed at this hotel while driving for business.. I booked the room online around 10 pm the day of arrival and put in the notes that I expected to arrive at the hotel around 2am. Usually nobody even looks at the notes you put into the booking process, but this place was on point. I called them ahead to give the hotel a heads up when I booked the room, but shift was changing and I just assumed that I was going to arrive and it would not be good, however, I was greeted at 130am by the lady behind the desk named Jennifer. She was awesome and had all my info and room ready to go. The hotel itself is very nicely appointed, the room was clean and very nice and parking was plentiful. There are also several places that can be used to park vehicles wtih a trailer. I am very pleased with this hotel and will stay again if I am traveling through the area.", "title": "nice hotel with very helpful staff", "user": "Derikk T", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 130558732}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We had a very nice stay here. This Hampton lived up to the standards set by others in the hotel chain. No real complaints here. A nice place to stay if you need to stop in Marion!", "title": "A clean and pleasant!", "user": "MarieMom25", "date": "May 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130278286}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "My friend and I stayed at the Hampton Inn, Marion, while our boys were in the area for their high school baseball team's Spring Break Baseball Trip. We found it to be clean, comfortable, and relaxing. They had the usual breakfast fare, but it was well-stocked and the attendant was very personable. The heater for the pool was not working, so we used the small workout room for exercise. There was also a little patio off the pool, which was very nice. Several times we needed directions to places, and the front desk person stopped what she was doing to get us out information. I would certainly recommend this Hampton Inn.", "title": "Relaxing Stay", "user": "coconutsmom", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129527189}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Busy area with lots of hotels to choose from but they had a price under $100 for 2 Q beds and was non-smoking. The rooms were clean, quiet and well furnished. The beds were comfortable and a couple of cups of decent coffee and necessary toiletries were appreciated. Our only complaint was the size of the breakfast room - one 4 top table, three 2 top tables and a large bar table with bar stools, which elderly people or handicapped cannot manage to sit at. Between 7 & 8 am, there wasn't any sitting for our group of 5 -two grandmas and one person with disabilities. The breakfast was well stocked, but we couldn't take advantage of the hot items. We did sit on a sofa in the lobby but... Otherwise we would recommend this hotel because of its cleanliness.", "title": "Clean and quiet", "user": "Lorenzo_8", "date": "April 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 129027262}, {"rating": 5.0, "title": "The Best Hampton Inn !!!!!!", "text": "I stay at this hotel several times a year and by far it is the best hotel. The experience starts when you walk through the Front Door. This hotel knows customer service and how clean a hotel should be. This Hampton is the leader by far!!!! I reccomend for all who will be traveling to Marion to stay at the Hampton Inn.", "user": "A TripAdvisor user", "date": "June 22, 2006", "id": 5375974}, {"rating": 2.0, "title": "Guarantee Not Honored", "text": "I searched the web and chose this more expensive hotel because I wanted the extra ammenities of a laundry, pool, and hot tub. I arrived and asked the clerk for a room near the laundry. I washed a load, then discovered the dryer was broken (there was no out-of-order sign on the dryer). The same clerk then told me the dryer had been broken for two days. Nice of her to tell me AFTER I had washed my clothes. I had to pack up wet laundry to the laundrymat down the street. Afterwards, we went to get in the hottub only to find that it was drained and would not be filled until the next day. Per instructions from the hotel comment card, I called the desk to complain and ask for even a small reimbursement. \"Oh, sorry we can't do that\". I paid $95 for a $65 hotel. The Hampton Inn 100% Satisfaction Guarantee is a joke and needless to say I will avoid their hotels from now on.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 29, 2003", "id": 1118616}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The hotel was recommended by the business I was visiting in the area.", "title": "A solid Hampton Inn", "user": "Fortwood", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15809566, "likes": {"liked": "— Cleanliness and location", "disliked": "— Fitness center quipment was somewhat old"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel was clean, and had all the amenities of typical Hampton Inn. There were a lot of snacks provided in the afternoon, like cookies and popcorn.", "title": "Wonderful place to stay", "user": "dkbee", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 15736660, "likes": {"liked": "— Comfortable bed", "disliked": "— Non-smoking whirlpool room unavailabe at the time"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "This is a very good hotel for a business traveler with a car since none of the restaurants are within walking distance. There are a few nearby restaurants that deliver to the hotel.", "title": "Great Rates", "helpfulness": 1, "user": "kevboom", "date": "April 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15246742, "likes": {"liked": "— Great Price", "disliked": "— Doctor's Office Wallpaper"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I recommend calling the hotel before heading out to find out the exact location because the map is incorrect. (It will put you about 5 miles off.)", "title": "Nice hotel", "user": "angelika20022", "date": "April 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14918777, "likes": {"liked": "— everything"}}, {"rating": 5.0, "title": "Must-Stay Hotel", "text": "On a recent visit to the mountains, my husband and I were checking on different options for future vacations. We looked at camping cabins and other such options. Then we checked into the Hampton Inn at Marion and found it to be the nicest place! In traveling for his work , he has stayed in many different hotels and inns, and this one surpassed them all. The rate we got was better than that offered online for a room with a king sized bed in a non-smoking room. It was the most comfortable bed we had ever slept on, with very comfortable pillows. The staff was also very helpful. I think anyone would enjoy their stay at this hotel. I might also add that I won't be looking at any more camping options with such luxury so close to so many local attractions.", "user": "AliCat611", "date": "February 19, 2008", "id": 13687969}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Spent two nights at the Hampton on Friday and Saturday night. Great location with plenty of restaurants nearby and the interstate is close as well. Pool was small but seemed clean and well-kept. Delicious cookies everyday after 2 pm in the lobby! Our room did have an odor to it although it could have been from my daughter's sweaty shoes?!? On Friday night around 11-12 the fire alarm went off, causing everyone to get out of bed. It happens I suppose. The only problem is it happened again Sunday morning around 2 am, waking my wife and youngest daughter. Two nights in a room with a late fire alarm is alittle tougher to accept. Otherwise a good stay over the course of 2 nights.", "title": "Fire Alarm!!", "helpfulness": 1, "user": "Curt F", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 133940122}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Convenient, clean, great bed. Good value! Sydney at the front desk was most helpful, giving us a great restaurant suggestion - the 20's Hideout.", "title": "A good nights sleep", "user": "Ellis3752", "date": "July 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 133900766}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "My husband, daughter, and I stayed in a king room with a sofa bed. The room was very clean and spacious. We were given a room right by the elevator and ice machine, however noise was not an issue. The only negative that we encountered here was the temperature in the pool. It was extremely cold. My daughter played in it for about 15 min. and then she was too cold to continue swimming. Overall, however, our one-night stay was great.", "title": "Great hotel!", "user": "Laurenm305", "date": "June 17, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 132155042}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed two nights, the staff was great and the breakfast was very good. This is a great value.", "title": "Great Value", "user": "lsj1214", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131307554}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We recently stayed at this Hampton. It gets good marks across the board except on the matter of hot water. We stayed three evenings and had luke warm showers on two of the three evenings. Finally got a hot shower when we got up at 5:30AM.", "title": "A good hotel but no hot water", "user": "robert p", "date": "June 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131214596}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "I have stayed at many Hampton Inns ,but this hotel has to be the best.Everything is excellent.In the last five years I have stayed there at least 10 times on business trips and the hotel is always outstanding.Book early,always at or near capacity.", "title": "excellent hotel", "helpfulness": 1, "user": "cbce1pjb", "date": "September 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5806838}, {"rating": 5.0, "title": "Great place", "text": "One of the best values for $$ we've ever found anywhere in the world -- not exactly 5 star quality but a whole (whole) lot more than what you pay for - nice job folks.", "user": "trvlin", "date": "July 25, 2006", "id": 5507996}, {"rating": 5.0, "title": "GREAT Hotel", "text": "Spent 2 nights at the hotel on Business. I was very impressed with the cleanliness and the hospitality by the entire staff. The breakfast bar was outstanding. A Great experience would definitely stay here again Would highly recommend!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 17, 2006", "id": 5476074}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "I have travelled with my Company for over 25 years, and was pleasantly surprised to find such wonderful accomodations at this Hampton location! A very courteous and professional staff who went out of their way to accomodate us, plush, plush mattresses with duvet covers, some rooms had studies (more like a suite), nice pool, refreshments out at all times, free use of fax, great internet connections, and very new and clean. Thirty mins from Asheville (south) and Boone/Blowing Rock (northeast). A WELL KEPT SECRET! I would recommend to anyone for personal or business travel!!", "title": "What a great hotel!", "helpfulness": 2, "user": "Mackro", "date": "July 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5475608}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "we found this to be a great small hotel. Check in was polite & professional. Best we have expierenced in a very long time. The reservations were correct, the lobby very clean, and the room spotless. The fitness room and swimming pool were outstanding clean. There were cookies and coffee still available even though we checked in late. There was also free popcorn and tea. Next morning there was a newspaper and the breakfast was outstanding. Not one time did personnel permit any of the food to run out as they constantly replinished the food even up to closing time. The dining area was once again spotless. I noticed a 98.5 rating by the health department. Check out was smooth and easy. The elevator ran quickly and we were always able to get it without a long wait (we were on the second floor). Parking outside the hotel was close to the lobby. This is a very nice hotel and one of the cleanest we ahve ever stayed in. As a side note we were there a day after July 4th and we noticed many colorful fourth of July decrorations throughout the hotel.", "title": "Greta Hotel", "user": "texaswillie", "date": "July 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5434127}], "location": {"country": "United States", "city": "Marion"}, "stars": 2.5, "variance": {"poor": 10, "average": 20, "very good": 40, "terrible": 0, "excellent": 39}, "aka": "Hampton Inn Marion Hotel", "slim_ranking": 0.5625, "description": "Unwind and relax at the Hampton Inn Marion, IL hotel, where you can enjoy Kokopelli golf course, catch a Southern Illinois Miners game, or take a dip in Crab Orchard Lake. Hotel guests can take advantage of the many value added amenities offered by Hampton Inn. Start your day with our free hot breakfast buffet daily, and enjoy free WiFi in every room and throughout the hotel. Relax and unwind in our clean and fresh Hampton beds, or stay productive with our handy lap desk. Keep your fitness routine in our fitness center, or take a leisure dip in our pool. We look forward to having you!"}