{"user_rating": 4.5, "review_count": 261, "name": "Hampton Inn Bennington", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I stayed at this hotel for a weekend get-away. The staff was fantastic! We were greated by a warm welcome and check in was very fast and efficient. The bedding (which I guess is new) was very fresh and clean. I was pleasently surprised to see that my socks did not get dirty on the carpet (which is normal in most hotels). The room was spacious and cofortable. We went down to breakfast the next morn, and I was again impressed. I would typically spend $10 a person at Denny's for a hot meal like what they served. The wireless was strong (and FREE huge bonus!) I did not use the fitness center, but the indoor pool and hot tub were great. Will definately stay here again!", "title": "Great Hotel", "helpfulness": 4, "user": "fansonwhedon", "date": "April 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7394980, "likes": {"liked": "— the staff", "disliked": "— had to walk across parking lot to get to chilli's - no restaurant IN hotel"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "Hampton Inn is a nice new facility, but twice the price of the Best Western, which seems out of line. Should be no more than 10-15% more (the place was empty the weekend I was there). Recreation area has no lockers or shower. Very nice sauna, but when you come out where do you rise off? The only option is in the pool, unfortunately. Very unsanitary!! Also would be nice to change into your swim suit at the rec area, not walk through the hotel in a swim suit/wet swim suit. The bathrooms are not set up for that.", "title": "Nice, but pricey for area and recreation area has problems", "helpfulness": 6, "user": "NEasternUSA", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 7271469, "likes": {"liked": "— New facility.", "disliked": "— High priced for area and recreation layout is poor."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "Understandably you have to use your room key to get into the recreation area. But then once inside you have to use the key every time you want to get in to the exercise area. Quite an overkill and a pain, you need to walk around with your key to go from room to room.", "title": "Best hampton inn hotel", "helpfulness": 8, "user": "skiingx", "date": "March 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6917147}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "One of the best hampton inns we stayed inn! the suite was nice and the bathroom was ncie. The staff was very friendly and helped with any problems we had. We went skiing there.The hotel is about mayb ten minutes away from the skiing area.They had a very good breakfast. The hotel is in a very convenient area, with a supermarket rigth next to the hotel. The hotel recommended hunters restaurant about 3 miles away. It was very good They had steaks and seafood. It is a nice family restaurant. I woud reccomend thus hotel to anyone.", "title": "Good Value Overall", "helpfulness": 2, "user": "ecvrooman", "date": "February 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 6783312, "likes": {"liked": "— value and location", "disliked": "— in room noise"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I stayed at the Hampton Inn in Bennington for the weekend and had a decent stay. We booked our room on the hotel's website which worked smoothly. We were automatically given the AAA room rate as indicated when we made our online reservation. The hotel and our room were clean and comfortable. The front desk and housekeeping staff were helpful and courteous. The only \"problem\" we encountered was that they ran out of copies of directions to a local restaurant that they give out to guests. A minor detail really. Breakfast was complimentary and offered a variety of basic items. The hotel's location was convenient. We drove to the outlets in Manchester and enjoyed a couple of the local Bennington restaurants and attractions as well.", "title": "Best Hampton Inn I've seen", "helpfulness": 1, "user": "mrjanto", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6330544, "likes": {"liked": "— close enough to Manchester without having to pay their rates"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Stayed here for a long summer weekend in the Vermont area and Berkshires. Location was very good to explore the entire area. The hotel itself was nice. The room was comfortable (especially the beds - very comfy). We were disappointed that the pool's heating component wasn't working while we were there. The staff was not unfriendly, but we didn't receive the same level of friendliness I've grown accustom to at Hampton Inns. However, when we asked questions about the immediate area on our first evening, the front desk clerk was very helpful. I wouldn't hesitate to stay here again if I were in the area.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "Travelling_Girl76", "date": "January 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 12211346, "likes": {"liked": "— Location", "disliked": "— Staff could have been friendlier"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "My husband and I went here on a business trip. I must admit, the only thing I thought I would see in Vermont was snow. Well, of course, I did see that, but, there was more to it. This Hampton Inn is located just a few miles from everywhere! There are plenty of restaurants, shoe stores, grocery stores, Home Depot, Walmart, movie theater (1 block away) and bowling, all located just blocks away. There is a grocery store and Chili's Restaurant, located in the same parking lot as the hotel.", "title": "What a great place to stay!", "helpfulness": 1, "user": "Want_my_opinion", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 11529726, "likes": {"liked": "— Breakfast, location, staff", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The staff were very pleasant. We arrived a few hours early and they were able to accomodate us with a smile. The breakfast was Delicious! What a selection. They even had biscuits and gravy! I'm a \"city girl\" and couldn't appriciate it at first, but after tasting it, I'm hooked!!! They have a free business center for internet access that helped us a lot when we needed to print our boarding passes for the return flight.", "title": "A clean chain hotel", "helpfulness": 2, "user": "WakeyEngland", "date": "November 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10800840, "likes": {"liked": "— Good clean accomodation", "disliked": "— The location was just a little too far from nearest town"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Our room was had a king sized bed and a sleeper sofa. The bathroom was gorgeous. Regretably, I didn't get to see the pool and sauna because of my schedule. My husband did and he said it was really nice.", "title": "Sad example of Hilton Hospitality", "helpfulness": 10, "user": "gracioustraveler", "date": "October 23, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 10270351, "likes": {"liked": "— Access to major routes, and central to other venues", "disliked": "— Well, to find a single word: clueless!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I am really looking forward to coming here again for my next trip that I might just turn into a (ski) vacation.", "title": "Nice friendly staff, clean", "helpfulness": 3, "user": "DKH21204", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8217344, "likes": {"liked": "— Clean rooms, friendly staff", "disliked": "— Rates are on the high side"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Found this hotel on a Vermont hotels website. Through them, were able to obtain a fabulous room rate, about half of the walk-up rate. Hotel is luxurious, extremely well appointed and within easy walking distance of a major-chain restaurant. Continental breakfast was very nice, staff at check-in/out were very helpful and friendly.", "title": "Beautiful, Newer Hotel", "helpfulness": 3, "user": "twelveoaks12", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6002409, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Trip Advisor once again proved itself a reliable source. This Bennington, VT Hampton Inn was indeed as great as I had read. It was an attractive, immaculately clean place - we spent 2 nights in early Oct. and had a lovely room with a great, well-designed bathroom. Complimentary breakfast was good. I was able to use the free internet access to print out some directions which was helpful. The staff was nice as can be. As others have noted, the hotel adjoins a little strip mall. Although it does mar the mountain view, we did find it convenient to have a Hanaford supermarket so close by. Just a few minutes drive, and you can see all the are attractions.", "title": "I agree with all the other excellent reviews...", "helpfulness": 1, "user": "Ljustus", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5903604}, {"rating": 5.0, "title": "Friendly staff makes for a nice stay at the Hampton", "text": "We arrived for a Saturday night stay Sept 23rd at the Hampton. We were greeted by a new, but friendly and helpful young lady at the front desk. We are Hilton Gold, we were given a nice upgrade to a suite- it was like a Embassy Suites room foor plan, just a bit smaller. The room was immaculate, located in the front of the hotel. The air conditioner was 'ambitious', we probably should have brought it to the staff's attention, we did not. We asked for a restaurant recomendation- we went to Hunters, we wanted casual with good food, we had seafood and steak, both meals hit the spot. The next morning we asked for a late check out, they were able to accomodate us, also asked for instructions to find a church, in every instance the hotel staff made every effort to help us. Breakfast was above average for a Hampton, plenty to eat. Local calls were free, business center had an available computer, though we did not use it. Location is in the middle of a parking lot surrounded by strip malls, however it is easy to find. The hotel was busy, early foliage crowd. I would return to the Hampton if returning to the Bennington area. The friendly staff- the manager on duty in particular- made for a nice overnight visit.", "user": "NeedSomeSunNow", "date": "September 29, 2006", "id": 5892716}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "the hotel was fine. i think they could use some extra help at breakfast where supplies kept running out, and the trashcan was overflowing. the help was pleasant, the rooms were fine, and the beds very comfortable. we would stay here under the same circumstances, but hope they get some new staff to help out.", "title": "the hampton was fine....", "user": "hisim", "date": "August 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 19579016}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "as i saw mentioned, the elevators are very slow. the view of the roof wasn't so pretty, but the room was clean.", "title": "Great Find in Bennington", "user": "Mukki", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19394170, "likes": {"liked": "— the up to date rooms, the great breakfast, nice public spaces,everything - value for money", "disliked": "— can't think of anything"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "We stayed at the Hampton inn in late June 2008 with my brother and sister in law. We were so pleased with our stay. The rooms were large and the beds very comfortable. The front desk staff were very helpful and the breakfast superb. Check-in and check-out was very easy. We usually stay at The Paradise but I am sorry to say that they have been replaced by the Hampton Inn. Great value for money! I also just found out that a new Hampton Inn recently opened in Lenox, MA so we will be looking into staying there next summer.", "title": "Friendly Staff - Clean Hotel - Good Location", "user": "Drivezone", "date": "August 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19184227, "likes": {"liked": "— The Friendly Staff", "disliked": "— The Breakfast"}}, {"rating": 5.0, "title": "Want to see the covered bridges? - They're just around the corner!", "text": "We stayed at the Hampton Inn Bennington for two nights. The staff was very friendly and helpful. The hotel is very clean, the fitness room and pool are an added convenience.", "user": "FromNorthNorfolkUK", "date": "August 8, 2008", "id": 18737648}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The location is good, and close to local attractions.", "title": "an oasis in the Berkshires", "helpfulness": 1, "user": "mkelch", "date": "May 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15620110, "likes": {"liked": "— clean, modern, convenient location", "disliked": "— rather stiff staff"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 5, "average": 25, "very good": 88, "terrible": 6, "excellent": 137}, "aka": "Hampton Inn Bennington Hotel Bennington", "slim_ranking": 0.1, "description": "The 80 room Hampton Inn in Bennington has a spectacular view of Vermont's mountain landscape. Nestled at the food of the Taconic Mountains, overlooking the Green Mountains, the Hampton Inn has all the amenities you expect. Complimentary \"On The House\" breakfast, indoor pool/whirlpool, sauna, exercise facility, business center, guest laundry, complimentary local calls, meeting facilties, high speed internet, iron/ironing board and coffee makers. Enjoy the museums, covered bridges, and antique shops ennington is known for. While in town you must see the tallest structure in Vermont, The Bennington Battle Monument or take a stroll through historic downtown and visit the shops and eateries."}