{"user_rating": 4.0, "review_count": 661, "name": "Hampton Inn Cocoa Beach/Cape Canaveral", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I recently spent three nights at the Hampton Inn at Cocoa Beach whose accomodations were simpe and basic. From the cookies at the front desk at 17:00 PM ... to the simplicity of the room with a small balcony sufficient for drying beach clothes or looking at nearby thunderstorms ... to the comfortable bedding itis a better value than some of its more expensive neighbors. The basic breakfast with waffles, eggs and yogurt was good ! Access to the beach was easy !", "title": "Simple and basic", "user": "GuidoNM", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114812956}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "If you are used to Hampton Inns , you should be ok with thisproperty. It was exterior door, and had a nice pool area and its very close to the beach. The staff was friendly and the room was clean. I was in town for the \"Power tour 2011\" and then off to NASA with my son the follwing day. Its not far from the Kennedy Space Center so if thats where you might be headed then this is a nice place to stay. The hotel is also located down the street from Ron Jon Surf Shop.", "title": "It was Hampton Inn", "helpfulness": 1, "user": "247HardWorker", "date": "June 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114648864}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "From the moment we had contact with the front desk at check in, to the last moment at check out, we had nothing but good experiences. The staff was very friendly and considerate. The path walkway to the beach was a short walk and very pleasant and well kept, only about a 3min walk across the greenbelt area. We had a oceanview room which was nice but you couldnt see the beach, just the ocean water due to the distance the hotel sits from the beach and the greenbelt area blocks the view. The hot complimentary breakfast in the morning was superb, wonderful variety and very delicious items. This hotel felt like family, it is not a huge spread out resort, it was like home away from home, the rooms were well kept, it looks like the hotel is older, but constantly attended to and maintained. The rooms were not huge, but enough room for 2 persons, and had nice little balconies to sit on and enjoy the oceanview. The pool was very cute, small but very nice, we didnt use it but it looked like a very nice place to relax on a chair and there were nice umbrellas to sit under also. Very nice little well kept secret of a place!!!! Like it!!!!!", "title": "Wonderful spot...we'll be back!", "user": "sandy3817", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114294565}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We went to Cocoa Beach before a cruise to check out Kennedy Space Center. We decided on the Hampton Inn Cocoa Beach because it was convenient to the cruise terminal and Kennedy, and was on the ocean side of A1A.", "title": "Convenient- But Not Luxurious", "helpfulness": 2, "user": "HereHere", "date": "June 17, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 114104387}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The good- When I checked in I asked for an upper floor room with an ocean view, the nice lady gave us a top floor room (all rooms have balconies) overlooking the beach. Very nice view, couldn't have asked for better. The free continental breakfast was good and included \"make you rown\" waffles (which my young daughter really enjoyed), along with muffins, cereal, fruit, eggs, turkey sausage and bacon. How convenient that breakfast was! Not many hotels do that. The hotel lobby and restaurant area looked clean. There was a neat path to the beach you could take from behind the hotel pool area.", "title": "Great Hotel on the Beach", "user": "KG2314", "date": "June 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113386702}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Very clean Hotel, fairly modern and fairly priced. Beach is a very short walk away. Service was excellent and staff was friendly. Not a 5 star nor do they claim to be but hey you are at the beach why are you in your room anyway right?", "title": "Great Value and Clean cut", "user": "Jekell101", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113193507}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We have always had great things to say about Hampton Inns, and this one is no different. The staff are friendly and courteous. The room clean and updated, My wife and I were thoroughly impressed. This hotel is not directly on the beach but the walk is rather short so we didn't mind.", "title": "Great Hotel! We love Hampton Inn's", "user": "Misfit407", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113070758}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The pool was a good size and very clean. Also, as I believe was mentioned in other reviews, you do gain access to the Marriott Courtyard next door and their pool and Tiki Bar as well. We didn't use it but could see this as a very nice bonus.", "title": "Great Pre-Cruise", "helpfulness": 3, "user": "2kytravelers", "date": "June 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 112966678}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The breakfast, as usual, was fantastic and the fruit fresh and plentiful.", "title": "AWESOME HOTEL.", "helpfulness": 2, "user": "klhurd", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110913216}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We asked for a floor on the one the higher floors with an ocean view and an early check in. They were accommodating and took care of all of our needs, we were on the 7th floor, Room 717, with a great view of the ocean and the Intracoastal, as well. Nice bonus.", "title": "Wonderful service/location", "helpfulness": 1, "user": "gottalovevacationz", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110117798}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Excellent room, clean, surprisingly great view of the beach considering it's not oceanfront, nice balcony, great breakfast... nothing at all to complain about!", "title": "A great choice when staying in Cocoa Beach", "user": "ScubaCat3", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115186641}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Except ... do NOT let the person at the front desk refer you to Gregory's steakhouse. That is an atrociously horrible restaurant and I will never get that hundred bucks back as long as I live. Next time I'll go hungry and stay an extra night at this hampton inn!", "title": "We loved it!", "helpfulness": 1, "user": "MomsCJ7", "date": "July 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114965681}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Thanks again to the staff and management for the great experience, and especially the great breakfast!", "title": "Good choice for pre-cruise overnighter", "user": "andyman1970", "date": "July 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114963302}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I was very pleased with our stay! We stayed 5 nights and requested an oceanview room on an upper floor (it's an 8 floor hotel). We were in room 620 (double queen with sofabed) and had a great view of the ocean from our room/balcony. All the rooms are balcony rooms. I loved Cocoa Beach (our first visit) and we WILL be back. The staff was courteous and prompt. In fact, we stopped at the front desk on our way back to our room after a trip to the beach and asked for extra bath towels for our room. By the time we got up the elevator and headed down the hall to our room, there was already a staff member knocking on our door with an armload of towels. Breakfast was good - nice daily variety. I doubt we'll stay anywhere else when we return! Short walk to the beach on a well-lit path. Pool was nice too - but didn't need that with the ocean so near. There is a condo between the hotel and the beach - it is oceanview, not oceanfront. The hotel balcony faces southeast so don't count on seeing the sunrise from the east end of the building. I used that as my excuse to get up early and sit on the beach for sunrise :-)", "title": "Just Perfect", "user": "FastpassReviews74531", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114917407}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stayed here for one night last month - very close to beach and reasonably close to port. Its your typical Hampton Inn, clean, decent pool and good breakfast. Would definitely stay here again.", "title": "Clean comfortable and worth the price", "helpfulness": 2, "user": "misoangry", "date": "June 30, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 114896280}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I booked a last minute room at this hotel to watch the last Space Shuttle launch. Needless to say, I paid a very high rate (close to $300 a night). I have to admit, it's difficult to provide a glowing review for a mid-level type hotel at $300 a night, but I definitely understand that there was a lot of demand in the market. The hotel is nice, but has the doors that open to the open air (like a motel), which I really don't like, and as a single female traveler, make me feel a bit insecure. It's an older building with some upgrades. The room itself was fine, and the bedding/linens were great. The room felt very humid the entire time, but part of that is because we're in Florida, but I feel like part of that is because the doors open to the outside. The cleaning service wasn't that great, and I noticed the same small dead bug in my room during my stay there. The free breakfast was good, and the dining area is open and adequate for crowds, which was great. The service at checkin and checkout was friendly and fast. Parking is free and convenient. The hotel is situated on the beach, but is somewhat blocked and doesn't have immediate walk-out access, at least as far as I could tell. Convenient to local restaurants and activities. I noticed laundry rooms on my floor, which I'm sure is convenient for long stays. Family friendly.", "title": "Decent hotel close to the beach", "helpfulness": 1, "user": "bethrad", "date": "July 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 5.0}, "id": 115858689}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Recently, my wife and I spent another long weekend at the Hampton Inn (Cocoa Beach FL). What a great experience, every time! The staff is outstanding and very professional. The place is kept spotless and after traveling for the Federal Govermnent for 30 years, it is hands- down the finest place I've stayed!!", "title": "EXCELLENT SERVICE", "user": "Hammockfolks", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115841073}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Super location, close to the beach. The room was everything we needed, small frig, balcony with a slight view of the ocean and close to everything that Cocoa offers.", "title": "We will be back.", "user": "TheAvenger53", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115553562}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Paid for a \"beach view\" not worth the extra money. On the local news it stated that the area where we stayed \"The Pier\" had bacteria in the water at the beach. Hotel did not advise us...needless to say we did not visit the beach.", "title": "Ok", "user": "Patti325", "date": "July 11, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 115254640}, {"rating": 5.0, "title": "This will be \"our\" hotel in Cocoa Beach", "text": "We stayed at the Hampton both pre-cruise and post-cruise, along with a number of other people who were convening on our cruise ship for a conference. We were so pleased, there is no question that we'll be bringing an even larger number of people back next year.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 9, 2011", "id": 115189527}], "location": {"country": "United States", "city": "Cocoa Beach"}, "stars": 2.5, "variance": {"poor": 29, "average": 93, "very good": 261, "terrible": 8, "excellent": 270}, "aka": "Hampton Inn Cocoa Beach Hotel Cocoa Beach", "slim_ranking": 0.181818181818, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Hampton Inn Cocoa Beach/Cape Canaveral provides an environment that's both relaxing and peaceful. Most rooms offer breathtaking views from their private balcony and a hot breakfast is on the house every morning!Your room is equipped with a refrigerator and microwave, coffee maker, iron, free high speed internet, and the new 'Hilton Cloud Nine' bed line. Nestled in the heart of Cocoa Beach, Hampton Inn Cocoa Beach/Cape Canaveral is a convenient beachside hotel with easy access to Port Canaveral cruises, local restaurants, shopping, and local attractions such as Ron Jon's Surf Shop, Kennedy Space Center Visitor Complex, and the Brevard Zoo. Hampton Inn is the first in Florida to be Green Lodging Certified."}