{"user_rating": 4.0, "review_count": 669, "name": "Hampton Inn Philadelphia Convention Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Location: Steps from the giant Philadelphia Convention Center. 5-10 minute walk to Reading Terminal Market/downtown and Chinatown. Very walkable from 8th St (which is where Megabus let us off thank goodness, and not 30th St station). There is a Travelodge down the street and THAT place is literally next to the \"help for the homeless\". We went on a weekend and didn't see any sketchy people at all. It also helps that the police precinct is really close as well if sense of security is a concern.", "title": "Nicely done", "user": "EmsyC", "date": "July 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133550845}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Food: The hotel is really close to plenty of food options. The welcome center which has the tea and the coffee only had green tea bags when we checked in =( The free breakfast was awesome! Scrambled eggs, do it yourself waffles, oatmeal cereal, and even fruit!", "title": "Convenient and Comfortable", "user": "bizyguy", "date": "July 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133422552}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Comfort: Had a higher level floor room, far from an elevator. The room was huge! I think it was just our luck though. King size bed and huge bathroom. Neat, clean, and minimalist. Oh and no noise as mentioned in previous reviews - perhaps their renovation was done?", "title": "Very good, only 2 complaints", "user": "veedalia", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133376441}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Amenities: Wifi wasn't as fast as we're accustomed too (hey it's free!), the pool is tiny (we just looked in). Ice machine worked, however, no fridge in the room.", "title": "Great value", "user": "Silver999", "date": "June 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 132931901}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed for three nights at this hotel while attending a conference at the PA Convention Center. I echo the comments made by other reviewers...this is a centrally located hotel, a short walk from Market East station in downtown Philly. The hotel is right next to the Convention Center making it particularly convenient for event participants. The rooms are a notch above what you would get in a typical Hampton Inn, with comfortable beds, big-screen HDTV and free wi-fi. Breakfast choices while not very elaborate were quite adequate. There are several restaurants in the vicinity, so one can always explore.", "title": "great location", "user": "gameshow", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132772277}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We (myself, husband and sister 11yrs old) arrived very early and as expected there were no rooms available yet. We were able to park in the self park lot (basically right across the street and down a few buildings) $25 pays for the full day till 3pm the next day. And the staff even apologized for not having anything available for us (there were still people checking out)! It gave us time to do what we had planned on anyway which was exploring Philly by foot. This was our first time in the city and we found it very convenient! Got lunch at Reading Market (YUM) went shopping and explored some of Chinatown (try bubble tea for something different).", "title": "Great Value, Great Service, Great Room, Great Location", "user": "Katie D", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133953510}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "By the time we circled back to the hotel it was around 330pm. The receptionist recognized me from earlier and welcomed me back! (Her name started with an \"S\" wish I could remember) I had just ask for a room with some view of the city for my sisters first trip because I had heard of people having views of loading docks. Well my sister was jumping for joy when we road the elevator up to the 11th floor. I think that seriously made her trip! She took the bed by the window, watched the sunset and enjoyed the city skyline! So thank you Hampton Inn! You made me look like the best big sister ever!", "title": "Great Hotel! Family Friendly and Clean!", "helpfulness": 1, "user": "rosaprincess23", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133781055}, {"rating": 4.0, "title": "Pleasant downtown hotel experience", "text": "All the hotel amenities were nice very clean and updated. Our room was updated and a good size. We got to enjoy the pool and Jacuzzi. It is on the small side but it does the trick! I did not use the gym but it looked nice, clean and newer equipment.", "helpfulness": 1, "user": "willhh", "date": "July 8, 2012", "id": 133746092}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Breakfast was the best hot breakfast I have had at a hotel this summer (3rd hotels the charm I guess) Lots of choices including healthy ones they had fresh fruit and an oatmeal station (add your own nuts and fruit). As well as the usual hot breakfast items.", "title": "A pleasant surprise, very functional, and reasonably well situated", "user": "Traveltime44", "date": "July 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 133716456}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "I can not say enough good things about our stay. My sister has already begun talking about what we will do on our trip next year! I can't wait!", "title": "Gross pool...", "user": "Kac324", "date": "July 5, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 133556523}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This is an average property at a reasonably good price point. The accomodations are Hampton clean, but my room looked like a motel room. The location is only great if you want to go to the Convention Center. Otherwise, you'll be walking around an area that would - at best - qualify as low class, but a notch above seedy. There is no view to speak of other than dingy alleyways.", "title": "I don't get the rave reviews", "helpfulness": 1, "user": "withliberty", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 134233103}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The swimming pool filtration system did not work properly while we were there (the water circulation system was either turned off or broken), which made it the equivalent of pond water. Although, with no shortage of kids jumping around, the water was at least moving. The guest with the black eye who always seemed to be sitting in the hot tub was kind of creepy.", "title": "Enjoyed our stay.", "user": "Good4Bama", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134183667}, {"rating": 5.0, "title": "Great place.", "text": "On the plus side -- the staff was friendly and helpful, room was clean and I always appreciate the on-site laundry offered by the Hampton around 7 days into a vacation. I'm a Hilton Honors member and usually like Hampton for its simplicity and free Internet, but I can't see why this place consistently scores so high on Trip Advisor.", "user": "Brad R", "date": "July 11, 2012", "id": 134146873}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed for one night on our road trip through the Northeast. It is a nice hotel. Our bed was comfortable. Parking is a pain, but it is everywhere in Philly. The pool looked a bit dirty, but we weren't swimming on this stop. Breakfast was just mediocre. Thank goodness they have fruit and waffles. The hot items, eggs and sausage, were cold and terrible. I enjoyed the hotel, just not the breakfast.", "title": "What more could I ask for?", "user": "PhilY209", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134126346}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Stop 3 of 15 day family vacation. Great front desk, nice super clean room. Would stay there again.", "title": "On a Group business trip", "user": "tgmusicgirl", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 134017188}, {"rating": 4.0, "title": "Perfect Location!", "text": "This hotel provides easy access to City Hall, Convention Center, Reading Terminal Market, etc. And then you are also right in the middle of being a 5-10 minute walk from Independence Hall/Liberty in one direction or the Art museum in the other direction!", "helpfulness": 2, "user": "gapgrl4496", "date": "June 25, 2012", "id": 132723500}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Beds were comfy and rooms were very nice. I would definitely stay here again!", "title": "Convenient and comfortable, very basic breakfast", "helpfulness": 2, "user": "sammy978", "date": "June 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 131245192}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Only two things took away from this hotel getting 5 stars:", "title": "Quick access to downtown, Liberty Bell, Independence Hall & Reading Market", "helpfulness": 3, "user": "TampaTrips", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131185066}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "- Free wifi was extremely slow", "title": "Nice", "helpfulness": 2, "user": "djlenzyd2011", "date": "June 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131172452}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "- I called 4 different times to get a clear understanding of the parking policy (ie: hours) and was not able to get a straight answer once! So for those interested, it's $25/night as long as you are out by 3:00pm the following day. The hotel employees should know this.", "title": "Great location for the Philadelphia Convention Center", "helpfulness": 1, "user": "jmkoboop", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130583514}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 3, "variance": {"poor": 33, "average": 92, "very good": 278, "terrible": 16, "excellent": 250}, "aka": "Hampton Inn Philadelphia Hotel Philadelphia", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "The Hampton Inn Philadelphia Center City-Convention Center is ideally located in downtown Philadelphia across the street from the Pennsylvania Convention Center and only blocks from many major companies. Philadelphia International Airport is only 30 minutes away. Our hotel is within walking distance to historic sites such as Independence Hall, the Liberty Bell, the Betsy Ross House, and Penn’s Landing, and only 15 minutes from the Wells Fargo Center, Lincoln Financial Field, and Citizens Bank Park."}