{"user_rating": 4.0, "review_count": 78, "name": "Hampton Inn Minneapolis NW Maple Grove", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My wife and I spent two nights here and everything was excellent. Our room with a king-size bed was a moderate size, with a sitting area and work desk, and was very nicely decorated and furnished. Our bed had the latest style Hampton plush mattress and bedding, including both soft and firm pillows, and was extremely comfortable. Our room also had a microwave and refrigerator.", "title": "Excellent hotel. Wonderful stay", "helpfulness": 2, "user": "like2travel1", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7854257, "likes": {"liked": "— High quality room. Excellent bed. Great location.", "disliked": "— Everything was fine."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Our bathroom had plenty of room with a large countertop and lots of very good quality towels. Everything was very clean.", "title": "Wonderful Experience!", "helpfulness": 2, "user": "notetoself", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 7189972, "likes": {"liked": "— Wonderfully comfy beds!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Very impressed. We stayed three nights at this hotel. Very clean and pleasant staff and hotel. Walking distance to many different restaurants and stores.", "title": "Nice hotel, convenient location, great stay!", "helpfulness": 1, "user": "WinnipegIrish", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67701192}, {"rating": 5.0, "stay_parameters": "Stayed January 2010", "text": "Rooms: Microwave and fridge in the room. Complimentary wired and wireless internet and lots of amenities. A little narrow but managable. Beds were good with big pillows.", "title": "Love this hotel", "helpfulness": 1, "user": "hockeymom26", "date": "March 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57435399}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Great workout room WITH water cooler and air conditioning. Nice clean pool area and shower.", "title": "Everyone was impressed with the great value of this hotel.", "user": "FiftiesMapleGrove_MN", "date": "June 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32871850}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The complimentary hot breakfast was great! Waffles, eggs, sausages toast, muffins, fresh fruit... Changes every day! When travelling with kids it's nice to to have to hit a restaurant first thing in the morning!", "title": "Nice Hampton Inn", "user": "maninmirror", "date": "March 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 27086870}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Well done Hampton Inns! Definitely be back!", "title": "Not-so-good experience", "user": "qh4dotcom", "date": "September 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 19960003, "likes": {"liked": "— Breakfast, clean room", "disliked": "— Cigarette smoke smell and slow internet access"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I stayed here 5 nights in June. The room was perfect no complaints what so ever, the location was also very good. But we were annoyed by the kids running up and down the halls at all hours, wet foot prints in the elevator, wet towels thrown in the hallways. The desk manager (David I believe) when we checked out seemed to have an attitude, we had to leave at 3:30 am, it took a few loud \"excuse me\"'s to get his attention, when I told him we're checking out he said he was doing an audit and couldn't get in the system to give me an invoice, I said \"could you at least tell me the total?\", he replied in a louder tone \"I'm up s**t creek without a paddle\" \"Get my drift?\", I very calmly said \"yes\". He never said thank you or have a nice day, not even you're welcome after I said thank you. He needs a course in customer care.", "title": "Fun for Kids, not so much for Adults", "helpfulness": 1, "user": "shawana80", "date": "June 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132587383}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "What a nice surprise in Maple Grove. The hotel was lovely and clean. The bed was perfect. The breakfast was a nice spread (though a little heavy on the carbs). Free wifi, which was an unexpected pleasure after having to pay for it in hotels across the country. Matches up well with dozens of business trips. I would highly recommend.", "title": "Nice Surprise", "helpfulness": 1, "user": "moving8", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127028812}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We have used our Hilton Honor Points to stay here twice this winter.Most recent stay was March 10, 2012. Rooms are always pretty clean and comfortable beds. Each room has a good sized fridge. When we checked in our room, we found someone's luggage and food already neatly packed and waiting by the door. We called the front desk to let them know that there was a lot of personal things left by someone - and they immediately gave us another room while they tried to figure out what had happened! When checking in, I overheard another couple arguing that they had reservations - but no name on the list. The front desk was kind and even though it was discovered that they had made reservations for a wrong location of the Hampton Inn, they accomodated them somehow. I thought the front desk gal was so personable and hard-working. She kept stacks of fresh towels in the crowded pool area - very nice - and coffee hot and fresh. Anything we needed, she was able to find.", "title": "Nice little spot in the middle of a lot of shopping/restaurants", "helpfulness": 1, "user": "squirt5", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125989673}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The pool is small - and if there is any sport event in town, look out for way too many adolescent boys taking over the pool with balls. Many people with small children could not enjoy the pool at all and had to just get out of the way. I thought it would be simple to just blow a whistle and ask a few to step out - or perhaps confine their game to one end of the pool so small children and families could at least have a spot without roughhousing and intense splashing! In fairness, no one owns the pool and the parent chaperones should have had a clue.", "title": "Rare find for 15K HHonors points", "helpfulness": 1, "user": "subbu4", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122624092}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Breakfast is really good considering the variety and cleanliness of the area. Staff keeps everything full and while they're probably not thinking about cleaning off tables on a busy morning, they do their best.", "title": "Great Hotel!", "helpfulness": 1, "user": "LisamarieF22", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121174443}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "We stayed there for our anniversary and the staff was very nice and helpful. The food for breakfast was good. We will be back!", "title": "A nice place to stay", "user": "Todd H", "date": "November 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120601870}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I have spent more time in this hotel over the past year and half than I have in my own home in Texas. The staff are always pleasant, and Ed will talk the local sports scene with you to your hearts content. As the hotel really caters to business travelers the breakfast area is usually open and ready to go far earlier than many other Hampton Inns I have stayed at, this is a nice thing on early mornings. Also I have never found the coffee pots downstairs by the desk empty, a great thing for some one how drinks coffee all day. The pool area and whirlpool are nice and typically not very busy so a relaxing soak can be had fairly often. All in all this is one of the most consistent Hampton Inns I have stayed at across the country, they do a very good job of meeting the \"Hampton Guarantee\"", "title": "Always a good stay", "helpfulness": 2, "user": "Wesley S", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118789426}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I needed an overnight, and this was great. Nicely appointed room, good bed, breakfast with lots of options, very clean except for the scum in the in-room coffee maker. Could hear people in the room above me walking barefoot (!), so not so quiet. The radio would only stay on for 2 hours, and didn't look like it had any volume control. Wireless internet often too busy. But worth the money, would stay there again.", "title": "Great for the money", "user": "lbsch2", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118108254}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Three rooms for family members attending a wedding reception in Maple Grove. We had a great time. This hotel is clean and well managed. The breakfast buffet was well stocked and yummy, the parking was convenient and the ground floor common areas were great for our group to sit and visit. The beds were very comfortable and the rooms had new HD TVs and WiFi. Can't think of anything they could do better. Highly recommended.", "title": "Relative Rendezvous", "user": "HPH360", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114686628}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "The hotel was great. Clean, good price and in a great location", "title": "Had a great stay..very convenient location", "user": "mcarole411", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77597982}], "location": {"country": "United States", "city": "Maple Grove"}, "stars": 2.5, "variance": {"poor": 4, "average": 9, "very good": 20, "terrible": 2, "excellent": 43}, "aka": "Hampton Inn Maple Grove Hotel Maple Grove", "slim_ranking": 0.625, "description": "From incredible shopping to gorgeous outdoor fun, our Hampton Inn® hotel in Minneapolis-Northwest/Maple Grove is surrounded with fantastic activities to entertain any guest. Want to do a little shopping? Our hotel is located in the heart of Arbor Lakes retail and entertainment district. Play a round on a championship golf course. It's all here, within minutes of the Hampton Inn hotel in Maple Grove. So come explore all Minneapolis has to offer. The Hampton Inn hotel in Minneapolis-Northwest/Maple Grove will put you in a delightful location for shopping and outdoor adventure."}