{"user_rating": 4.5, "review_count": 107, "name": "Hampton Inn - Warner Robins", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Hotel staff were very friendly and accommodating. Clean hotel. Great location...convenient to almost any store you can think of. The beds were very comfortable. I will definitely recommend this hotel to family & friends.", "title": "Excellent temporary home.", "user": "kbmama", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65431093}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "When my family and I went to Warner Robins Georgia to visit family, we had the most pleasant stay at this hotel. There were so many smiling faces awaiting to help us whenever we needed. We were traveling with small children and had difficulty getting them from point A to point B but the staff was patient,helpful and courteous. Thanks Hampton Inn.", "title": "Great Service", "user": "christopherperez18", "date": "May 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63360193}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Pleasant staff, knowledgeable and informative at check in. The hotel is very comfortable from the breakfast area to the guest rooms. I always enjoy my stay at the Hampton Inn when I am in Warner Robins. It is in a great location and close to everything I need. I always feel at home when I am here. I have nothing bad to say and encourage others to give them a try--I am sure you will become a return guest after the first stay!", "title": "Loyal Hilton Member-Thumbs Up to This Hotel", "user": "Contractor75", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63257253}, {"rating": 3.0, "title": "smoking rooms stink", "text": "I'm a non-smoker and hate getting stuck in a smoking room. Has happened to me once at this hotel. Has also happened to a colleague of mine at this hotel on another occasion. Both of us specfically reserved a non-smoking room. When I arrived my only choices were to take the smoking room or start a late night search for a non-smoking room at another area hotel. Had no reasonable choice but to spend the night breathing the stale cigarette odors and picking up the same smells on all my freshly laundered clothes.", "user": "blueigloo", "date": "April 24, 2009", "id": 28706168}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "Other than this major anoyance, it is as good as any other Hampton I've stayed at. I'll probably look for another hotel next time. If I have stay there again I'll be sure to call the hotel first and get the manager to promise me (preferably in writing) that my reservation ensures I WILL get a non-smoking room.", "title": "Desk clerk went above and beyond.", "user": "hannah_on_business", "date": "August 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 18964673, "likes": {"liked": "— The front desk clerk."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "This hotel looked very nice and upscale from the outside as well as once you entered the lobby. Once I was at the desk waiting to check in the young man was on the phone and I over heard him bad mouthing what seemed to be another hotel in the area. Very tacky, especially considering the source, I mean his hotel really had no room to talk about any other hotel. So once I was checked in and went up to my room, first I would like to say WOW!!! and not in a good way. The carpet was very old and outdated it had spots and stains, the tv was old, the beds were so uncomfortable. It was not at all what I was expecting. I have stayed at the Wingate in warner robins and it was very nice, I have stayed at the Fairfield Inn and it was great, I also stayed at the Candlewood on my last visit (BRAND NEW) that hotel was really nice. They were sold out on my most recent trip which is why I was stuck at the Hampton. I usually am a hilton loyal vip diamond member but when you are in warner robins there are just so many new hotel that you have to try them all out. So in short I will never stay at the Hampton Inn in Warner Robins!!! How do you charge $115. per night for those rooms?", "title": "The Hotel That Couldn't", "user": "vhue104", "date": "April 30, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 15505462}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "As one in wheelchair & who brought bedbugs home from a Hotel in CA, I take hotel stays seriously guys. I see things from 'waist level\" I also frequent Hilton hotels. Needed quick overnight stay while traveling up Hwy 75 from FL to GA . With bad reviews on hotels in Valdosta, Perry, etc. booked here on reviews for way up & back. Hotel off road 4 miles, small military town with loads of chain restaurants and small mall. They are building new Hilton Garden Inn behind this Hampton.. maybe that accounts for the shabiness but they still took my $$.", "title": "Ready to be torn down?", "user": "ez4me", "date": "November 26, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 11071402, "likes": {"liked": "— The location & amenities off Hwy 75", "disliked": "— Cleanliness, food, noise, handicap access"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "Scoop: 1) Hotel staff nice but clueless. When I asked clerk for dinner recommendation, she said she didn't eat in town but drove to Macon. Yikes! 2) Rooms fairly clean but old carpet, told TV's missing tiles from bathtub, rough towels. 3)No WOW on \"comfort bed\" either, just serta w/ thin mattress pad and worn sheets. I took bed apart to be sure. 4) Pool over-clorinated so didn't use but hubby did use the 3 poor machines in the \"gym\". 5) THIS Hampton breakfast was terrible, bad coffee and not too appetizing pasteries. There's a Starbucks, Dunkin Donuts & IHOP..go there. 6) NOISE.. OMG.. the walls are paper thin and we heard babies crying and doors slamming hard throughout the night. Called staff but they did nothing. 7) Handicap access terrible. couldn't give me handicap room (was it b/c I was using my Hilton Honors points?) even though there are 6 of them, I obviously need one & I booked weeks in advance. First stay brought a plastic stepladder to accomodate getting into tub. Trip back again no handicap room but did have a new tub seat stool which I brought up to the room myself! Didn't take pics but take my word for it.. one of the worst Hamptons I've ever stayed in.. and I've booked a block of rooms at a Hampton for my daughters wedding in March!", "title": "GREAT stay!", "user": "vnanthony", "date": "July 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8127691, "likes": {"liked": "— Bed", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Me and my family stayed at this hotel because we didn't have electricity when a tornado hit our town. The staff was very friendly. We were allowed unlimited access to their business office. The room was wonderful. Very clean. The bed was very comfortable. Usually when I stay at a hotel, I have to take the comforter off. Not at this one. The bathroom was very clean. The price is kind of high. About $100-$110 but well worth it. I would recommend this hotel to anyone. Can't wait to go back.", "title": "Great hotel", "helpfulness": 1, "user": "pickytraveler40", "date": "July 21, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 5493024, "likes": {"liked": "— Cleanliness", "disliked": "— Location of room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "I was thoroughly impressed with this hotel. I wasn't expecting much, after having stayed in other Warner Robins hotels (many years ago) so was pleasantly surprised. The hotel and room were clean, the staff was very professional and helpful. The bed was extremely comfortable. The hotel is relatively new with updated interior. There's a very small pool with a hot tub and sauna. The breakfast is nice and includes hot food. My only complaint is that my room was right next to the exterior door, so I heard people coming and going, but it didn't keep me up.", "title": "Clean Comfortable New and Great Service", "helpfulness": 2, "user": "Stompper", "date": "March 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4727565}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "My wife and I stayed here for an event in town. When we arrived the staff was friendly and helpful. The rooms are very nice and comfy and the hotel is in a prime location right on the main drag.", "title": "Great hotel and great location", "helpfulness": 1, "user": "allaroundtheworld874", "date": "October 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119068388}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Overall a good value and convenient location. The only draw back that will prevent me from staying at this hotel is the excercise room. The room is small, with very few pieces of equipment. The equipment that is there is not well manitained, there were no wipes for the equipment and no towels. As a business traveler, it is difficult to eat right and stay in shape. A well equiped exercise room is essential.", "title": "comfortable and friendly", "helpfulness": 1, "user": "Alps110", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118528361}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We were driving home from Detroit Michigan to Floorida on Memorial day. This hotel is not right nect to the interstate and that was nice. We always like to stay at Hampton Inns because of the cleanliness and comfort. We weren't disappointed. We arrived after midnight and left about 7:30 am. Nice continental breakfast . Staff very friendly. Very easy check in and check out. I woulld definitely recomment this hotel.", "title": "Clean and Comfortable room for the night, a bit pricey though for a few hours", "user": "chippy12", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 118045721}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I am a Diamond HH member who spends a lot of time in Hilton properties. Lately a lot of Hampton Inns. I have seen the good and the bad. This one is the really GOOD! Excellent check in. The rooms were well decorated and CLEAN, CLEAN, CLEAN. The bathroom were better than most.", "title": "This is a wonderful Hampton Inn.", "helpfulness": 1, "user": "JMA814", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117153812}, {"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "The front desk gave me a LONG list of local restaurants. And there was an \"*\" next to the ones which deliver. The front desk suggested Meldino's Pizza and they were right on.", "title": "All around good stay.", "helpfulness": 1, "user": "fl_vtxfreak", "date": "November 24, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 88143484}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My family and I like to stay at this Hampton Inn when we are traveling up/down I-75 through Georgia. It is convenient to I-75 but not right off the interstate so you can actually feel like you are away from the road for a couple of hours. It is right next to a Kroger shopping mall and a bunch of places to eat and shop. One thing I like about this Hampton was the reservation system allowed you to choose different room sizes. They have some 2 queen bed rooms with pullout couch that are actually larger than the normal rooms, especially nice if you have a large family and hate stepping over each other all the time. The breakfast was standard Hampton fare and the staff was nice and cordial.", "title": "Good Hampton Inn", "helpfulness": 1, "user": "tpitboy", "date": "December 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121554839}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The only negative I have to say about this Hampton is that even though they have an indoor pool the water was freezing and my kids would not get in. The spa which would have helped was broken while we were there. If you're thinking about staying at the La Quinta across the street - don't - it burned down while we were there.", "title": "Great Stay", "helpfulness": 2, "user": "Runnwlf", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119461773}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The best Hampton Inn I have stayed in. The breakfast staff is friendly and great. It's almost like eating at a diner, great service and great value.", "title": "Best hotel I've found in area", "helpfulness": 1, "user": "Micah214", "date": "October 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119266942}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The rooms were clean and the service was great. By far the best Hampton Inn I have stayed in.", "title": "Great Hotel & Great Staff", "helpfulness": 2, "user": "chl0020", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119205908}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I travel frequently and this is one of the cleanest hotels I have found yet. The staff was very friendly and rooms were well appointed. The breakfast area is large and clean. Tons of pillows on the bed. Free wifi! Can't beat this place.", "title": "Above and Beyond, One of the Best!", "helpfulness": 2, "user": "Nicodemus722", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119086905}], "location": {"country": "United States", "city": "Warner Robins"}, "stars": 2.5, "variance": {"poor": 2, "average": 10, "very good": 23, "terrible": 2, "excellent": 70}, "aka": "Hampton Inn - Warner Robbins Hotel Warner Robins", "slim_ranking": 0.136363636364}