{"user_rating": 4.5, "review_count": 227, "name": "Hampton Inn & Suites Los Angeles/ Burbank Airport", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The \"inn\" indeed smells brand new. And the newness of it is about the only reason I would suggest someone stay there. The relatively cheap fixtures -- the plastic bathtub and moulding, the shower head, the microwaves and fridges, the paint -- haven't fallen apart yet. But they will because they're so cheap.", "title": "If you're going to stay there, do so soon!", "user": "audreyc", "date": "July 28, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 4.0, "location": 3.0, "value": 3.0, "rooms": 3.0}, "id": 18360320, "likes": {"liked": "— its new and untrampled ... so far", "disliked": "— cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "I saw two bugs while I was there (a silverfish in the bathroom and a white, tiny grasshoper-like critter in the hallway). But the staff was relatively nice. I also found two short hairs in the bathroom when we moved in, which grossed me out.", "title": "Eight night stay was almost perfect", "helpfulness": 1, "user": "sheimbecher", "date": "July 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 18030873, "likes": {"liked": "— Brandnew hotel, nice and large room, friendly staff", "disliked": "— Noisy (close to freeway), parking a bit challenging"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "But I have high standards for hotels. The only reason we were there is that the place we booked oversold the rooms and left us in the cold.", "title": "Served Well for a Last Minute Booking", "helpfulness": 1, "user": "VincentPrice", "date": "July 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 17788129, "likes": {"liked": "— Parking"}}, {"rating": 1.0, "title": "The Stay That Never Was Allowed To Happen", "text": "There' s no way I would pay $150 for this place, no matter how new it is.", "helpfulness": 2, "user": "Valleysunner", "date": "June 12, 2008", "id": 16888406}], "location": {"country": "United States", "city": "Burbank"}, "stars": 2.5, "variance": {"poor": 7, "average": 19, "very good": 65, "terrible": 10, "excellent": 126}, "aka": "Hampton Inn And Suites Los Angeles Burbank Airport", "slim_ranking": 0.111111111111, "description": "For a comfortable stay and great value in a convenient location, check-in to the Hampton Inn & Suites Los Angeles Burbank Airport hotel, we would love to have you here. Get settled in a comfy guest room, catch a movie on one of our 37-inch or 42 inch flat screen HDTVs or surf the web using the free HIGH SPEED Wi-Fi access. Set-up your laptop on the handy lap desk and you can even work while you kick back on the clean and fresh Hampton bed ®. Upgrade to a suite and you can enjoy extra space and even your own private whirlpool to soak in.Unwind at the end of a busy day when you head to the fitness center for a stress-busting work-out. Swim some laps in the pool or relax in the spa or on a sun lounger and take it easy under the blue SoCal skies. Breakfast is on us at this Burbank hotel. If you’ve got an early start and no time to sit down to Hampton’s free hot breakfast then just pick-up one of our free Hampton On the Run® Breakfast Bags, available Monday to Friday, for a quick, healthy meal to go. A complimentary business center, a range of flexible function spaces for up to 60 people and our friendly, professional team members help make this hotel the perfect venue for your next Burbank meeting."}