{"user_rating": 4.0, "review_count": 159, "name": "Hampton Inn Clinton", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We've been staying here for years - on holidays, when travelling to Philly, etc. I am sorry to say that while the housekeeping remains above average, the inexperienced Front Desk staff can make checking in a bit of a chore. The outside upkeep seems to be suffering a bit as we saw abandoned shopping carts in the parking lot and a mound of dead bugs near the side door which had not been removed. All in all, still a nice place to stay but we sensed things were changing and not for the better....Time, as always, will tell.....", "title": "Alas! Nothing Stays the Same!", "helpfulness": 1, "user": "Criticaltraveller", "date": "August 25, 2006", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5709258, "likes": {"liked": "— Clean rooms and friendly staff", "disliked": "— Inexperienced Front Desk staff"}}, {"rating": 4.0, "title": "Can't Wait To Stay Here Again!", "text": "I spend many nights in hotels, typically Hilton-brand, for business travel and I enjoyed this Hampton Inn.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 28, 2005", "id": 4148192}, {"rating": 2.0, "title": "A Shady Experience....", "text": "Room:", "helpfulness": 6, "user": "Menri11433", "date": "February 28, 2005", "id": 3237121}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "I stayed in the King Deluxe Suite (I don't recall what I paid, but I believe it was about $135). The room was the largest hotel room I've seen, about the size of 3 rooms, no exaggeration. I found it strange, however, that with all that space they didn't install a kitchenette, so it was still a standard room. Large, but standard.", "title": "A welcoming refuge", "helpfulness": 1, "user": "hailahh", "date": "September 1, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 2507585}, {"rating": 4.0, "title": "A friendly welcome, a good night's sleep and a great breakfast", "text": "Food:", "user": "A TripAdvisor user", "date": "April 9, 2003", "id": 932017}], "location": {"country": "United States", "city": "Clinton"}, "stars": 2.5, "variance": {"poor": 18, "average": 21, "very good": 48, "terrible": 11, "excellent": 61}, "aka": "Hampton Inn Clinton Hotel", "slim_ranking": 0.5, "description": "The Hampton Inn Clinton welcomes guests with warm-from-the-oven cookies, lemonade, and comfortable overstuffed chairs to enjoy them in while resting in front of the crackling fire. Like the charming, Victorian town of Clinton, the hotel is full of hometown friendly hospitality. Lining the nearby historic streets are wonderfully eclectic boutique shops and designer stores. The Red Mill and Raritan river create a picturesque landscape that has insipid artists for over a century. The backdrop is sure to inspire a picture taker or two. The Hampton Inn provides business and leisure travelers alike with the opportunity to escape the hectic pace of large cities and spend some time relaxing in the perfect American hometown."}