{"user_rating": 4.0, "review_count": 125, "name": "Hampton Inn Washington I-95 / Largo", "reviews": [{"rating": 4.0, "title": "Nice Hotel with good location", "text": "This is a very nice hotel with a reasonable rate for the DC area. The metro is less than a mile, within walking or they have a convenient shuttle to take you to the metro station and will pick you up. Nice pool and breakfast area. The surrounding community is mostly middle-class African American and very suburbian with a nice mall and restaurants. I think next time my family goes, we will try to stay on the north or west side, more convenient to the airport.", "helpfulness": 4, "user": "tpitboy", "date": "August 1, 2006", "id": 5535531}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We chose this hotel because the rate was reasonable and the location, near the DC metro, was convenient. We were not disappointed. While it's not the nicest Hampton Inn location we've visited, the room and the common areas of the building are fine. The breakfast bar is convenient and offers enough variety for everyone to find something they like. The staff was friendly and helpful, and the shuttle service (with one exception) was quick and efficient.", "title": "Pleasant hotel, convenient location", "helpfulness": 8, "user": "NJSam", "date": "May 1, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5023039}, {"rating": 5.0, "title": "Great hotel", "text": "We'd choose this hotel again if the price remains reasonable.", "helpfulness": 7, "user": "waterlgged", "date": "February 24, 2006", "id": 4514346}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "Stayed at this hotel a couple of times for one night each. Rooms are large and comfortable with great beds. End of the hallway rooms are larger and include fridge/microwave and a small balcony.", "title": "Wonderful Hotel", "helpfulness": 24, "user": "cec57", "date": "March 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3287102}, {"rating": 4.0, "title": "I had a pleasant stay here.", "text": "My wife and I stayed here for three nights, March 13-16/04 while on a site seeing holiday in Washington, DC. We were unable to find any accomodations at any prices in downtown DC during the week so looked at properties around the Beltline. This hotel came up as the best reviewed to either the east or northeast of the Beltline (albiet only one review) on this website. The hotel is located near Largo, MD, very close to Fedex Field, 3 shopping malls, numerous restaurants and of most importance to us the Washington, DC Metro (rapid rail transit) Blue line transit terminal. This terminal is only a couple minutes away by hotel shuttle. The shuttle will drop you off or pick you up at any time during the day or evening. Make sure you pick up a hotel business card so that you have the phone number of the hotel when you return to the Metro station to call for your ride back. If this holiday is for pleasure, make sure you board Metro after 9:30 AM and don't try taking it back between 4:00-6:30 PM as it is very busy. You can buy a single day unlimited ticket on the Metro for $6.50 from the vending machines in the station-a real bargin! The train trip to downtown (we suggest departing at the Smithonian stop) is about 25 minutes.", "helpfulness": 20, "user": "ChinaShrek", "date": "February 25, 2005", "id": 3229903}], "location": {"country": "United States", "city": "Largo"}, "stars": 2.5, "variance": {"poor": 7, "average": 18, "very good": 45, "terrible": 10, "excellent": 45}, "aka": "Hampton Inn Washington i-95 / Largo Hotel Landover", "slim_ranking": 0.4}