{"user_rating": 4.5, "review_count": 161, "name": "Hampton Inn Marlborough", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stopped here as a halfway point on our way to Maine, and had a great experience. Rooms were nicely renovated and comfy, beds were heavenly, and we got a good rate. Liked the included wifi and breakfast buffet, which had a nice variety of choices. Very convenient to 495. All of our interactions with staff were pleasant. As someone else said the walls are a little thin, but earplugs were provided-we did use them.", "title": "Great rate, nice staff, convenient", "user": "StJohnFan", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118263271}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Clean, nice hotel with good service (not that friendly but not rude either). Breakfast is decent - pretty good variety for a free breakfast (cereals, bread, bagels, fruit, yogurt, omelet, sausage, etc.) Rooms have small closets (I've seen these types of closets in several Hampton Inns - I don't like them, you hang your clothes up from front to back in a small closet next to a small desk. The iron is hanging in the back so everything is just squished in there). Only major complaint is how thin the walls are - I could hear everything in the next room and the person wasn't being loud. Bring earplugs if you're a light sleeper.", "title": "Decent hotel but thin walls", "user": "jolena28", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 118156324}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Clean, well kept. Easy to get too off of 495. Hampton Inn never lets me down, but there is not a lot to do around the area. Seems like a business area, we stayed here on the way from the Cape and to escape Hurricane Irene. I would stay here again.", "title": "Hampton Inn always wonderful. This one even nicer !", "user": "MikeR2011", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117296233}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here one night and my impression was positive. It was clean and well-maintained. The colors were restful and warm; the room and bed were comfortable--upholstered chair with ottoman, flat-screen TV, pillows, good lighting to read. And the bathroom was well designed and made sense--plenty of hooks to hang things, counter space, extra towels, massaging showerhead, etc. A well-managed Hampton Inn in a quiet location, though also conveniently located on a main street and near the interstate. We were also grateful no pets are allowed, as we have allergies. We'd stay there again.", "title": "Very comfortable, well maintained, clean", "user": "Alexandra50", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117254219}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "The room was super clean. The hotel in general was spotless. The room was well designed and laid out. The bed was very comfortable. The breakfast options were varied with cereal, an egg dish and waffles along with bread and pastries. It was convenient for my business trip. So I would say for business travelers it's a great choice. If I were trying to fit a family of 4 in there I think it would be a little tight but that is about the only negative thing I can say.", "title": "Always a good bet! This location doesn't dissappoint.", "user": "Mrs_Mazk", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 116958570}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I selected this hotel since I had such a wonderful experience with the Hampton Inn in Ellsworth ME. Web stayed at this hotel in July 2011, right after our stay at the Hampton Inn in Ellsworth for our vacation.", "title": "OK hotel but you feel unwelcomed! Will not stay at this hotel again!", "user": "EasyLeben", "date": "August 4, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 116285847}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "The POSITIVES - The Hampton Inn in Marlborough MA is small and old, but nice, clean, and easy accesible from I90, I495. The room is rather small but the beds, bathroom .. are good. The beds themselves seem to be small - definitely not quuen size. You get complementary, standard but acceptable breakfast. The rate -at least the AAA rate I got- was not that bad. The hotel has enough parking spaces. The location is good if you are here for business. It is located in an office park. You must drive to a nearby sripmall for restaurants, grocery .. For family vacation, the location is not convenient enough.", "title": "Extremely comfortable bed", "user": "paulahall", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115586170}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The NEGATIVES - 2things that make me avoid this hotel in the future. First, one member of the front desk staff was really unfriendly. The other members seem to be friendly enough. Maybe it is unfair to avoid staying at a hotel because the unfriendly attitude of one staff member, but I would not take the chance. Second, and this is THE REASON tHat I will not select this hotel again: they put a hold of about 60USD on your CREDIT card WITHOUT EVER informing you of that !!! I only found only when I got home, and reviewing my credit card entries online. To all fairness, the paper receipt they put under your door on your departure date lists the correct amount, and when being asked about the discrepancy, they said they only \" hold\" but will never charge the amount. BUT to me, this is a question of principle. I feel cheated because the hotel did something WITHOUT informing their customer. It could be Acceptable (?) if they told me on checking in, even though it will still", "title": "Good Business Travel Digs", "user": "originalXfactor", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 4.0}, "id": 113275452}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "be very upsetting to me. I have never experienced this for using a credit card. And", "title": "Comfortable and Clean", "user": "joyb031", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 113152156}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "for this reason, I am not recommending this hotel to anyone!", "title": "Enjoyed our stay", "user": "mrsnicholas413", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 110830188}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Hotel is nice. Rooms are clean and well setup. The included breakfast and wifi are great.", "title": "Mixed Opinion", "helpfulness": 1, "user": "Liiizard", "date": "August 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 74938132}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "A sort of long story follows - I feel the amount of information is important in order for me to quantify my overall low rating of this motel.", "title": "Good evening front desk service, nice rooms, and great pool", "user": "TheOneWhoLovesTravel", "date": "August 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74765645}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I made my reservations months prior to my visit. On arrival, there is a sign stating they will be testing the fire alarms for several hours the next day. New info to me. The next day, the fire alarms are tested every minute or two from around 9am till around 2:30pm. They are extremely loud in the room and common areas. I'm unable to answer my business phone calls and going somewhere else for the day is not practical without a car. If I were alerted to this prior to arrival, I could have planned accordingly, but I was not. (They have my contact info).", "title": "Far less than you'd expect for the money", "user": "50sTrekker", "date": "June 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 68452858}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "A fairly thorough complaint about my loss of business at the front desk rewarded me with an \"we're sorry\". Pretty insufficient and unsatisfying. A few minutes later I cornered the maintenance manager with a verbal tirade. Less than 15 minutes later an assistant manager came to find me in the exercise room and offer to compensate me for the cost of one night of my five night stay. This is more than sufficient and satisfies me.", "title": "Very Good Hampton Inn", "user": "Triplewin", "date": "November 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 48281754}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "My reduced rating is because the front desk did nothing. Did not even offer to get a manager. Only after the maintenance manager listened to my out-of-character, juvenile cussing tirade and relayed my concerns to the assistant manager did I feel \"heard\" and valued as a customer.", "title": "Convenient location, decor a bit dated, but excellent otherwise", "user": "KennethTan", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47816971}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "We stayed at the Hampton Inn one night to get out of our house with the kids. They have the best pool with great hours for the marlborough area. We had chinese food delivered from the Panda house and enjoyed a delightful evening. The kids spent most of the time swimming. We enjoyed the whirlpool. The front desk was very helpful. It seems to be a place people stay that are going to the DCU center so you should ask if there are any teams staying there over the weekend if you are looking for quiet. It was quiet when we were there but it was a weeknight. Breakfast staff was nice.", "title": "Great Pool and staff", "user": "qualtyk9", "date": "May 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 109773545}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "First let me start off saying the hotel was beautiful, clean, and comfortable. Perfect location for where I needed to be during my stay, plenty of restaurants close by, right near the highway. The man who checked me in was extremely polite and efficient, and the room was perfect. I was in town for a job interview, and was looking forward to the quiet the hotel had to offer. Unfortunately, that quietness was shattered my last two nights I was there. A girls school age soccer team was taking up our whole floor (no fault of the hotel). At breakfast there were so many of them you could not get near the food (again, no fault of the hotel), but there was a security guard standing by the food so you could not leave the dining area with it. I was extremely annoyed that because it was so crowded and you could not take food with you, I had no breakfast every morning. I was also kept up half of the night listening to screaming teenage girls running up and down the hallway (...where was that security guard then??). The last morning of my stay I was woken up at the crack of down by the housekeeps YELLING at the top of their lungs to eachother carrying out full on conversations and SLAMMING doors for hours. I spoke to the woman at the desk who seemed completely aware that their ridiculously loud housekeepers seem to be a pretty consistant problem. She brushed me off and told me to have a nice day. So much for the \"If you're not satisfied with your stay, you won't pay for the night\"... I was not looking for a free vacation, just treated a little better when saying I was not too pleased with members of THEIR OWN staff. I will be returning to the area to house hunt, and as much as I liked the cleanliness and look of the hotel, I think I will want to find somewhere I can get more than a few hours of sleep a night.", "title": "Nice Hotel, Not Much Sleep...", "user": "clsummergirl", "date": "March 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 101166331}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Good, predictable hotel with good facilities. Freebies included free in room wifi, free hot breakfast, comfortable beds. Only down was the noisy AC but I guess that is because it was 25F outside, very cold outside but OK in. Rip off local taxi company wants $25 for a one mile trip, it's not sunshine at all!", "title": "Good value for money with freebie inclusions and pleasant staff", "user": "DRMB", "date": "March 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99517466}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We booked a one-night stay at this property on short notice after a major snowstorm further north necessitated changes in our travel timetable.", "title": "Great Discovery -- We'll Stay Here Again", "user": "MainerOnTheGo", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94202734}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This property is very convenient to I-495.....off the exit, go about a half-mile to the third traffic light, and the hotel is on your right....couldn't get much simpler.", "title": "Friendly staff - nice hotel.", "user": "captaup", "date": "January 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 91462251}], "location": {"country": "United States", "city": "Marlborough"}, "stars": 2.5, "variance": {"poor": 6, "average": 11, "very good": 51, "terrible": 3, "excellent": 90}, "aka": "Hampton Inn Marlborough Hotel Marlborough", "slim_ranking": 0.111111111111}