{"user_rating": 4.5, "review_count": 298, "name": "Hampton Inn Daly City", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "staff is very friendly and helpful, rooms are always clean. there is plenty of places within walking distance for dining and shopping. i have stayed there many times and am never disapointed police department is right across the street so i am comfortable with my equipment truck parked there", "title": "Daly city Hampton", "user": "Rick C", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161295863}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Hampton Inn's are always reliable and this one was no different. Upon arrival we were greeted with friendly staff and room was very clean and smelled fresh. Daly City location made it easy to navigate to San Francisco by car or to the convenient BART station.", "title": "Clean & Convenient", "user": "Karen B", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161291220}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed in this hotel closest to San Francisco to celebrate our 5 year wedding anniversary in San Francisco for a week the month of April 2013. This hotel was very clean the lobby was impressive and our room was clean and good size. The hotel staff were very friendly and accommodating to my needs. They helped us on what places to see in San Francisco. It is walking distance to BART train system and I died when I saw Krispy Kreme doughnuts and In-Out-burger one block over. I just want to thank all the staff to help make our anniversary week so special and we diffently will be coming back to this hotel when we do another trip to S.F.", "title": "We went for 5yr wedding anniversary", "user": "Michele C", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160749426}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Now, let me start by saying I did a lot of research when looking for a place to stay on our \"sister trip\" to San Francisco and ended here at the Hampton Inn in Daly City.", "title": "Great place to stay when visiting San Francisco", "helpfulness": 1, "user": "Tanya Y", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 160515397}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Perks:", "title": "always my first choice when visiting daughter at SFSU", "user": "SallyQZ", "date": "May 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160398218}, {"rating": 3.0, "title": "Nice Hampton Inn, and close enough to SF", "text": "Great choice for staying in the San Francisco area, affordable and safe area. We enjoyed our stay here for 3 nights while touring the city. Short drive (20 mins) into the city. Free parking at hotel. Close to BART station, shopping & restaurants. Across from police station, felt safe. My only complaint is that the rooms seemed smaller than the average Hampton room. We had 2 queen beds, but felt cramped. For the most par, our room was clean, but if you look closely behind beds and such, you can see that some deep cleaning is needed. Indoor pool, but not heated, so very cold - did not use. Was told by front desk that they are in the process of removing pool completely. Decent breakfast choices, with hot and cold options. Overall, this was a great choice for an affordable option in a very pricey area, and suited our needs.", "user": "Tessa C", "date": "June 11, 2013", "id": 163640037}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "If you're looking to be close to the San Francisco, this is not the most accessible place. I came on a business trip with a coworker. We had initially planned to go out the night we were there, but the cab ride into San Fran would have been $$$. So in still trying to have a good time, we decided to find something around the hotel like a bar at least, no luck. It was roughly around 8 pm and anywhere within walking distance that did sell alcohol was closed so we finally gave up and decided to call it a night and ate dinner at IHOP.", "title": "the best hotel bed I have ever slept on", "helpfulness": 1, "user": "jekkajai", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 163036180}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Parking was competitive, hence why we really did not want to move from our spot. Only some of the parking is covered and the surrounding location of the hotel was a little iffy. If I were driving my own newer car I would be a little concerned if my car wasn't in the covered area.", "title": "Quiet Location", "helpfulness": 1, "user": "Richard E", "date": "May 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162443334}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The staff was very friendly and very helpful. The room was great and huge. This was by far one of the best beds I have ever slept on. I slept so good that I am willing to stay at any other Hampton Inn just because of that bed. TV channel selection was ample.", "title": "A great family stay", "helpfulness": 1, "user": "Kathryn3 L", "date": "May 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162493368}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Breakfast was decent. They did have a pool and workout area, but we did not use it. It did seem clean though and had I more time, I would have taken advantage of those amenities.", "title": "Just OK not as convient to San Fransisco as advertised", "helpfulness": 1, "user": "Joseph B", "date": "May 29, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 162298511}, {"rating": 5.0, "title": "Daly City Gem", "text": "Very nice place to stay near SFSU. We were in town to attend graduation. The room was clean. The staff was very helpful and friendly. The breakfast buffet was fresh with a nice variety of foods to choose from. The property is in very good condition. Conveniently located off of the 280, but no freeway noise at all. The inside pool looks inviting, but we did not use it this trip. Definitely we will go back.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 29, 2013", "id": 162381503}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "If you are sick and tired of slamming doors in a hotel, the doors in this hotel are by far the quietest doors I have had in a hotel. Staff was excellent, and happy to help. Great location right near a InNOut burger place. parking was limited, but I always had a place to park in their lot.", "title": "Quiet rooms", "user": "Mark P", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162247803}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This Hampton Inn ended up suiting our needs perfectly. It is easy access to San Francisco and the airport without having to deal with heavy traffic. The fact that an In and Out Burger and a Krispy Kreme were walking distance from the hotel helped make this an ideal location! The staff could not have been more accommodating. We definitely plan to give this Hampton Inn our business whenever we are in the San Francisco area.", "title": "Convenient location and friendly staff", "user": "Dorsey H", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162247700}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Nice clean hotel. While the distance to the BART is not very far (15-20min), walking with bags/luggage would be a hassle. There are lots of food options in the area but if you would like a more upscale experience, you will need to drive. Hotel location felt safe.", "title": "Daly City Hampton Inn", "helpfulness": 1, "user": "Jack G", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 162067841}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Had quite a 'time' trying to find the location, but ended up in a Beautiful, Clean room. Soft sheets, comfortable bed, quiet sleep. Luxury matches price. About $30 over-priced, but a sure bet for good quality. Standard American Diet for breakfast. Very good Oatmeal. I may have gotten sick with a sausage... Not sure. I still would highly recommend a stay at this hotel.", "title": "Heavenly Bed After a long trip...", "user": "Bea B", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161398291}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The Hampton in Daly City is a great place to stay. We stayed here after seeing a SF Giants game. It is an easy 10-15 minute drive from San Francisco. They have free parking. The hotel is clean, up to date, and reasonably priced compared to the other options available in San Fran.", "title": "Great hotel", "user": "Susan M", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 160661292}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "This hotel was perfect for our stay. It is a short trip to Airport and City of San Francisco. Hotel was clean decorated beautifully. The staff was excellent. The breakfast was excellent everyday. All the comforts of home. I would highly recommend this hotel to everyone you will not be disappointed. It was great for the value.", "title": "Best Hotel", "helpfulness": 1, "user": "Sheila L", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159137311}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "This has been the perfect location for us to stay while we are visiting our children at San Francisco State University. Location is perfect and this is a good value for the San Francisco area. Have already booked 2 more stays with you and just referred friends from Cleveland and Baltimore to stay with you in June.", "title": "Clean and very friendly staff", "user": "Claudia K", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158792030}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Usually satisfied with Hampton Inns, this one left much to be desired. The breakfast was awful, the beds were terrible, the shower never got hot enough. Overall the place just seemed shabby. No hot tub, and the pool was not heated.", "title": "Dissapointed this time", "helpfulness": 1, "user": "John S", "date": "April 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 158790695}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Really a very very nice Hampton Inn.The hotel was in excellent condition.The chairs in our room were like bought last week.Lobby was beautiful.The town of Daly City where this hotel was located was not a bad part of town as I read in other reviews.I almost changed hotels because of this.No problems parking.Although when you drive into the lot you do go down a very steep hill so watch your cars.Breakfast was excellent and I loved the fact they had Sunday papers to read.We did not use the pool but did smell the chlorine in the hallway.From the parking lot you can use the back entrance whicjh brings you into the hotel right by the pool.", "title": "Awesome stay", "user": "joryanbob4", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158329700}], "location": {"country": "United States", "city": "Daly City"}, "stars": 2.5, "variance": {"poor": 8, "average": 17, "very good": 108, "terrible": 0, "excellent": 165}, "aka": "Hampton Inn Daly City Hotel Daly City", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}