{"user_rating": 4.5, "review_count": 124, "name": "Hampton Inn & Suites Buda", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed at this hotel as we had a wedding in Buda in Dec. We rented 2 rooms and had a great experience with one of them but the other was horrible. It backed up to the ice machine and it made the most horrific noise ALL NIGHT! The hotel was completely sold out so we dealt with it but told the front desk. Sorry, we can't refund your stay. Ok, fine with me. But they did offer to comp a room for future visit. Tried to do that (with Lacey) but she can't honor the date b/c it's a peak weekend for them. So, the guarantee of customer 100% satisfied was not applied to me. Won't be going back. Other than that, we had an enjoyable stay, the pool was clean and breakfast was standard. The room were comfortable and clean. Disappointed in their customer service.", "title": "Clean hotel but won't honor guarantee", "helpfulness": 1, "user": "Momof2travelerTXNY", "date": "January 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150423943}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This hotel is a very comfortable place to stay especially if one has business on the south side of Austin. it is located very close to I-35 and is basically across the parking lot from Cabela's. The bed was very comfortable with plenty of good pillows and the room could not have been cleaner of fresher. The hotel has fast wifi and a good selection of channels on the TV. Breakfast next monring was excellent with plenty of choices for a good hot meal and the hotel was quiet and restful. It is a great place to stay when in the area.", "title": "Stay in Buda, TX", "helpfulness": 1, "user": "Smith030", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150175302}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family recently stayed at this hotel and had a wonderful experience. Due to a misbooking with Hotels.com (would not recommend them), our family had to be rerouted to a different Hampton Inn in Buda. We arrived very late and were given great service even at a late hour by front desk employee, Luis. Next morning, we received even better service from Lacy Streeter, who I hear now is front desk manager. She was so helpful and pleasant to every request we made. The hotel was very clean and in a great location - between Austin and San Marcos (famous outlet mall location). I would highly recommend this hotel! We will be staying here many more times in the future as our daughter will attending college in San Marcos and this hotel is suits our needs perfectly.", "title": "Great hotel", "helpfulness": 1, "user": "Kim4532", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149027674}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "My husband and I stayed at this hotel on a Saturday when all other Hilton properties were sold out in Austin.This Hampton Inn was very nice. The rooms and common are clean. It is very close to shopping and restaurants. Staff was helpful and nice. This hotel is an excellent place to stay within 15 minutes of downtown Austin.", "title": "Nice Hampton Inn", "helpfulness": 1, "user": "rdwacw", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144748186}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The Buda Hampton Inn is typical of all the newer Hampton Inns; nice, clean room, friendly staff and good breakfast. We stay here because we have a daughter and family that live in Buda. However, its two main attractions are that it is next to the Cabela's Sporting Goods store. I am not a hunter but I can always spend an hour in Cabelas just looking. Their collention of taxidermy animals is like going to the zoo and children enjoy seeing them. Their \"truck stop\" coffee mugs are the best coffee mugs I own.", "title": "Best Hotal next to Cabela's", "helpfulness": 1, "user": "DesertRatNM", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144642960}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I travel a lot between Austin, San Antonio, and Corpus Christi and there is, for me, only one central location for all my business travel, relaxation, service, stores, time to think and a great place to sleep and work. This hotel is located 3 blocks off the Interstate (I-35) and yet within blocks of fast food, steakhouses, pharmacies, and even a great Cabelas for a place to walk, think and shop. Just down the frontage road I can get computer accessories, Target, and more.", "title": "Business Bliss", "helpfulness": 1, "user": "DrMarkES", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144269064}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "Every morning, breakfast has a new hot entree with plenty of other foods and fresh fruit. The staff is cheerful and serves well. The place is well protected with locked side doors and is well appointed and spacious rooms. The staff makes the stay great and everything is \"Yes, we can\" attitude.", "title": "Great experience with a but", "helpfulness": 1, "user": "ShAronmarie3311", "date": "October 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 143919807}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Included is free high speed wifi, pool, guest laundry, spa, and fitness room. A super deal and great prices.", "title": "Great Stay", "helpfulness": 2, "user": "steve u", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142487081}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I rec'd another guests statement ( under my door) and she mine", "title": "Nice,clean hotel", "helpfulness": 1, "user": "Mandy54", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141187392}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "It had my home address and Hilton honor number... Too much information to share.", "title": "Not sure where the other reviewers stayed...", "helpfulness": 1, "user": "Sara R", "date": "September 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 139587070}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Stayed here one night while visiting Driftwood TX for wine trail, and bbq. It was a newer Hampton Inn, right off I-35. Was able to get a same-day reservation. Room was very nice and clean, but bed was awful! Stayed in room 401, and king bed had a huge low spot in the middle. Very uncomfortable to sleep. This bed needs to be replaced! Since we had arrived late, and hotel was sold out, did not report it till the morning. Clerk apologized, but did not offer anything else.", "title": "Average Hampton Inn", "helpfulness": 1, "user": "Tessa C", "date": "February 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 152344367}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Another disappointment for us was the amount of noise we heard during the night. Doors slamming all night, and early in the morning. Could hear people talking in rooms next to us.", "title": "A good place to stay near Austin, and away from the hustle & bustle...", "helpfulness": 1, "user": "Pharmrep79", "date": "February 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 152067578}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "On the plus side, the breakfast in the morning was very nice, with great hot and cold choices.", "title": "Wonderful Stay!", "helpfulness": 1, "user": "Karla D", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151460718}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "If ever in this area again, I would likely choose to stay elsewhere.", "title": "Comfortable, clean rooms and great breakfast.", "helpfulness": 1, "user": "Dennis B", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150834796}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I really enjoyed staying at this hotel, and this was actually my second stay here. I stayed for a week and it was very good for the most part. This is a newer building and so it is in great shape. The only problem that I had, is that one day I came back a little earlier, because I had left early, and my room wasn't cleaned yet. The lady did come by a bit later and I had her take out the trash and replace my empty kleenex box, but I didn't want to wait for a full cleaning, which she would have done. I asked her if she was by herself cleaning and she said that she is always by herself. They have the Golf Channel, which is nice. They have a small pond/lake behind the hotel which also very nice. There are a myriad of fast food places around and a decent thai takeout place nearby. I also got a haircut at the local Great Clips, which I walked to. The Cabela's nearby is great, as I am sure all of their stores probably are, but I am not really into that sort of thing, so I was merely checking out the museum like atmosphere. I used this hotel as a springboard to my business visit to the Austin area, and it really isn't that far from downtown, so I will probably stay here from now on, because I hate the traffic assocatied with major cities.", "title": "Okay...And Not Okay", "helpfulness": 1, "user": "RobynZDoucet", "date": "January 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 150821417}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Being on the road more than 100 nights a year I have the opportunity to experience many hotels both good and bad.", "title": "An oasis", "helpfulness": 1, "user": "David F", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138119210}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Hampton Inn in Buda Tx is truly the best. The staff are kind and courteous and actually know my name when I walk through the doors. Always impeccably clean and quite this hotel is an Oasis in the sea of hotels.", "title": "Great Customer Service", "helpfulness": 1, "user": "Gina C", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137569162}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Thank you Rebecca, Cindy and Jessica for all your thoughtfull work and hospitatility.", "title": "As usual", "helpfulness": 1, "user": "RobinM66", "date": "July 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 135742821}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Thanks to Alisha and Rebecca for the great customer service. The both of you went above and beyond straightening out the mistake made by an online travel company. Because of these two ladies at the front desk they caught that The travel company had booked us extra rooms. Thank you Alusha and Rebecca for exceeding expectations. Our Hampton Inn stay was wonderful. Thanks for the clean room, the wonderful breakfast and most of all the fabulous customer service.", "title": "Best Hampton Inn I have ever stayed at!", "helpfulness": 1, "user": "DOC2003", "date": "July 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135666868}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The most comfortable beds. This hampton has an outstanding breakfast! Easy access to points of interest both north and south. Hampton inn is very predictable in a good way. Like a second home, I always sleep good at Hampton.", "title": "Good lodging, fair value, convenient to Austin", "helpfulness": 1, "user": "Cadillac22", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134349458}], "location": {"country": "United States", "city": "Buda"}, "stars": 2.5, "variance": {"poor": 2, "average": 12, "very good": 36, "terrible": 3, "excellent": 71}, "aka": "Hampton Inn And Suites Buda", "slim_ranking": 0.333333333333, "description": "Visit Buda and relax in a small, \"hometown\" atmosphere that sits on the edge of the vast cultural wonderland of Austin-the capital city of Texas and the \"Live Music Capital of the World.\" The Hampton Inn & Suites Hotel in Buda is located just south of Austin on NAFTA Highway off I-35, only about fifteen minutes from the University of Texas-Austin and twenty minutes from the Austin-Bergstrom International Airport."}