{"user_rating": 4.5, "review_count": 513, "name": "Hampton Inn & Suites North Conway", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We had a nice stay at the Hampton inn. The staff was friendly and helpful. My room rate was incorrect on the bill they left under my door I went to the front desk and they fixed it immediately. The pool was great for my toddler.", "title": "nice time", "user": "Jamie V", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 172157124}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This hotel is close to everything, right across the street from all of the outlet shops and restaurants. The staff are so nice and they are all so helpful. The housekeeping staff even saw that I had a dirty spoon I had brought from the kitchen sitting beside the sink for my morning coffee so she brought me a cup full of clean ones and wrote me a nice little note. They really care about their guests here. The hotel is clean and well maintained, the rooms are generous in size, especially for a large family. The waterside and pool area were the main reason we decided to stay at this location. There is a shallow pool area and waterslide for little children and the larger pool and waterslides are fun for bigger kids and even adults, there is also a hot tub within view of the slides so you can relax while the kids play. They also have staff onsite at the top and bottom of the slides. The larger pool is only 3' deep, which is a bonus if your children can't swim well, you won't have to worry when they come down the slides. They had organized activities for kids in the evenings and movies in the great room for nights that you don't have anything planned and need to occupy your kids. Warm cookies and lemonade at check in as well. The continental breakfast was a hit for the kids, sausage and eggs, cold cereal, bagels, toast, they can even make their own waffles. The only downfall is the breakfast area is very very small for the capacity of the hotel and becomes very congested in the morning and there was rarely a place to sit. On two of the mornings my kids took their breakfast back to their room to eat because they got tired of waiting for a place to sit down and eat. People seemed to be scattered all around the dining and lobby areas. The price seems reasonable for the area and the time of year. We will definitely be back again next year", "title": "Great Value", "helpfulness": 1, "user": "Dboyz", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171964447}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our family at a great time in August 2013 the children loved the water park no lineup for the slides and great service al round. All the staff were pleasant and helpful and I would go back. Parking and breakfast facilities all terrific. Close to great outlet shopping and restaurants.", "title": "A fun place to stay with young children", "user": "Sheena W", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 172003431}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Excellent stop for families. Much to do for kids of all ages but especially young ones. Indoor water park at the hotel, access to top shopping outlets, great value for the money. For hikers, plenty of trails in the area; for foodies, excellent restaurants to be savored.", "title": "Very family-friendly", "user": "skyepisces1", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171828793}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I love the fact that we could bring our dog. Not only was our dog accepted, but he was welcomed with open arms. We stayed in a dog reserved room, but would never have know as was as clean and smelled same as any other room.", "title": "Very good experience", "helpfulness": 1, "user": "Barrett J", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171561412}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Located right where the action is in North Conway, the Hampton Inn provides bang for your buck!", "title": "Everyone Loved It Here!", "user": "KTLuvs2Travel", "date": "August 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173427824}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our family of five traveled for a long weekend Friday-Monday with our puppy. This was the first time traveling with her. The Hotel was great. They had a dog walking path around the back of the property.", "title": "Average at best", "user": "Catherine B", "date": "August 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 173443698}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The staff provided a twin sized air mattress for one of our kids. She said it was very comfortable.", "title": "Convient", "user": "Scott S", "date": "August 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "location": 5.0, "service": 4.0}, "id": 173285770}, {"rating": 5.0, "title": "Hampton Inn North Conway, NH", "text": "The pool area was perfect for our kids ages 11-7. And it saved us from having to spend more at the Red Jacket Inn's indoor water park. Yay!", "user": "A TripAdvisor user", "date": "August 20, 2013", "id": 173286098}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We have nothing negative to report back. :)", "title": "Make sure your room is clean", "user": "April R", "date": "August 19, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 5.0, "rooms": 1.0, "location": 4.0}, "id": 173111069}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "We stayed here for 2 nights with our 2.5 year old and 10 month in a 1 bedroom suite on 2nd floor. God bless anyone that stayed underneath us as my 2 year bounced off the 4 walls and 10 month crawled around... Did my best to keep them quiet...the bedroom suite was perfect layout for us... We could watch TV in our room during their nap time and after they went to bed. The bathroom sink was in its own area and so large we considered putting the pack n play in there to keep the baby from waking his brother on air mattress. But The living room was large enough for both to sleep in their with some distance. The room was clean enough that I wasn't horrified at letting my little crawler explore... I travel a bit for work and this hotel was better than average on my clean scale for room and common areas. Bed was a little too soft but that's just preference. Water park was perfect after nap activity for us... Our little ones were happy to splash and play...in wading area. Dinner was takeout from Muddy Moose in common dining area followed by ice cream social by hotel. You could always grab something from local grocery store as well. It definitely catered to young families with some type of social activity in evening. (Thank you!!!)Would love a little playground or access to the one next door... Helps burn off the extra kiddo energy. It was great stay for us and hope to be back again in fall or spring.", "title": "Family Friendly!", "user": "Daphne418", "date": "August 29, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 174760741}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I took my daughter and two granddaughters to North Conway for 5 nights. I had called a head of time and asked for a room on the 4th floor. We were on the 3rd floor and by the elevator. Every morning were woken up early by a child running back and forth above our heads. People would stand outside our door talking loudly waiting for the elevator. Not everyone wants to be up at 8 while on vacation. The water park was good for my younger granddaughter, however the 12 year old was bored. It is nice for the younger ones. The hotel was clean and the staff where nice. The beds were comfortable, however I am not sure they are truly queens. It was nice to have the refrigerator to store our food for lunches. We enjoyed the breakfast each morning. I would recommend this hotel to friends. I am not sure I would go back, especially in the summer due to the large amount of young children and the noise. It is a nice hotel though and I would have asked for another room. We arrived about 12:30 am though and were exhausted from our ride. So, you can see why we were so upset about being woken up before 7 by a running child and then at 8 by a woman in front of our door talking loudly.", "title": "Our White Mountain Vacation", "user": "katluvlh", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 174294636}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed 3 nights at the Hampton Inn in North Conway and had a wonderful time. The staff was very friendly and very accommodating. Loved the cookies at the front desk! The room was very clean. It had a small refrigerator and microwave which was helpful. The bed was comfortable and the bathroom was very nice and had plenty of towels. My daughter loved the indoor waterpark. Great location - close to outlets, restaurants, grocery stores. I would definitely stay here again and would not hesitate to recommend this hotel to anyone.", "title": "Nice Hotel", "user": "joanne44567", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173873792}, {"rating": 3.0, "title": "Ok", "text": "The Hampton Inn in North Conway really caters to families, especially those with small children. The room was a typical Hampton Inn room. It did have a small kitchen area (sink, mini fridge, and microwave) which was a nice touch. This hotel is very noisy, even during the quiet hours, due to the amount of young children and families. We stayed on the 3rd floor and could hear the people in the room above us until very late and then very early. The breakfast is cold, dry and too crowded. If you want access to food get there early and don't have any expectations for taste, or freshness. The water park was small but reasonable for my children ages 4 and 8. There are two big slides and two small slides. There is no regular swimming pool. There are also no life guards just attendants. The first day/evening the adult attendant paid attention and enforced most of the rules. Our second day the teenage attendants seemed board and did not seem to care about running and messes, one in particular seemed to be interested in falling asleep and eating. The pools were mostly clean but the space was cold, I think because you were only half in the water. The water park at The Red Jacket Resort is bigger and staffed better but the rooms at the Hampton in were nicer for the price. Next time we may go for a cheaper option and skip water parks all together.", "user": "Jessica S", "date": "August 22, 2013", "id": 173485362}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Everything is clean and the staff is very friendly and helpful. Two things wrong; first thing is you had to wait for a table at breakfast, so make sure you give yourself extra time, and nobody helps you with your bags when you check in.", "title": "Sleep like a log...;)", "user": "Doris M", "date": "August 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 173596667}, {"rating": 5.0, "title": "Nice Stay", "text": "Very nice stay at the Hampton Inn North Conway. The breakfast was great with coloring pages out for the kids. Close to everything in North Conway, Storyland, etc. The indoor water slides were great and the kiddie pool area was perfect for the little ones.", "user": "A TripAdvisor user", "date": "August 8, 2013", "id": 171422920}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This hotel is close to many White Mountain area attractions (i.e. Mount Washington Auto Road,", "title": "The location is great", "user": "Tom T", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171118978}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Mount Washington Cog Railway, Story Land, and Conway Scenic Railroad). In addition, the hotel has its own \"water park\" and kids love it. The breakfast area is crowded in the morning but the food selections are good.", "title": "Not up to Hampton Inn Standards", "user": "mackli", "date": "August 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 170963942}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "There is a factory outlet nearby (Settlers' Green Outlet) and I happened to see they have free movie night on Tuesday.", "title": "Great experience", "user": "Zmbm", "date": "August 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170956031}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "When we stay at a hotel chain, Hampton Inn is our usual chain of choice. However, this particular one did not meet our expectations after staying at many different Hampton Inns. Definite mold issues on the air conditioning unit and glass shower door in room. Found this surprising because we have always found Hampton Inns to be clean and comfortable. Duvet cover on the bed was worn and had probably been laundered with dark clothing because there were \"black pills\" all over it. Not very inviting. For the price, which is probably a little high because of the location, not worth it. Our room was on the water park side and all you could smell was chlorine in the hallways regardless of what floor you were on. Don't think I'd go back to this property.", "title": "Life Saving Staff", "helpfulness": 1, "user": "Kim F", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170867038}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 12, "average": 43, "very good": 165, "terrible": 2, "excellent": 291}, "aka": "Hampton Inn & Suites North Conway Hotel North Conway", "slim_ranking": 0.12, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "One of the newest hotels in North Conway, and in the Mount Washington Valley. Located next to over 100 tax free outlet stores and local restaurants. Enjoy our 5000 square foot indoor water park. The park features two, three story slides, a toddlers section with two smaller slides, Fernando the Frog and the watering mushroom. Expanded wireless is complimentary throughout the building for all of our guests. Start your day we our FREE hot breakfast buffet, and get your family ready for a busy day. Enjoy many of the areas attractions and activities, during all seasons. Pets are welcomed, and there are never any additional fees when staying with Hampton Inns."}