{"user_rating": 4.0, "review_count": 74, "name": "Hampton Inn & Suites College Station / US 6-East Bypass", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Great hotel to stay with family but don't expect to sleep on the sofa bed in the suites. The mattress was so thin that every spring and the bottom of the board could be easily felt. The kids could not sleep on it! Otherwise, everything else was fine. Breakfast was pretty good.", "title": "Stayed with family", "user": "Susan P", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 159253708}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed in a 2 queen suite with a pull out couch so it slept a total of 6. The room was nice, well furnished, and clean. The complimentary breakfast was better than most hotels. Plenty of parking and in a nice area near restaurants. On a busy exit ramp so that it was somewhat difficult to get out of the parking lot in the AM during traffic.", "title": "Very Nice Hotel", "user": "C3WP12", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158794073}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This hotel must be fairly new - everything was spotless and looked new. Very large and comfortable room. Internet was not quite as fast as i am used to, but I am fairly spoiled. Breakfast was really good. Coffeee was great.", "title": "Spotless and Friendly", "user": "Keith C", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158792766}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Great hotel, and very spacious rooms. Room had a king bed and plenty of room to move around and relax. Very clean and bed is always the best at Hamptons. Front desk was very efficient and had a group of us checked in very quickly. Gym was good. Had treadmill and bike, plus hand weights and med balls. Always nice to have a few more options while traveling. Thank you!", "title": "Great Hotel", "user": "MKS17", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157512854}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "very nice, the only downside is the entrance, easy to miss, the sign is after you turn in to the hotel. a sign indicating where the turn is would help. our room was away from the elevator so it was very quiet. breakfast was good and plentiful.", "title": "nice hotel", "user": "lwc55", "date": "April 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157404428}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "They have everything I need... great rooms, great service and I great breakfast selection. The staff is always very pleasant and ready to help you any way they can. The rooms are comfortable and meet all my personal and business needs.", "title": "I always stay at this hotel when I am in town on business.", "user": "salicto", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156051963}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "This is a good hotel in a good location. It is cloae to a few restaurants and a decent mall. The staff were polite. The rooms were nice and clean. There is a BJs down the street. It is hard to get to the hotel just due to the way the highway intersection is configured.", "title": "Good Location", "user": "kuwells", "date": "March 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155296511}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Our group stayed in 6 rooms and we all had a most excellent experience! Not one complaint. It couldn't have been better! They even offered us the \"On the go\" prepared and bagged breakfast in case we didn't have time for their awesome hot breakfast. We highly recommend this hotel.", "title": "Best experience ever! We had 6 rooms of people, too!", "user": "Cheryl R", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154978090}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Traveling for business. This hotel is close to many major companies. Really pleasant, helpful staff, clean rooms, nice fitness facility, breakfast was great and the beds were outstanding. Would definitely recommend this hotel.", "title": "Excellent stay at this hotel. Would highly recommend.", "helpfulness": 1, "user": "DWade4u2", "date": "March 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153999662}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Hotel is only 7 years old but undergoing a major renovation - lobby was disrupted and noisy. Staff is friendly & apologetic for noise. Otherwise standard Hampton Inn - clean & quiet. Convenient location on freeway but not walkable to Texas A&M. Awkward turnoff from freeway feeder.", "title": "Under Renovation", "user": "LucyLu_Texas", "date": "March 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 153997923}, {"rating": 2.0, "title": "One of the worst nights of sleep I've had", "text": "The problem could be unique to my room - so do keep that in mind. But my room had a fair amount of mechanical noise in it 24/7. There is a cheap motor in the in-room fridge that causes a loud tick-tick-tick-tick sound every 1/2 second (I counted). And, because it backs up against a wall, it is echoed throughout the room. Also, you can't reach the plug to unplug the thing. Also, the bathroom vent never shut off, which also echoed along the wall. So, that all added up to a pretty bad experience in terms of sleeping.", "user": "Gemutlichkeit", "date": "May 15, 2013", "id": 160781214}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "To put the above in context, I stay at a fair amount of hotels, and, this is my third Hampton property in less than a week.", "title": "TAMU Destination!", "user": "Brett L", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161290818}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The property itself, however, is clean and new and spacious and the people have been super-nice.", "title": "Clean, Friendly, Spacious", "user": "Jason C", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160186813}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Also, property has only one elevator. So, if you're in a hurry (and can't do stairs), just keep that in mind.", "title": "Great Hotel", "user": "Robert M", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160670452}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Great value and convenient location to TAMU. The Desk Staff usually has current students who can answer questions about the town and university. We have stayed here the past four years and have had nothing but positive experiences at this hotel!", "title": "Great experience", "user": "Carolyne R", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160662824}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Of all the hotel choices we had in College Station I'm glad we ended up staying here the staff was friendly and our room was clean and comfortable. It's located right off the freeway with easy access to the main drive in town. We had a great stay and will be back to stay again.", "title": "Great stay. Friendly staff.", "helpfulness": 2, "user": "meetuthere", "date": "February 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152755972}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Nothing fancy, but gets the job done. Access is a pain, because you had to know that you were supposed to get off on the feeder road in one direction only. And you could only exit in one direction. Breakfast was okay. The lady response for refilling things, seemed annoyed because there was no creamer or coffee, and it was a majoy inconvience for her having to refill it. Muffin selection was good. Egg choice was changing by the hour. Must have been leftover Saturday.", "title": "Nothing fancy", "user": "torpette", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 152693931}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I chose this hotel base on the rates and i booked a jacuzzi suite for the night. First of all the rooms were great but this hotel has some major security issues especially when it comes to ones identity. I checked into the hotel where i was waiting at the desk as the agent who was on the phone was busy with the guest. IT would have been nice if he acknowledge me by saying it would be a minute or i will be with you shortly but he did not after a few minutes he asked if i was checking in and i said my name. This next part is a major problem while he was still on the phone he almost handed me another guests room keys. HE DID NOT ask me to present a form of id as all hotels do and to make matters worse i am an elite member who is on the road several weeks a year and was not recognized. All of the hotels i stay at still ask me even though i am a loyalty member to present some form of identification. Another problem is that anyone who knows someone staying there could just check in under false identity which could be a dangerous situation. Needless to say i will not be back. After i checked out i call the customer service where i informed them of the situation i experienced and was inform after creating a file that the hotel has 3 days to response which they did not. I emailed my customer service who helped me with this case to let them know that i have received nothing from the hotel nor any other compensation for this event and potential safety and security of their guests. To this day i was charged fully for my stay with no correspondence from the hotel manager of their poor performance on guest safety.", "title": "Identity Risk please read", "user": "travelcord", "date": "January 12, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 149524024}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "sincerely,", "title": "Newer property. Very comfortable and clean. Good Value!", "user": "Richard D", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149501555}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "an Elite HHonors member", "title": "Thought I was going to post bad review, turned in to praise for staff!", "helpfulness": 2, "user": "Karen S", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147354178}], "location": {"country": "United States", "city": "College Station"}, "stars": 2.5, "variance": {"poor": 1, "average": 7, "very good": 26, "terrible": 6, "excellent": 34}, "aka": "Hampton Inn And Suites College Station/Us 6-East Bypass", "slim_ranking": 0.214285714286, "description": "Located on Highway 6, the Hampton Inn & Suites College Station/US 6-East Bypass provides easy access to Bryan and College Station. Join us for a free hot breakfast every morning and use free high-speed internet access in your comfortable room to stay connected with work and home. At our location on Earl Rudder Freeway South at University Drive, you'll be less than four miles from the campus of Texas A&M University. Cheer for the Aggies at a football game or catch a show at the Wolf Pen Creek Park and Amphitheater. Experience live music on Northgate, tour Messina Hof Winery or get a taste of history at the George Bush Presidential Library and Museum."}