{"user_rating": 4.5, "review_count": 361, "name": "Hampton Inn & Suites Providence Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I typically do not write reviews but thinking on my plane ride home i could not get over the quality of service that i was given at the hotel this afternoon. I checked in this past week for a military event that is held once a year. The tab is picked up by the Gov. and they usually stick us in the lowest priced room that they can find. i was upset right from the get-go, a delayed plane at O'Hare Int. airport , and when i arrived the room stunk of cigarettes. when the manager was called out because i was put into this smoking room, the guy that weighed 70 lbs soaking wet had an attitude because i told him i could not tolerate the lingering smoke smell that i took in from the second I got off of the elevator. I arrived early, about 2:30, and was told that they would try to set up a different room for me by the time i was able to check in. I returned to the hotel about 4:45pm and had the pleasure of dealing with the extremely nice young lady Amanda (The name stuck in my mind because she shares the same name of my oldest daughter). She informed me that it was no problem to switch my room since they were not sold out and gave me a complementary upgrade because i had the misfortune of dealing with a \"new\" manager that i am assuming is new to the hospitality industry. I was barely in the hotel for anything at all over the course of my stay for anything except sleep until this morning, i went to the lobby and then again i was greeted by Amanda and another young lady that was also very courteous and polite, they remembered my name which i thought was great alongside david the valet, he was a very interesting young man that had a great attitude and also remembered my name and had an excellent knowledge of the city since he grew up there(i could tell this by the accent lol), i went to a great restaurant for lunch and was given a free appetizer coupon by the valet that was great.", "title": "Unbelievable Service", "helpfulness": 1, "user": "Jack C", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140298132}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The customer service here was very impressive minus the degrading feeling the manager, of all people, had given off when i asked for something so simple as a room switch. The lobby attendant Amanda has performed above and beyond and i think that she should be recognized for this, along with all of the other staff that was on this past Friday morning.", "title": "Great boutique Hotel", "helpfulness": 1, "user": "ssajan", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139765433}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Recently stayed two nights at the downton hampton inn. Absolutely loved it. I forgot my charger for my computer. I realized this a few days later, called the hotel and they had it in lost and found. I picked it up on my way back. Hotel is within walking distance of Providence Place, which reminds me of a small Mall of America. Staff was wonderful. Breakfast was great. Would stay here again if I ever return to Providence.", "title": "Odd Hampton Stay", "helpfulness": 1, "user": "USTravelera", "date": "September 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 139746017}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I travel every other week for business and try to stay at Hilton properties. I've stayed in Hampton Inns all over the country. This hotel, by comparison to the others, is just odd. My room was large and clean, but the walls are thin and any noise from neighboring rooms is shared. The breakfast was good and comparable to other Hampton's - maybe even a bit better because of the wide selection of fresh fruit and yogurts. The staff were professional, not as friendly as other hotels, but they were professional. Here are the odd parts: the hotel is in an old building. The elevators are slow and loud. On one ride down, I looked at another guy when the elevator jumped and we both agreed that the whole place was creepy. It takes 7-8 seconds for the elevator doors to open after it has arrived on a floor. The workout facility is located in the basement of the hotel - and it looks like a basement. No windows. The equipment is new and the room is clean, but it is a basement. There is no pool at this hotel. If you are on the 10th floor, you have one elevator at the end of the hallway. The regular hotel elevators do not go to this floor.", "title": "Overall Pretty Good", "user": "Eileen G", "date": "September 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139679941}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The ice machines are on every other floor and on the higher floors they tended to be empty in the evenings. While I did not park a car, many folks were unhappy by the lack of parking and $25 a night parking rate. There really isn't any place to put a car when you first arrive at the hotel. There are about 4-5 spaces in front of the hotel, but they are mostly filled. The neighborhood was fine. Its in the financial district and tends to empty out after dark - so there are not a lot of people walking around this section of town. On the whole, I wasn't comfortable in this hotel, and when you travel as many weeks as I do, its important to be comfortable. I will be staying at another Hilton location the next time that I am in Providence.", "title": "Wont Be Going Back Anytime Soon", "helpfulness": 3, "user": "muribyortega", "date": "September 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 139610176}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "A wonderful hotel with an amazing staff, I am still surprised by how large my room was, this is a really cool old building that has been turned into a hampton, skip the valet and park in the lot to save some money. Breakfast was very nice and I liked the fruit toppings for the waffles and enjoyed the yogurt parfait area! Thumbs up!", "title": "I wish I could rate them higher then the 5!", "helpfulness": 2, "user": "Traveltheworldfun", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139594200}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Very nice hotel right in the middle of Downtown Providence. Clean room, friendly hosts (except for valet service workers), and decent breakfast. Upon arrival, 2 valet car service workers told us to pay $25 valet service. We were unaware of this extra charge when we booked the room directly via their company website. Providence is nothing close to NYC or other major cities in terms of parking unavailability. Parking lots adjacent to and behind the hotel was completely empty. When we asked the valet workers where we can park overnight without paying the $25 parking fee we were told simply \"something\" can happen to our car if we dont use their valet service. We found a much cheaper overnight parking in the immediate area. And \"nothing\" happened to our car.", "title": "$25 extra for over night parking", "helpfulness": 1, "user": "hepper", "date": "September 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139376414}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We spent three nights here, and the hotel was everything you'd expect from a Hampton Inn. The rooms were nice, and clean...the staff was courteous and helpful. The only thing keeping my review at four stars is the parking situation. We like to come and go throughout the day & evening, and generally choose to stay close to the event/attraction we're visiting for that convenience. We waited longer than we were told to expect, for our car to be available to us each time we called for it. The hotel was at capacity for two of our three nights, so I understand the congestion, but because we do like to come and go with our vehicle, I would look into other hotel options before considering this one again. A special note about the breakfast/kitchen staff---they did a fabulous job maintaining the breakfast buffet during this very busy weekend.", "title": "Great hotel, inconvenient parking", "user": "MyFamilyConcierge", "date": "August 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138996385}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Our vacation took us to Providence for one day tour of the city. We chose it because it was central. Certainly was that. Tucked in a tiny street it really took a GPS to find it. Once there though it was perfect. Parking is not free. You can valet it for $25 or self-park for $15 in the lot behind the hotel. Room was great, people were super helpful pointing us to the sites. Breakfast next morning was everything you could ask for. Every possible need and want was thought of....including the electric shoe shiner in the hall my son was so entertained with.", "title": "One word.....Priceless", "helpfulness": 1, "user": "wTavcar", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138727757}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We found our stay here very good. The breakfast buffet was very varied. We had coffee and tea and fruit available throughout the day. The internet room was great as it was free to access emails and facebook.", "title": "hampton inn", "user": "MELTED_10", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138639743}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "What an amazing hotel. We stopped in Providence on our way home from another Hampton Inn location, which we loved, so we chose to stay here. Again, another wonderful experience. The valets were so helpful in offering tips to see the city in the one day we were in Providence. The assistant manager who checked us in made us feel like VIPs. The room was nice, with the comfortable beds I'm coming to think of as synonymous with Hampton. Every staff member we came into contact with went out of their way for us. I think the neighborhood, however, would be perfect for a business meeting, but on a Saturday it was deserted. As we walked through the city, it was so eerie, in fact, that we didn't feel completely safe. Ultimately, we went up to the university area, and learned that we would have loved to have visited Providence in our 20's. We were a decade late. There is an event that takes place at specific times (not during our stay) called WaterFire which looked so cool I would like to go back to see.", "title": "Perfect property", "user": "HeatherH71", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138609687}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I stayed at the Hampton Inn in Providen, RI this past weekend for one night. The staff was very accomodating and the price was reasonable for the level of quality. We had to check in late at night as we were driving in from NJ and there was no problem with that. We got the room type that was requested. The room was very clean and the beds were super comfy. The lobby/breakfast area is very, very nice. There is a little shop where you can buy bottled drinks and snacks. We were able to walk to the convention center in less than 10 minutes. The breakfast is very generous and includes hot items such as eggs, sausage and DIY waffles. They only downside is that parking is rather expensive at the hotel. We opted to park in the deck on the next block over and only had to pay $10. My husband and I are planning a weekend get away to Providence and I would definitely book with the Hampton Inn again.", "title": "Great place to stay if going to the Convention Center", "user": "sarah421", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138548972}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed for just one night August 11,love the location, just a couple of blocks from nice bars and restaurants where I went to \"feel\" the city and get some food which as a matter of fact was pretty good, from the valet parking guy to front desk everyone was very nice, also the ladies at breakfast, no complaint about variety and taste,clean rooms, beautiful building and of course the comfy beds. Stay here you won't regret it!", "title": "Superb", "user": "Elias B", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138232662}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We had a wonderful stay at the downtown Hampton Inn, in Providence RI. The location is the best in the city, with the beautiful river and downtown within a 3 minute walk. Our room was actually a suite that was extremely clean and spacious. It faced the street below, and on the 4th floor was extremely quiet. The entire staff were very courteous and professional. The building itself has a lot of historical touches in the lobby area. This is the second time we have stayed here, for the location, staff, and service, this hotel gets high marks in all applicable categories", "title": "Great stay and a great location", "helpfulness": 1, "user": "warner50", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138105883}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We loved this Hampton Inn in the financial district. Our room was lovely and smelled so clean. The staff from front desk to valet parking attendants were helpful, friendly and interested in your stay. The area has several really good restaurants within safe walking distance even at night. We had very little time there but would like to return for a longer stay. There is a walking tour in the vicinity that is clearly marked and looked really interesting.", "title": "Wonderful Hampton Inn in downtown Providence", "user": "Carol A", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 137829633}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This was a really great choice. I normally stay in the Hilton, but I do not like the location of the Hilton, so I tried the Hampton Inn. It was really nice. I had a nice corner room with lots of light from outside, a nice kitchentte and even a microwave.", "title": "Great people, great location, great rooms", "helpfulness": 1, "user": "tjp1994", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141900531}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The hotel does not do roomservice nor does it have a restaurant. There are however plenty of nice restaurants in walking distance. The breakfast however is totally fine.", "title": "Nice staff, good location for Brown", "user": "Sarah492", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 141793965}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Staff was very very friendly and helping", "title": "Great location, service good, fair price", "user": "TwinCs", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141537294}, {"rating": 5.0, "title": "Restored historic building and right in the middle of the action!", "text": "Very friendly, helpful staff. The rooms were about average; could use some updating. But, the price was good and the location was superb. My only complaint was that the AC/Heat was very loud and clanked and clunked when it cycled on and off. Coffee and cookies when checking in was nice.", "user": "Marylander44", "date": "September 26, 2012", "id": 141312735}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We were visiting for a day and decided to try the Hampton Inn. We were very pleased.", "title": "Great Manager", "user": "Lindsey2101", "date": "September 22, 2012", "detail_rating": {"service": 5.0}, "id": 140959905}], "location": {"country": "United States", "city": "Providence"}, "stars": 2.5, "variance": {"poor": 2, "average": 27, "very good": 111, "terrible": 2, "excellent": 219}, "aka": "Hampton Inn & Suites Providence Downtown Hotel", "slim_ranking": 0.0833333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Hampton Inn & Suites Providence Downtown is Providence's newest hotel and we are the only hotel in downtown to offer a free hot breakfast buffet. We are located in the heart of the financial district and are in walking distance to Providence Performing Arts Center, Providence Convention Center, Dunkin Donuts Center, Brown University, Johnson & Wales, RI School of Design, Providence Place Mall, Waterfire, and more."}