{"user_rating": 5.0, "review_count": 207, "name": "Hampton Inn & Suites Salem", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "No real surprises. Every thing was clean, worked well and was comfortable. The location is great. Near shopping and restaurants but not a busy road/highway. My only wish was that the room had a firmer pillow, but that was not a big issue. I'd stay here again when traveling to Salem for business or pleasure.", "title": "Good Predictable Stay", "user": "highdesertbadger", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 183864060}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Every staff member we encountered during our stay was genuinely friendly and engaged in conversation. As we walked to our room, even 2 different maids stopped and smiled and said Hi and asked how we were doing. It was like being with a second family. The salt water pool is the best around and every machine worked in the fitness center, that was a nice treat! The breakfast had almost every choice you could want, it was all around the best place I have stayed!", "title": "Friendliest staff anywhere!", "user": "Heather C", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184442281}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Stay at the Hampton Salem when in the area. You will not be disappointed. Great breakfast, rooms, service and more. I was part of a group on business, but I have every reason to believe the service and attention would be the same as an individual. Great job Hampton!!!!", "title": "A greta place to stay!!!", "user": "Judy A", "date": "November 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183604709}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Best fitness room I have ever seen in a hotel. Continental breakfast offered a large variety of great food. There was a complimentary dinner served both nights I was there. The food was exceptional. Rooms were very spacious and clean. My only disappointment was that there was not a sauna.", "title": "Great hotel", "user": "Lisa H", "date": "November 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183229535}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Called about two hours before arrival looking for a room. Terra at the front desk reserved me a room in about 60 seconds. Suite with plenty of room, quiet, comfortable. Great price. AAA and HHonors member. Really clean. In fact they specifically mention that the duvet covers are cleaned before each guest arrival. Loved that. I hate the idea of laying down on a bed knowing someone else was eating in it or had their shoes on. Front desk staff was friendly. I liked the idea that they had a list of local restaurants (a lot of choices) that were not chains but places that locals would go. Places you would never find without someone telling you. Would definitely stay here again.", "title": "Great Hotel", "user": "Rideo", "date": "October 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 182761872}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Fantastic hotel with great service! The front reception has an extensive list of restaurants in the area, and reference cards with directions to/from the restaurant - what a fantastic idea for out-of-town guests.", "title": "Worth it!", "user": "Kerri J", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181644070}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "On September 30, my car hydroplaned on the freeway and I hit the concrete barrier head on. I was bruised due to the seatbelt and airbag, but otherwise o.k. I asked the tow truck driver to please take me to a motel that she knew would be really clean. She took me to the Hampton in in Salem, OR.", "title": "Took Great Care of Me", "user": "Joanne C", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181292869}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "When I arrived, I was still dazed and confused and my car was on a tow truck by the front door. The staff rushed out to clean all of my personal items out of the car for me and the manager gave me a discounted room so that I could have hot baths to ease the muscles that were starting to tighten up. They did not let me lift anything and placed me in a super clean room with a wonderful tub. Being able to take a hot bath really helped ease the pain. The staff checked on me regularly and rushed to get me anything I needed right away. I had a restful night in a very comfortable bed and a great breakfast in the morning. My son came to get me the next day.", "title": "above and beyond", "user": "Catherine J", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180547742}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "To the staff: Thank you so much for your wonderful care and concern. I know that my healing was definitely enhanced because you made me feel that I was in safe and caring hands. I owe you a huge debt of gratitude. By the way, yours is the only motel I have ever been in where the duvet on the bed is washed between every guest. I guess that I really was taken to the cleanest motel in Salem. Thank you again. Warmly, Joni C.", "title": "Best stay ever!", "user": "Aces88", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180546787}, {"rating": 3.0, "title": "Good", "text": "Helpful and friendly staff. Excellent discount for university faculty. Super clean room. Early housekeeping. Loved the fitness center - fans and TVs on the treadmills. Nice selection of quick meals in the gift shop. Beautiful path with numerous water features just across the parking lot.", "helpfulness": 1, "user": "Dottie47", "date": "October 5, 2013", "id": 179817942}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We travelled from the Seattle area for an OSU football game. We normally stay at the Hilton Garden Inn in Corvallis, Oregon, across from the football stadium. However, on game weekends, the Hilton's minimum stay is two nights at a rate of around $260/night. Our friends mentioned they stay at the Hampton Inn in Salem where the rate is around $135/night . We stayed for two nights so our bill was less than half the bill would have been at the Hilton. The Hampton in Salem is new, clean, safe/secure, has a pleasant/positive staff staff and is a great value. We highly recommend staying there!", "title": "Great value in Salem, Oregon", "user": "Richard B", "date": "October 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179778011}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "This hotel is only one year old and it is evident. Nice lobby with coffee/tea station all day and warm cookies on arrival with attentive front desk staff. Rooms are very nice and clean. Spent one night and left early next morning so wasn't able to try breakfast.", "title": "Newer hotel but too close to freeway.....", "user": "akaSparky", "date": "October 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 179521069}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "On the downside, our room was at the far end of the floor closest to the I-5 freeway and was so noisy all night. It would have been much better to be near to the street one enters from on Hawthorne Avenue. Because of the sleepless night...they get an average rating.", "title": "Great hotel, good amenities", "user": "52cali", "date": "September 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178170124}, {"rating": 5.0, "title": "Customer Service", "text": "This is a newer, very clean hotel. It is near the freeway and has lots of amenities, including complete breakfast. The exercise room has a lot of great equipment; treadmills each have there own TV and dispo headphones!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 22, 2013", "id": 178233201}, {"rating": 5.0, "title": "Excellent value", "text": "The rooms are comfortable and clean as are most Hamptons. Our only complaint would be the price seemed kind of high.", "user": "kellsjells", "date": "September 18, 2013", "id": 177726600}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "This is the best Hotel in Salem hands down. The service here is the best staff are great rooms are great and the whole experience is wonderful. The hotel is so clean and the staff are so friendly. If you come to Salem this is where you need to stay.", "title": "Great place to stay", "user": "Chris T", "date": "October 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182781570}, {"rating": 5.0, "title": "Perfect room", "text": "LOVED this hotel. Staff was cheerful and helpful. The room was very comfortable. The sheets and comforter were wonderfully soft. Even though it was a business trip for me, my husband came along. The room and hotel made us feel pampered. We would love to come here often just to get away.", "user": "A TripAdvisor user", "date": "October 23, 2013", "id": 182183979}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I picked this Hampton Inn based on reviews and my experience with this brand. I was not disappointed. Great choice for a business trip. No disappointments here. Quiet location. Quiet & clean room. Breakfast was the usual fare which was tasty and plenty of choices.", "title": "Good Business Choice", "user": "WisconsinRanger", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 181896686}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I hadn't stayed at a Hampton in years having always felt they were average. This Hampton was outstanding. The helpfulness and friendliness of EVERY staff member was excellent. Loved knowing that all the bedding was washed with every guest. Facility was in great shape, clean and appealing.", "title": "Great place to stay", "user": "Chris T", "date": "October 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181763552}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "COMFORTABLE BEDS, FRIEDLY STAFF, AND WARM WELCOME. WONDERFUL STAY WITHOUT ANY ISSUES or concerns. Nice buffet breakfast in the morning. I would consider HAMPTON INNS on top of my list for my next stay in any city.", "title": "Stay at Hampton Inn", "user": "David J", "date": "October 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181763705}], "location": {"country": "United States", "city": "Salem"}, "stars": 2.5, "variance": {"poor": 0, "average": 9, "very good": 20, "terrible": 2, "excellent": 176}, "aka": "Hampton Inn & Suites Salem Oregon", "slim_ranking": 0.0434782608696, "description": "Welcome to the Hampton Inn & Suites Salem, set just minutes from downtown Salem, the state capital of Oregon. Take the family for some thrills at Oregon State Fairgrounds, discover the state’s natural beauty at Silver Falls State Park and explore Oregon’s various wineries and restaurants during your stay. The hotel is also located near many local colleges and universities, including Willamette University, Corban University and Western Oregon University. This Salem hotel is great for visiting students and families, and packed full of amenities to make your stay as comfortable as possible. It is also convenient to many nearby businesses, including T-Mobile and Sanyo.Check in to this hotel in Salem, Oregon to enjoy a range of amenities and services to make each guest feel at home. Swim laps in the hotel’s swimming pool and maintain your fitness routine on the road in the fitness center with a range of cardiovascular machines. Start each day with Hampton’s free hot breakfast, or simply grab a free Hampton On the Run® Breakfast Bag to take away with you Monday through Friday. Our hotel in Salem, OR offers a light dinner on Tuesday and Wednesday nights. Stay on top of work in the business center equipped with fax, photocopying and printer access. Host your meetings in the hotel’s 851 sq. ft. meeting room which accommodates up to 96 guests in a range of seating styles."}