{"user_rating": 4.0, "review_count": 83, "name": "Hampton Inn Canton, MS", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "This was my second stay at this hotel. There are not many options in Canton, MS and I certainly don't expect a luxury hotel. However, when we stayed here last year we had an issue with the curtains not closing all the way (about an 8in gap) and with the parking lot lights just a few feet away there was a lot of light glaring into the room. The manager fixed the issue with some paperclips.", "title": "Needs to Address Issues", "user": "vlfair", "date": "December 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 50533366}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Well, we were given the exact same room this time and in 13 months they had not fixed the curtains. I went down for the paperclips and the manager even remembered the problem from last time.", "title": "Great hotel considering the area", "user": "Johnslastmate", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33489893}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Again, I'm not expecting much from the area but Hampton is generally a good hotel chain and you'd think they could have fixed the problem in a year. I can't be the only person who doesn't like parking lot lights glaring in the window all night. Also, all of our keys had to be reprogrammed twice as they stopped working. We may have to try a different hotel in the area next time.", "title": "Horrible Customer Service & Price Gouging", "user": "angelsiou1", "date": "September 1, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0, "service": 1.0}, "id": 19612787, "likes": {"liked": "— Customer Service"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "I'll mark \"recommend to a friend\" only because there are so few options in the area.", "title": "Can't be a real Hampton", "helpfulness": 1, "user": "qwerttt", "date": "June 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 17165063, "likes": {"liked": "— Staff", "disliked": "— Needs updating to be a real Hampton and charge Hampton prices"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Well, my work send me often to Canton and Jackson area for meetings/workshops and I am going to tell you something, in Canton, this was the best stay I had so far. Clean, Hampton Beds, extremely comfortable, full of fluffy pillows, breakfast as another reviewer said, not the best of all, most continental, not many hot options to choose from, but staff was extremely friendly and I don't know how, but the price they quoted me online, when I got there was even lower! Of course I loved it!!!", "title": "Great stay", "user": "travelman08", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15414436, "likes": {"liked": "— clean room", "disliked": "— workout area"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I had to go to Canton for a training class for work. The front desk clerk was in training and was very sweet. Her supervisor was very helpful in suggesting a couple of good places to go eat. I cannot tell you how wonderful the beds were! Pillow top mattress and a down comforter. Each bed had three pillows on it (I had a double queen room) and a neck pillow. I had the hardest time getting out of bed the next day. The only downside that we experienced was the breakfast. The only hot items that they had were french toast sticks and sausage. The rest were pretty much standard continental items. Overall, I had a wonderful stay at the Hampton Inn.", "title": "Loved Loved Loved The Beds", "user": "MSLILTIS", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6714872, "likes": {"liked": "— The Beds!!!", "disliked": "— The breakfast, but it was still pretty good"}}, {"rating": 4.0, "title": "Clean, comfortable...", "text": "On our return trip home we were not sure of the route we would take so we did not make reservations in advance. We called the Hampton Inn & were told they had 2 smoking rooms available. Once we arrived at the Hampton Inn the clerk at the front desk offered to let us check out the rooms since we all were non- smokers. The rooms were just fine! We appreciated how hospitable the front desk clerk was by not only offering to let us check out the rooms but also she made the effort to give us rooms next door to each other. The rooms were clean, beds comfortable, & the pool area was well kept. The breakfast was a nice surprise! Biscuits & gravy, eggs, cereal, fruit, danish, yogurt, muffins, & beverages. We all had something different & everyone thought what they ate was good. We would not hesitate to stay here again.", "user": "Poor", "date": "August 6, 2006", "id": 5563809}, {"rating": 5.0, "title": "Great!", "text": "I drove from Dallas to Tupelo and this is where I ended up stopping for the night before finishing the drive to Tupelo the next day. Since I didn't have a reservation they were able to get me into a great room. This is a standard Hampton Inn style hotel, nice lobby, great breakfast bar which included hot eggs and sausage. The room was clean, big, non-smoking, as I requested, and all for $64.00 (with AAA discount.) The front desk was extremely nice and was able to point me to nearby attractions the next day (the County Seat of Canton has an old Courthouse and many movies have been shot in the town square). I was happy that I stayed here (on the outskirts of the big city of Jackson, MS) as when I drove the rest of the way to Tupelo the next day I realized this was the last hotel for miles. I picked up a Hampton Inn directory and it said that this hotel just opened in the 1st quarter of 2004 and I believe it because it was so nice & clean. There are 4 or 5 hotels jumbled together along with this hotel on I-55 (BW, HI Express etc), but as usual the Hampton Inn did not disappoint.", "helpfulness": 6, "user": "GoingFunPlaces", "date": "June 8, 2004", "id": 2170678}], "location": {"country": "United States", "city": "Canton"}, "stars": 2.5, "variance": {"poor": 9, "average": 10, "very good": 22, "terrible": 5, "excellent": 37}, "aka": "Hampton Inn Canton", "slim_ranking": 0.125, "description": "Stay at the Hampton Inn Canton hotel during your next trip to Canton, MS. The Hampton Inn Canton is located near downtown Canton and the Canton Film Museum."}