{"user_rating": 4.0, "review_count": 163, "name": "Hampton Inn & Suites Hermosa Beach", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If, like us, you have 24 hours to kill in LA between flights, try going \"off-piste\" and stay in one of the beach resorts rather than an airport hotel. You will have to factor in the cost of the taxi to get you there and back, but in our view it is well worth it. Having been to Manhattan Beach on two previous occasions, this time we tried Hermosa Beach and stayed at the Hampton Inn. The taxi fare was about 25 dollars each way. (A tip for LA taxis - the drivers now rely so much on sat-nav that you need to have the full street address of the hotel, not just its name and city!) Our room was excellent and there was very little traffic noise (despite being located on the Pacific Coast Highway). A ten-minute walk down Pier Avenue brings you to the township of Hermosa Beach, with its pier, beach, shops and restaurants. We would definitely stay there again.", "title": "Recommended as an LA stopover between flights", "helpfulness": 1, "user": "Ceiniog", "date": "November 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120225264}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The Hampton Inn is a very well kept and clean hotel just off the main drag in Hermosa Beach. I chose it for its location to LAX (10 minutes) and for all the city has to offer -- boardwalk, restaurants, and shops. I would not choose this hotel if you are looking for a \"beach hotel\" as it is right on the Pacific Coastal Highway (busy) and is a 10 minute walk to the beach. I will choose it again for my business trips as it offers reasonable prices, clean rooms, and of course for the community of Hermosa beach. I recommend this hotel!", "title": "Very Good Value -- 1/2 mile from the beach", "user": "ToddBu", "date": "October 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119588103}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I would suggest to anyone travelling to Hermosa Beach, CA stay at this hotel. The entire front desk staff was so helpful with directions, suggestions of things to do etc. We were greated each time we came in the door with a smile and a hello. Breakfast each morning was wonderful. Loved being able to set out on the balcony and watching the sunset. FIRST CLASS HOTEL all the way. Will return to this hotel again on next visit to Hermosa Beach.", "title": "Great Hotel!!!", "user": "Stella L", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 1.0, "location": 1.0}, "id": 119549928}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We enjoyed our stay immensely. Erin at the front desk was very kind and helpful with all our questions as we were new to the area, she really helped us feel comfortable. The room was so clean and smelled nice. Beach was so close, and it was nice to have shops and restaurants in walking distance.", "title": "Great Place to stay.", "helpfulness": 1, "user": "TheGenieCa", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118984550}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Breakfast was good, cookies available in the afternoon. What a great place to relax. Looking forward to returning soon.", "title": "GREAT LOCATION", "helpfulness": 1, "user": "GOLDENGIRL054", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118657277}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I've grown fond of the Hampton Inn chain for being clean, solid and dependable at a reasonable price. This property was no exception. My only (slight) reservations about it are; the parking lot is surprisingly small and crowded; and despite the PCH address, it's not on the water.", "title": "Just fine", "helpfulness": 1, "user": "Jonathan A", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117725758}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Everyone was very friendly and welcoming (housekeeping, maintenance, front desk staff), the room we had was large and had the usual amenities (toiletries, hair dryer, fridge, microwave) as well as a FREE high speed interrnet and a small balcony.", "title": "Great value, friendly staff", "user": "schmusimausi73", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117550319}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "The beds were very comfy.", "title": "Walking distance to beach and bars", "user": "ydrone", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 117233910}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The only thing that we missed in the room was a safe.", "title": "Clean and close to the beach", "user": "KevandKaren", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 115939969}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The breakfast was complimentary and plenty to satisfy us - cereal, bagels, toast, pastries, scrambled eggs, home style fries, sausages, tea, coffee, hot chocolate, oatmeal, yogurt, fresh fruit, juice, ...", "title": "Great staff and great location!", "helpfulness": 2, "user": "doglaw", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115850706}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We decided to take a vacation and explore the South Bay beach towns of L.A. and because Hermosa came highly recommended from a friend that has spent a lot of time there and who has a sister that lives in Ranchos Palos Verdes Estates, we decided on the Hampton Inn, Hermosa because of it's ideal location. You cannot beat the location if you plan to walk to the beach, Pier Avenue (bars and restaurants), the Strand. I would highly recommend renting bikes from Hermosa Cyclery. They're super nice there and extremely helpful (see separate review). So we stayed for 5 nights at the Hampton Inn, Hermosa, which worked out well for us because the location allowed us to ride our bikes to Redondo and Manhanttan Beaches to hit restaurants and bars. And it's a lovely ride on the Strand. It's also a nice cruise on the residential streets. The hotel is clean and the staff very helpful. We didn't have the best room as our balcony faced the wall of the vet/pet hospital next door. It kind of made our view very dark and dingy. But not much you can do about that. Our room was clean and the hallways were clean, so that was good enough for us. It was really all about the location. There's a Vonn's supermarket right across the street which is super convenient. It's also 24/7.", "title": "Decent Hotel By The Ocean", "helpfulness": 1, "user": "ardmoreflyer", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 128536599}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "The only issue that I had was I think with the A/C. We ran it constantly to have air movement. My wife doesn't like to leave the balcony door open because she doesn't want bugs in the room. By the last night I was feeling a little sick. My chest and throat were very sore. We were wondering if there was maybe some mold or mildew in the A/C. But that was my only issue. All in all, a good stay and we'd consider staying there again with a better room.", "title": "Great location to explore the area.", "helpfulness": 1, "user": "ber5408", "date": "February 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 125219449}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We did check out the sundeck, it was a good view. However, when we were there the weather was hit or miss and was mainly chilly high 50s/low 60s so no sunbathing. The front-facing rooms have great views, most of the ocean. I'd want one of those rooms. BTW, if you do rent bikes, the hotel does not have a place to lock your bikes up so take them to your room or do what we did and lock them to the drain pipe outside the hotel's garage door.", "title": "Good find", "user": "eljefe20", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 124550403}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I was not initially impressed with the location of this property since it is right on a 4 lane road with strip plazas on either side. But we got out and drove a few miles to Manhattan Beach one evening and were able to walk to Hermosa beach. Don't eat the hotel breakfast- walk towards the ocean and have a great meal in one of the local cafes. The room we were in was adequate- bathrooms could use updating but overall worked fine for the amount of time we were in the room.", "title": "standard - no frills, great deal", "user": "Lcarlson2001", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122385915}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "They put us in Room 423, which is the first room off the elevator. Surprisingly, there was very little elevator noise. The room's balcony opens up to the sun deck, which kind of helped with the street noise. One unsafe thing was there was no deadbolt to the sliding door.", "title": "Clean and functional", "user": "Peter_Smallhill", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122160248}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We stayed here for our time in the LA area for 3 nights. We stayed in the King suite room which was great! We had a wonderful little kitchen area, large room, and fantastic service. The beach is a little far away but the walk was an easy 10 or 15 minutes. Hermosa Beach was clean and nice. A grocery store is right across the street from the hotel and places to eat are close by. The hotel was not too far from the airport but not too close for noise. It is located right on the Pacific Coast Hwy a busy street but no noise was heard in our room. Breakfast was good and the seating area for breakfast was ample. This is not the place to stay if you want to be right in the middle of the LA experience because it is not close to the typical tourist stuff in LA. We enjoyed our stay and will stay here again if we get back to this area.", "title": "Fantastic Hotel!", "helpfulness": 1, "user": "ctwaternut", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115692739}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Pros: Very friendly staff, excellent complimentary breakfast, good parking availability, generous room size, (with queen size beds); most comfortable hotel beds and a super 4th floor sun deck. Although, we had a private balcony, we preferred the sun deck.", "title": "Exceeded my expectations so we will be back!", "user": "SoCalgirl057", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115620270}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Cons: It is somewhat of a trek to the pier/beach if you are walking it, not to mention, it is all up hill on the way back to the hotel. We just incorporated into our exercise routine!", "title": "Great hotel close to the beach", "user": "bscotthome", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114966971}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Also, the hotel is situated on a very, busy street so one is aware of street noise when one is outdoors. I did not hear it when in our front-facing room.", "title": "LOVED IT!!", "helpfulness": 1, "user": "Margarita223", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114735990}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The property was great. We had no complaints at all, except that the parking lot was small (but parking is free). This is a good property for Hampton Inn. It is about 1/2 to the beach and pier. There are shops and restaurants there. Our 3rd floor balcony had a view of the Pacific, but not the sand. We thoroughly enjoyed it.", "title": "Great location, so-so customer service from front desk", "user": "Ariel519", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 2.0}, "id": 113321325}], "location": {"country": "United States", "city": "Hermosa Beach"}, "stars": 2.5, "variance": {"poor": 4, "average": 14, "very good": 71, "terrible": 3, "excellent": 71}, "aka": "Hampton Inn & Suites Hermosa Beach Hotel Hermosa Beach", "slim_ranking": 0.285714285714}