{"user_rating": 4.0, "review_count": 217, "name": "Hampton by Hilton London Luton Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Excellent all round hotel. Although close to end of run way still fairly quiet. You have to pay for car park however at £5 per day. Very good for location as you can get to London with 30 minutes or so by train. This is a new hotel so cleanliness is very good and condition of rooms excellent.", "title": "Hampton by Hilton", "user": "Jeff D", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159138479}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Hotel appearance is nice, had that new paint smell that I didn’t lie. rooms are clean but not very well decorated, very white, no curtains, just blinds. If you can eat out of the hotel, please do so. The choice and quality is poor and the price you pay for it is a joke. staff were nice but didn’t have any reason to speak to them. no table service, no room service and no bath! To say it is OK is the best way to sum it up.", "title": "Clean but no frills", "helpfulness": 1, "user": "Gary F", "date": "April 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 170168087}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed for one night enroute to family gathering. Everything was excellent. Nice big roomy accomodation and very quite despite being at the airport. Easy to get on to the roads/motorway. Plenty of parking but you do have to pay - special rates for residents.", "title": "One night stay", "user": "Mary B", "date": "April 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170165186}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "I have stayed at this hotel three days a week for the last 8 weeks and it really is a little gem as someone earlier called it.", "title": "All you need and more", "helpfulness": 2, "user": "Candice R", "date": "April 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158510699}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The gym, the free wifi and the cheap car parking all make this the place to be compared to others on the same road.", "title": "Perfect", "helpfulness": 2, "user": "Ashley G", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158194688}, {"rating": 5.0, "title": "Great location, great features", "text": "Stayed one night in April before an early flight. The hotel is located at the station so no travel was needed and check in was smooth. The room and the hotel is geared up for business travellers clearly so the multiplicity of plugs was welcome. Especially the one next to the bed for that overnight phone charging. Room was very well appointed and very comfy. Its not a hotel for staying a week as the location is a bit industrial. But commuting to London daily could not be easier and Luton Parkway connects to Kings Cross in 20-30 minutes. Breakfast was a little average but the tables and breakfast room were good. And a £3.50 cost added to your bill and a taxi ordered for the 5 minute transfer to the airport. Fab. All in all, well done for this place guys. Loads better than the others nearby.", "user": "Mike G", "date": "May 4, 2013", "id": 159595302}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My wife and I stayed recently (April 13) at the hotel for one night B&B and left the car there (£5 per night) for 6 nights while we travelled abroad. We booked and paid prior to our visit via Holiday Extras. Unfortunately the stay didn't get off to the best of starts when we checked-in to find they had no record of our Holiday Extras booking! Thank goodness the hotel wasn't full and they were able to find us a spare room ! The manager later confirmed that there were problems with Holiday Extras bookings as the hotel had a new account with them.", "title": "Excellent but for one thing....!", "user": "sfe15", "date": "April 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159278374}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We asked for a high quiet room and this (room 345) turned out to be of exceptional cleanliness and quality. This room was at the front of the hotel and we didn't hear a single sound of any aircraft or trains all night!", "title": "Great value on a Saturday night", "helpfulness": 1, "user": "adwright", "date": "April 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "service": 5.0}, "id": 159182307}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The room was well equipped with teas/coffees (coffee taste not so great!), 32\" Samsung flat TV, iron, hair dryer, soaps etc. The linen was pristine white and the twin beds wide and extremely comfortable.", "title": "New hotel. Recommended for airport stay if you have a car.", "user": "Josi S", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159136336}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Due to the reservations we had as to the quality and choice of menu offered by the hotel (burgers, sandwiches etc,as referred to in previous Tripadvisor reviews) I found a well-regarded Italian restaurant nearby. We walked 12 minutes to La Dolce Vita and had a terrific meal there with wine. Excellent ! On our return to the hotel that evening, we were congratulating ourselves that we had by-passed the hotel's own limited menu only to find La Dolce Vita's menu available! When we enquired, one of the hotel's staff informed us that we could have had a meal from L.D.V's menu at the hotel and at a 10% discount from their menu prices as well !! I don't know what arrangement the hotel has with this Italian restaurant or how long meals take to be delivered etc (presumably wines aren't transported!) but I would strongly recommend guests of the hotel to check out the arrangements as the food was excellent.", "title": "Great Luton Airport Base", "user": "Kenneth M", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159253508}, {"rating": 3.0, "title": "The rooms are all new but the food??????", "text": "Stayed here while on buissiness so glad I am not paying for it!! Rooms are very nice,modern and new, location is good for the airport (via taxi ), but overall found the place very soulless,made the mistake of eating here one night it is over priced and rubbish what's not to like about burnt but cold steak pie and chips!! In short nice rooms but do not eat here!!!", "user": "Be_lucky101", "date": "May 9, 2013", "id": 160192289}, {"rating": 3.0, "title": "Good for an airport hotel", "text": "First, I'll say that I usually avoid airport hotels at all costs. But given the location of our regional office I have no choice but to stay in the area when I visit. This is my second stay at this hotel and while it's still new and better than most airport hotels, it still feels like a cheap imitation of a real Hampton Hotel.", "user": "The_Doyenne", "date": "May 8, 2013", "id": 160106896}, {"rating": 4.0, "title": "Happy at the Hampton", "text": "THE GOOD: One of the nicest hotels in the area. Located within walking distance of the commuter train station. Although it's located close to the airport they've done a good job of soundproofing against airplane noise.Rooms are generally clean for an airport hotel, but not quite as pristine as other Hamptons. Breakfast was nice with hot and cold options, and none of the food was allowed to sit in the warming pans for too long. Really good selection of television stations. Seriously, this matters after you've stayed at a London hotel where there were only four free channels and one was dedicated to airing Big Brother. Only Big Brother.", "user": "lizbuff", "date": "May 7, 2013", "id": 159979846}, {"rating": 4.0, "title": "Very convenient", "text": "THE NOT SO GOOD: The staff are generally friendly but not terribly knowledgeable about things like the cost of local phone calls, or whether the train station next door takes credit cards. Perhaps this wouldn't be such an issue if the in-room guest services and visitor information guide books had any sort of detailed information. None of the staff had any clue about wifi connection problems, specifically about how to connect an iPad or iPhone to the wifi. It took me hours of testing and Googling to sort it out. (Here's a tip: DO NOT connect to hhonors. Use the BTOpenzone.) Finally, they don't offer free or retail items like extra toothbrushes or shower caps. I can't remember the last hotel (especially a Hilton brand hotel!) that I stayed at that didn't offer these items.", "user": "Doyia", "date": "May 7, 2013", "id": 159972065}, {"rating": 5.0, "title": "A classy clean, lovely friendly staff and guest.", "text": "I do recommend the staying here, but don't expect the typical Hampton experience.", "user": "TaiandJade", "date": "May 5, 2013", "id": 159701112}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Really great rooms, and a lovely shower. Clean , all mod cons, wifi and very very comfy beds.", "title": "Agree with previous review- great rooms, average breakfast", "user": "pugwash4x4", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 161008312}, {"rating": 5.0, "title": "my hampton experiance", "text": "Well worth the reasonable price and an excellent night fir business or any other use. Seemed to be a lot of people on way to airport.", "user": "A TripAdvisor user", "date": "May 15, 2013", "id": 161291479}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Breakfast decidedly average- cooked breakfast not great, pastries not of great quality", "title": "Great rooms, average breakfast", "user": "Serial_Dealer", "date": "May 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160526638}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "it was excellent, the room where clean and comfortable, the staff well trained and very helpful, the breakfast was excellent with different tipes of food to chose fro according to your taste, i really enjoyed my stay, i would recommend to anyone to stay there.", "title": "Excellent overnight stop", "user": "bhramblejelly", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160431947}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Hotel is quite new and it adds the quality to the accommodation. Bed was comfortable and allows for good sleep. Bathroom was perfectly functional. It is close to the local railway station, thus you should simply check the connections and move with no hassle even to Cornwall.", "title": "Where to start ?", "helpfulness": 1, "user": "ViICTORIA1", "date": "May 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 160402945}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 7, "average": 21, "very good": 75, "terrible": 9, "excellent": 105}, "slim_ranking": 0.153846153846, "description": "Welcome to our Hampton by Hilton London Luton Airport hotel. Ideally located close to London Luton International Airport (LTN). Enjoy discounted transfer service from Luton Airport to the Hampton by Hilton hotel. A discounted rate of £3.50 will be charged to your hotel bill upon arrival. To benefit from this special rate, please use a LUTON TAXI from the airport taxi rank. Situated adjacent to Luton Parkway Train Station, with Direct Access to St. Pancras International Station, our Luton airport hotel offers easy access to Central London - 25 minutes away."}