{"user_rating": 4.5, "review_count": 1113, "name": "Hampton Inn Orlando/Lake Buena Vista", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Finally a quiet hotel in Disney World. It was clean and nice. You can't beat a free breakfast. We are converts from Marriott that's for sure. I am VERY pickey so if I was pleased anyone would be. My only complaint is that the sheets are a little too narrow. Maybe two 11 year olds can't share a bed. :( The room was a little too small to request a roll away. Over all it was very good. They even have a refridgerator/ freezer!", "title": "Disney Trip", "helpfulness": 4, "user": "Sheri904", "date": "August 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 136806435}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We were there for 1 night only but had a great time. Its only 5 minutes drive to downtown disney which made it so easy for us. Great staff, clean rooms. Cant wait to go back again. Thank you Melissa and front office team. Keep up the good work.", "title": "Great Hotel- Great Staff", "helpfulness": 5, "user": "Amar J", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136758121}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel was clean. It looked like it had been newly renovated. The staff was friendly and helpful. We loved having a refrigerator in our room. The breakfast was wonderful. The Hampton Inn's are where me and my family love to stay.", "title": "Hampton Inn near Walt Disney", "helpfulness": 6, "user": "Jennifer C", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136192386}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I have stayed here 2-3 times now and always leave with a good feeling.", "title": "Excellent staff, clean and well located", "helpfulness": 4, "user": "CoasterWarrior", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 136070061}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The hotel is very well kept with new and clean carpets and a nicely appointed overall facility. As usual, my room had a good flat screen, shower, fridge and was very clean. The staff made me feel so welcomed even going into the back to get me a cookie (which I love).", "title": "Wonderful stay for vacation", "helpfulness": 6, "user": "Ben C", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136053053}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed here when we visited Disney World and Sea World and absolutely loved it. Great hotel and very reasonably priced compared to others in the area. Very clean with complementary breakfast. Staff very accommodating. No complaints, and we've stayed here about 4 or 5 times. Definitely recommend this hotel for anyone visiting Disney or Sea World.", "title": "Simply the Best!", "helpfulness": 6, "user": "CissiK", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137169548}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Our stay at the Hampton Inn was awsome!!! The room and linens were VERY CLEAN! The bathrooms were impecable. The complimentary breakfast was very, very good! They had scrambled eggs, bacon/sausage, assorted breads & muffins, cereals & juices, and the Mickey waffles!! Also they have fresh coffee in the lobby around the clock! The pool & hot tub area is very clean and they provided pool towels which is a nice touch. The only downfall is the hotel transportation to the parks. DO NOT TAKE THE BUS!!!! They were late to pick us up by 45 minutes & we have 2 small children. The buses are cramped and unreliable!!! The Hampton is a 10 minute drive to all the Disney parks and even closer to Seaworld. Use your car and be more comfortable!!! Overall, we loved our stay & highly recommend to our friends and family....We will be back again BUT NOT ON THE TRANSPORTATION !!!", "title": "Awsome hotel & breakfast...TERRIBLE TRANSPORTATION!!!", "helpfulness": 6, "user": "ESALEXMiami", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137118683}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed here 2 separate nights during our vacation. The room was VERY clean and we loved that all bedding (sheets and duvets) is laundered daily. The breakfast (especially the Mickey waffles) was something we always looked forward to. We were able to easily use the computers in the business room to print out our boarding passes. Alyssa at the front desk always had a smile on her face, was great to talk with, and helpful in every way. We will be back again!", "title": "Lake Buena Vista Hampton-Excellent", "helpfulness": 4, "user": "20Christine12", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137017153}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Overall cleanliness was great, great service from all hotel employees, very nice facilities (gym, pool, dining section), great complimentary breakfast, great location, super close to theme parks and other great attractions, overall a great experience in the hotel, highly recommended.", "title": "Very clean, very new, and great location, very centric.", "helpfulness": 6, "user": "nzonz0", "date": "August 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136996692}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Hampton Inn Lake Buena Vista was perfect for our visit to Orlando. Clean rooms, exceptional service and a tasty breakfast! Great value! We will definitely stay at this hotel on our next trip to Orlando.", "title": "Close to Disney!", "helpfulness": 4, "user": "Luv2planVacation", "date": "August 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136965018}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My husband, daughter and her boyfriend and I stayed here in August, 2012, for two nights. We have been here before, and this is one of our favorite Hampton Inns. The staff is outstanding, especially Elizabeth and Alyssa at the front desk. They are friendly and helpful. Thank you, ladies! The hotel will be undergoing a renovation. It will be finished sometime in November. Changes will be in the rooms and in the public areas. The rooms are always clean, including the bathroom. The bedding is almost like a cocoon--so-o-o comfortable. We appreciate having a fridge in the room. You can buy tickets for area theme parks at a booth in the lobby. If you are looking for a hotel near all of the Orlando attractions, please try this Hampton Inn.", "title": "Welcoming Hampton Inn", "helpfulness": 5, "user": "SandyT101", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137928918}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We booked this hotel for one night, precruise. We arrived at the hotel before 10am and the staff was kind enough to allow us to checkin early. We even managed to snag breakfast, it only runs til 10am but they didn't really tear down until 1030am. After eating, we grabbed our bags from the car and headed to the room. We were placed in a room with 2 queens, not 1 king like our preference. My husbands stays in hamptons almost every single week for business and has his Hilton diamond preferences set to always get a king bed. When we called down to the desk to ask for a king room instead, the girl on the phone made it sound like it was our fault for reserving the wrong room. After some extensive discussion we were given a different room, their last king available which was a handicap accessible room.", "title": "Mostly pleasant experience", "helpfulness": 1, "user": "lasvegasjunkie", "date": "August 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137923702}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We took the hotel's free shuttle to Epcot at 1130am. It was a couple minutes late but was a nice large airconditioned bus. The return shuttle was supposed to pick us up at 10pm but we got tired before that and took a cab back to the hotel. We decided to soak in the hottub for a bit before heading to bed. Unfortunately the temperature in the \"hot' tub was only slightly warmed than the pool. It was a big disappointment, and I asked the staff at the desk about it and they said it was set to it's highest temperature.", "title": "Great Location!", "helpfulness": 1, "user": "TrvlingMyBucketList", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137878301}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This Hampton Inn was located right off I-4 across from SeaWorld and the Premium outlets, on a quiet road where there was no road noise. The hotel was definitely busy with lots of tourists and school groups heading to the parks, so if you're NOT looking to go to the amuesment parks, this wouldn't be a good place for you. Get to breakfast early if you want fresh, hot food! Otherwise it wasn't as great as other Hampton Inns where I've stayed. The rooms were clean and decent, but not huge. The housekeeping staff was great, very friendly and would go out of their way to assist you if you had any requests. Definitely a great family friendly, affordable place to stay when visiting Orlando.", "title": "Very pleased!", "helpfulness": 4, "user": "Ruth L", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137691516}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This was our family's second time staying at the Hampton Inn. We were very pleased both times. The rooms are very clean and the staff is friendly. Our kids loved the pool (which was", "title": "Great Hotel!", "helpfulness": 5, "user": "SylviaSidoravicius", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137628043}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "One of the best things wasthe large supermarket across the street. The rooms and the hotel were clean and quiet. One of the pools was a little bit shallow and small. Not the best for training. Rooms were of two different sizes, one with jaccuzi tabs, which was not really necessary. Gas grills were available across the compound. The parking was easy well around the compoud.", "title": "the best time ever", "helpfulness": 3, "user": "screenname060309", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138509041}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "this is the second hampton in that I visited and I cant regret the first one was at sarasota and this weekend (with the storn isaac on the watch)at orlando,fla.", "title": "excellent service and confort at every city", "helpfulness": 4, "user": "volts753", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138469934}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "the room clean , well decorated, bed confortable and the best: coffee and tea on the room.", "title": "Great value but breakfast and beverage service was lacking.", "helpfulness": 4, "user": "Lacheng", "date": "August 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 138369833}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Free breakfast and excellent food.", "title": "Nice room in a great location", "helpfulness": 4, "user": "svadeba", "date": "August 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 137985793}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "security good, they have back doors but the only way to access is with the key", "title": "Good and affordable choice near DisneyWorld", "helpfulness": 7, "user": "John S", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137929338}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 21, "average": 78, "very good": 336, "terrible": 15, "excellent": 663}, "aka": "Hampton Inn Orlando/Lake Buena Vista Hotel", "slim_ranking": 0.0699088145897, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}