{"user_rating": 3.5, "review_count": 66, "name": "Hampshire Hotel - Emmen", "reviews": [{"rating": 4.0, "title": "Comfortable, well-located City Hotel", "text": "Well-located hotel with comfortable rooms and a pretty good restaurant. Walking distance to the zoo and the town centre, which has a choice of eateries and bars. Close to Emmen station as well, 15 mins walk or 5 mins by cab.", "user": "sankar", "date": "May 18, 2010", "id": 64479754}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "This was earlier the 'Giraffe Hotel' so the jungle/zoo theme is still visible throughout the hotel. There are also some theme rooms (one person in our group got a 'Japanese Theme' room). Thankfully I had the standard room which was quite adequate. Decent size with a large bathroom with separate shower enclosure.", "title": "Standardrooms are poor", "user": "memberHolland", "date": "April 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 62179801}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The breakfast choice is pretty much standard Dutch. Sufficient but nothing to write home about. Dinner is pretty good, though a tad expensive. Like I mentioned, there're lots of other restaurants close by. There's a free internet terminal in the lobby. Wifi available in the rooms and access is through T-Mobile prepaid cards available at reception. Cost was around €5/hour.", "title": "Sad theme hotel", "helpfulness": 2, "user": "My-View-on-things", "date": "September 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 43137037}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Emmen has limited hotel options - The Van Der Walk hotel is a little better in my opinion, but located too far away and in the middle of a noisy motorway. Overall, I'd rate this the best place to stay in Emmen.", "title": "Great Hotel", "helpfulness": 1, "user": "ECUPirate", "date": "March 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14131247, "likes": {"liked": "— fitness center"}}, {"rating": 4.0, "title": "Very appropriate stay", "text": "We booked two standardrooms in april 2010. These were rather poor. One broken lightbulb, a hole in the hose of the hairdryer, a termostat valve with a broken cut-out and a not-working remote control. The bathrooms were rather old with only a shower and the furniture, except the beds, was shabby. There is a railroad with the accompanying noise within 100 meters of the hotel. The breakfastbuffet was good, with a lot of variety, especially fruits. At arrival the rooms including the bathrooms were really cold because the heating had been put off.", "user": "Biophile", "date": "January 13, 2007", "id": 6588698}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I stayed in this hotel for 2 weeks on business. The rooms we spacious and clean. Though my room had two single beds pushed together. However, this maybe a Dutch hotel thing as I've experienced this regularly in Holland. There are over 30 TV channels available in a number of languages. There are 3 restaurants to choose from, with differing styles of food and hence differing standards as well. The standard ranges from good to average. The staff are very friendly and helpful, though the service can be a bit slow. There is also access to a sports centre, which has a number of squash and tennis courts and regular fitness classes. The hotel can give you a special price for some of these. The hotel is located 5-10 minutes walk away from Emmen town centre and Zoo. I would say that in any other country this hotel would be regarded as average, but for Holland it is probably above average, mainly due to the politeness and friendliness of the staff.", "title": "Friendly service", "user": "Murph35", "date": "October 24, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6005155, "likes": {"liked": "— The Staff", "disliked": "— Slow service in restaurant"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "We arrived late,on a hot summer night; the room was very stuffy and the first thing I did, was looking for the aircondition switch; well, it was not there: no aircondition in the room; so, next best thing: open a window: for some cool evening air:not a good idea, I soon realised, as the band was still enthousiastically playing downstairs, even though it was way past 11.00pm; well I may as well have a cool drink instead! Upps! No fridge in the room, not even to cool our own drinks and perishables, which we brought; hmmm, we were tired from a days travel and just wanted to sleep; so we ignored the noises outside and did indeed fall asleep, till some very keen cleaners entered our room in the morning, no knocking or so and way before we had intended to get up;by than we started to feel somewhat frustrated, which was not helped at checkout time as there was a long line of others, also wanted to check out as well; more staff at reception would certainly been helpfull here.", "title": "A giraf and weary travellers do not mix", "user": "clogman", "date": "July 31, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 5531204, "likes": {"liked": "— Plenty of parking space", "disliked": "— No aircondition, No fridge, to much noise from the band late at night."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "This is a really good hotel ! De Giraf is not only the name, but everything in it is also the giraffe.The interior has giraf spots or it is influenced by other animal signs. The people in the hotel are really friendly, the quality of the food is really great, not to mention the quality of the room. The hotel is strategically situated as the zoo is less than 1 km distance just like the shopping area and the tropical swimming pool. Did I mention that there is more than enough parking space that is also free of charge? Normally I mind childred in a hotel \"disturbing\" my restly moments during breakfast or dinner, but this hotel is child friendly that there are playgrounds inside the restaurants for the children or there are animators who take time for the children so that the adults can enjoy their meals. So in one way.... big compliments.", "title": "Excellent Hotel!!", "helpfulness": 1, "user": "Biru", "date": "April 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4997540}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Emmen"}, "stars": 4, "variance": {"poor": 10, "average": 18, "very good": 26, "terrible": 1, "excellent": 11}, "aka": "Best Western Emmen", "slim_ranking": 0.75, "description": "Hampshire Hotel Emmen is a four star hotel located in Emmen (Drenthe), The Netherlands. The hotel has 83 hotel rooms, 2 large event rooms (which can facilitate up to 2500 people), 11 meeting rooms, broad sport facilities containing five tennis courts, three squash courts and various fitness facilities. The hotel offers free Wi-Fi, free parking spaces, a bar, restaurant, roomservice, a terrace, laundry service and it is located near the city centre. Certified with the Silver Green Key."}