{"user_rating": 4.5, "review_count": 618, "name": "Hampton by Hilton York", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This hotel really is well located, ideal for parking (£10 for 24hrs, £2 on the street 18h00 - 08h00 but watch out for wardens after 8h30!!). The hotel is new and therefore has a few 'issues' which I am sure will be resolved in time. Our main problem was non functioning air con during our stay in July. It was 27° outside and about 35° Inside. We foolishly thought that the room would get cooler as the air con setting only goes down to 19°. It didn't. In fact, it was blowing out hot air and we Windows did not open. We should have been offered a different room when we complained that morning - or perhaps I should have insisted. Instead, after two unsuccessful visits from the technician, we moved rooms the following evening to a blissfully cool room on the 5th floor. Tip: Avoid room 219 and if the room does not cool, insist on being moved straight away!!! The breakfasts were fine and predictable though the peak time of 8h15 - 9h15 must be avoided. The room is too small and the furniture not suitable for breakfasts (heavy chairs and tables). Many guests simply give up waiting for a free table and the atmosphere is chaotic. The staff do their best but they can only work with what they have. On the other hand the quiet period after 7.30 is fine. The room is well appointed though it could do with a mini fridge. The sliding door seving both the wardrobe and bathroom is also a bit strange and inconvenient if one person is sifting through the cupboard when the other wants to get out of the bathroom (ooch!). On the whole the hotel is probably a good choice, when all things function.", "title": "Well located hotel with a few issues", "user": "BillParis", "date": "July 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 169837521}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The final hotel on our ride to York from London and what a pleasant surprise this was. It was the cheapest hotel of the weekend and definitely the best. The hotel is spotlessly clean, the rooms are really well appointed, the service was excellent and the breakfast was great, a full choice from cereals, pastries and full English.", "title": "Great hotel, close to city centre and York Station", "user": "iamwedgie", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169518031}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Its only a short walk into the city centre and is really well situated for arrival and/or departure by train.", "title": "Brilliant hotel, central, clean and parking discounts!", "user": "clairewyorks", "date": "July 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 169464969}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Stayed here on a Saturday night this month with a friend in a double room with a double bed, sofa bed (proper one with a spring mattress) and a large bathroom with shower. We were on the ground floor and our room over looked a car park and offices.", "title": "Well located and efficient hotel", "user": "Rick S", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169379358}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Our room had coffee and tea making facilities, iron and ironing board, extra bedding and hair dryer and flat screen tv.", "title": "A great hotel", "user": "shepherrd", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169328876}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at the Hamton by Hilton in York 22/7/13 -26/7/13. Bit concerned about the reviews re noise from nightclub But when we arrived it had all been triple glazed and the nightclub in question had closed! The hotel only opened in October 2012 so is very new and this is reflected in the decor, furnishings etc. The staff were excellent - nothing was too much trouble.We went to breakfast at about 7am and so missed the crush that other reports said was aproblem - we were often the only ones in the restaurant!! Cooked breakfast available each morning with cereals etc included in proce of room, Cooked breakfast always consisted of same items - always sausages, bacon , scrambled eggs, tinned tomatoes and beans. Hotel spotlessly clean - super toiletries provided free. Close to station and within the city walls excellent location. Will definitelt return = of all hotels we have stayed in in York this has ben the best value for moey by far. We had a great holiday. Thankyou all staff at the Hampton by Hilton in York Wendi", "title": "much better than anticipated", "user": "WendyLowestoft", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169275359}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "While traveling in England and Scotland my wife and I stayed at this Hampton and found it to be in a perfect spot. It's very close to the railroad so we walked over and back to the train station when we moved on. A perfect spot very central to all York has to offer and the weather's been exceptional. We used the gym a lot, it has nice machines and TV's. The breakfast's have been very good although the juice and coffee we found to be watered down. The fruits, eggs, meats, beans and tomatoes great . Within walking distance there are loads of great places to eat. All types of food and prices. Overall this is a wonderful place to stay.", "title": "Great location near everything", "user": "Richard F", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169110970}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Spent 2 midweek days here with my wife and 3 year old boy.Good friendly check-in from the girls behind reception. We had a room with a sofa bed which my little boy loved 2 good nights sleep. Breakfast was busy on the Monday about 9am but was expecting it to be after reading reviews on here. Went down at 8am the next day only a few in. Cooked Breakfast was good. All in all great hotel will recommend to friends & family.", "title": "Family break", "user": "Jambo1978_13", "date": "July 25, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 169047736}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "nice hotel, breakfast very good, parking not so good will cost £10.00 per day to park with your ticket being stamped by the hotel reception, some limited parking outside the hotel free with a disabled badge. It would be nice if the hotel did evening meals.", "title": "short stay", "user": "Teresa H", "date": "July 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 168940537}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Great place close to the center of town. Car park right down the road. Staff was friendly, informative, and helpfull. The room was clean with a nice layout. Nice continental breakfast. Would stay again and recommend to others.", "title": "Lovely stay in York", "user": "TravelingLauraM", "date": "July 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 168813712}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Extremely good service and quality of hotel - helpful location, parking, amenities and knowledge from the breakfast staff to help ensure I maintained a gluten free diet due to coeliac disease. The Hilton was easy to find and very reasonable price.", "title": "Hen Weekend", "helpfulness": 1, "user": "Angie D", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168662807}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We were so happy to have found this great hotel in York. The hotel is very clean with lovely bedrooms/modern bathrooms. The location is also great with a 5 min walk into the city. The breakfast is good, the big disappointment is the hot drinks machine. I enjoy fresh coffee and this milti drinks machine does not deliver!", "title": "A great find", "helpfulness": 1, "user": "melsian", "date": "July 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168433865}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I would like to mention 3 members of staff who are/have been extremely friendly and helpful to us during our stay and they are Danny, Anthony and Abdalla - each one of these members have staff made our stay very pleasant indeed.", "title": "Enjoyable Stay in York", "user": "HPfans", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168320219}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "All of the above are very professional.", "title": "Lovely Hotel great staff!!", "user": "sanfran", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168317353}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Well situated modern non-smoking hotel in York. Excellent proximity to major local attractions and within walking distance to train station. Helpful hotel staff. Rooms were clean, modern, with comfortable beds. Our room on the main floor easily accommodated our family of four although the second bed was a hide a bed. Wide variety of both hot and cold breakfast items. Lovely lounge area with computer access, Wi-Fi included with rate.", "title": "Great value", "user": "elizScotland", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168222772}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I stayed at this hotel on the recommendation of a work colleague, mainly because in the heat the hotel is modern and has great air conditioning in the rooms. I arrived by car and as there is no parking on site this can be found just down the road and you get a preferred rate when you get your ticket validated by reception. The check in was efficient, welcoming and I was made to feel welcome. The rooms are a large, very modern, comfortable and clean. For an evening meal I would suggest going out as the snack menu is a bit limited but for breakfast there was plenty to choose from. The hotel is well situated for the city and close to most attractions. I will definitely be staying again.", "title": "Modern, clean, welcoming", "user": "LillyP66", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168198250}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Had a most enjoyable stay at the Hampton and am surprised to see that some people found fault with this hotel. For a 3 star rated hotel I found the facilities second to none.", "title": "Very good hotel", "user": "Rob G", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168192675}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The location is ideal and is the reason I left my car at home and took a relaxing train journey to York. I have stayed in one or two hotels in York and found the Hampton to be among the best. The staff were very friendly and helpful in providing suggestions on places to visit and somewhere to eat. The hotel was very busy but the breakfast was well cooked and although the breakfast area was busy the ground floor is significant with ample facility to sit and enjoy the meal.", "title": "Hampton by Hilton York", "user": "Duncan M", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168014807}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The Bar/recreation area offered what I thought was a very reasonably priced menu offering snacks and drinks at affordable prices comparable to the cafes in the area", "title": "More than a great location", "user": "lwh3", "date": "July 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167924257}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "In my book the Hampton is a well deserved 3 star hotel.", "title": "Modern and friendly", "user": "modelbox", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167893069}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 5, "average": 43, "very good": 227, "terrible": 4, "excellent": 339}, "slim_ranking": 0.170212765957, "description": "The Hampton by Hilton York is five minutes’ walk from York railway station in the heart of the historic city centre. Stay in a cosy guest room and sleep well on a comfy Hampton bed©, staying connected in your guest room with free high-speed internet access. We also offer a range of amenities to make your stay more enjoyable. Start each day with Hampton’s free hot breakfast."}