{"user_rating": 4.0, "review_count": 76, "name": "Hampton Inn Philadelphia / Bridgeport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "We like Hampton Inn, and this one was outstanding. The staff could not have been more helpful. Their concern was noticeable even to some relatives who came to meet us in the lobby! Thank you all!", "title": "Wonderful, welcoming staff", "user": "Margaret D", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119645434}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The Hampton Inn, Swedesboro, has opened it's doors to Agility exhibitors for the Gloucester County Dream Park trials, and it is truly a God send. The rooms are lovely, clean and spacious with fridges and mw's. The staff go out of their way to accomodate guests, and the breakfasts are wonderful. The woman who makes/serves breakfast is incredibly upbeat and accommodating for 6:00am! As always, we take extra care to use our own sheets on the furniture so our dogs do not soil anything and always bring towels to wipe wet feet. The grounds are lovely. Lots of good restaurants within minutes.", "title": "We always love coming back!", "helpfulness": 1, "user": "treeturner", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117986759}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "Like Hampton Inn's because one can usually count on the quality and cleanliness... disappointed this time. Called earlier in the day on the day of our arrival to notify them we'd be checking in late that evening and to ensure the handicapped accessible room we'd requested would be available. After some confusion regarding an accessible room with the number of beds we needed (2) not even existing at that hotel we said we'd take the accessible room with one bed and a sleeper sofa and were assured we'd get that room no problem. When we arrived later that evening we were informed that due to an \"emergency\" because of the recent flooding in the area all the accessible rooms were taken and we wouldn't be getting the room they promised us earlier in the day, however, they were giving us a suite for the same price. We were tired, it was late, so we accepted. We went up to the room and neither key worked. So we went back down to the desk and ran into the desk clerk on the way who as bringing us up towels (which I thought odd since we didn't ask for extra towels) She let us in and we sat for a few minutes in the living room area while we called home. When I went in the bathroom a few minutes later I found used soap and shampoo in the shower and a used towel as well. Then in the bedroom area neither bed had the customary duvet... just blankets and the one blanket had holes in it! The beds were definitely not made up properly nor up to Hampton Inn standards. I phoned the front desk and asked if the room had actually been cleaned and the clerk (a different one from the one who checked us in) said \"I sure hope so.\" I explained the conditions we'd found and she offered to move us to the adjoining room. At this point it was after 11:00 pm we'd already changed into pajamas and I asked if she'd just send up a new blanket to replace the one in with holes. She said she would and also said she'd remove the charge for that night. She brought up a duvet and more towels and again assured us she'd remove the charge for the room. After she left we then discovered a large wet area on the rug in the bedroom area. Definitely the most disappointing stay I've ever experienced at a Hampton Inn property.", "title": "Not the best stay I've experienced...", "user": "the-way-2-go", "date": "September 10, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 117887792}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I have stayed at this hotel quite a few times. Spent 4 days here this trip and I feel the hotel needs a shake up. I was in a king bed suite and basically it was a nice room. I got there and checked in on a Thursday evening. The front desk people were not the nicest I remember being there. Upon going to my room, I found there was no folding suitcase holder. I called the front desk and they said it was in the closet. Checked and there was none. Next morning, I inquired about getting one and was told one would be there when i returned. I returned that evening and none was found again. Called front desk and asked for the manager. He sent one up in 10 minutes. Lots of trouble and effort for something that should be in the room anyway. Breakfast was anemic. Will not go back there anymore.", "title": "Going downhill...", "helpfulness": 1, "user": "FrankKiv", "date": "July 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 2.0, "service": 2.0}, "id": 115263613}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had a very comfortable mattress, the room was clean, and the parking was close to the door. The morning free breakfast included, waffles and syrup, freshly made egg and cheese omelettes, many flavors of yogurt, fresh oranges, multiple kinds of toast, bagels, and biscuits, fresh danish, coffee, juices, cereals, etc.", "title": "Everything was excellent", "helpfulness": 2, "user": "JoshuaMConnecticut", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110638894}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Stayed here one night on business. First Impressions are great - beautiful lobby, seating area, and fire place. I would have given it a Very Good Rating, but the room did not have any large towels (I noticed after my shower) and the shower head was not secured to the wall. There was also water damaged above the desk area, but it looks like it was not covered up very well. With that said, it is still the place I'd recommend staying and if I go back to this area I would stay again. The breakfast was good and the staff very friendly and welcoming. There is no bar, but you can walk to the Holiday Inn next door that has one (but we wouldn't stay there).", "title": "Best Hotel for this location", "user": "ohiocouple", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 124622370}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Stayed here multiple times this year for business latest being in Oct. Staff are always nice and helpful. The price is very affordable (especially with a company rate), the property is well maintained and clean.", "title": "Clean and comfortable", "user": "Domer130", "date": "November 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 120595340}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "There is not much in the Swedesboro area, but as a nightly oasis for the business traveler the", "title": "Good suburban business hotel", "user": "gf2020", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119953476}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Hampton Inn Philadelphia / Bridgeport doesa a pretty nice job. The facility is in good shape, the rooms are fine, the staff is pleasant. Pretty much everything you could want. There is no food service beyond the complimentary breakfast but it's a short walk to the bar at the Holiday Inn next door or there are a few chain restaurants within a short drive.", "title": "Good ... not great", "helpfulness": 2, "user": "Adam W", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119799441}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I'm just going to make this as simple as possible with a list of pros and cons.", "title": "Terrific staff, very accommodating.", "user": "DannyOnTheGo", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 119691257}, {"rating": 3.0, "title": "Good Location...bit run down", "text": "We had a one night stay, a stop on the way to NYC. The location is right off the NJ turnpike, which makes it very convenient. It was close enough to Philly, that we were able to go into the city and grab some Philly Steaks prior to check-in...only about 25 min drive...", "helpfulness": 1, "user": "tcordero", "date": "March 31, 2011", "id": 102253293}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Check-in was smooth, maybe 2 minutes. The room however was showing some signs of wear...not the cleanest place, but clean enough. The free breakfast was a plus...as was the price...", "title": "Great staff, comfortable accomodations", "helpfulness": 2, "user": "Miss_M_10", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 91138083}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "We arrived at this hotel on Christmas Day, just in time to ride out the big blizzard. Staff went out of their way to make sure we were comfortable and taken care of. The rooms were nice, the free breakfast well stocked. This was a very well run hotel.", "title": "Much Nicer than its neighbor Holiday Inn", "helpfulness": 2, "user": "FrankKiv", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80281343}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Just spent 3 nights at this hotel. Second time I was there and its still the same. Very comfortable, clean, no smoking and very friendly personnel. Breakfast was a little anemic but tasty. Bed was a King and very comfortable AND no bedbugs!!! i would stay here again and again. Much nicer than its neighboring Holiday Inn. All in all, money well spent.", "title": "Looking forward to our next visit.", "helpfulness": 1, "user": "dkomadin", "date": "September 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79965702}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "There were many breakfast choices, eggs, cereal, yogurt, toast, bagels, muffins, fruit and make your own waffles. Hope my husband doesn't expect this when we get home. The free pizza Wed. night was a pleasant surprise. Our room was comfortable and the staff was great, especially the breakfast lady. We hadn't been to the hotel for a few months and she remembered us. I do wish that there were more cable channels, I missed the Housewives of NJ on Bravo.", "title": "Comfy room, Terrible breakfast", "user": "crickerpicker", "date": "April 5, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60428562}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We enjoyed a three day stay at the Swedesboro/Bridgeport Hampton Inn. Our room, a king suite, was spacious, clean and comfortable. The hotel is 100% smoke free. Wireless internet worked perfectly. The complimentary breakfast had all the usual suspects ... sausage patties one morning and bacon another, biscuits, pastry, eggs, cereal, muffins, fruit, juice, tea, coffee.", "title": "Very comfy, good location!", "user": "JerseyBounce", "date": "March 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58560902}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Our bathroom was roomy. Bedroom has a large double closet, flat-screen tv, and the usual soft-as-a-cloud wonderful Hampton Inn bed. Since HI started using the white washable comforters, I've really liked the cleanliness of the bedding. This time, I noticed that the tags on the pillows were a bit mashed, so it was obvious that even the pillows get laundered regularly. How great is that?", "title": "Nice room, Darwinian breakfast buffet", "user": "The-Motel-Mavens", "date": "August 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 19187836, "likes": {"liked": "— Comfy bed, quiet room", "disliked": "— Inadequate restocking of breakfast items"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "If you're considering a suite, the living room had an \"overstuffed\" chair with ottoman, and a couch which I believe is a sofa-bed (because it was a little firm to sit on). Also a coffeetable, large flat-screen tv, and a nice gas fireplace. The kitchen area has a table and chairs, full refrigerator, sink, microwave and dishwasher. Dishes and flatware are provided.", "title": "Never Again", "user": "dawn0126", "date": "July 10, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 17746335, "likes": {"liked": "— ended up at the Holiday Inn", "disliked": "— there were none"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel sits on a large property, so the nearby businesses are not right outside your window. A WaWa convenience store and gas station is next door. Also a block away are a McDonalds and Dunkin Donuts. Various shops, a Pizza place, a Chinese restaurant and an Acme are two blocks away. Plenty of good places to eat in nearly Swedesboro, and lots of antique shopping in Mullica Hill down the road a few miles.", "title": "Quiet, comfortable, affordable.", "helpfulness": 1, "user": "ucantimagine", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10698026, "likes": {"liked": "— The bed and the breakfast", "disliked": "— the TV and channel selection"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Our king room, at a discounted $79, was clean, comfortable, quiet, and well-lit. The bed, per Hampton standards, was a pleasure to sink into and came with soft linens and cushy pillows. The hotel is located near the interstate but not next to it and is far enough away and soundproofed well enough to insure restful sleep.", "title": "Had some issues", "user": "profshanku", "date": "October 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 10058695, "likes": {"liked": "— Location", "disliked": "— Room was not clean, smelt of cigarrettes, dirty shower"}}], "location": {"country": "United States", "city": "Swedesboro"}, "stars": 2.5, "variance": {"poor": 3, "average": 11, "very good": 22, "terrible": 3, "excellent": 37}, "aka": "Hampton Inn Philadelphia / Bridgeport Hotel", "slim_ranking": 0.5, "description": "The Hampton Inn Philadelphia/Bridgeport is conveniently located just minutes from Pureland Office Complex in Swedesboro, New Jersey. Visit our hotel and enjoy a clean and fresh Hampton bed®, a free hot breakfast, & complimentary high-speed internet access. Whatever the reason for your visit, relax and keep in shape at our fitness center & outdoor pool. Explore many historic Swedesboro area attractions just steps from our centrally located hotel."}