{"user_rating": 4.5, "review_count": 118, "name": "Hampton Inn & Suites Stillwater", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "From before we arrived, we received outstanding service. We needed two rooms and the reservation agent kept at it until she was able to get us two rooms. She really didn't have to do that so it's greatly appreciated. When we arrived the staff was very nice, the rooms were nice and clean and quiet which was nice after traveling. All in all, if I'm ever in Stillwater again, I'll definitely stay here.", "title": "Awesome Stay in Stillwater", "user": "MJ24", "date": "December 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 188185965}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "I have stayed at the Hampton Inn – Still Water, Oklahoma twice in the last 9 months. Each stay has been an enjoyable experience. The rooms are clean and well kept. I have noticed very little noise from either outside the hotel or within the hotel itself. The hotel itself, overall, is kept very clean. The lobby and breakfast areas are very nice, particularly when the temperature is cool enough to have the gas fire place lit. Just as important, the staff is as friendly as any I have encountered. And it’s more than just the front desk. The Maintenance staff, cleaning personnel, etc., were all openly friendly during my stay. Overall, a clean, relaxing place to stay with a very cordial and helpful staff.", "title": "Hampton Inn-Still Water Ok.", "user": "Dan F", "date": "December 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 188022415}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Got stuck in Stillwater due to bad weather. Was allowed to check into a room well before check-in time. Front desk staff was helpful and friendly as always. This place is clean, cozy and reasonable. Best hotel in Stillwater!", "title": "Awesome Hotel - As Usual!", "user": "Michelle K", "date": "December 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186881906}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This is by the best hotel I stay, hands down the friendliest people and staff of any of the hotels I regularly stay. I give the highest of recommendations for anyone wanting to stay in a first class operation like this.", "title": "Recent stay", "user": "Bob R", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186604719}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Staff, facilities and environment provide a dependable and enjoyable experience. Numerous stays over several years have provided consistent hotel performance and credibility of its brand name. It is easy to recommend this facility to all friends and inquirers.", "title": "Dependable comfort", "user": "Paul B", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186489935}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "From before we arrived, we received outstanding service. We needed two rooms and the reservation agent kept at it until she was able to get us two rooms despite this being a busy weekend with the OSU graduation. She really didn't have to do that so it's greatly appreciated. In addition when we arrived the staff was very nice, the rooms were nice and clean and quiet which was great after a day of traveling. All in all, if I'm ever in Stillwater again, I'll definitely stay here and I'll definitely recommend this hotel.", "title": "Awesome Stay ..", "user": "MJ24", "date": "December 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 188169266}], "location": {"country": "United States", "city": "Stillwater"}, "stars": 2.5, "variance": {"poor": 1, "average": 7, "very good": 24, "terrible": 0, "excellent": 86}, "aka": "Hampton Inn Suites Stillwater Hotel", "slim_ranking": 0.0714285714286, "description": "The Hampton Inn & Suites Stillwater hotel is the ideal home base to discover the best of the area. Home to Oklahoma State University, Stillwater blends modern culture with Middle-American warmth. When you visit our hotel in Stillwater, you'll find a wealth of activities for the whole family to enjoy, from museums to shopping. Plus, Stillwater hosts a number of great festivals throughout the year, including a festive Fourth of July celebration, a spectacular home and garden show, and a fine arts and music festival in February. Stroll through the breathtaking Oklahoma Botanical Garden, peruse the great collection at the Gardiner Art Gallery, antique shop at the historic Stillwater Opera House or enjoy performances at OSU Seretean Center or Town & Gown Theatre. It's all here, just minutes from our comfortable hotel in Stillwater."}