{"user_rating": 4.0, "review_count": 135, "name": "Hampton Inn Pittsburgh/Cranberry", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Because of marcelous shale taking up all the rooms in western pa, we had to stay ~50min from our intended location, and ended up in this hotel. Its a decent hotel, the rooms were a little weak for the price, and the bathrooms were small. But the hotel breakfast was very well prepared and maintained, and having a Permanti Bros next door was a major bonus. Nice staff.", "title": "A little pricey for the level of hotel, Well done breakfast & Permanti Next Door", "user": "HersheyFamilyTravel", "date": "July 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 134948063}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The staff here offer great advise and are very personable. This location is very close to the hwy, gas station (gas station name is Sheetz - you must try the raspberry chocolate shake they make!!!) and close to a shopping mall. I stayed here for a business trip and found the hotel very clean and had very nice built inn custom desks and wardrobe units.", "title": "Nice hotel", "user": "TravelBud24", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134033137}, {"rating": 5.0, "title": "2nd stay, much better", "text": "My last review was tough, but I am much more pleased with the room I got during my second stay. I suppose rooms on the 3rd floor are better somehow, or maybe because this time I got a king room instead of a double. The rate was also lower than last time. Though, my two wishes still remain: new elevators, and better looking hallways.", "user": "eg450", "date": "July 2, 2012", "id": 133219955}, {"rating": 3.0, "title": "Older property, overpriced, but great service and value-adds!", "text": "I recently stayed here for business, and after looking at our bill, and then looking back at the hotel, the only thing that makes it worth the price is the service and value-add. The property itself is old, and in need of major updates (I.e. 80's green carpeting, old elevators, old bathroom wallpaper and tiling, distressed tubs, door handles with paint peeling off, etc). So, if you are aesthetically-conscious, this hotel is not for you. Although, the rooms have a pretty cool cove lighting feature, and nice built-ins. If you are a value buyer, this hotel is a great 'deal', because they serve free breakfast and hors d'ouvres (value-adds). The food is quite decent, served buffet style, and the brown-bag at breakfast makes for a great snack later in the day. Internet is also complimentary, and the Primanti's restaurant next door is a great spot to dine and grab a beer. Enclosing, the service in this property is great, everyone is very cordial and helpful. I just wish that they would invest some money in updating the property itself, because all the furniture and equipment seems to have been recently updated as well.", "user": "eg450", "date": "June 30, 2012", "id": 133078170}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Although this Hampton was set just off a busy road, we did not notice any road noise. Front desk service was great. We had stayed at another Hampton the night before and had a noisy room on the first floor. When we were again given a room just off the lobby, we explained we'd prefer a different room, and were quickly accommodated. Also, when I asked at the desk about the distance to a restaurant, I was provided with a printout of directions to that particular restaurant. What a great touch!", "title": "Good location, good value", "user": "scottr", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131153001}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The Hampton Inn stay was great. For the price, the rooms were up to date and clean. Also very close by to places to eat, movie theater, mall, etc. Easy off the turnpike, and check in was a breeze. Breakfast area staff were attentive and overall the stay was great. Nice pool facilities as well. Thanks again.", "title": "no problems here", "user": "mgush107", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129535614}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Not sure how old this Hampton Inn is, however it is certainly well maintained. The rooms were on the smaller side and drawer space was minimal, however it was nicely furnished with a modern look. Located next to an interstate so traffic noise can be a problem, however very near to some really nice restaurants and grocery stores - Primanti bros. shares a parking lot with this hotel if you are so inclined.", "title": "Above average Hampton Inn", "user": "PhatOzzy", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 129196194}, {"rating": 4.0, "title": "Another Reliable Hampton Inn", "text": "The breakfast was above average as well and had a good variety and all seems fresh since the hotel has good occupancy so food moves through quickly. They even had a managers snack and drinks reception every week night which is certainly a plus.", "user": "utopia1", "date": "April 27, 2012", "id": 128949850}, {"rating": 4.0, "title": "Convenient locatio", "text": "Front desk reception was excellent and explained all the amenities during check in and offered wake up call for the following day.", "user": "BJG125", "date": "April 23, 2012", "id": 128480394}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Only negative is that the wifi slows down horribly after 8pm. Again this must be due to the high occupancy of business travellers and use of multiple wifi enable gadgets.", "title": "Another exceptional, completely renovated Hampton!", "user": "TWolfe02", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128323037}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We, a family of four--43 year old parents, 19 year old and 13 year old, stayed for a weekend at the Hampton Inn Cranberry Township to attend our daughter's Level 8 USA Gymnastics State Championships. Many other athletes also used this hotel. The hotel was clean and furnished well. We arrived late for check-in and the front desk clerk was quite friendly and helpful to us. Our room was pleasantly large enough to accomodate all of us. Furnishings were attractive. The room and bathroom were clean and inviting. There was a nice sized flat screen TV in the room.", "title": "Great Hotel for Families", "user": "Disney4ever86", "date": "April 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127636632}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The rate included breakfast. Breakfast was your average included breakfast with waffles, pastries, fruit, cereal, yogurt, sausage gray, juices, and coffee. Dining area was clean but small to accomodate the large groups of people. We needed to wait for a table. Actually we needed to split up because the only tables that opened up could accomodate 2 people.", "title": "Hampton Inn Cranberry Township", "user": "Deb C", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123716660}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "There were plenty of restaurants in the area as well as shopping malls. Most of the stores and restaurants appear to be new.", "title": "Not our typical Hampton experience", "user": "TruReviews4U", "date": "December 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 122276242}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "If we needed to stay in this area again, we would absolutely stay here again!", "title": "Quality Service", "user": "Fran and Jim H", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122200400}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We rented a conference room and stayed at the hotel. The employees were extremely wonderful and helpful. They aimed to please and made the meeting go very well. Having continual beverages was very nice also.Audrey Peterson and Patty Conner were great.", "title": "Great staff, great value, ok stay", "user": "limeijulia", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 122127101}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Clean room at decent price compared to downtown options. Lots of choices nearby for eating/shopping. Clean comfortable rooms although the ceiling and some scrapes and the bathtub needed some reglazing in areas. Close to both Rt. 79 and 76 and 20 min from downtown attractions. Morning breakfast was very crowded and despite two workers, they didn't seem to stock much food past 9am. Oatmeal remained empty, no eggs or meat unless you count sausage gravy but one of the two waffle irons was in working order. I've seen better. Pool area had attendant and was rather large compared to some other Hampton pools. Also decent hot tub and fitness center.", "title": "Solid bet", "user": "ttoo", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138710843}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Very clean comfortable rooms, really nice bathrooms! Breakfast had a good selection, the Hampton Inn robust coffee is the only good coffee I've ever had in a hotel! For once, I can't complain about the maids, they did not replace my towels when I asked them not to, and they did not turn my room down to freezing the second I was out of the door! I really appreciate that!!! My only issue was a room facing the freeway, the semi's going past all night was a little irritating. I would definitely stay here again though, without hesitation.", "title": "Excellent stay", "user": "Yorkiebrit", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 137872066}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This is exactly what you want from a Hampton Inn, this place was clean, great breakfast, internet worked as it should. Beds were comfortable. You can't go wrong with a Hampton. We did not have a reservation and pulled in at 11:00 p.m. and were greeted with a smile and a great room", "title": "Just what you would expect from Hampton", "user": "ohiogirl83", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136533438}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The Hampton Inn Cranberry PA is a short 20 drive from the Veteran's Bridge and downtown Pittsburgh. The hotel is clean and the rooms nicely decorated. The beds are very comfortable. The free wi-fi and breakfast combined with the free parking make this a very good deal. I have stayed at other Pittsburgh hotels and have paid between $14 and $20 per night for parking and then had to take my family out for breakfast too. Of the Hampton Inns in the area this is the median priced hotel. The one on Smallman is a great hotel but can cost an additional $100 per night. The pool, spa, and fitness room are workable. There are several places to eat within a mile of the hotel and a Primanti's adjacent to the property. There are shopping centers including Barnes and Noble, Walmart, and others stores within a mile. Interstates 76, 79 and 279 are all within a short distance. I have stayed here several times while visiting my son who goes to school in Pittsburgh. Nice place to saty without mortgaging the house.", "title": "Best of Both Worlds", "user": "Gillylax", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 135435683}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I stayed here during a relocation commute. I usually do not stay at hotels with exterior doors to the room, but this was ok. I had to park a Uhaul and trailer across 6 parking spaces and they were perfectly ok with it. I was surprised that the room was so clean. They offer free continental breakfast starting at 6 AM, which was nice to grab a banana and some pastries before hitting the road again.", "title": "Clean and Convenient", "user": "Dee B", "date": "July 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 135197927}], "location": {"country": "United States", "city": "Cranberry Township"}, "stars": 2.5, "variance": {"poor": 11, "average": 16, "very good": 46, "terrible": 3, "excellent": 59}, "aka": "Hampton Inn Pittsburgh/Cranberry Hotel Cranberry Township", "slim_ranking": 0.545454545455}