{"user_rating": 4.5, "review_count": 263, "name": "Hampton Inn & Suites Jacksonville - Bartram Park", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "stayed thirteen nights because it was near our daughters summer camp.on arrival we were given a standard room which wasn`t suitable for our disabled daughter,the receptionist (alex) said we could see the manager the next day.jesse upgraded us to a much more accessible room. staff were very helpful and breakfast was very good.", "title": "good family stay", "helpfulness": 1, "user": "westlynnbloys", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133049188}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This is a new Hampton Inn in a relatively new part of town. This hotel is very clean as you would expect. This hotel is easy to access via I-95 and just one exit South of I-295. There is a shopping center adjacent to the hotel with a Publix grocery store and several places to eat. This is the place to stay if you like a hotel right off an interstate exit with plenty of places to eat.", "title": "Clean new Hampton Inn", "user": "jimpeterson", "date": "June 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132074097}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "This was a great place to stop and rest after driving 17 hours! We stayed in a Double Queen Suite. The room was large and fit our family of 6 comfortably! The room was clean and had everything we needed.", "title": "Perfect stay!", "helpfulness": 2, "user": "Crazytree6", "date": "June 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131080025}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This hotel had an excellent location. Breakfast was standard Hampton hotel breakfast with lots of choices. (Tip for everyone: go to the toast area and use the bread, peanut butter, and jelly to make a sandwich for lunch too!) Room was clean, Internet was included. There was a large track group who was fairly rowdy at night, but that wasn't the hotels fault. My kids were disappointed that there were no chocolate chip cookies upon check-in. The manager said they didn't do that at that property. First Hampton we have ever stayed at without cookies.", "title": "No cookies here", "helpfulness": 1, "user": "jonathanbdavis", "date": "May 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 130623602}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Stayed here for a week during a business assignment. The facility had all I needed to be productive, stay fit and get a good night's sleep. The staff was helpful and friendly. Would stay here again (if I come back to the Jacksonville area). Con: Wish they had different firmness options for the bed pillows. I prefer firmer pillows, but all of the ones in my room were soft.", "title": "Nice Business Stay", "user": "KennetteR", "date": "May 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130612188}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "New. Clean. modern. The \"suites\" are very spacious and nicely appointed too. Hotel has a great workout room. Location is near a strip mall with several dining options close by. In general the area is in a nice suburban location in southern Jacksonville.", "title": "A review from your long term business traveler", "helpfulness": 1, "user": "Chase71", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141018828}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "But there were a couple of issues that could improve: The hotel's internet service was so slow most the time in the evenings it was unusable. I had to call their tech support each night to just get the service in the usable category. Their internet service is inadequate for the hotel's capacity including \"casual browsing and email\". Forget business use like VPN.", "title": "Nice, new and a pleasant place to beat the heat!", "user": "KSC77", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140916578}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The free breakfast is a nice touch. But it has room for quality improvement with the eggs and entrees.", "title": "Nice hotel, avoid the jacuzzi room", "user": "burntweeniesandwich", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 140648056}, {"rating": 4.0, "title": "Good I-95 stopover", "text": "Lastly the front desk staff were very friendly and remembered my name -even before I had met some of them. \"Jesse\" was thoughtful to get me into a Honors upgrade room, but he could be a little less pretentious.", "user": "AdrianaKate", "date": "August 29, 2012", "id": 138762471}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "After visiting St. Augustine earlier on a hot, humid, crowded, Saturday afternoon, finding this Hampton Inn was a relaxing spot to cool off and clean up. It seemed new and was staffed with a friendly, knowledge front desk staff. The room was clean and well appointed with a good air conditioner and comfortable beds. We did not try the breakfast, as Starbucks was nearby, but it did seem quite popular. I have no complaints at all and I would stay here again if I was in the area. Their weekend rates were surprisingly good!", "title": "I'd stay here again", "user": "Dorothy G", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138062246}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed overnight on our way to the beach. The hotel is conveniently located off of I-95. The hotel is very clean and inviting. The staff was helpful from the moment we called to make a reservation - an hour before we arrived. I spoke with Jesse and he was extremely polite and helpful. We had left a few items at the hotel, and when we called hours later to ask about those items, Jesse was once again extremely helpful. Customer service was excellant!!! I highly recommend this hotel!", "title": "The staff is Wonderful! The hotel is great too!", "user": "ALO11", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135109788}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We've stayed at this hotel a few times.", "title": "best stay", "helpfulness": 1, "user": "john s", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134542182}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "You can tell housekeeping pays attention to detail in the rooms. All the staff go out of their way to say hello and make you feel welcome. We came down for a wedding and the staff was great. Jesse the Font Desk manager went out of his way to teach my nephew how to tie a perfect windsor tie knot for his suit he wore to the wedding. the breakfast was great for being free. we will be returning to this property. I understand sometimes during the week their room rates are a bit higher, but it is worth it to stay at a quality property like this.", "title": "very impressed", "helpfulness": 2, "user": "Tangie79", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133950598}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My family of five including three small children stayed here for five nights. I thought that by the time we left we would need to sit in a bucket of sanitizer but i was wrong. The hotel was very well kept and clean. The staff greeted us when we went in and out. The complimentary breakfast was so good we looked forward to it each day because it was hot and fresh. They even had a hostess in there who was very nice and was there to assist not like some complimentary dining areas that leave you fending for yourself. We were very impressed. Will definitely visit again. Oh and location was right off 95 near everything and walking distance from shopping plaza with a Publix.", "title": "My favorite", "helpfulness": 3, "user": "laurmann2000", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133620681}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We traveled around Florida and stayed at 5 different hotels and this was my favorite. The rooms were spotless as was the rest of the hotel. The beds were so comfortable as were the pillows and they had the most wonderful, fluffy comforters. The location was perfect for us. The staff were so friendly and helpful. Breakfast was free with a nice selection of hot as well as cold choices. My favorite was the 24 hour coffee, tea or hot chocolate. This was great when we were coming back to the hotel late in the afternoon and needed a quick pick-me-up before heading back out for dinner. We didn't get to use the pool but it looked nice. When we return to Jacksonville we will definitely stay at this Hampton Inn again.", "title": "Convenient place to stay and very clean", "helpfulness": 1, "user": "Chris J", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133167633}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We are currently staying at this hotel for my spouse's business trip. We arrived late last night and I am already looking forward to returning home. Many of the aspects of the hotel are satisfactory, but there are a few big things that are making me wish I had gone to a Starwood hotel.", "title": "Anxious to Leave", "helpfulness": 2, "user": "Andrea H", "date": "August 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 137351092}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The air conditioning system is horrible! It is a window a/c unit, and last night it was so noisy we had to turn off the air just try and sleep. When the air is on the room still remains incredibly stuffy and humid. It is so bad that it has caused my hair to frizz up and made it unpleasant to breathe. The hallways leading to the rooms are just as stuffy and humid.", "title": "All Girls Weekend to Jacksonville", "user": "Neka J", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137306293}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "The next problem is with the beds. Although the sheets are nice and soft, the pillows and mattress are incredibly uncomfortable. This made it very hard to sleep and now my neck, shoulders, and back are very sore.", "title": "Business trip to Jacksonville", "helpfulness": 1, "user": "LindaKayC", "date": "August 15, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 137237852}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "To top it off the smoke detector in the room makes this incessant high-pitched buzzing noise.", "title": "Great Business Hotel", "user": "Rmgtampafl", "date": "August 11, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 136938375}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I do not usually stay with Hilton, but I thought I would give this one a try since it was in a more convenient location. After this trip I do not think I will be staying with them again.", "title": "Probably the nicest Hampton Inn we've ever stayed in", "helpfulness": 1, "user": "Robert W", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135175701}], "location": {"country": "United States", "city": "Jacksonville"}, "stars": 2.5, "variance": {"poor": 5, "average": 10, "very good": 58, "terrible": 1, "excellent": 189}, "aka": "Hampton Inn & Suites Jacksonville - Bartram Park Hotel Jacksonville", "slim_ranking": 0.0151515151515}