{"user_rating": 4.0, "review_count": 139, "name": "Hampton by Hilton Amsterdam Airport Schiphol", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The hotel is very new, hotel rooms comfortable with large beds and large flat screen TV (LG 100cm). Very quiet and safe. Breakfast with various meals and drinks. And all for very good price. Free shutle service available from/to Schiphol airport every hour. Excellent and caring staff. I can highly recommend the hotel.", "title": "Business trip", "user": "Jana E", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176137385}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Comfortable room of adequate moderate size and clean. The tea-making facility was a bonus. No cupboard in the room but a hanger. The breakfast was not amazing but was good and sufficient. The room was rather expensive probably we went at a conference time. The reception staff were helpful and supportive. The location was great close to the airport, very short walking distance to the train station. The only negative point was the shuttle service to and from the airport. On our arrival at the airport we had to wait more than an hour then to learn that there was no specific shuttle service carrying the hotel name but after questioning we were told the shuttle was shared with our hotels and hence carries other hotels' name. The shuttle only takes few people and on departure we would have missed our flight had we waited for the shuttle hence we took the train. We were not informed that we had to book the shuttle on the previous night. These matters must be explained fully to the guests in the website oor upon reservation instead of making them wait and wait", "title": "Good location, comfortable room, good breakfast but beware of the shuttle service", "helpfulness": 1, "user": "Hiphip9", "date": "September 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 175799420}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I stayed here when visiting Amsterdam and found this to be a very good hotel. The same hotel in central Amsterdam would be more than double the price. It is only a 3 min walk from the station and there are frequent shuttles to the central station in Amsterdam itself (takes 20 mins on the train).", "title": "Great value and good location", "user": "richard p", "date": "August 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173768220}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "You can't hear the planes at the airport from the room (with windows shut) and even open, the noise is minimal.", "title": "No Vegeterian Food", "user": "Kushal S", "date": "August 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173596242}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Staff were very friendly and helpful.", "title": "Great value for money", "user": "SZKE", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173362562}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Second stay here, and both stays worked out well. Need to be careful with the shuttle bus, since they are still using the Holiday Inn shuttle. Don't trust the directions at the airport hotel shuttle bus area that tells you Hampton has thier own shuttle; they do not. Hotel itself is good, new, and clean. Rooms are on the small side, but still good. Breakfast is ok. There are a few restaurants to walk to in 5-10 minutes. And the train station is just across the main road that takes you directly to the airport in just a few minutes, or into the city in about 30 minutes. Wifi service is good.", "title": "Good value airport hotel", "user": "ats262m", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 176942189}, {"rating": 5.0, "title": "Hampton Hilton Hoofdorp", "text": "Brand new hotel opened in May 2013,with a free breakfast free shuttle from airport ,will make us return again . Staff in every area were excellent and made our anniversary trip something to be remembered", "user": "A TripAdvisor user", "date": "September 12, 2013", "id": 176957969}, {"rating": 4.0, "title": "Hoofddorp Hampton INN", "text": "Efficient. Wish there was close by resturants. Rooms was good, service was good. The hotel is close to a train station so transportation to the city is not a problem. It is in a business district so does get quiet in the evening.", "user": "A TripAdvisor user", "date": "September 12, 2013", "id": 176958128}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This new hotel is located close to the airport, with quick access to the local train station. The staff was excellent, room moderately sized and everything was clean. The bed was very comfortable, one of the best I have experienced in a hotel. The complimentary continental breakfast was limited but sufficient. The only down side was the airport free shuttle service that is shared with a separate hotel; the shuttle is not clearly marked and we waited some time until we discovered the shuttle had a small sign in the front window to identify it use for Hampton.", "title": "Nice location, great bed!", "user": "michael_smith56", "date": "September 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 176740017}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "The Hilton was my gateway accommodation to a long term assignment in the Netherlands. Unfortunately this probably isn't the ideal location for a long term stay. Initially scheduled for a one month stay, I moved hotels after four days. Food choices were limited, and unless you love watching planes take off and land, it is a vast wasteland of \"nothing-to-do\". Friendly staff are a good introduction to Dutch diffidence to service.", "title": "Pure Hilton with Limitations", "helpfulness": 1, "user": "David P", "date": "September 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 176565729}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Hotel staff very friendly and efficient. Rooms clean and beds were comfortable. Shuttle to and from airport was very efficient. Train stop within 4 blocks or so takes you to several places including city center. 4.20 euros each way for same day trip-coins only or mc/visa debit card.", "title": "Great value clean hotel.", "user": "miaPortNechestx", "date": "August 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 173231268}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We staid at a Hotel in Amsterdam last year and found it a Little cramped.", "title": "Friendly Service - Great Price!", "user": "Stitch42", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173162115}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "This year we came by airplane and the Hotel offered FREE Shuttle Service from and to the Airport as well as FREE Parking and Free Breakfast.", "title": "Great value for money", "user": "Leonard K", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 172917467}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The rooms were airy and light.", "title": "Great Airport Hotel", "user": "Tim K", "date": "August 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 172753747}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We enjoyed the Breakfast and the extra Service, received free coffee downstairs and had early check in when we got there at 11.00 a.m.", "title": "Post cruise stay", "user": "Michael S", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172753183}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "the hotel was very clean, the staff were ok and they have a really nice breakfast. it's not really close to anything, but they also have an airport shuttle that you can use. the trip into amsterdam takes 20 min by train.", "title": "close to airport", "user": "andraoprea", "date": "August 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 172522141}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Very nice and quiet hotel. Shuttle every 30 min from airport makes access to hotel easy. Excellent breakfast. 3 min walk to train station with excellent connectivity to Amsterdam Central Station. Free parking. Biggest drawback is absence of good resturants nearby. Limited choice. Taking the shuttle to airport to eat out a good option.", "title": "Lovely Hotel for Amsterdam visits", "helpfulness": 1, "user": "Sambit G", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172612908}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "very clean, comfortable, the bed maybe a bit too high though, fast internet, tasty breakfast, very close to train station, I'd stay there again for sure!just be careful with the shuttle bus, since we waited over an hour for ours and we don't know why it did not turn up.", "title": "very good value for money", "user": "Luiza S", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172612598}, {"rating": 5.0, "title": "summer 2013", "text": "Excellent hotel, very clean and closed to airport. It does offer shuttle services to the airport. We did not rent a car, we took the shuttle to airport then the train to Amsterdam city center. The shuttle service is share with the Holiday In there is a schedule posted outside airport with the time of the shuttle.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 15, 2013", "id": 172461225}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The hotel was a nice place to stay. Although it is not near any restaurants, we were able to walk to some. The only problem was the ticking or popping of the ac system. If you are a light sleepy this will bother you immensly. The staff were very helful with everything.", "title": "Good Stay", "user": "Sissy D", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 172156773}], "location": {"country": "The Netherlands", "continent": "Europe"}, "stars": 3, "variance": {"poor": 8, "average": 19, "very good": 45, "terrible": 6, "excellent": 61}, "slim_ranking": 0.0833333333333, "description": "Whether you're catching a flight, you're here to discover Amsterdam, The Hague or Haarlem or you're on business nearby, count on Hampton by Hilton Amsterdam Airport Schiphol for a modern, comfortable base close to it all. Our Amsterdam hotel is located just five minutes from the airport and a 20 minute train ride from Amsterdam's city center."}