{"user_rating": 4.0, "review_count": 153, "name": "Hampton Inn Toledo South Maumee", "reviews": [{"rating": 5.0, "title": "Good choice for area", "text": "Clean and up to date. Very large eating/lobby area and pool area for the typical Hampton. Complimentary cookies and coffee in evening. Near both the Ohio turnpike and 1-470. Fitness center had two treadmills, one elliptical, and one bike. Breakfast was well stocked.", "user": "ttoo", "date": "January 4, 2014", "id": 189666898}, {"rating": 5.0, "title": "Very nice facility", "text": "Hotel and rooms are always clean and fresh. Good breakfast with a great variety of options. Great pool - very large for doing laps. Remodeled lobby and breakfast area is very nice. Beds are very comfortable. Convenient off the toll road. Half way between Pittsburgh and Chicago.", "user": "A TripAdvisor user", "date": "January 2, 2014", "id": 189438084}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The cover-spread was to heavy to use as a blanket. The spare blanket was to rough. The maid replaced the spare blanket with a satisfactory common blanket. The sink was too high for wife. The roll-around chair was too low for wife to use while curling her hair, so we boosted her up with pillows. The toilet was too low, so we will bring a booster seat next time. Too low water pressure. We slept very well though.", "title": "Two overnight-stay experience", "user": "James H", "date": "December 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 189185160}, {"rating": 3.0, "title": "People are kind, hotel is \"tired\"!!", "text": "Just not up to Hampton standards. Had one request upon check-in, room NOT near elevator. Assigned room was across from elevator. Really!! They were gracious enough to move me. Property needs facelift. Soiled carpets, cracked toilets, and small cleaning problems are disappointing for Hilton. Stayed here before, might rethink next trip.", "user": "Kathleen A D", "date": "December 12, 2013", "id": 187492771}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We stayed here one night and chose this hotel based on its proximity to the Ohio Turnpike. We arrived at the hotel around 10:30pm and had no problem finding the hotel in the dark; only a few minute drive from the Ohio Turnpike. We were warmly greeted by two ladies at the check-in desk and we were up to our room in minutes. Our room was a nice size for one night and looked newly refurbished; hotel pictures posted on Tripadvisor are accurate. Everything was in excellent working order and we got a good night’s sleep. The breakfast room is very large and we had no problem finding a table for our family. All the breakfast choices we picked were very good. This Hampton Inn is located in a somewhat busy area with gas stations, restaurants and stores within a short driving distance. After checking out, we gassed up and were back on the Ohio Turnpike within a few minutes. I'd stay at this Hampton Inn again if we were in the area!", "title": "Easy access to the Ohio Turnpike", "user": "stevesgirl", "date": "December 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187056476}], "location": {"country": "United States", "city": "Maumee"}, "stars": 2.5, "variance": {"poor": 7, "average": 19, "very good": 50, "terrible": 2, "excellent": 75}, "aka": "Hampton Inn Toledo South Maumee Hotel", "slim_ranking": 0.277777777778}