{"user_rating": 4.5, "review_count": 754, "name": "Hampton Inn & Suites Memphis - Beale Street", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Really brilliantly located hotel, about 1 min walk to Beale St and to the shops / restaurants. Staff were attentive and friendly throughout and the hotel is well kept. The rooms are big, good bed and although i suppose it could be noisy at weekends due to its location in the week it was very quiet for the most part. There is a good gym and a small pool. Would recommend it to anyone but especially if you are in Memphis for the music.", "title": "Great location and hotel", "user": "8Ace", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32629419}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Stayed on HH reward night. Reception experience / friendlyness was average to good. Room was quite nicely appointed, bathroom as well. Would have been worth the normal rate price. VERY central location - great. Entry to hotel/ parking a bit weird (general public parking). Stayed there during memphis / beale street music festival (in the rain...), so maybe not the most representative experience - they had to close the main door entrance to avoid \"abuse\" by non guests and some guests had clearly a few too many drinks.. Housekeeping very friendly and welcoming. Breakfast was great - clearly above the HI express standard and better than the average Hampton Inn, with REAL fresh fruit, fluffy cheese omelet etc. Breakfast are was small but not crowded. Overall a great experience. One free PC with printer close to reception (busy most of the time).", "title": "very good location", "user": "Belgian-Brussels", "date": "June 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 32465024}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The hotel is right around the corner from Beale Street and walking distance to many of the sights and restaurants. A sign at the registration desk warns that the area is noisy, but our room faced the courtyard and we didn't hear anything. The rooms are a large enough size and have those wonderful Hampton Inn beds. No complaints except that parking is $18/day but I guess that happens in downtown hotels.", "title": "Fabulous hotel, fabulous location", "user": "cmujmumom", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30971912}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "My family of 5 visited Memphis from May 23-25 and stayed at this hotel. The rooms were small but the staff was good. The breakfast was limited and not very creative with the same thing being served twice. The attendant was very friendly and she was warm to all guests. I would stay there again since it's really in the heart of the happenings on Beale street. The business center was well stocked and clean with all of the machines working. When I requested extra pillows they were sent up right away. I would stay here again but in a larger room or suite. The noise was not that bad although some late night party people stumbled in loudly.", "title": "Good Hotel", "user": "ruthie123", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 30767533}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We just got back from a 4 day stay at Hamnpton Inn and Suites Beale Street. We have nothing but good things to say about this hotel. The staff was extremely friendly and knowledgable of the area. The location of the hotel cannot be beat. Just across the street is the Peabody Entertainment Center and countless restaurants/bars which showcase live music all day everyday. At night you can hear music from the streets below so be sure to ask the front desk for ear plugs if you're sensitive to noise.", "title": "Best value in downtown Memphis", "user": "Sharebear81", "date": "May 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29994558}, {"rating": 2.0, "stay_parameters": "Stayed August 2009", "text": "We stayed on night for $300 and I must say it was mediocore for a high price of 300. It was in a great location in memphis. We had a balcony that overlooked a street right off beale street, we happened to be looking at a homeless person sitting on a bench and a lot of drunk people but they said there was a lot of action on that side of the hotel. It was a clean hotel and it was nice to stay in for a night. I wouldnt stay in it again if i happened to be in memphis though.", "title": "Could Have Been Better", "user": "KailDee", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 36852900}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I enjoyed our stay at this hotel. Close to everything. we had a Beale St view, Music ended around 1:00 am.....we werent bothered at all by it. In fact we enjoyed taking breaks from the crowds on Beale and escaping to our balcony enjoying the music and a drink ! The only negative was the carpet was extremely dirty from the balcony..our feet were black from just a few steps on the carpet, this was only the case with the carpet by the balcony doorway.", "title": "Great Place To Stay", "helpfulness": 1, "user": "ohiocouple1984", "date": "July 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34741600}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Great secure parking, and very secure hotel !!!", "title": "Great Hotel near most Memphis attractions", "helpfulness": 2, "user": "Guido65", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34490336}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We would stay here again !", "title": "GREAT LOCATION", "helpfulness": 1, "user": "VLHessel", "date": "July 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 34038567}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We would visit here gain !!!!", "title": "right in the heart of things", "user": "a visitor from ireland", "date": "June 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33213244}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This hotel was great. My husband and I stayed here when we went to visit my family that lives in Memphis. I always prefer to stay w/family instead of paying for a hotel, however we wanted to be close to downtown this time. This hotel was perfect. It was right on Beale Street and there was plenty of things to do within walking distance. The staff was excellent. I've stayed at several hotels and even worked at a couple and have never found a staff that was so friendly and helpful. They were quick to make recommendations for places to go and eat. The rooms were top notch too. They were very spacious and clean. I will continue to stay here instead of with family for now on.", "title": "Wonderful Hotel", "user": "LinzTX", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39478553}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I absolutly love this hotel. The staff was friendly and helpful. The location was great, close to so much to do in Memphis. I will be staying at this hotel everytime I am in Memphis in the future.", "title": "Best service I've had in a long time.", "user": "Dana0530", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38969701}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Hotel was nice, dined at Stella's, awesome restaurant/club. Partied on the Beale St. couple of days before heading off to New Orleans. Great trip.", "title": "Rocked", "user": "casscntyman", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38391299}, {"rating": 3.0, "stay_parameters": "Stayed August 2009", "text": "We have been comin to memphis every year for 10 years as a group from all over the country.We've stayed at this hotel for 9 of the years.....Well, we made the decision to change hotels after this years stay. The rates hve risen to almost outrageous prices,even with a group rate. We tried to get an extension to stay in the room a few hours,due to a late flight out...Sure we could for a $100.00 fee,just seemed like we could have work something out, after all we had about 10 rooms. The breakfast was grea but the sign says from 6-10 am, They ran out quickly and we were told nothing hot after 8:30. Now the Housekeeping Staff was great ,In particular Loretta was Fantastic.The Hotel is very clean, just work on people skills. Also the hotel charges an additional fee on top of the normal parking fee, I know it might sound like nit picking,but dont make a rip-off so obvious", "title": "I think I'll try the Westin Next year", "user": "BatonRougeGator", "date": "August 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 38045695}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Stayed at the Hampton Inn for a weekend in July. This hotel is right in the middle of the action -- and is a fabulous oasis. The hotel was fully booked, but service was great and the rooms were quiet despite noise on the street.", "title": "Nice spot to stay in Memphis -- not your usual Hampton", "helpfulness": 2, "user": "Gundi", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37199354}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The Hampton is definately a superior hotel. Its right on the corner of Beale Street so its fantastically positioned for nightlife. The executive rooms are well worth the difference as they are huge and have an absolutely enormous balcony that does right round the corner. We were on the 7th floor and had a wonderful view across the road to the park where live bands played everyday - in fact you could just sit on your balcony and watch! The breakfast was very good - hot and cold buffet style. The hotel is also very safe - to get into it at night you must scan your door key to get into the lobby. The staff were very pleasant and were able to arrange a very good day out to Gracelands for us with our own driver at an okay price. All in all, I would recommend.", "title": "Brilliant location, fantastic view over Handy Park", "helpfulness": 2, "user": "Something-Different!", "date": "October 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 47070616}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This hotel is located right off of Beale Street...the location couldn't be any better since there aren't any hotels right on the main strip of Beale. It is a new hotel that is very clean and welcoming. The employees at the front desk were very friendly and helpful. Everything is within walking distance...downtown, Rendezvous, the Peabody...everything. We even walked to the Civil Rights Museum...it took about 20 mins.", "title": "Very nice hotel with EXCELLENT location", "helpfulness": 1, "user": "sya720", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46379143}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "First time in Memphis - and the Hampton couldn't be located better. 1 block from Beale (hence the noise warning), however - I only faintly heard the music one night, and our room faced Beale St. Breakfast was very good. Some items could've been warmer though - but nice selection of fruits, cereals, breads, etc. Very clean place to stay, and the staff was VERY courteous and helpful. After staying at Hampton Inn Downtown in Nashville then coming here - I would say the only drawback was: Nashville - free parking. Memphis - $17 per day. Aren't these the same company? So why the discrepancy?", "title": "Great time - Great location!", "user": "Sabre4", "date": "October 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45567783}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Anyway - would not hesitate to recommend friends staying here, and when I come back to Memphis - I'm staying here again!", "title": "Nice Hotel but you can expect the noise from crowds and music", "helpfulness": 1, "user": "DanR73", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45216890}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The Hampton Inn is very nice but don't expect it to be peaceful and quiet. This place is just one block off Beale Street so the party goes until 2 or 3 in the morning on the weekends.", "title": "Very nice and very noisy", "user": "NJtrvlr", "date": "September 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 41447031}], "location": {"country": "United States", "city": "Memphis"}, "stars": 2.5, "variance": {"poor": 12, "average": 45, "very good": 197, "terrible": 6, "excellent": 494}, "aka": "Hampton Inn And Suites Memphis - Beale Street", "slim_ranking": 0.0148148148148, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Discover all that Memphis has to offer at the Hampton Inn & Suites Memphis-Beale Street hotel. We offer a variety of services and amenities with every stay. The Hampton Inn & Suites Memphis-Beale Street is located in the heart of the action within walking distance of shopping, dining and entertainment. Enjoy a variety of guestroom and suite options, complimentary WiFi and a Free Hot Breakfast each morning. Make the most of your stay in Memphis at the Hampton Inn & Suites."}