{"user_rating": 3.5, "review_count": 450, "name": "Hampshire Hotel - Theatre District Amsterdam", "reviews": [{"rating": 1.0, "title": "Dont Stay Here", "text": "dont stay here unless you want to get ur money stolen from the hotel. i left my luggage in their secure luggage room, to find my money had been nicked!i realised when i was at the airport so it was too late to go back. dont stay here guys!i am very dissapointed and annoyed and it ruined a cool few days in the dam!", "user": "A TripAdvisor user", "date": "March 6, 2006", "id": 4586531}, {"rating": 1.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "Very disapointing, expensive to get to from Central Station (17 Euro), access is difficult for luggage, as the room elevators are accessed by walking through the restaurant and lounge. They charge high rates for the wireless internet and the breakfast. The room was cold and the bed uncomfortable, certainly nothing to brag about...but worst of all, the carpet in the room and the hallways was filthy. Don't believe the frequent flier promotions they offer, you only get points if you pay \"rack rate\". Not Recomended!", "title": "Poor choice!", "user": "RandT", "date": "March 22, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 4725834}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "Stayed here in December for the weekend. The first thing you notice upon entering the hotel is the incredibly steep steps - I wouldn't like to attempt them if I was frail or had been sampling some of the Dams well known delights!", "title": "The smallest hotel bathroom ever! (see pics)", "user": "richardajh", "date": "March 13, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4607054}, {"rating": 4.0, "title": "super stay.", "text": "Stayed in Room 210 - Double. The main part of the room was a bit on the small side but the bathroom was ridiculous! There was no bath - just a shower cubicle. The sink was a \"vanity\" sink ie very small - it was impossible to clean your teeth over the sink without removing the glass shelf!", "user": "A TripAdvisor user", "date": "March 10, 2006", "id": 4598690}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "The hotel was centrally located. But Amsterdam is so small, you can walk or bike to any where in the city in about 10-20 minutes. The rooms were extremely bare and small. We stayed on the top floor, yet we could hear people walking/talking on our floor and the one below. The walls are paper thin!! We could hear the people in the next room lifting the toliet seat!!! The bathroom was also extremely tiny with a shower that was about 2 feet by 2 feet. When we took a shower the entire bathroom got wet. Also, no air conditioning. We stayed there 3 long nights and slept with ear plugs all 3 nights. It felt more like a hostel-not like a hotel.", "title": "Small rooms and one tiny tiny bathroom with paper thin walls", "user": "mooresf", "date": "July 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 4.0}, "id": 5420537}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Don't know if it changed much since last summer, but, I had a great & relaxing stay at this hotel! It was walking distance to all the top tourist sites and tram services. They offered free wireless internet in a comfortable lounge area & their rooms were modern & secure. Their breakfast was pricy but their room rates were affordable if you booked in advance & online of course. The hotel desk staff were friendly & helpful. I'd consider staying there again! I noticed some comments on this site regarding a wallet or luggage being stolen - welcome to Amsterdam! Perhaps you missed the videos playing on trams showing how pick-pockets can steal your personal belongings? Hope you had insurance coverage!", "title": "Excellent location", "user": "Montreal_CanadaLizzy", "date": "June 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5366084}, {"rating": 1.0, "title": "Watch your wallet", "text": "Average hotel with poor service,", "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4996493}, {"rating": 2.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "!! Because i am a travelagent in the Netherlands and i have stayed in this hotel several times i found out after some research with colleagues that the hotel has a reputation to overbook and then move you to another hotel without any compensation.", "title": "At the same level as a youth hostel", "user": "Happyhubby&Daddy", "date": "April 4, 2006", "detail_rating": {"value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4932745}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled solo", "text": "Hi", "title": "Very good location", "user": "Spatzthecat", "date": "December 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 188824311}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "I stayed here from 09/12/13 to 14/09/13", "title": "Fabulous hotel would stay again!", "user": "Daryl J", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187195370}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "My room was small and so was the single bed. But it was clean and for me the bed was very comfortable. No problem sleeping, if however you are planning to bring someone back its going to be a tight squeeze. The view was of a courtyard but it was better than a room that faced the 'busy 'main road that run in front of the building. It was very difficult to hear any road noise in my room.", "title": "Affordable no frills Hotel for a budget holiday", "helpfulness": 1, "user": "Stef C", "date": "December 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186710575}, {"rating": 1.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "The breakfast room was nice and there was a small selection of foods on offer. I did not try eating out for breakfast because I was up early every day and so 9 euros for a simple breakfast was adequate. There was free tea and coffee in the breakfast room but not in the rooms, slightly annoying but no real hassle for me.", "title": "For sure you'll find a better place! Terrible!!", "helpfulness": 2, "user": "Alex C", "date": "December 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 186464299}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "They cleaned the room every day except Friday for some reason but on Saturday it was cleaned and with the 'manager of cleaning' asking if everything was ok. So no real harm done for that minor slip.", "title": "Amsterdam", "user": "644suziesue", "date": "November 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 186341245}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "After reading some of the reviews of this hotel I was apprehensive about what was facing me. When we arrived at the hotel we were impressed by the reception area and the prompt and friendly service we were given. The only access to the upstairs is by key card in the lift or the door to the stairs so we felt very secure. When we entered the bedroom it was a perfect size for two, flat screen tv and very comfy beds after trekking around Amsterdam. I would recommend ths hotel to my friends and family.", "title": "Excellent Hotel", "user": "nonsta", "date": "January 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 6699497}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "It is slightly out of the centre but the walk to Dam Square is nice and you can experience most sides of the city. I would recommend a map as it can be very confusing especially at night.", "title": "Great hotel", "user": "bainsworth", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 5906274, "likes": {"liked": "— The free internet, flat screen tv and comfy room", "disliked": "— needed a cab for some activites and cabbies here rip you off"}}, {"rating": 2.0, "title": "little mistake", "text": "The only down side was that the shower was very powerful but the shower tray and curtain weren't adequate.", "user": "susandavis", "date": "August 22, 2006", "id": 5694179}, {"rating": 4.0, "title": "A nice hotel to visit", "text": "Great hotel, Very friendly and helpful staff. Pretty good location and good value.", "user": "porschej", "date": "August 21, 2006", "id": 5650192}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Two of us have just come back from a 4 day stay at the Tulip Central and the only souveniers I have are brusises from bumping into the bedroom furniture! The room was so small we had to put our case on the dressing table as there was no floor space, the chair at the dressing table could not be pulled out as it was only about 6\" from the bed and whilst one was getting ready the other had to lie on the bed! Having said that the staff were lovely and the hotel was very clean - how they got a vaccum in the room is beyond me. The location was also very good but i don't think anyone should be expected to stay in a room (105) that size, it certainly should not have been described as a twin room", "title": "A Great Small Hotel", "user": "sashimijazz", "date": "August 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5618374, "likes": {"liked": "— Convenient, clean, friendly, good value", "disliked": "— no coffee/tea making facilities, no small refrigerator"}}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 3, "variance": {"poor": 59, "average": 120, "very good": 193, "terrible": 32, "excellent": 46}, "aka": "Tulip Inn Amsterdam Centre", "slim_ranking": 0.6, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "We’re located in the city centre, near the many bars, restaurants and cafes of Leidseplein. Just a few minutes away are the Vondelpark, Rijksmuseum and Van Gogh Museum, as well as the main shopping streets. We’re a charming and cosy three-star hotel with 70 rooms, a stylish bar, a lounge, free internet in the lobby and the warmest of welcomes from our friendly staff. Enjoy a free fresh coffee or tea during your entire stay!"}