{"user_rating": 4.5, "review_count": 85, "name": "Hampton Inn & Suites Mobile Providence Park/Airport", "reviews": [{"rating": 5.0, "title": "Nicest Hampton I have ever stayed in", "text": "LOVED this hotel, it is simply the nicest Hampton that I have ever stayed in. New, sleek, clean, great staff! There is a lovely outdoor pool. I would suggest upgrading to a suite, very spacious and nice!", "user": "daisy20071960", "date": "November 5, 2012", "id": 144556729}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Great place to stay if you have functions at Southern Alabama University (just 1.9 miles away) Restaurants galore near by!! I like the added touch of \"Cookies and Coffee\" at 6pm. The room was very comfy and roomy. I always judge how old a hotel is by the number of \"Outlets\" that are in the room. This hotel has plenty, and just in the right spots!! I enjoyed the free breakfast, but I missed my \"Gravy and Biscuits\" that the competitors have.The grounds are beautiful, but dont go for an evening walk around the building...YOU WILL GET WET! For some reason they have their sprinklers set to come on just after sundown. (Most hotels wait til 2 or 3 in the morning) So bring your umbrella and rubbbers, if ya want to take an evening stroll. Overall...let's just say, for the money, You Will, get a quiet night's sleep!!", "title": "Quiet night Sleep....", "user": "Greydog98", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144191422}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I stayed here for the first time in June, and I was very pleasantly surprised! The king room was huge and incredibly comfortable. All the staff were caring and helpful, and the shuttle was an added bonus. The hot breakfast was really good every morning. I would most definitely stay here again!", "title": "Very Pleasant Surprise", "user": "shawnda58", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135440632}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Very nice Hampton property with great front desk staff. In a very nice neighborhood with dining options nearby. Only 2.5 miles to the airport.", "title": "Very nice hotel, best airport location in Mobile", "user": "Steve S", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131502254}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I have stayed here multiple times over the past 6 months and every time has been great. The rooms are very clean and the beds are extremely comfortable. I have stayed in both the standard room and the suites. The suites are very large and extremely nice. The complimentary hot Hampton Breakfast is always very good. Nothing bad to say about this hotel.", "title": "Very nice stay", "helpfulness": 1, "user": "MIchael C", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130915396}, {"rating": 4.0, "title": "Good Location to AIrport", "text": "Overnight stay on business trip. Nice accommodation with some good nearby restaurants. Convenient to airport. Fairly typical Hampton Inn.", "user": "InterntlTraveler10", "date": "December 4, 2011", "id": 121378914}, {"rating": 1.0, "title": "GM John Green is Not a Nice Person", "text": "I never got to stay at property due to a booking misunderstanding, regardless, that is not the source of the issue. The issue is that the GM elected to call me 4 hours before arrival to cancel my reservations, I took exception not so much with the cancellation, but that no advance notice was given. To make matters worse he offered no assistance for alternative accommodations. In fact, he went out of way to stress he was allowed to cancel my reservation at any point, because I made an error in booking the room. To top it off he was arrogant and belligerent in delivering his message. After filing a complaint with the Hilton the issue was somewhat resolved; so I thought. The GM after receiving the complaint by protocol is supposed to remedy the situation. Instead he elected to call me back to harass me more about why he was right. I really couldn’t believe my ears.. I am still waiting for The Hilton to address my 2nd complaint about the additional bad treatment by their employee it been 4 days and no response.", "user": "Wheels1978-82", "date": "November 16, 2011", "id": 120664557}, {"rating": 5.0, "title": "Very Impressed", "text": "My Wife and I stayed at this property for 1 night whlie in Mobile and we were both very impressed with the hotel in every way. Every employess greeted us with a hello or good morning. You recieve complimentary water and the all important complimentary high speed wireless internet. The room itself was large and the bed was very comfortable. There was a flat screen LG television that was program with the channels already labeled. It is very refreshing that there are some properties that do not try to nickel and dime you to death for water and internet unlike the larger more prestigious chains. Great job Hampton. If we are ever in Mobile in the future we will definitely stay at this property. It is a little hard to find if you do not map it on google. A sign on the main road would help a lot.", "user": "BeauVinetti", "date": "November 6, 2011", "id": 120228909}, {"rating": 5.0, "title": "Still my go-to hotel in Mobile", "text": "The Hampton Inn & Suites at Providence Park continues to be my favorite hotel in Mobile. I like that it's centrally located and that it's a short drive from the airport, but what I like most of all is the feeling that I'm coming home ... because that's how the staff makes me feel whenever I walk thru the door. It's nice to see familiar faces. From the Managers to the front desk crew to housekeeping and even the grounds people --- everyone has a smile and most everyone will try hard to make your stay a pleasant one. The rooms are always clean, they've never smelled musty and that bed is to die for! The breakfasts are pretty good too. I'm sure there are other pretty good hotels elsewhere in town, but I think I'll stick with this one. This is still my go-to hotel in Mobile.", "user": "twisted_diva", "date": "June 7, 2011", "id": 112067336}, {"rating": 5.0, "title": "Welcomed warmly!", "text": "After a very long, unexpected drive to the University of South Alabama due to inclement weather, it was a wonderful feeling to drive in to the familiar Hampton Inn chain. I knew it would be a relaxing experience and indeed it was. Every employee I encountered truly made my stay a genuinly sweet encounter. I enjoyed something for breakfast I had never had before, a bagel topper! Excellent new item. I look forward to staying there again.", "user": "CoastalTeal", "date": "January 4, 2011", "id": 91750357}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "more bacon on breakfast on bkfst. menu.The stay felt safe and hassle-free", "title": "friendly,efficient service", "user": "decaturliz", "date": "November 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 87223341}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I wish all hotels bent over backwards like this hotel did. We had a baby that the front desk did everything they could to accommodate us including giving us milk for the baby. Wonderful staff.", "title": "could not ask for more", "user": "dhn305", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83154294}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Amongst Hampton Inns, this is the best I have found. Clean, attentive, friendly, and located in a wooded area of Mobile. I stay at Hampton Inn often when I travel because of the consistency and familiarity. So, to find one that is exceptionally better is a real treat.", "title": "Best Hampton Inn thusfar...", "helpfulness": 1, "user": "TexanAbroad", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82451288}, {"rating": 4.0, "title": "GREAT hotel but very hard to find!", "text": "Booking this hotel for a stay may be a challenge, it is my understanding that a number of rooms were blocked for the oil spill. We called the 1-800 number and were told the hotel was full. We called the hotel directly to get a room. There was plenty of space available.", "helpfulness": 1, "user": "nowincolorado", "date": "June 22, 2010", "id": 68291068}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We LOVED this hotel - the staff was unbelievably friendly, they always said hello to you. Even the next morning when I was loading the van, employees who were arriving to work said hello to me in the parking lot - just like I was a friend of theirs - we were very impressed & felt welcomed here.", "title": "Clean and Quiet", "user": "usroadman", "date": "April 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60327107}, {"rating": 5.0, "title": "Can't say enough ... STAY HERE!", "text": "This facility is fabulous, new clean and beyond our expectations. The staff were terrific, the hotel layout was superb and in general, there was nothing to complain about.", "user": "Linda L", "date": "May 26, 2012", "id": 130644669}, {"rating": 5.0, "title": "Doesn't Disappoint", "text": "Our room was large, had a kitchenette area, a seating area, a powder room area ... What more could you ask for? Stay here ... You won't regret it.", "user": "G C", "date": "March 6, 2012", "id": 125715226}, {"rating": 4.0, "title": "Great room....great bed!", "text": "The Hampton Inn properties are one of my first choices for travel in the US. The properties are typically clean, well-appointed, well staffed and offer the full range of amenities a leisure or business travel could require.", "user": "Lacleveland", "date": "March 5, 2012", "id": 125678759}, {"rating": 3.0, "title": "Convenient to airport, but dated, with dirty upholstery", "text": "Located 10 minutes from the airport, this property doesn't disappoint. While the Hampton properties are very standardized,the standard is very high. And this property is higher than the standard. Exceptionally clean and well maintained, the property is very convenient for the traveler requiring access to the airport/industrial area. To be honest the inclusive breakfast isn't going to win any awards for culinary innovation, but is offers a range of healthy options and the hot beverage bar is well stocked 24/7.", "user": "oregonsenior", "date": "February 22, 2012", "id": 125025613}, {"rating": 5.0, "title": "Better than Awesome", "text": "For the traveler that knows what they want,this property won't disappoint.", "user": "jean517", "date": "January 16, 2012", "id": 123159290}], "location": {"country": "United States", "city": "Mobile"}, "stars": 2.5, "variance": {"poor": 1, "average": 3, "very good": 21, "terrible": 1, "excellent": 59}, "aka": "Hampton Inn & Suites Mobile Providence Park/Airport Hotel", "slim_ranking": 0.047619047619}