{"user_rating": 4.5, "review_count": 151, "name": "Hampton Inn Coventry-Warwick Area", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "In a great location, right off the I-95 with many restaurant choices within walking distance of the hotel. A gas station is also close by. We were within 15 minutes of golf courses, water sports and downtown Providence.The rooms are typical Hampton Inn design. Housekeeping appeared to be adequate as we did not encounter any of the problems that a previous reviewer had. We enjoyed our stay and would stay there again. Please note: they refuse to cash any personal checks, even if you are a HHonors member. There is an ATM right down the street, though, and we were not inconvenienced.", "title": "A Nice Hotel", "helpfulness": 2, "user": "Criticaltraveller", "date": "August 4, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5559426, "likes": {"liked": "— Convenience", "disliked": "— Front desk clerks were a bit snippish"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "The Hampton Inn Coventry, at first glance, appears to be a nice hotel for the budget conscious traveler. Just off of I-95, it is located in a very busy shopping center that includes a Home Depot, BJ's, Wendy's and Cracker Barrel Restaurant. There is ample parking. Check-in was hassle free (we had reservations). However, when we arrived in our room, it appeared that housekeeping had not done an adequate job in cleaning up after the people before us. There were cookie and candy wrappers on the floor around the king-sized bed. Several of the pillow cases were missing or stained. The shower curtain in our bathroom was quite moldy. Lamps and the head board were dusty. The following day, I left the pillows without pillow cases on the luggage bench, thinking that the maids would see then and put cases on them, but they ended up back in the closet, uncovered. Housekeeping also failed to place plastic liners in the trash cans. Another couple we met also had the same problems - the shower in their room had not been cleaned after the prior guests had checked out, as evidenced by the used soap and shampoo in the bath tub area. There is a pool and spa area, however, due to overchlorination, they were closed. The complimentary breakfast is not bad - it includes a variety of hot and cold items, all you can eat. If you can get over the housekeeping issues, the Hampton Inn is not a bad place, but could be even better if management addressed the cleanliness issues.", "title": "OK, but.....", "helpfulness": 8, "user": "Arthur A", "date": "August 15, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3763123}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "My husband and I stayed at the Hampton Inn recently for a period of 4 days", "title": "Loved This Hotel", "helpfulness": 7, "user": "globespan", "date": "April 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3401417}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 4, "average": 14, "very good": 49, "terrible": 2, "excellent": 82}, "aka": "Hampton Hotel", "slim_ranking": 0.5, "description": "The Hampton Inn® hotel in Coventry/Warwick Area puts guests close to all of Rhode Island's most popular attractions. From a quaint New England downtown to the grand mansions of nearby Newport, you'll find plenty of museums, architectural treasures and historic walking tours in our area. Take time to explore our very active outdoor scene. Warwick alone has 39 miles of coastline looking onto Narragansett Bay. And Warwick is famous in this area for its \"Miracle Mile of Shopping,\" a collection of specialty stores, thoughtful shops and intriguing retailers. It's all just minutes from our hotel in Coventry.So bring your family to the Hampton Inn hotel in Coventry/Warwick Area. You'll find we make it easy to live large in the smallest state."}