{"user_rating": 5.0, "review_count": 1243, "name": "Hanoi Charming 2 Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I have stayed in this hotel from APR.29,2013 to MAY.2,2013. Before my stay in hotel, arranged the taxi from the airpot to this hotel to avoid the confusion with local taxi. Please be reminded that do not pay to the taxi driver directly for the taxi fare other than tip. I paid to the taxi driver $20( Taxi fare$18 + his tip $2) and last day in my invoice I have been charged for the $18 from hotel. I did not noticed at the time when I signed the invoice since I was kinda in a hurry as checking out the hotel. Later I contacted to hotel as explain that I paid the taxi fare to taxi driver directly and Ms.Linda had solved and handled this matter well. I could get refund of $18 finally. The hotel refunded me without any hesitation, I can't expect this special care if I were in other hotel. Can't be more than thankful.", "title": "Best Hospitality you can get in Hanoi", "helpfulness": 1, "user": "torampoline0907", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160356786}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I arrived at hotel earlier than the check inn time, yet the hotel had prepared the room right away and let us make an early check inn without any extra charge. The hotel furnishes the different kind of furits and 2 bottles of water everyday on the house. We always went our for the local guided tour which comes with lunch, at the evening we are not so hungry, so this fruits saved us a lot.", "title": "Charming hotel in the heart of the old quarter", "helpfulness": 1, "user": "Mick_and_Teresa", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160248077}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "And the breakfast was even better. As many people commented here, \"PHO\" is exellent. We are not used to vietnamese street restaurant yet as sitting low as small as you can. This place surves the exellent \"PHO\" without any hussle and bustle. \"banh Ngot\": bread are all tasted good. we enjoyed the breakfast evey morning with delicious vietnamese coffee.", "title": "Outstanding Staff!", "user": "Tuptim", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160238221}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The receptionist are pretty and charming as hotel name does. Both Mika-chan and Linda are friendly and welcome you like the long time friend. I wanted to send 18 of airmail to Japan, and managed to got the stamps at the international post office near the lake. As I didn't have the time to mail them, asked Mika chan to mail them, she found out that the postage is short for airmail prior to my departure. And the hotel promised me to mail them for me. It is almost a week since I have checked out the hotel, guess it takes sometime.( I mailed to myself too, because the collage pop up card sold on the street is so beautiful worth more than you pay for.25,000 vnd/card).", "title": "Client Needs are #1!", "user": "Debbie S", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160063592}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Last day, I used the laundry service. You need to put your clothes in the laundry basket before noon, it will be get ready around 9 pm in the same day. Paid US$3.40 for it. ( Don't know how much weighed my laundry,) Talking about the weight, the room #603 I stayed had weight scale was there.It is very very helpful for weighing myself and my suitcase.", "title": "Excellent staff and service", "user": "Khaton13", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159981661}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We have stayed here on three occasions over the last four weeks as we have moved between Vietnam and China.", "title": "Okay not the Imperial but even so, a delight.", "helpfulness": 1, "user": "Lemniot", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161124142}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This is our haven, staffed by the most magnificent people we have had the pleasure to stay with.", "title": "delivers its promise", "user": "Ralph W", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161115432}, {"rating": 5.0, "title": "Exceptional service", "text": "Who needs tour guides and agents when you have Linda, Sophie, Mary et al to help look after you. Nothing is too much here. They will take you to the station and see you on to the train, they will collect you from your carriage on the platform. They will see that you always have a room to relax in no matter what time you check out or check in. To have a shower in if you have checked out. It is amazing how ALL the staff here are so brilliant - right down to the doormen and cleaners. No shortage of toilet paper in this hotel.", "user": "WilliamsOnTheRoad", "date": "May 18, 2013", "id": 161108768}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "For the price it is a stunning bargain.", "title": "Welcoming and helpful staff.", "user": "Lina L", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161060560}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Junior Suites are spacious with balconies and have the facilities of a five star hotel with modern pc, large telly, music, wi fi lovely bathroom full of goodies and copious treats for free such as bottles of wine, fruit and candies. It is in a busy part of the old town which we liked. A ten minute walk into town to include at least three hairy road crossings.", "title": "Far exceeded my expectations.", "user": "Ediblemark", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160970767}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel has it all without the price. Even has complimentary computer in room. Centrally located and the staff are falling over each other to be helpful. Great breakfast too. Couldn't fault the hotel. Stayed in charming suite which although a bit extra, was well worth it. We felt like the Royal couple!", "title": "Amazing Stay in Hanoi", "user": "Tony D", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160841890}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Great location in middle of Old Quarter.", "title": "Good hotel with great staff and service", "user": "DaleG80", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160772764}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Rooms are clean and well appointed with free high speed wifi and use of computer.", "title": "Wonderful staff", "user": "CanberraGrandfather", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160632592}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Breakfast has a good selection", "title": "Lovely experience", "user": "TN2013", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 160460250}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Great value and staff who are more then willing to assist with everything to help you enjoy your stay", "title": "Great stay", "user": "Greeniol", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 160443406}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel has a great location in Old Hanoi along the \"bamboo\" street, which makes it easy to find in the labyrinth-like streets of the old quarter. The hotel itself is clean, air-conditioned, and modest, but it is the staff that really elevates your stay into a memorable experience. Everyone - Mary, Johnny, Mr. Zi, and David, to name a few - greeted us by name each time they saw us and it really felt like home. And we especially would like to thank the exuberant Linda, who helped us plan our remaining days in Vietnam, booking us a wonderful night on a boat in Halong Bay and two days at a partner hotel in Sapa. She helped us with some difficult requests and simplified all the hotels, guides, and transportation for our trip. We passed through the Charming 2 Hotel between destinations and each time the Hotel was generous enough to feed us and allow us to change and shower in an empty room, even though our stay with them had already ended! My husband and I were here during our honeymoon and because our time here was so special, we'll always remember our friends at the Charming 2 Hotel!!", "title": "The Best Hotel Staff Ever!", "helpfulness": 1, "user": "pyxer808", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159863352}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "we spent 2 weeks in Vietnam and Laos keeping our base in Charming 2 in Hanoi. it has been like having a house there! the staff is so eager to help and make you feel at home.The hotel is clean, with lovely furniture, very quiet , despite being in the core of the old quarter in one of the busiest part of Hanoi. Rooms are wide, with good Wifi connection, kettle , teabags , coffee, water and fruits offered complimentary.", "title": "Hospitality: what's in a word?", "user": "koenigin223", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 159793696}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We were picked up on time at the airport by a transfer arranged by the hotel and taken to the Hotel Charming 2. Well there it all began, we were made to feel so welcome and special, shown to our lovely room and give so much help and advice that we were immediately put at ease.", "title": "A fantastic welcome our first time to Vietnam", "user": "HolidayhurrahHoliday", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159724013}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Mary and all her team were amazing though out our 3 night stay. They arranged an overnight trip to Halong Bay for us and looked after our luggage while we were away. On our return, it was like meeting long lost friends. They were so interested in our trip and said they had a surprise for our last night. They upgraded us to the family suite which was amazing. All rooms are good and very quiet but this one was a bit special. You get fresh fruit every day in your room and the breakfast is also vey good with freshly cooked dishes to order.", "title": "You must stay here!", "user": "abel_jennifer_r", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159678721}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We cannot speak highly enough of this hotel and though out our travels in Vietnam, we never equalled the service we received here. Thank you so much, you made our stay very special!!", "title": "Excellent Old Quarter Hotel", "user": "PACSQUASH", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159508581}], "location": {"country": "Vietnam", "continent": "Asia"}, "stars": 3, "variance": {"poor": 2, "average": 8, "very good": 128, "terrible": 0, "excellent": 1105}, "slim_ranking": 0.0144032921811, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "A brand new hotel that features 40 luxurious rooms and suites, We offer convenience to our guests by providing modern elevators, restaurants, and other great amenities you can expect from a 3.5 star hotel. Offering fantastic value of money, it is located right in Hanoi Old Quarter, approximately about 5 minutes' walk from Hoan Kiem Lake and the popular Thang Long Water Puppet Show. Indeed, in close proximity to the excellent attractions, We also offer air conditioned rooms, inside room computer and internet, desk, minibar and a balcony in certain rooms. A convenient place of stay, it is a good choice. The Charming 2 Hotel (Add: 31 Hang Ga, Hoan Kiem, Hanoi ) - located in the center of Hanoi Old Quarter, just 5 minute walk to Hoan Kiem Lake."}