{"user_rating": 5.0, "review_count": 646, "name": "Hanoi Moment Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "Great staff, fantastic location, clean, safe and most of a nice refuge from busy Hanoi. The whole team is very nice... from the Front Desk to the Concierge to the Breakfast Waiter then becomes bell-hop. I give you an A! GREAT FOR THE PRICE TOO!", "title": "Great Stay", "helpfulness": 4, "user": "nychellzkitchen", "date": "March 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101309815}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "My new wife and I stayed at the Hanoi Moment on March 5th, 6th and 14th. I would definately recommend this hotel to anyone the service from Tom, Kim, and the rest of the staff was outstanding! This was our first stop in Vietnam for a 4.5 week trip and they arranged a series of tours to Sa Pa and Halong Bay - both were reasonably priced and provided true 5 star levels of service, accommodation, and food quality. A definate highlight was the Indochina Junk boat tour Tom arranged - the food was excellent and the boat upon which we toured the bay on was exactly as Tom and Kim showed us in pictures. Overall, for location, service, food, comfort and accommodation without the pomp and cost of an international hotel chain the Hanoi Moment Hotel is a must stay.", "title": "Excellent Stay with Excellent Service", "helpfulness": 3, "user": "HightowerDuberstein", "date": "March 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 101070987}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Ian and Danielle", "title": "2 star hotel withy great rooms and 5 star service", "helpfulness": 5, "user": "lindanb", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100948471}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed here 6 nights. The rooms were new and modern. Rose petals in the shower. Not large but all conveniences including a flat screen tv and free laptops in each room. The hotel is well located in the Old Quarter. The staff are nothing short of unbelievable. Any requests were met immediately. We wanted water puppet tickets. They sent an employee down in the morning as soon as the box office opened and charged us nothing. I couldn't find my plug adapter. They went out, bought a bag and gave me one to keep. Free. All staff were smiling and friendly. The level of English was good. Breakfast was good. Check out the sculptures the chef makes from melon rind, carrots etc. We used room service one night and the food was good. Don't know if I'll ever be in Hanoi again but would stay here if I was.", "title": "Excellent Boutique Hotel - Perfect Location", "user": "SometimeTraveller123", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100803485}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Would thoroughly recommend this hotel.", "title": "Absolutely the Best Hotel!", "helpfulness": 5, "user": "dolorosa", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100633288}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Don't know if this is the best value hotel I've stayed in but it's up there. In the centre of the old town in Hanoi, it is brand new, with all facilities (incl free broadband internet in the room, DVD library for the in-room player). Breakfast is copious and good. Management and staff are super friendly and helpful staff. Terrific!", "title": "Value with a smile", "helpfulness": 5, "user": "NiceMartin", "date": "February 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 97171150}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We stayed 3 nights at the Hanoi Moment Hotel. We stayed in many hotels, but we have rarely experienced such service. The breakfast was perfect, no buffet, but all you can eat menu. The rooms are new and clean, we stayed with the family of 4 in one room, the kids loved the laptop. and the free dvd's. Highly recommended. Good location in the middle of the old town. Not the cheapest in town no doubt, but well worth the price.", "title": "5 star service!", "helpfulness": 5, "user": "4ofUS_eis", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97088467}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "We booked directly with the hotel after a friend's recommendation. The hotel owner and staff were very friendly and flexible. The single room doesn't have any window, but was very clean. Free WiFi added up to the convenience. Excellent location in Hanoi center, with all the street food and souvenirs only a step away. Street direction given by staff were not correct, but I would not blame them. Even Hanoi local are still confused by the old quarters' small valleys.", "title": "Exceptional Service! Good Value for Money", "helpfulness": 3, "user": "Trang P", "date": "February 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 96398039}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "For once you can believe the photos and the blurb on this hotel's website and emails. The rooms were exactly as represented, with modern, very comfortable furnishings. The beds were great- not too hard- and very well made (not a given in all the hotels we stayed in). The shower was great- and the bathroom spotless.", "title": "Exceptional value, exceptional service- a modern gem", "helpfulness": 5, "user": "annatb", "date": "February 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 96320775}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Our rooms were cleaned to the highest standard every morning, with all our things tidied up as well. There were nice touches, like having a dvd player in the room, and getting a plate of sweets on our bed at bedtime.", "title": "Immaculate service!", "helpfulness": 5, "user": "whitericeculture", "date": "February 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95854869}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "The staff of the Hanoi Moment are exceptional. We were promptly picked up at the airport and provided with every service and accomodation to have a wonderful experience in Hanoi and the hotel. The breakfasts were wonderful. Mr. Michael and Mr. Tom arranged for excursions to Halong Bay and Sapa and were dedicated to ensuring quality tour experiences. While we were on the excursions they provided secure storage for our luggage. When we returned from Sapa they were able to provide an early check in to our room. The rooms are very quiet with double paned glass to block out the traffic noise and believe me this is very important in Hanoi. Each room is also equipped with its own laptop. I have traveled in many countries and I cannot think of another hotel or staff that have provided such excellent service and accomodations. I highly recommend this hotel.", "title": "Unsurpassed service...highly recommended!", "helpfulness": 5, "user": "trvlfunBillings_MT", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99325121}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The reviews on TA are not wrong! From the minute we landed in Vietnam and were greeted at the airport with a smile, this hotel seemed like it was going to be fantastic, and it was. It's in a bustling section of Hanoi, but whisper quiet inside - so comfortable and modern. But as everyone else says, the thing that really makes this hotel wonderful is the service. Michael and his team go above and beyond to make Hanoi an easy experience. The crazy city can be stressful and challenging, but they do everything they can to make it a breeze.", "title": "Don't look anywhere else - this is the best hotel of all time!", "helpfulness": 4, "user": "janeyjane83", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98751185}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Here's an example. On the fourth day of our trip, my partner and I fell very ill with food poisoning (not from the hotel food, which is excellent and clean!). The staff gave us medication (at no cost) and even though they were fully booked for that night and we were due to check out, they rearranged our train tickets and found us a hotel around the corner to stay in and recover. They organised a complimentary taxi and had a staff member ride with us and take care of our bags. And it didn't end there. The customer service manager, Michael, came around later that night to the hotel to personally drop off our laundry and check if we were OK.", "title": "Great place, relaxing and peaceful", "helpfulness": 2, "user": "signaturemice", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98668087}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The next day they invited us back for breakfast at the hotel (even though we had checked out the day before!) then sent a staff member in the taxi to the train station with us to see us off safely.", "title": "Great Place to Stay", "helpfulness": 5, "user": "travis2827", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98586415}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "This place is a real find. If it weren't for the staff here, we would have had a very bad and stressful experience. While food poisoning is awful at the best of times, it's far worse when you're in a country you are unfamiliar with.", "title": "BEST service in SE Asia", "helpfulness": 5, "user": "MissKTT", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97604205}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This hotel is just 6 months old, and its giving the others a stiff competition.", "title": "New Kid on the block", "helpfulness": 2, "user": "SushNam", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 100577853}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I was in Hanoi for my Fiancées bday, and they baked a small cake along with complimentary wine. Everyone wished her and I didnt expect so much attention to detail.", "title": "just lovely", "helpfulness": 6, "user": "DonnaFo", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100350946}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The location is perfect on a wide street (which is kind of rare in Hanoi). The people who work here are really sweet and very helpful. We were treated like VIP's.", "title": "Great stay with awesome staff!", "user": "traveller2107", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100249301}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The breakfast has many options as well. (Their croissants are huge).", "title": "Hanoi's hidden gem in the Old Quarters!", "helpfulness": 6, "user": "Devrave", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100226789}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Would love to stay here again, though they need to rework their rates for international calls(others charge 40 cents per minute, while these guys charge 1.40$)", "title": "Excellent Service", "helpfulness": 5, "user": "will_9441", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99774060}], "location": {"country": "Vietnam", "continent": "Asia"}, "stars": 3, "variance": {"poor": 0, "average": 4, "very good": 79, "terrible": 2, "excellent": 561}, "slim_ranking": 0.0184804928131, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "We, at the Hanoi Moment Hotel, located in the heart of Hanoi’s old quarter, are proud of our customer service and friendly staff. Our rooms are furnished to the highest standard. A décor of dark wooden furniture, charcoal and grey colours contrast with white and hints of bright colours giving a trendy modern feel. A cosy hotel run by a small team of professional and enthusiastic staff where you will experience many moments of peace, good service and a welcome smile."}