{"user_rating": 5.0, "review_count": 266, "name": "Happy Prague Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The location was easy to find and gave us quick access to every form of public transportation available in Prague, as well as all the major sights we had on our to do list. We parked our car the evening we arrived and didn't need it again until the day we departed. The apartment was nicely decorated, the kitchen well equipped, and the bed/linen super comfortable. Did I mention the heated bathroom floors...sheer heaven as the temperature dipped in the evenings :-) The building is tucked in next to a church and secured behind a gate that is locked at all times. The staff, Ciro in particular, was friendly and very helpful. Based on Ciro's recommendations we ate some of the best food that Prague had to offer. Having a great place to rest your weary feet at the end of a long day of sightseeing cannot be overstated. This was hands down one of our best family trips!!", "title": "We can't say enough wonderful things about this hotel", "user": "tshellthom", "date": "January 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93214869}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "We had an excellent stay in Happy Prague Apartments!", "title": "We had an excellent stay in Happy Prague Apartments!", "user": "laura_baro", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87919407}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Everything was perfect: comfortable apartment, clean, very well located and with great attention by staff.", "title": "Perfect place in the best spot of Prague", "user": "Giel-travels", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 85522794}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed three nights at Happy Prague. The location is perfect! Easy to get there by car, you can park your car safely behind the building. Near -walking distance - of all the highlights of the old town.", "title": "Amazin location, great apartment, good service", "user": "TheKoolGang", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85306007}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The appartment itself is huge! Recently restored and newly furnished, with a very nice style. The Italian guy(s) who owns and runs it are very nice and like they say, you don't need your lonely planet, they are it!", "title": "It was perfect", "user": "sjgch", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84715013}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The apartment was roomy and clean. The service was great. It's centrally located, just blocks from both Old Towne and the Charles Bridge.", "title": "Beautiful apartment in a fabulous location", "user": "tscott9", "date": "October 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84637518}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Easy to book and find (take bus 100 from airport to metro line B (Zlicin), your stop in city center is Narodni trida. Citysenter (approx 500 m from Charles Bridge), still away from tourists crowd. From metro station short walk to the hotel, gate is closed but ring the bell , office hours 9am to 6pm (inform beforehand if arrival is later). Medival house is former monastery with small yard. Convinient modern apartments with all what you'll need. 95m2 apartment for 2 person (possibility for 2 additional persons; 2 separate sleeping rooms and 2 WCs) costs as much as smaller one for two. Price for additional bed is very reasonable, too. Free wifi, free use of computer during office hours. Clean, wooden floors, Mr Di Cicco Ciro from management is very helpful. Lot of bars, beer, wine etc shops around. We just loved Happy Prague Apartments!", "title": "Great apartment, great location and rates, great management", "helpfulness": 1, "user": "Eppaxiemps", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 80695881}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The apartment was close to the main sites, public transport wasn't necessary, but away from the tourist hoardes and traffic. The kitchen was reasonably equipped if you wanted to cook a meal. A computer/internet was available for guests to use in reception. Ciro the manager was bright and enthusiastic, and very helpful if you neeeded information.", "title": "A happy stay", "user": "mrsm2010AlAin", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 80682684}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Recently stayed at the happy prague and enjoyed my stay.set out over 3 floors the facilities are new and clean. The location is outstanding 5 min walk to old town square yet in a quite part of prague. Our host Ciro was friendly and very helpful with tips on prague. A great stay highly recommended just be mindful if you have a problem with stairs request not be in the upper apartment", "title": "Recently stayed at the happy prague and...", "user": "B_Travel_7", "date": "September 16, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 79775198}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Unlike many previous reviewers, I found both pluses and minuses in my stay. We stayed in a two-bedroom apartment on the first floor. The apartment was huge -- very large living room, kitchen, and hallway/study area. The second bedroom isn't so much of a real room, but more an alcove off the living room. The apartment was very clean with very new furnishings. Another big plus was the location -- convenient to everything in the Old Town, right in the middle of everything. The apartments are located next to a church on a generally quiet plaza. At night, however, groups of youths like to hang out at a bench right in front of one of the bedroom windows. There was a fair amount of noise and disturbance on several nights from these people. Other minuses: the apartment has minimal staple supplies -- really only dish soap; there was a dishwasher but no dishwasher detergent to use with it. Also, there were problems with hot water outages. In-room wireless internet service was spotty and temperamental -- you had to sit very close to the front door to get a constant signal. So, while I agree with other reviewers that Ciro was very friendly, and I wanted to write a very positive review, we found some problems.", "title": "A more mixed review", "user": "formershrink", "date": "September 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 79257479}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Great apartmnets in the heart of Prauge. Don't leave you keys inthe back of the door though as if it closes, you won't be able to open it.", "title": "Awesome Apartment!", "user": "mattx81", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77904661}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This is unequivocally the best place we've ever stayed at in Europe. We loved the convenient, central yet quiet location, the amenities, the surrounding cafés/restaurants, and most of all, the disarming hospitality and friendliness of Ciro, Happy Prague's host, who clearly loves his job.", "title": "An unforgettably lovely and warm place to stay with Ciro a gem of hospitality", "user": "orange60713", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70818467}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I stayed with my wife and 4 kids in this appartment. Very spacious and location couldnt be better. Few minutes walt to old towns square and old bridge. Very clean appartment. Well equipped. Though it is close to main attractions it is located in a very quiet and nice area. Ciro is always there to help you and makes the difference as he goes the extra mile to ensure you take the most of your stay in Prague.", "title": "Great Place for a family stay. Ciro Di Cicco makes the difference", "user": "Robusta_10", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69907499}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Very well located in easy walking distance from all 'must visit' attractions in Prague. Apartment is a modern convertion of old Church building - rooms are large and airy with all modern amenities, including modern plumbing. We like the convenience of the self-catering kitchen area for breakfast, but cafe across street will provide and charge-back to your bill if desired. Happy Prague is located on a quiet square with 4 or 5 cafe/bar/restaurants on doorstep (even a good Indian restaurant nearby) - British will appreciate having a Tesco supermarket around corner.", "title": "Great apartment, great location, great value", "user": "xxbombus", "date": "June 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68836432}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "Alfredo and Ciro could not be more helpful - recommended for a secure and comfortable stay.", "title": "Lovely venue", "user": "frostyPresov", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67155995}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband and I together with another couple stayed at Happy Prague apartments in May for three nights. We could not say enough wonderful things about our stay here. Clemente was a very welcoming host who gave us lots of helpful information about places to eat, things to see etc while in Prague. The apartment that we stayed in had two very spacious bedrooms, one bathroom with all facilities and a second toilet. The living area was also large with a great kitchen. The location was also great - right in a little square called Bethlem with a couple of restaurants right outside - also easy walking distance to everything. We would definitely stay there again and would recommend to anyone.", "title": "Fabulous Accommodation", "user": "Lorraine054", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66816487}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "2 friends traveling experiencing Europe. 5 nights / 6 days. Self catered.", "title": "The Best place to stay in Prague - You'll be happy that you choseto stay at Happy Prague!", "helpfulness": 1, "user": "ozcarwylde", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66707718}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "SUMMARY", "title": "Magic apartment in magic location in magical Prague", "user": "DandK39", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65209574}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "This is one of the best places I have stayed in Europe. Quite simply because of location, facilities, and friendliness of Ciro your host. It is well worth the 5 star rating for the sheer value of what you receive. There are a couple of short comings (as with all places, but they did not affect my stay or review)", "title": "Good for value. Would have given 5 stars if we could get into the wireless internet.", "user": "travelsia", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64972080}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "WELCOME", "title": "Great stay", "helpfulness": 1, "user": "Philippa D", "date": "May 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63345537}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 4, "variance": {"poor": 1, "average": 4, "very good": 38, "terrible": 0, "excellent": 223}, "aka": "Happy Prague Apartments Hotel", "slim_ranking": 0.0175438596491, "description": "Happy Prague is a complex of apartments of various types, designed to meet all needs. All apartments are large square, bright and elegantly furnished. Excellent for any type of accommodation, ideal for families, couples, single and all sorts of business.Located in a unique historic building dating from the late fourteenth century, completely renovated, has maintained that the authenticity of its original character while offering modern amenities and service.The property is located in quiet Betlémské Náměstí, adjacent to the famous Betlémské Kaple, far less than 100 meters from Charles Bridge and Old Town Square and from major tourist attractions. In this splendid setting, guests will be surrounded by a thousand attentions of a multilingual staff of professionals in order to make the stay in the Magic City."}