{"user_rating": 4.5, "review_count": 708, "name": "Harbor Court Hotel - a Kimpton Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We just got back from a one night stay at the Harbor Court Hotel. This was a very nice experience and the location was top notch! The things we liked about the hotel: friendly staff, comfortable bed, complimentary wine/beer hour in the lovely \"living room\"/lobby area, warm cookies & milk before bedtime and of course - location!! Make sure to check out the Ferry Terminal Marketplace just across the street. Lots of great goodies!", "title": "Great Location - Nice Extras!", "user": "daisymay1", "date": "April 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14868323, "likes": {"liked": "— Location of the hotel", "disliked": "— Room was small"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Yes, as everyone else mentioned - the room is small. But come on people --it's San Francisco! Many of the hotel rooms in SF are small. We didn't find it too bad (and we are large people!) If you can afford to get a room with a view - do it! We just had a small window looking out onto a wall, but we also paid half price using Priceline - so we didn't mind!", "title": "Small, but nice", "user": "spreadsheetqueen", "date": "March 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14113529, "likes": {"liked": "— Location", "disliked": "— Room size"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "Our stay at the Harbor Court Hotel was very nice. The staff was friendly and helpful, the rooms were very nice. I stayed there for a weekend with my children, but thought it would be very nice for a romantic weekend in the city with someone special. The rooms are small, so if you are the type of person who stays at a hotel for all it has to offer, this may not be the place for you. However, if you are like me and go out of town to enjoy all that the city has to offer, and just like a nice place to come back to, this hotel is perfect. Great location, and pet friendly so you can bring the pooch.", "title": "Great hotel", "user": "cybergec", "date": "March 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14025259}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "My husband and I just spent a weekend at the Harbor Court Hotel. We would definitely stay here again. Our room had plenty of room and the staff was very helpful. We had access to the YMCA next door also. On top of that, we received a $135/night web rate.", "title": "Superb!", "user": "nickwhite26", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13939314}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "It is only a few blocks to the nearest BART station and is situation in a good location overall. You can access the train or bus, or just walk down to Fisherman's Whart.", "title": "Loved Harbor Court", "user": "NoFrowning", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13830528, "likes": {"liked": "— The view from my room!", "disliked": "— There wasn't anything I disliked."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "A little off the beaten path of the Union Square and FiDi mega hotels, yet it is just two short , safe blocks from a Muni/Bart Station. We had a bay view room w/queen size bed on the 4th floor. Yes, it is a small room but if you are a light traveler it isn't a deal breaker. The bay view room prevented it from being claustraphobic. When we first saw our room I was a little concerned that it might be noisy but the building is well sound proofed and we could not even hear other hotel guests. Many fine restaurants are nearby, as well as the Ferry Bldg. across the street on the bay side and YanK Sing for dim sum on the other side of the hotel. With public transport so close you can travel to a lot of great attractions and restaurants fairly easily. The staff was very professional and personable. Overall, a very nice stay.", "title": "Location and view makes up for room size", "helpfulness": 2, "user": "lefty_lucy", "date": "January 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12997711, "likes": {"liked": "— The view", "disliked": "— zip"}}, {"rating": 2.0, "title": "Just ok", "text": "When we first arrived we were able to have a early check in which was great. The atmosphere of the hotel was great as well as the lounge area with its fireplace and flat screen tv. Upon arriving to my room, I went into shock. The room is a staggering 145 square feet!! I have seen bigger motel rooms. Me and my wife kept bumping into each other whenever we both walked around the room. We only came to view the fireworks and thank God that we didnt have to stay any longer than a day. We were able to see the entire show (fireworks)as the barge was directly in front of the hotel! This was the best thing about the hotel.The flat screen tv was off centered from the bed which was ackward and it didnt swivel. The ice holder was so small the only thing you could have put on chill was a 12 ounce soda. The internet was absolutely great as well as the view of the water and bridge. The only drawback here was that the windows were only about 32 inches wide which meant if you really wanted to enjoy the view, you had to stand in front of it. The hotel has no restaurant , but a contract with japanese restaurant next door.Restaurant next door caters to the hotel but don't expect full breakfast. Most places around hotel are closed on the weekends which puts you far from most of the city action. The hotel also doesn't have a gym so if you want to workout , you'll have to go next door to the YMCA which has a contract with the hotel.Upon trying the shower we found out that the water was just luke warm. The clock radio implied that everyone owns a ipod so you couldn't play cd's -I feel anything over $200 should have a cd player. Later in the night we started smelling cigarette smoke. Thats when I noticed that the door had a slight crack that let light and smoke inside my room. Room is so small that theres no room for a coffemaker even if they tried to provide one. So they serve coffee downstairs to make up for it. So, now you will know why this place is so cheap for the location.", "user": "thefactsplease", "date": "January 2, 2008", "id": 12236956}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Stayed 11 nights at the Harbor Court beginning of November, 2007. I loved it. Yes, bedrooms are small but as a single traveller my room was plenty big for me. Bed was so comfortable. Stylish decor. LIked the extra touches like the wine reception and complimentary coffee in the mornings. I found the staff very efficient. I will stay here again on my next visit for sure. The area around the hotel is ecellent - full of upscale restaurants. Very close to Muni/Bart and the streecars which I loved.", "title": "Loved it!", "helpfulness": 4, "user": "nwalesguy", "date": "December 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11983225, "likes": {"liked": "— Location and Quality Overall", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I stayed two midweek nights at the Harbor Court ( a Kimpton property) and found the location, amenities, and design to be top notch. The welcome is warm and gracious, and staff make an attempt to satisfy your every need. I paid $224/night for a deluxe king bay view room (senior rate on the Kimpton website), and while not inexpensive the rate was better than the larger chain hotels in the city, especially the Hyatt Regency and Le Meridien that are close by. I'm normally a loyal Starwood guest, but this time I decided to try Kimpton, and the experience was gratifying.", "title": "Stylish, Wonderful Location", "helpfulness": 4, "user": "kiwitravelerpdx", "date": "December 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11576221, "likes": {"liked": "— Location, amenities, and stylish design", "disliked": "— Small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Pluses:", "title": "nice hotel and great location", "helpfulness": 1, "user": "travelboy08", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10929838, "likes": {"liked": "— location/comfort", "disliked": "— parking price/ mini bar prices"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We book this Hotel for its location , it is very central and it could be walking distance to Union Square and china town, we got a good deal on the price but still have to say the rooms are tiny, the room that got assigned to us was on the 6th floor and did not have a window, very dark, if you are claustrophobic this hotel would not be a good option. basically you pay for what you get.", "title": "Ok hotel", "helpfulness": 1, "user": "sandritaru", "date": "February 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 13349391, "likes": {"liked": "— Very nice lobby and friendly staff", "disliked": "— Rooms are very small and dark"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Nice Staff and very nice lobby, walking distance to the market.", "title": "Great place to stay in San Fran", "helpfulness": 2, "user": "travelvixen9", "date": "February 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13308797, "likes": {"liked": "— Great service, nice extras including free wireless", "disliked": "— No in-room safe"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "If I ever go back I would pay to upgrade the room for a room with a window.", "title": "Very nice boutique hotel just be warned the rooms are small", "helpfulness": 2, "user": "JR_in_NYC", "date": "February 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 13247641, "likes": {"liked": "— Chic hotel, free wireless internet, close to major attractions", "disliked": "— Expensive parking"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We just spent our second visit at the Harbor Court, and we will certainly be back. Our company has an office in the Embarcadero Center, which requires us to stay in the area. The Harbor Court is just a couple of blocks from there and an easy walk.", "title": "Great Place To Stay...Very Accomodating!", "helpfulness": 2, "user": "mkmiller63", "date": "January 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13160241, "likes": {"liked": "— The great staff and the decor.", "disliked": "— The room size."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The hotel is clean and the staff are friendly and helpful. The rooms aren't overly spacious, but adequate. The typical Kimpton touches such as complimentary wine in the evening, and fresh cookies at 9pm are nice. New York Times and Wall Street journals are available in the lobby and can be delivered to your door.", "title": "Everything was fantastic....", "helpfulness": 1, "user": "ntomlinson", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13100896, "likes": {"liked": "— Friendly/professional staff, wine/beer hour every night.", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Two of us stayed at the Harbor Court for 3 nights Fri, Sat, Sun in October. We stayed for the good rate we got and its location close to the Ferry Building...great food.", "title": "Good stay at usual Kimpton", "helpfulness": 2, "user": "kasialouise", "date": "October 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10457486, "likes": {"liked": "— decor and lobby", "disliked": "— lack of light, view"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We had a \"corner\" room 610 queen bed \"overlooking\" Steuart St, but there is only one window overlooking the air conditioning unit of the building. The window opens. The unit on the roof is not noisy during the day, but I found it a bit irritating at night and slept with the TV on all night to disguise the sound. Room was clean and housekeeping honored our note for extra towels.", "title": "Small But Interesting Boutique Hotel", "helpfulness": 3, "user": "thekld", "date": "October 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 10267098}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The desk chair was an impediment to getting to the bathroom, so I moved it between the entry door and the bathroom door.", "title": "Excellent service, tiny bathrooms!", "helpfulness": 3, "user": "amieckow", "date": "October 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 10087024, "likes": {"liked": "— The staff", "disliked": "— The tiny bathrooms and lack of lunch options on the weekends!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "There are 2 drawers in the platform bed and a small armoir for hanging clothes with ironing board, iron. There are 2 electrical outlets right on the desk. Lights with dimmer switches at both sides of bed, light on armoir, desk lamp.", "title": "Very Nice, great location", "user": "AmstutzHerndon", "date": "October 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10064994, "likes": {"liked": "— Location and view", "disliked": "— size of the room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Lobby coffee in the morning was fine. We bought bread at the Ferry Building to go with our morning coffee.", "title": "Very Thoughtful Service & Loved the Attention to Details", "helpfulness": 1, "user": "Travel-Fanatic714", "date": "October 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10033486, "likes": {"liked": "— Very nice decor", "disliked": "— Small rooms"}}, {"rating": 5.0, "title": "Loved the Harbor Court", "text": "We recently stayed at the Harbor Court overnight, my husband and I, plus our terrier-mix dog, Jake. Since we booked a smoking room (almost unheard of in California) we did not have a view of the bay and the Oakland bridge, but they are just right outside the hotel's back door. I would add that the smoking rooms are kept clean and do not reek.", "helpfulness": 8, "user": "LoveTheOldWest", "date": "March 23, 2005", "id": 3297373}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "The rooms are superbly decorated, with major remodelling in progress when we visited in late February. This hotel is located right on the waterfront, in the Embarcadero area - a beautiful area. Rooms have many nice amenities, including warm color designs, flat-screen tv's, tiny, but beautifully appointed bathrooms, fluffy bathrobes, nature-sounds provided, beautifully appointed beds, and quiet rooms with windows that open.", "title": "Awesome", "helpfulness": 4, "user": "soderblom", "date": "March 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3291979}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 18, "average": 55, "very good": 252, "terrible": 16, "excellent": 367}, "aka": "Harbor Court Hotel", "slim_ranking": 0.0936170212766, "description": "The Harbor Court Hotel, a stunning boutique hotel on the San Francisco waterfront, features unobstructed views of the bay, the Bay Bridge and Treasure Island. The spectacular location is complemented by the hotel's luxurious and stylishly designed rooms. Adjacent to a state-of-the-art YMCA (open to guests), the Harbor Court Hotel is within easy walking of the Ferry Building Marketplace, the Financial District, AT&T Park, the Moscone Convention Center, Union Square and North Beach."}