{"user_rating": 4.0, "review_count": 766, "name": "Harding Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Harding hotel is right outside of the Temple Bar area and is pretty inexpensive. You're just getting a basic room with nothing lavish but a comfortable bed and very friendly service. The desk help me plan all of my activities and made sure I knew when and where to be and were always happy to answer any questions that I had. The hotel is attached to a bar and restaurant that's worth spending a little time in.", "title": "Close to everything and what you need without breaking the bank", "user": "Jayhawkk", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166975565}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "If you plan on experiencing more of Dublin and less of your room then you can do a LOT worse than Harding. I plan on staying there again.", "title": "Great Location", "user": "tspirit57", "date": "July 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166792334}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed here in June. Loved being across from the church and hearing the bells. We had three single beds. The room was large with a view of the church. The airport link stops within walking distance. Hop on Hop off bus near by. Good location for a home base. The bathroom shower is not very good (it is a Tray Shower. The water leaked all over. We really enjoyed the location. The bar can be noisy on the weekend, but it stops early so not to bad. The breakfast was OK and at 9.50 Euros not worth the price, but did include juice, coffee or tea. The early morning staff was friendly, but the night time staff was not as friendly. I would suggest this hotel. It is not fancy, but the location is great. We enjoyed this hotel over the Pembroke Townhouse.", "title": "downtown in the middle of everything", "helpfulness": 1, "user": "monkeysmom21", "date": "July 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166430546}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Cheers", "title": "Idea location, clean and friendly", "user": "CheerfulDragon", "date": "July 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166360137}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Terry", "title": "Great location and reasonably price", "user": "Pink C", "date": "July 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 166321088}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The location is great. The staff was very friendly and helpful. Our family group was large enough that we needed three rooms. They were all clean and convenient, however they were warm and without much means to cool them off. Two had fans and one had an inadequate air conditioner. Noise from the pub downstairs was the trade-off for leaving your window open at night. That said, it's a nice place for a night or two.", "title": "Nice Enough", "user": "WarrenGrove", "date": "July 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 166258381}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Chosen only because of availability and low price, at very short notice after a quick internet search, it turned out to be a very lucky find. Centrally located but not directly exposed to noisy pubs/discos or other crowd-attractors. Personnel is very nice and helpful, rooms are spacious and clean with very comfortable beds. Airport coach stops just around the corner. Within walking distance of most points of interest and well served by public transport. A friend who was staying elsewhere commented she was paying twice as much the price for half as much the quality the Harding offers. Only stayed one night, but thoroughly recommended.", "title": "Lucky find, thoroughly recommended", "user": "SisGno", "date": "July 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166027158}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "top located hotel in temple bar. it is easy to reach by the airlink bus and you can walk all sights. we stayed there for 3 nights, the room was very clean and big enough for three persons. the bathroom was new and also clean. the staff was very friendly. eventhough the breakfast wasn´t that good but i think that´s normal in the uk. there is a pub next to the hotel and it was quit loud at night... without earplugs you can´t even think about sleep.", "title": "top located", "user": "Christin M", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 165927966}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "On a recent trip to Dublin, we stayed at the Harding Hotel for two nights. The hotel has a great location and is very close to multiple restaurants and bars. It is located above a pub called Darkey Kelly's but we didn't have any issues with noise. The concierge, Jonathon, was wonderful and extremely helpful. He took the time to show us how to get to places with a map and gave recommendations about how to get to the train station. In fact, everyone we interacted with that worked at the hotel was very kind and courteous. The room was very clean and had a spacious bathroom. I would definitely stay here again!", "title": "Awesome Place!", "user": "Katie M", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165800221}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "I was in and out of Dublin 3 times in May 2013 and stayed at the Harding all three stays. The location is outstanding, can't say enough about that. And all who worked at the hotel, and I do mean all, were professional and helpful. I will say that there was a bit of a serious mix-up on my room the first day, but hotel manager Jonathan Hynes did sort that out very competently and in short order, and made me feel comfortable in the process. The room was (as expected, after reading other reviews) somewhat worn, and had very basic amenities, but was quite good for the modest price. Darky Kelly's, the pub that is physically attached to the hotel, was quite busy every night, but the barkeeps there were most excellent (most especially David - thanks to David for making this solo traveler feel well taken care of). Copper Alley Bistro, the restaurant attached to the hotel, was good - not outstanding, but good, also very convenient, and a great corner spot to watch the people walking about outside the big windows. The luggage storage was very handy on several occasions, and the free Wi-Fi a real plus. I really enjoyed my room across from Christchurch, with wonderful windows that opened to the street, and would easily choose the Harding for my next stay in Dublin.", "title": "Perfect for the Price", "user": "AnneSFO", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 165679257}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Stayed here for 1 night. Room was clean with a huge double bed. Another nice touch was the fridge & tea & coffee making facilities.", "title": "The bells the bells", "helpfulness": 1, "user": "waller36", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 165569685}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The bathroom had a step on it with a sign saying \"mind the step\" but I did have to keep reminding myself. The shower was ok but a light shower curtain did not stay in place so water went all over the floor. The room was also very hot and the fan did not seem to make a lot of difference.", "title": "Sweet Little Place...Our Secret", "user": "WH_OU812", "date": "June 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165492804}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "However I would overlook all of this if it was not for the bells of Christchurch which ring every 15 minutes 24 hours a day.I don't know if better insulated windows would help. I got about 3 hours sleep.The breakfast was very good we had the full Irish & the veggie breakfast.", "title": "great location and price", "user": "adampietz", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 165459066}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The staff in the copper bistro were very friendly.", "title": "Great choice of lodging in Dublin!!!", "user": "Tammy K", "date": "June 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 165444802}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The hotel came recommended to us by someone we trust who said it was a nice place and centrally located. In fact, it was a very nice place and was very centrally located. First off, the staff were all friendly and considerate. They were also very helpful in helping an American tourist with no sense of direction and pointing them in the right direction to see the sites. Room was clean and simple. Downstairs is a nice little \"bistro\" that serves a wonderful breakfast and the staff there are also very friendly and nice. Meals can be charged to your room to make life easier. And if your thirsty after a day's trekking though the streets of Dublin there just happens to be a pub located and accessible from inside the hotel.", "title": "Friendly staff, great location and good price", "user": "Dom97421", "date": "June 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 165361962}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Only had an overnight stop on a work trip but would certainly go back here. The location's good for seeing the sites but still on a quiet enough street to enjoy a good sleep. The room was really big and had everything you'd need for a comfortable stay, including an iron/board attachment on the trouser press which came in particularly handy! Despite visiting during a heat wave, the room was cool and a standing fan had been put in the room too. Definitely recommend it!", "title": "Friendly atmosphere and great value", "user": "gillhan", "date": "July 13, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167398522}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Harding hotel is a nice place. Good service. Only good words about the hotel.", "title": "High recommend.", "helpfulness": 1, "user": "StRazors", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167379815}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Very reasonable rates and great location at the City Center district. The bells from the nearby church also ring out day and night, but the bells sound is very pleasant.", "title": "Great Location.", "user": "coggin666", "date": "July 11, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 167147584}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "High recommend.", "title": "Great Location to stay", "user": "louise1199", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167088107}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Very reasonable rates and great location at the end of the Temple Bar district. The room was clean and tidy and only let down by the small wall mounted TV and lack of air conditioning (there was a fan in the room). The bells from the nearby church also ring out day and night.", "title": "Great location", "user": "Lorraine B", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 167002422}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 2.5, "variance": {"poor": 25, "average": 107, "very good": 352, "terrible": 11, "excellent": 271}, "aka": "Harding Hotel Dublin", "slim_ranking": 0.173184357542, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Harding Hotel is a red bricked, traditional property located between the fashionable and lively Temple Bar and the old city areas of Dublin City, suiting both the leisure and business traveler, with comfortable 3 star quality rooms and facilities, coupled with a warm, welcoming, friendly service.Our spacious rooms are decorated in warm and relaxing tones, some offering views of the cathedral and are equipped with TV, iron and ironing board, tea/coffee making facilities and fridge. Our comfortable beds, fresh linen and towels all serviced daily, will ensure that you just have to relax and enjoy the city when staying at the Harding. So why not come and sample the warm welcome, the excellent location, the spacious rooms and see for yourself how easy life in the city can be when staying in the Harding."}