{"user_rating": 3.5, "review_count": 3078, "name": "Hard Rock Hotel and Casino", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed at the Hard Rock for New Year's Eve to see Supernova. We are seasoned travellers and have stayed at many hotels in Las Vegas. The rooms at the Hard Rock were just mediocre. They don't provide blankets, coffee makers, or even a vanity mirror. Our first night there, the shower drain was plugged so bad that it was flooding. When we tried to call customer service, the phone didn't work. We had to call the front desk using our cell phone. They did send someone to fix the shower that evening. The beds were lumpy and the bathrooms were so small that you have to be careful to avoid rubbing up against the toilet while closing the bathroom door! Oh and get this...There is an extra $20 charge per person to use the gym each time.", "title": "Big Disappointment!", "helpfulness": 4, "user": "sandchaser", "date": "January 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6541021, "likes": {"liked": "— Party scene", "disliked": "— Hotel amenities included with room charge"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The casino was a happening place during the evenings. They need to update their ventilation system to handle the cigarette smoke and upgrade their sound system which sounds sub-standard.", "title": "hard rock is the best", "helpfulness": 4, "user": "cushman78", "date": "December 10, 2006", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6354771, "likes": {"liked": "— its a party all day long", "disliked": "— the front desk"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "If you plan on staying at the Hard Rock plan on paying a lot for Taxi rides to the strip as it is too far to walk (approx. 1.5 miles) to the strip. Also note that the hotel's restaurants only give 2 for 1 discounts to guests of all Las Vegas hotel guests, EXCEPT for Hard Rock guests. Which doesn't make any sense, since one would think the hotel would give special consideration to those people who are guests of the hotel and gambling in their casino.", "title": "Not My Kind of Place...", "helpfulness": 10, "user": "mrfargo2", "date": "December 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 6318331, "likes": {"liked": "— Large-screen plasma TV in the room", "disliked": "— Loud music everywhere"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "There are lots of other hotels in Las Vegas that treat their patrons better and have better amenities.", "title": "Good Place", "helpfulness": 2, "user": "micantcz", "date": "November 15, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6133732}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "as the organizer of a trip that usually consists of 15 to 20 males aging between 22 and 30, the hard rock is the place to stay. we said we would stay at a different place every year until we found a place we liked. if your looking for a party, and of course you are or you wouldnt be going to vegas, then this is the place to stay. the rooms are all you can ask for. clean, small little balcony, but big opening french doors is very nice. bose steros are a nice touch. the rooms also have safes which are free and work very well.", "title": "Lock all your belongings!!!!", "helpfulness": 11, "user": "hac0226", "date": "November 8, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 6086726, "likes": {"liked": "— Pool", "disliked": "— Maids"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "A nice property away from the Strip. It did not feel overly crowded which was nice considering everything else on the strip is so packed. The rooms are nice and clean but if you can upgrade to the HRH tower do it.", "title": "Great Place", "helpfulness": 1, "user": "hilgrls", "date": "November 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120394195}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The HRH Tower is the best. It makes you feel like your in a seperate hotel with upgraded amenities. But at the same time you able to enjoy the whole Vegas experience. The other hotels are too big and mauch you fell like hurded cattle. The Hard Rock Hotel gave us a much more intimate setting and the overall service was exceptional. Johnny Smalls and the Steakhouse were outstanding. The bed was the best.", "title": "Great Experience", "helpfulness": 1, "user": "Carl B", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120359963}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I booked my trip at HRH becuase I read that they have the best pool in Vegas - which is 100% true... but its closed in November. I did not realize this until after I booked and paid. The hotel was fun, I would have loved it for the pool but it was a bit out of the way, considering our days were on the strip and not at the pool.", "title": "Good pool - while in season", "helpfulness": 1, "user": "MyOpinion1515", "date": "November 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 120340297}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "What I had a problem with - our room may not have been ready when we got there, but they made it seem like it was. We were missing towels, cups, etc. I also did not like the $20 resort fee - the shuttle only runs from 10am to 5pm and only has one stop, we never used it.", "title": "Hotel has style, but a bit dated", "helpfulness": 1, "user": "sharehelp", "date": "November 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 120316253}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "It's fine hotel, it does has a style, a little dated, got lots of male 80% compare to female 20% of the hotel's guests. But I think the best time to stay there is summer, the hotel has a great pool/night club Rehab, that's were the fun is. )", "title": "The modern Vegas experience", "helpfulness": 2, "user": "jadiepoojade", "date": "November 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 120294259}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Beware the hidden charges!!! Everywhere you look they hit you.", "title": "Beware the hidden charge!!", "helpfulness": 17, "user": "msikcr", "date": "November 8, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 6086043, "likes": {"liked": "— Leaving", "disliked": "— The check in process took me 4 visits to registration and the line just to get a room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "First the rate on the web looks good. Then when you check in and ONLY when you check in after you have signed the Early Checkout $75 payment agreement do they tell you that there are two $5 per night charges automatically added on. 1 for the resort fee and one a shuttle charge. I didn't even know they had a shuttle. Also the rooms have NO glasses in them, so if you want / need a drink of water to take a pill or are just thirsty you have to drink from the sink or open a $6.50 bottle of water. Nice touch. In addition they make you sign a statement that if you bring any food / water into the room they will charge $25 for it.", "title": "Fun Times At Hard Rock", "helpfulness": 6, "user": "juleshills", "date": "November 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6060160, "likes": {"liked": "— It was very stimulating and had a lot to keep you distracted", "disliked": "— Stores were a bit expensive"}}, {"rating": 5.0, "title": "Love the Music, the Food, and the Casino", "text": "The room is on par with any Holiday Inn in the country, but no Holiday Inn I have stayed in would put up with the stains on the carpet and furniture.", "helpfulness": 7, "user": "Tucsontourist", "date": "October 22, 2006", "id": 5982944}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Go to any one of the many other wonderful hotels in Vegas.. Avoid the Hard Rock.", "title": "Great time", "helpfulness": 1, "user": "wtebeau", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 5965192, "likes": {"liked": "— fun atmosphere", "disliked": "— off the strip"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I stayed at the Hard Rock Hotel in late October, 2006 from Thursday to Monday morning and had a pleasant experience. It is definitely a singles/ young adult hotel. I would say the target ages would be from 21-36. I have nothing bad to say about the hotel at all, it's not my favorite hotel in the world, but it definitely is a great party hotel. I went with a party of seven friends (including myself) and we were put in standard rooms next door to each other. Standard rooms aren't very big, but they're made for sleeping and they were clean and pleasant. The casino was a little smaller than I thought-- but had everything you needed. The pool was amazing, and if it was that good during the fall-- I can only imagine the summer. My favorite restaurant in the Hard Rock is Mr. Lucky's 24/7 which is a diner that is always open. The staff never gave me any problems and I did like it because it was in a world of it's own off the strip, but a very cheap, quick, and convenient cab ride to the strip. There are local stores and strip malls nearby when you need a dose of reality and not the Las Vegas glitz. I would probably stay in another hotel next time-- just to experience something different-- but I would NEVER turn down another stay in the Hard Rock because it was good. I would definitely stay there again though if I make repeat trips.", "title": "Awesome place to stay!", "helpfulness": 2, "user": "TheLiens7", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5901895, "likes": {"liked": "— Rooms were great. Staff & Service excellent", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed here recently for the weekend for the first time and had an overall good stay. We had a corner King room, which had tall windows on two walls and felt pretty spacious. The view at night with the city lit up was quite beautiful. The rooms are a bit dark even with all lights on, which I did not care much for, so if that is a concern for you, this is probably not a place you should stay.", "title": "Nice Rooms but Doesn't have all the Amenities", "helpfulness": 1, "user": "SueinCA", "date": "January 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 150222191}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We knew the hotel was off the strip and that we would have to cab it to different locations. At times, we actually were closer to certain locations than others and could get there very quickly (like the Wynn). But if you want to be on the strip this is obviously not the best choice of hotels.", "title": "Terrible place", "helpfulness": 6, "user": "Hugh D", "date": "January 20, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 150139420}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My biggest pet peeve of the hotel is there aren't many options to grab some drinks/snacks for your room. Yes there are restaurants and one quick-service counter place that had limited selection of food or drink (it is primarily coffee and pastries). We found ourselves hungry one afternoon so ordered a burger to share from room service and it took an hour to get it (there was a conference at the hotel, so that may have been why). We ultimately realized there was a CVS right next door where we ended up getting some chips and soda, but I thought most big casino hotels like this had a snack shop of sorts to grab a bottle of wine for the room, etc.", "title": "Taxi needed", "helpfulness": 2, "user": "alison w", "date": "January 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 150134443}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "The other thing I did not care for was the casino is very small. There isn't much of the hotel to explore and wander around to. For this reason, we did not gamble much here or spend a lot of time in the hotel. I have never even been to the pool area (well once at night for a concert years ago).", "title": "Will stay here again, will recommend, and will convince people to come with me!", "user": "Shawn H", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150061138}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We also had to walk really far to get to the elevators to our room. This is pretty standard in Vegas, but it seemed really far here considering the hotel isn't huge.", "title": "Great Hotel, Vegas Experience", "helpfulness": 1, "user": "raingurl", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 149892920}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "What an experience. Even though it was a major holiday \"weekend\", the staff was all so friendly. Learned to play poker -- the poker lounge staff was excellent. Mansaa is a great host and his staff of dealers were exceptional. In the HRH tower, the staff, particularly Mark and Eloy, were so charming. It didn't feel like a holiday weekend. It felt like home. This is my 3rd stay and I can say it's official now -- we are hooked. We won't be staying anywhere else but HRH tower. Any room in the hotel is nice. But, HRH's separate valet area, private concierge and check-in make it tough to go back to regular rooms, valet and check-in. They spoil you.", "title": "HRH Tower on NYE", "user": "Staci Y", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149874777}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We went here around Christmas 2012 as part of a family vacation and rented three rooms for 4 nights each. We thought we were getting a good deal on the price through a 3rd Party online agent, but the overall experience was awful. I will list all the things that went wrong:", "title": "DIRTY & DILAPIDATED ROOMS. BAD MANAGEMENT! WE GOT SICK!", "helpfulness": 7, "user": "Pream", "date": "January 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 1.0}, "id": 149836208}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "1) We were supposed to get a \"mountain/city view\" room, but they put us in a room on the third floor which provided a terrible view of their roof, and industrial A/C fans.", "title": "New Years in Vegas!", "user": "pitsbrgher", "date": "January 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149767431}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "2) Immediately after check-in, we realized that each of our rooms had some problem or the other: dirty bathroom floor, strands of hair on the floor here and there, broken/torn/missing furniture pieces, damaged wood, etc. We instantly mentioned this to the Front Desk agent who apologized and offered to move us into a different room. We had to deny this offer as we were super tired from a 10-hour drive with the kids and needed to get some rest. So, the hotel offered to send maids later on and offered to waive the \"Resort Fee\". We accepted that offer for the time being (however, we had to fight with them at check-out time because they conveniently denied that they ever offered this to us because the Front Desk agent forgot to make written note of it).", "title": "Stay only if you are here for an on-site event", "helpfulness": 1, "user": "SylLovesToTravel", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 149614501}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "3) On day 4 (our final day), one of the kids got extremely sick with a fever and diarrhea. We had ordered room service breakfast earlier so we're not sure if that was related. Also, several people began noticing red streaks and small blisters of sorts on their legs and arms (this only happened to people who slept or showered in one particular room in our booking). We called Front Desk and mentioned this to them. Their response was to send someone to take pictures of the affected body parts and refer the issue to their \"Risk Management\" department. We were told that a person named \"Kim Cowley\" would get back to us. However, she did not communicate with us, so we had to call her after the Holiday season.", "title": "Awesome hotel and Casino", "user": "badmire", "date": "January 13, 2013", "detail_rating": {"cleanliness": 5.0, "location": 4.0}, "id": 149611174}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "While in Vegas recently, we gave this hotel a try, but won't be going back. We booked online through an outside company for a tremendous value, only to be hit with excessive fees upon check-in. The incidental fee is normal and expected at most hotels, but then to tack on a \"resort\" fee for a property that doesn't come close to a resort is ludicrous. Rooms were nice, but extremely dark, with very poor lighting. Poor privacy for a cramped bathroom in addition to horrible views, advertised as \"mtn. view\"----you got a shot of the mtns, but mostly abandoned neighboring lots and a crappy roof. The location was poor as well....blocks away from the strip and not a lot of dining selections close by, except for their own property Hard Rock Cafe.", "title": "Won't be returning---big disappointment.", "user": "bessiedear", "date": "January 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 150438013}, {"rating": 4.0, "title": "Business stay at the HRH", "text": "I stayed in the HRH for one night while on a business trip to Las Vegas. Upon check in, I let the clerk know that I was there for business and preferred a quiet room... and was thankful that he gave me one in the HRH tower at the far end of the hall. It was perfect for my quick, quiet stay.", "user": "trvlgrl99", "date": "January 23, 2013", "id": 150420705}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The room itself was a whimsical and fun rock & roll theme. It had a mini-bar, sink area, couch/living area, work desk, extra large TV, very comfortable king size bed, bathtub and shower. If I was there to play, it would have been a fun place to entertain. But I only made use of the work desk, which was spacious and comfortable to use.", "title": "Friendly service, nice rooms, great food", "user": "BuenosAiresSailor", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 150346663}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "If I were to travel to Vegas for fun, this hotel would be on my list of choices to stay.", "title": "4 Star Hotel", "user": "Chris T", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150335988}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I spent three nights at the Hard Rock for a recent convention. I usually detest most everything about a business trip to Las Vegas but I very much enjoyed my visit at the Hard Rock. Unlike many of the Vegas hotels, I found the facility easy to navigate and despite the large crowds everything worked smoothly starting with check in which took less than five minutes. My room was well appointed, very comfortable bed and beautiful black stone bathroom. My one frustration was that I needed to remove a lamp shade by the bed to get enough light to read. Otherwise the room lighting and view was great. The food and service in the three restaurants I tried were top notch. I returned to Culinary Dropout three times. The casino space is not concentrated all in one area so it didn't seem so overwhelming as I find it in so many of the large strip hotels. If I have to go back to Vegas, I will definitely consider staying here again even if my business is elsewhere!", "title": "HRH EXCELLENT SERVICE", "helpfulness": 1, "user": "ali b", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150313042}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Company put me up in the Hard Rock last weekend.", "title": "Love the rooms - felt out of place in the casino", "helpfulness": 4, "user": "Snarky", "date": "March 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7154743}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Plusses:", "title": "Very Disappointed", "helpfulness": 9, "user": "Jwandsa", "date": "March 9, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 7005817, "likes": {"liked": "— Nothing comes to mind", "disliked": "— Service. Off Strip"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "1. The bed - featherbed with a down comforter - I was asleep in minutes.", "title": "Good tub, bed and TV", "helpfulness": 2, "user": "TxTravelPro", "date": "February 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6841111, "likes": {"liked": "— Memorabilia", "disliked": "— Smoking in the casino (Vegas!)"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "2. Amenities - 40-something inch plasma TV in the room, Bose Wave Radio, well stocked vanity.", "title": "great for fun - but not for business travelers", "helpfulness": 4, "user": "revilo77", "date": "February 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0}, "id": 6840613, "likes": {"liked": "— attracts a young crowd", "disliked": "— not optimal for business travlers"}}, {"rating": 5.0, "title": "Fav place in Vegas (and I've stayed at all of them!)", "text": "3. Surprisingly quiet - despite the party crowd that hangs out here, once you're in the room, you don't hear them. Maybe the people who hang out in the casino can't afford to stay in the hotel... and security is good about keeping non-guests out of the rest of the hotel.", "helpfulness": 1, "user": "HomerJaySimpson43", "date": "January 27, 2007", "id": 6705563}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "This was not my first trip to Vegas, but my first stay at the Hard Rock. It was a great hotel with awesome service and atmosphere. This is less of a family friendly hotel, and does seem to cater to a younger crowd. It's pretty loud, and has none of the traditional buffetts or vegas tourist shops which was nice, but if that's the type of thing your looking for your better of at one of the strip hotels. The rooms were really nice, and the overall cost wasn't bad either. We absolutely loved it and would go back again.", "title": "Overall great experience", "helpfulness": 1, "user": "Karen M", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120275377}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "PTI stayed at this hotel for 5 nights, starting on October 29, 2011. I like the Hard Rock franchise and this is my first time at one of their hotels. The entire hotel (room, property, casino, etc) was very clean and well maintained. The one difference I noticed was the lack of slot machine noise, which was replaced with rock music from everyone's favorite artists...except the screaming from the craps tables, which is forgivable as it is Vegas. Mr Lucky serves diner grub around the clock which was handy when you come in late. Tons of memorabilia to look at as well. The location is a few blocks off the strip and is the only real downside to this hotel but cabs are readily available, the doormen gets you in a cab quickly and the nearest hotel on the strip is planet Hollywood for a $7.00 fare...give or take. I would stay here again, no hesitation.", "title": "IssShould be a strip hotel.", "helpfulness": 1, "user": "Going-once-again", "date": "November 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 120259004}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "Its a loud, young, party environment, definately not for peace and quiet. We aren't party-pooper types at all. Annoying and very difficult to get a pool chair unless you go down early. Go later and the lines and entrance fees are ridiculous. Forget the thorough bag check and that you can't bring an oversized beach bag or ANY water, snacks or even OTC or prescription meds. It was like the guests are privileged to be in their presence.", "title": "Single Party-People's Place-not for quiet or families", "helpfulness": 2, "user": "usfox4", "date": "November 6, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 2.0, "rooms": 4.0}, "id": 120254045}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Staying at the Hard Rock is not a relaxing type of vacation... you expect to party like rockstars and have a great time.. which we did. I visited with my fiance and another couple during Halloween weekend and had a blast! There was an error processing our reservation and we did not get the room we paid for. The front desk ladies took care of us by letting us stay at the HRH Tower and offered us an upgrade for the next 4 nights for $120 total.", "title": "Party Hardy...with great sleep", "helpfulness": 2, "user": "Pluma002", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 120211464}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The room was gorgeous and the beds were amazingly comfortable. I have not had such good sleep in months! The pillows were insanely fluffy. We could slightly hear the ladies in the room next door, but it was not too uncomfortable. You can definetly hear thumping from the pool music during the afternoon.", "title": "Off the Strip, but still worth considering", "helpfulness": 1, "user": "evapor8", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120197076}, {"rating": 4.0, "title": "lose ur inhibitions", "text": "feel free to e-mail me with any questions allysondawn@hotmail.com...I've stayed at hard rock 2wice with my girlfriends and we are all in our late 20's-which is pretty much the age range. the pool is the best!!! great food and drinks, hot guys and girls and great music, especially during rehab, theres a DJ. I highly reccomend Simon Restaurant-yummmmy. the room prices are a bit chi-ching, it includes pool and gym usage even if you don't use it!!! careful with your belongings, use the safe in ur room and the pool especially. the circle bar and Body English are lots os fun;) the hallways of the hotel are definitely the party place in the middle of the night, coming back to the room from a night of partying is a new and better party waiting to happen. if u have kids or want some peace and quiet or are on ur honeymoon, stay somewhere else!!! free shuttle during the day to and from the strip", "helpfulness": 7, "user": "allyroad", "date": "January 24, 2007", "id": 6688318}, {"rating": 5.0, "title": "Best in Vegas", "text": "Have stayed at the Rock three times in the last year and love the place. Unfortunately for me I am no longer in the 20s - 30s crowd but have transgressed into the 50s, and disagree with the comments that you should not stay here if you are 40+. I do not party like I used to and don't want to, but, where else can you immerse yourself in good rock, party in the casino, eat in fun restaurants and not have to worry where the elevator is.", "helpfulness": 3, "user": "irishwhiskey", "date": "January 17, 2007", "id": 6612264}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "On the three occasions I stayed here, I never felt slighted for being dumpy or old and everyone just seemed to be there to have a good time. Same for the staff - always friendly. I think its always dependent on your attitude. A good example - one day I finished business early and went to the pool around noon. It was packed with alot of 20-30 types with only a few like me. A group of guys made some xxx comment at me - I threw it back at them and ended up partying with them the rest of the day. Had a great time.", "title": "Terrible/scary experience", "helpfulness": 10, "user": "Nadia36", "date": "January 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 6595902, "likes": {"liked": "— Pool party", "disliked": "— Costumer service was terrible and the place was unsafe"}}, {"rating": 4.0, "title": "We like the Hard Rock!", "text": "So, my review of the Hard Rock", "helpfulness": 5, "user": "RosieRobot", "date": "January 8, 2007", "id": 6563890}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Great fun place to escape and listen to good music", "title": "No Complaints", "helpfulness": 1, "user": "laur05", "date": "January 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6551493}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Since people visiting Las Vegas do not spend much time in the Hotel room, a comfy bed at night to get a good night's sleep is important. The Hard Rock has this.", "title": "Only positive, comfy bed.", "helpfulness": 5, "user": "Susan L", "date": "January 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 149531243}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "However, nothing else about this hotel is noteworthy. No cups in room. No coffee. Just the bare \"black\" necessities. Black is the theme color of the room.", "title": "We love this place!", "user": "RomanticTravelers888", "date": "January 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 149505187}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The HRC LV is great FUN and one of my favorites. The dealers are professional and the atmosphere throughout is both rocking and service-oriented. I personally really appreciate the atmosphere with the dim lighting, dark colors, slots volumes turned low, and great music--a nice break from the bright lights and chinging sounds in other places. Always spotless.", "title": "Continues to be the best!!", "user": "Michael Z", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149454677}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Inspite of all the new hotel's at City Center, The Hard Rock continues to be the class of Las Vegas. By far the best value. Service is amazing. Today as I was checking out, the manager on duty (Leanne) approached me and asked me how my entire stay was. It was really cool because she was genuinely interested. I really appreciated that gesture. I have stayed at alot of places in Vegas but the comfort of the rooms and beds, combined with the service is the reason I will not stay anywhere else. Thank you Leanne!!!!", "title": "No reason to stay anywhere but the Hard Rock", "user": "Keith M", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149405693}, {"rating": 3.0, "stay_parameters": "Stayed January 2013", "text": "I have stayed at all the major Hotel/Casinos in Las Vegas and while some may have newer rooms or bigger poker room, bigger gaming floor etc, the Hard Rock is by far the best place to stay and play in Las Vegas. The main reason is the staff. The Hard Rock has the most friendly, upbeat, qualified, quick employees overall in Vegas. There are many great employees at pretty much every casino in Vegas, but I have yet to have even one employee at the Hard Rock rub me the wrong way in the slightest. Great music, relaxed atmosphere, great employees the Hard Rock has everything you need for a great trip to Vegas.", "title": "Acceptable but a bit tired", "helpfulness": 2, "user": "In2exploring", "date": "January 10, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 149358509}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Nice hotel, good room... Bathroom in the casino tower is mediocre... Great pool.", "title": "Nice hotel... Noisy", "helpfulness": 2, "user": "MassiG", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 120186098}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "My main issue was the noise. Was there for work rather than partying and im afraid if your room looks over the pool you will be bombarded by music... The windows are no where near effective enough in abating the sound.", "title": "Hard Rock Hotel", "helpfulness": 1, "user": "Harytaj", "date": "November 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 120146778}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Perhaps other towers are better!", "title": "Love it...", "helpfulness": 1, "user": "pbruno33", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 120105261}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed in the Paradise Tower and the room was nice, Hotel looks crowded to me.", "title": "Another viewpoint", "helpfulness": 2, "user": "BrownsboroRed", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120067780}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The pool is def not heated so in Oct it was like ice!!!", "title": "Perfect if you are under 25, and smoke!", "helpfulness": 2, "user": "Angelm123", "date": "November 1, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 1.0}, "id": 120049136}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "If you don't want to party don't book this hotel. I think the Hotel would agree this is there one and only selling point and priority. We stayed mid october 11, in the hrh tower at double the cost of the rooms elsewhere in the hotel. When checking in at 7pm, after a 14 hour flight, we had to stand in line as only 1 representative was on the desk (one of 5). we were then given a room with 2 twins despite informing her we were here to get married? after calling back, we were upgraded to a corner suite with a double bed - we were not offered any help re-locating to this new room so had to go back down to reception, lugging our cases with us to get the new key. This basically set the tone for the whole stay, terrible customer service, they charge for everything.. even asking for glasses (there were none at all in the room) they charge $4/glass to be brought up.. i stay in hotels at least 30 times a year and having a glass to put your tooth brush in is pretty standard? just beware that customer service is not great and class this as a hotel without a pool as it's sole use is an outside night club (at weekends at least).. even to the point that if you want to sit in a sun bed that is in the sun on a sunday, you are charged $50 (on top of the $20 resort fee you pay to stay there/day) minimum spend on beverages, or your only other choice is to sit in sun beds that are, i presume purposefully are located in the shade. And as the review beforee me pointed out if you don't stay in a more expensive room as friends of ours didn't) they party comes to you if you like it or not, so just hope that you like the music.", "title": "In a nut shell......", "helpfulness": 4, "user": "nickandtash", "date": "November 1, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 120006107}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "It all seems pretty negative, sorry. Positives are the suites are great, huge and really nicely decorated but as I said if you don't want to party ( we did but not to he extent that it is forced on you) this isn't the hotel for you.", "title": "Loved it, Loved it, Loved it", "user": "L B", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119987323}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Last point, I am a fan of nobu and was excited to have a first night dinner there, it was fine but, the waiters were really helpful butthe standards are no where near the Nobu restaurants I have eaten at in London or HK.", "title": "Full of hairy bikers!", "helpfulness": 1, "user": "BluebellChloe", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 119986906}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Our group of 8 stayed at the Hard Rock in July and not one of us had a problem all week. The room was spotless and modern with everything you could need (finally a decent quality iron in a hotel). The pool is far and above the best I have ever seen coupled with a great atmosphere, the days were most enjoyable. I would probably go as far as to say the days spent around the hard rock were better than the nights spent on the Vegas strip. We ate at the American style restaurant for a few nights and the value for money was incredible, didnt get around to any of the other but they certainly looked inviting.", "title": "Good Value, but choose your room wisely", "user": "ScottishPaul", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 119961668}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Not being big gamblers our time at the black jack tables was limited but the dealers were very helpful giving us hints on the best and slowest way to lose our money.", "title": "The Hard Rock rocks!!!", "user": "brtn_girl", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119960458}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 317, "average": 505, "very good": 900, "terrible": 291, "excellent": 1065}, "aka": "Hard Rock Las Vegas", "slim_ranking": 0.351851851852, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "description": "Hard Rock Hotel & Casino is a premier destination entertainment resort situated on 26 acres in Las Vegas. Built in 1995, the property recently completed its $750 million expansion in 2010. Hard Rock Hotel & Casino offers an energetic entertainment and gaming experience with the services and amenities associated with a boutique luxury resort hotel."}