{"user_rating": 5.0, "review_count": 91, "name": "Harmony Homestay", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "On arrival we had the most delightful cream tea ever (& I have sampled many).Nigel & Charlie were wonderfully considerate hosts,the room was spacious,light,airy & spotlessly clean,as was the excellent ensuite.The bed & furnishing were extremely comfortable.", "title": "EXCELLENT IN EVERY WAY", "user": "sure54", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140906829}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We had a lovely relaxing two nights at Harmony Homestead,we,have no reservation in recommending this excellent B&B.", "title": "most extraordinary", "user": "Claudia E", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139740751}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Breakfast was brilliant,as was the total stay.", "title": "The best ever!", "user": "giuseppeamos", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138328639}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We will return asap.5 star +++", "title": "A home from home!", "user": "Lisa W", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137701607}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Although we got off the train one station too early, Nigel and Charlie were so kind to collect us from the train and gave us an introduction sightseeing tour in their convertible, showing us the most beautiful spots in and around St. Austell. At their place they wellcomed us with freshly brewed tea and delicious homemade scones. They provided a large variety of printed tourist information but especially helpful firsthand tips and tricks about how to get around and what to do. The interior design of our room was elegant and tasteful including the completely modernised bathroom. The view goes out over rolling hills and grazing sheep. We admired also the especially well tended, lovely garden for it's enchanted atmosphere. Every morning we were wellcomed with a freshly prepared, delicious English Breakfast at its best, including delicious mashrooms, beans, eggs, ham and saugages,fresh fruit, juice and coffee or tea.", "title": "Fantastic B & B!", "user": "Dan P", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137441881}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We were lucky enough to stay with Nigel and Charlie for one night this week but have already booked to go again for two nights in December. St Austell is not the place you would usually associate with a stay in Cornwall but it is a perfect base to see the local area and beyond. The hosts are extremely hospitable treating guests like friends. Nothing is too much trouble. The rooms are spotless and well fitted and maintained. We slept very well as the location is so quiet. We cannot recommend this place highly enough. Great breakfast too!", "title": "Couldn't better it", "user": "Chris4817", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144213451}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I feel like nothing I say will explain well enough how fantastic it was to stay with Charlie and Nigel. Their place is just amazing: spotless clean, modern, well decorated, cosy and super tidy. Ver well located and close to the town centre, but not so close that you will have all the noise. It is in a very quiet cul-de-sac location (in fact, I haven't slept that well in ages!), with plenty of space for parking just outside the house. You get all the luxury of a 5-star hotel with queen size bed, clean towels everday, a kettle, tea, coffee and biscuits in your bedroom, full English breakfast fresh and beautifully cooked (Charlie rocks in that kitchen!), with loads of fruits, cereal and yogurt to top it all up. All this for a great price. That in itself would be more than enough to choose this place over any other. But there's much more, there's Charlie and Nigel and that's where words are not enough. I never felt so welcome anywhere. They were born to host, they are just the most amazing and pleasant people you will ever come across. They will make you feel, after just 5 minutes, as if you knew them forever. It combines the welcome feeling of staying with friends, with the level os service and care you have in a top-notch hotel. They really make an effort to make your whole experience great. They have carefully prepared all these day outs, with local tips and things to see, and even discount vouchers when they can get hold of it. They know the history and the attractions inside out, so all you need to do is go there. Talk about going the extra mile, Nigel literally went the extra mile for us. He walked with us to town because I wanted to go to a particular restaurant and couldn't find the directions. He just seemed happy to show us around his town. My husband and I went there to celebrate our birthdays, which are one day apart, and when I woke up on my birthday, it was all decorated with \"Happy birthday\" banners, balloons and even a birthday card. They did the same on the next day for my husband. Made us feel so special. I just can't recommend this place enough. Every single detail was just absolutely amazing.", "title": "Best B&B I've ever stayed in my life!", "helpfulness": 2, "user": "Carolina M", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142766586}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Harmony Homestay with Charlie and Nigel provides 5star accommodation at its very best plus another 5 stars! EVERYTHING is 5 star-plus, from the warm welcome you are given on arrival right through to the end of your stay. This is the friendliest B&B ever and your every need is catered for. With his natural convivial manner, Nige is Meet and Greet. He is willing to share his fund of knowledge about local places to visit that are not on the usual tourist itinerary and is happy to take you there personally. Then there is Charlie who provides the element of Meet and Eat. With his outstanding culinary expertise, he produces a breakfast to die for! Whatever you want you can have and that sets you up for the rest of the day. On a practical front, the bedrooms are spacious, everywhere is scrupulously clean, the beds are very comfortable and the en-suite bathroom has a wonderful power shower that you would like to take home with you!", "title": "It can't get better than this!", "user": "Jill C", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142404744}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Thank you so much Charlie and Nigel. You are an amazing combination of natural talents which ensures your stay with you both is second to none. We feel we have made two lovely new friends and will most certainly return to stay with them next time we are in Cornwall.", "title": "Incredibly welcoming!", "user": "cambridgefrin", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141901072}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Jill and Barrie Cooper x", "title": "Earns its name!", "user": "awhyte1", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141273662}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Staying at Harmony Homestay is exactly as it says. A harmonious 'home from home' with superlative attention to detail from both Nigel and Charlie.", "title": "WOW - What a place!", "helpfulness": 1, "user": "105jane", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131770526}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Such a warm welcome on arrival makes you soon feel you are totally relaxed and truely on holiday. They have created a very special place and so willingly do everything they can to make the stay comfortable and memorable. They are both exceptional people.", "title": "Outstanding Hosts", "user": "Christine H", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130708919}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The facilities are high quality and spotless. Charlie is an excellent cook and Nigel very informative about the local area and history.", "title": "Harmony Homestay Wow", "user": "lufcwimpy", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128327684}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Go and stay and find out for yourselves!!", "title": "Great comfort and great company", "helpfulness": 1, "user": "noelandrob", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121476174}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Charlie and Nigel are two of the nicest people you could hope to meet. Both are fully committed to making their guest welcome in their home beginning with a very warm reception accompanied by home made scones. Nigel is a wealth of knowledge about the areas attractions and Charlie an exceptional cook. We spent two nights there and each time we returned from our day's excursions we sat with a cuppa and a chat. Just like at home. Thank you both. Would love to stay again.", "title": "Highlight of my stay in Cornwall", "helpfulness": 1, "user": "Sandra W", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118914861}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This property deserves top scores in all categories. What makes it distinctive, however, are Charlie and Nige, who could not be beaten for their welcome, friendliness and helpfulness. Nothing is too much trouble for them.", "title": "Olympic Gold- Unbeatable in all ways", "user": "peter m", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137283193}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Trip Advisor was right - and then some!", "title": "Who'd have thought it?", "user": "MrsTrellis64", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133988968}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "I'm employed on a research grant, with a shoestring public sector allowance for occasional overnight stays for research trips. This was one of those. I found this brilliant B and B on TripAdvisor at about half the price I was expecting for one overnight stay, coming into high season in Cornwall. I want to avoid saying 'good value' as that damns with faint praise and implies, to my mind, cheery compromises have had to be maide - but NO! No compromises here! So it was of great value and of considerable charm.", "title": "Absolute best in Cornwall", "user": "rexWildbird_aol_com", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133917726}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Go. Everyone. Now.", "title": "The perfect accomodation for exploring Cornwall", "user": "bavaria7", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133291714}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This will suit anyone with a scone based dispostion or aspiring to the occasional clotted cream led lifestyle. Nige, when not B and B'ing, does local health walks for groups of people in need of cardiac rehabilitation, so the cream/scone thing is done in the best 'wellness' way! Charlie and Nige were happy to share their homemade scones, tea, cream and jam - and garden - with a solo, one-night only woman - who repaid their excellent hospitality by dropping a towel in the lovely ensuite loo. Doh! The standrd of this guest might be a bit ropey but the place and the people are a class apart.", "title": "It does not get any better than this", "helpfulness": 1, "user": "MichaelG", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132511814}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 91}, "aka": "Harmony Homestay St Austell, Cornwall", "slim_ranking": 0.0322580645161, "description": "Harmony Homestay offers comfortable, modern, ensuite facilities in a friendly, warm and cozy environment. It's quiet yet central St Austell location, which lies close to the Sea, provides a rural Cornish aspect which is ideal for promoting relaxation and convenient access to all that Cornwall has to offer. The Lost Gardens of Heligan and Eden Project just minutes away.With free off road parking a comfy bed, a lovely ensuite, a fresh home cooked breakfast. This could be the base you are looking for, a home from home whilst you are on holiday exploring the whole of Cornwall. Great Public transport links can get you everywhere so car not needed from here.There are some great walks in Areas of Outstanding Natural Beauty just a few minutes from our doorstep. Try us and you'll see for yourself. A warm welcome awaits."}