{"user_rating": 3.5, "review_count": 186, "name": "Harrah's Ak-chin Casino Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Exceptional service, beautiful remodeling, clean, good food, fun - an experience I've gotten used to in other Harrah's casinos. But for David Viccio's service, my daughter and I could have ended up at a larger casino located closer to my daughter's home - but not with Harrah's attributes. My 2 trips a yr to AZ will include the Ak-Chin casino as long as Harrah's continues to manage it.", "title": "Thank you David Viccio", "user": "Judith B", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 120133783}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Spent 6 nights at this hotel. Stayed in the luxury room over looking pool, which was beautiful & lovely grounds. Front desk staff was excellent, as was the entire staff.", "title": "Housekeeping Needs Help", "user": "genevieveCa", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 119996408}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Problem is they are very under staffed and our room was never serviced until I called at 6 o7 pm. Moved us to a new room which had better service but not what I expected. I felt very sorry for house keeping as so short handed. it's managements responsibility to have enough employees to take care of their hotel. Spending $99 a night I expected better service. They did comp us an extra night if we wanted to stay and $50 free slot play in the casino. The rooms are very worn and in need of paint, carpets, etc. However they are very large, bathroom very large & nice except for mold in the shower. Nice patio with chairs to sit out. I have stayed at Harrah's in Ca. Nev. and this location was not the experience I had hoped for.", "title": "Great outdoor pool and rooms....", "helpfulness": 2, "user": "FreddyCoupler", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 119985174}, {"rating": 2.0, "title": "Ak-Chin Resort Tower", "text": "All in all the staff at the hotel were very helpful and I felt that management is at fault for the poor service.", "helpfulness": 2, "user": "FuntasticSister", "date": "October 7, 2011", "id": 119054973}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Beautiful establishment. Huge outdoor pool lined with palm trees. Rooms were excellent, clean and beds looked like new. Bedding was very clean, 2nd flr balcony has beautiful view of pool. Casino was great, just like in Vegas. Food here was to die for. Service was great, and be sure to get a players card as it comes with extras. Slots were loose and drink service was great! Walking around pool was beautiful especially at night. We highly recommend this as one of the nicest casino resorts. We will definately stay here again.", "title": "nice stay", "helpfulness": 3, "user": "stevez49Milford_NH", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 118906874}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I recently stayed in the new tower. I booked a 2 queen smoking room. Upon check in I learned that the new tower is completely non smoking, they did offer to move us to the older rooms which still allow smoking. We decided to just stay in the new tower anyways. The room was a premium, the only difference is the view. The view wasn't much of anything really, I wouldn't pay any extra for it. The luxury rooms have a view of the parking lot. The room was decorated in red and black mostly and very modern. It was a little sterile looking, but nice enough. It included a mini fridge and safe, in the bathroom. The bed was very comfortable. I would stay again, next time I'll try one of the older rooms just because they include a baloney or patio. I don't have any complaints about the room. I would suggest that they extend the room service times. They stop after nine, so we had to get food from the cafe to go. It was the only option at the time (around midnight). Which wasn't that bad to go down and get. The problem was that they made one order wrong and forgot our dessert. We were too tired to go back down again so we just let it go. Other than that everything else was fine. I have attached some pictures. Sorry for the quality they were taken from my phone.", "title": "New Tower", "user": "reviews1phxaz", "date": "November 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 121098339}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "this place is not worth the drive. I have given this casino a number of chances, only because I am Diamond member with the Harrah's group of casinos. My last visit on 11/20/2011 will be my very last visit. Imagine going into a casino on a Sunday afternoon only to find it nearly empty. There is a reason for that. The machines are sooooo tight that you cannot even play for a while with your money. It is a take all casino. I talked to a few of the other gamblers there and they said the same thing. In fact, the place a real sense of depression about it. STAY AWAY FROM THIS PLACE! I CANNOT IMAGINE HOW MUCH LONGER IT WILL BE IN BUSINESS IF THEY CONTINUE TO MANAGE IT AS THEY DO. The Vie Quiva, Lone Butte or Wild Horse Pass casinos are a better bet for your money. The casino at least gives you a chance to play for awhile with your money. If you have the same experience, please post it on here.", "title": "Tightest Casino on the Planet...", "helpfulness": 3, "user": "Darren B", "date": "November 20, 2011", "detail_rating": {"value": 1.0, "service": 3.0}, "id": 120841323}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Spent a free night at the new Harrah's Ak-Chin Resort Tower. Very nice and updated rooms but smaller than the older rooms in the other buildings. The Tower rooms are well equipped with the latest electronics as well as European type power saving device. Comfortable bed but terrible pillows. Free Wi-Fi throughout the property and in all rooms.", "title": "New Tower", "user": "reviews1phxaz", "date": "November 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 120761737}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We had a family reunion at Ak-Chin and had a wonderful time. Our 9 rooms were close by each other and the staff went out of their way to make us feel special and welcome. The pool area was excellent, and we enjoyed the sunny days outside. The rooms, although not spacious, were very modern and had everything we could want, including refrigerator and in-room safe. I made the mistake of leaving a money wallet in the safe when we left and flew home to Minnesota. I called there the next day and the hotel manager and security manager made sure that they retrieved it and sent it back to me via Fedex, at no cost to me. Great customer service!! Our room maid, Jasmine, brought a special Halloween treat to my 3yr old grandaughter! The only negatives I can mention are the swim-up bar is hardly ever open, and the restaurant selection was limited. However, the snack bar had excellent food 24hrs a day. What a fun time to be there during Halloween and see the array of costumes and contests!", "title": "Family Reunion at Ak-Chin", "user": "Judy K", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 120551415}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I had a terrible experience in a new tower room. First, the TV can be viewed only from the bed and I don't do that. Second, the \"built-ins were glitzy cheap. Third, one chair to go with a huge bath and king size bed - REALLY??? and a desk style chair to boot. Fourth, the bath was nice size but definitely looked like new cheap chrome (hopefully not).", "title": "Tower rooms", "user": "Jan W", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 120194554}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Spent 5 days here on our Seven Stars Trip. The people are extremely nice and we had a beautiful suite in the new tower. The property is somewhat limited when it comes to restaurants. The buffet is okay - typical buffet. The only \"upscale\" restaurant is The Range. The decor is rather casual and the food is generally good. Ak-Chin could really benefit from having a nice Italian restaurant. A spa would be a welcome addition as well. We did get some play from the slots. As a whole, we had a very enjoyable time. The self-serve coffee/soda bar is wonderful!!", "title": "Nice way to spend Christmas", "user": "Pamela M", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122685316}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Machines are tight...but they are tight at all casinos...The service is great except the diamond Lounge...stupid way to run it...went to many lounges never saw such a cheap and poorly run lounge..but the hotel and the people working at the casino are great..Compared to the Gila casinos its a palace....", "title": "Diamond Lounge BADDDDDDDDD", "helpfulness": 2, "user": "NyGambler", "date": "December 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 122032306}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We experienced a malfunctioning ATM machine. They will not give you your funds but rather tie up your bank account and force you to file a dispute with your bank.", "title": "Malfunctioning ATM's They Keep Your Money", "user": "Joyce P", "date": "December 19, 2011", "detail_rating": {"service": 2.0}, "id": 121891319}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We had money tied up for 4 days and had to make three trips to our bank. Other casinos in town to go to ...", "title": "Nice rooms, good service", "user": "ndw4golf", "date": "December 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 121826470}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Stayed one night on our way to Laughlin, NV. The staff was very helpful, from valet, to bell, and the front desk. The room was ways from the casino, but you could cut through the pool area and shorten the trip. It was a very nice room, large, clean with a nice bathroom. We decided to get room service for breakfast which we don't normally do, it was fast, hot,and pretty tasty. The only complaint was the smell from the stockyards some 30 or 40 miles away from what we were told. We had been there before, just to gamble and never noticed the smell, so the wind must have been blowing just the right direction, but damn! It gave me a headache unless I played right where the fresh air was blowing in. Thank God our room didn't smell or we would have checked out. It was a lot better in the morning. We might stay again, but would check out the wind direction first!", "title": "Nice Oasis In The Desert", "user": "Traveler16340", "date": "November 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121263695}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed here one night in the newer Tower rooms. It was very modern and comfortable, with a spacious shower and bowl-style sink in bathroom. Nice rainfall showerhead very pleasant also. Chocolates in room a nice welcome. Nice big flat-screen TV on wall and view of parking lots, fields out window. The pool is undergoing heavy maintenance so wasn't open, but the hot tub was. There is no fitness center at this property, which is too bad. The buffet is not bad, nothing fancy. We had Agave's for breakfast (the only choice pretty much), which was good. As others note, if you don't gamble, there is not much happening around here. Too many of the slots are tight.", "title": "Tower rooms modern, comfortable", "helpfulness": 1, "user": "steptravel", "date": "February 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 124579745}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "We just spent another great weekend at Harrah's Ak-Chin. We live in Arizona, so we are frequent visitors. I feel obligated to let fellow trip advisor users know that the pool is currently closed for remodeling/repair and I believe is not going to re-open until May. We love staying at Ak-Chin, the employees are great and we are always treated well. But if you're looking forward to spending time at the pool, now is not the time to visit.", "title": "Pool is closed!", "helpfulness": 1, "user": "CallAttendant", "date": "February 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 124505970}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Stayed here for two nights on business. Very comfortable room in the Tower, all the amenities you'd expect. Only ate in the buffet as the choices are pretty limited....but the buffet was a good value with the selections changing each day. My only complaint was the pervasive smoking odor....there was none in the room thankfully, but the hallways, lobby and common areas all smelled of smoking. And apparently the fire escape stairwells are fair game for smoking as there were cigarette butts and used matches on the stairs.", "title": "Smoke free yes, odorless not so much", "helpfulness": 1, "user": "Dave707", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 124348492}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "As others have noted there is nothing on site to do if you don't gamble. And for restaurants there isn't much of a selection in Maricopa.", "title": "Quick gamble stay", "helpfulness": 1, "user": "ariztraveler_10", "date": "February 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 124306177}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The hotel in nice for a quick one night stay. There is not much to do other then gamble. When they build the entertainment complex next door it will improve. We stayed in what they call the resort buildings. They are larger then the tower rooms and they have balconies. We eat in the Range Steakhouse for dinner. The food was very good, but the prices were high for this type of location. A couple having an appetizer, entree and a drink will cost $100. For breakfast we eat in the Agave restaurant. Since, this the only place for breakfast it was crowded. The food was normal diner food. They should open the Buffet for breakfast.", "title": "Tight penny slots", "helpfulness": 3, "user": "MACTact", "date": "January 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 122999467}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 16, "average": 28, "very good": 73, "terrible": 15, "excellent": 54}, "aka": "Harrah`s Ak-Chin Hotel", "slim_ranking": 1.0, "description": "Harrah's Ak-Chin is more than just a casino. It is a place to indulge all your senses. From exciting gaming to fine dining and everything in between, Harrah's Ak-Chin is a resort destination to satisfy every taste.When you're not playing one of your favorite games, you can settle into one of our 300 luxurious guestrooms, which come complete with all the amenities to make your stay a comfortable one. The hotel grounds are a verdant oasis, boasting a lush assortment of greenery, including an idyllic courtyard with an exotic swimming pool and swim-up bar.If you're looking for the excitement of a casino, with the relaxing ambience of a first-class resort, both can be found at the same place: Harrah's Ak-Chin.Please note: You must be 21 years of age or older to book a room in our hotel."}