{"user_rating": 4.0, "review_count": 191, "name": "Harris Ranch Inn", "reviews": [{"rating": 5.0, "title": "An Inn Within A Garden Of Tranquillity", "text": "Impeccable Housekeeping (Mary and others), courteous and helpful Front Desk staff (Natalie, Mario, and others), beautiful gardens and a pristine 25 meter pool make Harris Ranch Inn one of our favorite places to \"veg out\"-- as in reading mysteries and walking our dog, Lexie.", "user": "papagrande45", "date": "March 6, 2013", "id": 153827369}, {"rating": 3.0, "title": "Great place to get off the road.", "text": "And some good soaks in any of three spas contribute to an appreciation for the many blessings of water at this oasis-hacienda garden retreat.", "user": "KenatRSF", "date": "February 25, 2013", "id": 153124167}, {"rating": 4.0, "title": "Really roomy, great bed, bad shower", "text": "The bar (Rene V., mgr.) is very capably staffed by Alberto (excellent service!), Kristi, Yasmin (hostess), Michael (bartender), and others.", "user": "ozzyaaron", "date": "February 14, 2013", "id": 152082172}, {"rating": 2.0, "title": "Cold Shower", "text": "Pam, our server at Harris Ranch Restaurant, is outstanding.", "user": "myreview2", "date": "February 5, 2013", "id": 151497529}, {"rating": 3.0, "title": "Okay Stay; Great Food", "text": "All of the food was unusually delicious!`", "user": "OCAnn", "date": "February 4, 2013", "id": 151413034}, {"rating": 4.0, "title": "Lovely but noisy", "text": "I have been passing this hotel and eating in its restaurant for years. This time, I decided to stop. The grounds are impeccable. The gardens, dancing waters and pools are beautiful. I had a little noise problem at this hotel but didn't say anything until the next day. The service was terrific. I recommend this hotel if you get the right room. It is also on the pricy side.", "user": "Michael M", "date": "December 19, 2012", "id": 147734179}, {"rating": 3.0, "title": "Good, but does it justify it's price tag?", "text": "We stopped here on our way back to LA. It was between this and the Best Western and I prefer independents, so we picked the ranch. It was the most expensive night we had on our trip, despite travelling down Highway 1 on the beach front for the most part, and after check in I really didn't get why it commanded such a high price tag. We'd stayed the night before in Ft Bragg for $60 in a room that was just as nice as our $170 one at the ranch. It was pleasant and comfortable but in my opinion wasn't worth the price tag, and I couldn't understand where all their business comes from as there doens't seem to be anything other than their own restaurant for miles. I also found it quite odd when we drove past their feed lot - I had thought that all their beef would be free-range as it were, but seeing them all penned in there being fed in troughs made me wonder.... we passed some small scale ranches where the cows were roaming free on the pastures and that seemed a lot more conventional.", "user": "Pipx69", "date": "December 9, 2012", "id": 147047909}, {"rating": 4.0, "title": "Oasis on the I-5", "text": "In the morning we bought breakfast pastries from their bakery and they were excellent - definitely the highlight of our night on the ranch!", "user": "sallywing313", "date": "December 8, 2012", "id": 147021636}, {"rating": 2.0, "title": "Pretty Pricey", "text": "We've traveled b/f on I-5 between OR & AZ for 35 years and only recently (FINALLY) stopped in at the Harris Ranch. It is a beautiful property, capturing the rugged, independent \"Cowboy Spirit\" combined with the elegance & hospitality of a country manor. Caution - it is a working cattle ranch, as your nose will quickly confirm. With the largest feedlot in CA located just a few miles down the road, there is NO ESCAPING the pungent, earthy smell of cattle. The room was VERY spacious & well appointed. We quickly received delivery of a small refrigerator upon request. The highlight of our stay was dinner at the restaurant. CAUTION - bring a hearty appetite! The portions were quite generous. Having been appropriately warned, we opted to SPLIT the Beef Wellington (made with Portabello Mushrooms in place of pate, so no geese were harmed in the preparation!) Our server, Jessica, was especially delightful and engaging. Will definitely dine here again, whether we stay at the hotel or not!", "user": "Jon B", "date": "December 8, 2012", "id": 147003442}, {"rating": 5.0, "title": "Next time we'll stay longer!", "text": "Harris Ranch seems to be a victim of its own success. Over the years this place has morphed into a wannabe upscale place to rest and relax on the long and largely empty I5 stretch in central California. The rooms are nice but lack basic appointments such as microwave and refrigerator and they are a bit small. Depending on where your room is, it can be quite a hike to the bar and restaurant.", "user": "skikayak", "date": "November 30, 2012", "id": 146496843}, {"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We have stayed here before, the last time on Valentine's Day this year. It was OK then, now? It was awful. It's 4AM, and I forced myself into a locked lobby so that I could write this review. We stopped here as a waypoint for our road trip from Palm Desert to Portland. My wife can't walk far, so I had our room changed from a suite to a first floor hotel room with a patio. Happens to be as small a patio as one can get and still have two chairs. We fired up the Internet. Nada, bupkis, nothing. I was told by the front desk that in parts of the property the internet didn't work so well. I asked for a room where it did, and they couldn't find it! Now I work virtually. That means wherever I am, I need a connection. Plus the beds felt like the sheets were made of rayon, and dacron pillows. So here I am at 4:45AM working in the lobby (after I finish this). To complete the total awfulness of the stay, a cool North wind is blowing this morning, and the grounds smell of the Harris Ranch cattle pens. I mean reek! Awful. Will we come back? Sure, if they fix what's broken here.", "title": "My visit sucked!", "helpfulness": 4, "user": "grapdad", "date": "March 26, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 155686804}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Everybody knows about Harris Ranch's restaurant, meat etc. However the hotel is tremendously convenient when making a long trip on I-5. Spanish style; en suite rooms; enormous heated swimming pool; palm trees; gorgeous smelling air; lots of birds. We could actually consider coming back and spending 2/3 nights. This time was a single night because we couldn't dream of driving San Diego to Berkeley in a single day.", "title": "Best highway stop in California", "helpfulness": 1, "user": "nurealam", "date": "March 25, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 155657487}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "Double beds seem to be small double beds; don't plan on reading in your room because the light won't be sufficient for you. However there was a separate sitting room with a huge tv in addition to the huge tv in the bedroom. Bathroom could use some updating but . . . you're in Coalinga and on I-5 and you have one of California's noted restaurants for American food at your front door (for breakfast, lunch and dinner). So what's not to like? Price was quite ok. An interesting deal on their website for some reason got $10 off on dinner when you bought a food credit in advance!", "title": "A Diamond in the Middle of California!!!", "user": "IMANATIVE", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155028929}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "As to service (which I did not rate): dinner, a new waiter who shouldn't be in the business and who certainly won't be there when you go, ghastly; breakfast, the best waitress in Central California.", "title": "Rest Stop on our Travels", "user": "Jo W", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155015518}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Last week was the third time I stayed at the wonderful Harris Ranch Inn on my long trek between San Diego and Napa on the Interstate 5. I've always been given a room overlooking the pristine pool, and I love strolling around the beautiful grounds with my little dog, Cupcake. The flower beds, lawns, and trees are perfectly maintained. I remembered my camera this time and am posting my photos with this review. I cannot say enough good things about the rooms and grounds. It is an oasis! Each time I've stayed, my room has been very clean, with beautiful linens and pillows on the comfy bed, very large, clean bathrooms, great in-room coffee service, and fast room service for a leisurely breakfast on my balcony in the morning. I really enjoy the \"fancy cattle ranch\" theme of the upscale decor, and I always leave happy, refreshed, and relaxed.", "title": "A place for the road warrior and weary traveler alike", "user": "C2000Consulting", "date": "March 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154545695}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "Driving on I-5 in the Central Valley, you don't have many choices of places to stay that are right off the freeway. By far, this is the best of the lot.", "title": "Desolate Spot, Convenient to I-5 and Pretty Nice!", "user": "DoctorJodi", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 149613453}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "It seems to me that this business is mainly a destination restaurant for beef lovers with a small hotel attached. All pretty funny for me, as I am a vegetarian. Anyway, I needed a place to stay after six hours of driving solo and was glad I opted for this one.", "title": "Quick breakfast/lunch", "user": "NMBomber", "date": "January 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0}, "id": 149193574}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Hotel staff are friendly and welcoming. Grounds are very nice. Lovely pool/spa area. My room was huge and well appointed, with a definite \"Ponderosa\" feel to it. As a woman alone I appreciated being in a secure building.", "title": "A decent stop on I-5", "helpfulness": 1, "user": "Carol_S_Perry", "date": "January 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 148536725}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Room service was available, although 95% of it was--naturally--beef. Found something that suited, which was delivered quickly and very tasty. (By the way, I did not see or smell any cattle, as some other reviewers have noted.)", "title": "Disgusting !", "helpfulness": 2, "user": "sreed229", "date": "December 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 148180909}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Moring coffee was served in the lobby.", "title": "Impeccable!!!!!", "user": "paul b", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148102079}], "location": {}, "variance": {"poor": 18, "average": 31, "very good": 61, "terrible": 9, "excellent": 72}, "aka": "Harris Ranch Inn Hotel Coalinga", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}