{"user_rating": 3.5, "review_count": 3698, "name": "Harrah's Las Vegas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Date Visited: - September 12-17, 2007", "title": "ANOTHER GOOD STAY AT HARRAH'S", "helpfulness": 4, "user": "lans98", "date": "November 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10761459, "likes": {"liked": "— LOCATION, STAFF, & CHECK IN & CHECK OUT", "disliked": "— RESTAURANT"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "My stay at Harrah's was a very Good Girlfriend Trip. This was not my first stay, however it had been 3 years since my last stay. I found the rooms in the Mardi Gras Tower to be updated and very comfortable. The positives were: Rooms always cleaned very adequately, Check-in process very pleasant and efficient, all staff encountered from the Bell Captain, Front Desk, Restaurant, Boutiques, Rewards Station, Oyster Bar (my favorite-DELICIOUS), casino floor waitresses, housekeeping staff, Spa staff, (especially Louise, outside entertainment were FANTASTIC. My only complaint was the pool area which is in much need of updating, however since the Flamingo Las Vegas is in the same group with Harrah's we ended up going to their pool area which was GREAT once we found lounge chairs. The snacks at the pool were delicious. Needless to say we all were quite pleased with our five nights at Harrah's. If all services remain the same, I WILL BE BACK.", "title": "Sleepless at Harrah's", "helpfulness": 4, "user": "merrit girl", "date": "November 11, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 10758083, "likes": {"liked": "— good location,in the middle of the strip", "disliked": "— smoky casino , on going renovations above us."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "We stayed at Harrah's November 5 until the 9th. The package deal was throught Westjet. I had never stayed at Harrah's before so didn't know what to expect.", "title": "Location,Location and Location", "helpfulness": 3, "user": "KMHChicago", "date": "November 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10755098, "likes": {"liked": "— location", "disliked": "— old casino"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Check in was not to bad but they lost our friends reservation so that took a while to sort it out. As I fiqured we got a room overlooking the roof of the casino pretty much a given. We went down in the morning and got switched to the Carnival tower on the 28 floor which was a improvement with a view of the City.", "title": "LOUD renovations going on", "helpfulness": 2, "user": "ChrisPA53", "date": "November 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 10734296, "likes": {"liked": "— location", "disliked": "— renovations under way and still booking rooms within vicinity"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "It started to go bad on Wednesday morning when at six in the morning they started with either jack hammers or chipping hammers. It sounded like they were coming threw the floor. A call to the front desk resulted in denial and not very concerned.", "title": "Great location!", "helpfulness": 5, "user": "PennsylvaniaNancy", "date": "November 9, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 10716900, "likes": {"liked": "— view from our 29th floor room", "disliked": "— having to leave our junior suite because it was like being in a cave......absolutely NO view"}}, {"rating": 4.0, "title": "Good Stay", "text": "We stayed at Harrah's in Vegas for the first time, and it was great. we were there for sat thru wed, and had a great price. We arrived very early around 9am to the hotel and took a chance at getting a room early, the lady at the front desk was very nice, got us booked in and sent us over to someone who could pull some strings. The nest person to help us was great as well, she found us a great room with strip view, it was clean and smoke free. some people like to complain about little things, but everything was just fine. Had a great stay. They have a good Poker room with good management, dealers and tournaments. Great location, can;t beat it for the price.", "user": "McGoo777", "date": "November 29, 2007", "id": 11147812}, {"rating": 5.0, "title": "Great Hotel", "text": "Everything about Harrahs was great!! The location, gambling, bars and entertainment. We really loved Carnival Court and all of the shopping around it. If you like country music the Toby Keith bar has great bands. The rooms are very spacious and service was great.", "user": "vacationgirl8", "date": "November 23, 2007", "id": 11007460}, {"rating": 2.0, "title": "2 1/2 Star Hotel at best!", "text": "I wouldn't stay anywhere else but here. For the price you are getting everything you need and more.", "user": "mymr2us", "date": "November 22, 2007", "id": 10990243}, {"rating": 4.0, "title": "Hooray for Harrahs", "text": "Well, my girlfriend and I just returned from a 3 nite stay at Harrah's. I'm not sure where to start. Yes, location is probably best on the strip. It's central to everything and if you don't want to walk it has the monorail located on the 2nd floor. Check in was pretty fast, much quicker than Ti or Luxor. We stayed in a Mardi Gras tower room, which I requseted at the front desk. Pros on the room: It was pretty clean, Tv in the bathroom and close to the main lobby. Cons: Only cons I can think of is it is very loud next door until 2am & the room is on the small side. My girlfriend was FOOD POISONED at the cafe (bacon was no good) and I did not like Toby Keiths Bar and Grill, the sandwich I ate bothered my stomach for 24 hrs. During check out we mentioned that my girlfriend threw up for nearly 20 mins and was asked if everything else was okay. Very POOR service. I strongly believe that anywhere else would have done something, anything to make up for the bad experience.", "user": "Travity", "date": "November 14, 2007", "id": 10828933}, {"rating": 4.0, "title": "Mid-strip Hotel at a great price!", "text": "Quick info on Vegas... It's changing right before my eyes. Maybe for the best or maybe for the worst, depending on the person. I could not believe I saw Trump's name on the Las Vegas Strip, it had me scratching my head. All the new condos/casinos that are being built as I write this is simply amazing!", "user": "VENSIM", "date": "November 14, 2007", "id": 10816895}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Room was fairly nice for the price. Upon checking out a $5.00 charge for \"Room Service\" was on the bill. Since we asked security to come up on check-in day (the same day as the charge) we assumed this was the problem and complained. Not so. Customer service informed me it was a charge for a Toby Keith water bottle which we neither drank nor took. Either the maids are stealing in this hotel or their billing department is behind (prior guest charge?) Either way I am fighting them over this. Tip: Request all crap you have no intention of using and that they could charge you for be removed from the room on check-in. Maybe if we make this extremely inconvenient, they will be more careful who they charge for what;.", "title": "Toby Keith Wayer Bottle Scam", "helpfulness": 3, "user": "sheema", "date": "June 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 16548906, "likes": {"liked": "— Decent room given the price", "disliked": "— Fraudulent room service billing"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Six of us traveling together got comp rooms at Harrah's Las Vegas - two others had to pay full price.", "title": "THE GOOD THE BAD AND THE UGLY OF HARRAH'S LAS VEGAS", "helpfulness": 6, "user": "GiaGiaMarge", "date": "May 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 16539673, "likes": {"liked": "— the room was nice", "disliked": "— casino"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008", "text": "Upon checking in my husband requested poolside....I immediately told him that was a mistake because I have learned from others that those rooms can be very noisy. We took the room and since it was 3:30 in the morning when we went to bed the noise did not bother us. The next evening my husband said it wa so noise he could not sleep. So, we requested a change - they accommodated us and the room was nice and clean, but is was obvious that the first room was the updated/renovated room with two widescreen tv sets (one in the bathroom!). So - all I am saying is do not get a room poolside because there is a lounge right outside the pool that goes on all night with very loud music until four in the morning. This was our fault not Harrah's.", "title": "Just okay", "helpfulness": 5, "user": "ashenrider", "date": "May 30, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 16515132, "likes": {"liked": "— Location", "disliked": "— Smokey"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The pool is very small and not a lot of space. But we were comparing this to Paris where we had stayed so many times before. Comparing apples to oranges.", "title": "Great place!", "helpfulness": 2, "user": "carrot79", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16355104}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "All in all the rooms were clean and had very nice bedding. The bathroom was very spacious. If all you want is a nice clean room to sleep for very little money than Harrah's is the place. If you are looking for upscale including the clientele than go to Paris.", "title": "Needs Coat of Paint", "helpfulness": 4, "user": "Scoutmm", "date": "May 22, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 16300323, "likes": {"liked": "— Not clean"}}, {"rating": 4.0, "title": "Great location & value!", "text": "This was our second trip to Vegas and last time we stayed at the Stratosphere so we wanted to be a bit closer towards the action this time. Harrah's was the best priced, centrally located hotel on the Strip. We arrived at Harrah's at 12:30am after a long flight to find out that there was no room for us in the basic room we booked. We got a free upgrade for the first night to a full-size suite. However, we had to get up at 10am the next morning in order to \"check out\" and check back in again to the room we originally booked. This was annoying since we just wanted to get some sleep! So, we stood in a ridiculously long check out line and got our new room. Well, after staying in a suite you just cannot go back to a regular room! The room just didn't have the same amenities and luxury that the suite did so we went back downstairs and upgraded and paid the difference. They probably upgrade in the hopes that other people will do this!", "user": "Traveler2585", "date": "December 6, 2007", "id": 11289177}, {"rating": 4.0, "title": "awesome location!!", "text": "The suite had 1.5 bathrooms, a king size bed, a living and dining room as well as a minibar. The bed was very comfortable with high quality linens. The bathrooms were well stocked with towels, shampoo, soaps, etc; Housekeeping was great and came everyday. The view was great, we faced the Mirage.", "user": "loveyavegas", "date": "December 4, 2007", "id": 11242031}, {"rating": 4.0, "title": "Las Vegas for Lunch", "text": "The food at Harrah's was okay. We got room service late at night one night and it was a bit overpriced and of average quality. We frequented the McDonalds next door and the Starbucks in the lobby for breakfast!", "user": "bakes4", "date": "December 2, 2007", "id": 11199733}, {"rating": 5.0, "title": "Great deal", "text": "We didn't play too much in Harrah's because we found the slots to be very tight. Instead, we opted to use the free shuttle to the Rio and we also played at other casinos on the Strip. I didn't find their comps to be as good as some of the other casinos either.", "user": "zottDallas", "date": "December 1, 2007", "id": 11194393}, {"rating": 4.0, "title": "not bad for the price", "text": "The pool area was average. We really had to wait around to get the chairs with the misters. They need more of those! The pool was very basic... it served it's purpose well in the heat! Also, there were always plenty of towels and waitresses offering drinks.", "user": "erc", "date": "November 29, 2007", "id": 11150914}, {"rating": 2.0, "title": "harrah's just okay", "text": "the concierge was completely clueless. I asked him where I could purchase toiletriesat a place similar to a CVS; he was new in town and didn't know! The casinos are smoke-filled and it's hard to get a drink; too few waitresses. The room was okay -- it was clean but smelled faintly of stale cigarette smoke. Pillows are AWEFUL. Monday nites most shows are dark, but Rita Rudner was performing, so I thought I'd take in that show. She cancelled at the last minute! The food in the biffet is mediocre at best. The buffet at the Billagio was incredible; I think I'd stay there next time. Harrah's is just a tired and weary hotel.", "user": "p8umpkinseed", "date": "May 7, 2008", "id": 15754813}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "We stayed 4 free nights at Harrah's (4/29-5/03) in a double queen bed room. Upon check-in, I asked if we could get a free upgrade to a suite, while handing a $100 bill to the clerk. She promptly told me no and went on to explain that she could be fired if she gave suites away without management approval. Knowing I had lost the battle, I decided to just be happy with my 4 free nights!!", "title": "Great time at Harrah's", "helpfulness": 1, "user": "lionsfan1971", "date": "May 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15680332, "likes": {"liked": "— Free room, location, location, location", "disliked": "— Price of the buffet!!"}}, {"rating": 2.0, "title": "HELP AT HARRAHS", "text": "The Good:", "user": "1irishfan", "date": "May 4, 2008", "id": 15632810}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "1) The room was clean and tidy and was large enough for 4 of us. The bathroom was clean and the shower had great water pressure and drained good as well!!", "title": "Great location In the middle of the strip", "user": "ProudToBeCanadian", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15622515, "likes": {"liked": "— Location", "disliked": "— small room"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "2) The Piano Bar is a good place to watch your favorite team play on several TV's. The downside is that drink prices double when the entertainers start playing!", "title": "Never again", "user": "lloulou", "date": "May 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 15612770, "likes": {"liked": "— Nothing", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed 3 days at Harrah's. Absolutely Fantastic. I booked through their website & got a great deal $64/night for a luxury room & great view of the strip. The casino was very good with plenty of slot machines.Its probably older than some of the newer hotels on the strip, but great value for money. Extremely clean & wonderful staff. Location is right in the middle of the strip & close to all the major hotels.Well worth a visit. All the restaurants had good meals & value for money, an excellent buffet.", "title": "Excellent location", "helpfulness": 2, "user": "OutbackAussie", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17009294, "likes": {"liked": "— Location & price"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Harrah's is definately not a luxury hotel, but still could use some work. Our room was TINY, but described on website as the luxury upgrade????????? The bathroom only had one sink and on our 2nd night there the tub wouldn't drain. I will say the maintenance staff works fast, we left our room for less than two hours and the tub was fixed. Maid service was good. SLOTS WERE SUPER TIGHT.", "title": "OK Hotel...Could use some work", "helpfulness": 1, "user": "bmoregambler", "date": "June 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 16926295, "likes": {"liked": "— location", "disliked": "— tight slots, poor choices for dining , loud music all night"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "We had a very bad experience with a room service clerk, she was extremely rude. We ordered an item from the menu one night with no problem...next day tried to order it again and was told by \"RUDE CLERK??\" we haven't had that on the menu for over two years as if we were lying!!! So your in-room menus havent been updated in 2 years??? My husband called back and he asked for the manager. She was not in but called us promptly the following day, she comped us a free dinner and sent a very nice card apologizing for the poor service we received.", "title": "Great hotel for the money", "helpfulness": 3, "user": "emdpetey", "date": "June 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 16922567}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "All in all its a nice place but could use some renovating, some areas look like they haven't been touched in years. Our room was in the Mardi Gras tower overlooking the pool, I have been told this is the newer/renovated tower...but be warned the music from the Carnival Court is loud and goes until 4am. Light sleepers stay away. I don't think I would stay here again, but would not tell others not to.", "title": "Love it here!", "helpfulness": 3, "user": "CubsGirl81", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 16836534, "likes": {"liked": "— The friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I just stayed at Harrahs for 5 nights in June. It was my second time staying there ( the first being over 10 years ago) and I was very happy with my choice. I booked online using my total rewards comp card and got the casino rate at $40 a night. I checked in at 7pm on a Sunday night and asked if they had any of the renovated rooms. The very polite lady at the desk said it would be another $20 a night which I declined. I was put in the Mardi Gras tower on the 12th floor. The room itself was smaller in size but very clean. The mattress was exceptional, in fact I thought it was better than the one I have at home. Even though I wasn't given a renovated room, I found this one to be great. Also, I was given a room with a strip view facing Mirage and Caesars Palace. There was only one thing I didn't like which was the air conditioner in the room. The air is on sensor and shuts off when your not there. When you open the room door it goes on and cools off the room in 10-20 minutes. You can set the thermostat to your desired room temp but it only goes as low as 65 which if you like the room like an ice box then you wont be happy. At night when your sleeping the air system somehow knows your in the room and keeps it nice and cool. The casino itself is older but that doesn't really matter because you have all the other top casinos so close. If your looking for a casino/hotel with all the chandeliers and high end stuff then this isn't for you but if your budget minded and need a nice clean room then Harrahs is your place.", "title": "Loved it!", "helpfulness": 5, "user": "lorelie21", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16565271, "likes": {"liked": "— location", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We knew about the problems that Harrah's had been having before we went there, but were ensured we would have a room.", "title": "They had to move us, but customer service was wonderful", "helpfulness": 5, "user": "ChicagoChris", "date": "November 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10671203}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "When we checked in, we ended up having to move to Paris for one night, but would be able to check in the following morning. When asking if we would still have problems, they ensured us we would have priority check-in.", "title": "Mediocre hotel in a town where you can do much much better", "helpfulness": 6, "user": "fireballhill", "date": "October 31, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0}, "id": 10470286, "likes": {"liked": "— location", "disliked": "— need remodeling, better ventilation, better Internet access, new pluming, soundproofing"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007", "text": "Sure enough, when we returned the following morning, they not only accommodated us at 10:30 that morning, we we got a newly renovated room in the Mardi Gras tower.", "title": "Nice hotel, great location", "helpfulness": 2, "user": "prasenberg", "date": "October 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10348686}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Room is on the small side, but very nice and clean. Could not hear anything in the hallway. Gave us extra towels as requested. Water pressure in shower was very good. There's even a TV in the bathroom!!", "title": "Good for one night", "helpfulness": 2, "user": "MacDave", "date": "October 23, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 10273722, "likes": {"liked": "— location", "disliked": "— Noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Room had a safe and an iron, which are both plusses in my opinion.", "title": "Great - As usual", "helpfulness": 5, "user": "realtor99", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10145892, "likes": {"liked": "— Large clean room with all the amenities we needed.", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "Alright", "text": "On the upside we got a great deal on the room and the dealers and other guests were pretty friendly. On the downside it was really smokey and the comps were unbelievably bad (played hours and hours for several days and not even a meal). The hotel and the rooms were nothing special.", "helpfulness": 3, "user": "Wookie1070", "date": "January 7, 2004", "id": 1541765}, {"rating": 3.0, "title": "Hurrah for Harrahs... sort of.", "text": "We wanted a good central hotel for our last night in Vegas, and Harrahs fit the bill. They had a room deal - $49 for the night, which included a voucher for $50 off any airline. Sounded groovy to us... It's true, the location can't be beat - you're right in the middle of the Strip.", "helpfulness": 7, "user": "jdoexyz", "date": "January 21, 2004", "id": 1560192}, {"rating": 4.0, "title": "Good Hotel with great location, gamble elsewhere", "text": "Harrahs also has one of the liveliest entertainment venues on the Strip - Carnaval Court, a large outdoor bar with live music which seemed to attract an energetic, mixed crowd. Our room in the Mardi Gras Tower was perfectly nice. Not big, but it seemed renovated. Clean, neat, all you'd expect. The usual beige bland hotel decoration. A mini bar, though no room safe. We had a view of the parking buildings and a tiny almost-balcony you could edge two toes onto. We'd requested non-smoking, but despite an absence of ashtrays, our room had certainly housed smokers in the recent past. Never to mind... it was our last night, we were prepared to be generous. So the room, the rate, the location, the bar... all thumbs up. Thumbs down on the casino, which was noisy in an annoying, rather than exciting way. Smoky too. And confusingly laid out, so it was a long walk to the check in desk. More downward thumbs on those airline vouchers, which require you to book your ticket through a certain travel agency. Not necessarily a disadvantage, but not as straightforward as they made it sound. Thumbs undecided about the sleep factor - when we got back to the room at 2am, the music from Carnaval Court couldn't be heard. When we'd gone out at 8pm, however, it was fairly loud, so if you're bothered by the thumping of a bass beat in the early evening hours, this may not be the place for you. We'd possibly stay at Harrahs again, but while it was good, it was nothing extraordinary - and nothing we'd have reason to become totally loyal to.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 10, 2004", "id": 1545152}, {"rating": 5.0, "title": "Harrah's Is Our Favorite", "text": "My sisters and I stayed at Harrah's from 1/2-1/5. They managed to check us in at 10am and we got the room we asked for. It was very clean and spacious. We didn't gamble at the hotel much since the layout and loudness of it (not to mention not being offered any drinks at any point) sent us in search of other casinos. We ate at the buffet on two occasions and it seemed ok, a tad pricey for what you got, though.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 9, 2004", "id": 1544049}, {"rating": 5.0, "title": "Great Experience", "text": "Overall, the experience was good, you couldn't beat the location. My sister had moved something in the minibar at one point and we were charged $4.25 even though we didn't consume anything. The woman at the checkout explained they have sensors in the fridges that will charge anything removed to the room even if it is put back. She took the charge off our bill which I thought was very nice of her since we made the mistake. However, I just checked my credit card bill and they just added the $4.25 back onto it as a separate charge. All in all, Harrah's had everything we needed, nothin fancy, just the basics.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 9, 2004", "id": 1543776}, {"rating": 4.0, "title": "Good location - nothing fancy", "text": "I go to Las Vegas 2 or 3 times a year for fun. I always try to stay at Harrah's. Service is excellent, and ALL of the personnel from the check-in, to the cocktail waitresses, to those who pay off winnings are the friendliest in town. Fastest payoffs I have seen. Rooms are clean and comfortable. Food is good. For the price you can't beat it.", "helpfulness": 3, "user": "travel23", "date": "January 8, 2004", "id": 1543176}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "My husband, son and daughter visited Las Vegas for my daughter's 21st birthday. I must admit we chose Harrahs because we had comped rooms and each time we visit Vegas we stay at the property. I must say, we were disappointed in everything from the housekeeping (did not sweep the floors the entire time we were there) to the casino. I have always liked the Harrah's properties but I do believe this one has slid down hill a bit. Each time I have visited the Las Vegas location, we have been given an upgraded room. Not this time. We had two standard rooms. The rooms were not clean and we had to asked the maid to sweep the floors. The sinks did not drain in either bathroom and the shower, even though the curtain was inside the tub, leaked all over the floor. I usually can win at least a little money while I'm there but not this time. The slots were really tight. In fact, I didn't see anyone win the entire time we were there and we played mostly at Harrahs. The pool was just OK (make sure you don't move the lounge chairs). The food was just OK. Best feature about the whole trip was Toby Keiths Bar and Grill. They have a great house band on the weekends.", "title": "Not as good as it used to be", "helpfulness": 4, "user": "HotSlotMama", "date": "May 21, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 16284991, "likes": {"liked": "— Toby Keith's Bar and Grill", "disliked": "— The room/non-winning casino"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Whenever I go back to Vegas, I will choose a different hotel. The way we gamble, I'm sure we can get a room comped anywhere,", "title": "Better Than Expected", "helpfulness": 5, "user": "grobma", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16153491, "likes": {"liked": "— Newly renovated room", "disliked": "— Food choices"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "After reading reviews on this site, my expectations were set on the low side for my stay at Harrah's (was attending a conference there so didn't have a choice of where to stay).", "title": "Great Vacation", "helpfulness": 3, "user": "HMGal", "date": "May 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 16152715, "likes": {"liked": "— Location", "disliked": "— Rooms could have been cleaner."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I arrived early and found out that I had been placed in a newly renovated room. Unfortunately, the room wasn't ready yet - not their fault as I arrived 3 hours prior to check-in time. I was, however, offered a different room that was ready right away but the desk clerk advised me that the newly renovated rooms were very nice and she recommended I wait. I checked a couple of times over the next few hours and my room was finally ready exactly at check-in time.", "title": "you won't sleep well!", "helpfulness": 4, "user": "coyotetomMichigan", "date": "May 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 16135320, "likes": {"liked": "— location", "disliked": "— noise, no sleep"}}, {"rating": 4.0, "title": "perfect spot", "text": "The room in the Mardi Gras tower was very nicely appointed but one of the smallest rooms I've ever had in Las Vegas. Nice big screen LCD TV, but no HD signal so the image was stretched. This is the second hotel I have stayed in recently where recent renovations included a large screen LCD TV but for some reason at the expense of drawer space. Nice granite top in the bathroom, great water pressure, and a smaller LCD TV mounted in the bathroom as well. Nice touch. The new bedding was very comfortable and the room was spotless each day. No working desk - just a cafe table with 2 chairs, but that's pretty much the norm in Vegas.", "helpfulness": 1, "user": "torreSpain", "date": "May 7, 2008", "id": 15783058}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 3.5, "variance": {"poor": 360, "average": 929, "very good": 1467, "terrible": 224, "excellent": 718}, "aka": "Harrah`s Las Vegas Hotel", "slim_ranking": 0.437037037037, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "At fun, friendly and action-packed Harrah’s Las Vegas, you’re always comfortable and welcome. At it’s location in the heart of the Strip, you’ll find a host of entertainment that extends throughout and beyond the gaming floor. Harrah’s is home to the hit show Defending the Caveman, the historic Improv Comedy Club and the ultimate celebrity tribute, Legends in Concert. For those looking for a bite to eat, unpretentious down-home cooking and laid back fun is a staple at Toby Keith’s I Love This Bar & Grill while The Range Steakhouse is sets the scene for an elegant dinner. After (or before) dinner drinks can be had at one of several bars – the newest being Numb, a frozen cocktail bar located right on the casino floor. For those looking to have fun outdoors, Carnaval Court Outdoor Nightlife is non-stop party just steps away from the Strip. Don’t miss the flair bartenders!"}