{"user_rating": 3.5, "review_count": 1038, "name": "Harrah's Laughlin", "reviews": [{"rating": 1.0, "title": "Beware !!!", "text": "WARNING!!!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 2, 2005", "id": 3630014}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "This is the most poorly run hotel I have ever experienced. Be prpared to wait a long time for everything from obtaining a pool towel to getting on the elevators. Every employee we interacted with had a bad attitude. For some reason they have security guards everywhere who like to tell you what you can and can't do. The rooms are small, noisy, cheaply furnished and dirty. Don't be fooled by the cheap room rates they will make up for it in incidental charges, for example", "title": "Very Nice Hotel", "helpfulness": 8, "user": "vegascancun", "date": "June 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3623699}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "IF YOU MISPLACE YOUR 2 CENT PIECE OF PLASTIC ROOM KEY THEY CHARGE YOU $25.00 ( YES, TWENTY FIVE DOLLARS ) TO REPLACE IT.", "title": "Very nice !", "helpfulness": 10, "user": "MonkeyRN", "date": "June 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3547758}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Any othe hotel in Laughlin would be a better choice", "title": "A new favorite destination", "helpfulness": 19, "user": "jake10", "date": "May 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3497525}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Mike Collins", "title": "Best on the river, but.....", "helpfulness": 13, "user": "bundyone", "date": "May 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 3461844}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "Harrah's Club is Laughlin's nicest hotel and it has the nicest river frontage. It is the only hotel that has a beach.", "title": "Nice Hotel but isolated", "helpfulness": 21, "user": "Tomcod", "date": "November 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4092007}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "But, because Harrah's has decided not to extend the River Walk to their hotel, it is isolated. Unless you really like taking a long hike, there is nothing within walking distance of Harrah's. For this reason, I rarely stay there. To me the nicest part of Laughlin is having the River Walk and being able to jump from hotel to hotel for the different casinos, restaurants, etc. At Harrah's you must drive or take the water taxi to reach another hotel.", "title": "Nicest Hotel on the River", "helpfulness": 24, "user": "Juhl", "date": "November 5, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4088527}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Another complaint would be the poorly designed parking structure, that requires arriving guests to walk a virtual maze of stairways, elevators, and bridges in order to get to the hotel. And since you have to drive everywhere you have this long walk to your car every time.", "title": "Wonderful hotel to stay.", "helpfulness": 18, "user": "Mrst1966", "date": "October 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4017485}, {"rating": 5.0, "title": "Wonderful people", "text": "If Harrah's would just build a connection to the River Walk and improve the connection between the hotel and parking lot, this would be the hands down top hotel in Laughlin.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4007455}, {"rating": 4.0, "title": "Nice trip", "text": "Clean and comfortable rooms. Especially liked that they offer an adult tower. Although, the hotel is away from the others the water taxi ($4pp) provides easy access to the other hotel-casinos. Nice beach and pool areas. Onsite waverunner rental was convenient and we had a great time on the river.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3931577}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "When we arrived our room was NOT available and this is normally not a problem in a Harrahs casino however on this occasion just after we started to wait ( I was in the washroom) my wife and adult daughter sat down at a slot machine outside the washroom entrance. Almost immediately a cleaner walked up to our medically disadvantaged adult daughter (she is 25) and out of the blue verbally attacked my daughter saying, \"you can't be here\" and would not listen to any explanation at all. My wife offered to show her (my daughters ) I.D. and her response was a negative one. Finally, when a little of what my wife was saying seemed to be understood the cleaner turned and walked away saying, \"she don't believe it\" and \"whatever\" It was more her attitude and tone of voice that was offensive to my wife but this employee damaged our daughters self-esteem as well. We immediately went to security and talked with security and he verified her credentials. We mentioned what happened and he asked if we could identify the cleaner. We looked for two days and never did see her again. We still want this person found because she needs some sensitivity training when dealing with a mentally disadvantaged adult.", "title": "Worse treatment in Harrahs chain of hotels", "helpfulness": 51, "user": "honydo", "date": "May 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 2.0}, "id": 3437810}, {"rating": 5.0, "title": "once again Harrah's is the best.", "text": "The result of this attack is my daughter self esteem took a beating and her head remained hung low for the last five days of the trip. One of us and most times both of us guarded our daughter while in public areas. Other Harrahs employees inquired (as is there right to check) about her age and accepted her security bracelet or I.D. without question.", "helpfulness": 36, "user": "birkenhead", "date": "April 29, 2005", "id": 3424643}, {"rating": 4.0, "title": "Great Place", "text": "Secondly, when we went to get our room keys the hotel receptionist failed to give us the charge card part of our bill. I looked for an hour in the room and when I went to report it missing to the front desk (to the same clerk) she first said, \"I always give them to the guest\" She made me a new copy then went to her garbage can and pulled out about ten of these slips. This is scary as anyone could have make charges to our room. (or to any of the other guests cards that were in the garbage)", "helpfulness": 39, "user": "A TripAdvisor user", "date": "April 23, 2005", "id": 3400531}, {"rating": 1.0, "title": "never again", "text": "Next our truck was parked for security reasons with valet. We have a disabled sticker and want to feel secure when we leave the vehicle. (In Harrahs, Las Vegas, they told us they can't be responsible for our truck and we self parked it) Nothing was mentioned at your casino.", "helpfulness": 39, "user": "A TripAdvisor user", "date": "April 18, 2005", "id": 3374569}, {"rating": 3.0, "title": "Harrah's Laughlins is very nice, But......", "text": "Our problem, the next day when we were walking, we walked past the truck and found it left unlocked and NOT in a secure valet area. The vehicle was parked next to a walkway so anyone could have entered it without being noticed. After talking with valet they locked the vehicle. When the vehicle was returned to us the driver side door, window, and outside mirrors were all coated with an unknown substance that did NOT dissolve in water. The windows and mirror smeared making them unable to see through. We stopped while leaving Laughlin at a service station and bought an industrial cleaner which allowed us to continue our journey safely.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "April 17, 2005", "id": 3371152}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "We flew to Laughlin on a charter flight and 4 night trip offered by Harrah's. On the positive side, Harrah's is one of the only two hotels in Laughlin that offers ticket in and out machines. The other casinos are filled with the old coin machines so you actually have to fill the old plastic buckets with coins and stand in the long line to the cashier to cash them in! We had a wonderful dinner in the steakhouse and the mexican restaurant. The rooms are terribly small and very outdated and old, but the double beds are comfortable. Supposedly, we were in a \"premium room\", because it had a coffee maker, wow! It's at the end of the strip, so we had to take cabs to the other casinos. We paid $16 for a round trip to the Riverside Casino. The employees were nice and it was a bargain trip offered in a flight/room package by Harrah's, but I wouldn't go back. If I did, I think I would stay at the Riverside. Also, there wasn't a single person on the plane home that had won.", "title": "Temp too hot, machines too cold", "helpfulness": 12, "user": "smalltowngalReno", "date": "August 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3815650}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We stayed at Harrah's two days and it was great. Everyone was so nice. It is the only Laughlin hotel with a beach. We rented wave runners right there on the beach at the hotel. Fastest valets ever. Like others have warned though,", "title": "Only hotel with a nice beach and activities", "helpfulness": 14, "user": "JaguarVideo", "date": "August 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3806131}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "STAY AWAY from the north tower if you don't have kids.", "title": "Friendly Staff but stay away from North Tower", "helpfulness": 14, "user": "TravelingGuitar", "date": "August 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3759686}, {"rating": 5.0, "title": "good good good", "text": "We stayed two nights at Harrah's Laughlin. We loved the gambling and River View Room. All the Blackjack Dealers and the Pit Bosses were the nicest we ever encountered. Still they took our money. Everyone was very friendly. Pleasant employees at the front desk and restuarants. We paid for the River View Room and really enjoyed the views. If you are traveling without kids, request not to be put in the North Tower. The North Tower is the family tower and it is crowded in the summer time with children.", "helpfulness": 3, "user": "navymom1007", "date": "July 27, 2005", "id": 3705991}, {"rating": 4.0, "title": "Fun for the whole family", "text": "good hotel nice people - upon arrival a gentlemen from london treated us wonderfully we will be back", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 18, 2005", "id": 3677066}], "location": {"country": "United States", "city": "Laughlin"}, "stars": 3.5, "variance": {"poor": 114, "average": 236, "very good": 358, "terrible": 113, "excellent": 217}, "aka": "Harrah`s Laughlin Hotel Laughlin", "slim_ranking": 0.363636363636, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 3.5}}