{"user_rating": 4.0, "review_count": 243, "name": "Hawthorn Suites by Wyndham -Oakland/Alameda", "reviews": [{"rating": 3.0, "title": "More than anything, locaton", "text": "If you are wanting to stay on Alameda Island, Oakland, or somewhat near the airport in a bit quieter of a setting you can't go wrong here. But if you are wanting Emeryville, Berkeley, or other places North of Alameda there are probably better options.", "user": "Chase71", "date": "November 23, 2008", "id": 22108639}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The property:", "title": "Nice room, great breakfast", "helpfulness": 1, "user": "StaceyM", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 21015307, "likes": {"liked": "— Large room, great breakfast", "disliked": "— couch bed was a twin, price"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "This is my first stay at any Hawthorn Suites. This property is the only one I can comment on. First the room: This is not a 2 room type \"suite\" that you'd get at a Homewood or Residence Inn. Its one room with the bathroom acting as a divider between a small living area with a TV and another bedroom area with a TV. A hallway allows you to go between the two sections which has a small refrigerator, a sink, and a microwave oven. Again if you are looking for the full service type kitchens that the other suite chains have you won't get that here.", "title": "Excellent Place", "helpfulness": 1, "user": "ArizonaJerry", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20737039, "likes": {"liked": "— Excellent Value", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "They have a decent hot breakfast but its pretty routine. If you stay more than 3 days you'll get everything they have. The scrambled eggs tend to be a bit on the dry side. They also have the usual cereals and sometimes yogurt. Coffee is good but once breakfast is over the coffee gets pulled like everything else. This hotel does not have a nightly week day reception meal. They do have a full meal each Wednesday night. It was good every time I had it.", "title": "great location, good value", "helpfulness": 1, "user": "81hoosier", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18469245, "likes": {"liked": "— location, neighborhood, overall value for the price", "disliked": "— Room had lots of ammenities, but was rather small. Wireless internet was ok, but sometimes slow."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "They do have an exercise room that was mostly unused. Which was fine for me. Also this hotel permits smoking on some floors. Considering the state I was in I was pretty surprised of this. The 3rd floor was nonsmoking and I never smelled anything.", "title": "Location, Location, Location", "helpfulness": 1, "user": "swpalm", "date": "May 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15865200, "likes": {"liked": "— The friendly staff, the free breakfast, and the location", "disliked": "— Everything was great!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "Overlooking a busy street on the third floor I found no problems with noise as along as the windows were shut. The suite was very comfortable and well stocked with teas, coffees and hot cocoa. The WiFi was easy to use. The front desk was very helpful and friendly.", "title": "Very pleasant place", "helpfulness": 1, "user": "quiltmama", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 15409587, "likes": {"liked": "— It was clean and comfortable", "disliked": "— The pillows and that is why I always travel with my own pillow."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Parking was free and very handy to the back entrance.", "title": "Super clean place to stay", "helpfulness": 2, "user": "JMEditor", "date": "April 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 14966770, "likes": {"liked": "— It was so clean!", "disliked": "— Noise from fire station."}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Our room was probably the cleanest hotel room I've ever stayed in. The free breakfast was above average. They served eggs, sausages, pancakes and potatoes in addition to the usual fare of juice, cereal, pasteries, etc. There are several restaurants within walking distance. The biggest downfall is the hotel's location to the fire station (about a block away). We were awoken once during the night by the sirens. Dispite this I would stay there again.", "title": "Very Noisy and Pricey", "user": "imallovertheusa", "date": "February 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 13788343, "likes": {"liked": "— Not much", "disliked": "— The NOISE"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I stayed here recently and I would not recommend it. The hotel is off a very loud street. Also the rooms were not at all worth the price. There are much more reasonably priced hotels in quieter places in the Oakland airport area. Save your money and get decent sleep by giving this place a pass.", "title": "A decent stay for the money", "helpfulness": 1, "user": "Bagpuss5", "date": "January 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12964086, "likes": {"liked": "— Location", "disliked": "— No bar!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Come to California from the UK on business a few times a year and find this place a reasonable place to stay. When you're in and out of hotels and rooms all the time the finer points get somewhat lost on you over time and the only things that matter are a) is it clean b) does it have good WIFI so I can work, c) is the bathroom clean and the shower good, d) does it have a good bed and e) can you walk to a few good dining places.", "title": "a great hotel", "helpfulness": 2, "user": "Ruthie17", "date": "November 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 11120469, "likes": {"liked": "— big room, quiet, great breakfast, laundry facilities", "disliked": "— a bit far from the center"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My husband called the hotel from Napa Valley to get directions. We wrote them down. They didn't work. We found ourselves in a very sketchy area of Oakland. We called the hotel and asked for directions. Even with the lone desk worker looking on mapquest, she could not give us directions. She called the Oakland police to meet us. The officer could point us in the direction of Alameda, but didn't know the location of the hotel. We had to call the hotel again and ask them to navigate us through Alameda. We were looking for a very basic place to spend 6 hours before getting on a plane at Oakland airport. I suppose very basic would be the only charitable way to describe the place. Do not recommend the property--on noisy thoroughfare; \"suite\" with work area had a seriously slanted floor. The hotel's printed directions to the airport were fine for people who lived in the area--\"go south towards Lincoln Ave.\" means nothing to travelers who can't even see the sun at 5 a.m.", "title": "Scary", "helpfulness": 2, "user": "sueeMaryland", "date": "July 25, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 8235145, "likes": {"liked": "— We didn't have to stay long.", "disliked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I needed a place in Alameda to put up my parents for the weekend, and this place seemed to fit the bill. I live in Berkeley, but I wanted a place where I could 'camp out' with my folks near my fiancee. This seemed like the best option.", "title": "nice...but a bit overpriced", "helpfulness": 2, "user": "Klinean", "date": "November 22, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6164738, "likes": {"liked": "— Convenience and Location", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Pros: Easy access (via Webster St.) and simple free parking, Great location....off the beaten path and yet close to the East Bay freeways and Oakland Airport; Clean room/sheets/bathroom; Fast and friendly checkin/out; Excellent free Wi-Fi service; quiet corner room on the 3rd floor (room 323); lots of towels.", "title": "Be sure to call in advance!", "helpfulness": 10, "user": "chechina", "date": "May 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5036882}, {"rating": 2.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "Cons: $139/night (for 3 nights) seems a bit overpriced; No sheets in the room for the pull-out sofa bed; One TV remote didn't work and neither TV remote had the battery cover on the back; breakfast was edible, but the background noise (e.g. a businessman gabbing away on his Bluetooth) one morning was slightly annoying; hot water but not much water pressure.", "title": "Nice room If you don't mind Noise & Dirt!!", "helpfulness": 8, "user": "ynp-CV", "date": "March 1, 2006", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4565645}, {"rating": 5.0, "title": "Great value for the Oakland area", "text": "The Final Verdict: My parents' visit was a success, and they had no real complaints. But they weren't paying the $139/night bill...and that was just too much, for what we were getting. I've stayed at other motels for half the price that frankly were just about on par with this Hawthorn. If I had paid $70-80 a night, I would definitely rate it higher.", "helpfulness": 8, "user": "arlenejoe", "date": "February 17, 2006", "id": 4466795}], "location": {"country": "United States", "city": "Alameda"}, "stars": 2.5, "variance": {"poor": 5, "average": 30, "very good": 98, "terrible": 7, "excellent": 103}, "aka": "Hawthorn Suites By Wyndham Alameda Hotel", "slim_ranking": 0.222222222222, "description": "Hawthorn Suites By Wyndham located in the beautiful city of Alameda, just a mile from downtown Oakland, was newly built in 2003 and renovated in 2011. The hotel offers superior amenities and great customer service in addition to studio suites with a King or two Queen beds, some with sofa sleepers. Complimentary hot breakfast buffet includes eggs, potatoes, meat, pancakes, juices, fruits, yogurt, hot and cold cereal, Starbucks coffee and a variety of teas. Parking and T1 reliable wifi are free and there are several nice restaurants within walking distance of the hotel. Bus and train connections are conveniently located nearby to San Francisco and other destinations and attractions in the Bay Area. Come and stay at our hotel to experience superior hospitality from a dedicated staff."}