{"user_rating": 3.5, "review_count": 260, "name": "Hawthorn Suites Seattle/Kent", "reviews": [{"rating": 5.0, "title": "Beautiful hotel", "text": "This hotel is just beautiful and is in a beautiful location. Gotta love this place for its beauty!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 23, 2003", "id": 1106162}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "We recently stayed here with our children and two small grandchildren. We had a two level townhouse and the space available was good. Nicely equipped kitchen and bathrooms. Carpet and bed coverings showing signs of wear and the furniture really needed a good cleaning. Was quiet however the guy downstairs called and complained we were too noisy. The floors creak even with soft walking. The babies could not help falling on their behinds. We are very early risers and they were not! Breakast buffet was perfect for those on the go and families. Check in and staff was very nice and did a good job. Great place for families.", "title": "Showing Wear", "helpfulness": 5, "user": "AKfun", "date": "March 6, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4587145}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Great place for kids-stayed for a volleyball tourney and the rooms were spacious and comfortable.An excellent breakfast was available every morning and was quite an assortment.The front desk was very accomadating with a problem reservation to get a room to fit our needs.", "title": "Great for groups", "helpfulness": 5, "user": "Craig C", "date": "February 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4475512}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The room was beautiful and spacious, and the complimentary hot buffet breakfast and evening reception made our stay a great deal as well! I would definitely recommend, there should be more Hawthorn Suites out there", "title": "Fantastic!", "helpfulness": 4, "user": "GreatEatz", "date": "November 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4081602}, {"rating": 1.0, "title": "Experience staying here was terrible", "text": "The bed in my room looked very cheap and was uncomfortable. The sheets were low quality, like 150 thread to me. The bed definitely should not in a 3 star hotel. I thought it was even worse than that in most of motels.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 5, 2005", "id": 3738729}, {"rating": 2.0, "title": "Nice hotel", "text": "The TV in my room didn't work. Then the repair guy came and told me he couldn't fix it until the next day when I would check out. I called the front desk to ask if I could have a replaced TV or if I could get another room. The answer was no, all rooms were full which I really doubted.", "helpfulness": 7, "user": "JANICE S", "date": "October 12, 2004", "id": 2699141}], "location": {"country": "United States", "city": "Kent"}, "stars": 2.5, "variance": {"poor": 36, "average": 50, "very good": 74, "terrible": 27, "excellent": 73}, "aka": "Hawthorn Suites Seattle/Kent Hotel Kent", "slim_ranking": 0.615384615385}