{"user_rating": 4.5, "review_count": 995, "name": "Hedley House Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I would highly recommend this hotel, service is excellent everytime and the staff are always so helpful.", "title": "Great nights sleep - lovely breakfast your home from home whilst away!", "user": "ktday", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72832340}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Great breakfast and you will always get a great night sleep!", "title": "Wonderful hospitality", "user": "PatandSuzanne", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72818528}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Apart from comfortable rooms and very convenient location (just a short walk to the centre of York), Mandy at reception is just another reason for staying at Hedley House. Her bright bubbly nature and quirky sense of humour was a bonus for us Aussies! The staff in general were very helpful with information to help us in our search for family history. Good value for money and would certainly go back again. Highly recommended. Thank you. Pat & Suzanne - Australia", "title": "Very nice place", "user": "John_&_Maria", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72619667}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Nothing wrong here, a good place to stay, very close to the city centre without being right on top of things.", "title": "Very friendly, excellent food and service", "user": "Jules187069", "date": "July 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71378706}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The building is quite old, so expect a few creaky floors and steps to climb, but evertything is very clean and pretty good value for York.", "title": "Very Good Hotel", "user": "springsummer2010", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 70637835}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This was further north of the city than I normally venture to but I'm so glad we stayed here. It was a lovely hotel, great service and good value for money. Plus it was a lovely walk along the riverbank or through the musuem gardens to get to the centre, which was a bonus.", "title": "Excellent Hotel", "user": "carmo1", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70637822}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Thankyou so much to Greg and Louise for helping to make our weekend away so perfect!! Your hotel has been renovated to the highest of standards and is an absolute credit to you both. You obviously work so hard, and is shows in the hotel, but certainly not on your faces, such a jolly couple yet so very professional. Our room had everything we could possibily need and was very comfortable, clean and modern. We will recommend your hotel to family and friends and we will be visiting again as soon as we can with or without the twins. Thankyou again, Bill and Jayne (Good Luck!!!!!!)", "title": "The nicest and most friendly hotel we have ever stayed at in York!!!!", "user": "HOTELLOVERS8885", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70592519}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our stay at Hedley House Hotel was great!", "title": "I will always stay here whenever I'm in York!", "user": "KSmith_10", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70581306}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "For a start they are so accommodating! I had to be at the wedding I was going to very early and wasn't sure whether I'd be able to shower and get ready as the previous occupiers of our room might not have checked out yet. They told me that they could find somewhere for me to get ready whether my room was ready or not.", "title": "pleasent accomdation but noisy", "user": "Alishu", "date": "July 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 70575644}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Secondly the room and bathroom were spotless and beautifully furnished. I was also amazed at the attention to detail (including a flatscreen tv and a hairdryer in the room).", "title": "great location, helpful and friendly owners and staff.", "user": "jon020", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 70441964}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We always book on recommendations from trip advisor and once again we came up trumps. This is a well run hotel with attention to detail being very good . The hotel is located in a quiet street with parking facilities which in York is important. The room was spacious and comfortable, the breakfast was excellent .The staff were very attentive and provided a very good level of service. We would certainly stay at this hotel again.", "title": "A perfect location in a wonderful city", "user": "DaxieConsett", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74138190}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Booked Hedley House after reading about it in Rick Steves' guide. We had five in our group--one couple with a 7 year old and one young couple. Hedley House is the kind of charming B&B that you will want to settle into and spend some R&R time! It is convenient to the center of York (5 minute walk) and an easy walk from the train station (about 10 minutes once you figure out your direction!). Mandy was great! She gave us good restaurant and train advice and welcomed us like friends. Breakfast was fantastic: full English breakfast, fresh eggs, homemade granola, excellent bacon. The only problem we found was the noise from Bootham Terrace--our room was street-side--so ask for a room at the rear of the house. The young couple in our group slept in a room at the rear and found it much quieter. We will definitely stay again!", "title": "Our new favorite B&B in York!", "user": "Eat_Drink_Luv_Travel", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 74095517}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The breakfast was good but the room where it was served was small.", "title": "Don't believe the reviews", "helpfulness": 2, "user": "warwick-7", "date": "August 6, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 74077944}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The pictures and the reviews are not the same as the hotel itself!!", "title": "Friendly", "user": "Cae49", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 73486511}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Its a dingy place with difficult parking spaces.", "title": "Great place to stay close to the centre of York.", "user": "Hellsbellsbarker", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73367734}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We had a wonderful stay at Hedley House! Per recommendation from Rick Steves' guidebook and the reviews from TripAdvisor we had high expectations, and were not disappointed! Our first night had a few \"bumps\" including a plumbing issue, but our every need was attended to and we were offered an upgrade to the neighboring apartment suite with no additional charge. While they were very busy with many youth groups touring, they never appeared to be frazzled or too busy to assist with our needs. The car park is awesome. We didn't have to worry about driving and could easily walk wherever we wanted. We talk often about what wonderful meals we had in the restaurant (the homemade pizza and York ale were the perfect ending to a busy day of touring!). Our stay at Hedley was a wonderful way to enjoy the great city of York! I highly recommend this hotel.", "title": "Superb service, friendly staff, delicious food, and excellent location!", "user": "lohughes", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70352818}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed at Hedley House for one night in June, and were glad to find a room in the annex(actually a suite with a little kitchenette), as we hadn't booked. The room was rather sleek and modern and not what we expected in York, but comfortable, roomy, and very clean. The kitchenette (which we didn't really need) seemed to be well supplied with equipment. A hairdryer (which we would have liked) was unfortunately not provided in the room. The next morning we discovered that the shower did not work properly - you could have a bath at a comfortable temperature, but for a shower the choices were HOT or COLD. The really aggravating thing about this was that mentioning it to the person at the desk the next morning prompted a response only of ,\"We'll have to get someone to look at that.\" No apology much less a credit off the bill which we thought might have been more appropriate, a working shower being something of a basic one expects in a hotel.", "title": "good location", "helpfulness": 1, "user": "jjkazoo", "date": "July 5, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 69834432}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "WIFI only worked in the guest lounge area, not in the rooms.", "title": "Everything about this hotel was brillant", "user": "janekralemann17", "date": "July 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69352497}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "There is off-street parking behind the hotel, but it's a bit of a tight squeeze getting in and out and there seemed to be some possibility of getting blocked in - some people might find it too difficult.", "title": "Very good hotel.", "user": "stephenrhughes", "date": "June 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68898347}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Breakfast was ok, nothing special. It was served in an area that seemed very crowded with a large group of college students. The room cost with breakfast was more, and we didn't think it was worth it. Would recommend saving the money and going out instead to one of the many pastry shops in York.", "title": "Our stay in York", "user": "njohughes", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 68575052}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 29, "average": 76, "very good": 331, "terrible": 11, "excellent": 548}, "aka": "Hedley Hotel York", "slim_ranking": 0.191489361702, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Hedley House Hotel - A 3 Star Silver Award Hotel, within an 8 minute walk of the city. All rooms en-suite & all recently refurbished. Free wireless internet access. Off street car-parking, restaurant & lounge bar. Gym, 6 person outdoor aqua spa. Ample parking."}