{"user_rating": 4.0, "review_count": 1526, "name": "Hedonism II", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our first trip to Hedo! This place was on my bucket list of must do's and it far exceeded our expectations. This is an EPIC party place with great staff and the friendliest clientele I have found anywhere.", "title": "Great Resort - Outstanding Party!!", "helpfulness": 3, "user": "HaywoodJablomi", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108205792}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Virtually anything is possible at Hedo. Within the first few hours of our arrival we bounced in to Ron Jeremy just hanging out on his own and a group of 16 hot college aged girls on site for a photoshoot (special shout out to Dave from Show-Me's Bar and Grill for choosing the same dates that we happened to be there). Had a feeling this was going to fun for the rest of our stay after that.", "title": "Getting Better", "helpfulness": 1, "user": "captkerk", "date": "May 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 108112333}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our days consisted of the recovery breakfast (the Vodka and Champaign are next to the omlette station and juice stations) if you happen to be alive before the main bar opens, hanging out at the nude pool (great party!), Jerk Chicken from the pool shack, massive midday cat nap, dinner, the piano bar, and Club Hurricane for the theme nights. We came prepared for the theme parties and are glad we did, one of which was the famous Pajama/Lingere party. Awesome fun to say the least!!", "title": "A Wedding in Paradise Beyond Our Dreams.", "helpfulness": 4, "user": "dexter6969", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 107650345}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "As for the staff, special thanks to the Lady Peach, the Lady Michelle, the Lady Lisa, the Mon Michael, the Mon Ferrari, and too many others to remember. They are a few of the entertainment councelors and work their a$$es off to but on a good show and get everyone involved (that wants to be).", "title": "Sex in the resort", "helpfulness": 5, "user": "jj19532001", "date": "May 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 107244647}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Like most of the reviews I've read before, the rooms could use a little updating but we didn't go there to stay at The Plaza. The food was plentiful and good but not five star. Again, we didn't go there for fine dining. Both the Italian and Japanese restaurants are absolutely worth doing for dinner while you're there. The bars are fully stocked and I had no trouble finding Glenfiddich, Jamesons, Johnny Walker Black to give you an idea. We would SERIOUSLY recommend bringing you own travel mug for frozen drinks at the pools. They'll fill whatever you bring to the brim.", "title": "Very Poor Customer Service", "helpfulness": 26, "user": "SgtBruski", "date": "May 5, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 107050248}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "My wife and I recently returned from a wonderful vacation to Jamaica. We spent the greatest 11 days at Hedonism II in Negril. This trip was not our first to H2, and it will certainly not be our last. Why? Because a trip to Hedo is a breath of fresh air to my wife and I who desperately need that fresh air. And the trip was an opportunity to not only spend time at one of the finest resorts in Jamaica, but also an opportunity to renew friendships, and begin new friendships that will last for our lifetimes. From the moment of our arrival until the moment of our departure, we became part of something greater and more exciting than can be found any other place on earth. We became a part of the Hedonism II extended family. Yes, that means we were treated as if, and really felt like, we were a part of the Hedonism II family. In reality we were family for those 11 days.", "title": "A Uniquely Wonderful Vacation Experience", "helpfulness": 7, "user": "PWPfromCantonT", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20127652, "likes": {"liked": "— Everything!", "disliked": "— Are you crazy?"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "Our accommodation at Hedonism II was comfortable, clean, and inviting, with a comfortable king bed and an incredible shower. The Oceanview room provided a stunning view of one of the most beautiful beaches in the Caribbean. The view was especially breathtaking at mid mornings, and at night.", "title": "Awesome Resort and Experience......", "helpfulness": 2, "user": "boatmannewbern", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19438043, "likes": {"liked": "— everthing", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Unlike some resorts, the food was both plentiful and delicious. My wife and I have never experienced so many delicious food choices as were available on the buffet in the Main Dining room. All we tasted were fabulous! And then there were the two specialty restaurants – Munihana and Pastifari. Munihana served us great Japanese style steak and seafood cuisine, while our favorite, Pastifari, served us great Italian style cuisine with a Jamaican twist. The Jamaican twist is always good.", "title": "A Blast!", "helpfulness": 1, "user": "aa143", "date": "August 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 19239916, "likes": {"liked": "— Check-in and out process", "disliked": "— lighting (way too dark at night)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Were we entertained? Yes, from the moment we arrived until the moment we left! The entertainment staff at H2 did not just present daily entertainment, but were present, outgoing, and available around the clock. The entertainers (who are called coordinators) went out of their way to meet us, greet us, eat with us, come to know us, and make us really feel like family. They nurtured us to both relax and enjoy, and at the same time encouraged us to take part in the many activities that Hedo offers.", "title": "Great Trip, but crummy rooms", "helpfulness": 2, "user": "cassbeau", "date": "August 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 19210037, "likes": {"liked": "— The feeling of liberation.", "disliked": "— The godawful rooms!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Each and every employee we met and came to know really went out of their way to make us feel right at home. They actually cared about our stay, and wanted to get to know us better. By day three most of them knew our names.", "title": "hedo wedding and honeymoon", "helpfulness": 1, "user": "weefay", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 19040282, "likes": {"liked": "— Rarely told no.", "disliked": "— lack of towels"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "9/26 - 10/3 - 7 nights", "title": "Very Disappointing This Time...", "helpfulness": 7, "user": "JAMAICA_CHICK", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 20672914, "likes": {"liked": "— Great service from staff like maid, bartenders, and cooks!", "disliked": "— Lack of water and hot water, pool in disrepair"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "We are HEDO II veterans so we knew that we were booking during the low season, just as we did last year, however this year our experience was totally lacking. We don't rely on the resort to make our vacation fun, we do that ourselves, but we DO expect the resort to supply a consistent product, namely their excellent service, adequate creature comforts, including good food and drink. This time, HEDONISIM II failed miserably in our opinion.", "title": "Not a place I will return to...H3 is soooooo much better!", "helpfulness": 5, "user": "followthesun2", "date": "October 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20530562, "likes": {"liked": "— the maid was very pleasant", "disliked": "— room needed repairs, no tub, long walk with hills, bad lighting to get there"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The very low attendance seemed to be only a HEDO 2 problem, as we met many people as we arrived in the airport who were going to HEDO 3 and we met some guest from Sandals who were on a day pass to HEDO 2 and they said Sandals occupancy was reported to be around 75%, where as HEDO 2 was as low as 15 - 20% although they claimed 40%. The entire prude side was closed, including the grills and bars, and everyone was place in rooms on the nude side.", "title": "Below Average", "helpfulness": 5, "user": "scuba14u", "date": "September 30, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 20515000}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "NEGATIVES", "title": "First Time ....Might Be Our Last!!!", "helpfulness": 4, "user": "donfromdallas", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 20449907, "likes": {"liked": "— We loved the beach, and Augustus did a wonderful job keeping it clean!!!", "disliked": "— Admin Staff seemed non-existent at times"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The buffet was switched to ala cart service from a VERY limited menu. Food quality and quantity was poor.", "title": "Beware of slow times", "helpfulness": 4, "user": "bigdog02645", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 20372560, "likes": {"liked": "— new a/c units", "disliked": "— hotel operating on a hurricane budget"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We booked through Castaways Travel and had no problems with reservation or check-in. We saw all of our great staff friends who always welcome us home! The water slide was open, the walk bridge is completed and was about to reopen on the day we were leaving. The Entertainment Crew was awesome as usual, but we ALWAYS enjoy WINSTON and FIFTY (who came from Hedo 3) is a great addition to the EC staff! Fifty is so much fun and has the best personality. He makes sure you have a good time. Go Sticky Nicky you rock girl..so mean, but so good!! LOL The food seemed to be much better this time for us. Not sure about the changes at Munasan the food was not that great there this time. Miss Sophia is there greeting you and making sure all is well. Miss Lorna Clarke is always greeting you with a smile and ready to help you out if you need anything. DEON was doing his thing in the Piano Bar, he's great!! Thank you Kevin Levee and all the great staff there for caring about our vacation and keeping the resort beautiful and fun!! Oh and the Blue Mahoe SPA was fantastic, thanks Majorie and Jennifer!!! Also the service in the main buffet is THE ABSOLUTE BEST!! The bartenders, and wait staff and super! Stephanie, Paulette, Ariel, La Toya and SCUMBA - THANK YOU!!!!! But that new girl bartender working the main bar and the piano bar, she needs some customer service training.", "title": "Great trip this time!!", "helpfulness": 1, "user": "JAMAICA_CHICK", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 5.0, "service": 5.0}, "id": 111807839}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "The only complaints about the rooms are that we think it may be time to upgrade the bedding, particularly the mattresses, pillows, drapes and bed spreads!", "title": "Loved it and very memorable!", "helpfulness": 2, "user": "Tngqc", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111683377}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Best trip ever... excellent organization from A to Z. From transport to airport to site, to bookings to meals to animation!!", "title": "FREEDOM TO BE ME!", "helpfulness": 5, "user": "YogaNancy2011", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111642128}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Fully recommending this to everyone out there... great people, great conversations...", "title": "Dream Pleasure Tours Circus Erotica Week May 14-21, 2011. Amazing Week!", "helpfulness": 4, "user": "SoCalifTravelBugs", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111347889}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This place rocks!", "title": "All things considered...we had a great time and will return.", "helpfulness": 8, "user": "IndyCouple68", "date": "June 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 110931782}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I have been a Travel Consultant for almost 9 years now and since then I have sent Thousands of clients to beautiful resorts through out the world and have had the pleasure of visiting many myself and let me just say that this was arguably the best overall trip I have had so far.", "title": "Nothing Short of Amazing!", "helpfulness": 6, "user": "aaeternallove", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18007985, "likes": {"liked": "— All the Best", "disliked": "— Leaving"}}, {"rating": 5.0, "title": "Loved eveything about the place", "text": "My Fiancee and I are both 27 years old so let me start by saying that of course your going to see people in the 40 to 60 age range no matter where you go in the world and here is no exception however 1st of all there probably the most easy going/likeable people I have met not to mention some very attractive...2nd when we stayed there hands down we saw atleast the same amount or more people within our age range than outside of it, now with that being said there was plenty for everyone's liking.", "helpfulness": 1, "user": "Daliah54", "date": "July 18, 2008", "id": 18003006}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The Resort was absolutely Beautiful from the minute you arrive you feel like your in the garden of Eden, it is layed out in such a fantastic/sexy way that sets the mood for the rest of your trip. From lush gardens leading to various areas of the resort to pool and beach side cabanas with resting/playing beds to roof top terraces overlooking the Beautiful Negril coastline needless to say we were pleasantly surprised because not even the many pictures we had seen do it justice.", "title": "One person's opinion...", "helpfulness": 4, "user": "coolkat3579", "date": "July 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 17824659}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "There's nothing else to say about the staff then the Best. Every single 1 that we encountered was so genuinely humble/attentive and welcoming that honestly it made it even harder coming back \"home\". So get you used to hearing the phrase \"No Problem\" because there truly isnt any.", "title": "Loved the freedom, hated the room.", "helpfulness": 1, "user": "bethbower", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 1.0}, "id": 17751387, "likes": {"liked": "— There were always chairs and nice floats near the beach.", "disliked": "— The rooms."}}, {"rating": 5.0, "title": "Terrific again", "text": "The room was very well appointed, always clean, very spacious. Now lets make 1 thing clear were not talking about the Ritz Carlton there for the rooms are not covered in lavish detailing but you can rest asure that they will be all of what I stated above and more than you need while at the resort. We had a spectacular ocean view room on the nude side(room 2215) with no problems with it at all.", "user": "JPM2341", "date": "July 8, 2008", "id": 17653707}, {"rating": 5.0, "title": "Life is a Thrill", "text": "I am a single woman and have been going to Hedonism II for over 20 years. And before you ask, I am not a nudist, an exhibitionist or a swinger. But I love this resort and like the fact that many single men go there. Also I love the staff and management. They always remember my name, where I’m from, what I drink, the way I like my steaks, and various other things about me.", "helpfulness": 5, "user": "BetAtlanta", "date": "July 28, 2008", "id": 18363146}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I like the feel of the resort. When the resort was built many years ago, it was built to blend into the landscape. No buildings are taller than the trees and the color of the buildings is the color of sand. I love this about the resort and prefer it to the modern bright lycolored mid and high rises.", "title": "Sorry it took so long to write this", "helpfulness": 1, "user": "hedo42", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 18352199, "likes": {"liked": "— Very easy resort to get around", "disliked": "— rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "What keeps me going back? So many things. I love the non-stop party atmosphere. Staying at Hedo is like living in a bar or club. The excitement of “anything can happen”, the flirtation, the mutual flattery. I feel beautiful from the moment I step on the grounds. The dinner show and band are always lively, the piano bar is good entertainment and the disco is always hopping. As a single woman there are always plenty of guys to dance with. The entertainment crew is fantastic. Winston and Sarge sure know how to keep the party going.", "title": "Be Wicked for a Week indeed!!", "helpfulness": 1, "user": "Scaryruth", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18171631, "likes": {"liked": "— a great time with diverse people", "disliked": "— nothing in particular"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Activities. I like the snorkeling and diving. There are two trips of each included daily. I usually go on the 11:30am dive. The dive masters take safety very seriously although they keep me laughing with their senses of humor. I trust my life with Derrick and O’Neil. On one of our dives this month we saw a 10 foot nurse shark.", "title": "Hedo II July", "user": "ronmjo", "date": "July 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18072754, "likes": {"liked": "— The staff", "disliked": "— not enough towels at beach first thing in morning"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My very favorite thing to do is to take the catamaran booze cruise. I never let that boat go out without me on it. I especially love the day trip. It takes you snorkeling on a brightly colored reef and then swimming back into caves. And if you choose you can jump off the cliffs. It leaves at 10:30 and returns at 1:30. There’s rum punch, ice cold beer and soft drinks included. The crew takes care of you in every way. Captain Wally has many years of experience and is the best! Entertainment is provided by Rasta Ralphie who is the REAL THING. They also do a sunset cruise to Rick’s Café. It leaves at 3:30 and returns at 6:30. There is nothing more exhilarating than when the sails go up with the beautiful Jamaican sunset in the background. The cost is $50 per person and well worth every cent.", "title": "Hedo fun in the sun", "helpfulness": 3, "user": "Tam66", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 18018799, "likes": {"liked": "— atmosphere and the nude beach", "disliked": "— problems with water and power"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our first trip to Hedo 2 after going to Hedo 3 more than12 times. The staff is warm and welcoming.. the rooms are not. Bathrooms are tiny - two people cannot fit in there at the same time. The water is notoriously unpredictable..either hot enough to scald you or cold enough to freeze you. The property is all uphill/downhill, so be prepared to walk! The food is mediocre and the same all the time, but the salads are refreshing and crisp. The grill down at the nude pool is the best - jerk chicken, burgers, fried, etc. Nude pool is where we spent most of our time. We just wish they would turn down the speakers a little - we found it difficult to talk to each other, even in the dining room. We probably will return. mostly because of our friends. Nightlife is limited to piano bar and later, disco.", "title": "Sun, sand, water, fun", "helpfulness": 1, "user": "CPLnCT", "date": "May 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 110739067}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Just got back tonight and while I had a great time--the facilities are truly awful. I should have taken pictures to post but it was so awful that I didn't want to be reminded. We were on the nude side (2139) & the room was pretty shabby, as expected. Bathroom=GROSS. Mildew in shower, tile grout needs to be redone, no HOT water--lukewarm at best & the water pressure in the link was a little more than a drip.", "title": "This hotel is in desperate need of renovations", "helpfulness": 9, "user": "hpnotiq_dime", "date": "May 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 110656600}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Bedroom furnishings=OLD and outdated. Floral bed spread, 80's style, lamps, mirrored ceilings etc..", "title": "Great week overall", "helpfulness": 2, "user": "SvPistol", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110551433}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "Around the property --more of the same--The ceiling fans at the small pool near the grill--pathetic. Warped, old & blades are so damaged that they are bent up and gross looking. The pools (tiles, painting etc.) could use some attention as well. Pergolas all need paint and a good pressure wash. Overall the resort could use a good pressure wash, paint, etc.. Take some Lysol is you decide to visit--and pick up some bleach while there to properly sanitize the room.", "title": "WOW!!!", "helpfulness": 3, "user": "nfc4me", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110129138}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Entertainment was OK....", "title": "Another Great Trip to Hedonism", "helpfulness": 11, "user": "NYPatandSharon", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109728908}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We made our fifth trip to Hedonism II in April, 2011 (fourth in the last two years) and it was our best trip ever (and all were GREAT!). We don't go for the rooms, although they are adequate for the approximately one and a half waking hours we spend in them each day. We don't go for the food, although I gained 7 pounds in 9 days. We go for the fun, for the absolute best 24/7/365 party on the planet, some of the best staff members you will find anywhere (where else does the staff remember you by name from your last visit and greet you with a big smile and a hug?), even at luxury, 5 star hotels, and for the most amazing group of guests you will ever spend a vacation with. This is not a \"sit by yourself reading a book \"vacation. It is a social event. If you're not sociable and friendly, don't go, but if you are, you will likely make some of the best friends you have in the world. How many other vacations have you gone on where you met many of the same people who were there last year and people with whom you continue to communicate all year? At how many other resorts do guests exchange email addresses and phone numbers when they leave? It truly is all about the people, the party and the fun. These things allow you to overlook whatever blemishes the resort may have. Some specifics: Food at the buffet varied but was generally quite good. The lamb chops, shrimp linguine and pork at Martino's were excellent . Munasan's (Japanese) was also excellent (as always in our opinion) . Top shelf liquor was plentiful and always available at all bars. There was much renovation and work going on while we were there which bodes well for future visits. The Entertainment staff was outstanding as always (in fact, better than ever) and the evening shows were amazing - best we have ever seen at Hedo. Sticky Niki, Winston, Fifty, Michael, Melody and all the EC's, we LOVE you. Scumba, Serena, Pauline, you guys ROCK. Nigel your jerk chicken is to die for! Between the guests you've become friends with and the staff you know from prior trips, it is more like a family reunion than a vacation. Our next trip is already booked (with Denny at DennyP.com - big ups to Denny) for August, 2011 and we can't wait! We're also booked for next April as well. You owe it to yourself to go to Hedo at least once, but be warned - if you go once you WILL return.", "title": "No Place Like It On Earth", "helpfulness": 5, "user": "chaswyck", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 109407253}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This was our first visit to Hedo. We read many reviews but didnt know what to expect. The overall review is a mixed one.", "title": "mixed feelings", "helpfulness": 13, "user": "ronandsam", "date": "May 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 108669491}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Accommodation- at best this is a 2 star resort. The rooms are very dated, the beds are not very comfortable and anybody with a minimum standard would find it to be very poor.", "title": "Best Massage I Have Ever Had!", "helpfulness": 4, "user": "Girsham", "date": "May 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 108583135}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Food- same as above. We tried the different restaurants but the food was blah. Limited menu, the ingredients are of a low quality and I wouldnt characterize it to be even decent. Maybe 3.5-4 out of 10.....yes...that bad...", "title": "Absolute FUN............", "helpfulness": 3, "user": "Red1249", "date": "May 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 108480829}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "People- our biggest concern was with the people. Overall (at least at the time of our visit) the average age was 50+, body type was over weight, and (at least from appearance and hearing people talk) of lower income demographics.", "title": "Another great vacation at Hedonism 2", "helpfulness": 3, "user": "Gomur", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108225480}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 116, "average": 158, "very good": 460, "terrible": 70, "excellent": 722}, "aka": "Hedonism Ii Hotel Negril", "slim_ranking": 0.354838709677, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Hedonism II, a legendary resort! Here you have a real life garden of Eden where the only thing you have to worry about is your drink of the day. Cascading plunge pools, waterslide, beachfront pools with in-water pool tables, swim-up bars, jungle bridge taking you from the main hotel straight to the beachfront, glass bottom boats, snorkeling, scuba-diving, kayaking, every non-motorized water sport you could imagine, pool watching from the disco, all glass walls, gaming lounge, rock climbing wall, air-conditioned fitness center, Sauna and Steam room. You won't confuse it with Kansas. A lush garden of pure pleasure. For singles & couples 18 yrs & over who are ready for a party. If your wondering....just come!"}