{"user_rating": 3.0, "review_count": 105, "name": "Hershey Motel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2009", "text": "My son worked on the boardwalk for the summer and I was the moving crew. After realizing that Seaside Heights was a family vacation spot and didn't have a lot of choice of quality motels, I settled on spending one night in Seaside and reserved the Hershey for a reasonable $54 (off season rate.) The room smelled like a bar on a Sunday morning. Stale, old and run down. It may have been clean, but I was scared to look too carefully. The bed felt a little sandy; the pillow was lumpy like the cheap one you've owned for 30 years. I skipped the breakfast included.", "title": "Not So Great", "user": "Jabeka", "date": "August 2, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 36535594}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "2 glasses of wine later, I could fall asleep and not think about where I was. I changed plans of traveling half way back to Michigan the next day and, instead, drove 8 hours to the closest 4 star hotel on my route home (Omni William Penn in Pittsburgh) just so I could really enjoy and appreciate a good hotel (which, via Name Your Own Price at Priceline, cost me only $30 more than The Hershey.)", "title": "very old, ok, but don't expect much.", "user": "lovehotels_9", "date": "July 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 36367497}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Somehow, I don't really fault the hotel, especially in the present economy. I think Seaside Heights is what it is and has been for so many years, and with so many loyal returning families, that it's acceptable and, in it's own retro-dingy way, charming.", "title": "For Seaside, this is a good place", "user": "chelias", "date": "July 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36089601}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "heard from friends, hotel was good. Arrived to a very spacious clean room, but very old. Duct tape, that's right, duct tape held on one of the wheels on the bed, and held together a blind on the window of the door. No shampoo, hair dryer, or tissues in the room, so bring your own. Thank God I packed all of that stuff. No stores really close, so if you are going to shop, you are going to drive. Pool was nice, kids loved it. Breakfast at the restaurant was excellent. $40.00 for the 4 of us, which is average. A couple of nice restaurants within walking distance. Hemingways very good, but pricey. Hotel has 10% off coupons good Sun-Thur only. Kids enjoyed game room also. Boardwalk and Beach 2 1/2 blocks away. Beach is very clean. $5.00 per person for the day. 11 and under are free. After 4p, it was free. That was on a Thursday. Not sure about the weekend though. All in all, we had a good time, but if you like a little higher class of hotel, and don't care about the distance from the beach, I would stay in Tom's River.", "title": "I'd go back anytime", "user": "Pappy60", "date": "July 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33818271}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I go down to Seaside every year and check out some of the hotels to see what they look like because you can never trust the website (take Aztec for example-NEVER STAY THERE) and being within the state I have the opportunitiy to do this. I had checked out a few hotels and priced them out to see which would fit our budget and what rooms would fit our needs. Hershey was the last one we looked at and were allowed to look around and check out all the different types of rooms. After doing so, we decided on the 2 bedroom suite for the dates we needed. The lady there cut us a break for one of the days because of the Holiday weekend(4th of July) and the days we were staying had fallen on a Sunday, which should have been more. I had called prior to our stay to make sure everything was set. Indeed they were and we were on our way. BUT, when we got there, our room wasn't ready!!!???!!! Are you kidding me, you just confirmed 3 days ago we were good to go. Yes, I was a little perturbed so thank goodness my boyfriend had gone in when this happened. They gave us the one room suite for that night and cut the price in half for that night. So after unloading only part of the car, since we would be moving to another room the next day, we went to the beach. When we came back we stopped in the office to pick up some flyers and to find out about the restaurant which is conveniently connected to the hotel. At that point they told us that the room we originally were suppose to have was available and we could move into it that night. GREAT! Thank goodness I didn't unpack everything. Again, a little annoyed but keeping cool. By the way the room they gave us in place of the room we were suppose to have was very nice, clean, and big. When we got to the original room, I was still impressed. Clean, big, and the kids were so excited-THEIR OWN ROOM. the only thing is the sheets are very thin and the comforter was old. I would suggest bringing your own blanket and pillows. It was noisy at times but I was able to sleep so it couldn't have been too bad. It was also 4th of July weekend so it was busier than usual. The pool was cleaned and kept up with every morning and every night. I saw the guy cleaning it every morning and the other guy cleaning up the pool area every night. The staff, overall was very nice, helpful, accommodating and the hotel was convenient. Very close to the beach and boardwalk, CVS, the waterpark and local bars and restaurants. I will be staying there again.", "title": "Clean Beach style Motel", "user": "chocolatebuckspa", "date": "June 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 33480712}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I just got home from a three day stay with my husband and was very sceptical about staying in a motel in seaside because pictures cn be decieving. I brought my own sheets, and toiletries just to be safe and upon arrival I realized I really didnt need them. I gave the room a once-over and used a clorox wipe and the room was spotless. The sheets were also fine, no weird stains or holes although I felt more confortable sleeping on my own sheets. The maid came in and cleaned the room and left new towels everday. The restaurant downstairs was also very conveint and I was very sceptical about that too but after the first meal there we realized it was perfect for what we wanted and we continued to go there throughout our stay. The pool was nice and clean but considering the bad weather we had we werent able to go in it. The service was perfect and everyone at the Hershey Motel was very friendly. If you are looking for a nice place to stay I definitly recommend this motel. My husband and I were very pleased and plan to make another trip down next summer and stay at the Hershey.", "title": "would definitly do it again", "user": "kristynmarie", "date": "August 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76988381}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I stayed at the Hershey Motel the last week of July 2010 with my sister and enjoyed it so much that I booked it for the following week with my husband. Both times the service and friendliness of the entire staff was commendable.", "title": "Highly Recommended!!!!", "user": "Darl208", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76557625}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I plan on going back there next year with more family and friends for an extended stay.", "title": "Classic Seaside at its Best", "user": "faye33193", "date": "August 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 76082116}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Been to Seaside Heights dozens of times but hadn't stayed at the Hershey since the late 60s. Wanted to have a nostalgia experience and was not let down. We stayed in one of their two bedroom suites for a week with three young children.", "title": "Great Place", "user": "lauranjrz1", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75448050}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The downsides were there, but tolerable. The Hershey is not a brand new place, but Seaside is filled with classic old motels still. The complex was very well maintained and didn't show it's age like many other neighboring places do. There were no pictures in the room. Something I think should be addressed as the room didn't make a great first impression with nothing but bare walls. There also was no phone. Who needs one now with cells, but still. They offered room service so I guess the would have to call the place on you own phone to get it. Another annoying thing was even though the bedsheets were marked \"Q\" in a corner with a Sharpie, they must have been twins. They popped off as soon as you got in bed and were obviously not sized for the Queen beds in the unit.", "title": "Never Ever - what else is there to say!", "user": "nuttin_new59", "date": "August 9, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 74470202}, {"rating": 3.0, "title": "Pros and Cons to our stay", "text": "Definitely \"old style\" motel beach hotel found up and down Jersey shore. Came to town on last minute and was able to get 3 rooms for the night. About a block and half from boardwalk/beach (and MTV Jersey Shore house if that interests you). Free parking and many places including CVS within walking distance. Don't expect any standard toiletries other than soap provided (no kleenex, no shampoo, no provided hair dryer)", "user": "ttoo", "date": "June 28, 2011", "id": 114831927}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Pros: Rate was half what we were quoted at Sunburst hotel down the street. No smoking rooms. Relatively clean. Large pool area with smaller kiddie pool. Suite rooms had smaller flat screen tv. All rooms had mini fridge and microwave. Bathrooms were free of mold and looked newly tiled. Couple at check in were polite and helpful. Large sun deck with plenty of seating.", "title": "Not going back", "user": "lovetotravel4444", "date": "June 25, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 3.0}, "id": 114745165}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Cons: Sparse decorating...nothing on wall, no phone, etc. Locks on doors had alot of \"give\"....I'm sure the average woman could kick them in easily. Couples on either side of me were screaming at each other in early morning hours and alot of \"after bar\" traffic that woke us up and actually made me feel unsafe at one point. Bar and restaurant were closed.and game room looked like a storage closet - seemed like mid-June was before the start of their season.", "title": "Very nice motel for Seaside's standards", "user": "jess1754", "date": "November 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88665946}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My husband, 4 year old daughter and I stayed at the Hershey Motel for one night the week before Father's day weekend. The room appeared to be clean. However, I didn't notice until the next morning that the bottom of our feet were filthy, I'm talking completely black, from walking around the room. Although the room appeared to be clean it had a horrible mildew odor. The family next door from us told us their room smelled bad also and offered me some Fabreze spray they had bought for their room. (It didn’t help). The beds were average as far as being comfortable, however, the sheets did not fit the bed and when you lay down the edges popped up. After awhile you were laying on the bare mattress. One good thing I can say is the location was great and the pool was very nice, and the price was right.", "title": "Will be back again", "user": "lindabbones", "date": "September 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78217070}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I would never go there again and would only recommended it to someone who was not going to spend much time in their room, really wanted to go to Seaside and didn’t have much money for a better place to stay.", "title": "Lovely few days", "user": "peggygris", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77644527}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I was a little unsure about staying in a motel but after checking in and checking out the grounds I was impressed. All the other motels were run down looking and had some shady looking people staying there. The room was out dated but nice and clean. The staff was so friendly and very helpful! The best part was hanging out with the jersey shore cast @ all the local clubs! Highly recommend this motel!", "title": "The best place on the shore to stay!", "user": "luvchele", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 73935002}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "When we arrived here we were in a room with graffiti on the walls and the air conditioner didn't work and the room was dirty .My friend went downstairs and complained to the owner. The owner was rude but he did give us another room . This room was better than the other one but still dirty and one of the pillows was so lumpy and old.The next day we went to the beach and returned to our room by 3:00 our room was never cleaned. We went to the owner and he said that the maids would be right up to clean our room, well they never showed up.We had to go to the lobby get new towels and a new pillow and toilet paper !!! ASK TO SEE YOUR ROOM FIRST BEFORE YOU GIVE THEM YOUR CREDIT CARD!!!!!!!!!!!!!!!!!!!!!!!", "title": "my fellow bikers don't stay here the 3rd weekend of Sept.", "user": "cinny781", "date": "July 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 73059896}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "This hotel was awesome and the people was very nice and ever nice and I hope to go back to the hotel for another summer vication.", "title": "summer vication first time in new jersey", "user": "jerseygurl09", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55060865}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I would not recommend this motel. We stayed there for a long weekend and the room had not be updated or really cleaned in who knows how long! Our lock was loose and one night our neighbor was drunk and opened our door with his key! The front desk could care less and we chalked it up as a live and learn!", "title": "awful", "user": "Embers333", "date": "August 11, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 37372579}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This year, we stayed at the Belmont Motel and that was MUCH better!!!! I would recommend anyone looking for a place to stay at Seaside Heights to go to the Belmont Motel.", "title": "They really saved our vacation", "user": "Mtngrlrrt", "date": "August 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37098588}], "location": {"country": "United States"}, "variance": {"poor": 15, "average": 15, "very good": 23, "terrible": 28, "excellent": 24}, "aka": "Hershey Hotel", "slim_ranking": 0.341463414634}