{"user_rating": 4.0, "review_count": 582, "name": "Hesperia Ramblas", "reviews": [{"rating": 5.0, "title": "Right off Las Ramblas and Very Convenient", "text": "We walked right past the very un-assuming entrance the first time. It's kind of tucked away depending on the direction you're coming from. Within a block of Las Ramblas, the location is perfect, especially at this price. FYI for travelers, there is a Metro stop on Las Ramblas very nearby, it's the Liceu stop in case you're interested.", "user": "TheDarsts", "date": "September 11, 2010", "id": 79143152}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The room was very clean, almost sterile it seemed. Very white and crisp. Room size was very comfortable for the 2 of us.", "title": "Hidden Gem, just off La Rambla", "user": "veggietravels", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78968440}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The free wifi was very convenient and we enjoyed our stay very much!", "title": "Great mid-range hotel", "user": "yrjs2", "date": "September 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78930048}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I chanced upon this hotel after much research and finally booked direct with them in April. It is one block from La Rambla and a hidden gem. Very quiet rooms, well equipped and comfortable. The room is small if you are comparing it to American standards, but you get used to it.", "title": "Great hotel, perfect location, very helpful staff. A real gem!.", "user": "MerciBeaucoup", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77875265}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Hesperia is close to everything - Rambla, the port/beaches, Gothic Quarter, Placa Catalunya (buses) and the Metro. They also offer free Wi-fi, which was very helpful to plan the day. We opted for the breakfast for 10 Euros, although it is a little pricey, we often skipped lunch, because breakfast was scrumptious!", "title": "Handy to everything", "user": "Ragdad", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77166394}, {"rating": 5.0, "title": "Excellent stay.", "text": "As a lover of the Spanish culture and all things spanish, I had always dreamt of visiting Barcelona and this was a great experience for me. The hotel was in a perfect location within the city, with everything very close by and great transport links. The rooms were not big, but in a city centre hotel you do not expect that, and they were very nicely done up and very clean. The reception were really helpful in giving directions and tips on where to eat and I really enjoyed my whole stay and have no complaints. The local tapas were out of this world and Barcelona was every bit as fantastic as I had hoped it would be.", "user": "compassnorth", "date": "July 14, 2010", "id": 70858388}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I think it's important to note that my boyfriend and I are savvy travelers who like to utilize public transport, walk amongst the people, and immerse ourselves in local life. That being said, Hesperia Ramblas was a hotel that fit our personality very well. It was located off the beaten path yet close to Las Ramblas street to get easy access to the metro and enjoy the famous boqueria mercat just around the corner. In short, location was muy excellente!", "title": "Great location for people on the go.", "helpfulness": 1, "user": "rligsay", "date": "July 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 70318298}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "First of all, I want to commend the excellent staff at this hotel. Their English and grammar was so eloquent that I had to do a doubletake. I wasn't sure if they were Spanish or English. They were also very warm and eager to help or offer ideas for sights to see.", "title": "very very good", "user": "byrnemx", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70074936}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The room itself was very simple yet functional. We had an excellent view of an alley (insert laugh here) but it wasn't unsafe and it was cool to see the families hang their laundry out on the line to dry.", "title": "Good location, friendly & helpful staff. would definitely stay again", "helpfulness": 1, "user": "chunkyl42", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69923636}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Air conditioning was a blessing as it was probably the hottest days Barcelona had seen all year.", "title": "Safe, Secure, Quiet, Friendly, Central and Practical", "helpfulness": 2, "user": "Sooty016", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69832986}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I booked this for us and our friends after reading a few reviews. Not only was the hotel exceptionally good value for money (best rate was actually booking direct with the hotel and obtaining an extra 15% discount through them), but this is one of the best city centre hotels I've stayed in for a long while. Admittedly the rooms aren't huge, but they are perfectly acceptable. Some have wet rooms and some bathrooms. The complimentary set in the bathroom was very good and included things like travel tissues, anti-perspirant, nail file, etc etc. Free safes and fridge in the room were very welcome. The hotel is quiet, totally secure, very well air conditioned, staff very helpful (a city map is given to you on arrival) and does a good breakfast for around £8 all in. Will definitely come again.", "title": "An absolute gem. Recommended to any City Breakers", "user": "Best_Gillybear", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76954810}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "One block off the Ramblas, this hotel was comfortable, clean, reasonable and had a safe. Staff kept our luggage in storage on last day as our flight did not leave until 9 pm. Had one spooky incident when I returned at around midnight, while my husband waited on the Ramblas. Heard series of soft knocks at my door, and no one answered when I asked who it was. Hotel staff had to come get me out of the room. I guess a woman walking alone at that late hour attracts unwanted attention. Good hotel if you like the hustle and bustle of the Ramblas.", "title": "Rambling on the Ramblas", "helpfulness": 2, "user": "dolomary", "date": "August 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75630903}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I stayed fro 31th of july to 4th of august at Hesperia Ramblas,Barcelona.The hotel location is heart of La ramblas.It is very close to Placa de Catalunya,picasso museum, sea,shopping centers I mean everywhere.We stayed at room,404.the room is amazing,very clean,staffs are very helpfull,clean,more secure from lots of places.I definetly suggest this hotel to stay.The important point we have booked this hotel on february.The cost is very cheap.", "title": "amazing location,perfect and very helpful staffs,clean,safety,more secure", "helpfulness": 1, "user": "genetix", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74755906}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Coming from a fair hotel in Madrid to Barcelona we were very surprised by this great little hotel. It has a great location right off the main street Las Ramblas, but still quiet in the room. Yes the room was definitely small, but it was modern, the bathroom was a good size and the bed was very comfortable. The front desk staff were friendly. The free WiFi was awesome! We didn't get the breakfast option so can't comment on the food. But I would definitely recommend this hotel and it has a great price as well!", "title": "Great Location, Modern, Great Staff and Comfortable", "user": "aoc613", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74184109}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Very clean and stylish hotel in a sidearm of the vivid Las Ramblas, Barcelona's esplanade.", "title": "Great place to stay nearby to all locations", "user": "oobodoo", "date": "July 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73145955}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Had read the glowing reviews on this hotel and was not disappointed when we arrived. Just off la Ramblas down Hospital St, the exterior is glass and cream stone with a really modern look. Good security, you have to press buzzer to let you in (security man in background at night). When you walk in, it's so quiet and peaceful, long reception desk and easy check in, staff were polite. Good lifts that arrived quickly at all times of day and night. Rooms are ultra modern again and so clean, the whole hotel is almost sterile, I've never stayed in anywhere so pristine. The rooms are ultra modern again, with a massive bed and crisp white linen. The decor and curtains are lovely and modern, the floor is a grey resin sort of floor that matches the modern decor, so don't be expecting a plush carpet! There is a double sliding wardrobe and shelving that contains an easy to use free safe and also a good sized fridge that contains the mini bar at very reasonable prices, but if you're stingy like us, you can put your own stuff in there. There are two white bedside tables and a matching larger one opposite with a big mirror above. There is a flat screen TV on the wall. The bathroom is excellent with quality white modern fittings set in a cream stone, a good sized mirror and excellent lighting. There are some nice touches like an extendable mirror, hairdryer and lots of toiletries and bits and pieces like nail file and shoe shine, in fact I've had lesser things in some four star hotels I've stayed in. Lots of white towels. There isn't a bath but the shower makes up for it, it's so big you could could fit three people in it and easily the best shower I've ever come across. Fab air con as well. The whole place has a tranquil vibe about it and considering it's location, we didn't hear anything and slept like babies all the time we were there. Will be the only place we'll stay now as it's such good value for money and would definitely recommend.", "title": "Ultra modern and supremely clean hotel in fantastic location!!!", "helpfulness": 4, "user": "koggyboy", "date": "July 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72902739}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "If you haven't been to Barcelona before, getting around the place is so easy. Don't get a taxi from the aiport as they can be very costly. Come out of the aiport , go left and walk to the Aerobus stop. It's 5 euros to Plaza Catalunya, the big square at the top of La Ramblas. It announces the stops in different languages so you know exactly where you are. About 30 mins on the bus, get off and walk straight down La Ramblas and Hospital St is on the right, a good walk down. Coming back, go to the square again and get a Terminal 1 or 2 bus and they run approx every ten mins. The open top bus is a great way of seeing the city, it has red, green and blue routes and you just hop on and off as you please. You can spend all day on this if you wanted and it costs 22 euros or 29 for a two day ticket. It's so worth it as there is so much to see and it's a brilliant way of seeing it all. The whole system is so well organised and you hardly wait anytime for the next bus to come along. Shopping is fantastic and so are the many restaurants and bars, all serving quality food. The market off La Ramblas is so colourful and vibrant and you can buy ready prepared fruit and freshly squeezed juices which are great after nights out. At the other end of La Ramblas is the harbour area with a shopping plaza and great seafood and Tapas places overlooking the harbour.", "title": "It got an A- from me", "helpfulness": 3, "user": "Steve88", "date": "July 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72632446}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "A colourful and vibrant, bustling city with great architecture, will be rushing back soon!", "title": "Lovely hotel in central location", "user": "jonnytekno", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72589514}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I like the door bell system, you need to ring the bell in order to get in the hotel! The door separates the real world and yourself. La Lambla is full of life, culture, food, and pick pockets. But when you step in this hotel, you would feel safe, cool, comfortable, and so quiet. The room is nice and new, water pressure is good, but don’t expect a “view” since you will probably look at people from the buildings across the small street.", "title": "Nice quiet hotel near everything.", "user": "mooresf", "date": "July 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71417432}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Put all your valuables and passport in the safety box please, because there will be a very high chance to say goodbye to them if you bring them in your pocket on the street, in the metro station, on the bus, or crowded places. A Brazilian guy asked me to go to a club enjoying samba outside the hotel. He tried to teach me samba, while put his left hand in my right side pocket. I thanked him but told him that was my pocket, not his, and he had a great smile to me.", "title": "Clean Hotel in Central Location...", "user": "McGAussie", "date": "July 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 70878044}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 8, "average": 58, "very good": 290, "terrible": 2, "excellent": 224}, "aka": "Hesperia Ramblas Hotel", "slim_ranking": 0.177480916031, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}