{"user_rating": 5.0, "review_count": 45, "name": "het Hemelrijck Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "What a great idea we had to go to hemelrijck b&b!!! We spent 3 nights there and really felt like home. The room was so well decorated, the breakfast was fresh and delicious, and last but not least the owner is truly kind and helpful.", "title": "Feeling like at home", "helpfulness": 2, "user": "chtc", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115910941}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "So many little details make your stay unique and unforgettable.", "title": "Superstar Johan!", "helpfulness": 4, "user": "Lovers101", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110378427}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Also, the area is nice and easy to reach.", "title": "This is without doubt one of the nicest B&B’s we’ve ever stayed in.", "helpfulness": 2, "user": "Elizabeth_and_Chris", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107822645}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This B&B is a hidden gem - with beautiful interiors, character and an equally fabulous host - Johan - who cannot do enough for his guests. The hotel is tucked away in a quiet residential part of the city - but just 15mins walk from the train station in the centre. The room was up some very narrow winding steps - and when we got to the top, not only was there a pretty lobby complete with teas, coffees and scrummy chocolates (pretty teacups and saucers) - and any additional toiletries and towels in a French-style cabinet - but an equally, creatively-designed double bedroom. The room was spacious, with a sofa and TV too. The bathroom large and again - pristine with all its decor carried out to the finest detail. Breakfast each morning was a real treat - complete with breads, muffins, pastries, eggs (how you like them), yoghurts, cheese, ham, cold rice puddings, fruit and freshly squeezed orange juice, incredibly good coffee, jams - and chocolate/coloured sprinkles (a Dutch trend for bread) . . the list goes on - as the mouth-watering breakfasts all varied each morning with at least four to five different things on the menu - AND by candlelight! Johan is a superstar!", "title": "Best B & B we stayed in our 3 weeks trip to Europe", "user": "EGLERIO", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107792456}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We booked four nights at Het Hemelrijck and enjoyed every minute of our stay. We were greeted with the warmest of welcomes and shown to one of the two simply and elegantly decorated rooms (the stairs are quite steep, but it all adds to the charm). Johan is a wonderful host, who not only provided us with a splendid breakfast every morning, but offered friendly advice on the city and where to eat in Rotterdam (we can recommend Doen – Dorst & Trek on Berkelselaan 2a and Dunya on Proveniersstraat 40a). It provides a great base to explore the city being only 20mins walk to the central train station or even less on a bike! (There are two which guests can borrow).", "title": "if your in rotterdam het hemelrijck B&B is the place to stay", "helpfulness": 3, "user": "louwhizz", "date": "April 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105746710}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "A wonderful bed and breakfast in a quiet part of Rotterdam. A bit far from the city center but quite accessible by tram. The nearest tram stop is less than 5 minutes away from Het Hemelrijk. I highly recommend you purchase a Rotterdam Welcome Card to make it easier to get around. The bed & breakfast in itself is special. The colors and ambience of the place are wonderfully sweet & cozy. Our stay was made even more special by Johan's personal touch. A great guy, he made us feel as if we were visiting an old friend despite the fact that we had never met him until the day we arrived at his doorstep. The stairs are a bit steep but Johan was kind enough to help us with our luggage. The breakfast was delicious! He asked us what we wanted to eat, we said,just surprise us. And he did! Each day was different and delicious so we looked forward to coming down to breakfast each day. The rooms were rustic, cozy,and clean. Good wifi internet access. And do try the restaurant across the street named Branco which Johan recommended. Johan says Hemelrijk means heavenly place and it truly is.", "title": "Made our Rotterdam stay a wonderful experience!", "helpfulness": 1, "user": "dissolvedgirl", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 144794706}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Johan who run's the B&B takes such pride in to this B&B and it is so obvious with the attention to detail. Breakfast is typical Dutch and is delicious.", "title": "A fab B&B", "helpfulness": 1, "user": "Louisa_Owen", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131154265}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Johan makes you feel very welcome and very accommodating.", "title": "Tucked away gem", "helpfulness": 4, "user": "kubilay", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129553978}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "The B&B itself is approximately half an hour's walk from the town centre.", "title": "A wonderful b&b in Rotterdam", "helpfulness": 4, "user": "RM_463", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122729857}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Thanks for a great stay Johan!", "title": "Just like you stay at friend's home!!", "helpfulness": 1, "user": "AdeleChen", "date": "September 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118463115}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This was our first visit to Rotterdam so we weren't quite sure what to expect. We booked a couple of nights at het Hemelrijck on the strength of the previous reviews and were not disappointed. The B&B was immaculate, the room was extremely comfortable, and the breakfasts were freshly prepared and delicious. Everything was taken care of by our host Johan who was so friendly and made us feel really welcome. A lot of thought has obviously gone into the interior decor which is beautifully done and complements the house perfectly. The B&B is a traditional Dutch house so the stairs are typically steep, but that just adds to the charm and character of the place. The house is located on a quiet road, a short tram journey from the city centre and a short stroll from the local shops and cafes. There are two rooms, both on the top floor, one at the front of the house and one at the back. We had the room at the back and it was a real bonus to be woken in the morning by bird song instead of the traffic noise you might expect in a big city. This is a great B&B and it offers very good value for money. It will certainly be our first port of call the next time we visit Rotterdam.", "title": "A great B&B with a charming host...", "user": "MinorTraveller", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103792856}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Absolutely loved it. We arrived late in the evening from 20C Athens to -5C snowy Rotterdam and immediately felt like home or even better. Johan is one of the nicest and most accommodating hosts out there and the B&B itself is one of those rare finds of an excellent stay at a great price. Rooms are done with exceptional taste and arranged with such care, you will feel like living in one of those places they show on design magazines and also be as comfortable and 'warm' as in your own place. If you like attention to the detail you will particularly appreciate it. Impeccably clean and quiet too, plenty of space and light in both rooms, you will want to spend time in your room just to relax and enjoy it even more. Large private bathrooms a huge plus. Breakfast is served in a beautiful kitchen that opens up on a balcony with garden views, we almost missed our whole morning there just because it was so relaxing, delicious stuff too. Location is great, very close to the tram stop, only a few stops away from Central Station and the city center. Neighborhood is also nice and quiet and there are two bikes available for guests. All in all, if you are a fan of discovering great little places and happen to visit NL, do plan Rotterdam just to stay here.", "title": "If you are a fan of discovering nice little places, do plan Rotterdam just to stay here", "user": "NadiaGR", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89393589}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Excellent welcome. Just open for 3 weeks. All new bathroom etcetera. Bed was awesome. Morning breakfast served in a lovely kitchen. Plenty of stuff. All fresh and biologic. TIP!", "title": "Felt like a King!", "user": "laurens1980188575", "date": "July 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 69342851}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Rotterdam"}, "variance": {"poor": 0, "average": 0, "very good": 4, "terrible": 0, "excellent": 41}, "slim_ranking": 0.0454545454545, "description": "Het Hemelrijck B&B is situated in a characteristic dutch house near the centre of Rotterdam. The B&B has a friendly, romantic and welcoming atmosphere. There are two cosy guestrooms. Each room has a double bed,a bathroom with shower and toilet and a sitting area with TV and internet connection. A lovely breakfast - which includes fresh fruit juice, bread, yogurt, jams, cheese, eggs and coffee or tea - is served in the kitchen. The neighbourhood is an upcoming area and has a lot of nice restaurants and small shops. This is one of the oldest areas of Rotterdam build in the late 19th century.During your stay you can rent two typical dutch bikes to explore the city. It's also easy to travel around with tram, the stop is just around the corner."}