{"user_rating": 5.0, "review_count": 208, "name": "Hezen Cave Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "My entire family was in Turkey this past August for a wedding in Istanbul. My parents, brother and I decided to take a few days to explore Cappadocia and Konya before the wedding chaos began. I have to say, Hezen Hotel, with its warm & generous staff, was one of our highlights of our trip. Nil/ Mehmet, and the rest of the staff, made everything possible with poise, professionalism, and kindness. I never write reviews, but this hotel really deserves one.", "title": "Above & Beyond", "user": "SamSQ2000", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 175271578}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "I've listed some reasons below why Hezen excels among other hotels (not only in the area, but around the world - and I travel a lot):", "title": "Do yourself a favour", "user": "Pax B", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174578966}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "1) Fantastic breakfast offerings included in the room price. Offering freshly squeezed juices and eggs made to order. Along with many local favorites.", "title": "LOVED this hotel!", "user": "Courtney Z", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174210690}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "2) Honor Bar. Take what you want and pay for it at check out. What hotel does this today? Amazing.", "title": "Great rooms, great location, great service, hard to ask for more!", "user": "jgordon24d", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 174141688}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "3) Free use of laundry facilities. Wash and dry whenever you want - even if it's at 3am. Every guest gets a key to the laundry room.", "title": "Make your friends jealous with pics of this hotel. Wow!!", "helpfulness": 1, "user": "trvlovr", "date": "August 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 173903597}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My wife and I visited Cappadocia in August 2013 and stayed at the Hezen Cave Hotel. Having spent some time in Istanbul and Antalya as well during our trip, this was by far our best hotel experience in Turkey. Cozy rooms, great ambiance, and a nice feeling of community with the staff and other guests. Nice views of the town as well. They have a covered terrace with couches, tables, etc where you can lounge, snack, sip tea, read a book, or watch the sunset. The whole place just exudes a sense of peace and relaxation.", "title": "Lots of cave hotels, but this one stands out", "user": "John S", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178561582}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The staff are professional, friendly, and extremely attentive to guest's needs. But at the same time, not too overbearing (something I really appreciate). For instance, the kitchen and common areas are open 24/7, and anytime you go in someone will offer to make you tea, a drink, or offer you a snack. But you can also just make your own drink if you prefer! You have full access to everything, just as though it were your own pantry.", "title": "Great hotel, great service, great location", "user": "AusFergal", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178495880}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "So glad we chose this one!", "title": "Home away from Home", "user": "Mala L", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178461669}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We really enjoyed our stay at Hazen. We spent three days with them and they helped organise everything from finding great places to have dinner in the locality, all the way to assisting us with organising a plan to explore the area.", "title": "Impecible service", "user": "Sonja112", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178425667}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The hotel itself is super stylish and very comfortable.", "title": "Fantastic place to stay in Capadocia region", "user": "Bogwalk67", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177407219}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "This was my second stay at The Hezen Cave Hotel in two years. If there was a ten stars rating I would give it all ten! I have stayed in many five star luxury hotels around the world, my experience at Hezen Cave was comparable to that of a five star hotel. The staff goes out of their way to accommodate your every need. Incredibly stylish rooms with lovely details. I can't wait to return again!", "title": "Amazing Hotel!", "user": "islandhunter88", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177268544}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "at first l want to thank to anascrecca travel. for recommended to us.. really it was very greatt hotel. me and my wife we liked it very much. cos everything was perfect. specially room are fabolus. really l can not explain it you should to come to stay there.l was great to wakeup with sun rise . and to have breakfast in front of view of capadocia. and end thx to all hotels shaff. they are very kindly.", "title": "it was amazinge", "user": "roberto d", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176408784}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This hotel was stylish, with a friendly and hospitable staff. The location is off the beaten track, perfect for those who don't want the hustle and bustle of the larger touristy towns. Hezen Cave is located in a safe and quiet residential area. The view of the small town, as viewed from the hotel's patio, is stunning. An excellent restaurant, perfect for dinner, is a ten to fifteen minute walk away. Breakfast was included in our stay. A buffet contains cereals, fruits, yogurt, pastry and an egg menu offers more varieties of egg dishes than I ever thought possible. In addition, there is a washer and dryer on site which can be used by guests free of charge. Be aware, however, that there can be lots of stairs to maneuver, depending on the location of your cave room. The location is somewhat isolated for the typical tourist sites. This can be easily overcome by renting a car or arranging a tour with a reputable company that picks you up in the morning and brings you back at the end of the day. We did the latter and had a marvelous stay in Capadoccia.", "title": "Happily off the beaten track", "user": "travelilnrose", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176073462}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "An unforgettable and unique experience for a Cappadocia traveller.the hotel is situated in Ortahisar village with a breath taking view on the Ortahisar cave castle.this little boutique hotel has only 6 suites and 8 rooms which are furnished in elegant ottoman style.the brand-new elegant & clean bathrooms make you feel the atmosphere of an ottoman palace ham am .the staff and service friendly and effective,the atmosphere like a fairytale.an excellent and rich breakfast,and afternoon tea or coffee served with homemade cookies,cakes and pastries which are offered by the hotel.the evening or late afternoon sunset drink on the outside lodge with the magnificent view is an unique experience.congratulations to the manager Hakan Bey and Nil Hanim for this unforgettable dream stay and their excellent staff.this hotel with its warm atmosphere,superb view, beautiful decorated rooms and excellent service is the best boutique hotel of the region and definetely deserves to be visited of course if you can find an empty room.", "title": "Best boutique hotel in Cappadocia", "helpfulness": 1, "user": "amirzekeriya", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175475869}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Really I think is the best place I have ever stayed. Set in an idyllic location, yet the premises and staff do not rely on this alone to make Hezen Cave Hotel so fantastic.", "title": "Incredible - deserves more than 5", "user": "r-r-hassan", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175371862}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "So happy that we stayed at the Hezen Cave Hotel in our visit to Cappadocia. We flew to the Kayseri airport and rented a car - and drove to Ortahisar. Following street signs to Hezen, we found the hotel at breakfast time ..... and found a charming hotel overlooking the small town facing the town's \"cave castle\" - with a number of terraces facing the \"castle\" and the town. While we arrived an a very early hour, the hotel invited us to our room and to breakfast. Drinking coffee and eating breakfast with this view - was worth every penny.", "title": "Worth the traveler's choice award", "user": "bbjj0827", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180797964}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We loved this hotel ...... staff were very generous and helpful, room was large and quiet, and breakfast was awesome. I cannot overstate how amazing the service. Because we had to leave an ungodly hour upon leaving, the staff started early - preparing breakfast that we could take with us - and making coffee / tea. Huge thank you to the staff!!", "title": "An exceptional stay in Capadoccia", "user": "Ann V", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180119656}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "One recommendation - you must have dinner at the Tandir Cafe - a 5 minute walk from the hotel. Awesome meal overlooking the \"cave castle\" with terraces and garden - with the friendliest cat of all time.", "title": "Sounds Too Good To be True, but it isTrue!!!", "user": "Ayesha Z", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180105123}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "“Our stay at the Hezen Cave Hotel was an exceptional experience in all regards. It's location in Ortahisar facing the town's stunning fairy chimney castle, which is illuminated at night, could not be more beautiful. The jewel-like decor throughout the hotel that artfully combines historic textiles and ceramics with a designer' eye, was magical. The staff could not have been more welcoming or helpful and the food was quite simply delicious. One day I was too sick to tour the area with my husband and the staff made sure to check in on me and the manager sent lunch to my room, with local remedies. Another huge bonus to our stay was the marvellous guide (Cansu Oser) and driver (Tahir) the hotel reserved for our three day tour of Capadoccia. Cansu was knowledgeable about the area, fluent in Englishand very flexible and sensitive to our likes and needs. He even ended up suggesting that we have dinner with a Turkish family one evening, which was a highlight of the trip.", "title": "A sheer delight", "user": "F00Dandtravel", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179947759}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "My husband, and I visited Hazen Hotel on the second stop of our three city (Side, Cappadocia & Istanbul) tour of Turkey. In our opinion staying at the Hazen Hotel was the best portion of our vacation. As soon as we arrived we instantly felt relaxed and welcome. Everyone at the Hazen (the owner, managers and staff) are so accomodating, and wonderful it feels like you're at a Four Seasons, or Ritz Carlton property. If we needed anything, all we had to do was ask! Tour maps were provided, tours booked, restaurant recommendations assistance with shopping. The Cave rooms are unique, detailed and uber comfortable, you almost don't want to leave the comfort of your room. Eventually you get hungry so you must leave the room to the pattio for breakfast, where you can take in the view of the Cave Castle and listen to call to prayer from the Village Mosque. Breakfast options where plentiful and there were even afternoon cookies for tea.", "title": "Amazing Service!", "user": "TheSabina", "date": "September 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178778154}], "location": {"country": "Turkey", "region": "Cappadocia", "continent": "Europe", "city": "Ortahisar"}, "stars": 4, "variance": {"poor": 0, "average": 0, "very good": 11, "terrible": 0, "excellent": 197}, "aka": "Hezen Cave Hotel Cappadocia, Turkey - Ortahisar", "slim_ranking": 0.111111111111, "description": "Hezen Cave Hotel is an unique design boutique hotel located in Cappadocia, Turkey. This exceptional old house of cave bedrooms was fully renovated and refurbished to the highest standard and comfort.Located in a very central village in Cappadocia, our hotel has a magnificent view, overseeing the Ortahisar castle and old town. Hezen Cave hotel is ideal for guests willing to spent some charming moments in Cappadocia, resting in this quite location.HistoryOriginally Hezen was an old Orthodox Greek house with rooms build in the original rock of Cappadocia. We have kept the original structure of the cave rooms and re-decorated the interior with an unique style and colorful trait of character.Our cave hotel is designed by considering ideal contemporary comfort as well as the feeling of being at home. All rooms are in cave and each have a unique design and charm."}