{"user_rating": 4.0, "review_count": 498, "name": "Hiberia Hotel", "reviews": [{"rating": 5.0, "title": "Highly Recommended Hotel", "text": "A group of people from Cork, Ireland who were a visiting choir to Rome stayed at this hotel recently and everything about this hotel was excellent.", "helpfulness": 3, "user": "CorkRose", "date": "November 15, 2007", "id": 10838984}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The staff were most courteous and helpful. The most important thing is its location which is very central and convenient to all places of interest. I would highly recommend this hotel to anyone who is thinking of visiting Rome.", "title": "Oasis", "helpfulness": 2, "user": "japanesetourist", "date": "September 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8726607, "likes": {"liked": "— Staff and rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Great fun, great room and VERY close to all you would want to see, after our first day which was very bad in the Giada hotel this hotel was an oasis. The family and myself would recommend this to anyone", "title": "Home in Sweet Rome", "helpfulness": 3, "user": "RoulaMaria", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8501543, "likes": {"liked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I think that Hotel Hiberia is absolutely the best choice one could make considering an unforgettable stay in Rome. This charming place is ideally located in the heart of Rome (not kidding--if u look up Via Maggio XXIV on the map, u will find that it is exactly in the heart of the city!). The President''s house is right next door, so the security is guarranteed, and the Trevi fountain is two minutes away. The colosseum and historic rome is a10 min walk away, and so r the Spanish Steps and Piazza Navona. Other than the superb location, the hotel is very clean, neat, and designed to impress. The breakfast is also great, especially with a cup of real cappuccino! The receptionists are very friendly and helpful, and room service is very good, too. My husband and I have been to rome twice, and the second time in the Hotel Hiberia was even better than the first. I would definitely call it our home in Rome!", "title": "Our worst stay in Italy...", "helpfulness": 5, "user": "ZeinaUAE", "date": "July 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 8259419}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Dont be fooled by the reception area, well its not as tiny as another reviewer made it sound & at least its bright and the staff seem very kind and helpful...but it fools you into thinking you have booked into a good hotel. Once check-in is over and you are handed the keys to your room, everything changes. I was shocked when the porter led us through a sliding door into the adjacent building which, according to him is 300 years old. By the looks of it, it didnt look like anything had been done to fix this place for 300 years!!!! It was dark, smelly and quite frankly I knew right away we made a mistake. I know and have been told that in Rome hotels are all quite old (my mom stayed at the Intercontinental a few months ago and she even said that was old and the room very small) but this was shocking as it did not seem well maintained at all. First of all, the elevator is the oldest i have ever seen....you need to close the gates and then the wooden doors for it to start. That was also very smelly. Our room was dark, dusty (i ran my finger across the desk and couldnt believe my eyes!) and it just simply made our stay uncomfortable. The bathroom is old and so noisy, it takes the toilet forever to become quiet again after you flush it.... using it in the middle of the night was very annoying especially because my husband and I kept waking each other up. The breakfast is also THE WORST breakfast we had in all of Italy. We had breakfast there the first morning and after that horrible, tasteless experience we ate breakfast at cafes for the rest of our stay. Even my husband who will literally eat anything thought it was bad!", "title": "Very good Hiberia Hotel, Rome", "helpfulness": 2, "user": "Lisa111Sydney", "date": "July 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8255566, "likes": {"liked": "— Location", "disliked": "— Tiny old bathroom with small shower"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Small hotel, decent rooms, nice bathrooms. We were there in the summer heat and the air condition wasn't super powerful, but adequate. The breakfast spread is pretty good and the front desk was very helpful and courteous. The elevator \"lift\" is old and small...sometimes its quicker to just walk upstairs", "title": "Close to Colosseum", "user": "bdwhite1", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 17916380, "likes": {"liked": "— Location, breakfast", "disliked": "— Weak Air Condition"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We are a family of 4 (kids 13&11). We stayed 3 nights at the Hotel Hiberia in a standard quad room and found it to be a great value. The hotel was very clean, the staff was very friendly and the location is unbeatable! Our room was basic but very clean and the beds were comfortable. The breakfast was average. Our only disappointment was in learning they did not have a rooftop terrace. The terrace is only accessible if you book that particular room. We were able to walk everywhere within a few minutes. The farthest walk to the Vatican was still not a bad walk. We enjoyed our stay and would not hesitate to stay there again.", "title": "Great Location, good hotel", "user": "ufmurphys", "date": "June 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17322525, "likes": {"liked": "— location, staff, cleanliness", "disliked": "— lack of views"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Hotel Hiberia was the first hotel on our 5 week trip through Italy and Europe and we stayed 4 nights. I tried to choose this location based upon the location and it really did not let us down. It was absolutely perfect, and my wife and I were able to walk to just about everything.", "title": "Location, location, location", "helpfulness": 1, "user": "Smoolander", "date": "June 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 17133090, "likes": {"liked": "— Location - so close to everything in Rome", "disliked": "— Small room - but not an issue"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The hotel is a 15 minute walk at most to all famous sights (10 minutes to Trevi Fountain and 5 minutes to Monument to Emanuelle, literally down the street from President’s Palace) and approximately a 30 minute walk to St Peter’s Square and the Vatican or a 10 minute bus ride. The hotel is located in what felt to be a nicer and safer part than around the Terminal Station (although we never felt threatened anywhere).", "title": "very good choice", "helpfulness": 1, "user": "nina99z", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 16868212}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The only negative we would have against the hotel was the room size, which was small, as well as the bathroom and shower, however we were only in the room to sleep and get ready to go out so it was never really an issue.", "title": "DECEITFUL Advertising", "helpfulness": 4, "user": "GeneralDisarray", "date": "May 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 16275732, "likes": {"liked": "— Location", "disliked": "— No Air Conditioning"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Location - This hotel is in an ideal location for exploring the tourist attractions in Rome.", "title": "Good location, Good hotel", "helpfulness": 2, "user": "AJQ5", "date": "April 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14955203, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "Termini railway station is about a 15-20 minute walk away, however bus number 64 passes the hotel. A taxi from the station to the Hiberia cost me 7 euros and was well worth it in order to get a bit more familiar with that part of the city.", "title": "Very nice city hotel", "helpfulness": 2, "user": "tmtomeo", "date": "March 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14121908, "likes": {"liked": "— Lovely room", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "The Trevi Fountain, Pantheon, Colosseum, Spanish steps are all within easy walking distance. The Vatican can be reached by catching a number 40 bus just around the corner from the hotel.", "title": "Great Location", "helpfulness": 1, "user": "markw23", "date": "February 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13826495, "likes": {"liked": "— Location", "disliked": "— Dangerous floor in bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I would not recommend the open top tour bus as I found it pretty boring, and the staff were quite rude and unhelpful.", "title": "Beautiful!", "helpfulness": 1, "user": "jmo488", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12702478}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Room - the double room was a decent size. Not very large, but comfortable. The room was clean and the shower was good.", "title": "Brilliant", "helpfulness": 1, "user": "on-holiday2008", "date": "January 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12507011, "likes": {"liked": "— everything, especially the location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Just returned from a four day pre-Christmas trip to Rome. I booked a Deluxe Quadruple at the Hiberia as we are family of 4 and finding a family room in central Rome isn't that easy. The Hiberia is OK, but that's about all I could say for it. The location is very central but I think you could do a lot better. The hotel occupies a narrow site - seating downstairs in 'lounge' was along a bench- so no proper central lobby. Our room was on the top floor. The lift is one of the old metal cage types - fine if it is working but it was out of order during part of our stay. Luckily I am pretty fit as the steps are very steep - not good for small kids.! The room was small - not uncommon for old central Rome., but a squeeze for a double and two singles. Nothing to warrant the 'deluxe' label - at first I thought they had made a mistake as it didn't really correspond to the description on the website. We had a 'jacuzzi' in the small bathroom which my kids liked but afterwards the bath was filled with small flakes of black film from the water pipes. Breakfast downstairs was pretty poor - no pots of coffee or tea but a self-service vending machine, the bread stale, the 'fresh' orange juice more like bitter squash. My Italian friend who I went with managed to coax a cup of fresh cappucino from the waitress.", "title": "Overrated and disappointing- could do better in Rome", "user": "chrisGOxfordUK", "date": "December 27, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "business": 2.0, "cleanliness": 2.0, "rooms": 2.0, "location": 4.0}, "id": 11983258, "likes": {"liked": "— central location", "disliked": "— cramped, lift broken, staff not helpful"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "I didn't find the staff very friendly - they were OK, but it was clear that this was a tourist operation. When I came to pay the final bill I paid by visa card then noticed that they had ovecharged me by 60 euros. It was only when I queried the bill in detail that they acknowledged they had made a mistake and refunded me 60 euros in cash. It made me a bit suspicious", "title": "Great stay", "helpfulness": 5, "user": "voxra", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11589370, "likes": {"liked": "— Lovely room, helpful and friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I normally like older small hotels but I found this one oddly charmless. I wouldn't stay there again", "title": "Great hotel, price and location", "helpfulness": 3, "user": "BernieandJune", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11292465, "likes": {"liked": "— bright, clean, modern room at a reasonable price", "disliked": "— nothing I can think of"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "A wonderful, reasonably priced, hotel with very helpful staff. Looking at the floor plan in the corridor, I had one of the smaller rooms - but it was big enough, with several large mirrors helping making it feel bigger. Everything worked (not always a given), and it's close to a main road with bus connections every 2mins or so.", "title": "Lovely little hotel in great location", "helpfulness": 4, "user": "Sarahms", "date": "December 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11261434, "likes": {"liked": "— Location, room and staff", "disliked": "— Hairdryer!!"}}, {"rating": 3.0, "title": "Cool review for Hotel Hiberia", "text": "I walked into the Hotel Hiberia after a stay in a hotel across the street, Hotel Giardino, that was far from satisfactory. What a difference. The rooms were bright, modern, comfortable and appeared newly renovated, all for only 10 Euros a night more. The front desk staff was very friendly and showed me a room that was available immediately (7am). Everything about this hotel was positive and its central location makes it a highly recommended hotel, including 2 English TV channels. Be aware it is on a 2 lane street that does have traffic. We asked for an inside/back room, and we heard no traffic noice above the usual din of Rome. There is a major bus stop a few hundred feet from the hotel so all transportation is also avail. if planning a trip to the Vatican Museum.", "user": "egyptiancat", "date": "November 27, 2007", "id": 11096909}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 25, "average": 68, "very good": 236, "terrible": 16, "excellent": 153}, "aka": "Hiberia Hotel Rome", "slim_ranking": 0.262036306235}