{"user_rating": 5.0, "review_count": 454, "name": "Hidden Canopy Treehouses Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We had been travelling on a budget around south and central America for 2 months when we ended up here on our last 2 nights away. It was our big, credit card blow out and as it got closer and we were spending more and more money, we started thinking 'oh no, what if its not worth all this money? maybe we should just stay in another hostel?' We could not have been more wrong. If you are on a budget, stay here anyway. Get a new credit card for this place, its worth it.", "title": "Oh my god... incredible", "helpfulness": 1, "user": "louisewitham", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118202068}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The staff here are fantastic and treat you like family. I am usually not one for judging a hotel by its owner- if I read a review saying 'the owner was really friendly', I tend to think its a bit irrelevant! But in this case, its a different story. Jen welcomes you into her home, gives you everything you could possibly want, is always smiling, introduces you to her puppies (which we SO nearly took home), and organises everything for you.", "title": "Amazing", "user": "Liz C", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118110542}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We spent one day zip wiring through the canopies, and the next day going on a wildlife tour with Koko. Both were SO good. Both evenings, we came back to Hidden Canopy to an afternoon tea, with an unlimited supply of whatever drink you feel like, plus nibbles and desserts... Then we had a bath in our jacuzzi surrounded by rainforest, then Jen ordered take away for us to come to the room, where we ate it with a bottle of wine. Can you actually get more perfect than that?", "title": "Wanted to stay forever!", "user": "CountingStarfish", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117955093}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I don't know if we will ever come back to Monteverde, but if we do we will come straight here. I want to say well done to Jen for making this place what it is- my partner and I work in hotels and know how hard it can be.", "title": "This was the most phenomenal hotel and travel experience we have ever had!", "user": "jlr42", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117904775}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stay in Eden- its a little more expensive but worth 'fork'ing out for it. (Hope you're reading this, Jen!)", "title": "WOW!", "user": "KD659", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117702305}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Had a fabulous experience here... very well taken care of by the hostess... Breakfast and afternoon tea were delicious...", "title": "Just fabulous... highly recommended...", "user": "floridabrits", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117630552}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "There isn't much else to say - HIGHLY recommended and we would stay again...", "title": "Read this if you want good info", "user": "BrianandRamona", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117604311}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Hidden Canopy Treehouse is a true \"5 star\" hotel experience in Costa Rica and the most luxurious hotel in Monteverde - It was just built a few years ago so all of the finishes are impecable with a heavy use of teak wood throughout that you don't see in the pictures. It is run by a very nice woman from California (Jen) that has extremely high standards for the service she provides and hotel she actually designed and built.", "title": "Amazing! A wonderful experience", "user": "salliepants", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117541358}, {"rating": 5.0, "title": "Felt like home", "text": "There are four rooms built on stilts and look directly out to the forested valley adjoining the property with two in the main house and a cental area that includes a multi level eating area that opens up to incredible views over Monetverde and the distant coast.", "user": "Martinos M", "date": "August 29, 2011", "id": 117411145}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Happy hour includes excellent drinks and food every night and breakfast was amazing. Ask for the Neverland suite if you want to get the best, easily sleeps 5 and absolutely incredible views.", "title": "A unique place and very special - highly recommended", "helpfulness": 1, "user": "PixelDad", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117387407}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Staying here on a rainy October night was an almost mystically relaxing experience. My friend and I stayed in the Rising Sun treehouse, which the owner, Jenn, told us was built in honor of her mother. It was beautiful, with a bed big enough to fit five people, an adorable swing suspended from the ceiling, and windows in every direction looking into the surrounding cloud forest.", "title": "Jungle Oppulance", "helpfulness": 1, "user": "tashy1019", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119952512}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Jenn is immediately before the East/West North American continental divide, which we went to go look at.", "title": "Wonderful Hideway - thanks Jenn", "user": "kay824", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 118948725}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "There are so many fun things to do in this area. It has the zip lines -- everyone we spoke to said they were the best zip lines around, but sadly we didn't have time to try them out -- and also Jenn has a bunch of tours she's set up to show you around the area in a very local, less commercialized way. She has her favorite forest tour guide, Coci, who took me and my friend on a personalized animal tour of the area. He has lived here his entire life and keeps tabs on where all the birds and animals are based on time of year and food sources. With him driving us around town and into a local preserve, we saw more exotic animals then we'd seen our entire trip -- a sloth, toucans, cuati, agouti, a blue crowned mutt mutt, and many many more. We were surrounded by a family of cuati who sniffed at our shoes and thoroughly checked us out. It was amazing!", "title": "Warning - Do not stay here unless you want to be spoiled!", "user": "watchusgo", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118511811}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We also went on a coffee plantation tour organized by Jenn. We weren't sure about going on it, since we had to drive to the beach that afternoon, but are so glad we went. Jenn had her right hand man, Olmand, take us to a local coffee farmer who has a tiny farm (2 acres) that provides just enough income for a family of four. Olmand took us around the farm, explaining the myths of fair trade coffee, and exactly what goes into growing excellent coffee, and why the majority of what we get in the north is crap. He roasted coffee on a tiny old stove, showed us how coffee is left out to dry and how it is sorted from its shell, and then he and the farmer made us coffee from his beans! It was a fantastic tour. My friend and I are bursting with opinions on coffee now. And we bought bags and bags of the coffee for about $8/lb to give to family and friends. While that is the same price you'll find at many more commercial spots, at those places at least half of the money is going to the middle men, not the farmers.", "title": "thanks Jen!", "helpfulness": 1, "user": "zoewhitesnake", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118268383}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Soooo, a little off topic with the tour info there, but this B&B was fantastic. Jenn welcomed us so warmly, and all the ladies and gentlemen she has working for her here were so warm and friendly as well. She and they wanted to make sure we had a fabulous and memorable time, and we definitely did. The breakfast in the morning was great, and the local restaurants are actually really good too. I was impressed. Jenn's recommendations are gold. She's a NY foodie, I'm an SF pain in the butt foodie, and I would totally follow her recommendations blind.", "title": "ABSOLUTELY BEAUTIFUL...CANNOT WAIT TO RETURN!", "helpfulness": 1, "user": "StephBill", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118206814}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "If you are in Monte Verde, you HAVE to stay here. Gorgeous (modern) treehouse cottages, amazing staff, beautiful views... they have it all! I could not begin to explain how perfect this stay was for us. We intended to stay inly one night, but ended up another night, just because of the Hidden Canopy. They will take care of you here and provide tons of information and recomendations for your stay in Costa Rica. Well worth the drive up the mountain!", "title": "Spectacular", "user": "RoryDavis", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117095351}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I stayed in the Rising Sun room for two nights during our honeymoon in July and this was truly the highlight of our trip. From the AMAZING room to the delicious 'tea' time and the incredible stay (We love you Olman!) we truly wanted to move in,. Do yourself a favor and book your room NOW.", "title": "We Wanted to Move In!", "user": "WhitFisch", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116529657}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at Hidden Canopy Treehouse in July while in Monteverde. I will say first that the rooms are EXACTLY as the pictures on the website. That in and of itself was so refreshing. Unfortunately it rained most of the time while we were there and that put a bit of a damper on things but the place was lovely just the same. The rooms were impeccably clean, the bed comfortable and the towels lush. Jenny, the owner, is simply a delight. She is fun, always a smile on her face, and very helpful. The breakfast was simply the best we'd ever had while staying at a boutique hotel. At 4:30 every afternoon, wine was served with some sort of homemade snack. Delicious. And, because there is no TVs in the rooms (we stayed in Rising Sun) Jenny has added a great touch with offering a small, portable DVD player with an extensive array of movies (at no charge). This place was wonderful and so was Jenny.", "title": "Simply Wonderful", "helpfulness": 1, "user": "jsc0626", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116490777}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Fantastic experience all around. My husband, sixteen year old daughter and I stayed in both the Eden and Rising Sun. It surpassed our expectations in every way. The beautiful and very elegant tree houses, amazingly tasty breakfast and \"tea\", and views of the cloud forest/ gulf of Nicoya all created a trip from which memories are made. Jen greeted us each morning during breakfast with suggestions and immediately phoned to arrange whatever we decided we'd like to do for the day.", "title": "Absolutely fantastic time! Have been recommending to everyone we know.", "user": "LeeannChicago", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116446631}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Staying at the HIdden Canopy is a social event. During breakfast the guests chatted and got to know one another a bit, but the best part was tea. At 5:00 guests gathered and enjoyed both a savory and sweet treat as well as a beverage. Many guests found themselves enjoying the company of one another so much, they went out for dinner together. In our case, we joined another dad and his two teenage kids for an evening of cards in the guest lounge. After it closed at 8:00, we borrowed a DVD player and a couple movies and headed back to enjoy our chalet for some family time.", "title": "Jenn and her staff are great!!!!!!!!!!!! Just beautiful!!!!!!!!!!!!!!!!!!!!", "helpfulness": 1, "user": "UseYourPassport", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116284939}], "location": {"country": "Costa Rica", "continent": "Central America"}, "variance": {"poor": 2, "average": 3, "very good": 22, "terrible": 1, "excellent": 426}, "aka": "Hidden Canopy Treehouses Boutique Hotel Monteverde, Costa Rica", "slim_ranking": 0.142857142857, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Secluded in the canopy -- 5 luxurious treehouse chalets and 2 well-appointed rooms – all comfortably equipped with over-sized beds, living-room areas, fantasy waterfall showers, private balconies, coffee service, and mini-bar. Easy chalet access from platform walkways and ample opportunities for birding. Wireless Internet and computer access, lending library and portable DVD players in the main house guest lounge. Full Costa Rican Breakfast and our renowned \"Gulf-view Sunset Tea\" with Sangria and snacks included in room price. Located near canopy tours and the Santa Elena Reserve. Reservation Hours - 9 AM to 7PM. Non-smoking property. Please note: We do not receive children under the age of 14."}