{"user_rating": 3.0, "review_count": 103, "name": "Hidden Valley Eco Lodges and Day Spa", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "A group of us stayed in the farm lodge a couple of months ago. Whilst we had a good time, we were very disappointed by the standard of the accommodation.", "title": "Very disappointed", "helpfulness": 1, "user": "taswalsh", "date": "January 25, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 23877081, "likes": {"liked": "— Great winery restaurant closeby."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The Farm Lodge is marketed as being part of the luxuriously appointed Eco Spa Lodges on the same website. We found the lodge far from luxurious.", "title": "quaint and relaxing", "user": "bukkers", "date": "February 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13804285, "likes": {"liked": "— pleasing to the eye and the spa factor", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "It is sold as having 3 double and 1 king bedroom, implying that it sleeps 8. The sofa however, only seats 2 comfortably. There is no room for a coffee table in the lounge and the DVD player had no remote control. The TV remote control was caked in stale food.", "title": "A Magical Getaway", "helpfulness": 2, "user": "Ilaya", "date": "August 5, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 8353623, "likes": {"liked": "— The heated spa", "disliked": "— Have to do own dishes"}}, {"rating": 5.0, "title": "Great Stay", "text": "None of the 3 toilets flushed properly, even after numerous flushes. The shower over the bath is so small, that we couldn't comfortably wash our hair and turn around.", "helpfulness": 3, "user": "NZSugar", "date": "June 23, 2007", "id": 7969731}, {"rating": 5.0, "title": "Romantic getaway 30mins drive from Perth", "text": "The one bedroom had a badly cracked window, on which one could have easily cut oneself. There was another crack in one of the bathrooms/toilet windows.", "helpfulness": 4, "user": "neb", "date": "January 22, 2007", "id": 6640823}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I've been meaning to write this review for months but have been away for work so apologies to anyone who has had the misfortune of wasting their money at \"Hidden Valley\".", "title": "What a rip off!!! Dirty. Do not stay here!!!", "user": "lovecat", "date": "March 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 59387328}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "If you want a romantic getaway with your partner, FORGET IT. Rooms (NOT lodges! what an obvious example of misleading advertising) are separated by thin walls...you can hear EVERYTHING going on in the other rooms. So embarassing, and VERY hard to sleep through. Though some people are clearly into that...STRANGE people.", "title": "great get away to chill out with someone speacial", "user": "tarago91gary", "date": "March 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57398798}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The rooms were dirty with spider webs and dust and there was a BROWN STAIN on the sheets!!!!", "title": "Way overpriced for what you recieve", "helpfulness": 1, "user": "Cherrybom", "date": "February 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 55421367}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "I can't even begin to describe how much of a rip off and how misleading this place is. I had an average massage in what is obviously an old converted house. I could hear the kitchen noises when having my expensive massage. So much for peace and quiet.", "title": "ripped off - they are in it for the money not for the clients", "helpfulness": 2, "user": "PerthEdie", "date": "November 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 48722786}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The ONLY good thing I can say about this place is that the location is okay.", "title": "Wish I read the reviews first", "helpfulness": 1, "user": "redzephyr", "date": "July 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 34811857}, {"rating": 2.0, "title": "not at all what their advertising says", "text": "On returning home from the stay I wrote and complained about the stay; after three weeks when I had still received no response I telephoned, I spoke to Barbara the owner, she put me on hold and 'checked my letter', she returned to my call and advised that the matters had been dealt with!! I asked why I had received no response, she said I didn't need to as they had dealt with my complaints, I asked if she considered that an appropriate response in the hospitality industry (having spent many years in the industry myself), she said yes as if we weren't happy we didn't have to go again!!", "helpfulness": 3, "user": "caught", "date": "July 9, 2009", "id": 34283028}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My experience is as below. The visit was a special birthday treat from my husband. My expensive massage was booked for the afternoon of arrival, wherever I stay away I indulge myself with massage, the cost of these massages is very expensive, for example I regularly stay at Cable Beach Club Broome where the day spa and massages are excellent, the massages at Hidden Valley are double the Cable Beach prices. I was escorted to the day spa room; after about 10 minutes I commented to the masseuse on the volume of noise and clatter going on around the room, she agreed but offered no solution. After a further 10 minutes or so I said to her that it was difficult to relax with so much noise and would she please go and ask the people chatting, calling out to one another and clattering pots and pans around to quieten down. She did so and I heard her speaking to the people concerned however it made no difference whatsoever the noise continued unabaited. The massage is an expensive experience and was completely spoilt.", "title": "Way over-priced", "helpfulness": 3, "user": "MissLea89", "date": "June 16, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 32423992}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "The meal was ok but certainly not 'gourmet' as advertised.", "title": "Overpriced and underwhelmed", "helpfulness": 1, "user": "TravelBug1299", "date": "June 7, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 31744836}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "At dusk when the kookaburras came out we decided to go in the spa; we went in the spa and found the bubbles on the spa did not work!! I got out of the spa and looked for a contact number to ask for someone to come and look at it. The telephone numbers given said the numbers were not to be used other than in an emergency so we continued with the spa minus bubbles. We have a 10 seat spa at home in our garden, more enjoyable as it does have the bubbles!", "title": "Not What Was Advertised", "helpfulness": 1, "user": "champagne025", "date": "June 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 31433976}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "From the advertising descriptions and photos I expected Hidden Valley to actually be in a valley and to have secluded individual lodges. However the units where we stayed were single brick (looking remarkably like a converted garage style building) with adjoining unit walls in partition gyprock walling; not even solid walls between units. The instruction sheets in the unit stressed the importance of the serenity - we just went to bed and sleep when we were woken by the guests next door having a row; the female was throwing things around and yelling she was going and taking the car; obviously she didn’t go and they made up as we were once again woken by them in the early hours with very exhuberant, noisy sexual activity which went on for 45 minutes before it quietened down; it became so bad I asked my husband to bang on the wall and tell them to shut-up - he declined!!!", "title": "Tranquill,beautiful and unforgetable.", "user": "sazzleWa", "date": "March 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26043845}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 20, "average": 12, "very good": 22, "terrible": 20, "excellent": 29}, "aka": "Hidden Valley Eco Lodges And Day Hotel", "slim_ranking": 1.0}