{"user_rating": 5.0, "review_count": 157, "name": "Highfield Mews, Oamaru", "reviews": [{"rating": 5.0, "title": "Beautiful rooms. Great Staff.", "text": "Stayed here for 2 nights in Feb 2012. Staff were extremely helpful and friendly. We had a 1 bedroom unit. Fitted out very nicely. Bathroom was beautiful. All felt brand new. Great thermostat controlled heating. Short 2 min drive to the town centre.", "user": "255060Pete", "date": "March 8, 2012", "id": 125779731}, {"rating": 4.0, "title": "Immaculate room but some street noise.", "text": "Out of 5 hotels we stayed at in New Zealand, this was the nicest in terms of room quality. Would stay here again for sure.", "user": "jimfromjackson", "date": "March 6, 2012", "id": 125683588}, {"rating": 5.0, "title": "Excellent ... 5 stars!", "text": "I would normally have given this property 5 stars but for the street noise. It's located on a corner fronting the main road in Oamaru and being a light sleeper I was bothered a bit by the street noise particularly the trucks at 5:30am. That said, the room was huge. We had one bedroom with a flat screen TV in the bedroom and the sitting area/living room. The kitchenette was fitted out with everything you'd need for making yourself breakfast, lunch and dinner. The property looked new and the bathroom was also large and had a spa bath and shower. Aside from the street noise, the property was outstanding. Would we stay here again knowing what we know---- yes!", "user": "Rhonda4000", "date": "March 3, 2012", "id": 125572520}, {"rating": 5.0, "title": "Outstanding quality for price", "text": "We are a family of 5 adults who stayed over on two occasions during our visit to the South Island. The staff were extremely friendly and helpful and the two interconnecting suites suited our family perfectly. The rooms were very clean and we cannot recommend this motel highly enough; in fact, we are looking forward to our return.", "user": "kakapo", "date": "February 20, 2012", "id": 124849686}, {"rating": 5.0, "title": "Clean, spacious, quiet", "text": "Excellent quality large, clean rooms (more like apartments than motel rooms) with really comfy bed and pillows and friendly helpful owners.", "user": "Hugh L", "date": "February 1, 2012", "id": 123978807}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The layout of the motel is excellent plenty of room and no sitting on the bed to watch TV.", "title": "Best motel you can find?", "user": "Bruce C", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122742161}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Although on the main road its very quiet.Other motel owners take note this is how it should be its better than hotel room. No mean issue plates and cultery here", "title": "Fantastic top class accommodation", "user": "James C", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122449437}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Host is great very helpful.", "title": "Veena R", "helpfulness": 1, "user": "VeenaRaj", "date": "December 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122337944}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Worth staying more than 1 night will return", "title": "Quiet and private", "helpfulness": 2, "user": "Tim E", "date": "December 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121272592}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We spent 12 days in the south island and this was our favourite accommodation out of them all, it's a shame we didn't have the time to spend about her night there. Ross was great for local advice and what to do, and showed us some good pointers for our trip - ending up with us changing our planned route around the island which we're glad we did now. Nothing was too much trouble. His restaurant recommendation (Portside) was great and we had a really good meal there. If anything the pictures of the rooms on the website don't do them enough justice. If you are visiting Oamaru or just passing though and need an overnight stop make sure you stop off here.", "title": "Clean, well appointed and friendly", "helpfulness": 1, "user": "SCJM", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121232787}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed in a two-room unit in the middle of the property. Upon flying in to Christchurch from Sydney and a 3-hour drive, the first touch-down was particularly important: it was so good to be expected and be informed about the various options in Oamaru. We were bluffed by the brand new, high standing of the unit including spa bath, wifi and 2 tvs. One recommandation: the entrance to the motel is not on Thames street, so the GPS might keep you turning in circles. It would be helpful if the website would indicate the street of the entrance as a GPS address.", "title": "Wow!", "helpfulness": 2, "user": "Travellersfromswitzerland", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126373442}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed here last month. An excellent stopover - well run, clean and comfortable. Friendly hosts.", "title": "Outstanding motel", "user": "Australophiles", "date": "March 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126338439}, {"rating": 5.0, "title": "Nice and new with outstanding service", "text": "Stayed for two nights. As other reviewers noted, the property is new and the rooms are smartly furnished. Upon check in I was placed in an \"accessible\" room. I didn't realize when I booked (my fault) that the room would only have a shower. I called to see if I could be moved to another room and could not as they were fully booked. The next morning after folks had checked out, I was upgraded free of charge to an executive studio with a spa bath. Moreover, when I broke a glass and left a mess in the room, the staff could not have been more pleasant about it. If arriving by bus without a car, be advised that the hotel is some distance to the city centre and there is no public transportation. I would not hesitate to stay here again.", "user": "berryme03", "date": "March 15, 2012", "id": 126149495}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed at Highfield Mews for one night in Feb 2012. The units are new and have been built to a very high standard. In a quiet position dispite being just off Thames Street . Our unit was spotless and very well equipped, the bathroom was first class.", "title": "Historic Oamaru", "user": "Will S", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126031028}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Ross and his wife were helpfull and keen to assist with our onward travel arrangements. This motel is to be highly recommended.", "title": "Wish we stayed for longer!", "user": "shellsberight", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126013009}, {"rating": 4.0, "title": "Competent but an opportunity missed", "text": "Oamaru is an elegant, historic town, with imposing architecture which I like very much - the challenge is to find any accommodation that remotely matches its character.", "user": "John2a", "date": "November 28, 2011", "id": 121159486}, {"rating": 5.0, "title": "A Touch of Class along State Highway 1", "text": "Highfield Mews advertises itself as Oamaru's \"newest\" motel which I'm sure it is. It is on Thames Street, the straight very lengthy highway into town that houses a string of dead boring characterless motels.", "user": "JanvanHouten", "date": "November 18, 2011", "id": 120745590}, {"rating": 5.0, "title": "Beautiful motel", "text": "Highfield Mews has tried to be a bit different with their architecture but nobody pushed the \"inspire me\" button. The rooms are spacious, clean, well equipped empty feeling spaces. If only they'd hired a designer decorater for a couple of days, they'd maybe have got the cigar.", "user": "Gwentle", "date": "November 12, 2011", "id": 120511316}, {"rating": 5.0, "title": "An excellent short stay", "text": "All that said, there's nothing to seriously complain about. Its competent, and probably as good as you'll get. The shame is such a beautiful town, with its imposing historic precinct, offers so little in interesting accommodation.", "user": "Judith865", "date": "October 26, 2011", "id": 119741797}, {"rating": 5.0, "title": "Fantastic place to stay", "text": "Stopping in Oamaru while travelling the North-South highway is highly recommended. This historic town has much to offer. The Highfield Mews Motel features very comfortable and well-appointed rooms with modern amenities - indeed a touch of class! But that's not all: your hosts do everything in their power to make your stay a pleasant and memorable one.", "user": "andrea18130", "date": "October 14, 2011", "id": 119308911}], "location": {}, "stars": 3.5, "variance": {"poor": 0, "average": 4, "very good": 23, "terrible": 0, "excellent": 130}, "slim_ranking": 0.0526315789474, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Quiet and private executive Accommodation in a village like setting, Highfield Mews places you in the heart of Oamaru. Within easy walking distance of the town cafes, restaurants, shops and Historic Precinct, this new motel is ideal for both work and relaxation. Luxurious interiors complemented by unique design Highfield Mews is enhanced with many features and comforts including king size beds, double spa baths, 42\" TVs."}