{"user_rating": 3.5, "review_count": 303, "name": "Highland Beach Resort", "reviews": [{"rating": 1.0, "title": "dirty bedding", "text": "Over rated hotel.Along tiring flight only to get there be allocated our room,pull back the sheets to have a few hours sleep and find total horror in the bed,stains of brown. cigerette burns and dont even go to what state the matress was like under the sheets.", "user": "FAB22", "date": "March 28, 2008", "id": 14602879}, {"rating": 4.0, "title": "Nice hotel", "text": "How many times when we travel do we just jump in the bed to get a quick nap without even looking what the bedding is like? food for thought in the future- fellow travellers.", "user": "CUFCCarlisle", "date": "March 28, 2008", "id": 14593785}, {"rating": 2.0, "title": "Very good hotel in the right area", "text": "2nd visit to the highland beach,it's getting bigger every year,but it doesn't seem to be a problem,maybe at breakfast time,when it gets a bit busy round the pool,where breakfast is served,eggs,eggs or eggs and one goan dish and toast,that's it,when you've had enough eggs you can always go out and have a full English approx £2/£3.The hotel has 4 pools you can use which ever one you want and towels are provided,we always used the quiet pool beside blocks 15/16/17 etc,makes it sound like a prison camp,but it's really not! we were in block 15 top floor room 2 bedroom,2 bathroom,kitchen area,dining area,living area with TV (english channels inc films and live football) maybe could do with a lick of paint! the staff are all very good and nothing is to much trouble.A lot of guests re-visit this hotel inc us just booked for Jan 09 so the hotel management must be doing something right!", "user": "ManchesterSally", "date": "March 21, 2008", "id": 14436030}, {"rating": 4.0, "title": "Paradise Revisited", "text": "Hope this has helped!", "user": "Humphman", "date": "March 17, 2008", "id": 14336269}, {"rating": 4.0, "title": "Excellent", "text": "On arriving at the hotel after a long flight we were put in this room about as big as a box room in England,I complained to the manager but was told we would have to wait a week to see if any rooms became available.2 days later everytime the toilet was flushed we heard a funny noise like a gurgling.On the 3rd day i got up to use the loo and the toilet was overflowing on to the floor with raw sewage.They moved us straight away onto the 5th flor with no lifts.We are both in our late 60s and found it very hard going up and down in 90 degrees heat.If anybody id thinking of goint to this Hotel i would advise them to ask for a 1st or 2nd apartment in the new blocks.The people who work their are excellent and very friendly.Apart from this incident it was an enjoyable holiday", "user": "harveyukLondon", "date": "March 6, 2008", "id": 14091372}, {"rating": 2.0, "title": "EXCELLENT LOCATION - Alan & Val, Sittingbourne, Kent", "text": "Arrived at Highland Beach on Sunday 30th March at 8.30 in the morning. We were given room 2104 which was located in the next block around the corner from reception. It was on the ground floor and very dark and our balcony only looked out on to trees so if you are given that room, ask for one on a higher floor if you require a view. We departed on Sunday 13th April for a 04.45 pickup.", "user": "loveindia_8", "date": "April 16, 2008", "id": 15074603}, {"rating": 4.0, "title": "highland beach hotel", "text": "On arrival in our room, I looked at the bedclothes and thought they hadn't been changed so I contacted housekeeping who came along immediately and changed all the bedding only to find it was the same colour as the last lot. Washing by hand with a stone is probably the reason. Other than that, it was the usual standard for Goa but ideally situated for all the bars and restaurants.", "user": "shirleyscotland", "date": "April 15, 2008", "id": 15048661}, {"rating": 5.0, "title": "brilliant holiday!", "text": "We found that the time of year we visited (we usually go in January) was far hotter and much more humid and earlier so we would only go back at that time again as it is much more pleasant. I didn't take jewellery of any value with me but I had some silver which I locked in our case during the day so did not experience anything being stolen but then again, I don't put tempation in their way!", "user": "nomescornwall", "date": "April 8, 2008", "id": 14890230}, {"rating": 4.0, "title": "pleasently surprised!", "text": "As it has been pointed out, the rooms are cleaned daily and clean (if you could call them that) towels were always available in your room. Also, there was a small immersion heater in the shower which ensured you always had hot water. One thing, if you are going, please remember to take a universal sink plug with you as they do not, for some unknown reason, have any plugs to their sinks so if you want a wash or hubby wants a shave, you're out of luck! There is a massive supermarket called Newtons just around the corner from the hotel which is open until 12.00 each night and you can get almost anything you require in there.", "user": "star001", "date": "April 8, 2008", "id": 14878554}, {"rating": 5.0, "title": "heaven in goa", "text": "We used to go to either Claudinas or Bonos shacks during the day where you could get sunbeds and food but unfortunately, due to the murder of the English girl in Anjuna a month or so back, the Tourist Police closed a lot of the beach shacks down. Claudinas actually cease to exist now and they will have to start from scratch when they return for the new season. I believe Bonos is still there but it was heartbreaking to see their livelihood being torn down. Anthony who owned Claudinas was absolutely devastated and it was very upsetting for us to have to watch all this going on.", "user": "papeyx", "date": "April 7, 2008", "id": 14860454}, {"rating": 5.0, "title": "paradise found!!!!!", "text": "well before we arrived to the highland beach,we were pre warned about the new blocks that are being built.so i emailed hotel and asked if they could accomodate us away from the building work, so i was delighted when we arrived to find we were well away from the building work, in a two bed apartment,also with a pool view.!!!! couldnt fault any of the staff,and they all worked so hard to make our chrstmas eve so very special,excellent gala meal was provided, and a hell of a lot of work and preperations was acheived by all the staff. even santa arriving!!!!! dont bother loading your suitcass with toiletries, there is a supermarket (newtons) that sells everything you\"ll need for a fraction of the costs..toothepaste, 25p!!! dove soap and shampoos, everythin so cheap, even your mossy plug ins buy them in newtons 80p!!! trips dont bother booking any trips through any agencies, just have a taxi driver for the day, they are very informative, and reliable, you can have a taxi for the day for around 6 -700 rupees. candolim, calangute beaches are lovely, but very busy,so if you like something \"unspoilt\" then visit \"asvem\"beach, or \"mandarem\" beach. saturday market is a must!!! food stalls, entertainers, everthing you could wish for. anjuna wed market, is very busy, try to go in the back way by boat from baga beach, you dont seemed to get hassled this way. my ten year old daughter had the time of her life, we went dolphin watching, no see,no pay!!!! hahaha,and even a wave from the local prisoners !!!!!! we rode and washed the elephants, which was her dream come true!!! all in all we had a fantastic time and would definately return, and would recommend the highland beach,if only for its location, cleanliness.oh yes nearly forgot, go to the tailors on the beach road, they make excellent trousers for around £10!!!!! and hand make your shirts for £5...now that is cheaper than asda price!!!!!! :-)", "user": "maria40leicester", "date": "February 2, 2008", "id": 13216484}, {"rating": 3.0, "title": "good until?", "text": "had an excellent time in candolim people were real friendly food was first class especially on the beach at francisco's shack were jonny and melvin look after you real well ,the hotel was ok rooms were half cleaned every day but otherwise it was ok until our second from last day when a necklass went missing from the drawer in the room only the cleaner had been in when we contacted the duty manager to get the police he did nothing about it in fact i would say he was useless, the next day when we were leaving he still had done nothing about it when i asked him about the room boy he said it was his day off total [--]", "user": "denislindsay", "date": "January 25, 2008", "id": 12981021}, {"rating": 3.0, "title": "A Good Base for Great Days!", "text": "the manager said this had never happened before but when i questioned a few staff they said it happens all of the time but is never reported so if you really want to stay here ask for about 20 safety deposit boxes so you can keep all of your things in them .", "user": "javdac6070", "date": "January 4, 2008", "id": 12331201}, {"rating": 4.0, "title": "Loved Candolin", "text": "We stayed here for 2 weeks arriving on the 9th December. Stayed in room 1206 which had 2 double bedrooms, 2 bathrooms both with showers (remember and switch on the water heaters) , A/C (take earplugs as it's very noisy!), fan in each room, balconies at front and rear, fridge, satellite TV. Found the room comfortable and felt very at ease there.", "user": "SHARON944", "date": "December 28, 2007", "id": 12012185}, {"rating": 1.0, "title": "Falling standards at the Highland Beach", "text": "Large padlock on room entrance door and large slide bolts on each door. Recommend to keep these bolted when you leave as there were 2 break ins when we were there. However, we never felt unsafe in hotel.", "user": "LondonMartinLondon", "date": "December 28, 2007", "id": 12011538}, {"rating": 5.0, "title": "Gorgeous Goa and great hotel!", "text": "Stayed here on a package tour with First Choice - lovely resort and base for exploring Northern Goa, and also heading down to the heavenly Palolem. Great omlettes and curry at breakfast times!", "user": "smokeyrasher", "date": "July 28, 2008", "id": 18340286}, {"rating": 3.0, "title": "Basic but comfortable", "text": "The hotel is very basic and many of the rooms (appartments) are owned by retired ex-pats. The pool area has an almost retirement home feel about it. All the elderly residents sit in the same deck chairs etc but most are very friendly. The spend from Oct - March in resort.", "user": "celticdream", "date": "June 24, 2008", "id": 17193815}, {"rating": 4.0, "title": "great hotel", "text": "The bedrooms are big but of a very poor standard (typical of Goa). The sheets looked yellow but smelled clean enough. The breakfasts were fine and the restaurant was very cheap for lunch. Overall a cheap and cheerful resort but I was glad I only stayed one week.", "user": "rob.belc", "date": "May 1, 2008", "id": 15527919}, {"rating": 5.0, "title": "Wonderful Goa", "text": "We arrived at the Highland on 13th April through First Choice.", "user": "Narcky", "date": "April 28, 2008", "id": 15424471}, {"rating": 4.0, "title": "post Easter School Holidays", "text": "Got a taxi from the airport that turned out to be pointless as we waited a hour for our room1", "user": "patriziaord", "date": "April 21, 2008", "id": 15183366}], "location": {}, "stars": 3, "variance": {"poor": 30, "average": 67, "very good": 129, "terrible": 18, "excellent": 59}, "aka": "Highland Beach Hotel Candolim", "slim_ranking": 0.590909090909, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}