{"user_rating": 4.0, "review_count": 84, "name": "Hilgard House Hotel", "reviews": [{"rating": 5.0, "title": "Friendly, personal and unique hotel", "text": "I found that the hotel was very nice and affordable. My room was spacious with very large windows. It was also very clean. The continental breakfast every morning was also nice. The front desk was very helpful throughout our stay. It was very close to UCLA Medical Center. We would definitely recommend staying at this hotel.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 16, 2003", "id": 1519018}, {"rating": 1.0, "title": "Overpriced Mousehole", "text": "Argh, what a nightmare. We booked one full year in advance to attend our son's UCLA graduation. We had to pay IN FULL to hold our room. We chose Hilgard House because of its proximity to the campus (walking distance). We were charged $175.00 per night for a closet. The bathroom was worse. We had to actually stand behind the toilet to shut the door.", "helpfulness": 26, "user": "A TripAdvisor user", "date": "August 4, 2003", "id": 1208327}, {"rating": 1.0, "title": "Hostility", "text": "I made reservations over the phone to stay at the hotel. When I got there I was told that the \"free parking\" included in the cost of the room did not pertain to my large truck (toyota tundra) and that I would have to park in the Ralph's grocery store parking lot (3-4 blocks away) at a fee of $5.00. The manager literally yelled at me in the parking garage in front of other guests. He was pointing his finger at me and shaking his finger at me. When I asked where I could stay or where the Ralph's is (being I'm not from the area I had no idea where the Ralph's was located) he became irrate and mocked and mimicked me \"ohh, the poor baby, she doesn't know where to go\", \"poor thing\", etc. After my encounter with this \"man\", I didn't feel safe staying there. Luckily another local hotel had a cancellation and welcomed me and my truck without any problems. The desk clerk (young gentleman) appologized profusely for the manager's behavior and stated that we would have been able to handle the situation without the manager's involvement. I have filed a complaint with The Los Angeles Area Hotel Association and I will also be contacting the Chamber of Commerce. Since so many people drive large SUV's and trucks, they should mention the parking situation when people make reservations over the phone. They could even make arrangements for a shuttle to Ralph's or a reduction in the room rate for those of us that are expected to pay to park somewhere else. I wouldn't recommend this hotel to anyone.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "July 14, 2005", "id": 3667927}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I decided at the last minute to drive up from San Diego and get a place near UCLA where I was picking up my daughter the next day. Even though I called only hours before my arrival, the staff was very helpful and made arrangements for me, including the exact type of room I asked for. The hotel was clean, quiet and very nice. It does not have extra facilities (pool, gym, etc.) but I did not need those - and the rate was very good for the area. The parking is secured, but the spots are a bit small. I knew this ahead of time as I had read previous reviews and my car is small so it worked for me. We didn't have much time to explore the area but it is only a block or so from UCLA in Westwood Village. I would most definitely stay here again!", "title": "Nice place to stay!", "helpfulness": 17, "user": "CA Gal", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3667761}, {"rating": 5.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "I've been staying at the Hilgard House for 3 months in one of the 1 bedroom suites. It is within walking distance of the UCLA Med Center. Centrally located for the hospital, it is also within walking distance of a grocery store and drug store. There are many different restaurants in the area to choose from. The staff has been very kind and considerate, leaving extra towels, etc when requested. They even left extra sheets and blankets for my son to sleep on the couch (this was a 1 bedroom). The only downside is the oven and microwave work - but are very old and should be replaced.", "title": "Great 1 bedroom suite for the price", "helpfulness": 12, "user": "annpr", "date": "June 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3614494}, {"rating": 3.0, "title": "Clean, great price and good for kids", "text": "We stayed at the Hilgard as a family of 4, 2 adults, a 5 year old and an infant. Our room was clean and okay for size, we were told during booking that it would be a little crowded since we added a crib. Employees were friendly and accomodating. Room had a large window with darkening shades which made getting the kids to sleep a breeze. Walking distance to the medical center and Jules Stien, Very quiet and steps away from the Mildred Mathias Botanical Gardens which are beautiful. Plenty of secured parking. If you have to stay away from home and are looking for a clean quiet room, this is it.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 23, 2005", "id": 3400213}, {"rating": 5.0, "title": "Great small hotel in Westwood near UCLA!", "text": "This is a fine and reasonably priced small hotel that doesn't have a pool, work out center, business center, bar, or restaurant. It does have good, quiet rooms and a wonderful staff.", "helpfulness": 10, "user": "Tom in Minnesota", "date": "February 16, 2005", "id": 3194972}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We spent seven nights at this charming venue from Thanksgiving Day on this year while visiting Bruin-grad son.", "title": "Exquisite Boutique Hotel in Westwood Village", "helpfulness": 11, "user": "Donata G", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6364601, "likes": {"liked": "— Quality and value.", "disliked": "— Nothing."}}, {"rating": 4.0, "title": "Delightful and dusty, great location", "text": "Previously, we'd stayed at the W, just across the street, and paid far more for a room, as well as with time for the valet parking and all the rigamarole related to getting the car and getting out of the W where all kinds of activities and hullabaloo, -- while fine for an experience -- tend to interfere with the simple business of trying to blend into Westwood Village life. At Hilgard House we parked our rental in the garage every night and took the elevator up to our floor.", "helpfulness": 8, "user": "09876", "date": "November 10, 2006", "id": 6095057}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "Our delightful ultra-clean room (cleaned quickly every morning by friendly and attentive staff) faced the back of the Westwood Christian Church, a truly beautiful and historic structure visible from our large picture window. Church bells never chimed before 10, but were lovely to the ear.", "title": "inexpensive, unpretentious charmer, UCLA adjacent", "helpfulness": 9, "user": "pillowsofwanderlust", "date": "September 19, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "value": 5.0, "location": 5.0, "service": 4.0}, "id": 5814814, "likes": {"liked": "— location, inexpensive. free parking"}}, {"rating": 5.0, "title": "Hilgard House -- nice and affordable, great location", "text": "The lobby bowl of fruit, particularly my mandatory bananas, was alway full, with coffee available. We enjoyed a quick daily trek to the Starbucks or Coffe Bean to start the day, but it was nice to be able to grab a paper if desired in the gem of a lobby. The location and proximity to everything village-wise encouraged walking. It was fun to lunch at Whole Foods or Angelino's or just shop fabulous Westwood (including superb jeweler Michael K's), as well as wander across the street to the W for a nightcap when the mood struck.", "helpfulness": 13, "user": "hibachi", "date": "January 3, 2006", "id": 4320502}, {"rating": 5.0, "title": "*We always stay here when visiting UCLA!!!", "text": "Make no mistake -- the owners of this venue are international hoteliers who have created a chic oasis that has no need of advertising.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "November 30, 2005", "id": 4155232}], "location": {"country": "United States", "city": "Los Angeles"}, "variance": {"poor": 8, "average": 7, "very good": 43, "terrible": 3, "excellent": 23}, "aka": "Hilgard Hotel Los Angeles", "slim_ranking": 0.36858974359}