{"user_rating": 5.0, "review_count": 47, "name": "Hilltop Barn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My partner and I spent one night here, we found our experience an enjoyable one from the very beginning.", "title": "Peaceful & relaxing stay in Hilltop Barn", "user": "JessicaRomilly", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137060979}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The room was immaculate, spacious and the bathroom was just the same.", "title": "Perfect Retreat", "user": "Alan A", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135904268}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The Bed was extremely comfortable with soft sheets.", "title": "A Little Gem", "user": "laylamai", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135774216}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Breakfast was good with a very wide range of choices.", "title": "One of the BEST", "user": "devmike", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135079898}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Great Location also.", "title": "JUST PERFECT", "user": "LIGHTY4", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133498649}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "On our third visit to Hilltop Barn we have recieved the same excellent service yet again! The room was different this time as we stayed in the Olive and before have stayed in the Willow. The breakfasts are well cooked and the fresh fruit once again to start was refreshing to the pallet!! We will definately be going back later in the year when its warmer. Highly recommend the Coventry Arms about 10 miles back towards Wimbourne lovely staff and excellent food. Bill and Shan ever the welcoming hosts with tea and cake on arrival and a welcoming smile. Too good to miss this gem!", "title": "Our return Easter break", "user": "NobBee", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156972416}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Totally inspiring place. Bill and Shan were very helpful and welcoming and friendly. As were the farm animals! Oodles of character and personal touches. The decor is just fantastic with exposed brick and wooden beams. Lovely cakes and tea on arrival and a super breakfast. Our room was just a joy to be in and so comfy too.", "title": "Fantastic!", "user": "elarozy", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156423819}, {"rating": 5.0, "title": "lovely b&b!", "text": "The village is also very pretty and overall we had a really lovely stay.", "user": "becky e", "date": "March 29, 2013", "id": 156000269}, {"rating": 5.0, "title": "We'll come back", "text": "Thankyou!", "user": "Princey71", "date": "March 25, 2013", "id": 155569104}, {"rating": 5.0, "title": "Highly recommended", "text": "what a wonderful b&b! we spent two nights at the hilltop barn and had an excellent time! the hosts are lovely folk, the setting is nice and quiet, there's not much to add to the other twenty odd five out of five reviews, tea and home made cake on arrival, gorgeous room, loads of teas and coffee, a comfy bed, really good. everything about it was indeed excellent.", "user": "fredsbob", "date": "March 11, 2013", "id": 154279226}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Have just arrived home from an excellent stay at Hilltop Barn. Everything about the accomadation was excellent. Bill and Shan the owners were lovely hosts, friendly and helpful, there if you needed them, but without being in your face all the time. The bed was comfortable (not something I say very often) with quailty duvets and pillows. The room was well designed and spacious, also nice and warm, but if you got too warm you could turn the rad off. The breakfast was excellent, with (unusally for a B&B) plenty of choice. Our bathroom had a seperate shower as well as a roll top bath. We had lovely views from our bedroom window, and being up a no through road, was very quite, just what you want for a relaxing weekend away. Being adults only is a real plus in my book, no screaming kids running up and down on the wood floors at all time of the day and night. Theres plenty to do in the local area and I beleive there are several walks direct from the barn.", "title": "Excellent", "user": "Karanszia", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154255811}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "No kidding, this place is amazing and the owners are charming.", "title": "A privilege to stay here!", "user": "Paul C", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153873466}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Nice brew and a piece of cake on arrival was just the start.", "title": "A most comfortable & relaxing experience.", "user": "LaineyBishopbriggs", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144443090}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Room was so full of character and comfy bed.", "title": "beautiful settings", "user": "thevaudins", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139887671}, {"rating": 5.0, "title": "Excellent - five star B&B", "text": "You are truly in the countryside here so traffic noise is non-existant, you might get the odd quack fro the ducks but they just add to the relaxed feel of the place.", "user": "Foodyfrance", "date": "August 20, 2012", "id": 137823647}, {"rating": 5.0, "title": "Excellent stay at this wonderful Barn", "text": "We had been visiting friends in a nearby village but decided we would stay overnight here at Hilltop Barn. On arrival at 5.30pm we were greeted by Shan who showed us to the Mango room. This room has triple aspect windows looking over the beautiful countryside. The room was very warm but with the ceiling fan and the breeze from the open windows we were fine. The bathroom was lovely and has a jacuzzi bath, fluffy towels and great amenities. Everything was really clean too. We were offered tea and went down to the patio and Shan served us a pot of tea and slices of cake - delicious. It's a wonderful home and you really feel very welcome. We slept really well and enjoyed a wonderful breakfast cooked by Shan and served by Bill. They are a delightful couple. We will return when we go that way again. Thank you so much.", "user": "Speges", "date": "July 19, 2013", "id": 168157502}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We stopped here to break up our journey from Glasgow to Cornwall and specifically to visit Monkey World (10 mins away). What a gem. Lovely room and located in a lovely thatch roofed village, it really is a cracking location. The breakfast was awesome, absolutely smashing grub, a clotted cream ice cream was all I could manage during the day! I'm a bit of an animal lover and loved talking to the rather old cat, the duck and it's babies in the pond, the horses in the nearby field and of course the monkeys at Monkey World. Most of all I enjoyed talking to Bill. A lot of places I've stayed at, the proprietors plonk down your breakfast and leave you to it and that's fair enough, but Bill is obviously very proud of his home and his county and takes great pleasure in pointing you where to go for your day out as well as showing a sincere interest in where you've come from. Great fun and a lovely character. We really enjoyed our brief visit to Dorset. Would definitely visit again.", "title": "Exceptional standard for b+b, a warm welcome and beautiful food!", "user": "EwanCa", "date": "June 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165363315}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Whilst there are times when one welcomes the impersonal nature of the chain hotels, Hilltop Barn is as far removed from such an experience as one can envisage and on our recent visit the personal and individual approach was most appreciated. This extends to the communal breakfast table which if you don't like this sort of thing then stay away. But for us the opportunity to chat to other guests and particularly Bill who served the breakfast whilst Shan slaved away in the kitchen was a most enjoyable part of our stay.", "title": "One of the best", "user": "ColdstreamKeith", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162565683}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had booked the ground floor room which is across the courtyard from the main house. This is a very spacious room with comfortable settee as well as a large double bed and bathroom with shower over the bath. Breakfast is served around the family dining table and one very much has the feeling of being a family guest. The meal itself starts of with a plate of fresh fruit - an unusual but most welcome starter. All the usual cereals and juices are available with cooked main courses to follow including an excellent traditional English plus smoked salmon/ scrambled eggs etc.", "title": "Fantastic B&B", "user": "Andrew B", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161281346}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Hilltop Barn is located on the edge of the lovely village of Winterborne Zelston and peace and quiet are assured.", "title": "Highly recommended", "user": "HertfordshireHels", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 157701473}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 47}, "slim_ranking": 0.333333333333, "description": "Hilltop Barn is situated in the picturesque village of Winterborne Zelston just 1/4 mile from the A31 between Wimborne Minster and Bere Regis.Peacefully located on the edge of the village with outstanding views of the Dorset countryside. An ideal location for exploring “Hardy Country”, Rural Dorset and the World Heritage Jurassic Coast. Hilltop Barn offers luxury en-suite accommodation in an imaginatively conceived barn conversion, retaining much of its original character, a wealth of beams and rustic charm. Each bedroom is individually designed and where possible incorporates the original features of the Barn."}