{"user_rating": 2.5, "review_count": 59, "name": "Hilltop Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "I stayed at this Best Western for one night after a night at Mohegan Sun Casino. All in all the hotel wasnt too bad for the price. We payed about 80 or so for a non-smoking king room. The room is about what you would expect from a Best Western. Large enough, fairly clean, a decent bathroom, but there was nothing really special about it. The bed however was hard as a rock. It was just a clean room to sleep in after a night of gambling. The window had a major crack right through it and it completly screwed the view up ( not that there was much a of a view anyway). The front desk staff didnt seem overly helpful or knowledgeable, but thats not really anything new for hotels like this. I took a quick look at the continental breakfast and decided agaisnt it. For the most part this hotel is fine for one night, just dont expect to much out of it.", "title": "So-so", "helpfulness": 6, "user": "icem2829", "date": "April 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 2.0}, "id": 4955974}, {"rating": 2.0, "title": "overpriced", "text": "We got the room we wanted, king non smoking. They checked us in a few minutes early, nice.", "helpfulness": 1, "user": "Jeni S", "date": "October 4, 2005", "id": 3992900}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "The room was upon first site clean. After a while we noticed a lot of dust...on the tv, on the clock radio, on the coffee maker and microwave.", "title": "A FINE CHOICE", "helpfulness": 9, "user": "momofwill", "date": "August 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3779288}, {"rating": 5.0, "title": "Absolutely magnificent, Great Location for Mystic area", "text": "I think having a coffee maker, fridge and microwave are an added bonus while traveling. We take advantage of these features. But we like them clean.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 3, 2005", "id": 3632113}, {"rating": 2.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "The windows open to the outside...very nice feature if you hate air conditioning. We had a nice crisp night air but unfortunately the dust was so bad in our room that we woke up stuffed up...", "title": "If clean is important to you, move on.", "helpfulness": 3, "user": "ARTravelers", "date": "June 22, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 5.0}, "id": 3604157}, {"rating": 3.0, "title": "Good place to stay", "text": "We stayed two nights at the Best Western Hilltop Inn in Niantic, CT. It was convenient to area attractions. Easy on/off for I-95. OK continental breakfast. Our room was large, clean, and comfortable. There was a small refrigerator in the room. We arrived late, almost 9 p.m., and the check-in clerk was efficient and helpful. He even called a couple of restaurants to be sure they were open for us! Check out went smoothly, also. I have no plans to return to the area, but if I did, I would stay here again.", "helpfulness": 9, "user": "Zoey1996", "date": "May 27, 2005", "id": 3504388}, {"rating": 1.0, "title": "WARNING -- Confirmed rates not upheld at checkout!!!", "text": "I booked my elderly mother into this hotel with a AAA discount over the 1800 reservation desk AND guaranteed it with my AMEX credit card. Desk staff ATTEMPTED to overcharge us SEVERAL times at check out after repeatedly stating that we did not deserve such a discount despite the reservation guaranteed with a credit card AND showing our current AAA memberships! Fortunately between Best Western corporate and AMEX the matter has since been resolved. Howevr it took us over 30 minutes to check out, and we certainly did not receive the level of service warranted of a Best Western.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 2, 2004", "id": 2859701}, {"rating": 4.0, "title": "A good value and so convenient!", "text": "Hotel is also in DESPERATE need of renovation", "helpfulness": 8, "user": "carcip", "date": "August 25, 2004", "id": 2493810}, {"rating": 1.0, "title": "Worst ever!", "text": "We stayed here for 5 days in August in two separate rooms. The location was ideal for us. It's just off 95. The two casinos were about a half hour away and we were also near other attractions like beaches and state parks. Check in was quick. I slept like a log on the comfy king bed and the room was surprisingly quiet. My room had a little refrigerator and a microwave oven. There is a huge new supermarket nearby. The free continental breakfast was very good. Overall this was a good value and we would definitely stay here again. BTW, we loved the Mohegan Sun. The restaurants were great and we did well on slots.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 10, 2004", "id": 2287829}, {"rating": 1.0, "title": "Poor Service, OK Rooms", "text": "Best Western Hilltop in Niantic--The rate quoted was misrepresented, and we were charged a much higher rate at checkout. When we asked to speak to the agent we made the reservations with over the phone, we were told by the manager that no such person worked there when in fact they did. The front desk agent couldn't understand (or chose not to understand) our questions due to a language barrier. Our request for room location was dismissed. Many of our groups rooms were not cleaned and made up until close to dinner time making it inconvenient to take showers without clean towels. In addition, the \"pool\" was not properly treated and my daughter's eyes burned. The hotel provided minimal ammenities, needs repair, and is not at all the quality you'd expect from a Best Western. We couldn't wait to get out of there. Never will my family, or any of the other families in our group, stay at a Best Western again. This location is independently owned and is an embarrassment to the Best Western chain.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 30, 2002", "id": 730317}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 7, "average": 10, "very good": 9, "terrible": 22, "excellent": 11}, "aka": "Hilltop Hotel Niantic", "slim_ranking": 0.571428571429, "description": "The 90 room Hilltop Inn is an ideal location for Mohegan Sun Casino guests, Camp Rell, Millstone, wedding groups, Mystic attraction guests, US coast guard academy, Pfizer, Foxwoods Resort guestd, beaches, Newport, Niantic visitors, East Lyme visitors, US Sub base and tours. Enjoy full hot breakfast every morning."}