{"user_rating": 4.0, "review_count": 843, "name": "Hilton Los Angeles Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Top of the line Hilton; elegant and classy. This huge property has friendly, personal service despite its impersonal appearance. Many good restaurant options. Sydnee at front desk is great (thanks Sydnee!). Drive up to entrance loaded with cars, buses, and bustle, and a suited employee greets you and assists in what would have been a stressful mess. Reasonable rates. I wish I could have stayed here instead of the N. Highland Hilton Garden Inn for all of my stay in LA. This hotel is a great value.", "title": "Big and Classy", "helpfulness": 1, "user": "DrSGPrice", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181138191}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The free shuttle bus from the airport was prompt and the driver was very helpful. The hotel was very smart and clean, the room was very clean and well appointed (no internet though, unless you pay). The staff were really helpful and overall we had a great stay. I don't think that you'd want to holiday here, as there isn't much in the neighbourhood, but for sleeping after a long haul flight we found it perfect.", "title": "Excellent hotel for a night after a long haul flight", "user": "C2580", "date": "October 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181111985}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Not luxurious, but very nice in every way. As with many Hiltons, everything’s a little pricey ($12.95 for wifi? Glad my phone does tethering!). Still, it was clean and quiet and convenient.", "title": "Superb; nice folks", "user": "MikeMorton", "date": "October 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181089264}, {"rating": 3.0, "title": "Yearly trip", "text": "We got a room for $127 including tax. No idea if that’s unusual.", "user": "Merrick F", "date": "October 15, 2013", "id": 181074800}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Our yearly trip this was to LA, my GF wanted to stay here not sure why but this is where we stayed. Nice hotel, excellent but pricey. On the upside it's close to the airport LAX but that's it for me. Was afraid to try the restaurant if fair of there prices on the back of the $ 27 daily parking fee after being told that it would have been for the duration of the stay. Got out even though was a drive away with the LA traffic had rhe chance to go to Chinatown, the walk of stars, The Staples Center area, the Hollywood sign and the Universal Studios for HNN. So was a good time away from the hustle of work week.", "title": "Expectations can't be high for airport hotel, but.....", "user": "gotchalks", "date": "October 14, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 181055450}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This is a generally nice hotel and very convenient. Parking was easy and check-in was a breeze. The bar in the lobby is a touch expensive but this is LA so you can't expect cheap drinks. We were at the hotel for the weekend to get away. We were able to drive to Malibu on Saturday for a delightful drive along US1. Dinner was a short walk away from the hotel and there are plenty of options close by.", "title": "Should have been better...", "user": "PandL60606", "date": "March 19, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 155071934}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "When we returned to our room we discovered that we were missing a glass. It hadn't been replaced by the maid. No worry, we asked for another and that was that. What we didn't notice until the morning was that our bath towels were not replaced. That is also when we discovered coffee wasn't replaced and that there was a used wash cloth in the shower. So obviously the only \"cleaning\" that was done was a quick make of our bed and nothing else. We called the front desk to get some towels but those took 20 minutes and we were already running behind.", "title": "Fine but not quite expected Hilton service", "user": "tuctrohs", "date": "March 19, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 155053579}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "If you like to work out the fitness center is excellent. We were on one of the upper floors so getting an elevator wasn't too tough. However, in the morning during check-out time, if you are on one of the lower floors expect that you might have to wait a minute for an elevator going down that isn't already full.", "title": "Good stopover hotel. Odd tanoy message", "user": "Blaeu", "date": "March 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 155037194}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "If the maid service had been better the rating would have been different for sure. But when I can't count on the cleanliness, well, that matters a lot to me.", "title": "Not quite up to their normal standard", "user": "bill186383", "date": "March 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 155030723}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The hotel is nice and the shuttle ride short. But both times I rode it it was very full--packed with people standing and sitting, to the point that it was a major operation to make way for people to get out at their stops. And some people had to wait for the next shuttle.", "title": "Great place to stay before a morning flight", "user": "Kathy504", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155020061}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "I checked into this hotel, room 1712 at 12.30 am.", "title": "Too noisy!", "user": "susaninsydney", "date": "October 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 180840372}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "While the room was very well appointed and the staff very helpful I was unable to sleep a wink from the noise of the planes taking off and landing.", "title": "Wonderful stay!", "user": "Ben M", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180781450}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "So, if its sleep you need this isn't the place.", "title": "Okay but not very hospitable", "user": "areopagus", "date": "October 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 180777405}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "As I checked out I told the young man my compliant. His reply was that we put people in those rooms as they are high and have a beautiful view.", "title": "I rated this hotel excellent", "user": "Shirlnle", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180732090}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I didn't come here after being at the airport on standby for 6 hours at 12.30 am for the view!", "title": "Excellent room and facilities", "user": "Brian R", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180607194}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "It also comes with your typical Hilton extra charges. $10 extra for in-room WiFi? $27.95 per night parking fee....BUT....if you are flying out of LAX for 2 days you only pay $26 ($12.95 per day). Why? Because we allow you to take your own car out of our garage when you want and how often you want....not valet....self park.", "title": "Typical Hilton Quality but....", "user": "lurch1", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 155757977}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stuck with the $27 fee the first night but smartened up and left it next door at the LAX airport park for $9 the second geesh. This jaded me so much I forgot how nice the rooms and the lobby was.", "title": "Missing the point", "helpfulness": 1, "user": "mikeyHongKong", "date": "March 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 155572453}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "People who stayed at this hotel were rude....talking and laughing loudly after midnight in the halls and before 7am without regard to other sleeping guests. I suggest Hilton up their rates....the riff raff is getting in. The noise from the heavies taking off didn't bother me...it was the rude guests.", "title": "Nice Airport Hotel / Shuttle Service is a bit iffy...", "user": "crazyhotelguy", "date": "March 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155543591}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The rooms are very comfortable and the staff are efficient and friendly. But had to wait well over 30 minutes for the shuttle to collect us on arrival. Other guests including elderly guests were furious with telephone calls to the hotel about the shuttle going unanswered. The management has to understand 2 things - first this is an airport hotel not a conventional hotel. Having conventions and balls does not help but makes life difficult for people who want to check in or check out quickly. Secondly the shuttle is very important. The bus that was used was ancient and frankly someone will hurt their back or knees lifting their bags up 3 steps into the bus. The drivers are excellent and do their best but the buses are too old and too small and too high off the ground. One bus at night is not enough. There is a problem when it takes over 1 hour to get to your room from the arrival hall. Fellow passengers should think seriously about smaller hotels at the airport as this one doesent work well.", "title": "OK hotel for business travel", "user": "Grizz99", "date": "March 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155401193}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "I stay at this hotel once every couple months. I find it convenient as I can return my Hertz Rental Car here, stay the night and head to the airport in the morning.", "title": "Do Not Hesitate Staying For Layover", "helpfulness": 2, "user": "4Schus", "date": "March 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155317139}, {"rating": 1.0, "title": "Terrible!!", "text": "We checked into the hotel for the evening after a very long flight. They gave us a room next to the elevators. We didn't realize how noisy the room was until we went to bed ...midnight. The airplanes were noisy but not near as bad as the noise from the elevators going up and down. Impossible to sleep. The next morning we complained at the desk and was told we should have come down to the desk that night and we would have been given another room. The manager didn't even have the courtesy to come out of his office and talk to us. If they had other available rooms, then why would they have given anybody a room next to the elevators! Never again!", "helpfulness": 1, "user": "CAB1951", "date": "October 14, 2013", "id": 181000059}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We arrived after a 12 hour flight and the usual emigration slow down at the Airport, had a little trouble finding the free bus but once we had all started to go well, the driver helped us with our cases and smiled !, Reception was easy and we were soon in our room, we would have slept on the floor we were so tired but the bed was great,bathroom clean and roomy.Its a busy place but we were not bothered by noise we didn't eat as we had an early start so no idea about the food, bought some water in the shop which was overpriced as always in Hotels.", "title": "Just right for the Airport", "user": "samsy51", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180983916}, {"rating": 3.0, "title": "Unhappy with the moldy grout around the bath tub", "text": "Happy to stay there again.", "user": "A TripAdvisor user", "date": "October 14, 2013", "id": 181082940}, {"rating": 5.0, "title": "pre and post trip stays", "text": "Overall, the room is very clean and the decor is modern. They need to pay more attention to the bathroom. The grout around the bath tub is moldy. It needs to be cleaned with Clorox or redo the grout. I found the room is a bit noisy. I could hear the noise came from the hallway all night long. Besides that, the hotel offers good value and the location is perfect when you try to catch the morning flight from LAX.", "user": "A TripAdvisor user", "date": "October 14, 2013", "id": 181083206}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Location wasimportant as well as shuttle service. the price was very reasonable as we were there fewer than twelve hours both times. tv system was a little difficult - remote was changed which helped -", "title": "Good, but not godly!", "user": "m d", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180879369}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Stayed here on the way to Denmark. The bus from airport was a bit slow but once we got to the hotel things were wonderful. We had a great room on the executive floor and were not bothered at all by the planes, which was odd as we were so close.", "title": "Great sleep", "user": "applejuice12", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 180543853}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "This was my third stay at the Hilton LAX. I have found it a reliable choice when arriving from a long haul flight from either New Zealand or England. It is so convenient being able to hop on the hotel transfer and arrive within five to ten minutes at the hotel. Check has always been quick and efficient and a good night's sleep is guaranteed, with the most comfortable hotel bed!", "title": "Reliable hotel choice.", "user": "MezzyMay", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180520437}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I will definitely stay there again when needing to transit overnight in LA.", "title": "Treated with luxury", "user": "Tom H", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180547440}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The hotel staff treated me like I was important and belonged in a high class hotel. Questions were answered quickly and with a smile. Arrangements for the conference were handled very well and every detail was addressed.", "title": "Good location for sightseeing at a reasonable price", "user": "peteabh", "date": "October 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 180303665}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Fully equipped room of a 4 * standard in a great location near to the airport and convenient for sightseeing Hollywood, Santa Monica & Venice beach areas. The price is very competitive but parking a little expensive.", "title": "Close to the airport but not good sleeping", "helpfulness": 1, "user": "skline2", "date": "October 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 180294038}, {"rating": 3.0, "title": "Nice and clean, but have gotten better amenities for less money at other places", "text": "I stayed at the Hilton for business at the end of Feb. It was a nice place, big, and clean. I was able to stay on one of the upper floors for Hilton rewards members so I cant speak to what the regular rooms are like. It was a king bed and the room was very spacious, but the bathroom was pretty small, open the door and there is the toilet and it was only the length of the tub. The room was clean and comfortable with a desk and an arm chair and ottoman. There was a coffee maker but no fridge or microwave so I was disappointed in that.", "helpfulness": 1, "user": "Emily S", "date": "March 20, 2013", "id": 155204744}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "There were some restaurants and a small bistro type place to get food, along with room service.", "title": "A Three Star with Four Star Service!", "helpfulness": 1, "user": "annereviews", "date": "March 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 155198610}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Staying in the Hilton rewards floor got me access to the lounge on the top floor that had a continental breakfast and happy hour at night. I was traveling with my boss and she had previously stayed there with the rewards and had said that it was free drinks during happy hour, however when we went we had to pay for drinks. Also, the breakfast was pretty lame. Just some pastries, fruit, bagels, yogurt and coffee/juice. No eggs or breakfast meat. That was very disappointing. I have staying at other hotels that were at least $50 cheaper a night with better breakfast selections for free. Also, the internet was not free. I think it was $12.95 for 24 hours. Again, I have stayed in cheaper hotels that had free breakfast and free Wi-Fi. Heck, you can get free Wi-Fi at McDonalds these days, so I think its nuts that some hotels still charge for it.", "title": "good airport hotel", "user": "StephenTW", "date": "March 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155122286}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The fitness room was pretty nice. It had about 6 treadmills and a few elliptical machines and a whole weight area.", "title": "Typical", "user": "scott m", "date": "March 19, 2013", "detail_rating": {"value": 4.0, "sleep": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 155119849}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "My room also over looked the airport. When I went to bed I could hear the planes and was worried it would keep me up because I need it pretty quite to sleep, but it wasn’t bad. They weren’t that loud and I was able to sleep just fine.", "title": "Like home .....", "user": "Ben R", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155118134}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We were flying back in from Vail, CO before driving up the Big Sur coast and just needed somewhere to rest our heads. This hotel fitted the brief perfectly. Reception open 24 hours, breakfast from 6 am, gym open 24 hours. Close to LAX with a shuttle if required. Reasonable tariff, comfortable room. Would recommend.", "title": "Pretty good for a stop over hotel", "user": "jessie19570", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155311987}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Only stayed 1 night but room was very clean and excellent bed. Executive area was clean, nice and friendly. Adequate food and Bev choices. Shuttle to LAX every 20/30 min. Great place to stay before morning flight.", "title": "Close to LAX", "user": "Ironman91", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155236527}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Stayed on the executive floor Feb. 23-24. Website advertised \"non-alcoholic beverages and bartender service\". What that meant was what all the rest of the world calls \"cash bar\" for alcoholic drinks. Several people, including myself, were surprised to find they had to pay for alcohol. Come on, Hilton, use the industry standard term so there is no (deliberate?) confusion.", "title": "Misleading or Just Confusing?", "user": "tresdar", "date": "March 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 155210817}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Poor bartender was the only person there and had to race around cleaning up, call for more food, handle everything while a decorative lady sat outside taking room numbers and buzzing people in and doing nothing else. Talk about \"lean staffing\"--completely unfair to bartender/jack of all trades, who was very polite and never complained or acted upset at all and worked like a demon--a good man. There was little food (thick crust pizza--good) and the bartender had to call down for more, which took 10-15 minutes to arrive. Not particularly generous on the hotel's part and seemed like deliberate. The next morning there were two people working and all was much smoother and food was much more bountiful.", "title": "Great airport hotel", "user": "646Jacqueline", "date": "March 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155208148}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "bathroom had unpleasant plastic-looking counters and looked remarkably cheap. Great location but could use a little more class. Clearly there are many travelers at all times of the day or night, but that's no reason not to make ambiance a little nicer. Not what I expect in a Hilton. Registration staff pleasant and helpful.", "title": "Impersonal Hilton", "user": "PsychSanAntonio", "date": "March 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 155207431}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 3.5, "variance": {"poor": 51, "average": 197, "very good": 360, "terrible": 20, "excellent": 215}, "aka": "Hilton Los Angeles Airport Hotel Los Angeles", "slim_ranking": 0.223642172524, "description": "The Hilton Los Angeles Airport, located adjacent to the LAX International Airport, is your Gateway to Los Angeles!"}