{"user_rating": 4.5, "review_count": 193, "name": "Hilton Garden Inn Alpharetta", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Upon entering the hotel, it was a nice experience to walk into a welcoming atmosphere.I arrived 6 hours ahead of check in and to my amazement, I was able to check in, which was great considering I had just experienced 16 hours worth of traveling. Hotel staff was wonderful and extremely accommodating. When I had to leave on an emergency, they immediately assisted me with my transportation and other necessities. Much appreciated.", "title": "Professional, clean, comfortable and quiet", "user": "Cindy W", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158791385}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "great hotel for anyone. very clean, pleasant and QUIET!! we were there with 3 high school teams of boys lacrosse and no one had a clue. the hotel was so wonderful to work with all the teams and parents to get them all breakfast in a timely manner.", "title": "wonderful hotel", "user": "momongo", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158198801}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We were here for a 100th Birthday and our entire family stayed here. The room were", "title": "This hotel was outstanding and all the staff made sure your stay was a great one. Breakfast was outstanding", "user": "WilliamH605", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157453028}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "very clean. The staff both day and evening were all outstanding. They always asked if everything was okay and was there anything they could do just let them know. We will stay again for sure. The price value was outstanding. We did the breakfast special and it was well forth it full cook to order breakfast.", "title": "a really great stay", "user": "Ketket27", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156911962}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "i have to admit that this hotel was really great. it was nice and clean and very quiet. a really wonderful experience. i cannot complain. We arrived at the hotel and the front desk was really helpful and friendly. we had a king sized bedroom but requested for a double bed and it was given to us with no problems at the same fee. The room was a great size for two ppl. and it had everything you needed. The only thing i didn't like about the hotel is that you will have to pay $10 for breakfast. all you can eat that is. i have never done that in a hotel and thought that breakfast are usually included but i guess not. 'overall, i had a wonderful stay and i would definitely come back to this hotel.", "title": "Unreal service", "user": "Barnesy870", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156681610}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "This hotel has the best customer service of any hotel I have ever stayed at in the US. Every single member of the staff, regardless of position, was friendly, helpful and professional. If your travel puts you in the area of the Winward Plaza Hilton Garden Inn you will be very pleased with your stay. Their hot breakfasts were fantastic and included an omelet station.", "title": "Best customer service experience", "user": "swatts1", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158859647}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The entire setting was disappointing. The food was only OK and the billing was incorrect. The bathroom backed up the last night of my stay. The facilities for conferences were nice and the provision of evening snacks were quite nicely done.", "title": "Not up to my expectations", "user": "Pat R", "date": "April 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 158859645}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "I love staying at this hotel. The staff is polite and very helpful. The rooms are clean and well maintained. The food was great. We used the shuttle and the driver was willing to take us anywhere we wanted to go and prompt in picking us up.", "title": "excellent", "user": "Anne H", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158859783}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I can't recommend this hotel enough! The room was immaculate and we appreciated the little touches (microwave, fridge, cookies). The customer service was the best, especially Johnathan and Nicole who helped us with recommendations in the area. We'll be back!", "title": "Wonderful experience!", "user": "Susie T", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 158628076}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I cannot stress enough how very friendly and accommodating the awesome staff is at the Hilton Garden Inn @ Windward Plaza! My husband, children and I have stayed here on numerous occasions and have found it to be a very pleasant experience, all the way around. Staff is top-notch (particularly Jonathan and Stephanie), breakfast is always great, with widespread variety, rooms are very clean, and beds are comfortable. Don't have a single complaint!", "title": "HIGHLY RECOMMEND!!", "user": "AprilPMomof3", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158484912}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The hotel room looked old. The textiles were frayed and very worn. The TV/cable was out all night for select rooms. No jacuzzi. Small pool, small gym. The ice machine was broken and the lamp and clock were also in need of repair. The staff allowed a sports team to check in at 3am. This was a huge disruption to guests that were sleeping. Staff forgot wake up call and I had a meeting. I liked the express check out because at least after waking up late and packing the car I could get out fast.The staff was very friendly and helpful. I also liked the lobby area and hospitality touches. I kept smelling smoke in the elevator and common areas which was annoying for a nonsmoker.", "title": "Hotel lobby looked nice, but many problems with room.", "user": "Business100", "date": "March 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 155760644}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "This hotel is conveniently located to the local highway. The lobby has been completely updated and modernized. The only reason why I won't give it five stars is because the rooms have not been updated. But, the room was in extremely clean condition, as well as the nice down comforter and other furniture. The bathroom was also extremely clean. Honestly, I don't care what modern era a room is furnished in as long as it is clean. The breakfast buffet in the morning was a delight to partake because of the very accommodating chef and staff in the brightly lit lobby area. Although the buffet is listed at 10.95 a person, you can custom order anything you would like and it is received with a smile. Great experience all around for my short stay.", "title": "Friendly staff and very clean rooms", "user": "13fred2000", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155749542}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Paul (Front Desk) was so very helpful and accomodating during my stay. He helped me out with all of my (many) requests upon arrival. The facility itself has a nice crisp feel to it. Will definately return. Lots of shopping & restaurants right across the street. Will definately return for another staycation w/ my family!", "title": "Great Hotel to Visit!", "user": "Chrystal B", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155717140}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Stayed here for business for 3 nights. Check-in was a breeze. Room was very clean, bed was comfortable. Internet blinks out periodically, but that happens. There was a point on the 3rd night where I was sure I could smell cigarette smoke, but it went away after awhile. Breakfast was nothing to write home about - thin, dry bacon, dry scrambled eggs. Next time I will stick with bagels and yogurt. I would certainly stay again.", "title": "Comfortable", "user": "_PheobeK_", "date": "March 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155486291}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Went there on a business trip for 5 days. At the check-in we talked with Paul, who provide us great information about the place and gave us a perfect services. Breakfast were part of our package deal, simplified our trip. Room was clean and large with a king and comfortable bed.", "title": "Perfect hotel services", "user": "Keven85", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154131782}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "It was bang for the buck,We represent south Asian community so location was good.Well connected with Freeway & hotel amenities was very nice.We had our breakfast cook to order that was a very good service when you have picky small babies.", "title": "Had a good Experience", "user": "Ruchika A", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157102524}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The entire staff here are very friendly and accomodating. Stephanie at the front desk was very friendly and suggested we add the breakfast to our room for a few extra dollars the night we checked in.We enjoyed family friendly breakfasts of made to order pancakes and omlets, cooked by a very accomodating chef, Larry. Umrrous other options we also available. He was not only an excelent chef but also very friendly and also suggested activities for us. During the day, we met Rob, the manager, who was outstanding in sugesting travel routes, activities and the use of the shuttle to get around. Everyone we met, from the room attendents, shuttle driver and maintenence staff all were always friendly, smiling and asked about our stay here and our activities. During our down time we spent some time at the indoor pool. We enjoyed our stay and look forward to our next visit. We would definitely stay here again.", "title": "Mac Family Vist", "user": "Billmac22", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156547410}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Rooms are very nice and the bed is the really comfortable. The service is first class. All the people that work there from Larry in the kitchen to the servers, front desk, housekeeping and other workers all treat you like they care you are there. The breakfast every morning is terrific, the gym is decent and the small amenities like bottled water and cookies round out the experience. If this Inn is looking for an improvement they could offer a gym deal with area gyms nearby for those who want a more hard core workout than what the hotel gym offers.", "title": "Business200", "user": "MikeS685", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156440508}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The service is excellent including - front desk, restaurant and shuttle. I really enjoyed me stay here and was a great experience. The food was excellent. The chefs are kind enough and too patient to bring variety to food. I want to thank everyone, will definitely choose this hotel whenever I get a chance again.", "title": "Nice experience", "user": "Sakshi A", "date": "March 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156135455}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Chef Larry takes the hotel dining experience to the next level. When you come downstairs, ready to hit the day hard, he welcomes you to the kitchen as if he was your personal chef. The taste of the food aligns perfectly with the concierge-level service, and I look forward to coming back again on business.", "title": "Phenomenal breakfast experience", "user": "Gerrod", "date": "March 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 155877770}], "location": {"country": "United States", "city": "Alpharetta"}, "stars": 3, "variance": {"poor": 5, "average": 21, "very good": 54, "terrible": 2, "excellent": 111}, "aka": "Hilton Garden Inn Alpharetta Hotel", "slim_ranking": 0.0714285714286}