{"user_rating": 4.5, "review_count": 236, "name": "Hilton Garden Inn Calabasas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I stayed at this hotel for a week while my son attended a camp in the area. I'm not terribly familiar with Southern California and wanted a safe place to stay since I was traveling alone with my two children. I was thrilled with this hotel. It's in a beautiful, safe area that is close to the freeway but far enough removed that you hear no noise and can't even see the freeway from the hotel. The rooms were large and immaculate. I couldn't have been happier with our choice! Will definitely stay again if we're in the area!", "title": "A great stay!", "helpfulness": 1, "user": "3sweetpeasmom", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168772698}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I had the opportunity to stay at the Hilton Garden Inn Calabasas for a week long business trip with 14 other people. The hotel was great for our group. The rooms were clean and spacious, the hotel staff, especially the front desk were an amazing group of people. Breakfast was a wonderful since I never knew when we would break for lunch. I was able to use the pool and workout facility, which was a nice addition. The location was great and we even walked to local restaurants a few nights when we didn't eat at the hotel. If business brings me back to this part of CA, I would return and stay at the hotel.", "title": "Business can be pleasant!", "helpfulness": 1, "user": "Suzy J", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168594283}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "the staff was always smiling and eager to help. the rooms were very nice and everything was clean. great snacks , flavored water and starbucks coffee that were complimentary All in all it was well worth it", "title": "was pleasantly surprised", "helpfulness": 2, "user": "Michael S", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168663448}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "It was a first class expperience. What more can I say? We felt very much at home and were greeted fondly by the staff. The rooms were clean and we found the bathroom always very clean. Also, the pool was kept at a nice temperature and our visiting grandchildren thoroughly enjoyed it.", "title": "bill's review", "helpfulness": 1, "user": "William V", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168366637}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "This place sets the standard for the Hilton Garden Inn chain. Rooms are very clean and very inviting. Great for business travelers or families. Would definitely reccomend to anyone in this area looking for a place to stay.", "title": "Wonderful Rooms", "helpfulness": 1, "user": "4doodlebugs", "date": "July 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 168306054}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Highly recommend this hotel. We had such a wonderful stay ,absolutely beautiful and very friendly staff. Such a beautiful area and shopping right around the corner. Dining room very nice and the food was very good!", "title": "Wonderful stay!", "helpfulness": 1, "user": "Lisa S", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165124033}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "There are a couple of people that work at this hotel that are very good at remembering people who have stayed there previously. It's always nice to be remembered. The fitness center has been upgraded. It now has a nice set of dumbbells rather than the antiquated do-all machine.", "title": "Excellent Service", "helpfulness": 2, "user": "Gayle L", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163936166}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Great location, great rooms, great free wifi, and very very good service. Mediocre breakfast--but as an added bonus you can walk from the hotel over to the Commons Mall next to the hotel property, a casual and easy few steps away!", "title": "Convenient Calabasas", "user": "Dianawallah", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163627007}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Hotel employees were helpful and check-in/out was as easy as it comes.", "title": "I will be back.", "user": "Arthur G", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163238076}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Bathrooms were very clean. Beds & linens were super clean and seemed very new. We had a room that overlooked the entry area and it proved to be very quiet. Front desk said it was the quietest and they were right. Windows were tight, AC was very quiet. The hallways were quiet.", "title": "Outstanding Food and Service!!!!", "user": "Ed F", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163102773}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The hotel is very nice and the staff is wonderful. It is in a good location with many restaurants within walking distance. The quality of the breakfast is very good. I would recommend staying at this hotel whenever you are in the area. I will be back.", "title": "Great stay, good location", "helpfulness": 1, "user": "Scott P", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 168366927}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "My husband and I found ourselves in Hidden Hills, CA at 9pm at night without a hotel. We stopped at the Hilton Garden Inn and took their last room. My husband needed to use the business center, and there was a small convenience store with personal products and snacks. In the morning, I opted for a small breakfast and was not charged for the whole buffet. All through the experience the hotel staff was extremely helpful and courteous. The room was very comfortable. If we are ever again in that neck of the woods, we would definitely stay there again.", "title": "A wonderful experience", "user": "Bonnie B", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168094085}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Just spent five nights at this hotel with my wife and two young kids. It is a wonderful place to stay. It is very clean, and the people are very friendly. Our room was a good size but not huge. We had enough space to put a porta-crib which we brought with us. There was also a nice little pool outside which my six-year-old really enjoyed. The pantry in the lobby was a great place to purchase snacks and drinks. And there was always fresh water -- and sometimes cookies -- set out in the lobby. Parking was out front, free, and very convenient. You have to take your own luggage in and out but there were plenty of carts available for that. The location was ideal -- right off the freeway, near lots of restaurants, and in easy walking distance to an outdoor shopping mall with a Barnes and Noble, a movie theater, a Corner Bakery, a drugstore and more. Be sure to check out the pond at the top with all of the turtles. My kids loved it. Also, as they tell you when you check in, the entire city of Calabasas is smoke free. The only downside I thought was that the breakfast was good not great. There was fresh eggs, pancakes, etc. and you could make your own waffles. It probably would have been fine for a morning or two, but it got old after a while so we went out. The selection of pastries and fruit was limited, and the bagels were freezer bagels. Also, you got one small cup of coffee poured for you, and it was hard to get another one. Not a big deal though. I am out in LA fairly often, and I would definitely stay here again. The setting is such that you feel removed from the hustle and bustle of LA.", "title": "A wonderful place to stay", "user": "Mike S", "date": "July 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167816448}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Friendly, very helpful staff. Super clean, nice rooms. Top floor, back of hotel is very quiet. Nice pool. Nice business center open 24 hours.", "title": "Pricey, but a GREAT HOTEL", "user": "katdod50", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166929657}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Breakfast not included in room charge, so we didn't eat at the hotel, thought it was too expensive. BUT the hotel is within walking distance to a very nice shopping area with several fun restaurants and lots of shops and a movie theater.", "title": "Romance", "user": "Rich P", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 167004305}, {"rating": 5.0, "title": "Great hotel", "text": "Breakfast staff were very attentive. Food good. Comfortable beds. The front desk staff welcomed us warmly and had our room ready. The air conditioning was great in the hotel. This was essential as the weather was scorching that day.", "user": "A TripAdvisor user", "date": "July 7, 2013", "id": 166697634}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This is a lovely hotel, tucked in behind a shopping district - making access to restaurants and entertainment super easy. The room was clean and pleasant and quiet. Don't look for early check-in here, unless you want to be made to feel insignificant. My only problem was with the nasty young lady at the check-in desk who indicated that our \"room rate\" didn't allow for early check-in (2hrs), but \"allowing\" us to change in the hotel restroom for our 3pm event.", "title": "Good, with One Exception", "helpfulness": 1, "user": "A D", "date": "July 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166697180}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This hotel was a great find, with prices lower than those in neighboring areas. Hotel staff could not be more helpful and the rooms are large and comfortable. We have stayed here twice in this past year and have not been disappointed. Breakfast that comes with room is much, much better than most. One can order any kind of eggs or omelet that gets delivered to your table, in addition to the buffet.", "title": "great find", "user": "Susan B", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166577261}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This is a very good moderately priced hotel in the Calabasas area. There are a mix of casual weekend and business guests. The Commons shopping center is located within walking distance and has everything you will need including a supermarket and Barnes and Noble. The hotel has a self service laundry room which I really like for doing my own wash.", "title": "Good hotel and value", "helpfulness": 1, "user": "Raymond L", "date": "July 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166361281}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel lobby was nicely designed. The staff was nice and speedy with check in. The room was very clean but smelled a bit odd. I think it was just the cleaning products that were used. The a/c was a bit complicated to work. It appears that you are to look at the actual a/c unit to turn the temp down, but you are really supposed to go to the thermostat on the wall across the room to turn down the a/c temp. I called maint and was told that guests get confused all the time regarding working the a/c. They should make it VERY clear that the wall thermostat is where you regulate the room temp & not use the actual a/c unit to try and adjust the temp.", "title": "Good Hotel/Decent Price", "user": "Danielle R", "date": "June 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 165276531}], "location": {"country": "United States", "city": "Calabasas"}, "stars": 3, "variance": {"poor": 3, "average": 16, "very good": 88, "terrible": 8, "excellent": 121}, "aka": "Hilton Garden Inn Calabasas Hotel Calabasas", "slim_ranking": 0.2}