{"user_rating": 4.5, "review_count": 1291, "name": "Hilton Moorea Lagoon Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "First, it was our honeymoon and the trip was absolutely AMAZING! The hotel is unreal! We stayed in a bungalow over the water and it was truly incredible! Rooms are IMMACULATE! We had breakfast included in the package and it was unbelievable!! For those who love to snorkel (which we did almost 5 hrs a day) all you have to do is jump right off your deck and you are in crystal clear water. The water had to be at least 50 feet in clarity! We saw a spotted eagle ray, sting rays, all sorts of fish, and even a few sharks (black tip reef shark). The sharks are harmless and there have NOT been any known attacks on the islands so no worries. They also feed that sharks at the Crepe bar. I recommend doing the duty free liquor in LAX to save money and then walk to the local store by the hotel to stock up on food and drinks if you want to save money (take a right when you leave the hotel and only 15min walk). Everything is super expensive at the hotel so be prepared. We ordered from the pizza joint everyone recommended and it was fantastic (see reviews below on name of place). Only thing I can criticize is there is no free Wi-Fi which is sad this day and age. Other than that it’s truly from a fairy tale. It may be the prettiest place on earth as far as ocean dwelling!", "title": "Magical Trip and Prettiest Place on Earth", "helpfulness": 1, "user": "flightkid", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84691905}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We spent 7 nights in a garden bungalow & it was wonderful. We never heard roasters - our bungalow was near the lobby which was very convenient. It was extremely windy. maybe 50mph winds. Crepe Bar - AWESOME! but sometimes needed to close b/c of the winds. Try to get breakfast included - approx $45USD/person. We had lunch every day at the restaurant on the beach at the hotel. Food is VERY good! We did the couples dinner on the beach w/tiki torches $400 total. It was very romantic and worth the experience. We also did the BBQ Buffet - Awesome! All you can eat bbq buffet (food is extremely good quality), bottle of wine, and a show. I would highly recommend it. The Hilton was in the best location on the island. It has the best lagoon. The fitness was not very good. But then again, you can run on the beach. We rented a car for the day to explore Moorea. We stopped at this shack for lunch (SNACK MAHANA). Maybe the best lunch we had in Moorea. The tables are right on the water and the food was fantastic. We had grilled Mahi Mahi. I would highly recommend going.", "title": "FANTASTIC Hotel in Moorea", "user": "PreppyBoston", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84384637}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We had a wonderful honeymoon and experience at the Hilton Moorea!", "title": "Fantastic Resort", "helpfulness": 3, "user": "NJ_Traveler_001", "date": "October 21, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 84276079}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We probably would have been okay at any of the resorts in Mo'orea. We drove around the island on a dune buggy and took a glance at all of the resorts, and they all looked very nice. They checked us in and escorted us to our overwater bungalow, right in front of the bar on the deck. I was a little worried about the noise, but the bar closes around 10PM so it was more of a convenience rather than an annoyance. We had such delicious food at the restaurants on the island (Rudy's, Le Mahogony--Chinese, the Hilton), that we never had room for the tasty-looking crepes at the bar. This was the only place that surprised us with honeymoon champagne in our room. There was unfortunately a hole in the bucket, and the table and floor was soaked when we walked in. It wasn't a huge deal to us, and they sent a crew to clean it immediately. Breakfast here was as good as it was at all of the other resorts we stayed at (i.e. great), and you should definitely make sure that breakfast is included in our package. When they have their Polynesian dinner shows, get there EARLY (before 7PM) because everyone has the same idea that you do and you may end up sitting really far away. When choosing resorts in French Polynesia, don't pick the ones that are on private islands off the mainland. You won't have this problem at the Hilton Mo'orea, but most of the other resorts on other islands were on small motu (islands) off the coast of the main islands and we ended up being held hostage by the ferry schedules and fees. That's the main reason why this was our favorite resort of all the islands. Whenever we wanted to do anything, we just left the resort and did it. We drove our dune buggy around the entire island (about 70km) and up Mount Belvedere. There is a great little abandoned shopping center (Le Petit Village) on the west coast of the island where the Club Med used to be. There are a lot of cute little shops and restaurants there that aren't overloaded with self-righteous and hedonistic tourists. We had a fantastic authentic lunch at Restaurant Le Miri Miri in Le Petit Village. Back at the hotel, the activities were great. The Moana Lagoon Excursion with Picnic (operated by Albert Transport) was fantastic. The hotel has their own version of this trip, but Albert Transport's version was great. They picked us up at the hotel, took us snorkeling for sharks and stingrays, cooked us an amazing meal, and the tour guide even secretly showed us how they celebrate 4:20. Tiki Village is a must see (great food and a great show), but it starts out with an annoying tour of the souvenir shops. The Hilton took us parasailing and wave-running, both of which were great. The fitness center was small and abandoned, but good enough for some cardio. My one complaint is that the pool sucked here (small and no swim up bar), and the jacuzzi was broken. Other than that, the hotel was great. My wife and I would definitely say that the best part of our FP trip was in Mo'orea. I won't say that you must stay at the Hilton since all of the resorts here look great, but you will definitely be happy here.", "title": "Amazing!", "user": "basbc4", "date": "October 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84246809}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Can't say enough about this resort! We has a wonderful time. Everyone is friendly and helpful, especially the woman at the excursions desk. I would recommend leaving the resort for dinner. Most restaurants provide free taxi service. We loved Mohangany. Excellent dinner for reasonable price (relative to the island, or course). We told them it was our honeymoon and they gave us champange and fresh fruit one night and another night they decorated our room with flower petals and drew a bath for us. The crepe restaurant was pricey but awesome. Then again, if you are staying in Moorea or any other island, you are not going there because it is inexpensive.", "title": "Would stay elsewhere...", "helpfulness": 1, "user": "txslonghorn", "date": "October 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 84243516}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We enjoyed EVERYTHING about our 6-nights stay at this Hotel!!", "title": "Excellent Stay!", "helpfulness": 1, "user": "gccc116", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85494064}, {"rating": 5.0, "title": "Absolutely wonderful place to stay", "text": "All our requests were met! The rooms had fantastic views and were newly updated. Snorkeling was great (just like what everyone else said), as well as kayaking! We enjoyed watching the sharks while dining at the Crepe Restaurant (delicious) at night! The staff was very accommodating, helpful and friendly. Did not meet a single rude employee. Every morning, we enjoyed the fresh buffet breakfast and its great selection!", "helpfulness": 1, "user": "retiredVictoria", "date": "October 30, 2010", "id": 85390564}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We would definitely return if given the chance!", "title": "You Can't Beat It!", "helpfulness": 2, "user": "lizzy51785", "date": "October 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84937189}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed for 5 nights at the Hilton Moorea in an over the water bungalow. Yes, it is expensive, but what a treat! Excellent snorkeling right off your patio, lots of coral heads around that harbour fish.", "title": "Service was terrible", "user": "lauraroberts58", "date": "October 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84843975}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "One tip, get a bungalow where the patio is on the leeward side,. If you have one on the windward side and the winds and rain are coming down you will not be able to enjoy this great feature. Ours was on the leeward side and it made a great difference.", "title": "Great Place", "user": "sarahs158", "date": "October 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84696464}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I just returned from our trip to the Hilton Moorea. What a great vacation! Took the morning ferry from Tahiti to Moorea and then a taxi to the hotel, arriving around 11:30. Received a warm welcome at the Hilton Honors check-in desk where we were also provided with a nice beverage. This was a reward stay but we had paid in advance for an upgrade to an overwater panoramic view bungalow. Our room wasn't ready so we went to the restaurant to grab lunch and our first (of many) local beers. The burgers were great and after we made our way back to the lobby we were told our room was ready.", "title": "Great Vacation at the Hilton Moorea!", "user": "runnergirlnc", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83343887}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We were taken out to our bungalow by golf cart (it would be a long walk with bags) and were delighted to find our room was at the end of one of the \"arms\" with a great view of the water and the horizon from our balcony. Views of the sunset were fabulous. The room was great - very modern and clean and I loved the rain shower. The bed was extremely comfortable and we never had any issues with noise. Our room was cleaned every day before lunch, and we had turndown service each night while we were at dinner. On our last night we returned from dinner to find our room had been covered in candles and flowers - very romantic and unexpected but much appreciated.", "title": "OVERPRICED!!!!!! POOR SERVICE AND VERY LOUD MORNINGS!!!!!", "helpfulness": 1, "user": "sheilasandiegoCA", "date": "October 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 82806087}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The snorkeling right off our dock was amazing. We saw many varieties of large fish, a few stingrays, and lots of creatures I can't even identify. We brought our own snorkeling gear but wish we wouldn't have bothered since the hotel supplied everything you would need.", "title": "Nice hotel and location, not a great honeymoon experience", "user": "yankeedoodleCT", "date": "October 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 82803133}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "As a Hilton Diamond member we received free continental breakfast each morning which included lots of fruit, cereals, bread, etc. It was great and we took full advantage each day. We ate lunch in our room most days having stopped on the way to the hotel to buy some groceries. We ate dinner out most nights (Rudy's was great) but did eat at the crepe bar twice and loved it. Watching the sharks circle the area while we were eating dinner was incredible.", "title": "Great to swimin your own acquarium!", "user": "MaffieAustralia", "date": "October 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82790145}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We also received free wireless internet service while we were there. The service is spotty and slow so don't always count on being able to connect but it was nice being able to communicate with family via email.", "title": "The more preparation, the better your stay. All in all, good stay.", "helpfulness": 5, "user": "chirobak", "date": "October 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 82767182}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Just some background info: This was our second trip to Moorea since 2009 and we decided to try the Hilton this year. We stayed at Sofitel last year. Our review will make a few comparisons, but our opinion only. Our 5-day stay at the Hilton was followed by a 7-day Catamaran charter around Huahine, Tahaa and Raiatea (44' Lagoon from Tahiti Yacht Charter) with a 6-day visit to the St. Regis on Bora Bora. This was our 2nd Catamaran charter around the Leeward Islands and our second visit to the St. Regis. We love French Polynesia that much to do it every year from now until whenever...", "title": "A Million Little Fishies", "helpfulness": 3, "user": "The-Mystic-Bunnies", "date": "October 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83882063}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The short flight from Papeete to Moorea was filled with adrenaline, to say the least. Although only a 10-minute flight on a small twin engine propeller plane, the crosswinds were about 30-40 knots and the pilot made his approach at a 45 degree angle, nose-down. No kidding. Right before he touched down, he pulled up on the stick and yawed the plane at a 30 degree angle to the runway where the wind subsequently pushed us parallel to the runway right before the thud of wheels on the ground. As close as many of us will get to a to an aircraft carrier landing I suppose. I provide this part of the trip in detail because there is an option of taking a 45 minute ferry shuttle into Moorea, which I think we'll stick with next time. The airport is right next to the Sofitel which is why many of the Sofitel visitors opt for the flight, however, the Hilton is nearer to the cruise ship mooring/docks so many of the Hilton visitors opt for that. I dare say that perhaps these pilots are some of the most skilled in the world, though. Both of our hand prints are forever embedded in the armrests of that plane. From the airport we had pre-arranged a private taxi to the Hilton for about 30 USD$. The Hilton will arrange this for you. The drive was about 20 minutes. Very scenic drive, too. No trash strewn about as is common on the main island of Bora. Moorea is very lush, tropical and green. Every type of fruit grown on the island…even big, ripe plump avocados that put California to shame.", "title": "Amazing stay", "user": "Christine P", "date": "October 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83766092}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Anyway, the staff at the Hilton from Check-in to Check-out was extremely friendly and helpful, especially the front desk and Concierge staff. They were always ready, willing and able to answer every question and help in any way possible with any issues, plans, dinner reservations or tour suggestions. The on-site restaurant food and service was spectacular. No issues whatsoever. Service was prompt, friendly and efficient for both breakfast and dinner. (Breakfast is buffet style or you can order a la carte.) We had the meal plan but if I recall breakfast buffet for two is about 80-90 $USD. You'll save a little money if you do some type of meal plan. Of note, the gingerbread crusted Mahi was excellent, so much so that we ordered it on three different nights. The wine selection (bottles and by the glass) was very good including many selections from France, Chile, Italy and California. The lowest price bottle of 'good' wine that we found (our opinion only) was a French Pinot Noir for about $120 US. Two glasses of wine + appetizer, dinner and desert for two will fall in the $175-$225 USD range. Cocktails will run you $25-30 USD, too, whether at dinner, the bar or outside lunch-lounge. Half of that amount for lunch. It’s not cheap, but not quite as expensive as Bora Bora. (We did not venture out to any of the local restaurants for dinner since the food in the on-site restaurant was so good. However, this is very easy to arrange through the Concierge. There is a big supermarket a few minutes down the road which is infinitely less expensive but you only have a mini bar fridge in the room and no access to a microwave of any sorts. Our suggestion is to stock up on water and snacks there. You can access local currency via ATM at the Papeete or Moorea airport…don’t purchase or exchange currency at the airport (US or Papeete) since you’ll get a bad exchange rate topped with fees.", "title": "We Loved every minute!", "user": "BrendaBarton", "date": "October 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83759960}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The weather was 50/50 (rainy/windy and sunny) for the Moorea leg of our trip and 90% sunny and beautiful for our post-Moorea 13 days. This will perhaps have the most significant impact on your visit. For the most part, we lounged around our OWB most of the time, snorkeled and opted for a private lagoon tour from the on-site tour company that arranges/manages all of the Hilton tours and activities. This was specific tour was $500 US and included a tour of the local bay (Cooks Bay) followed by Ray and Shark feeding (which was better than Bora Bora's in our opinion) and a private Champagne barbeque on a Motu that had wonderful swimming and snorkeling in absolutely pool-blue water. We also had dinner at Tiki Village which was part of the 'Polynesian Show' offered by the on-site tour company for about $120 USD per person. If you can put up with the 'gift shop tour' and average buffet-style 'authentic' food and sitting at a table with a bunch of strangers, the Polynesian show is very, very good, especially the 'fire acts.'...much more so than the ones we've seen at Moorea or Bora Bora. We’d recommend it. There are all sorts of group and private tours available...horseback riding, diving, ATV tours, jet skis, agriculture tours, parasailing, kite surfing, lagoon tours, snorkeling and shark/ray feeding ranging in price from a 100 USD$ all the way up to over 1000 USD$ for the private tours and multi-day/tank dive packages. There is a dive shop, Bathy's on site. We did a couples massage - excellent spa with a wide variety of facials, wraps, massages, etc., etc. Will run you 2x the cost of similiar treatments in the US.", "title": "Best Honeymoon hotel on Moorea", "user": "lindseylovestotravel", "date": "October 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83716460}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The snorkeling at the Hilton was outstanding and much better than the Sofitel. Hence, a 'million little fishes.' Even a shark or two since the Hilton is relatively close to a sea passage. From your OWB steps, with a piece of bread, you will be surrounded by literally hundreds of tropical fish. My suggestion is to bring a can of tropical fish food. The fish have no fear of humans, so please continue to be kind to them! The beach at the Hilton is nice, but not as nice as the beach at the Sofitel. The OWB we had #102 was very, very nice and clean, however not as nice as the Sofitel's (they are newer). Both the Sofitel’s and the Hilton's grounds are spectacular (as were Sofitel's) with the same type of OWB set up - both also have very cute garden bungalows with a very Polynesian/jungle feel. Don’t stress about staying in a garden bungalow vs. overwater if you are on a budget. The OWB gets you only a different view and the ability to step of your deck into the water (too shallow to dive from most of them). You can access all the snorkeling spots very easily from the beach and can swim freely around the OWB’s. If you want to exercise while at the Hilton, they have a few high-end treadmills, exercise bikes and elliptical, along with a few weight machines and a somewhat neglected, but useable tennis court. You can also jog for a few miles (take a right out of the hotel) and not have to worry about being chased down by dogs (as was our experience on other islands).", "title": "A wonderful place to relax and unwind", "helpfulness": 1, "user": "Lovetoholiday17", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83537906}], "location": {"country": "French Polynesia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 32, "average": 75, "very good": 282, "terrible": 12, "excellent": 890}, "aka": "Hilton Moorea Lagoon Resort And Spa", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Nestled between two bays on the heart-shaped island of Moorea, is the very definition of a romantic South Seas escape."}