{"user_rating": 4.5, "review_count": 542, "name": "Hilton Mexico City Reforma", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "The only aspect this hotel had is under construction and the lobby area is noicy and uncomfortable . I expect this are finished already . This hotel is no longer belonging to Hilton and this is the reason of remodelliing", "title": "Making construction", "user": "Valencialovers", "date": "November 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144671789}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We recently spent five nights in this hotel. While our overall impression and experience was very good, a few small details marred the otherwise excellent experience. We chose it for the location, which allowed us to walk to many of the attractions we had come to see. We also enjoyed the view from our top floor room, as well as from the \"executive lounge\" where we enjoyed the nightly happy hour. The happy hour boasted excellent wine and a good selection of appetizers; people with small appetites could actually make a meal of these offerings. We also appreciated the indoor lap pool; due to cool weather, the outdoor pool was closed during our stay. The in-room promotional video talks about a wine bar in the lobby; this was nonexistent at the time of our stay. In addition, restaurant hours mentioned in the video were not the same as the actual hours at the time of our stay. And the bathroom could have been cleaner on the day we checked in; on subsequent days, this was corrected.", "title": "The devil is in the details.", "helpfulness": 2, "user": "akexpat", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142767760}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I would say that is one of the better hotels in DF area. Right in front of the Alameda park, even walking distance to the Zocalo, but a taxi is probably a better option except if you are a \"walker\". Palacio de Bellas Artes is about a 3-4 minute walk away. Shopping/Restaurants in every direction. Starbucks across the street as well as a US fast food hamburger joint. Tip: Free internet there as compared to the $$$ charged by the hotel for wifi. Also there is a Oxxo (7-11 type convenience store) a couple of blocks down the road in the direction of the Zocalo/Cathedral. Get your drinks/beers/cokes here as the mini-bar prices are WAY overpriced. One mini-bar beer is actually the same price as a 6 pack at the Oxxo!!!", "title": "Good Location, Safe Area, Great Hotel.", "helpfulness": 1, "user": "Ebayer", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142753205}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "Make sure you get a high floor as the lower ones tend to have a \"building next door view\" instead of an excellent city view. We actually got a lower floor upon check-in but since the room was missing a safe then we were moved to a higher floor. The missing safe BTW was because of maintenance issues, not theft as I had first thought : )... Although one of the bellboys did meniton that they have stolen everything/anything from the rooms, even the 32 inch flat screen TV!!!! He said that guest check in with an empty luggage and leave with a TV filled lugagge hahahah. I never thought of that : )", "title": "Good property that needs an upgrade", "helpfulness": 1, "user": "Olga B", "date": "October 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 142727527}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Rooms are what one would expect of a Hilton. Food at the breakfast/dinner buffet was good/very good although could have been little bit warmer/hotter. The turn down service at night was a nice touch.", "title": "Best central place to visit Mexico City", "user": "48marie1", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142520556}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We were upgraded, so quite spoiled. But still, a good rate, a fast elevator, excellent service. The gym is amazing, but beware, shuts early on weekends (it's an attended gym, so not 24 hours but more like a fitness center). The views from our high floor alone were worth the price of admission. So near so many things in this great city. We could walk, metro, and more to all we wanted.", "title": "Better than we expected. Great views. Nice location.", "helpfulness": 1, "user": "KiowaVT", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140891275}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I stayed at the HIlton property for business reason and was very impressed all around. Everyone was extremely friendly, the food at the restaurants were great and overall it was a very well kept hotel. I will definitely stay here again the next time I visit Mexico City.", "title": "Great place to stay!!", "helpfulness": 1, "user": "hasje05", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139667740}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I just stayed at this fabulous hotel 2 weeks ago. The service was fabulous so efficient. The property is beautiful, great views and locations is perfect. I visited the W and it was terrible.", "title": "Wonderful Hotel, Just stayed here", "helpfulness": 1, "user": "laurenjol3", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139585055}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I have to say Jose Parra the chief concierge was so kind. I forgot clothing items in a drawer in my room after I had left Mexico city for United states. He had them sent to me a few days later. Honest staff is great to have!!.. I would HIGHLY recommend this hotel, the executive floor is great to for snacks and drinks.", "title": "Very nice and clean hotel", "user": "sofia r", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 139256900}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I can not wait to stay here again.", "title": "Great place, great location!", "helpfulness": 1, "user": "CNavarro25", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138467832}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "This hotel is very big, when you enter the lobby it looks like you're in a very large hotel. As a HHonors member I checked in at the 26th floor in the Exec lounge, which is also very big. The rooms are very nicely done, lots of space and good beds. There are nice pools and breakfast is good. This is a good solid choice in the middle of town.", "title": "Huge hotel friendly staff all amenities present", "user": "tjp1994", "date": "November 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146373333}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We booked a 2 double bed room on the executive floor for our family of 5. (Officially only for 4, but the managment did not mind our 4 year old satying at no extra charge.)", "title": "Great pool at reasonable price", "user": "Brianbigger", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145671142}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Fantastic pool, great room and view. Really nice complimentary food and drinks at happy hour on arrival in the evening in the executive lounge and at breakfast for all - made this a really good value choice. Very friendly and accommodating staff. If only hotels in Europe were this friendly to wards families with children.", "title": "Excelent location, very good accomodations and excelent food", "user": "Montse450", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145184688}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed at the Hilton Reforma for a very large conference and have to say that they offer an excelent service. The food was great, the rooms are very big and comfortable and if you stay on the upper floors you have a spectacular view of the city. The hotel is centrally located with many attractions nearby, including the Palacio de Bellas Artes, museums, restaurants and the Centro Histórico, everything within a walking distance. I really recommend this hotel.", "title": "Love this hotel", "helpfulness": 2, "user": "divezuzu", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144964984}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We've stayed in this hotel twice in the last month and love it. We were upgraded to Executive floor due to Diamond status but I would gladly pay for the upgrade. The immediate check-in and warm welcome at the Executive Lounge plus the services (printing boarding passes, changing money) are a real convenience. Breakfasts were very good - not a huge selection but very tasty and the evening snacks and drinks were great. Best Margarita on the rocks in Mexico!! Large rooms with huge bathrooms - all spotless and comfortable. Amazing views of the city and distant volcanoes if not too hazy. We'll absolutely stay there next trip.", "title": "Excellent stay", "user": "Hamilton6", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144694414}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This is a large contemporary hotel with a very professional and accomodating staff located right at the edge of Mexico City's unique historic zone. If you are visiting Mexico and want to have walking access to see the old colonial buildings, the Folkloric Ballet, galleries and exhibits, this is a great place to stay on business or vacation. The hotel has a very extensive gym, an indoor and an outdoor pool, very good restaurants, efficient room service, and a number of trustworthy and well-prepared taxi drivers (this is extremely important in Mexico). At the same time, if you are on business, this location is not right next door to the areas where most corporate offices are, so on busy days you may experience some traffic. For some travelers this is compensated by this hotel's relative proximity to the airport, especially if you have an early AM flight on your departure date. One thing you should not miss: one of Mexico City's most outstanding restaurants serving authentic traditional regional dishes for breakfast / brunch / and lunch is located right adjacent to the hotel lobby. It is called \"El Cardenal\", and is independently owned and operated with a long tradition that pre-dates the hotel. People come from all over Mexico to savor the menu, and there are often long waiting lines. As a guest at the hotel you have a tremendous advantage in being able to set up dining times in advance or being able to spot last-minute opportunities to get a table. Even thought this restaurant is so well known, they have a \"fair pricing\" policy and do not overcharge. Trey the breakfast / brunch there.... with their famous hot chocolate and fresh pastries.", "title": "Well designed contemporary hotel near the historic center of Mexico City", "helpfulness": 1, "user": "GeorgeFreqTraveler", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137554093}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I'd give it a rating of 3.5 if I could. This hotel is perfectly located if you want to walk around in the Historic Center of Mexico City. The first time I stayed at this property, it used to be a Sheraton; now it's a Hilton. I felt it stepped down a little, it has lost the charm it used to have. There is wear everywhere, and details that could be taken care of are not. Bed and pillows are very comfortable and the bathroom is nice, too, and private. Room was not spotless but was clean, the rug was not very clean throughout the hotel. The restaurant in the lobby (El Cardenal) is great, maybe the best feature of the hotel; the concept is traditional mexican food prepared with high quality standards but great authentic flavor. Check in and check out is not fast, it could improve.", "title": "Nice location, not well-kept", "user": "Antoine_K_10", "date": "August 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 137459369}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I do business in Mexico City , especially in a company near by , the Hotel always provide a great service, the restaurant is very good, the fish fillet al ajillo is very good, is real hot . Try to get a room in the lower level, the elevation can make you breath heavylly", "title": "Recommend", "user": "saitame", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136294526}, {"rating": 5.0, "title": "Always a delight!", "text": "I've stayed here more than 5 times and always have a good experience. The executive lounge on the 26th floor is fantastic with amazing views of downtown historic Mexico City. This is one hotel where an upgrade really means something, I've been upgraded many times to the xx01 suite which is enormous, beautiful views to historic city through the massive array of windows, and my very favorite is a fabulous stand-alone jacuzzi with the same views...very relaxing (and romantic?). Other times that I've been in upgraded rooms even though not the xx01 suites are still large junior suites. Beds are comfy, bathrooms large, nice bath amenities, complimentary bottles of water, fast room service with good food, good A/C, etc.", "user": "EricAllred", "date": "August 5, 2012", "id": 136265973}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The location is just a few blocks from the Palacio de Bellas Artes and the Torre Latinoamericana, with a small mall next door that has a Starbucks, a bookstore, some banks, Nike store, hair salon, and a food court. Few more blocks walking to El Zocalo and the downtown walking/business district. It's a fabulous location for getting in some sight-seeing during a business trip. However, make sure it is OK for your strict business needs as it is on the other end of Reforma compared to the usual business-hotel district of the W, Intercontinental, Nikko/Hyatt, JW Marriott (15-25 mins away depending on traffic). Of course if this is just pleasure it is perfect due to the proximity to the historic sites.", "title": "Excellent hotel for business or pleasure", "user": "RWorldtraveler", "date": "August 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136206454}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast", "city": "Mexico City"}, "stars": 4, "variance": {"poor": 13, "average": 38, "very good": 149, "terrible": 9, "excellent": 333}, "aka": "Hilton Mexico City Reforma Hotel", "slim_ranking": 0.0298507462687, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The five-star Hilton Mexico City Reforma hotel is located beside the downtown, historic area of Mexico City – alongside the city’s finest architecture and theatres, embassies and art galleries. Fifteen minutes from Mexico City Airport, this central Mexico City hotel is a short drive from the bustling financial and business areas of Mexico. Recipient of a TripAdvisor award for 'Best Hotel for Business Travelers', this hotel in downtown Mexico City boasts an impressive conference and event space that can accommodate groups for 15 up to 5,000 with ease. Enjoy a swim in the 25-meter rooftop pool, work out in the fully-equipped fitness center or enjoy a delicious meal in one of 3 hotel restaurants. Decorated with original artwork by renowned Mexican artists, the Hilton Mexico City Reforma hotel is proud of its heritage - and the attentive service provided by its staff."}