{"user_rating": 3.5, "review_count": 229, "name": "Hilton Head Island Beach & Tennis Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "This was our first trip to Hilton Head. We rented a 1 bedroom villa directly from the owner at VRBO. We stayed 5 nights for a total of $550.00 with tax and cleaning included. Our villa was in Building B (room 306) and was very clean. Towels and sheets were included. The beach was very nice. It got a little crowded in the afternoon. There is a huge pool and an oceanfront bar. We will definitely be back.", "title": "Loved Hilton Head!", "helpfulness": 6, "user": "Jlzywales", "date": "August 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "business": 5.0, "rooms": 4.0}, "id": 5577805}, {"rating": 3.0, "title": "Read before you leap!", "text": "We stayed in Admiral's Row, last room in the building furthest from the beach. This resort consumes a lot of ground so be prepared to have a plan of transportation in place. People rented or brought bicycles to get closest beach or pool access.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5470145}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Our accommodaations needed some serious updating. For example the tile in the hall bathroom was cracked in places as was the mortar between the wall tile and the floor tile. It looked as if some of the fixtures had been there since it the building was built. I'd say in the that would have been in the 60's.", "title": "Hilton Head Fun", "helpfulness": 3, "user": "Evillebuffett", "date": "June 1, 2006", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5289104}, {"rating": 2.0, "title": "Just okay for tennis", "text": "The pool closest to the beach is huge! A word of caution, the decking can get very slippery in places so shoes with some type of non-skid bottom shoes are a must!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4997179}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "Rum Runners and Kings Wharf eateries. The grouper fins and chicken fingers at Rum Runners are very tasty. Don't waste your time going to the Kings Wharf. I was very disappointed with the dish I ordered.", "title": "Read this before staying here, decent place but has some issues...", "helpfulness": 13, "user": "mbugATL", "date": "April 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 4831289}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "This is an oceanfront resort - although older than some on the island. We have been to this resort several times and stayed in several different villas over the past 3 years. The resort is gated, the grounds wonderfully maintained, and the beach here is wide and beautiful! There are 2 pools, oceanside tiki bar, on-site restaurant, market, 10 tennis courts, and a newly added work-out facility and gameroom. My children (9) & (5) love the kids activities during the summer. Hair braiding, pool games, arts & crafts, etc.", "title": "Great Resort, Best Value,Rent from an Owner", "helpfulness": 20, "user": "hhiowner", "date": "January 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 4330404}, {"rating": 1.0, "title": "dirty south", "text": "The KEY - rent directly from an owner. Since the resort is 20+ years old, you need to find a villa that has been renovated with new appliances, furniture and flooring. If you do this, you will be very pleased with your accomodations. Many of the previous reviews note dirty carpet, dirty sofas, etc. If you rent directly from an owner you can ask about the age of their furniture and appliances. Try an Admiral's Row villa. They are the 2 bedroom condos that are closest to the beach. Not huge - about 1000sq feet, but perfect for our family of 4.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "October 21, 2005", "id": 4042690}, {"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "We have stayed in this resort, plus Palmetto Dunes, Forest Beach, and Shipyard, but this is definately the best value for our money. I consider myself a yuppie (unlike people who like to sit by the pool and cuss with my beer and cigarette) and I like clean, comfortable surroundings, but a concierge is not necessary. Where else can you stay a week directly on the beach in Hilton Head for less than an grand? Save your dollars for dining!", "title": "Yuck! Go elsewhere please!", "helpfulness": 19, "user": "hoonie99", "date": "October 12, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4016698}, {"rating": 2.0, "title": "Don't come for Tennis", "text": "The beach was way too crowded, along with the island traffic. Our room was rank, dirty and it smelled. What was worse were the locals. A very rude culture indeed. Save your money and go somewhere else.", "helpfulness": 24, "user": "A TripAdvisor user", "date": "August 30, 2005", "id": 3815575}, {"rating": 4.0, "title": "Admirals Row @ Hilton Head Beach & Tennis Resort", "text": "I recently went for a golfing weekend and hoped that the resort included in the package was decent. Unfortunately, it was nowhere near decent. Although we stayed in one of the \"Villas\" in admirals row (supposedly nicer than the condos) it was an enormous disappointment.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "August 8, 2005", "id": 3746663}, {"rating": 4.0, "title": "A Great Vacation", "text": "Although I visit Hilton Head annually, this past week was my first stay at a villa in the Hilton Head Beach and Tennis Resort. The villa was a single bedroom, oceanfront unit with a working kitchen, one bathroom, and two built-in bunks. It was a small villa, but was fine for two adults and two kids. I inquired about two bedroom villas, but was informed that there were no oceanfront units with two bedrooms. Oh well, I'll take the small space with the view over more space and a parking lot view. The photos of the unit on the resort's website were very accurate as there were no surprises when we showed up. There were some minor problems with my reservation, but nothing major. The front desk staff was friendly and let me check in early. The view from the first floor was nice as you could see a little bit of ocean over the dunes. This was actually more than I expected from a first floor unit. The gift shop and tennis pro shop were much smaller than I had envisioned. Get your gifts and tennis supplies elsewhere. The pool was large and crowded, but the kids loved it. I killed time with a frozen rum drink from the poolside bar. The resort is in the somewhat older part of the island and is only about a half mile from the Westin and the Island Club. If you've been to the Island Club, the HH Beach and Tennis Resort is similar. All in all, my family and I took a small chance with trying this \"new\" place (new to us, that is), and we were very pleased with what we found. Unless we get some kind of super deal somewhere else, we will definitely stay here on our next vacation to Hilton Head.", "helpfulness": 22, "user": "zzbeach", "date": "July 30, 2005", "id": 3723461}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 30, "average": 34, "very good": 84, "terrible": 24, "excellent": 57}, "aka": "Hilton Head Island Beach & Tennis Hotel Hilton Head", "slim_ranking": 0.653846153846}