{"user_rating": 4.0, "review_count": 783, "name": "Hilton Brisbane", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I recently stayed at the Hilton Brisbane for 3 nights. I was impressed by the attitude of the staff, they were very professional and very helpful. There is a outdoor pool on the 6th (?) with a hot tub that felt great after a long day of hiking. I don't recall the pool being heated, although they advertise it as such. The room was pretty typical Hilton.", "title": "Nice Business class hotel in Brisbane", "user": "HowlinTom", "date": "August 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37993090}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I liked the location, which is next to the pedestrian mall with all its stores and restaurants.", "title": "Clean rooms, soft bed, expensive parking!", "user": "TwoAussies", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 37633923}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My only complaints - having to pay for internet and the cost of breakfast in the hotel restaurant. We chose not to eat there because it was so expensive. Otherwise, I would highly recommend this to someone staying in Brisbane.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "Shazo54", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37492818}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "We stayed on the 17th floor, and the room was clean, new furniture, but the bed was so soft we complained and the mattress was replaced on our second day. New mattress was good.", "title": "Need to lift their game!", "user": "princessvixen", "date": "July 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 35438243}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Bathroom is a bit tired with old wallpaper.", "title": "Great Hilton value", "user": "Hobe", "date": "July 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 35370796}, {"rating": 5.0, "title": "Excellent, international standard hotel", "text": "What a location! Dedicated lift to the Queen St mall, courteous and smartly-dressed check-in staff who were extremely helpful and friendly. Delicious breakfast. Fast cable internet + wifi. Very generous rooms with desk. Cannot be faulted.", "helpfulness": 1, "user": "ExperiencedOz", "date": "July 15, 2009", "id": 34863364}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We arrived late in the evening by taxi from the train/bus station and it was rather confusing where to go. The desk on the street level is not the front desk. For check-in we had to use the elevator, it goes only from the street level to the lobby on the 6th floor. (During our stay we noticed that you can only use the front desk for check-in and –out, for all other things such as maps, brochures, plans, tips, stamps, etc. you will be immediately directed to the concierge desk below. Then you always have to use two elevators.)", "title": "Nice stay in pleasant city", "helpfulness": 1, "user": "BA-traveler", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33995179}, {"rating": 4.0, "stay_parameters": "Stayed June 2009", "text": "After a friendly check-in, the assistant manager came to us and presented his card, if there was anything we should just give him a call. A nice welcome for our Diamond HHonors status, I suppose. We were also given an executive room.", "title": "Hilton happiness", "user": "KatieBerkshire", "date": "June 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 32759785}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The room was of a decent size with modern and nice furniture, a minibar, coffee/tea facilities and a good quality King bed. The bathroom was very clean with many soft towels. We ware on a high level, but the view was nothing special, just roofs and offices. It was quiet and we could sleep very well.", "title": "Heart of Brisbane", "user": "Suniel14", "date": "June 18, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 32582600, "likes": {"liked": "— Sophisticated Touch", "disliked": "— The lobby could have been bigger"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "The executive lounge was open all day for coffee, tea, soft drinks and some fruit and cookies. In the morning they had an excellent breakfast, in the afternoon some tarts and other sweets and in the evening the happy hour with (alcoholic) drinks and many hot and cold snacks (every evening a different choice).", "title": "Quiet Executive Rooms", "helpfulness": 1, "user": "Avanti50", "date": "June 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32402464}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I booked my room on Expedia and was pleased to find that we got a free upgrade to the Executive floor when we arrived. The room was nicely appointed, the bed was soft and comfy and the location can't be better! The only downside was the$49 parking fee and the $38 breakfast. There are lots of great places to eat nearby, so unless it is included, skip breakfast!", "title": "Great location, beautiful rooms, great service!", "user": "djnekokittie", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 48216770}, {"rating": 4.0, "stay_parameters": "Stayed October 2009", "text": "After a extended break from this hotel, I once again checked in with the Brisbane Hilton for an overnight stay in Rm 1713 on a very competitive rate. The Brisbane Hilton has a great location, right on the Queen Street Mall, so its handy to rail, bus, taxis, shopping, etc. Its an older style hotel (with huge atrium) but its aged fairly gracefully in a non-flashy way, the only bugbear being that it doesn't have enough lifts for its size so it can be somewhat of a wait at times, particularly if there is a conference on.", "title": "One of the better inner city hotels", "helpfulness": 2, "user": "The_Hotel_Reviewer", "date": "October 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48150075}, {"rating": 5.0, "title": "Pleasant, Quiet Stay", "text": "Valet coming in was prompt, and as we were both travelling light we didn't use the bellmen. Check-in was prompt. Was greeted with personalised card in room from hotel, always nice to be recognised, espeically since I stopped being a Gold member in Hilton Honours a couple of years ago when I switched to Sofitel as my mainstay brand. Another nice touch is the card left by housekeeping letting you know who has serviced your room for you. Sometimes its the small things that make you feel like your respected as a customer.", "user": "Roxi7", "date": "October 28, 2009", "id": 48006748}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Room was comfortable, with the updated LCD TV and chaise being nice pluses. They've cut back on the glassware in the room though - which was a little niggle. Glimspes of the Brisbane River could be seen from the window, if you looked hard enough, otherwise just bland office towers. Bathroom was OK.", "title": "Very modern, What you expect from Hilton, Top end Hotel!", "user": "spudgt2", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47298532}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Had drinks at Below 7 (the hotel bar), cocktail menu was condensed down to only a handful (of fairly uninspiring options) which was a shame as this used to be quite good. Service was not great but it was fairly busy.", "title": "Good hotel, great central location", "user": "KezzaKKC", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46514932}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The hotel is well-situated in Brisbane. The hotel staff, especially those in the Executive Lounge, were fantastic. The food in the Executive Lounge was great, and we enjoyed being greeted by name each time we entered. The room was spacious and clean. We had a few issues with the Internet access in the hotel rooms (mainly wireless), but the hotel staff was good about removing the extra charges from the bill.", "title": "Excellent stay in Brisbane!", "user": "jopet78", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45613286}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I scored a free trip to Brisbane and found the room at the Hilton great. The bed was king size and so comfy!! We had a nice view of the city from our room on the 18th floor and all the staff were friendly and helpful. I loved the locaiton, right on Queen Street Mall. I found the bathroom slightly dated and in need of a reno and the shower over bath thing a bit strange for such a reputable hotel chain. But the shower pressure was strong and the bathroom immaculately clean. Don't get me wrong - the atrium and glass lifts are fab but again, all felt a bit dated like I was in the 1980s. But this is of course, no reason NOT to stay. Overall, a fantastic experience.", "title": "Fantastic locaiton!", "user": "akm191076", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45472820}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Hilton hotel is similar to other Hilton hotels. However, we managed to get a half price deal where the huge room only cost £50 a night which included a mammouth breakfast buffet!", "title": "Great value, good location.", "user": "Russ1470", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 43782640}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is in a central position which is close to all of the main areas that you would want to visit. The rooftop pool was an added bonus.", "title": "\"Upgrade\" already \"tired\"", "user": "gortonsm", "date": "September 9, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 40308034}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Great central location", "title": "Comfortable hotel in great location", "user": "Slam60", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 40251291}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Brisbane"}, "stars": 4.5, "variance": {"poor": 42, "average": 104, "very good": 278, "terrible": 10, "excellent": 349}, "aka": "Hilton Brisbane Hotel", "slim_ranking": 0.0555555555556, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "A vision of contemporary design and unpretentious luxury, the Hilton Brisbane is set to emerge from extensive refurbishments as Brisbane’s most up-to-the-moment five star hotel. The revitalised Hilton Brisbane will feature beautifully renovated rooms and suites of enviable calm and sophistication, a welcoming porte cochere to hint at the luxury within, our stunningly reimagined restaurant Vintaged Bar + Grill, and a new, ultra-modern business centre. The Hilton Brisbane is the cities most centrally located hotel, close to central station and located within walking distance to major Brisbane attractions including Queen Street Mall, Queensland Art Gallery, Gallery of Modern Art, South Bank Parklands and Queensland Performing Arts Complex. When you stay with Hilton Brisbane you will be at the heart of a vibrant metropolis that is uniquely Brisbane and unforgettably Hilton."}