{"user_rating": 4.5, "review_count": 2192, "name": "Hilton Orlando Bonnet Creek", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Buatiful resort with Golf club , lazy swimming river, one of a kind property. Wlaking and jogging trail of 1 mile. Must stay in the resort to appreciate the value and bauty. Free shuttle to Disney parks, very close to Disney Downtown. Excellent restaurants, lots of activities, parking is free if you self park, valet parking is also avialable.", "title": "Orlando vacation", "helpfulness": 2, "user": "BananaPudding_12", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154939274}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "This was a last minute stay for us on our way back from Miami and we very pleased. The cleanliness and decor of the rooms were inviting. Be prepared to pay for all the extras. Ask for a room that faces the pool and golf course. Get the breakfast package or it will be double at the time you eat. All in all a very nice stay and great for kids and adults alike.", "title": "Pleasant", "user": "swetfam4", "date": "March 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154933522}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed at this hotel for three nights whilst visiting the Disney parks and Universal studios. The hotel was very convenient for the parks as it has a shuttle bus which will take you to and from the parks. The only drawback to this is it takes a little longer to get there as the parks are visited in order and guests get off at the park that they want along the way. The hotel itself was very pleasant and comfortable but we found the public rooms to be a little on the chilly side as the ac was too high. I recommend you take a woolly with you. We ate at La Luce one evening and the food and service was excellent;I would recommend eating here. we ate also at the Harvest restaurant which was great for breakfast but would not recommend in the evening. I would recommend this hotel if you are visiting the Disney parks.", "title": "Excellent", "helpfulness": 1, "user": "Zocinda H", "date": "March 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154922322}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I stayed here for a meeting late January 2013 and it was a great hotel! The property was pretty big. The rooms are very nice and the staff is very friendly. The pool area is very nice with a mini lazy river that goes around it. They have a shuttle that goes back and forth from Disney and back so even though it is not directly across the street from Disney it is still worth the stay. The property is connected to the Astoria which is a sister hotel and you can bounce between the two hotels through the meeting halls. The fitness center is fully equipped with state of the art machines and is spacious enough to accommodate a lot of people trying to get a workout. The restaurants are great so no need to travel far for some good food.", "title": "Great hotel", "user": "BedBuggin", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154908225}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed at the Hilton Orlando Bonnet Creek this week and had a great time. The resort is about 2 years old and very nice. It is located on Disney property but is not a Disney hotel- there is bus service to the parks daily which we used everyday- more about that below. We traveled this past week as my husband had a conference and my children and I tagged along. The rooms are very nice, new, and clean. We had 2 kids and 2 adults in a standard room and although it was tight- it was fine for us. The beds are very comfortable, we needed a crib and they arranged to have one in the room when we arrived and also arranged to have adjoining rooms for other family members traveling with us at the last minute which was very nice. The housekeeping staff was wonderful and very friendly. The hotel itself is modern and is very family friendly. The kids loved the pool which was great! The food in the hotel was good as well and we really liked the Muse coffee shop in the lobby for our daily coffee and snacks for the kids. We also ate at the Harvest Grill on the ground level where kids eat free with parents, and at the restaurant by the pool as well- all very good. Our only compliant about the resort which may/may not keep us from returning is the bus service to the parks. There is only one bus serving the Hilton and the Waldorf Astoria next door. It's a very nice bus and it runs constantly to the parks. It's great if you want to go to the Magic Kingdom as it goes there first- but if you want to go to any of the other parks- you will spend a lot of time on the bus. We have 2 young kids where we definitely lost a good amount of time by using the bus and waiting to go around the entire route to get where we are going, and the kids patience was maxed while sitting and waiting. It's a great service that they run, I would just recommend if you are going to use it- and want to go to Epcot, Animal Kingdom or Hollywood Studios that you evaluate your time and decide whether it's easier to spend a few dollars on a cab to get there fast or spend time on the bus. We sat on the bus for 45 minutes one day to get to a park that was 2 minutes away by car. I'm not sure if we would opt to stay off property next time we come if going to the parks is the reason for the visit. It may be easier to stay on property for the same cost and be able to be more mobile. Other than the bus issue, we loved the Hilton and would definitely return to stay.", "title": "A great time at Disney", "helpfulness": 4, "user": "Angela S", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 154787442}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "My kids and I hit the Hilton Bonnet Creek for a weekend visit to Disney. It was our bad time, but they had a huge convention there, so things were a bit crowded.", "title": "It was ok", "helpfulness": 2, "user": "defore4735", "date": "April 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 127691062}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "As for the location - the property is on the Disney property itself. It's very close to the main Buena Vista, which takes you to Downtown Disney and I-4. There is a Wyndham property across the street along with the Waldorf that is connected to the Hilton Property. It was very quiet and peaceful there, but there's not much to do around the area other than hang out by the bar in the lobby or stay by the pool. There is golf on the property, but we didn't try that.", "title": "Great Spring Break Experience", "helpfulness": 1, "user": "hrmomx2", "date": "April 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127659686}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The Rooms- We had a 2 queen room. Internet is NOT free (which is something Hilton should consider changing), but there is complimentary access in the lobby area. The room is your typical Hilton room....nothing much to rave about.", "title": "Great Service all the way around", "user": "Brad J", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127639761}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Eating - We didn't eat in the restaurants. They have a nicer restaurant in the hotel and a family restaurant as well. Prices appeared to be typcial pricing for Hilton properties. They had a Bistro that offered coffee in the morning along with danishes and other pastries, but most mornings we chose to drive to Burger King or McD's at the end of Buena Vista. That saved us a LOT.", "title": "Excellent hotel and staff", "user": "darraghkelly1", "date": "April 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127612685}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The Pool - I think the kids liked the pool. They stayed there for quite some time so the fact they were down there a while is good. They enjoyed the lazy river, but if you're going during season - Spring/Summer, it seems many parents get down to the pool to reserve their spot at 7am. Evidently it seats fill up quickly around the pool.", "title": "Best of everything", "helpfulness": 1, "user": "hideyho53", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127595202}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Stayed for 5 nights from april 11th to the 16th. Hotel is a very big property right next door to the Waldorf. It has great location and has an amazing golf course that is in amazing shape. Rooms are normal size and perhaps I would like the bathroom to be a bit bigger but I cannot complain about that.", "title": "Great hotel! just what you need!", "helpfulness": 2, "user": "panajoe81", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128121861}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The pool is awesome for kids, even though I was told that this hotel fills up pretty quick because it relies more on conventions than on families that go to disney, they do a great job at the pool to make it fun for the little ones!", "title": "Excellent hotel near disney", "user": "Daly64", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128109062}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I had a disney view room and notice that many people complain that its not disney view at all. The thing is that people think its theme park view and its not, you are not that close to magic kingdom to see it. you can see a bit of hollywood studios but thats it. It is however disney view since you are looking at the whole disney area, you cant expect to see cinderellas caste!", "title": "Amazing hotel and family vacation to Disney!", "helpfulness": 1, "user": "Rebecca B", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127984084}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "the only complain I have is that housekeeping can take a while to enter the room, I went into my rooma couple of days around 3 pm and still the room wasnt done. I dont really mind that, but i would say that they should try to do that a bit earlier.", "title": "Relaxing spectacular stay near all the best attractions", "helpfulness": 1, "user": "traveljunkie212", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127959280}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I am a Diamond member in Hilton Honors and did not receive an upgrade or anything. I booked about 2 months before the trip and would probably expect something of an upgrade since its a big property but nothing, still customer service is top notch!", "title": "Best accommodation in Disney", "helpfulness": 1, "user": "Tikilounge112", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127949632}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We were there for a Disney World vacation. I had booked two rooms that were adjoining as my son, daughter-in-law & three grandchildren were coming with us. The children's ages 6,3 & 4months. The hotel was lovely. It has a beautiful pool with the lazy river. It was quite chilly several days so we never used the lazy river although I bought tubes for the boys.($6.00 ea.)The boys used the kiddie pool one day. The other days we were @ the parks all day & by the time we got back to the hotel it was the children's bedtime. The hotel was very clean & the two queen beds were very comfortable. We always stay in Disney but the the deluxe hotels were booked & we didn't want to stay @ a moderate or value due to the transportation buses to the parks especially with the baby. I specifically called Bonnet Creek to inquire about the transportation to the parks & was told they had a charter bus for Hilton & Waldorf only. I told them why I was concerned. They failed to mention you are dropped off @ Disney Transportation Center where you then have to wait in long lines to get transportation into the parks. Exactly what we trying to avoid. We then proceeded to take private taxi back to the hotel @ a cost of $20 + tip. We had our car, we are Fl. residents & drive to Disney World (about 2 1/2 hrs.,)but when you arrive @ the parks a bit later you have to park far from the entrance & take the tram, plus it's $14. to park, but just too much work folding the big stroller, getting the 3 kids etc.. Next time I will make the reservation sooner, first time on spring break for my grandchild, & stay @ Deluxe in the park. We used private taxis all week both ways which was quite an expense. Hilton Bonnet Creek is more than the moderate hotels @ Disney & more than double the Value hotels. I wanted to mention that if price is an issue for you. Kids ate free for breakfast & dinner but the adult prices were quite high in the restaurants. Breakfast buffet was $22. For adults & 18% gratuities were always added to our bill as the counted the children. It was your run of the mill buffet that is usually complimentary @ some hotels. The coffee shop Muse was very good. Good coffee. Nice gift shop, Disney. Same pricing as the parks.", "title": "Very nice hotel", "helpfulness": 2, "user": "mssee", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 155376783}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We stayed at the waldorf but spent lots of time at the lazy river at the Hilton. LOVED IT! I can not say how the hotel was, yet I heard it was nice from those we spoke with, but the pool was great. BEECH bar has really good drinks. If you order from here, ask for Chris. He was soooo kind and easy to talk to. He even gave my kiddos a little gift before we left. He definitely stood out & can't wait to come back to see him again. Really had a good time at the lazy river though.", "title": "We didn't stay here but wish we did", "helpfulness": 1, "user": "amylynne1224", "date": "March 22, 2013", "detail_rating": {"cleanliness": 3.0, "location": 3.0}, "id": 155354563}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I spent one night at the Hilton Bonnet Creek recently for business and I wished there was more time to enjoy the property. My room was clean and quiet with a tantalizing view of the lazy river. Wish I had a chance to visit the lazy river which appeared to be a perfect place for a family to unwind from a day at the theme parks.", "title": "Nice Hotel for Work Conference", "user": "Liz R", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155353643}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "A true Resort, this property is connected to the Waldorf Astoria by a Conference Center building. It is not part of a \"Hotel Row\" with franchise restaurants scattered in - so if you seek the \"TGIF, Uno, McD, Sizzlr and such\" within walking distance, don't jump for this location. It is pure resort ... with a nice small lake area, walking / running paths, golf course, and high end look, feel and service. The Shuttle bus service to the Parks sets the bar high, and there is a shuttle to the Premium Outlet as well. The large elevators were fast, always just seconds from arriving, even with a Conference going on that added to nearly a full house.", "title": "Premium property at GREAT Value at the Main Disney WDW entrance", "helpfulness": 2, "user": "Da_YguY", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155271184}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The abundant professional Staff couldn't do enough to make every inquiry and request seem trivial, and all did so with a genuine Servants heart. That alone would be enough to have us looking to return, yet add the very clean public areas, the great pool with areas for child to adult (gradual walkin, 1meter deep fun sections, separate small but fun kids waterslide area, and a Lazy River that flows briskly around the entire pool area perimeter), and very good, clean, fresh high-quality bedding, large shower, large very good bath towels, peaceful rooms ... make this a Best Choice for the cost. The food at all 5 restaurant/ eating areas was very good, and again, the staff was great. Parking fee and higher than average Resort fee are the unfortunate detractors from this being our #1 Orlando spot, yet it is becoming the Orlando norm when such high quality accoutrements (shuttles, unique pool, golf, etc.) are standard features. Add what the Waldorf offers just a 200 meter walk away, and you get an Excellent resort experience at a good price.", "title": "Business Trip and added Personal Time", "helpfulness": 1, "user": "Philly2003", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155271113}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "It's been a while since i took my child to this resort as a way of resting after a tough illness. It still burns me how much I spent to go there and how awful it was. The place was overbooked and they became very pushy at check-in--treating us like the offender when we refused a room at the other hotel. The pool was partially closed off for conventioneers. The front desk unable to follow a simple request or promise to completion. They lost a package we had sent there for THREE DAYS (repeated asks for help and front desk just decided to ignore it). A newly purchased towel from Discovery Cove was taken from our room and they never reconciled the matter. Room service orders were always incomplete. TV never worked due to bandwidth overload from the convention. When we finally left, i felt the stress leaving. Repeated calls to the hotel manager for some sort of reconciliation for my missing item and RUINED stay - was never resolved. The manager had the nerve to have a staffer offer me a free night stay in return for all the lost vacation and stress. I live 1300 miles away......EXCUSE ME???? Also I agree the premium Disney View room....you cannot see Disney!! I don't know how they get away with that one over and over again. It is really false advertising.", "title": "Vacationing guests lose in this Convention-focused Resort", "helpfulness": 8, "user": "pfirishme", "date": "April 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 127949603}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Stayed in the hotel for 4 nights in October 2011 and booked via a German site for an attractive rate (around USD 125 per night). Very nice and big lobby and overall very big hotel. Rooms was clean and big enough with two queens. We stayed with 3 adults and two children. Baby cott was also provided by the hotel and of good quality. We didn't go for the breakfast. We only rented a tube at the pool for USD 5,00 which was booked on the roombill. And parking was about USD 15 per night. Very good parking place in a separate building.", "title": "Very nice resort", "user": "JohnEastman99", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127915021}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Stayed here over the Easter period for a few days after first staying at the adjacent Waldorf Astoria. Taken in isolation, the rooms, public areas, pool and bars are lovely, but (and I'm sure it's by design) everything is just down a notch from the sister Waldorf. The furnishings are a little less luxurious, bathrooms a little smaller, no turn down facility, no gowns and slippers and less of a 'wow' to the hotel interior.", "title": "Excellent....But overshadowed?", "helpfulness": 1, "user": "JDH128", "date": "April 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127905068}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "Both hotels were built together and there are a lot of common fittings and features. I'm sure they were developed to cater for slightly different markets and I suppose you pay your money and you make your choice. I'd say the Hilton is probably better for families with young children - cheaper, better 'on the go' snack facilities and child friendly pool area. Not so sophisticated as the Waldorf.", "title": "Great pool and location", "user": "Doctorg23", "date": "April 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 127888193}, {"rating": 2.0, "title": "We would not return...", "text": "Downsides?", "helpfulness": 2, "user": "Travelguru7076", "date": "April 14, 2012", "id": 127884105}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "I moved here from another property so keep that in mind.", "title": "Almost brand new.", "user": "jf005", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 155221187}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "You walk in feel like you are in a brand new Vegas hotel.", "title": "Lazy River Great", "helpfulness": 1, "user": "Debbie M", "date": "March 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155177608}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Great bar and entry area.", "title": "Nice", "user": "Marc L", "date": "March 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 155053124}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "24 he coffee", "title": "Great stay and will return", "helpfulness": 1, "user": "Iwg123", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155007388}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Not so great parts are. Middle of no where so you have to shuttle drive everywhere.", "title": "Pretty much perfect", "helpfulness": 1, "user": "Amanda G", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155003266}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We were at a soccer 3v3 tourney in Orlando and all the other hotels we were trying to book were booked solid. We were glad they were or we would have never found Bonnet Creek. If you ar booking fro the 3v3 this is the perfect place and it saved us renting a car as the taxi was very inexpensive to get there and much faster than all the friends we went with that had rented a car. We were first there and first back at the hotel every time. Sushi downstairs is good and food at the harvest is also good. Not great but good. Highly recommended. Next year we will definitely be booking again.", "title": "Almost missed tis place", "helpfulness": 1, "user": "D L", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154776180}, {"rating": 5.0, "title": "Good choice", "text": "One night stay as part of a conference. Completely satisfied with facility and service. No complaints. Modern, updated, clean. $62 cab ride from airport. Great views of beautiful golf course. Conference rooms were very good, sometimes a bit warm. Attached to the conference center, and to the Waldorf. Restaurants were above average. Bell staff and concierge staff were both must helpful. On Disney property. Did not go to theme parks, so do not know how long a ride to them. Theme park tickets are available at the hotel.", "user": "TPHOB", "date": "March 16, 2013", "id": 154775411}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "W hat a difference a few months makes! Stayed here June 2012 and came back with the family July 2012. Had a wonderful time then. Superior service, friendly, courteous employees. Well that has all changed!", "title": "What Happened Here?", "helpfulness": 2, "user": "Hicks23", "date": "March 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154751999}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Just got back from a five-night stay here. My husband was part of a very large convention held annually in Orlando. Had a nice corporate rate of $199 and no resort fee. Had free internet because of my gold membership.", "title": "Amazing", "helpfulness": 1, "user": "bbgirlz05", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 154750161}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Pros--lovely grounds shared with the Waldorf. Great pool. Convenient transportation to Disney--no reservations needed. Great breakfast buffet (costly). Upgraded at check-in.", "title": "Good for families, best for mom & dad", "user": "hilemasm", "date": "March 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154713849}, {"rating": 5.0, "title": "GREAT place zero complaints", "text": "Clean hotel, spectacular pool, restaurant and snack bar inside. Close to Disney, great area. Beautiful place clean rooms, friendly staff.", "user": "sfromd", "date": "April 13, 2012", "id": 127839238}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Slight negatives are as follows:", "title": "All in all, an awesome place! Just keep a few things in mind.", "helpfulness": 2, "user": "BeachGal70", "date": "April 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127755077}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "No restaurants within walking distance ( except inside hotel $$$)", "title": "Great Family Hotel close to Disneyworld", "helpfulness": 1, "user": "vikkia80", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127749765}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "$13.00 per day parking fee", "title": "Excellent Hotel!", "user": "RamseyJerseyGirl", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127744948}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "$10.00 per day Internet usage fee.", "title": "Family fun in Orlando", "helpfulness": 1, "user": "Janaanmn", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127706131}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 46, "average": 126, "very good": 545, "terrible": 24, "excellent": 1451}, "aka": "Hilton Orlando Bonnet Creek Hotel", "slim_ranking": 0.0364741641337, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}