{"user_rating": 4.5, "review_count": 1853, "name": "Hilton Malta", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "I can't say a bad word about this hotel. It's genuinely lovely in almost every way. The service is fabulous. The rooms are lovely (plasma screen TV's and DVD players in the rooms etc) and the location is absolutely beautiful - however it is ridiculously expensive. Its almost €9 for a RedBull in the mini bar, local beer \"Cisk\" is €6 a pint (that's the equivalent of paying say, £12 a pint in hotel in the West End if you compare the prices with bars close by). If you go to Mayfair etc these kind of prices are high but for Malta they are astronomical. Literally everything else was a delight though", "title": "Beautiful hotel, amazing location, lovely rooms and delightful staff. Very very expensive though.", "user": "Heathie8", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116723822}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We stayed at the Hilton for 10 nights. We had a fantastic time and wouldbrecommend this hotel whole heartedly.", "title": "Wonderful family hotel", "user": "foodlovehappy", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116712240}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Much has been said about the excellent service, the food and the hotels location. I would agree with all the positive comments. The location is situated in a redeveloped area of St Julians.", "title": "We loved it !!!", "user": "Ricardo P", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116651891}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The area now houses the Porto Masso Marina and the hotel complex. We have visited some wonderful areas but this Marina and the view from the Quarterdeck bar is come thing very special.", "title": "Fantastic hotel, location, service .... could not ask for anymore ...", "user": "SafferB", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116598247}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The hotel service is exemplary. If a member of staff has a Hilton badge on then you can be assured of exemplary service.", "title": "great place to stay but...", "user": "Bordon", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116580247}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed for four nights in a king deluxe room with sea view. Perfect! The room was large, spotless and had views over the pools and the sea beyond. Staff were very attentive. The concierge was particularly helpful and nothing was too much trouble. Breakfast was excellent and there was so much choice, I couldn't think of a thing they could add. A few helpful hints - 1. If you would like to eat dinner in the hotel, make sure you book in advance otherwise you may find you have to eat later than you would have wished. 2. The open top tour bus will pick you up at the hotel if you speak to the concierge. 3. The local buses are very very efficient and inexpensive but very grubby so don't wear white!! Overall, this is one of the best hotels we have stayed in and I would certainly recommend it.", "title": "Excellent hotel overall!", "user": "flubadub", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104535765}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "This was our second visit to the Hilton. Stayed in an Executive room which gives access to the Executive lounge for complimentary afternoon tea and pre-dinner drinks which are served in luxurious surroundings by attentive and friendly staff. This is an excellent facility, and particularly welcome if the weather isn't great.", "title": "Great Stay", "helpfulness": 2, "user": "JDH128", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 104492295}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Stayed in one of the traditional rooms but got to experience one of the more contemporary new additions when we needed to switch rooms for half a day because of a late flight. Have to say that we much preferred the traditional rooms, but that' s purely personal taste.", "title": "Excellent hotel", "user": "HeatherDavid", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104394732}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Breakfast excellent, as is evening buffet and the Blue Elephant Thai restaurant in the basement. Living Well health club is well equipped and a pleasure (almost!) to use.", "title": "Wonderful hotel!", "user": "tronns", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 103763849}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Niggles?", "title": "Probably best hotel on Malta", "user": "KarlMoosbrugger", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103520234}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This Hotel is simply outstanding in terms of its friendly, professional and exemplar service - from the bottom to the top, I cannot fault it. The breakfast is superb and the quality of the Hotel food in the evenings is excellent. The people who work in this Hotel take the concept of friendly, efficient and helpful service very, very seriously and this is what makes this Hotel so special.Thankyou Hilton Malta for a wonderful holiday, I think the Hilton Hotel chain would do well to follow the exemplar standards you are setting.", "title": "An outstanding example of service that rarely exists these days.", "helpfulness": 1, "user": "WalesRachie", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117415422}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We just got back from Malta yesterday and had a lovely relaxing holiday! It was our second stay at the Hilton there and it was really nice to be back!", "title": "Perfect holiday!", "helpfulness": 1, "user": "nicichan", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117359730}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "We actually got the same room that we got last time (2 years ago) which we thought was a nice touch because we really enjoyed our stay last time as well. Our room had a sea view with a view of the Marina and it was one of the old style rooms, but very comfortable, big and clean.", "title": "Lovely place", "user": "MarieSaphir", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117324589}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The Hilton is a beautiful hotel with nice views of the sea and the marina, and it's lovely at night as well, when everything is all lit up. The pools are all really nice, but we especially liked the adult pool where you can swim and relax in peace without getting splashed at all the time. I noticed that one review mentions some of the sun umbrellas being broken, but I think they are just a bit hard to open. The staff are very helpful though and help people open them. We did once get one that was actually broken and they just replaced it then.", "title": "Just great!", "helpfulness": 2, "user": "Robocop1", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117313179}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We had dinner in the Oceana and Gazebo restaurants twice and they are both lovely. I would especially recommend the Gazebo restaurant, it just feels really special and the food was delicious! The hotel restaurants are a bit more expensive than the other restaurants in the area though. Breakfast was great too, there is a great selection of food.", "title": "More than satisfied and would definitely stay here again.", "helpfulness": 4, "user": "Nisse2ears", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117148513}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Stayed in juli 2011 with 2 children age 7 and 9. Had high expentations and they we all fullfilled and even more. The hotel and sorrundings are high class. The small marina with restaurant provide a good alternativ in dining. Pool area very silence and clean. Sunbeds available at all time. No need to run for them in the morning.", "title": "Best 5 star experience ever. Highly recommended", "helpfulness": 2, "user": "Lunau", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117710349}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "The entire staff is so helpfull and competent. Waiters at the bars and restaurant very proffesional and the all understand and speak english. Blue elephant is a must visit! Bottega del Vino serves a variety of mediteranian and local food of high quality.", "title": "Brilliant hotel - one of the best 5* I have stayed in.", "helpfulness": 1, "user": "123hnb", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117662156}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed in a junior suite - very clean and well furnished. Used the executive lounge several times a day and forund it very nice and quiet for the 14 night we stayed. Variety and predinner snack could be better. The waiters in the lounge are excellent and very serviceminded.", "title": "A generally excellent hotel", "helpfulness": 1, "user": "marduk1", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 117608780}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Best GYM ever at a hotel.", "title": "We had a great time, but here are some tips..", "helpfulness": 9, "user": "blackadda", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117533493}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "High class 5 star hotel where you dont walk around in tanktop and swimsuit except at the poolarea . Dont forget a nice shirt and a dress.", "title": "Nice place but needs an update...", "helpfulness": 4, "user": "jackkk1", "date": "August 30, 2011", "detail_rating": {"sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117452704}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "Fantastic rooms and some really great sea views here. Food and service is typically Hilton - so don't expect anything intimate or overly stylish.", "title": "Great rooms, views and all you'd expect from a top calls hotel.", "user": "PandEKew", "date": "August 20, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 116998527}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Overall, I couldn't fault anything with my stay.", "title": "Roomy and Friendly", "user": "toota101", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116990356}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Loved our stay at the Hilton. The room was large in comparison to Europe hotels. We had a lovely large balcony where we could sit, enjoy the sunset with a bottle of wine. The room maids were especially friendly and even checked in with us to make sure the room was up to our satisfaction. A bar man came around to check if we required any further drinks in our minibar as well. The location is very central ad easy to get everywhere to. Portomasso mirina is at the hotel, where you can get lots of restaurants. Breakfast is fantastic, so much variety to chose from hot or cold, plus a chef to make you an omlette or pancakes.", "title": "Plush hotel, great location", "user": "ToptravellerLondon", "date": "August 20, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 116972757}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Went to the Hilton Malta in May as a birthday treat for my wife. Booked in advance for Hilton offer in January but executive room prices were still pretty steep! Hotel itself is very plush and staff were friendly and helpful. Our room was spotless with all the modern trimmings and view was ok. The breakfast buffet was plentiful and full of choice and the executive lounge was also well replenished throughout the day. Location was good as it was a short walk to Spinola bay where there are a number of good restaurants and the Marina. We saw The Intercontinental right in the middle of all the bars and clubs in Paceville, which did not look appealing! . The Blue Elephant restaurant in the basement of the hotel was good having been to the one in London a few times but was approx 100 euros for 2 without wine!! Other restaurants to note were Barracuda on the corner of the bay and Chapter One. Overall, we would recommend this hotel if staying in Malta and have that little bit extra to spend..", "title": "Paradise - absolutely loved this hotel", "user": "flyingscot1982", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116961295}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "After a short taxi ride form Malta Airport (about 20 euros) we arrived at the beautiful Hilton St.Julians. Check-in was hassle free and unlike a lot of hotels they ask you if you want the concierge to take your bags to the room rather than somebody grabbing them and then encountering the whole awkward how much to tip situation - we didn't and found our way to the room no problem.", "title": "OK but not a family holiday resort", "user": "deborah e", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 2.0, "service": 5.0}, "id": 116958536}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Probably the best Hotel we have ever stayed in and we've stayed in some fine hotels. It may not be the best room we've had for example, although it was excellent, but as an overall package the Hilton takes some beating. The public areas are fantastic, clean and bright and all the staff are very friendly. The restaurants and drinks may not be cheap but for a 5 star hotel you do not feel ripped off. The quality and items on offer at breakfast take some beating too.", "title": "Faultless", "helpfulness": 2, "user": "Chris4817", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160774053}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I have been trying to think of a negative and it's really difficult but if there was one it would be that you often hear people in the rooms above dragging chairs on the tiled floors. This can be quite early in the morning. For a low outlay I think the hotel could perhaps put rubber bottoms on the chairs to stop this happening.", "title": "Great Spot on the beach in St. Julians", "user": "Drkbjk46", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161290187}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We will definitely be back time and time again. Fantastic!", "title": "So good, we're going back already!", "user": "TallTravellerUK", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160591296}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed here using Hilton points, and were extremely satisfied with our stay. The rooms are very nice and comfortable. The pool facilities are excellent. And the hotel staff were very quick to respond to any questions. Although the hotel has its own restaurants its location also makes it a very short walk to many local places to eat as well. Will stay here again.", "title": "Hilton is fantastic", "helpfulness": 1, "user": "Alison F", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160677985}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We ended up here rather accidentally when my friends got married in the hotel last year. After just traveling round Peru for three weeks then a cheeky week back at work, it was time to head off to Malta.", "title": "Lovely Holiday", "helpfulness": 1, "user": "KasH490", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160492043}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We picked this hotel because of the pool and position. We werent disappointed the infinity pool was lovel. Booked a twin exec plus room which was supposed to be sea view.. room 461 is if you stand to side. which was a shame but the room was lovely. This hotel is good but not a 5 star no porters to take your luggage to the room and no turn down service. Breakfast was ok Ive had better and quite frantic..limited outside area but if your prepared to wait you will get a table. Staff arent overly keen on you watiing though.We should have had access to business lounge this was being refurbished which worked to our advantge in that we had afternoon tea and early evening drinks on the quarter deck which has a lovely view of the marina. We thought it was good value for money. staff could be quite rude and unhelpful which was a shame. Also taxis from hotel are very expensive it was 9 euros from the hotel to bottom of the bay which is about 1 mile.,. could hav walked but not in high heels.", "title": "Good location, Nice rooms", "user": "NickyPHughenden", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159894765}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed here for 3 nights on a businesstrip. It is a beautiful hotel with very nice pool area. Room size was great and the breakfast very good. The hotel have very nice meeting rooms and the service was perfect. The hotel is also very close to Malta's Capital City and shops. I hope to be back again", "title": "Hope to go back", "user": "Marc1560", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159889157}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "There is a lot about the Hilton that we like...the pool area and gardens, the breakfast, the room size, the proximity to restaurants, nice walks and transport. On this occasion we had some disappointment with the room in that we had booked through Chevron (best value) - the offer was for a twin room but we had requested a double if possible...this was months ago.On arrival, the receptionist said they had not understood the request (but no-one had contacted us in the months since booking to check) and that the hotel was full so no double available but they would push the twin beds together - hardly the same. Also the bath took 30 minutes to run and the air conditioning was centrally operated for the first 5 days and too hot at night - we were offered a fan but it never materialised. One big positive was the housekeeping which was superb. Also we didn't have to pre-authorise the credit card on this occasion which was a definite plus.", "title": "Still like this hotel a lot", "user": "HeatherDavid", "date": "May 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159735673}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel has a mixture of clientele, both business and vacation, but we never once felt that we were out of place. The staff are friendly, efficient and dealt with all our queries promptly. Our only small issue was with the tv in our room, which had a mind of it's own and decided to swtich on at 3:30am each day. It took the hotel about 5 days (of a 7 day stay) to sort this out, but we understood it to be a central issue. We did receive an apology and a nice bottle of wine from the Deputy Manager on duty.", "title": "Honeymoon in Malta", "user": "1034Happy2", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159632273}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The breakfasts were fantastic, and extensive. We had spoiled ourselves with an Executive room, so can also confirm that the Executive Lounge was spacious, quiet (most of the time) and well kept. The staff in there were extremely helpful to the extent that they actually booked our flight home, due to issues with the computer access in the Lounge. The food and drink provided in the lounge was also of very good quality.", "title": "Great stay", "user": "Floridachick2606", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159605578}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We had a pleasant stay. The rooms were large, clean and well appointed. The pool was nice and the view of Spinola Bay was lovely. The breakfast buffet was great.", "title": "Nice Stay", "helpfulness": 1, "user": "ntm4", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 118259803}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Loved our stay here for the second time , beautiful rooms and excellent service and staff . The hotel boasts 4 swimming pools , beautiful restaurants and views of the Marina or the Meditteranean . It is located in St Julians and only 2 minutes walk to shops and restaurants . Malta offers so much history and sightseeing and this is the perfect place to stay . We would definately stay here again .", "title": "Hilton Malta is a gem !!", "helpfulness": 1, "user": "Margaret R", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118167602}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Just back from a week's stay in an executive room. We liked a lot of things about the hotel though there were a few niggles. Good and not so good were as follows", "title": "Mostly good", "helpfulness": 3, "user": "Crellins", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118148298}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Good", "title": "A must stay", "helpfulness": 1, "user": "kathleenl28", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118100958}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Location - Spinola Bay is lovely with a great choice of restaurants, super prom to walk along and a half hour's walk to the ferry/water taxi over to Valetta.", "title": "Hilton Honors Program Benefits and the Concierge Staff", "helpfulness": 2, "user": "LarSab", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118051466}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "Its quite hit and miss with 5 stars so to put your mind at rest I think this is the best one in Malta. Rather than go on about the normal things it worth mentioning the following.", "title": "Best hotel in Malta", "helpfulness": 1, "user": "HelloWorld4", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99737757}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "1. For swimmers the indoor pool is good for doing lengths as long it is quiet which it usually is. Outside in summer there is another rectangular pool for swimmers plus another 2 very large strangely shaped pools where families would be better suited.", "title": "Best two weeks ever!", "helpfulness": 2, "user": "MollyMick", "date": "March 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99568732}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "2. You have a high probability of getting a room with a nice view because almost all look out over the sea, the pool or the marina. I mention this because at other Hotels not paying for a sea view means you get a nice room with a rubbish view.", "title": "A comfortable hotel in a great location", "user": "DMcGain", "date": "March 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 99565795}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "3. The WiFi is fast but you have to pay for it. That contrasts with another 5 star I stayed at where it was free but slow in the sense you could surf but not skype. There is a Macdonalds 5 mins from the Hilton where WiFi is free.", "title": "Quality hotel in peaceful location", "user": "Belcasino", "date": "March 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99558028}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "This time I came to Malta I could only get availability at the Hilton for 4 days and had to spend the remainder at another 5 star and next time I wouldn't go till I could get the whole 7 days at the Hilton.", "title": "A Jewel on the Med", "user": "Jetdriver21", "date": "March 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99433674}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I travel frequently to Malta and Hilton is definitely the preferable choice. The gym and the breakfast variety at Oceana restaurant are always a hit with the business travelers, and it's great to have the fresh cup of coffee outside looking at the sea. If you are after the modern amenities then request executive room, otherwise for holidays deluxe room should do the job for you. I'm not a fan of the room service, but love the Blue Elephant and Quarterdeck Bar.", "title": "Good location and service", "helpfulness": 1, "user": "Ganfina", "date": "April 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 102784187}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Great location overlooking Portomaso Marina. Wonderful views of the sea or the Marina and a large pool area to sun bathe. Excellent facilities with friendly staff. Very clean. The best Hilton I have been to. Recommended.", "title": "Wonderful location, top hotel", "user": "Maurice100", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102595280}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "A very well kept resort with friendly staff. The appartments were a good size with all the amenities you could need. Overall a very pleasant stay.", "title": "A very well kept resort", "user": "worksmt", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 102338986}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Stayed there in the last week of February whilst Libya was being evacuated so the hotel got very full with refugees. Unfortunately the weather was not good but there you go.", "title": "Excellent Hotel", "user": "Mid_Calder_Jambo", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 100481514}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Lovely room in a Relaxation Suite, if I had a coplaint at all it was that there maybe should have been a sofs rather than 2 chairs.", "title": "Couldn't have asked for more.", "user": "Dinesh5164", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100100801}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We have stayed at this excellent hotel on several occasions and find it better on every visit. The staff are friendly and experienced and the Hotel has the best facilities on the island. I would recommend the Hilton to anybody who seeks the best without fuss. Truly international clientele adds to the experience", "title": "The best in Malta", "user": "Geoffrey A", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159521734}, {"rating": 4.0, "title": "An excellent luxury hotel", "text": "Given the raggy scenery of Malta seashore, the location of this hotel offering an easy access to the sea is already making it a good choice. Most of the rooms are facing the numerous pools, and the sea, while some others face the quiet Portomaso marina. Don't expect any specific Maltese decoration in the rooms (it's a Hilton after all), but the common areas like the lobby and its huge bar and stairs do confirm you are in Malta. Having spread the restaurants and other facilities throughout multiple floors actually helps bumping into crowd any time you want to go somewhere. By walking distance, you will find most of the restaurants of Saint Julians, as well as the bus stop with all the lines taking you to Sliema or Valletta. And if you plan to stay in for lunch or dinner, definitely plan a dinner at the Thai Blue Elephant, or try the brand new Brasilian place at the Marina.", "user": "GVendryes", "date": "May 2, 2013", "id": 159477303}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Finally, the concierge is a great help to make your visits and trips the best ones. His address book for services is huge, and he should be able to meed any need!", "title": "A Fine Hotel for Business or Leisure", "user": "SurreyRobin", "date": "May 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159439652}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "My third single night business stay at this Hotel. Each time I leave I wish could have stayed a bit longer to enjoy it more in a \"Holiday mode\". Difficult to fault really: maybe a bit pricey for a Holiday stay but that depends on the packages on offer, I guess. Certainly ticks all the boxes for an extremely nice Holiday resort hotel and well located. Has an exceptionally well laid out and attractive pool area with a number of pools to choose from.", "title": "Huge hotel premises, nice stay in Malta", "user": "Pawel_Lew", "date": "May 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159372202}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "I spent two nights in Hilton Malta just this april during short business trip with our clients. The hotel itself is very nice, buildings are designed nicely. It sure is very large hotel however it is not difficult to get around.", "title": "Great Location and faultless service!", "user": "Vickysreport", "date": "May 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 159329054}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "It was our 2nd anniversary and was supposed to be something special. The accomodation in Hilton was very nice, beautifull room with a view of the mediteranean sea directly from our bed and bathroom. It was nice to brush our teeth with sea view...", "title": "Anniversary", "user": "Mesi1", "date": "March 6, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99091214}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We had only one problem during the stay but it was unpleasant. The heating in the bathroom did not work. They fixed it for us though.", "title": "Not just for business...", "user": "Hotel_warlock", "date": "March 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99007806}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The staff was polite but not over - friendly. The breakfast was quite pleasant - good variety of tasty food and the Oceana restaurant has a beautiful view of garden, pools and open sea.", "title": "Truly deserves its five star status as does ALL of the staff", "helpfulness": 2, "user": "stevenmorley", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 98663288}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The Blue Elephant restaurant was amazing, we definitely recommend it.", "title": "Potentially good but not for us.", "helpfulness": 2, "user": "pma262", "date": "March 1, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 98560061}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Overall we really liked this hotel and would not mind returning.", "title": "What an amazing hotel in everyway.", "user": "becky12345", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98401839}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We have just come back from The Hilton Malta after staying there for 1 week. We found the hotel ok, but nothing that special. We were on a Bed & Breakfast board & the breakfast (which was self service) was actually very good and of a high standard. We ate one night in the hotel, which was a buffet and the food was awful. Very little selection, the potatoes were hard and tasted like they had sat there for hours, vegetables weren't nice but the lamb we had was ok, again nothing special. We asked for a glass of tap water & was refused because they don't recommend their guests to drink it.....the reason for this.....probably because they charge 5 (Euros) for a medium sized bottle of water. We found the hotel very expensive. A cocktail, Pina Colada for example, which wasn't that big and full with ice cost 8.95 (Euros). A total rip off in my opinion. They also cater alot of private functions, especially weddings. We saw 2 wedding ceremony's take place by the pool and the receptions in the evening, which were held outside where the balconies face. The music was so loud we complained to management & asked when the music would stop & they informed us 12.30am. Not impressed as we had to be up at 7am the next morning. The music was a band & singer, but the singer was awful....couldn't even hold a correct note! Even with the balcony doors shut & our tv on, we could still hear the band very clearly. You wouldn't expect that from a 5* hotel. All in all, the hotel was ok, I probably wouldn't go back there, although alot of people in Malta say it's the best hotel on the island. But I felt that they put more effort into private functions rather than the guests that are staying there.", "title": "It wasn't anything special", "helpfulness": 2, "user": "Danni O", "date": "September 10, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 117905779}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The hotel and its staff were second to none. We stayed during September with family and had two suites - the breakfast was exceptional and the rooms we had were wonderful. The only criticism I personally had was that the price of drinks whilst around the pools were very dear. Overall though, the location is perfect. We went around in taxis, used the Arriva buses and tried loads of restaurants and bars. The only thing I did not like to see were the horses working the rides around the town both in the heat and the slippy roads. It seemed quite upsetting in this day and age. However, Malta is a sight to behold and one to visit. Yes the Hilton does have weddings, fireworks, etc, but surely that is all about a holiday - the noise is there but not particularly noticeabe. Enjoy.", "title": "We loved the hotel and are pining for it now", "helpfulness": 1, "user": "VENTRISJUBJUB", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117902832}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Just spent a week at this hotel in Room 1057 which is in the new wing (2 yrs old). Went from 2 September to yesterday. First impressions are very good and when you walk around St Julians you realise that the location of the hotel is perfect for other restaurants and shops etc. We paid more for an Executive room (see other benefits later) which was nicely fitted with lots of wood. The bathroom I must say was huge, with an enormous bath and a separate walk-in shower. What I liked about it was that the shutters in the bedroom could be slid along so that from the bathroom you could literally see through the bedroom, through the balcony, out onto the sea! A great view when showering, believe me! The room was always kept spotless. Unless you put the appropriate sign on your door at night you will be woken up by room service to clean the room around 8.30 so if you want a lie-in, put the note on the door ;-). This was my first stay at a Hilton hotel-usually I find these chains too corporate and we prefer to stay in upmarket boutique-style hotels. But we couldn't fault this hotel. We had breakfast in the Exec Lounge a few mornings which was fine but, as 1 of the other reviewers has mentioned, the choice is MUCH bigger downstairs in the Oceana restaurant. Every morning we managed to get a table outside by the pool (we had to wait all of 5 mins one morning, LOL) which was quite something. It just sets you up for the day, having that view in brilliant sunshine first thing. The omelettes are lovely, thanks to Stuart on the counter-very friendly again. The pools are also first class-there are 4 and we tried 3 of them during the stay. You can have afternoon tea with sandwiches and cakes in the afternoon-all complimentary in the Exec Lounge as well as drinks and snacks (calamari, mini-burgers-all delicious) in the evening and sit on the balconies overlooking the pools. Special mention goes to LISA on the Exec Lounge Reception. She is genuinely lovely with a unique disposition-exactly what is needed to provide outstanding customer service. Nothing was too much trouble. She even showed us a different room (only because, yes we had a sea view room but the view was not as good as some of the older rooms) but when we saw the older room we decided to stay where we were because the new rooms are MUCH nicer and bigger. She came to say Goodbye when she left on Thursday evening because she knew she wouldn't be there on our last day. She really is lovey as well as being very efficient at what she does. Another thank you goes to Fabio who always chatted to us in the Exec Lounge as well as in the pool cafe- genuinly friendly guy-Good Luck for his wedding next year!. Cheryl was also lovely with a big smile (pool cafe). We decided not to eat at the hotel restaurants in the evenings because we prefer to eat outside and there is plenty of choice very close to the hotel, literally 5 minutes walk away. A superb experience. We will be back!", "title": "Excellent hotel and staff-a WOW experience.", "helpfulness": 3, "user": "PeterWarren", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117901301}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We spent 14 nights here on our family summer vacation. We stayed in a Panoramic Suite on the 8th floor 822. The two rooms making up the suite were large and well furnished and unlike the standard rooms we saw were carpeted which gave an added luxury feel and probably improved sound proofing The bathroom whilst clean and functional wasn't 5 star. The shower was too small for me to use particularly as it had a curtain rather than a door. The general standard of housekeeping was excellent and never intrusive although we religiously used the do not disturb and please make up our room signs. The balconies, one facing the pools and the sea and another wrapping round from the pools, sea and into the marina were fabulous. We had room service dinner three times to take advantage of them and were treated to several firework displays throughout our stay.", "title": "Fabulous holiday, great resort, great staff", "helpfulness": 3, "user": "SeabridgeSojourner", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117865504}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The pools were super. Yes towels were out as early as 0730 but when I wandered down to claim our spot between 0900 and 0930 I never failed to get a decent pitch in more or less the same place everyday.", "title": "Lovely hotel & service", "helpfulness": 2, "user": "spindodds", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 117752599}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I have stayed in this hotel for a week and have loved location, the clean & spacious room, the lovely sea view from the room, the pools, as well as the food in the Italian and Thai restaurants. The hotel itself is very nice with an amazing view from the lobby and is located in the beautiful & romantic Portomaso marina where you can find a few other nice places to eat and drink. As Malta is generally lacking beaches the hotel does not have one, however there is a nice one quite close (10 mins walk). Loved my stay in this hotel and will definitely return when back in Malta.", "title": "Have really enjoyed it", "user": "Alina781", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116393070}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Upon our arrival we were amazed by how beautiful the hotel was. All along our stay, we enjoyed it's location, ammenities and facilities.", "title": "Great hotel, can do better with the service", "user": "AvivLeshem", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 116377398}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Service wise they have room for improvment: They tried to put us in a \"Marina view suite\" although we booked and paid for a \"sea view suite\" - they wouldn't budge, but we insisted and it was worth it.", "title": "Fantastic hotel well worth its 5 star rating!!!", "user": "angiemc63", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116348776}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "In addition, they don't have a turn down service which one would expect in a 5* resort.", "title": "Best Hilton I've ever stayed in", "user": "itsnotclubbing", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116335321}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Also, on 2 nights they had big loud weddings which went on and on until after midnight, and gave us a hard time falling asleep...", "title": "Excellent Hotel highly recommend", "user": "jeanwood2", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116327593}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "this is a lovely hotel in a very pleasant location, from what I could see all rooms have either a sea view, a pool view, or a Marina view.", "title": "beautiful hotel lovely staff proudly displaying trip advisor certificate in the lobby but ...", "user": "JJ565", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 116949106}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Ours looked over the Marina, had a large balcony with table and chairs, a very comfortable king size bed, sufficient wardrobe space and hangers, and a nice large bathroom. However this is a Hilton and in practice I would expect everything I just mentioned. It was clean, air-conditioned, had a mini bar, and a coffee / tea tray. But at €180 + euros per night the provision of one small and one ( smallish) bath towel was a penny pinching niggle. No bath robes were supplied to compensate for the sparsity of towels. room servicing seemed haphazard, done at 7.30 am one morning but we still had the same two small damp towels at 3.30pm and 3 showers later, the next day, if you want your room made up then it seems use of the door hanger \" please service my room\" would be prudent. check out is 12 noon, use a do not disturb sign if you want to be left in peace, the hotel could not offer us a late check out and we were knocked up at 8 am on our last day to be asked when we would be leaving!!! The same member of staff returned at 10am to reask the same question, only to be given the same answer we had given 2 hours previously.", "title": "As you would expect", "user": "frednred", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 116902477}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "on arrival it was nice to be greeted with a complimentary glass of juice after a hot taxi ride from the airport, we arrived before the check in time of 2pm and it is August so it was not a surprise to have to wait for the room, the staff were very helpful and offered luggage storage. Not actually unexpected in this class of hotel...... but a 40 minute wait after finally being checked in for the luggage to be got out of storage was a little annoying.", "title": "Splendid hotel, fantastic friendly staff, just what a holiday hotel should be", "user": "jfd40", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116889140}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "the hotel has 4 large pools, and a couple of tiny childrens pools, it has a lovely outside area with lots of sun beds and an adjoining beach club with more terraces, again no more or less than is expected for a hotel of this quality but............get up early if you want a sun bed with a sun umbrella, a lot of the umbrellas are broken! they look lovely down but in the med in august they need to look good and function when up! the hotel allows towels on sun beds! even at 7.30 in the morning. the staff ration pool towels to one per guest but the sun beds are mostly claimed by 8 am. and staff rationing of towels appears to start at around 9am found this practice to be a huge nuisance, but had to join in over the weekend just to have a spot to lie in, having not been able to find a sun bed and umbrella / shade on the two preceding days.", "title": "Good business hotel", "user": "Briantom", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 116824049}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "the food in the hotel is very good, breakfast is taken buffet style in the oceana restaurant, we are early risers so never had a problem getting a table but were shocked by the queues that formed around 9 am. There is a fantastic choice of food and no-one could possibly have any reason to complain, Stuart the egg chef is a multi tasking genius, cooking omlets pancakes, fried eggs to order whilst conversing in at least 3 languages. my tip get up early!", "title": "Great Locale, services need to be improved", "user": "chinmayee", "date": "August 15, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 116743581}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "As Hilton Honors Gold members, we've come to find Hilton chain properties consistent in quality and amenities, but at Hilton Malta Portmaso we came away with mixed reviews.", "title": "Highlights and lowlights", "helpfulness": 4, "user": "RoseB51", "date": "May 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160309780}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed for three nights during French school holidays in May. I should have read more closely in the website, but it is NOT easily apparent that the beach club and facilities for kids are only open during the summertime. (In fact, it touts the year-round pleasant weather being amenable to outdoor activities at the facility.) As children under 16 are not welcome in the gym, the adult pool, the Jacuzzi, or even to ride the elevators unaccompanied, it became apparent that my pre-teens were not going to be able to enjoy many of the fantastic facilities. To add insult to injury - the weather was far more beautiful in early May than most summer days in England, Ireland or France - setting the tone for our experience at Hilton Malta. It was clear that the hotel caters to conferences, honeymooners and retired couples - not families. That said, there were some positive experiences too. I'll just list the pro and cons to save space:", "title": "honeymoon", "user": "MartineL465", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160266466}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Pros:", "title": "nice honeymoon", "user": "Elisabeth M", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 160673197}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "- rooms were spacious, clean and nicely appointed", "title": "Arguably the best hotel in Malta", "helpfulness": 2, "user": "Leksand", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159975415}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "- lovely sea views", "title": "Fantastic location and hotel", "user": "Bill M", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159962593}], "location": {"country": "Malta", "continent": "Europe", "city": "Saint Julian's"}, "stars": 5, "variance": {"poor": 35, "average": 114, "very good": 442, "terrible": 21, "excellent": 1241}, "aka": "Hilton Malta Hotel", "slim_ranking": 0.0740740740741, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Ideally located in the prestigious Portomaso development within the fashionable district of St. Julian’s, the Hilton Malta hotel has come to represent the style, comfort and hospitality for which the Hilton brand is renowned. Standing as a centrepiece of the coastline and an intrinsic part of the Tumas Group’s flagship design, Hilton Malta sits comfortably alongside Portomaso Business Tower, the Residences and Yacht Marina in one of the most exciting and dynamic property developments anywhere in the Mediterranean.With remarkable views of the Mediterranean, the 410 rooms and suites available offer the discerning guest unrivalled relaxation and comfort.The hotel’s Classic rooms and suites are furnished to high standards in a Classical Maltese decor, producing a blend of luxury and traditional warmth. All Classic rooms and suites have a balcony or terrace overlooking the prestigious Portomaso Yacht Marina or offer spectacular views of the Mediterranean Sea.The hotel’s Contemporary rooms and suites are tastefully furnished in contemporary Mediterranean style."}