{"user_rating": 4.5, "review_count": 2236, "name": "Hilton Dubai Jumeirah Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "My husband, myself and our 2 college age kids stopped in Dubai for a 3-night stay after our visit to the Maldives. As Hilton Honor members, we chose to stay at Hilton Dubai Jumeirah, instead of the many other hotels nearby. We are glad we did, because we really enjoyed our stay.", "title": "Great Stay!", "helpfulness": 1, "user": "gccc116", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 91447285}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Pros:", "title": "One of the best Hiltons that I've stayed in", "user": "Sappers62", "date": "December 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91211249}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "Since we had an early arrival, I have e-mailed the Hotel to request for early check-in before leaving on our trip. Our flight arrived at 3AM and we arrived at the Hotel around 4:30 AM. The front desk informed us that they are still on the previous day's calendar, but will try to accommodate us as soon as possible. About an hour later, we were told our rooms are ready and we got into our rooms at 5:30AM!! That is some fantastic customer service!", "title": "Excellent hotel", "user": "Moochop24", "date": "December 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 89680227}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Location of the Hotel is central, with lots of shopping and restaurants right outside. It had fantastic water views and out of our balcony, we can see the Palm Island!", "title": "Even better than last time", "user": "Bjørn R", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89181412}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The housekeeping staff is great! The bell staff (guys who hail Taxis for us) is super friendly and very informative!", "title": "Average only", "user": "Travelteh", "date": "November 29, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 88596509}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "If you want to enjoy the best of Dubai and also relax by the beach, this is a prime location! This was our first 2 day short visit to Dubai and we spent 3/4th of a day in the hotel and on the beach. This beach to close to good restaurants and fast foods like Subway. It is close to great night life as well.", "title": "Beautiful hotel - Great Location!", "helpfulness": 1, "user": "Nans74", "date": "October 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83494235}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "* The service in the hotel was outstanding!! They couldn't do enough for you.", "title": "Everyone has to experience Dubai for themselves!! LOVELY!", "helpfulness": 1, "user": "ellieking100", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83308085}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "* I shared a twin room with my elder sister which had plenty of room for 2 messy women. The room had a balcony with a stunning view of the beach,ocean, the Burj Al Arab hotel in the distance and the Atlantis Hotel. The room also came with a mini bar, 2 bottes of complementary water per day, turn down service. The en suite bathroom was amazingly clean, mainly marble, fab shower/bath.", "title": "Nice hotel, great location.", "user": "MrsCJ7", "date": "October 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82604887}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "* The hotel has it's own stunning private beach which is incredibly clean, no litter whatsoever. There is security on the beach to make sure its only hotel guests that are using it. There is a \"beach butler\" service where a water drives round the beach to bring you drinks and complementary watermelon. On the beach there a vast choice of water sports inc banana boats, rings, water skiing etc. There are also 2 resident camels on the beach which you can ride if you wish. The spa in the hotel is amazing!!!!!!! the facials were fantastic and over an hour. The swimming pool was amazing as it was over 44 degrees the pool was always cold and very refreshing. It had a pool side bar and restaurant for lunch, could also smoke shisha.", "title": "Disappointing", "user": "EbbieSue", "date": "October 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 82437999}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "* My favourite parts were when we got picked up from the airport by a Hilton driver in a Range Rover Vogue. I went on desert safari with my sister, you got picked up from the hotel and drove down sand dunes for a few hours which was so much fun then we were taken to this outdoor area where we watched belly dancing had an outdoor bbq, henna tattoos, rode camels. This was fantastic highly recommend it, it lasts between 4-10pm so you see the sun setting in the desert. I'd recommend going to the Burj Al Arab for drinks in the \"sky bar\" but you have to pre book. Also go to the Dubai mall and the emirates mall, the Dubai mall is better though as it has an aquarium inside with sharks in. It's very much like Las Vegas, it's very man made with no history whatsoever. And i wouldn't go to the gold souke it's full of men trying to sell you copies of designer goods and quite scary, there are no tourists there.", "title": "Great place for a stopover on the way to London!", "user": "twogirlstravels", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81912234}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We had just spent 10 nights in the Maldives and decided that stopping off in Dubai for 3 nights would be a great way to break up the flight back to England. I booked the Jumeriah Beach Hotel. I booked it whilst we were in the Maldives as a spur of the moment thing, We read the reviews and they were fantastic. The only thing we were worried about was the 50 degree heat. But Dubai have that under control. Air con everywhere even in the streets.", "title": "LUXURY", "helpfulness": 1, "user": "melissa116", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87910274}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel was AMAZING. The decor was stunning and they had loads of little touches. The escalotors only moved once you were on them. They had surround sound system in the bathroom and a line so that you could dry your bikini. The beds were luxury with lovely thick feather duvets and comfortable massive beds.( We put the air con on so that we could use the duvets) We had a balcony which was nice.", "title": "Nice hotel in nice location", "user": "tnc2u", "date": "November 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 87626316}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The food was 1st class ( I am so fussy with my food but the breakfast was excellent) freshly cooked omlettes and pancakes. Massive selection of juices. Just luxury.", "title": "As good as last year", "helpfulness": 2, "user": "Markate", "date": "November 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87535169}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Then there was the huge screen on the beach. My partner was happy he watched the world cup whilst I sat on the lounger. Excellent service with beach boys serving drinks and snacks.", "title": "2nd stay not disappointed", "user": "notrevo", "date": "November 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86817108}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Taxis are really cheap only cost 6 pounds to get to the hotel. Also there is a hotel bus to the city centre. But a taxi is really cheap as well.", "title": "well located beach hotel", "user": "Maltonian1", "date": "November 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 86665478}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Have just got back from staying at this hotel.I would rate it as a good four star rather than a five.Generally a nice hotel but starting to look a little dated and small compared to others on this area of the Walk.The pool area is way too small and very busy (and much of it not exposed to the sun for much of the day),make sure you're up early to put your towel out and aim to be on the right hand side of the pool if you look at it from the Oceana restaurant.Beach area very good though.We did have some problems upon checking in,we had confirmed that we would require an earlier than normal check as were travelling with a toddler but upon arrival were told that priority for the current rooms available were given to Virgin guests as a priority! (we were with Emirates). Not happy but was eventually sorted out by Michael the assistant manager,who was great.After an hour though,did have to go and find our luggage. Rooms of a good standard but had a flood of water coming from the base of the bidet in our room and waited twenty minutes for maintenance to come,we had stemmed the flow with our towels,which they did not replace until asked for.Service at breakfast in Oceana was very slow around peak times with people often to having to wait in lounge until called and breakfast was a bit chaotic.Lunch & dinnner better but again service could be quite slow for things like ordering drinks.Biggest criticism would be that service around the pool was a bit slap dash with the staff often just messing around with each other.On one day ordered two orange and lemonades (7 Up) and the barman refused to give me what was left in the can,even though I'd paid for it! Said it would be re-used ?? Upon checkout and settling my room bill in cash,was even short changed! Like I said,not a bad hotel but not a five star service,which is what you are paying for. But .... love Dubai and can't wait to go back. Would I go back to this hotel ? Probably not.", "title": "Good but not quite a 5*", "helpfulness": 3, "user": "spkreview", "date": "November 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 85573052}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "All Hilton properties should base their service model off of the Hilton Jumeirah! I was just amazed by the staff. We were picked up at the airport in a 7 series BMW. The driver was so polite and professional, answering all of our questions about Dubai. Check in was simple, and we were quickly shown to our room. The room itself was lovely. The only negative is that we faced the cultural center that neighbors the hotel, but we were not alone in that regard. Every time we walked through the lobby, we were greeted by name. On the second or third day of our stay, my husband left his room key behind. I saw it and brought it to the front desk so he could retrieve it later. I went to give the receptionist my room number, and she said no need, and again called me by name. I was amazed! Our room was actually cleaned every day as well- I don’t mean that our bed was changed and that we received fresh towels. It was cleaned. Very unusual, but a nice touch.", "title": "The best Hilton I have ever stayed in", "user": "NoraNJtoLondon", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84869979}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The breakfast buffet was bountiful, fresh and tasty. I ate lunch at the pool most days- unfortunately the service quality at the pool was nowhere near what I expected based on my experience in the hotel itself. The staff didn’t seem to want to take lunch orders, so I would walk up to the bar (even though they were standing around and walking in my general area). After bringing lunch, they would again forget about me and not collect the dishes. This is a bit of a problem when the property has aggressive birds that wait for the leftovers. Why could the staff not be bothered with this?", "title": "Best holiday/service to date!", "user": "SusyLincoln", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84788805}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My only complaint is with the wake up calls. My husband needed very early wake up calls. Even though this is a high end hotel, the phone calls were automated. I thought this was pretty tacky and low-end. The system was also very annoying to deal with. In order to not receive a further barrage of calls, one must enter the room number on the phone’s keypad. This is easier said than done in a dark room. One morning we received no fewer than 5 wake up calls before I called the front desk to have the calls stopped. I would expect this at a two star hotel, but not at a property of this class.", "title": "Fantastic hotel", "helpfulness": 1, "user": "millymooEngland", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84322992}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Stayed at Hilton Dubai, Jumeirah for 5 nights with husband and 15 year old son. From checking in to checking out the politeness and attentiveness of the staff never waivered. They couldn't do enough for you and did so willingly without us feeling pressured to constantly tip. Location of the hotel was perfect for the beach and for an evening stroll along The Walk. Cleanliness of the hotel and rooms could not be faulted, amazingly clean everywhere we went (puts the UK to shame in my opinion). The main attractions of Dubai were only about a 30 min tax ride away and the taxi fares were cheap. Food in the hotel was of an excellent quality and reasonably priced. Special note to the BiCE restaurant which was superb and Michael our waiter was brilliant . We would definetly go back and hope to next year.", "title": "Amazing", "helpfulness": 1, "user": "lpile", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83942549}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Dubai"}, "stars": 5, "variance": {"poor": 59, "average": 144, "very good": 600, "terrible": 43, "excellent": 1390}, "aka": "Hilton Dubai Jumeirah Hotel Dubai", "slim_ranking": 0.16631130064, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "This 5-star Hilton resort hotel is located on Dubai's famous Jumeirah Beach and ‘The Walk’ boulevard offering guests endless shopping, dining, and leisure activities. Its swimming pool is set within charming palm tree gardens bordering a private beach with sun loungers and one of Dubai’s best beachside dining restaurants: Wavebreaker. All guest rooms at the Dubai Hilton Jumeirah Resort offer partial or full sea views and a marbled bathroom with luxury amenities. Guests can also enjoy award winning dining options like BiCE which was voted Dubai’s Best Mediterranean, 2012 by BBC Good Food. Or the lively Pachanga which hosts salsa and tango lessons as well as a churrasco night each week. Dubai Marina Metro Station is a 10-minute walk from the hotel and shuttle buses service a number of shopping malls daily like the Mall of the Emirates and the Dubai Mall / Burj Khalifa. Free on-site private parking is available."}