{"user_rating": 4.5, "review_count": 188, "name": "Hilton Garden Inn Blacksburg", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "This is the second time I've stayed at this Hilton Garden Inn. This hotel and staff get 5 stars! Customer service is second to none. The staff arranged dinner for our group of swimmers, opened the breakfast buffet early so the swimmers could eat before they had to be at the pool. Great location, immaculately clean. Would stay there again without question", "title": "Awsome hotel", "user": "wcarol", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100247692}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "On a long weekend away for a swim meet for our children. Hectic schedule at the pool was made a bit easier by the extremely accommodating staff at the hotel. They prepared hot breakfast early so the swimmers could have something nutritious prior to heading to the pool and despite being swarmed at 6 am each morning they continued to smile at each sleepy swimmer giving their order. They were just as friendly at 10 at night as we made our way back to the hotel for a late night meal.", "title": "Wonderful service everything we needed with a smile", "user": "sayounger", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100184330}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Stayed at this hotel for the second time when my family with teen-agers traveled to a state swim meet in the area. The hotel was accomodating to a huge group of swim families, including opening up the awesome breakfast early and having their restaurant prepare a last minute request for a pasta dinner for 30 swimmers. The rooms were comfortable, very clean and exceptionally quiet despite having a full hotel. There is a small friendly bar in the lobby, an indoor pool and jacuzzi and one of the largest fitness rooms I've ever seen at a hotel. Staff was friendly and very professional. Definitely recommend this hotel to all types of travellers and we plan on staying there for future swim meets!", "title": "Awesome Hotel - accomodating and something for everyone", "user": "lauracvit", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100120762}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I love staying at most Hilton Garden Inn. This one was good as well. The service was VERY GOOD. The breakfast was great! The location was ideal!!!! The rooms were clean however, the noise level was unacceptable! When my friend checked out the reviews, someone wrote that the hotel had a noise problem and they recommend getting a room on the top floor. OMG!!!! I should have listen to her! We stayed on the 2nd floor and we could hear every foot step that the people made staying above us!!!!! Not only that, when someone would use the card key to get into their room, it sounds like they were entering our room as well???? I am not sure that I could recommend this hotel. Yes, if you get a room on the top floor????", "title": "Nice but .........", "helpfulness": 1, "user": "MYBBS", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 97936393}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I've stayed at dozens of HGI's and Hamptons. This hotel was very well run from the cleanliness of the rooms, comfort of the bed, strong wifi, nice fitness facility and pool. However, there was one glaring omission from the service I've come to expect from Hilton properties. The breakfast offering was pathetic. It was as if everyone called out and they were trying to throw something out there. Normally there is a spread of dry cereals. Today there were two boxes. Normally there is a nice spread of yogurts and freshly cut fruit over ice. Today there were a few plain yogurts on the metal trays with no ice and no fruit. The \"waiter\" was also the server. I witnessed a number of people ask him if they are open and he just ignored them. A few minutes later he would ask what they wanted.", "title": "Very comfortable and clean, horrible breakfast", "user": "kmq102", "date": "January 18, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93526623}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I cannot say strongly enough how wonderful this property is. The staff is great, friendly, helpful. The property immaculate. Absolutely nothing to gripe about.", "title": "Hands Down -- The Perfect Property", "user": "I-heart-Travel", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114713489}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "What a great place to stay! The people are nice the room is spotless and most importantly the bed is amazing. I wanted to pack it up and take it with me! I travel a lot and this has got to be the best sleep I have gotten in years!!", "title": "Best nights sleep we have ever had!", "user": "workingmom58", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 111422642}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I stayed a total of four nights during an off-cycle time in the college school year. The hotel was in great shape and had excellent amenities and attentive service. The only problem was the noise level, and it was a significant detractor. I could hear every step of the person above me, as if it were amplified by the ceiling. Since the person above me was late to bed and early to rise, it made for a trying few days. On the last night, several groups of college students (golf teams) tromped in to my floor and the floor above me around 11 p.m. and carried on noisily for an extended period of time getting settled. Everything about the hotel was clean and in great shape, including the workout room. It's a shame the management/owners didn't apply the same level of attention to its design. I would recommend staying here, but only on the top floor and, even then, it's probably worth inquiring whether there are any anticipated sporting events at Tech before you book.", "title": "GREAT Amenities, but too much noise top to bottom", "helpfulness": 1, "user": "klbell37", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 109525060}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My daughter and niece both go to VTech and I came here with my wife to visit them from CA. My Alma Mater is VT so I know the area very well and still have some favorite restaurants that I visit. Although, I have never stayed at this Hilton, I enjoyed my stay; no complaints from the wife either !", "title": "Great place to stay for VTech!", "user": "Lylesoniii", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106888711}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The Hilton Garden was very comfortable. The fact that they had queen sized beds, rather than double beds is one of the reasons why I chose this hotel. Also, the fact that it was close to Virginia Tech was important.", "title": "Clean, comfortable stay.", "user": "LC_from_NJ", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105477022}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This Hilton Garden is new which is always a plus. It is located in an area with not much else around except some condos. You have to get on a highway to get to dining and shopping. I can see however that it would be very convenient to people visiting Virginia Tech. I don't hesitate recommending this to people that want to stay in this area in a nice, clean comfortable hotel.", "title": "Good hotel", "helpfulness": 1, "user": "Dreaming", "date": "September 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118797577}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Have stayed at this hotel many times...it has always been a pleasant experience. A great location, competively priced and the breakfast is fantastic. My daughter graduates from VT in May and I am going to miss this place!", "title": "Consistently a great stay!", "user": "shellseeker0320", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118653172}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Comfy beds, super clean hotel , friendly staff. A little pricey but worth it. I will return.", "title": "Great stay!", "user": "businesstraveler084", "date": "September 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118090026}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The hotel is very new and it looks it. Well taken care of. The room was clean and the furnishings were great. The service at check in was quick and organized and the breakfast was excellent. No complaints. Will be back.", "title": "Excellent Hotel", "user": "daskoterzar", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117807936}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Nice property. Appreciated the amenities. Very close to Virginia Tech. Staff was friendly, courteous and very helpful. Blacksburg feels like a long drive from anywhere so we appreciated their recognition of our weariness. Room was nicely furnished and beds were very comfortable.", "title": "Pleasant stay", "user": "LifetimeSanDiegan", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116918393}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Our King Bedroom [$90] was large, clean and had excellent temperature controls that responded quickly. The check-in staff were friendly & helpful. We enjoyed drinks & an okay dinner onsite with prompt, helpful wait-staff. Breakfast the next morning was good & reasonably priced. Our biggest disappointment was the incredibly hard bed - I couldn't sleep & my husband slept fitfully.", "title": "Nice Room & Staff but Uncomfortably Hard Bed", "user": "LLDearness", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 5.0, "service": 4.0}, "id": 116780217}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This was my first trip to a Hilton Garden Inn and I'm looking forward to going back and trying others in the brand.", "title": "Modern, spacious and comfortable", "user": "pgolden", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116270232}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The room was very comfortable with standard amenities for this type of hotel - desk, arm chair, coffee maker, refrigerator, etc. Bathroom was very nice with a fully-enclosed glass shower, not a flimsy shower curtain. Name-brand shampoos, etc. were a nice touch.", "title": "Best breakfast ever at a motel, and a nice locale on a country road.", "user": "BaileyC55", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116232384}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Front desk was very helpful. I didn't try the bar and grill, but they looked quite open and welcoming.", "title": "good place", "user": "va_trailrunner", "date": "July 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116038535}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The hotel is located just off Prices Fork Road on the other side of 460. You could walk to VT if you were inclined, but it might be a bit of a hike if you were there for a football weekend or campus visit.", "title": "Best place in Blacksburg", "user": "Traveurcpl", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115901099}], "location": {"country": "United States", "city": "Blacksburg"}, "stars": 3, "variance": {"poor": 0, "average": 12, "very good": 57, "terrible": 1, "excellent": 118}, "aka": "Hilton Garden Inn Blacksburg Hotel", "slim_ranking": 0.111111111111, "description": "Enjoy all the comforts of home while on the road at the Hilton Garden Inn Blacksburg. Complete with refrigerator, microwave, high-speed internet and HDTV, your spacious guest room contains all the essentials for an overnight visit or week-long stay. Adjacent to the VA Tech campus, this hotel is a convenient stop for parents and potential students alike. Forget something at home? The 24-hour Pavilion Pantry has basic health and beauty essentials as well as microwavable meals, snacks and drinks."}