{"user_rating": 4.0, "review_count": 463, "name": "Hilton Garden Inn Monterey", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "clean, decent place to stay.", "title": "good, clean, nice breakfast", "user": "adampsy", "date": "September 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 8655169}, {"rating": 3.0, "title": "Convenient Location But Has Issues", "text": "perfect unless you want to be walking distance from everything.", "helpfulness": 2, "user": "Historiana", "date": "August 30, 2007", "id": 8539389}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "if you want a comfy, clean place to stay at night while going to Big Sur during the day.........this is perfect. (unless you stay down in big sur)", "title": "Grateful for amenities while dealing with sick baby", "helpfulness": 2, "user": "TXRed", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8496915, "likes": {"liked": "— cleanliness and great staff", "disliked": "— access: I had a stroller and had to carry it up steps for access to hotel; from all entrances; I was told there is an elevator but it's location from outside the hotel is not evident"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This hotel is extremely convenient to Route 1 and is also very convenient to the main Monterrey attractions. The staff was very friendly and the breakfast was excellent. However, must note that it was a bit disappointing as far as the cleanliness of the room was concerned. Also, the hotel has a very odd parking situation with most parking under the building. There is insufficient parking if you return in the evening and because of how you have to go from your car to your room I would not feel comfortable recommending this place for a woman traveling herself.", "title": "A great place to stay", "helpfulness": 1, "user": "howden", "date": "August 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 8432090}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My daughter, year -old grandson, and I stayed here 4 nights in late July, 2007 while daughter attended conference. I cared for baby while daughter was working. What could have been a disaster - baby suddenly became ill with virus and very cranky, resulting in my needing to stay inside room most of time -- turned out to be a good stay for me because of the hotel's amenities and staff. The staff was most curteous and helpful -- maids made up the room almost as soon as I asked them to, while I took sick baby out of room for brief time; maids supplied extra towels and sugar and cream immediately when asked; desk clerk rapidly gave contact/address information on emergency medical clinic; there was an adequate selection of channels on TV for me to enjoy while confined to room; pool area was delightful for a break with baby sleeping in stroller -- plenty of comfortable lounges, clean pool, choice of shade/sun seating was adequate. WARNING: we had been under impression hotel was within walking distance of aquarium and all the restaurants, but it would be a long, long walk (and I'm a walker), some of which would be without sidewalks and near busy highways and a freeway. And the hotel's restaurant and lounge were closed during lunch time, so I had no place to eat a real meal while confined to the hotel with sick baby. ONE BIG BONUS: plenty of hot Starbuck's coffee in urns in lobby each morning, and they remained there through mid-morning. I found the room and bath comfortable, clean, and quiet and the lobby area is very pleasant, but the friendly and accommodating staff was what made our stay pleasant.", "title": "Hilton price with a CHEAP MOTEL EXPERIENCE", "helpfulness": 1, "user": "baboocrew", "date": "August 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8429225, "likes": {"liked": "— staff", "disliked": "— noise, small rooms"}}, {"rating": 5.0, "title": "Great Hotel- Exceeded Expectations!", "text": "Got a great rate on Priceline...read some negative reviews but knew that the hotel had been recently renovated. Not as far from the Aquarium, Cannery Row or Fisherman's Wharf as some said- a five minute drive at most.", "user": "SacKing1", "date": "March 11, 2008", "id": 14201459}, {"rating": 4.0, "title": "A Smaller Hiton that Exceeded Expectations", "text": "Loved- the Beds! Didn't want to get up! Didn't want to return home to my own bed! Makes me want to go out and buy a \"sleeper select\" or whatever it was...", "user": "jimboc", "date": "February 20, 2008", "id": 13690230}, {"rating": 5.0, "title": "Wonderful", "text": "Loved- the Gym- Great equipment, all new, state of the art. Loved the TVs on the treadmills. Bigger than most hotel gyms. Complimentary apples, water, towels and headphones...nice touch!", "user": "carrieag1", "date": "December 26, 2007", "id": 11959803}, {"rating": 4.0, "title": "A little far from anything", "text": "Didn't care for: the underground parking. Once we figured out where our room was, it was fine...somewhat confusing....don't bring your suitcases up until you can locate your room!", "user": "kgschneider", "date": "November 3, 2007", "id": 10569091}, {"rating": 2.0, "title": "No attention to customer problems", "text": "Hope to get this same Hotel on future Priceline bidding!", "user": "deb666", "date": "October 19, 2007", "id": 10149774}, {"rating": 5.0, "title": "Great hotel!", "text": "We stayed for one night in February and had a great stay. Bed was comfortable, room was clean and we especially enjoyed the large balcony with a lounge chair and deck chair. Bathroom was small, but clean. Biggest con was that it was a bit of a hike from the parking garage to our room. Lobby was gorgeous and restaurant looked nice although we didn't eat there. We paid around $130 for our room and thought it was well worth the price. Would come back and stay again. Great location right off of Rte 1.", "helpfulness": 2, "user": "NicoleandKyle", "date": "April 2, 2008", "id": 14753555}, {"rating": 3.0, "stay_parameters": "Stayed March 2008", "text": "Pluses: Very friendly & efficient front desk staff; large room; comfy bed w/ nice linens; Nutregina bath products; underground parking; easy access off of Hwy 1.", "title": "A fine stay", "helpfulness": 3, "user": "vegaslover73", "date": "March 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 14671495}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Minuses: Rooms can be noisy (thin walls and noise from hallway - especially cleaning staff with carts that have VERY squeaky wheels); bathroom floor needed to be mopped (dirt in the corners); $225 Saturday night rate was too high.", "title": "decent", "helpfulness": 2, "user": "wownewjersey", "date": "March 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 14671005}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "stayed one night passing through on my way to los angeles. The rooms are small and tight. we had problem the door locks were broken and we were dealing with maintenance at 11pm, after a long day who needs that nonsense, we had to switch rooms. didnot appreciate the inconvenience, they had to know the door locks didn't work,nor did the secondary latch work. it was a clean facility , breakfast was good at the hotel.", "title": "Really happy", "helpfulness": 2, "user": "Baronent", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14538555}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Well, this was our first trip to Monterey with our 4 month old twin boys. The drive from Los Angeles was a trek! But, when we arrived, we were greeted by Dino at the front desk. Right off the bat, I was impressed with the Inn. The lobby is beautiful and warm. The staff were VERY nice and catered to whatever we need. In the first 2 minutes of being there. we were upgraded to a SUITE! The hotel is very clean. Lots of parking. And the gym? WOW! If you want to excercise, this is the place to do it. They spent BIG BUCKS on the machines in the gym. The breakfast buffet? For 12 bucks? The price could have been $20 and I would have STILL been very happy! Great job! We will return.", "title": "Nice Monterey Weekend", "helpfulness": 2, "user": "Eric95403", "date": "March 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 14202052, "likes": {"liked": "— Restaurant on site, 2 queen beds, cookies in the evening in the lobby", "disliked": "— keep the coffee brewing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My wife and I were there in October 2007. This is not a perfect hotel. It isn't even the best Garden Inn I've stayed at since it is older than many of the others around the U.S. But it is pretty much what you would expect for this level of hotel: the rooms were clean and in good shape, the beds were very comfortable, and every member of the staff was very nice and helpful. We're not pool people, but the pool looked good and the breakfast at their restaurant was good enough. It is also in a good location near Monterey and the highway so it has convenience on its side.", "title": "Pretty much what you expect from Hilton Garden Inns", "helpfulness": 1, "user": "SFWorld", "date": "October 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10113945, "likes": {"liked": "— Location- so close to Monterey and everywhere you'd want to go in the area", "disliked": "— Hallway noise makes it into the rooms"}}, {"rating": 4.0, "title": "A good stop over", "text": "The downsides are, as others have pointed out, that there is somewhat more noise from the halls than would be ideal and if the hotel sold out I can see where parking would be a challenge (at least the underground parking). And being in Monterey it is not an inexpensive hotel at about $150/night. But all that said, we slept well, enjoyed our stay and would go back.", "user": "LynnClarke", "date": "October 10, 2007", "id": 10062663}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Nice clean room with view over the pool. Great location close to Monterey. Good outdoor pool with cabanas and open gas fire for the evening. The only down side is the hotel is made of wood and therefore a bit creaky and noisy.", "title": "small, small, small", "helpfulness": 1, "user": "CitiBob", "date": "October 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10040526}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "what you will read in the earlier reviews is pretty much true:", "title": "Nicely decorated, right off Hwy 1", "helpfulness": 2, "user": "Magikarrpet", "date": "October 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10030778, "likes": {"liked": "— Free wireless internet", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Positives:", "title": "Hilton Garden Inn is all that and a bag of chips!", "helpfulness": 3, "user": "Corona_Lights", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8681258, "likes": {"liked": "— Service and location", "disliked": "— Can't thinl of anything"}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 36, "average": 70, "very good": 191, "terrible": 15, "excellent": 151}, "aka": "Hilton Garden Inn Monterey Hotel Monterey", "slim_ranking": 0.283018867925, "description": "The Hilton Garden Inn Monterey just completed a full property renovation April, 2013 and sits nestled among majestic Monterey Pines and mature Live Oaks in a dramatic and colorful garden setting. We are conveniently located near California's scenic Highway 1, ½ a mile from the beautiful beaches of Monterey Bay, and less than three miles from Monterey Peninsula Airport. Our tastefully appointed hotel guestrooms and suites offer: Individually controlled heating and air conditioning, Private outdoor balcony, In-room refrigerator, microwave and coffee maker, complimentary wired and wireless high-speed Internet access and 42 inch flat screen hi-def TV's."}