{"user_rating": 3.5, "review_count": 387, "name": "Hilton Stamford Hotel & Executive Meeting Center", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This is an ok property but nothing to WOW about. At first glance rooms are modern well put together but upon closer inspection noticed that rooms could you with a very good thorough and deep clean. A lot of dust and dirt in harder to get to places . Beds are very comfortable...... had to request an iron in the morning since the one in rooms had been removed. Previous guest had unplugged DSL cables so had to crawl under the desk to get hings connected again. This property beats the Sheraton in Stamford but falls short of the Hyatt.", "title": "Ok but definitely not a WOW", "user": "MTCB", "date": "October 2, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 45689243}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I stay here quite often since my company is only about 1 mile away. It is a great hotel if you are a business traveler and are gold or diamond with Hilton. You will usually get upgraded to the executive floor and then have access to the lounge. The lounge has free breakfast and free drinks/snacks in the evening. This includes alcohol which is really not the norm for Hiltons in the US. International Hilton lounges give free drinks but rarely domestic ones.", "title": "Very good for frequent business travelers with Hilton status", "user": "tulsau", "date": "September 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 42755347}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The rooms are very nice. I've been upgraded to a suite which was very nice and had been completely redone. The bathroom was huge with a rainfall shower and full bathtub. The guy who works in the lounge is almost always there and it really great.", "title": "main issue is noise", "user": "bogman", "date": "September 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 42706579}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "I really don't know why anyone other than a business person would stay here so that may be why some reviews are negative. Stamford is just really not the place for a leisure traveler so any hotel would probably be a disappointment.", "title": "The Marriott Stamford is better", "helpfulness": 1, "user": "sherwin_r", "date": "September 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 41672996}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Another great thing is the fitness center. It is very nice and new. Pool too.", "title": "NIce Hotel for the price, wish they had microwaves for guests", "user": "bertmerc", "date": "September 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 41452548}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Staff was pleasant and accomodating. Hotel offer free shuttle service to and from desired destinations. Five minutes away from indoor-mall. Nice resturants located a few feet away from mall.The hotel and room was very clean!! Upscaled, reasonable priced. The only down side was the location and directions were somewhat confusing-don't be deterred! Well worth it!!", "title": "pleasant stay", "user": "eyesandslouth", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 59624217}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "I ended up at this hotel by chance (Priceline bid) and was a bit concerned based on previous reviews. However, my stay was uneventful and I could find nothing to complain about. I self-parked and perhaps I was lucky finding a space near the entryway to the elevators but I found it very convenient. A trainee checked me in and though I expected the worst room since I booked using Priceline, I was placed in an Executive Floor room which was excellent.. Good coffee, water in room.. excellent bath products and everything was clean. The TV featured several HD channels also - including HBO.", "title": "Much Better Than Expected Based Upon Previous Reviews", "user": "MATennis", "date": "February 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 57128301}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "If doing business in Stamford (particularly at the office park in which this hotel was located), I highly recommend the Hilton. The train to NY is nearby and I was offered a shuttle ride elsewhere. For leisure travel with kids, perhaps this is not ideal but Stamford is not really a tourist destination anyway. Sure, the hotel does not feature free Internet and cheap/free breakfast in the lobby, but that is the case with many hotels in this class. In all, I was very pleased and would stay here again. To top it all off, they had a tennis court!.. too bad it was not summer.", "title": "It was better than I expected", "user": "Constayance", "date": "January 31, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 54854241}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I went for a weekend away, got it through priceline for $60. It was better than I thought based on the reviews. We had to pay for parking which is annoying because there is no other option than the hotel. When I went out I had to park really far away in an underground lot it was creepy The service was better than I expected, there was a hello from everyone! They have a shuttle to take you everywhere which is good since it is in an isolated location. This weekend the pool was closed which upset a lot of people.", "title": "Great Hotel", "user": "ofostermmr", "date": "January 29, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54685217}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "My youth group had a convention at this hotel and it was very clean and comfortable. I was a little nervous when I read a comment about bedbugs but when i called management beforehand they acknowledged that they had previously had a problem with travelers bringing them to the hotel but they immediately clean any room that is suspect and also perform quarterly maintenance and spray for them. I stripped my sheets to look at the mattress anyway and found nothing. The bathrooms are very nicely appointed as are the rooms and I enjoyed staying there. The parking is a little inconvenient but overall i give this hotel a thumbs up and would stay here again (this is my second time anyway).", "title": "The WORST HOTEL STAY! DON'T STAY HERE!!", "user": "carlton21", "date": "January 18, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 53775407}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I stay here several times a month for business and the hotel staff is typically very attentive. The rooms are clean and typical for a Hilton; this used to be another property and Hilton took it over about a year and half ago.", "title": "always clean.....decent value.......attentive staff", "user": "petermd4", "date": "January 11, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 53220820}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "I would recommend this for business travel; also close access to the metro to NYC.", "title": "Bed bugs and bad location", "helpfulness": 2, "user": "lupevt", "date": "December 28, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 1.0}, "id": 52042135}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed at this Hilton for two nights over Thanksgiving. The price was so much lower than the other hotels in the area and we trust the HIlton name, so we booked it. It is located in a difficult spot to find, and locals told us to avoid the surrounding area, especially at night.", "title": "Just a Wonderful Time", "helpfulness": 1, "user": "2UtopianTravelers", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 50383803}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "At first the room seemed quite nice, but on the second night I saw a bedbug crawling across my son's pillow. I will spare you the details, but he had been bitten and we left the hotel at midnight on Thanksgiving. The front desk staff refused to come up and examine the situation, and told me I could not get a refund until management checked it out. Luckily another hotel gave us a great rate and we were eventually able to sleep.", "title": "BED BUGS, NO APOLOGIES and NO COMPENSATION!!!! STAY ANYWHERE ELSE BUT HERE!!!", "helpfulness": 4, "user": "HiltonDiamondStatus", "date": "November 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 48875322}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I played phone tag with the Hilton's manager of rooms for some days, but when I checked in with Travelocity (where I booked it) they had been told by HIlton management that they had found no evidence of bugs and I would not be getting a refund. However after I called back and left a message that I was a journalist and critic I got a return message saying Travelocity had misunderstood and there was indeed a problem and they had dealt with it and I would be getting a refund. Hmmm.", "title": "Nice Business Hotel", "user": "edsh", "date": "October 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 46121705}, {"rating": 4.0, "title": "Nice Hilton", "text": "This is a nice hotel. I would have like to see robes in the room and a little less dents and scratches in the furniture. The lobby is lovely and the managers reception with food and beer and wine was so nice! I am hilton gold and was not upgraded (little disappointing). Shuttle from the train station is not worth the wait, it is a short walk.", "user": "daisy20071960", "date": "June 19, 2010", "id": 67982640}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Seems that this hotel has had a problem with bed bugs in the past, a little scary!", "title": "Nice business hotel, but away from city charm", "user": "ereynihc", "date": "June 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 66752266}, {"rating": 4.0, "stay_parameters": "Stayed April 2010", "text": "The hotel is fine for busienss travel. However, there isn't much else in area walking distance. I ate at the hotel resturant for my meals. The food was fine. Rooms are spacious and clean. The biggest problem I saw was the extensive amount of mold in the bathroom shower. It was way too much mold and mildrew in the shower tile. More mold than I've seen in tropical environment hotels.", "title": "Very pleasant", "user": "wearygypsy", "date": "April 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 62322182}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Fitness center was nice.", "title": "Horrible Service", "helpfulness": 2, "user": "REV4578", "date": "April 12, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 61114869}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "The execuitve level club room is nice as well. Its the only wifi location I used. The other wifi is in the lobby. The rooms had ethernet internet.", "title": "nice room, bad service", "user": "lilbabybebe81", "date": "March 29, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 59819990}], "location": {"country": "United States", "city": "Stamford"}, "stars": 3.5, "variance": {"poor": 59, "average": 95, "very good": 110, "terrible": 35, "excellent": 88}, "aka": "Hilton Stamford Hotel And Executive Meeting Center", "slim_ranking": 0.571428571429, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 3.5}, "description": "Located outside of New York City -- with access to Amtrak, Metro-North and I-95 — the recently renovated Hilton Stamford Hotel & Executive Meeting Center offers the ideal combination of convenience, comfort and courteous service. Following a multimillion-dollar renovation, our hotel boasts newly refurbished guest rooms, spacious suites, and state of the art event and meeting space. Unwind after a long work day at our restaurant and lounge, serving American cuisine and cocktails throughout the day. Or relax in our sparkling swimming pool or heated whirlpool. Surrounded by dynamic businesses and local attractions, our upscale accommodations will enhance your upcoming visit or corporate gathering. A popular choice among Stamford hotels, the Hilton is a landmark destination with easy access to both Boston and New York City."}