{"user_rating": 4.0, "review_count": 313, "name": "Hilton Vancouver Airport", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I have stayed in many Airport hotels, Hilton and other and although very convenient after a long haul flight it was quite dull and in need of renovation", "title": "Functional and dowdy", "helpfulness": 1, "user": "IanWhiteUK", "date": "August 29, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117416024}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I stay at the HIlton Vancouver Airport about once per quarter because of its close proximity to YVR and our customer site.", "title": "Consistent Quality", "helpfulness": 1, "user": "kuuru", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117176964}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Each time I have stayed here the rooms have been spacious, always upgraded to a mini suite. The rooms are clean and the beds are comfy.", "title": "An excellent hotel", "user": "TravelOften4B", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116898802}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "One major gripe is the internet. There is no wireless access in the rooms. That would be nice since the lan cable is located in another room. The internet is not free, I believe it was 11 Canadian. Expensive but necessary for business travelers.", "title": "Just another overrated hotel", "helpfulness": 1, "user": "HarleenKaur", "date": "August 17, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 116859575}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Parking can be a bit of an issue if you have a larger vehicle. The entry to the parking garage is rather small and I have \"almost\" colided with a few cars.", "title": "First Night as Husband and Wife!", "helpfulness": 4, "user": "mjw716", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 5.0}, "id": 116005600}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "We went to YVR to celebrate our anniversary. The Hilton gave us a great rate and upgraded us to a suite when we told them we were celebrating our 25th anniversary. They later send up to our room chocolate covered strawberries and champagne. Within a block away there is the white spot restraint. We ate there twice for breakfast. It was very good. Back to the Hilton, room was nice and clean. Bed was very comfortable. They do charge 13/ night to park your car. Internet and use of computers in lobby is free. They charge fir internet in the room.", "title": "Great staff and rooms", "user": "dottopilot", "date": "September 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118395734}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "A 10 minute shuttle ride from YVR to this Hilton & most better airport hotels. The Hilton shares the parking garage with a Marriott so you have 2 good hotels next to each other for a change of pace. We got to the Front Desk fairly late (9 PM) but the on-premise restaurant was serving until 10 which was great, too late for us to be searching for someplace to eat. A friendly waiter served our Fish & Chips and Cobb Salad which hit the spot. Our sleeping room on the 16th floor was a nice size and decorated nicely with comfortable beds, plenty of fluffy towels. Once again, though, we were given a room way down at the end of the corridor...I wonder if hotels see us coming & save those rooms for us? By now we should know better and ask for something closer to the elevator when checking in.", "title": "Would def use again", "helpfulness": 1, "user": "Chicago_ILAnonymous", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118230891}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My wife and I stayed in this hotel for 2 nights after returning from an Alaskan cruise. We had an early morning flight back home and being able to use the shuttle service was a great benefit (it starts running to the airport at 4AM). I am a Hilton diamond member and this hotel is as nice as any I have stayed at. It is clean and classy and the staff is great. I even left a personal item at the hotel that they shipped back to me. Most times you leave something behind its history.", "title": "Nice hotel convenient fo airport and Canada Line", "helpfulness": 1, "user": "Coloradodreamin8450", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118210585}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The only downside is if you have to drive to the city itself. Vancouver traffic is terrible so I would recommend taking the Canada Line into town as its only a short walk from the Hotel.", "title": "Good airport hotel", "user": "Cattledogs", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "service": 4.0}, "id": 117921241}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "Airport shuttle was very easy to get on and the driver was very courteous. The room was much smaller than the photos on the website for the family of 4, but it would be a good size fore two people. Beds looked very comfortable, but the sofabed must have been broken. The head part did not extend fully, so unless you put a cushion on the head part, you would sleep your head lower than your body - if you can every sleep like that. The bath was clean with good amenities, but it was on the smaller side. It was easy to get a shuttle bus back to the airport, and the driver was again very courteous and informative.", "title": "Nice hotel, close to airport", "helpfulness": 1, "user": "Melissa3490", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 117477041}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "This hotel is right in the center of Richmond's best Chinese restaurants. Hotel itself is a standard Hilton. We were put in two rooms on higher floor. King beds are comfortable. Rooms are of OK sizes. Services are of top notch. Parking is 13/night, not that bad.", "title": "Great hotel in the center of good Chinese restaurant", "helpfulness": 1, "user": "paramyself", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 115964671}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Stayed at this hotel for 3 days with my family. The rooms are spacious and clean. The staff were amazing. They were very helpful and courteous. Free airport shuttle ever 30 minutes. Richmond mall across the street and many restaurants. Richmond/Brighousee Sky Train 1 block from the hotel (this was very convenient) $9 day pass for the entire Vancouver transit system. Would recommend to any fanily travelling through Richmond.", "title": "Great Hotel with Wonderful People", "helpfulness": 1, "user": "DamionM02", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115776288}, {"rating": 4.0, "title": "Great hotel, Friendly Staff", "text": "I have stayed here a few times now and just finished a 2 night stay. Beds are very comfortable, staff very friendly, and the breakfast offered for free for Hilton Status members is very good. A tip, you can order poached eggs which aren't on the buffett from your server at no extra cost, just need to ask. My only complaint with this hotel is the internet, very slow and unreliable.", "helpfulness": 1, "user": "TheWinger", "date": "July 21, 2011", "id": 115634664}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "I really liked this hotel. Won it very cheaply on Priceline. They allowed me to check in at 11 AM, and gave me a quiet room at the end of a hallway. Both nights I retired to bed very early and woke up so refreshed the next morning. Complimentary internet stations in the lobby, and a number of complimentary papers. Easily walkable to the light rail to downtown Vancouver. Based on the prices of comparable hotels downtown, I preferred staying at the airport area. Would gladly return.", "title": "I had two excellent and restful nights of sleep", "helpfulness": 1, "user": "boddicker52", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114998985}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed here during a recent business trip & my room was on the 15th floor overlooking the beautiful mountain range surrounding Vancouver. You cannot see the city of Vancouver but the rest of the panorama is quite stunning. The Lobby bar is quite lively & the restaurant, Carmichaels, is decent. Located in Richmond in the middle of an Asian community, which is refreshing. Prices are decent. I would recommend this hotel.", "title": "Room with a view", "user": "Jaboman", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114031232}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I have stayed at this hotel frequently on business. The staff is very accomodating. The rooms are clean, the location is excellent, george in the bar will take car of all your libation needs. I particlularly like the buffet breakfast in the morning, it is superior to most. USA Today is always available.", "title": "Always a good bet", "user": "GeoffL", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119406854}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This is a nice hotel conveniently located in Richmond, BC. It is within short walking distance to 2 shopping centers, and lots of great Asian restaurants. The room is very clean, with crisp linens, comfy bed, and large fluffy towels. Staff were very friendly and helpful. When we checked in around 12 noon (too early for standard checkin time), one room was ready but the other was not. So we went to the ready room to rest. Shortly after, the door bell rang, and a staff was at the door giving us the keys to the second room. Breakfast buffet was good, and you can order eggs any style. The waiters and waitresses there were very friendly and quick on refilling drinks and take away used plates.", "title": "Nice hotel with great customer service", "helpfulness": 1, "user": "Cam W", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118791900}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We usually drive to Richmond once or twice a year, mainly for food. So this hotel is very convenient. The corner suites have mini-fridge and microwave, so in case we can't finish dinner, we can heat them up for breakfast or lunch. Last winter, after we checked in to this hotel, we found a plate with assorted cheese & crackers, and fruit on the table with a note from the general manager thanking us for our 10th visit. It was a very nice surprise, given our first visit there was probably 7 years ago.", "title": "Good stop for business and shopping", "user": "David-Judith", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118621920}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Like others mentioned, driving up to a parking space is a little challenging, as the turns are very small. The closest parking spaces are on level 2 upper. If you park on other floors, you will need to take your luggage and walk up/down some stairs to level 2 upper. You will need the room key to get into the hotel from the parking garage, so park in the temp parking space first, checkin, get your key, and drive up.", "title": "Minimal Facility for Maximum Cost", "helpfulness": 1, "user": "LuigiandFulvia", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118526975}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "We really like the hotel and the staff there, and we will definitely return.", "title": "Great Hotel!", "user": "oceanbreeze50", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118491076}], "location": {"country": "Canada", "city": "Richmond"}, "stars": 3.5, "variance": {"poor": 9, "average": 45, "very good": 113, "terrible": 3, "excellent": 143}, "aka": "Hilton Vancouver Airport Hotel Richmond", "slim_ranking": 0.166666666667, "description": "Hilton quality boutique hotel located 5km from Vancouver International Airport and just 20 minutes from Downtown attractions. Spacious Guestrooms and Suites feature items from the Hilton Serenity Collection and include exclusive Suite Dreams mattress and box spring, down-filled comforters and pillows. Complimentary shuttle service from Airport."}