{"user_rating": 4.5, "review_count": 383, "name": "Hilton Columbus Downtown", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We have now stayed here 5 times since it has opened. The staff knows us and are extremely friendly. The building is beautiful filled with local artwork. Great exercise room, the rooms are very well apointed and comfortable.", "title": "Columbus, OH downtown Hilton", "helpfulness": 1, "user": "Julie W", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167595398}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We received a very warm welcome at check in and the friendly service was maintained throughout our stay in most areas of the hotel. For a little more,we decided to upgrade to a suite on the concierge level and was glad we did as there were three of us staying.", "title": "Friendly and comfortable", "user": "familytraveler11", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 167529480}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The room was spacious and comfortable with two bathrooms and complimentary water and mini kitchen with fridge. The a/c worked well and, like the fridge, was not noisy as I have often seen in other hotels when I have to unplug it. The bedding was also comfortable. THe bathrooms were spacious and the amenities pleasing.", "title": "Hilton Downtown is Exceptional", "user": "Jeremy M", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167365379}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The concierge lounge had daily offerings of snacks and drinks. The breakfast was mostly continental, and also eggs, so we all found enough to eat there, also making the extra money spent to be on this level worth it.", "title": "A poor pit stop", "user": "h603", "date": "July 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 167271745}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We had dinner one night at the restaurant and had to wait over 60 minutes for our entrees. We were a large group (over 10 of us) and to our surprise, the manager apologized for the long wait and comped OUR ENTIRE MEAL. This certainly made up for the wait and left us feeling good and appreciated (and the food was delicious). It was refreshing to see managment take responsiblity instead of just provide excuses.", "title": "Perfection.", "user": "jnavillus108", "date": "July 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167236690}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "This hotel wa great. The staff goes out of their way to make your stay enjoyable. The rooms are super clean and comfortable. Great location if attending the convention center. I guess a little on the pricey side but worth it.", "title": "Perfect Spot", "user": "Margaret G", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168259234}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "i just wish the care was better. They made me feel that we were just a number. Are key card did not work and tryed for awhile and then searched for help. Found a housekeeper that let us in our room. But then needed to go back to lobby and wait in line. They acted like this was normal and it was no big deal.", "title": "wishing better care", "user": "Connie P", "date": "July 19, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168259126}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I travel to Columbus every July for a trade show and this is the best hotel experience I have ever had. The beds are so comfortable! The staff is friendly and helpful. The food was great and the decor has a bright but very cool vibe. Great restaurants within walking distance. My new hotel of choice.", "title": "Beautiful New Hotel in Columbus", "user": "Sharon N", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168259653}, {"rating": 5.0, "title": "Fantastic Hotel a Short Walk from Great Restaurants", "text": "I can't imagine there is a better place to stay in Columbus. The staff (especially the valet department) is excellent, and the hotel has large and inviting public spaces. But the best part is the location. The hotel is ideally situated just a few blocks from the Short North neighborhood with all its restaurants and shops. If there are any downsides, it's the pool. The pool is small and disappointing compared to the rest of the property.", "user": "Wiestq", "date": "July 18, 2013", "id": 168012867}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Beautiful new hotel - reception staff were very helpful and professional. Justin, the waiter in the restaurant, gave exceptional service - we were staying there for a week and he was so helpful and knowledgeable of the menu and the cuisine served. If you have children/teens the restaurant is a little bit more fancy than needed for dinner but the breakfast buffet offered a good selection. The bedroom was very comfortable and quiet and was tastefully decorated - great TV, small refrigerator, and great blackout drapes (would have been better without the bathroom night light) My only one complaint was that it is a shame that they cannot accommodate hilton gold members on their executive floor - only platinum. All in all it was a great stay, good service and very comfortable accommodation. When in Columbus we shall definitely return to this hotel.", "title": "Great new hotel", "user": "Katytraveller", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167983078}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Really enjoyed my short stay at this property. Just built last October and one of the nicest smaller hotels that i've stayed at. My executive suite on the 6th floor offering views of the city was very nice and quite large. The view was okay but not the best. This hotel is centrally located in the arena district in downtown Columbus about 15 minutes from the airport. Had breakfast at the Gallery Bistro on the second floor and really enjoyed the food and the service. Totally recommend if anyone plans to visit Columbus, Ohio.", "title": "Superb Hilton Columbus Downtown", "user": "evvtraveler", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168484827}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Stayed here for business and all I can say is wow - fantastic service. Excellent top down management. I am a hilton Gold. Arrived at 10 AM hoping for a room. None was available yet - its pretty early and that was fine. the front desk person who was the first of many excellent employees arranged for me to use the club as i had an important conference call. While in the club, the attendant went above and beyond and the front desk brought me my key when the room was ready.", "title": "Excellent new Hilton for columbus", "user": "MBF6288", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168391802}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "rooms fantastic. only complaint is that my room was an inner facing room. Half of the rooms face the outside and half face the inner atrium. otherwise, all amenities you need. plenty of power access for chargers, of course wifi etc.", "title": "Great Place, Great Staff", "helpfulness": 1, "user": "JoshSchneider", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168499431}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "bottom line - this is my new place to stay in Columbus. 1/2 block down is my former favorite, also a hilton property. location, near the arena district, the cap and north broad. plenty of dining and cocktail options.", "title": "Hotel is minimalist in style-food from fantastic to could improve", "helpfulness": 1, "user": "C_CG65", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 168224433}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "A really fantastic hotel, this Hilton's staff make this place a great place to stay. It's my 17th year in Columbus for a conference and I've stayed at most of the downtown hotels. This was the nicest property with the best service and most delicious restaurant. Definitely want to stay again!", "title": "Modern and convenient", "user": "Christina S", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 168259811}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Overall a very good experience and very nice hotel. Everyone was very friendly and did whatever it took to make our stay comfortable. We were there for a business meeting and convention for 5 days and felt right at home. Location is across the street from the convention center which made the walk very simple across the pedestrian bridge.", "title": "In Town On Business", "user": "Robert S", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168004706}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "This hotel is superb. The customer service receives 5 stars +. the entire staff is incredible. they were quick, anticipated needs, and were very helpful, pleasant and friendly. The rooms are fair size, GREAT lighting, especially in the bathroom, and comfortable. Being a LED certified building, they did a wonderful job making it enjoyable as well. There is lovely unique art work all through the hotel, and when they ran out of surface space, they featured the art on the ceilings of the rooms. what a kick! Only one downside- the air-condition in the room i had, blew right on the desk when working.", "title": "what a breath of fresh air! - incredible hotel", "user": "threedandj", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167918851}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "the restaurant is good- the service in the restaurant has not caught up to the level in the hotel. Being on High street though, the hotel is located a short block or 2 walk from many fine restaurants in North High and the arena district. the new bridge across High street makes it very easy to access the convention center. I highly recommend this hotel to anyone staying in downtown Columbus.", "title": "Livin' Large in Downtown Columbus, Ohio", "user": "Chris N", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168005039}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "New downtown Hilton is modern, yet inviting. accented with a very helpful and friendly staff. The rooms are equally modern and make your rest a number one priority with its famous Serta bedding. The experience will be a memorable one.", "title": "Exceptional midwestern hospitality", "user": "Dalsfelder", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167634493}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The Columbus Hilton is one of our favorite Hilton city properties. The rooms are superb. They are large, modern and comfortable. The restaurant is amazing and beautiful. The bar is popular and lively. However, the best part of the Columbus Hilton is the staff. Every single staff member we encountered was friendly, accommodating and willing to do whatever we needed to have a wonderful stay. The employees are what set this Hilton apart from the rest and make it such a special place. We look forward to our next visit.", "title": "Excellent Hotel and even better service", "helpfulness": 1, "user": "stephen2d", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167588001}], "location": {"country": "United States", "city": "Columbus"}, "stars": 4, "variance": {"poor": 5, "average": 24, "very good": 84, "terrible": 4, "excellent": 266}, "aka": "Hilton Columbus Downtown Ohio", "slim_ranking": 0.0359712230216, "description": "Hilton Columbus Downtown offers a contemporary presence in the eclectic urban hub of Columbus, reflecting the spirit and energy of the area and is within walking distance to over 300 dining and entertainment venues. The hotel features a stunning art collection comprised of over 150 original pieces by Central Ohio artists. The artwork is displayed in function space, guest rooms and public areas of the hotel—it sparks the imagination while enhancing a distinctive cultural experience."}