{"user_rating": 3.5, "review_count": 495, "name": "Hilton Cobham", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We spent a three night stay at the Hilton Cobham, Sunday through Tuesday. Our primary reason was to attend the Hampton Court flower show, plus a visit to see our daughter who lives nearby.", "title": "Enjoyable Stay", "helpfulness": 1, "user": "cryogenic", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115098677}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "All in all, we could not fault the place. Check in was very quick & we were pleased to find that we had an upgrade to a King size double room, despite only twins being available when we booked on line. All the staff were friendly & eager to help with luggage etc. The point someone made about the cold brecky, seems to have been resolved. IMHO the Cobham’s breakfast rates at top end, as far as the Hilton chain is concerned, & I have stayed in quite a few Hiltons worldwide. The room was spotless & everything worked, the bed had the usual ample supply of soft Hilton pillows rather that the rock slabs you get in some hotels.", "title": "First class customer service and great location", "helpfulness": 2, "user": "Director-Ness_Gdns", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115030097}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Only one complaint, which is not directly the fault of the hotel. On our first night, we went to eat at the Mediterranean grill. The food was good, but the place had the ambiance of Charlie Chalk’s. Kids were screaming their heads off, one young girl was bellowing, how her life was screwed up in Italian or Spanish. I don’t speak either, but having brought up a couple of kids, I recognised the tone. Also we were treated to the spectacle of a young future Olympian, practicing the 100m sprint between the rows of tables.", "title": "Had a great time we will go again", "helpfulness": 4, "user": "astarmga", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114622459}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I am aware that the house treads a fine line when dealing with guests who cannot, or will not handle their offspring in public places. However, when paying £50 - £60 for dinner, you expect an atmosphere a tad above J.D Weatherspoons. At least I would have expected someone to have a quiet word with the young sprinter’s parents to explain the effect that a spilt hot beverage would have on their son.", "title": "Very family friendly", "helpfulness": 3, "user": "clairesmyth38", "date": "June 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114562298}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We almost decided to eat elsewhere for the rest of our stay, but on returning the following night, the place was devoid of brats, & the meal was much more enjoyableas a result.", "title": "Outstanding staff!!! Superb food!!!!", "helpfulness": 2, "user": "Gjackiejohn", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114382782}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "On seeing there was a hotel at Cobham, without further ado my wife and I booked a leisure break, believing the location was Cobham in Kent, whereas The Hilton is actually located at Cobham in Surrey. When we discovered our error we decided that as it was a leisure break, we would continue with the visit. It turned out to be one of the best mistakes we have ever made. The hotel is superb in all aspects. We were made welcome from the time of our arrival at Reception to the time of our departure. The hotel is within a few miles of Junction 10 of The M4 Motorway, within a reasonable distance of both Heathrow and Gatwick Airports. Hampton Court Palace and Kingston-on-Thames are within approximately ten miles and well worth visiting. The hotel has a large free car park, and is reached after leaving a main road, travelling along a lane into a rural paradise. It is situated in 28 acres of wonderful grounds, much of it left as natural habitat. For the use of guests there are Tennis Courts, a French Boules sand pit, outdoor table tennis, outdoor chess, and an indoor swimming pool situated in the well equipped Living Well Club where the staff are full of enthusiasm. For those of some wealth there are facilities for the landing of a helicopter, although the helicopter area does not to be well used and therefore there is little noise.. There are ample meeting rooms etc for corporate guests. Nature lovers will enjoy the vast array of trees and woodland, combined with the rabbits and wildlife that scamper in the grounds. Our room was well decorated, spotlessly clean and well furnished. Unlike some modern hotels we were delighted there was an array of drawers for storage in our room, although we were told by a member of staff that some recently refurbished rooms in The Cobham Hilton have unfortunately been adapted to the perceived current trend of sheer lunacy currently infecting the Hilton Group in the failure to have any drawer space whatsoever in the rooms. There is of course no reason as to why potential guests should not demand a room with drawer space at the time of booking. The general presentation of the hotel is excellent. There is a well furnished and comfortable lounge, and the restaurant is superb. We found that all of the staff are friendly and highly professional, they bend over backwards to look after guests. Our room cleaner (Room 542) was Tricia an excellent ambassador for The Hilton Group. Her customer service is second to none. We just mentioned places we wished to visit, and within an hour printed literature was to be found in our room. My wife has a strict health diet to which she has to rigidly adhere. Tricia ensured our facilities room tray was compliant to her dietary requirements. She insisted on assisting us with our luggage. Rohit of the Bar Staff had boundless energy and also gave us great assistance in general requirements during our stay. The Restaurant Managers, Mr Bala and his colleague whose name I am unable to recollect regularly checked with guests that all was to their liking. The Hungarian Chef on duty in the restaurant on the mornings of 13th and 14th June 2011, constantly checked the standard, quality, and presentation of the food available. There was a large variety of choice of food at the breakfast buffet, although I did note that for some peculiar reason that unlike other hotels in the Hilton Group, that of the vast array of cerials - Weetabix (a favourite cerial of many people) was not on display. However The Chef will happily provide them if asked. The porridge at breakfast is superb. I have named just a small number of staff, but every member of staff at The Hilton Cobham should receive a pat on the back as their dedication to excellent service is outstanding. I understand the Hotel General Manager is Mr Stephane Weit. He should be highly commended on running such an excellent highly motivated team. For those who wish to indulge in excellence combined with the available solitude of a country experience then The Hilton at Cobham Surrey is the just the place for you. If there is one matter I would hope may be rectified, it is that there are a small number of guest rooms allocated for smoking. Sadly the smoke wafts through the corridors and finds its way into non smoking rooms as happened in our case. As many hotels now insist on non smoking anywhere on the premises, I hope The Hilton at Cobham soon adapts to such a policy. Smoke is proven to be most unhealthy and guests should not be subjected to it and its inhalation. There are 28 acres of grounds outside of the hotel building for smokers to use.", "title": "Hilton Cobham - a Name Synonymous with Excellence", "helpfulness": 3, "user": "Frederick32", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113911017}, {"rating": 3.0, "stay_parameters": "Stayed June 2011", "text": "On arrival and booking in we were booked in with the wrong name even though I was wearing a clear name badge as part of an Alvis car touring group, also I had signed a form in front of the receptionist in two places handed my credit card in with my name on it, and queried the booking as it was given as 2 nights instead of the 3 we had booked, none of this picked up by the receptionist. not a good start.", "title": "Too many careless mistakes made by staff, better training needed", "helpfulness": 1, "user": "Marilynjs", "date": "June 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 113687464}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "There was no lift to the first floor to our room and we needed help with luggage which was given both at the start and end of the stay.", "title": "Just Terrible", "helpfulness": 2, "user": "Pathooly", "date": "June 12, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 112908169}, {"rating": 4.0, "title": "Relieved after reading some of the comments!", "text": "On the evening of the Gala Dinner we ordered wine for the table but as we had no table plan this was proved difficult to sort out with many others trying to do the same – not very well organised.", "helpfulness": 1, "user": "red118", "date": "June 7, 2011", "id": 111952320}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "When getting drinks prior to the meal only two bar staff for a large party in the main bar so long queues we went to another bar in the dining room where the person in front of us was refused to put his drinks on his room, we were then also refused being told we had no credit. We had given our credit card at check in however bar staff insistent that we needed to pay cash, then they had no float for change in the till and had to go and fetch this, drinks very expensive two gin and tonics £13.50.", "title": "Perfect !!", "user": "NandL2011", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110479290}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Great Room, Great Food and Great Staff and a good central location.", "title": "Excellent", "user": "oldboar1945", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109273098}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Staff very friendly & helpful.", "title": "Comfortable hotel with lovely garden", "user": "terreus", "date": "May 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 107121714}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Nice food in the restaurant overlooking the massive grounds.", "title": "Lovely hotel in nice location although very noisy guests", "helpfulness": 2, "user": "Familyof4Scotland", "date": "May 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 5.0, "location": 4.0}, "id": 106504416}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Pool & jacuzzi nice but tiny ( can never understand hotels that have so much ground & only build a tiny pool )", "title": "Good location - older hotel", "user": "ktoslo", "date": "April 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 105819639}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Would recommend & would stay again", "title": "Beautiful surroundings in the sun, lovely smiling staff!", "user": "jenson70", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 102002542}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed to visit Chessington and got a fantastic welcome from Bonnie on reception who was very cheerful & accomodative with our early arrival. The hotel is easy to find (took 1/2 hr from Heathrow), close to Chessington, the rooms are clean, the restaurant food is a decent standard. and all the staff were friendly & efficient. The surprise was this is not the country style hotel portrayed on the website images, the pool is tiny, the grounds are very poorly kept and there is a lot to motorway noise within the garden areas(the rooms were quiet). So this is more of a conference hotel than a relaxing family destination property.", "title": "good but not what we expected", "user": "familymanHongKong", "date": "July 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115877190}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "The hotel looks exactly as it appears on the website (may sound obvious but I, along with many others have been let down before). The service from all of the staff I encountered wad highly commendable.", "title": "Excellent Service", "user": "Jonyriggs", "date": "July 26, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 115817279}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The only negative would be that the room service trays are not collected until late morning, which, as a former hotel waiter, is hard to understand why and that the tea/coffee facility was not replenished at all during my stay. Very minor points I know?!?", "title": "Excellent, we'll be back", "helpfulness": 1, "user": "carmelkLongford", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115564384}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I would once again like to thank the restaurant team whose service and demeanour was second to none, and Erik on reception who was very friendly, polite and helpful.", "title": "Great breakfast", "user": "chatea", "date": "July 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 115513065}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed here for 5 nights on hotel break including 3 days access to local theme parks. The hotel was fantastic, check-in was quick and the staff were friendly and helpful. Our room or should I say rooms were more that we expected. Even though we had booked a family room, I wasn't expecting connecting rooms at the price we paid. Ensuite was clean and had everything we needed. there was a safe in the room which was free to use, this was great as we did'nt have to worry about carrying passports etc when going out for the day. Wi-Fi was available but expensive so we didn't bother with it. The swimming pool though small was perfect for us as we had it to ourselves most nights and kids were allowed to stay in the pool till the 10pm closing time which was great. There were tennis courts, table tennis and outdoor chess available. We had a lovely walk in the hotel grounds through the woods. We ate breakfast every morning and the food was lovely, hot and plenty of variety available. All the staff were friendly and very helpful. A special word of thanks to Virginia in room service on our floor and Bonnie on reception who was extremely helpful and friendly. The Hilton Hotel in Cobham should be proud of their staff.", "title": "One of the Worst 4* Hotel ever stayed and not going back", "helpfulness": 1, "user": "JR0001", "date": "July 7, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 2.0}, "id": 115131134}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 69, "average": 121, "very good": 156, "terrible": 35, "excellent": 114}, "aka": "Hilton Cobham Hotel", "slim_ranking": 0.8, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Business Hotel set in 27 woodland acres; close to the M25, near race courses of Ascot, Sandown Park & Epsom."}