{"user_rating": 3.5, "review_count": 430, "name": "Hilton Westchester", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "My third stay here. While under renovation, the place is very clean and the staff wonderful. It was, however, quite a walk from my car to my room which was the very last room at the end of the third wing. Room was redone - clean comfortable, flat screen TV.", "title": "Under Renovation", "helpfulness": 1, "user": "mrte62", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 125819217}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Minuses: Shower pressure and time get hot water not good. Stopped at front desk for wake up calls - first morning no call, second morning two hours early. Used the automatic wake up on the last night and worked fine.", "title": "Excellent customer service", "helpfulness": 1, "user": "Sean K", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125406667}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Plus: Nice renovations, staff is great and one of the best work out rooms anywhere with great Precor equipment", "title": "Good hotel, looking forward to completed reno's.", "helpfulness": 1, "user": "Chris W", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 125107244}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "As a Diamond Member I can not discribe the treatment I receieved from Mohamed E at the front desk has been outstanding.I have stayed in hotels for my job many times but a Staff here at RyeBrook espacially Muhamed E. were amazing. I stayed here for over 3 months I can tell it was the best hotel I have ever been in to.Staff there treats you like a 'King' Would definitely stay here again when in NY.", "title": "Premium Service", "helpfulness": 1, "user": "J R", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125003164}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Overall, I enjoyed my stay at the Hilton Westchester/Hilton Rye Town whatever you want to call it. The service was tremendous! The hotel is currently undergoing renovations so you have to use a different entrance for the lobby. No big deal except it makes for a further walk from the parking lot if you have to park there. Parking is free, though which is great.", "title": "Great location,motel needing major facelift.", "helpfulness": 1, "user": "OutsideNycStevie", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123852465}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Price is right, hotel's convenient, staff is friendly. Check in process was smooth and efficient. Room was comfortable with nice view of the woods. Setting of the hotel is bucolic. Bar Staff extremely engaging, maybe because it's NY, but they'll talk to you about anything. Close to major thorough fares, so easy in and out in the morning.", "title": "Rye Town Hilton", "user": "William M", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167877954}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Check in people messed up my room and reassigned me to a room that stunk like BO. They were also doing construction at am on Sunday morning so all I heard was banging and drilling. This hotel is BELOW average for a Hilton and unless you have to stay here I would not recommend it.", "title": "Poor Hotel Room", "user": "Elliott H", "date": "July 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 167745878}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I often go to the Hilton in Rye Brook for an overnight during the summer. The rooms are clean and comfortable, the grounds are lovely, and the pool area is as pretty and comfortable as at most resorts. We enjoy the buffet on Sunday and there are lots of good restaurants in the area. We really appreciate that it is perhaps 45 minutes from the city. Even when the hotel is filled with guests- usually there for weddings- the staff is attentive and accommodating. One suggestion we have for the hotel is that it would be nice for there to be food service at the pool- we have to go into the dining area and wait for sandwiches etc. to be prepared.", "title": "Good place for weekend away from NYC", "user": "Rhea60763", "date": "July 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167205669}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I have stayed at multiple Hilton's throughout the years. This hotel should not be called a Hilton as far as rooms are concerned. There is absolutely nothing offered here. At the minimum, you get a cookie and bottled water at a Double Tree (part of the Hilton Hotel family). At this place, they do not offer anything. You get just a room. Let's talk about the check-in experience. It was quite sad. I am Hilton Honors' member. I came and stood in the Hilton Honors' line. There were people ahead of me that were being helped. The front desk manager and the single employee were chatting. I stood there for a couple of minutes. Finally, I walked up to them to check-in. It seemed like I was \"intruding\" on their conversation for them to help me. I am not sure what hospitality training they have had, but it was surely lacking at that moment. There were a lot of other things that made my experience unpleasant (i.e., construction in the room next to me at 6pm). Overall, this hotel should not be called a Hilton but rather something else.", "title": "Should not be a Hilton", "helpfulness": 1, "user": "Parag M", "date": "July 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 167251327}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Extremely disappointing for a Hilton property. Needed a hotel close to the Westchester County Airport for one evening and chose this property to gain Hilton points. We are Hilton Diamond members and have stayed at many properties within the Hilton family and around the U.S. and in Europe and have never seen such a dirty hotel. Room was dirty, including the sheets, and AC gave off horrendous smell! Rugs in hallway were musty and stained. There was a convention going on - and people running and playing soccer in hallways, picnicking on front lawn when we checked in, and leaving cups and garbage around hallways. There were loud noises throughout the entire evening - including loud pounding on our doors for no reason. There were mice running in our hallway - looked like they came out of a room down the hall. Thank goodness we saw this at 5:00 in the morning as we were checking out. Definitely beware before booking this property. We booked this based on description which indicated hotel had been \"renovated\". Not sure what, if anything, was renovated! Hilton has some work to do with this property.", "title": "Do Not Stay Here", "user": "Charisse V", "date": "July 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 166794557}, {"rating": 3.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "Being a Hilton property, and paying the prices I did, I expected a little more out of this hotel. The rooms were not quite up to the level of most Hiltons I have stayed at. They were large enough and clean, but not the expected luxury that some Hiltons provide. Check in was a complete nightmare. There were probably around 40 people checking in the same time I was, and they only had 2 people at the front desk. Took around 30 min or so. The pool at this place was very strange. It was indoors and right next to the lobby, and completly packed with kids. Not inviting in the slightest bit.", "title": "Decent, but nothing special for a Hilton", "helpfulness": 7, "user": "icem2829", "date": "March 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 4594203}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Its not that this place is awful or anything, it just doesnt quite live up to its name or price. The competition is this area is really not very high, RYe and eastern WestChester county NY have suprisingly few hotels to choose from. Thats probably why this place seems to not go the extra mile, and looks as if it needs renovations. All in All you will probably be fine staying here, just dont expect too much out of it.", "title": "enjoyed our stay", "helpfulness": 3, "user": "hollywoodjack", "date": "October 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4038212}, {"rating": 1.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "My wife & I stayed at the Hilton Rye Town recently while attending a nearby family wedding. The reception staff was pleasant & helpful. Our room 335 was spacious, clean, comfortably furnished with a pleasant view of tall trees on their 45 acre parklike site. We received a daily newspaper at our door and the bill was slipped under our door prior to our departure.", "title": "I do not recommend this hotel!!!!", "helpfulness": 7, "user": "JeffFIndy", "date": "September 14, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 3905534}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "Overall we had an enjoyable stay at this hotel and would stay there again.", "title": "Worst hotel experience (and service) ever!", "helpfulness": 9, "user": "abd", "date": "August 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 3779145}, {"rating": 3.0, "title": "Average.", "text": "One minor complaint was the only hotel meals available were rather high priced buffets.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 26, 2005", "id": 3501787}, {"rating": 3.0, "title": "Nice wooded setting, convenient to business", "text": "We stayed here in July 2004.", "helpfulness": 2, "user": "Mme_X", "date": "August 3, 2004", "id": 2379497}, {"rating": 4.0, "title": "Conveniently located in Westchester", "text": "Clean, decent room that you expect of a Hilton. Nice wooded setting I've stayed at this property a few times before with a good experience, but it has been better in the past. A short drive from the Westchester Expressway, it is conveneient for many busienss appointments in the area.", "helpfulness": 2, "user": "Salesman-Dave", "date": "July 23, 2004", "id": 2317026}, {"rating": 1.0, "title": "Worst Hotel in the Area", "text": "This time, the indoor pool seemed murky and out of commission, making families with children who booked in for the weekend a little put out. It didn't help that we arrived in pouring rain -- the hotel parks cars right in the driveway, which made it possible for only one car at a time to be unloaded under the portico -- the most chaotic check-in I've ever had anywhere, given the backup of cars, parents trying to pick up kids, and a wedding party arriving. It happens, but the operations of the drive-up need to be re-examined.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 11, 2004", "id": 2182958}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This past weekend, I took a trip with my family to the Hilton in Rye Brook/ Westchester (We are Hilton Blue level members). It was a nice getaway from our New York City life, and a very short drive, as well. The hotel has a welcoming lobby area, and a nice restaurant and bar too. The outdoor grounds are beautiful. We enjoyed pleasant walks on the paved pathways, admiring the trees and flowers, the white gazebo, and the green luscious grass. Both the indoor and the outdoor swimming pools were so refreshing! We had fun at the indoor pool on Saturday night, and swam outdoors under the hot sun on Sunday. It was so glorious and relaxing! (Although the water was a tad bit too COLD, brrr...) The exercise room was also well-equipped... my husband took a 5 mile jog on one of the treadmills. There were a few weddings at the hotel over the weekend, and it was pretty to watch. Our room, though, was surprisingly not what we hoped for. We arrived, and were greeted by a terrible stench. At first we thought it was coming from the garbage can in the bathroom, so we put that out the door. However, the smell didn't go away with it. Every time we entered our room, there was this horrible whiff that hit our nostrils. Because of this, we tried spending most of our awake time out of the room. On two separate occasions, we complained about the smell. We were hoping that someone would come up and investigate to see what was causing the smell and how it could be rectified, but they didn't even take the time to send an employee up to help us. They did offer us a late check-out, so we got to stay in our smelly room for an extra hour. Nice! ;) (If you visit this wonderful establishment, try not to stay in room 3012) Hope I was of help!! :)", "title": "Weekend Getaway", "user": "gabby g", "date": "June 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 1.0, "location": 5.0}, "id": 165250641}, {"rating": 3.0, "title": "Nice and comfy", "text": "Good overall service, staff could be friendlier, over all clean and well maintained. The rooms are large, and the views are better than most. Some decent restaurants in the village of Mamaroneck nearby. Quaint little village, by the harbor", "user": "John123C", "date": "June 25, 2013", "id": 165249017}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This was homebase for my brothers wedding in Greenwich CT and it was OK. We are from the area and thought it would be best to stay as close to the wedding venue as possible, and with other out of town guests and this really was our only option for such a large group. For that purpose it was fine but I would never stay here for pleasure. I understand it is going through renovations but there were lots of little things that could have been better maintained in the process. Jessica at the front desk was amazing, cannot stress that enough. As a hotel owner, I would LOVE to have someone like her on my staff. And the head bar tender as well, excellent service. His sidekick, awful. A small group of us at the bar ordered drinks three times in the period of half an hour and rather than fill ours, he would serve other guests first..then come back and ask us again what we ordered. Upon signing the \"chit\", he asked where his tip was. Called room service to ask if they had pizza and were rudely told that \"this aint no [--] Dominoes\". Housekeeping was amazing as was Nico in the gift shop. Breakfast buffet closed 15 minutes early on a Sunday morning...(there were five other wedding groups at the hotel so you know many arrived at the very last minute in the hopes of coffee or food) but it did have plenty to chose from which was a surprise. Coffee to go instead of breakfast...be prepared to pay. They should just let each guest have one if they cannot eat in and it was a huge surprise that they did not have coffee 24/7 in the lobby. Rugs, stained. Wall paper, peeling off walls. Ice machines....only one was working in the entire hotel....luckily the head bar tender filled up our coolers. We had a deluxe king at a rate of $220 per night with breakfast which for the area is very good...but the hotel just had a dingy and outdated feel. Bedding excellent...rugs filthy and stained.", "title": "Practical for sleep, not a destination hotel.", "user": "enez", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 165103032}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "I am a hilton diamond member and stay at this hotel 20+ times a year. Great location and friendly staff. The bartenders in the lobby bar are a little clueless, but other than that since this hotel did the refurbishment of the entrance it is great.", "title": "Quality stay", "user": "Cgc23esq", "date": "June 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 164884297}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Everything was great! Clean, large rooms. Beds are usual Hilton beds, very comfortable. Pleasant staff, good food. Will surely stay here again. Cannot say a single bad thing. Location was just off the Interstate, very easy to get to.", "title": "Great Hotel", "user": "Richard S", "date": "June 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164261380}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I just returned from a one-night stay at the Rye Town Hilton as part of a music conference. I am a Hilton Honors member, so early check-in was a breeze. I asked, as usual, for a quiet room, and was put in a wing of the hotel that is obviously reserved for people like me. This was a wise move, as this hotel does a big wedding/party business and there were quite a few celebrating people walking around (including many children).", "title": "Lovely Hilton, with some caveats", "user": "Bandlady", "date": "May 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129835541}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The room was standard Hilton - large, clean, and well-furnished. The bed was a little soft, but the bedding smelled very fresh, and the bathroom was also clean with fresh-smelling towels. Wifi is free with Hilton Honors and is very fast.", "title": "Very bad mildew smell in the rooms.", "user": "Barbara B", "date": "May 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 129768020}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I was concerned, however, that upon returning to the hotel after dark the section of the parking lot where I had parked was not sufficiently lit. It's a bit of a walk to the lobby, so that was a real problem.", "title": "Mediocre At Best", "helpfulness": 3, "user": "756brianm", "date": "April 30, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 129143434}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "I splurged on the buffet breakfast and was not disappointed. Good food and service.", "title": "Hilton Rye, NY", "helpfulness": 3, "user": "Randy H", "date": "April 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 129031011}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The staff was friendly and helpful. I will return to this hotel in the future.", "title": "Nice wooded setting, good location.", "user": "bob240", "date": "April 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128881772}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We stayed at the Rye Town Hilton on Sat evening.We had not been at this location for awhile.", "title": "beautiful unexpected renovations", "user": "ronni1959", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128405706}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I was pleasantly surprised to see a new vibrant very inviting lobby and rester aunt and lounge area. The hotel was perfect before but not its over the top.", "title": "Hotel full of BEDBUGS", "helpfulness": 6, "user": "no p", "date": "April 11, 2012", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0}, "id": 127705417}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The staff is still top notch Kudos to your Human Resource team for finding gems to represent your organization. Breakfast was excellent", "title": "Construction", "user": "STRAIGHTFORWARD1", "date": "April 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127300083}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Veronica", "title": "Thanks to the staff.", "user": "mtjohnson007", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126547375}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Infested with BedBugs!!!! the place is pretty and filled with bedbugs. check out the apps for bedbugs advisory.", "title": "Very nice hotel", "helpfulness": 1, "user": "ElissaBflo", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126041037}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "The rug smelled & was visibly worn. There was mold between the tiles on the bathroom walls. The furniture was chipped & scratched -- a lot. Even the plastic bag in the ice bucket had been previously used! There was one valet parker at the front of the hotel on a holiday weekend when the hotel was hosting a convention. He did not seem to speak much English. The front desk staff was slow & indifferent. They frequently did not answer the phone. The hotel was noisy until late into the night b/c of the conventioneers. The room service staff was rude. I could not over-ride an automatic 18+% \"gratuity\" on the room service bill. That is not a gratuity, that is a charge. One that exceeds the average tip for *table service.* I was promised a call from the bookkeeping department about correcting this by documenting the receipt & amount I actually signed for. I never received such a call. The manager was patronizing. He promised me an adjustment in the rate of my stay which ---surprise!--- never showed up on my final charge. In short, not a single department in this hotel was welcoming or efficient. Very poor value, indifferent to contemptuous service, worn facility. Better options close by.", "title": "U gotta be kidding...", "user": "Catherine B", "date": "July 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 166872301}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "This is a nice hotel where we stay for work. The rooms were clean, and considering the big convention and screaming kids the lobby was clean as well. Rooms are modern with amazing", "title": "Senic hotel", "user": "Curtis P", "date": "July 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166387961}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Shower heads. Front desk staff is willing to go out of their way with ideas and information on local sights and ideas. I would come back here again", "title": "Disappointing for a Hilton Hotel-I regret not reading the trip advisor before choosing this hotel", "user": "Julianna72", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 166279824}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel was not clean. As soon as we walked in we could see how dirty the floors were. Jackie at the front desk was the only good thing about the hotel. The room which was in a renovated part had scratched furniture, dirty floors, and a terrible musty smell that came out when the a/c was on. Simply maintenance fixes too, one light was not working, and the faucet was missing a piece of it. If the a/c was low it was not too bad. We asked to be moved but by the time we heard back we were already in bed. Jackie was very helpful with trying to get us a room but with 2 weddings the same night it was not possible. They do have an indoor and outdoor pool. Something was up with the water from the indoor pool and it made my skin itch. The grounds outside are nice. The renovated part is also in the back of the hotel which is a quiet area. The one good thing about the hotel was the breakfast. The buffet had fresh fruit and a wonderful selection. It is close to the city which is what we wanted without having to stay in the city. We have stayed at many Hiltons, the Inn, the Garden, the Hotel, the Double Tree, but it seems that anytime we go to NY the quality is just poor. It is a simply maintenance issues that should be fixed before anyone enters a room. Cleanliness is a must for any hotel. I booked this hotel based on the fact that we like to earn points and for the most part Hilton is a good choice. I would skip this one till they make some changes.", "title": "Rye Town Hilton...great experience", "user": "Shaalom", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166240449}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stay at this Hilton every year for our family reunion...we were pleasantly surprised on this trip...the lobby bar was totally renovated...the staff is accommodating and competent...the bed in the room was so comfortable we didn't want to leave. Bravo Hilton!", "title": "Well appointed rooms and grounds with good service", "user": "Paula K", "date": "June 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165650005}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel was filled to capacity with two wedding parties and a fraternal convention but was entirely overwhelmed and completely unapologetic about it. We arrived on a Friday evening and there was no parking valet in sight. After we checked in and self-parked our car, the valet finally appeared and assisted us with our bags. Prior to checkout on Sunday around 1 PM, we called guest services to request a bellman and were told there was a 30-minute wait. Needless to say, we were not about to subordinate our schedule to the hotel's convenience and made due on our own. There were only two employees at reception and we waited nearly 15 minutes before we were able to check out. (There was only one person ahead of us in line). We had requested a late checkout and were initially offered an extra half hour (which we finally negotiated to 90 minutes). Since the reception clerk informed us that they had already had a few hundred checkouts that morning, we found it interesting that it was so difficult to obtain a later checkout time. The parking lot was nearly empty and I'm quite sure the hotel was not going to be full that Sunday night. The room was reasonably attractive and a good size but needed some updating and repair. It is also surprising (and disappointing) that a resort-type hotel does not have safes in the rooms. It is extremely inconvenient to have to visit the front desk to store valuables when using the pool. The hotel has beautiful grounds and could be a luxurious facility but an additional investment by the owners would be required. I attended a wedding here about 35 years ago when it was simply gorgeous. Those days seem to be long gone.", "title": "Seriously Understaffed", "user": "DCRE", "date": "July 23, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 168745250}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "love this place. they have indoro and outdoor pools that are very well maintained, excellent service, the grounds are gorgeous. pricing is more than affordable. my kids have a blast. they literally want us to sell our house and move into the hilton westchester! this place is just the perfect getaway! cant wait to go back there again as you cant beat a weekend at this place.", "title": "The perfect affordable getaway", "user": "Josh S", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168134446}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "This Hilton is located in a scenic woodsy area of northern Westchester County, NY. The reception staff were very friendly and welcoming. Once you got through the lobby, it became apparent that this is a rather dated property. The hallways were dark, carpets were stained, and there were some strange odors. The rooms were acceptable, but nothing out of the ordinary. WiFi was available, but for a fee. Free WiFi is always a welcome amenity and sadly missing from this property. There was no continental or other breakfast included in the room charge. Also, you should be aware, there is no where within walking distance of the property to obtain food. The housekeeping staff was friendly and very efficient.", "title": "OK Hotel for a short stay", "user": "evans81051", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 167970865}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "In summary, I might stay here again, but I'd probably first investigate other options.", "title": "Worse hotel I every stayed at.", "user": "Grace B", "date": "July 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 167878193}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We are handicaped and elevators did not work, electric main doors did not work. Carpets filthy broke screen on slider, maintaince did not fix. Next room butts and drug bags everywhere. Outdoor pool never open on and on", "title": "Excellent customer relations", "user": "Bruce S", "date": "July 16, 2013", "detail_rating": {"service": 5.0}, "id": 167782214}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "the hotel is really nice. rooms are big, clean and with a lot of services (big tv screen, nice desktop, even a coffee machine) but really in the middle of nowhere.the only thing missing is wifi in the rooms, available anyhow in the lobby. for me was really the good choiche because i can reach the office i need to visit is 5 minutes walk from the hotel. the bad part is that is really out and it's hard to find a taxi to go to a restaurant and to come back...", "title": "really nice hotel, but in the middle of nowhere", "user": "Kiowa78", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117383262}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I don't know what drugs the people are who rated this hotel as being good or acceptable. All I can say is that this place is without a doubt one of the worst hotels in which I have ever stayed. After trying two different rooms we finally had to settle. However, each room reeked of a mold type of an odor. The carpets were stained and fiflthy and the beds were horrible. Telephone didn't work in one room and television, when it worked, had a poor picture. We also had the displeasure of experiencing the Sunday brunch. If you want to gag - try the srambled eggs. They were hatched from another planet. The rest of the \"food\" was pretty much of the same disgusting stuff. Nothing like stale breads and God awful omlets to get your day going. Oh, and if you arrive on rainy day you can get to experience the numerous leaks throughout the lobby area. You want to stay here? Good luck!!!!", "title": "Worst Hotel In Which I Have Ever Stayed", "helpfulness": 2, "user": "Gary A", "date": "August 28, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 117376171}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Yes... Some rooms are in a different zipcode then the lobby. No sweat... make sure you ask for one closer. So the lobby, because of the indoor pool, feels like a health club... so what. You don't sleep in the lobby. But the rooms and your housekeeping staff need a makeover... and they know it. hope it happens sooner then later.", "title": "Needs an extreme makeover.", "helpfulness": 1, "user": "Cole17", "date": "August 25, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 117235658}, {"rating": 3.0, "title": "Nice", "text": "We stayed here for 1 night while attending a wedding in the area.", "helpfulness": 1, "user": "lg9567", "date": "August 22, 2011", "id": 117097800}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Some reactions:", "title": "Great hotel but needs more Wi-Fi", "helpfulness": 1, "user": "flylikeplanes", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116994953}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Here are the pluses:", "title": "I want to love this hotel but I cannot", "helpfulness": 4, "user": "BusLeis45458", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123225505}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "1) great service; from the maids to the front desk they are very nice", "title": "Great place to stay!", "user": "cagendalia", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123106500}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "2) Pretty good food on site for a hotel", "title": "Excellent customer service", "helpfulness": 4, "user": "Cheryl H", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 122112710}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "3) Outstanding hotel health club", "title": "Great Stay", "user": "sudmen", "date": "December 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121689714}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "4) Clean rooms that are well maintained by the maids", "title": "One average night...walls are PAPER thin!", "helpfulness": 1, "user": "lakrav", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121426393}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed here on a Saturday night and it was like Grand Central Station! When we arrived at check in time there was a long line waiting. The people at the desk were very efficient however and we ended up waiting maybe only 10 minutes or so. The place is huge and we had to walk down several long corridors and take two different elevators to get to our room. Except for many dark stains on the carpet (hate that!) the room was nice. The beds were comfortable and the room and bath were clean. We did have a problem with the plumbing however but not until right before we checked out. We were staying here for a nearby wedding along with many others, some people seemed to have nicer rooms than others. One friend had a very musty/smelly room. Sunday morning I was woken up by staff setting up tables and chairs for an even right outside my room...one even waved to me when I opened the curtain to see what was going on.", "title": "Very Busy", "helpfulness": 2, "user": "Dreaming", "date": "September 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118411574}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This hotel appears well designed for corporate conferences and group functions like weddings. Parts are being renovated now but I was never bothered by noise or dust during my stay. The lobby does not appear to have been updated recently and has an odd \"country\" motif. The staff was very helpful and pleasant and I enjoyed a nice buffet breakfast. My room had already been renovated recently and was very clean, and quiet with a great view of the surrounding woods. The bed was new and very comfortable. I don't believe any of the guest rooms have wifi yet but there is wired hi speed internet available. The grounds are large and beautiful but there's nothing within walking distance of the hotel. The layout of the hotel is quite confusing. Get detailed directions from the staff before you venture to find your room. It may be a very long walk so plan to wear comfortable shoes.", "title": "Secluded sprawling hotel", "helpfulness": 1, "user": "Howtle", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 118162070}, {"rating": 1.0, "stay_parameters": "Stayed September 2011", "text": "The hotel has a major mold issue and is in horrible condition. Areas that have been renovated are still very poor. Hilton should pull the flag until the renovation is complete. Hotel is only busy because of proximity to major companies and Hilton loyalty (points). Staff is friendly, but it can't make up for the mold.", "title": "One of the worst hotels I've stayed in.", "helpfulness": 4, "user": "2travelmorenow", "date": "September 14, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 118133271}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Within a 30 Minute drive from Manhattan is this great oasis. In the summer they have a wonderful outdoor pool where you spend the day. You are able to order lunch & cocktails & never have to leave your lounge chair. They also have an indoor pool which is open year round. Ther is a resaurant & coctail lounge as well. So park the car & enjoy the weekend !", "title": "Weekend Escape", "helpfulness": 1, "user": "trudysmom666", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 117998951}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I stayed at the hotel for 3 nights for business. the hotel itself is pleasant but let down slightly by poor planning. the lobby, as it is so typically the case in most hotels, is located above the first floor.", "title": "sufficiently pleasant", "user": "louis_lorna", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117669322}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "stayed here for 2 nights. room was standard: all you need is there. So basically well equipped. kids loved the outdoor pool and that was one of the reasons we stayed here.", "title": "don't get a room at the pool/garden side!", "helpfulness": 1, "user": "mvm1", "date": "August 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116794732}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "I would choose it again for a business trip: staff is professional and hotel is more for business stay than it is for a private stay. There is no ' personal' touch to be found here.", "title": "Overall wonderful experience...except....", "helpfulness": 2, "user": "curlyqute", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116531294}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Pay attention! the 1st night was good, but 2nd night terrible. we had a pool/garden side room and they had 2 weddings or party going and these people where outside in the garden.", "title": "Pretty good but needs improvement", "helpfulness": 2, "user": "highwaybound40", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 116368524}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This made sleeping impossible.............loud noise.", "title": "More Like A Motor Lodge Than a Hilton. Kind of a depressing place.", "helpfulness": 2, "user": "vacationer1974", "date": "August 4, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 116238690}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Next day I complained about it and got apologies and a free breakfast. That was nice of them, but a rather sleep well and pay for my food.......", "title": "Great hotel outside NYC", "helpfulness": 2, "user": "RogerNBill", "date": "August 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116139699}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I have stayed here several times over the years. The hotel is old, but their ongoing remodeling is making a difference. I am sad to say the buffet for breakfast has really gone downhill though.", "title": "Slowly improving", "helpfulness": 2, "user": "falwood", "date": "August 1, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 116110335}, {"rating": 2.0, "stay_parameters": "Stayed July 2011", "text": "I stayed there in mid July for a wedding.", "title": "Could have used a taxi to get to my room", "helpfulness": 2, "user": "Shaxspear", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 115930011}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Rooms: If you have a room number 2000-4000, you may want to consider a different hotel. Otherwise prepare yourself for a 10 minute walk to your room that may also include having to take more than one elevator/set of stairs. Whoever designed this hotel is lacking in common sense. Once we finally arrived to our room, we found it clean and confortable. Our only other issue with the room, other than its location, was that we had booked a room with a single king and were given two queens.", "title": "Rotten Housekeeping", "helpfulness": 1, "user": "FlexibleTraveler54", "date": "July 28, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115916320}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Food: The room service menu is better than that of the menus of the actual dining establishments in the hotel. The only problem with the room service menu is that it is overpriced (over $20 for a pulled pork sandwich??....really?) and you get hammered with automatic gratuities and service charges. Dining in the hotel restaurants was atrocious. The food was fine, but the service was beyond bad. Each of the three times we ate at the hotel, multiple mistakes were made with each of our meals. Our servers had a hard time understanding english.", "title": "Friendly Staff", "user": "plasmid", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115900013}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Services: No free wifi. Only available in the lobby and their \"business center\" only had a single computer. Their website said they had shuttle services available in a five mile radius...this was false. It turns out it's only a one mile radius.", "title": "Beautiful outdoor shower!", "user": "sballas119", "date": "July 13, 2011", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 115341480}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 51, "average": 97, "very good": 136, "terrible": 39, "excellent": 107}, "aka": "Hilton Westchester - Rye Brook Hotel Rye Brook", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "The Hilton Westchester hotel, located in Westchester County a New York City suburb of Rye, NY and is minutes east of White Plains, NY and 8 miles from Westchester County-White Plains Airport(HPN) and Greenwich CT. The Hilton Westchester hotel is the ideal location for White Plains shopping and going to the Westchester Mall. The hotel is situated on 45 beautifully landscaped acres of lush woodlands, combining the relaxed setting of a resort with the flexibility of a full-service business hotel. Guest has easy access to New York with the Metro North or Amtrak and can be in NYC within 45 mins. So if you are visiting Westchester County or White Plains for business or pleasure we look forward to welcoming you to the Hilton Westchester hotel."}