{"user_rating": 4.5, "review_count": 883, "name": "Hilton Suites Ocean City Oceanfront", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Only reason this doesn't get 5 is because our check-in experience was sub-par and beds weren't great.", "title": "Pretty darn good", "helpfulness": 2, "user": "SilverandBlackAttack", "date": "September 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 139668745}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I am a Diamond member, called in advance to ensure room was all set for late arrival. Upon arrival, was checked into 208. Too low for a good view, and balcony of larger suite next door totally encroached on our privacy. Asked to be moved, front desk said they'd check w Manager and call me back (it's late). No phone call, went to front desk to ask again and bumped into Manager, who was helpful and moved us to 906, much better.", "title": "Very Nice Beach Hotel", "helpfulness": 1, "user": "RidgewoodTravelers", "date": "September 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139420331}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "I know property was sold out, but why wasn't I placed in the better room from the start, saving us the 1.5 hour hassle? Should be automatic for Diamond members. Also, no amenities provided in either room. Don't forget the amenities!!!!!!!", "title": "Honeymoon stay. I enjoyed it for the most part.", "helpfulness": 1, "user": "PocomokeMdWalker", "date": "September 3, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 139234576}, {"rating": 1.0, "stay_parameters": "Stayed September 2012", "text": "Rest of stay was pleasant and uneventful aside from the Queen beds sagging, which had my wife and I rolling into one another. Time to replace them!", "title": "Horrible hotel not worth the money and staff was incredibly rude.", "helpfulness": 10, "user": "Kcibrone", "date": "September 2, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 139195928}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The Hilton is a great place to spend a long weekend as we just did over Labor Day. The rooms were spacious enough. We had a standard oceanview suite. You enter to a LR with pullout sofa, dresser/TV and small table with 4 chairs, go through a galley kitchen with a full bath with jacuzzi tub into a BR with 2 queens and sliders to a balcony overlooking the beach. We had 2 adults and 3 teens/preteens and faired well with the amount of space for 4 nights. Beds were super comfy.The suite is cleaned daily but most days it was late in the day when we were coming back from the beach so it wasn't ready for us to shower but they were quick about finishing up.", "title": "Wow, what a wonderful hotel", "helpfulness": 1, "user": "Pumpkinridger", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138938219}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My wife, two daughters and I spent four days, three nights at the Hilton Suites in OC. We like to do a long weekend w/ the kids annually in late Sept and have flip-flopped between OC and Rehoboth over the years. My wife and I have stayed at this Hilton before and found the beachfront location and large rooms with kitchenettes ideal for feeling like we are actually on a mini-vacation. The rate for a two queen bed suite was not great, in my opinion. It was $159 for the first night and then jumped to $229 for the next two for our Thurs-Sunday stay. I am also a Hilton Hhonors member and there were no perks or upgrades offered other than a 20% off coupon at the hotel restaurant which everyone receives.", "title": "fall family getaway", "helpfulness": 1, "user": "Farmerica", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 141698777}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I had a corner room suite on my last stay and I have to admit that this regular queen suite felt small and dark from the front entrance. But for travel with two young children, it was perfect. They had the front room to themselves with a dining table, a pullout sofa and tv to watch. We used the kitchen to cook a little breakfast in the morning and to warm up other food/snacks in the evening. Its a good size and the appliances are well maintained. The bathroom is spacious with a soaker tub, but the rain drop shower head should not be the only option for showering. The bedroom was also a good size and looked right out to the large balcony and the beach beyond, but its time to update the mattresses. Both of the beds were way too soft and mushy to the point where you sunk into the middle of the bed in the night.", "title": "not a good weekend", "user": "Linda W", "date": "September 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 141614819}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We ate a late lunch at the restaurant and thought the food was above average and the service equally better than expected. Room service was also prompt and delicious. The kids swam in both the indoor and outdoor pools and had fun times. I noted that the outdoor pool was cleaned every morning, but there was a regular rotation of seagulls who seemed to swim in it at will.", "title": "Nicely equipped hotel", "helpfulness": 1, "user": "IntransitDC", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 141517047}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This Hilton is nicely designed and we had no issues with parking or street noise. Its in a part of OC where you can get to the inlet and boardwalk within 10 minutes, or, as we did, go over to Assateague island's beach in less than 20 minutes. I can see it being very busy in the peak summer months and probably getting a luxury rate for their ocean front suites. The staff seems well trained and friendly, though not particularly engaging and if I were a tourist on a first time visit, I would be a little put -off. I would recommend staying here if you are traveling with kids ( it might be a little tight with teenagers) and I believe that we would come back again but I may shop around for a more competitive rate for this time of year.", "title": "luxury hotel and great location", "helpfulness": 1, "user": "WxmanMD", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141401864}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Somehow we picked a weekend in September that was the loud car weekend. Cars were going through the streets making as much noise as they could. The town was filled with people cheering them on. The hotel was noisy and not at all relaxing. Parking was hard to come by at the hotel with all the crazy cars and pick up trucks taking up all the spots. For end of September we were lucky to find a spot in the overflow lot. I regret coming her and will probably never come back again because of all the noise. We had come here to relax and found that it was a weekend that we wish we could forget. Advance notice of the weekend on the hotel website would have been a great help. The hotel itself was Ok not as great or friendly as many other we have stayed at. I will probably never come back to Ocean City after this ecperisnce.", "title": "Amazing Late Summer Get-away!", "helpfulness": 1, "user": "Chatterboxbk987", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141114230}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Nice rooms with kitchenette. Beautiful sunrises. Kids pool. Adults pool. Indoor pool as well. Nice place overall. Quite rooms. Small balcony for visiting. Would stay Agian ...............................................", "title": "Nice off the beach.", "user": "ChaserDog", "date": "September 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 141040835}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We decided to get to the beach once more before it got too cold. We booked a couple nights at the Hilton. Everything was great ...service, food, 3 pools (indoor and 2outside), location and best of all was the suite. Plenty of room and space with separate LR,full kitchen,Br, and amazing balcony ocean front view. This was the perfect time to come since it was affordable and not crowded. Will be back!", "title": "Last minute get-away", "helpfulness": 2, "user": "NashMD", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140956668}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My wife and I picked this Hilton based on reviews here on Trip Advisor, and I'm glad we did. The place was just about perfect for us. I'll just list the pros:", "title": "Glad we Picked this Place, Will be Back", "helpfulness": 1, "user": "semma2007", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140762287}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Location: It's about 4 blocks from the start of the boardwalk, close enough to walk to if you want to enjoy the walk, but far enough away so you don't get the noise/traffic.", "title": "Best Place in Ocean City", "helpfulness": 3, "user": "tomytom", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140612769}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Beach: It's On the beach, couldn't ask for more. 50 yards of sand, and you are in the ocean.", "title": "Relaxing", "helpfulness": 1, "user": "drsggrl", "date": "September 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140607725}, {"rating": 4.0, "title": "The Best Place to Stay in Ocean City, MD.", "text": "This is our 5th year staying at the Hilton Suites and we would not stay anywhere else in Ocean City, MD. The hotel is spotless and all of our contacts with staff have been positive. The suites are clean and comfortable with magnificent ocean views from the bedroom as well as the balcony. The balcony is clean and furnished with a glass table and 2 chairs. Housekeeping is done in a very timely fashion daily. I brought Clorox wipes just to freshen up the kitchen, but they were not necessary! The pools are clean and the children's lovely private water park is sparkling clean and well staffed with diligent lifeguards! There are plenty of lounge chairs and umbrellas at both the adult pool and the kiddie water park and fresh towels are available at the pools. The adult outside pool has a swim- up bar and servers are available at both pools for food and drinks. The beach is clean and well cared for. There is a Starbucks in the lobby. The only reason I did not give 5 stars is that the more formal restaurant is not very good, but with all of the choices in the area it didn't bother me.", "helpfulness": 2, "user": "babbsie", "date": "September 13, 2012", "id": 140206361}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This is the 4th time we have stayed at this hotel and we can't wait to go back again. It is the perfect place for families to stay, especially if you have children! The Hilton has a beautiful location that gives you the perfect oceanfront experience. The hotel offers two outdoor heated pools, one meant for adults that includes a swim up pool bar and is next to the sandwich and burger stand. Prices are not cheap but are what you expect at his type of facility. it also has a fantastic kids pool with water slides and spouting water geysers which the children love. The kids pool is shallow and is about 4 feet at its deepest point. There is also an indoor pool for any rainy days. The hotel also has a restaurant which offers breakfast and dinner as well as a lounge for some evening relaxation. Prices are fairly high during the summer but start to drop after Labor Day which is a great time to visit due to the smaller crowds and more open beaches. The suites offer everything anyone would need. There is a kitchen area with refrigerator, microwave, stove, and all the necessities. There is a living room area with a flatscreen t.v. and a pull out couch that serves as another potential sleeping area. The bedroom offers the most comfortable beds and pillows anywhere. It also has a flatscreen t.v. and a balcony that offers the most beautiful views of the Atlantic Ocean. I would highly recommend the Hilton to anyone looking for a nice stay in beautiful Ocean City, Maryland!", "title": "Perfect Oceanfront Hotel", "helpfulness": 1, "user": "jooheaThroop", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140148722}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My husband and our 2 children 17 months and 3.5 yrs old just returned from a post labor day vacation. We had a fantastic time. The suites are perfect for families we had breakfast and lunch in our room most days. The staff we came in contact with in every location of the hotel were fantastic. Everyone was very polite and welcoming. I really have no complaints at all. I would advise to get the best bargain go just before or after peak season for rates that are 50% less. While I do love this hotel, I will not return for $500+ a night. I will be back however next year the week of labor day! The pool is the best around for small children. Our kids had such a great time! The water slides and shallow depths made for hours and hours of fun. Our first night there, to my horror, we returned from the boardwalk and looked outside and found that the pool had been emptied! OMG, this could have ruined our vacation. I called the front desk and they assured me that the pool will be fun and warmed for the kids in the morning. I was shocked to find that the pool really was full and the heat was going all day long. They kept the heat on for the kids to use the pool all week long, very impressive. The indoor pool could have been a bit warmer. We did use the indoor pool the day we had rain. It seemed they did run a hose with hot water to the pool but it wasn't really helping.", "title": "Awesome family vacation!", "helpfulness": 1, "user": "Kim8888", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139854036}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The food is excellent in the restaurants and at the pool. The drinks are fantastic, happy hour prices are $3 for any beers and the wait staff was always nearby.", "title": "Excellent hotel although somewhat overpriced", "helpfulness": 1, "user": "sam g", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139814683}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We can not wait to return!", "title": "Horrible reverberating noise all day....", "helpfulness": 2, "user": "Travel_Relaxing", "date": "September 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139752134}], "location": {"country": "United States", "city": "Ocean City"}, "stars": 4, "variance": {"poor": 23, "average": 45, "very good": 211, "terrible": 20, "excellent": 584}, "aka": "Hilton Suites Ocean City Oceanfront Hotel Ocean City", "slim_ranking": 0.00943396226415, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Hilton Suites Ocean City Oceanfront is an all suite oceanfront luxury hotel and beach family resort at 32nd Street in Ocean City Maryland. Hilton Suites Ocean City Oceanfront is Ocean City's only establishment to win AAA's four diamond award. Each suite contains a separate living and bedroom, a private oceanfront balcony, two flat-screen televisions, a Jacuzzi tub, and a fully-equipped kitchen. The property has three swimming pools, two restaurants and one great view."}