{"user_rating": 4.5, "review_count": 339, "name": "Hilton Garden Inn Bangor", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here for one night in August. The hotel is fairly new and it shows...in a good sense. Big, bright, quiet and spotlessly clean rooms, with ultra modern adjustable beds(!), a very nice lobby, friendly staff, excellent breakfast, free wi-fi and well situated near the Bangor Mall, Borders and lots of good eating places if you decide not to eat in the hotel. What more can you ask for? We would definitely stay here again.", "title": "Great to Have a Hilton Garden Inn in Bangor", "user": "Katchapuri", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79005031}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I travel very often for work- and i am not one to write reveiws but i am so unhappy with my stay..and I do stay at Hiltons to Westins etc etc...on business each week..", "title": "Peep Holes as Windows-- Rude Room Service", "user": "HARVEYDANGA", "date": "September 8, 2010", "detail_rating": {"sleep": 2.0, "rooms": 2.0}, "id": 78851983}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Staying at this hotel I found it very annoying that room service endly promptly at 9.. 9:05 i went to order a simple glass of red wine and it was an impossible request- impossible.. ALSO when I called room service I got a \"helllllllllllllllllllllo\" instead of \"hi this is room service- yeah I answered the phone and forgot i was at work\"", "title": "Beautiful", "user": "JuniperJ", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77849057}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "In addition the \"peep holes\" on the doors are HUGE.. from the desk across the room I can see people walking by in the hall- I went outside and from outside you can see perfectly in the room.. what is the purpose of the door? I crumpled up @ straw wrappers and stuffed it for peace of mind.", "title": "Find a deal including the breakfast and it's great.", "user": "CanadaFamof4", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76389562}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "In addition-", "title": "Amazing Hotel, New and Clean!", "user": "wildwanderlust", "date": "August 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76194079}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Just stayed here with fellow coworkers mid-week in December. Easy to find, all new amenities, check in convenient, nice gym and plenty of parking. Rooms were very, very clean and bed comfortable. Very convenient to Bangor businesses and the mall area and restaurants. Had a drink in the lounge and had a great breakfast in the AM. I will be staying here for future Bangor trips!", "title": "Great Place to Stay for Biz or Shopping Trip to Bangor", "user": "mainetoday", "date": "January 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122366616}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We had a very pleasant visit to this hotel with our 2.5 year old son. The room was a good size and very clean. The only downside we found was that the heater was a bit noisy, but nothing we couldn't live with. We enjoyed the breakfast buffet in the restaurant the morning and also visited the pool. Overall we were very pleased with our stay and impressed with the friendly staff.", "title": "Great place to stay in Bangor", "user": "SBTibbs", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 122248592}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I travel to Bangor a few times per year with my family. We stay either at the Marriott Courtyard or the Hilton Garden Inn. Rooms here are clean and modern. The staff is entirely accommodating. Because we have small children, we book connecting rooms. This is one of the few hotels that will actually block out and PROMISE connecting rooms at the time of reservation. Most just say \"we note your request but can not promise\". If you are staying with children, ages between 4 and 8, this leads to angst that the rooms will be separate (not connecting) upon checkin. The Bangor Hilton Garden takes away this worry. The food in the restaurant is surprisingly good. It may actually be the best restaurant food in Bangor.", "title": "Best in Bangor", "helpfulness": 2, "user": "bricklinng", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121989631}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The only thing holding me back from giving this hotel an Excellent Rating is the location. Because of the major highway and no sidewalks, you cannot walk to the Mall, restaurants, etc.", "title": "Great Hotel", "user": "CanadianMoncton", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121714102}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The room is a good size and furnished very nicely. The Restaurant offers a great breakfast and I heard from others that the evening menu is very good also. The lack of a continental breakfast was a bit disappointing.", "title": "Great Service and Value", "user": "hdj38", "date": "November 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120977732}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Located close to mall & most major shopping & restaurants. This hotel has a fabulous lobby area and the front desk staff are very welcoming and helpful. There is a nice pool area with hot tub, was very crowded when we stayed so we didn't use it. Rooms are not over the top, pretty basic actually. Beds were comfy, have adjustable firmness controls, linen was fresh & clean. Big knock against this property is the fact that continental breakfast is NOT included. Almost unheard of these days among big chain hotels, instead there is an on site restaurant, breakfast buffet $9.99 per person... too much considering what we paid for the room... may as well go the Denny's down the road (we did!). The lounge in the restaurant was open only until 10pm, not late enough in my opinion, i went down for a beer just after 10pm, was closed... oh well. All in all, nice property, great staff, over priced! Would stay here again but would first look for a place with breakfast included, it really makes a difference with children!", "title": "Great Staff, Clean, no free breakfast!", "helpfulness": 1, "user": "Leafs_Country", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 75538878}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The room was spotless, the furnishings nice. Free wifi, and a free buffet breakfast were included. The mall is nearby. A very reasonable price for such a nice hotel. Would definitely stay here again. My previous experience in Bangor is with overpriced not-so-nice hotels -- the Hilton is a refreshing change.", "title": "Very nice hotel", "user": "lsmj001", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 75466403}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We thoroughly enjoyed our 2 nights spent at the Hilton Garden Inn. This hotel is new and the rooms are very nice. I found it very family friendly and the kids enjoyed the cookies at the desk. There was coffee and tea available near the lobby anytime. The buffet breakfast was reasonably priced. Also the service was excellent from check in to check out. Would highly recommend this hotel.", "title": "Great stay", "user": "BluenoserBedford_NS", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74751786}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Spent a long weekend at the Hilton Garden Inn and had a very enjoyable stay. Everyone was very friendly and nice. Had no problem being picked up at the airport when we arrived and taken back there upon our departure by the hotel shuttle which was free. The food was very good and dinner was just as good as going out to a four star restaurant. Will definitely come back and stay here again without hesitation. Would recommend this hotel to anyone.", "title": "Enjoyable Stay", "user": "Penta27", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 74619602}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My husband and I had to stay near the airport in order to be at the Delta desk by 4 a.m. We usually say at the beautifully run 4 Points Sheraton, on the airport grounds, but it was sold out due to the President's visit. The other hotels near the airport look run down and depressing, so we opted for he Hilton Garden Inn 4 miles away. It was absolutely perfect, though it was full and hosting a wedding. Check in was friendly and fast, & we were given a lovely suite, as that was all there was left. We had dinner at the hotel and it was delicious. Whatever we needed, the hotel provided instantly, i.e. luggage carrier, bottle opener, extra coffee. Cookies were always out at the front desk and fresh coffee is served around the clock. The hotel provided a courtesy can for the trip to the airport at 4 am. Throughout our stay, there was no area in which the hotel could have done anything to improve their service.", "title": "Perfect customer service in all departments...and quiet too.", "user": "lrslippers", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71909974}, {"rating": 3.0, "stay_parameters": "Stayed October 2009", "text": "This is a beautiful place, BUT, wehad a bad experience with our reservation.", "title": "careful of your reservations", "helpfulness": 3, "user": "kajdr", "date": "July 9, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 70343087}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We had booked a room with 2 queen size beds. It was a very rainy night and even though our reservation was made well in adavance, we were going to be late arriving, so we called the hotel on our way and told them we would not be arriving until midnight. We got there and our room was only ONE queen size bed for 3 adults. We went to the desk and they said they would give us a cot or we could upgarde to a junior suite. So we did that and one of us ended slleping on a cot because the sofa bed was just that, a sofa bed. We were very tired and VERY disappointed! the manager was not very helpful. but we had no choice and had to stay.", "title": "Outstanding experience - fantastic vibe", "user": "foxman27", "date": "June 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68842568}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "They did give us breakfast coupons, BUT NOONEtold us about it. I only found that out when I talked to the lady at the desk and explained what had happened and was trying to find out where we paid for our breakfast. She asked me my name and said oh you were given breakfast vouchers.", "title": "the staff makes the difference here", "helpfulness": 1, "user": "thewarytravellers", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68776063}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "When I got home I contacted management and told them of our dilema and all they did was thanked me for letting them know so that they could improve their customer experience. I would be afraid to book with them again for fear that this might be repeated.", "title": "Excellent hotel, fantastic value", "user": "travelingbadger17", "date": "June 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 67893293}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Could be the best hotel experience we've ever had. The room was spotless and well appointed. The staff was happy - really happy - and that energy really made us feel good about being there. Add in the excellent location, made to order breakfast included in the rate, 24 hour quality coffee station, a solid dinner menu, and live jazz on Thursdays nights and for us it was perfect.", "title": "Awesome....", "user": "Chrissy27", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 67782910}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Stayed one night at the HGI en route to Bar Harbor mainly because my flight didn't get to Bangor until 11pm. Check in was smooth, the staff was nice and the bed was very comfy. It was a pleasant enough stay but the fridge had leftover bottles and cans from the previous occupant, the water is too soft, and the hotel costs too much for something of this class to not offer free breakfast. At least they had free wi-fi. I would stay here again but I would seriously look elsewhere first.", "title": "A bit overpriced", "user": "badwaiter", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 83247572}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Hotel personnel happy and willing to help in all areas. Brought me a recliner! - wonderful since the stay was a 7 day.", "title": "Best hotel experience in 30 years of business travel", "user": "lifelongrepublican", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 82509632}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Breakfast custom made each day.", "title": "We had a great night", "user": "docmarten01", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82280893}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Staff directed us to dining and entertainment usually reserved for locals.", "title": "Almost perfect", "user": "dkeith", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80763855}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "We had a great stay at this Hilton. It is very, very clean. I only opened about two years ago, but everything still looks new. I was very pleased that there was a microwave and refrigerator in the room. The bathrooms were also very clean. The bed was comfortable, and the room was spacious and quiet. The staff at the front desk were very friendly and talkative. There also appeared to be a hotel shuttle (which I believe is free!) although we did not use it. We have never had a bad experience with Hilton!", "title": "Must Stay- Leaders in Hospitality", "user": "dawnlamothe", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80518035}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This is one of maybe a dozen hotels servicing the area around the Bangor Mall. It is not the cheapest by far, but I've done the cheap in Bangor - not again for the 20-30 dollar difference. I was there the last weekend (Friday night) of the Nova Scotia March Break with my sister and 2 teenage girls. The staff were very friendly on check in, the room clean and spacious, and when I called for more pillows(!) (travelling with teenagers..) at 11 am they came quickly and with a smile. Breakfast is not included, but to me worth the $10 each - made to order omelets and eggs, fruit, yogurt, juices, pastries, bacon sausage etc. Great service and a nice ambiance.", "title": "Worth the money", "helpfulness": 1, "user": "Fatima1958", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155553042}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Bear in mind that there is another Hilton property literally across the street - i've stayed there as well and it is fine - but make sure you know where you are booking.", "title": "Very clean, well maintained and friendly hotel on the way to Sunday River", "user": "PGHalifax", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155137520}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed at the Hilton Garden Inn Bangor on the way to and from skiing in Sunday River for March break. The hotel was easy to find and had lots of outdoor parking. The lobby was very well appointed and the reception staff were fast and friendly. Our group of 3 families checked in within 3 minutes. 2 rooms were ready and the 3rd room ready shortly. The breakfast buffet was excellent especially for the price ($10) and the staff were very prompt and friendly. Breakfast included a custom omelet and waffle station, pancakes, bacon, sausage, scrambled eggs, fruit, whole fruit, yogurt, pastries, oatmeal, cold cereal, juice, coffee and more. You could linger or be out of there in 15 minutes depending on your needs. Our rooms were very clean and new looking/smelling. The bathrooms were large and also very clean. The hotel looked very new and fresh.", "title": "Great hotel with clean rooms", "user": "Jade40947", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153895360}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Friendly easy check in, clean rooms, actual genuine friendly staff even at breakfast. Clean pool area with fresh towels and staff that actually checks pool area and is available. Traveling with 2 children was made less stressfull by suck a family oriented hotel. Staff at breakfast even offered fresh apple before leaving to my son to give him energy at his Swim Meet that day. Some hotels you know force service, this staff actually enjoyed providing service.", "title": "Awesome experience!", "user": "Paul C", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 153372633}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Stayed 1 night in the presidential suite which far exceeded my expectations. Room was exceptionally clean and just wow'd us walking in. Room lighting is very relaxing along with leather couches makes for a cozy atmosphere. Don't let the plain outside appearance fool you, inside from the lobby up to the room is very luxurious. Only negative feedback I have is the bed air system - I could not get it firm enough and ended up waking up with a sore back. Also the pool is rather small and was a little crowded so we opted not to use it. The most memorable part of our trip is the breakfast buffet. By far the best breakfast I've ever had!", "title": "Our Stay on Valentine's Day", "helpfulness": 1, "user": "Shaybay515", "date": "February 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152901115}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Spent 5 nights at this hotel while in the area shopping. It is right off I-95 and very close to the mall and other shopping and restaurants. The rooms were clean, the beds comfortable (you could actually adjust the firmness!), there was a fridge, microwave and coffee maker in room. There is an indoor pool and hot tub, 24 hour complimentary coffee and tea, a wine and cheese tasting one evening and jazz night with complimentary appetizers in the bar on another evening. There is a new Hampton suites being built across the street but with the windows closed we couldn't here the construction or traffic on highway or anything else for that matter.", "title": "Clean, comfortable, quiet and convenient", "user": "wpbdle", "date": "November 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120053482}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We didn't eat in the dining room so I can't comment on the food. There is a 24 hour Denny's just down the street.", "title": "Favorite hotel in Bangor", "user": "MNetrip", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119943373}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The only bad thing about the hotel is it is on a side street off a main road but once you pass Sam's Club and Denny's it is soooo dark, no street lights so you couldn't walk to Denny's etc. It was even hard to see with headlights on..", "title": "Much nicer brand than I realized! Brand new", "user": "where2gonexttime", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119458450}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I visit Bangor every four months for business and I always stay at this hotel. The staff is extremely helpful and accommodating to requests. The breakfast is fresh with a good selection. The hotel is located about 10 minutes from the airport. Rooms are very clean and updated at a reasonable price.", "title": "great hotel", "user": "kk5168", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119268122}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Stayed here over Homecoming because my classmates had already made reservations. I was very impressed with all aspects of the hotel. It appeared to be brand new and in excellent condition. The room was spacious with nice linens, pillows, furniture, tv and nice little coffee/refrigerator/microwave set up. The bathroom was very pretty with the nice fixtures, excellent shower, granite and lots of room. I really appreciate the soap dish on the counter and built into the shower. It was a warm night and I was able to open the window to the outside to enjoy the fall air.", "title": "Very Nice Place To Stay", "user": "WomanWithAnIssue", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119222564}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Room was cold, they need to seal up around the HVAC unit. So much cold air coming in that you could not keep your feet warm. Their mattress system did not work very well and were woke up shortly after 5AM by the staff passing out the checkout sheets and talking on the 2 way radio.", "title": "Cold and noisy rooms. Bed very uncomfortable.", "user": "outlaw59", "date": "January 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 150595174}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "For a business person, this is really an easy find and top rated hotel. The food was excellent and the meeting room even had a view of the outside. Bartenders know their wines and most accomodating.", "title": "Very Accomodating", "user": "CrazyAuntMartha", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150266210}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The only argument is with the way you have to complete your own chit for drinks at the bar. Weird.", "title": "Great place to stay in Bangor", "user": "Anastasia P", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149697834}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The staff at the Hilton Garden Inn was very warm and welcoming. The location was perfect for me, because I travel all around Maine for work.", "title": "It was OK, nothing special.", "helpfulness": 1, "user": "FreqTrav99", "date": "January 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 149192337}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The room was large, nice and clean. All in all it was a good deal and would stay here again! ;-)", "title": "Very good value", "user": "Valleyresident", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148548633}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Made a quick business trip to Bangor. This was a very nice hotel about 10 minutes from the airport. Friendly and helpful staff. Provided airport pickup but had to take a cab back because of a very early departure. Nice, clean room. Although a pool is advertised it is quite small and hardly one where you can swim laps.", "title": "Very nice place in Bangor", "user": "drj17011", "date": "November 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 120777909}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband has family in Bangor and we come every year in the fall for a visit. We always stay at this Hilton Garden Inn (since it was first built) and enjoy it very much. The staff are friendly and the rooms are clean. It always seems quite busy but we have never had a problem with noise. There is a mall close by and several fast food restaurants and it is convenient to the freeway. There also is an indoor pool as well as fitness center. Both are pretty typical of most Garden Inns that we have been to. We noticed a new Hampton Inn being built right next door so now there will be two good hotel selections for Bangor!", "title": "We have stayed here several times", "helpfulness": 1, "user": "ArkansasTravelhog", "date": "November 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120620083}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "As far as the hotel, it is a newer property along I-95 at the Bangor Mall Shopping Area and will be located next to a relocating Hampton Inn that will be open next year. My reason for being in town was UMaine hockey and it was a typical stay at an HGI with the exception of a heating problem in the room. The AC worked, however, the thermostat in the room was unable for most of my weekend stay to trigger the heater once the temperature dropped below the desired level. A cold weekend in Maine didn't help the heat problems, especially for my girlfriend whom was accompanying me on the trip. With hockey and a holiday weekend sale that brought oodles of Canadians over the border buying anything in sight for Christmas, all of the hotels were sold out and there were no rooms left within any reasonable driving distance, so I didn't have any real leverage. The heating problem were reported when they happened after the first night and mentioned at check-out and did receive an apology. I was visited by a maintenance gentlemen but he was really unable to determine the cause and had no real answer for the problem. Also, if you are a light sleeper, I-95 does border the hotel and is not soundproofed so at times you can hear the big rigs move on through. Granted, Bangor isn't booming metropolis of a town, but be warned.", "title": "Nice place but heater did not work well.", "user": "riverhawk02", "date": "November 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120595092}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "Other than the heater problem, it is very good place to stay, it only got average for the heating problem and the lack of any remedy to resolve the issue. I did sleep well in the bed and the rest of the hotel amenities are commensurate with the HGI chain. Breakfast was very good and everything made-to-order (in the effort of full disclosure, I do not pay for breakfast at Hilton and get a room discount (due to my membership in HHonors and a Corporate Account).", "title": "Perfect spot on girls shopping trip", "user": "MaritimeExplorers", "date": "November 14, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 120571961}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "It will be awhile that I will be in this part of the woods again, so it would have been a very good place to stay with reliable heat. Unfortunately, this is the first HGI that I did have a room problem. Compared to most of the Bangor hotels, it's still high-ranking. However, next time, I may decide to stay at the Hampton.", "title": "Best Hotel in Bangor", "user": "CanadianVacationer09", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120505989}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Stayed here over the Canadian Thanksgiving weekend. This is our second time staying at this Garden Inn and hopefully won't be our last. On this trip, we upgraded to a King suite and it was great, wonderful bed, 2 tvs, 2 phones, quiet room on the 5th floor. Enjoyed breakfast in the morning and stayed in our first night to enjoy dinner in the restaurant, service and food were excellent, much better than going out, lining up and being in a noisy restaurant. I had the special, chicken parmesan and it was excellent. Maybe some people come to Bangor to shop, but now I think we come for this hotel too, as we went to the well equipped gym on two occasions and just had a pleasant relaxing stay.", "title": "Didn't want to leave!", "user": "NewBrunswickCarol", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119158796}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I spent one night in this hotel. It is new and still has the new smell. The staff was very friendly and helpful. The hotel is near the highway, but we did not here it from the room.", "title": "Very nice place", "user": "MaineDale8fan", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119123965}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed here as we were just stopping through in Bangor. But it really couldn't have been nicer. The reception area and welcome from staff was fantastic, and the warm cookies on the counter a nice touch.", "title": "Great hotel, Great deal.", "user": "SamiKnight", "date": "October 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119044593}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Lovely big room with a very comfortable bed. Tasteful decoration all round.", "title": "Great Hotel in Bangor", "user": "ab1966", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 118761588}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "An excellent stay at an excellent price!", "title": "excellent service, excellent breakfast", "user": "ref44", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 118603922}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We are on our last evening of our trip here to Bangor and this hotel continues to impress both my husband and I. You walk through the front door and your eyes are treated to their beautiful decor. The staff at the front desk are always ~ always helpful and courteous. The cleanliness of this hotel is second to none. The free Wi-fi is very nice, and the salt water pool and jacuzzi are awesome. Oh and did I mention the housekeeping staff, they pay close attention also with extra towels, and extra make up remover pads! We try to make this hotel our first pick when in Bangor. Thank you Hlton Garden Inn for being Just Wonderful!", "title": "~Relaxing, Friendly, Clean & Beautiful", "user": "Amakehs", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148330134}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "~L. Mitchell", "title": "Impeccable in all ways!", "user": "looney_98003", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 148154452}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This hotel is run so smoothly, with great attention to the guest experience and comfort. Every single person that I encountered during my 9 night stay was so courteous and friendly. A few highlights:", "title": "Great!", "user": "60811Traveler626", "date": "December 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147892488}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "1. On the weekend, when there were few guests, I found staff cleaning the walls of the corridor to my room. When they have down time, they clean, clean, clean. It was really comforting to see everyone take pride in the hotel and want to keep it in tip top shape. Kudo's to you all for your dedication! I travel often for work, and seeing this is, unfortunately, rare.", "title": "Nice Hotel", "helpfulness": 1, "user": "Mary L", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147344680}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "2. Neutrogena bath products. Oh - and don't worry - they didn't forget the toilet paper - it's located actually quite handily under the sink. That threw me at first.", "title": "Great Hotel", "helpfulness": 1, "user": "Tom G", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146111905}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Without a doubt, the Hilton Garden Inn Bangor is one of the top 3 hotels in Bangor. Located adjacent to the new Hampton Inn, this hotel is one of the newest properties in the area. Accordingly, the facilities are still \"new\" and the property is thoroughly clean. When compared to the nearby Hampton Inn, the Hilton Garden's pool area is slightly smaller and there is no complimentary breakfast. However, the Hilton does offer onsite dinning and lounge options which the Hampton does not. The cost of breakfast in the morning is approx. $10 p/p. Throughout the day, coffee is complimentary. The rooms are very adequate: plenty of hot water and water pressure, along with all the basic room amenities (iron, hair dryer, flat screen TV, etc.). Be forewarned, the beds are equipped with the \"Garden Sleep System\" which allows personalized adjustment (soft to firm). This is a great feature however I am sure many guest complain figuring it was simply a \"bad bed\". However, my favorite feature of this hotel was the lobby area, which is warm and cozy… a great spot to just sit and unwind. If you’re looking for a hotel to deliver onsite eating options and room service plus a lounge to socialize and grab a drink, then this hotel should be your pick (especially since there is little-to-no options in walking distance). If I had to pick on deficiency, it would be the pool area which seems a little crowded and with a pre-wash shower oddly situated at the doorway, the pool area does not seem to be well planned. Regardless, to date, I have stayed at nearly all the hotels in the Bangor area and the Hilton Garden Inn Bangor is definitely in my top 3.", "title": "Top 3 of Hotels in Bangor", "helpfulness": 1, "user": "StandingRoom", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158404114}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Outside the building is normal, inside it's beautiful. The lounge is big, warm, with a lot of wood. The breakfast is rich and till 11 a.m. After such a breakfast you don't need a lunch. The rooms are big, comfortable, very clean. Highly recommend.", "title": "The Good Comfort You Expect from Hilton", "user": "Iordanka", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 157219886}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Wonderful facility. Nice bar in the lobby with a reasonable menu for this type of hotel. Good breakfast buffet at an extra charge. Large comfortable rooms. Good service.", "title": "Great hotel near the Bangor Mall", "user": "bankscottage", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157132443}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Located near the Bangor Mall, but it is easier to see from the distance than to get to it. Easily visible from I-95, but from the Hogan Road, you have to turn onto the road to Sam's Club and go past the Denny's and car dealer to get to the hotel.", "title": "First Stay Ever at Hilton Garden Inn", "user": "chipmanh", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156995586}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I normally stay at the Hampton Inn when I stay overnight in Bangor. Last weekend, it was full. The Hilton Garden Inn is directly across the street, and we were tired, having driven far to late into the evening, so we took the path of least resistance, crossed the street and got a room at Hilton Garden Inn.", "title": "Most probably the best stay in Bangor!", "user": "Route66", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156992693}], "location": {"country": "United States", "city": "Bangor"}, "stars": 3, "variance": {"poor": 5, "average": 14, "very good": 90, "terrible": 4, "excellent": 226}, "aka": "Hilton Garden Inn Bangor Hotel Bangor", "slim_ranking": 0.0833333333333, "description": "Executive Suite with kitchen, living room, seperate bed room, full massage shower, whirl pool tub. All rooms have HDTV, complimentary High Speed Wireless Internet."}