{"user_rating": 4.0, "review_count": 4310, "name": "Hilton Sharks Bay Resort", "reviews": [{"rating": 5.0, "title": "Brilliant value, brilliant staff, returning august!", "text": "We stayed here in April and loved it. If you are expecting the usual standard of a Hilton four star then you may be a little disappointed as its perhaps not as plush and sophisticated as the hiltons you may stay on business. However, what you do get is a hotel that is geared up to providing a superb holiday. The staff make your holiday and they get to know you from day one. I read the reviews on here before I went and did what others had suggested and tipped our waiter in the dining room a couple of quid on the first night, from then on we were escorted to his section each evening in the dining room and waited on with drinks instead of having to queue at the bar.", "user": "Nicks_gal", "date": "May 12, 2007", "id": 7591157}, {"rating": 5.0, "title": "Exceeded expectations", "text": "Food was good, standards of hygiene in restaurant, around pool and rooms excellent. We had no problems with stomach upsets and we enjoyed it so much we are taking our children again in August. Beach is a little small and disappointing but this is more than made up for by the amazing snorkelling. I disagree with one reviewer who says you should borrow snorkel gear from the hotel as it is good quality, the ones we borrowed were leaky and old, we borrowed some off friends who only paid £15 in local shop and it was much better, when we return in August we will book our own.", "user": "NC83", "date": "May 11, 2007", "id": 7587372}, {"rating": 4.0, "title": "Great time had by all", "text": "My boyriend and I stayed at the Hilton Sharks Bay between 28th April and 5th May. I have to say that the pictures on the website do not do this hotel justice. We had a wonderful time. The service was excellent, the staff were friendly and attentive, the food was plentiful and really high quality. There was lots of food to choose from so I can only assume that those who complained about the food might be a little fussy. There are always salads, fresh fruit and vegetables available. Yes, their carvery is a little unorthodox (cutting up a duck with a pair of giant scissors doesn't make it look that tasty!) However, we found that Italian restaurant \"Il Rustico\" to be an absolute gem with it's 3 course set menu or pizza/pasta. The traditional Egyptian night was also excellent with some lovely couscous dishes and koftes, tagine etc.", "user": "meadb", "date": "May 9, 2007", "id": 7572338}, {"rating": 5.0, "title": "Wonderful 10 day break", "text": "Enough about the food... the building noise which a lot of people have mentioned was non-existent which was our main concern about booking the holiday. This was a very pleasant surprise for us but we can only assume that the lack of building work was due to the International Conference being held in Sharm during the week of our stay. The conference meant that no contractor vehicles were allowed in Sharm during those days so we just assumed that the building work had been temporarily halted which was great for us! But I can understand that this could be a problem due to the building site being visible from the beach.", "user": "ELMOS", "date": "May 8, 2007", "id": 7567199}, {"rating": 5.0, "title": "Brilliant holiday", "text": "The room was clean, comfortable and bright. Not too small and with lots of storage space. The bathroom again was good and kept very clean. The towel sculptures were great- especially when he used props from around the room- ipod/speakers/glasses etc! It was always great to come back to the room to see what towel sculpture the cleaner had made.", "user": "TannedLady1981", "date": "May 5, 2007", "id": 7548999}, {"rating": 4.0, "title": "all incl", "text": "stayed at hilton from 6th aug -12sep.. staff were very helpfull,polite. food was fine especially italian however found it best to eat early so as to find seats etc in either restaurants. This was our first all inclusive and were impressed, rooms were spotless.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 15, 2005", "id": 3906612}, {"rating": 4.0, "title": "Hilton sharks Bay, just returned 11/09/05", "text": "Only a few minus points ie draught beer not up to much and walk from sea area back to rooms up an incline however theres two shallower routes which run up each side of the complex !!", "helpfulness": 8, "user": "regus", "date": "September 15, 2005", "id": 3905993}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "all in all would recomend and not have a problem staying there again.", "title": "Factual review - I hope! Great Hotel!", "helpfulness": 67, "user": "missingtrees", "date": "August 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3796024}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "*** must do mount moses climb***", "title": "wonderful, friendly hotel", "helpfulness": 32, "user": "helen a", "date": "August 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3791571}, {"rating": 2.0, "title": "lovely weather", "text": "Our first visit to Egypt, good flight with Excel, if very cramped seating. Arrival very busy due to delayed flights leaving, very loud disco noise, rather off putting (Chill out bar directly under reception)", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 17, 2005", "id": 3781512}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We (couple, mid-late 20s) stayed at the Hilton Sharks Bay for 8 nights, all-inclusive, in late April. We were after a lazy, sunny, decent value holiday. The holiday was excellent and the hotel met all of our expectations. We'd definately recommend the hotel and area.", "title": "Everything we expected and maybe more", "helpfulness": 16, "user": "Bolibob", "date": "May 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7544957, "likes": {"liked": "— Amazing Coral reef"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Weather", "title": "fantastic", "helpfulness": 4, "user": "mrswWestYorkshire", "date": "May 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7544722, "likes": {"liked": "— cleanliness", "disliked": "— loud music round the main pool all day no comfortable quite place to sit at night"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "This was one of the main reasons we chose this area because of the guaranteed weather for this time of the year. 30-35 degrees. Very nice.", "title": "Still great 3rd time around!", "helpfulness": 7, "user": "Blonde_Wend", "date": "May 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7490153, "likes": {"liked": "— cleanliness", "disliked": "— Wlhite Wine!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Room", "title": "love this hotel", "helpfulness": 9, "user": "codsals", "date": "April 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7478553, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The room was spacious and clean, west facing and overlooking one of the pools. No complaints.", "title": "Loved It.......... Going Again", "helpfulness": 10, "user": "clifarrellHartlepool", "date": "April 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7478117, "likes": {"liked": "— Everything............", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "What a great vacation!!", "text": "Not knowing anything about Sharm el Sheikh other that what some friends had said and reading the reviews online I thought I was prepared for what the hotel was like. Not in the least. I was very surprised that they didn't have a \"beach\" really, more like constructed areas with sand. It wasn't bad as our room was on the ground level and we had a small patio that over looked one of the lesser populated pools. The food was okay, if I had had to buy it each night I would not have been happy. It helped that it was a beautiful resort and the staff was top notch and saw to my every comfort. It is nice to walk/swim up to a bar and have the bartender know exactly what you want without even asking! The diving staff was wonderful and they were great to make sure we all saw the little things around the shore. I wish they had not cancelled the boat dive the one day I decided to go but that is life. We couldn't have ordered better weather, the sun was shining every day and we had nice cool nights. For being so close to the airport (I read about that but was surprised at how close) we didn't hear any planes flying in and out. The construction next door was a bit of a pain because they were breaking up rocks constantly but you did get used to it rather quickly, luckily. This was supposed to be a relaxing vacation, we both work very hard and wanted a place to do nothing, and that is exactly what we did. Nothing. Looking back we probably should have gone to one of the dinners in the tents but I guess that means next time we will be sure to see more of the sights around town. It was a beautiful hotel, beautiful warm friendly people, beautiful warm skies and it was a great vacation. I will go back.....", "user": "Leslee S", "date": "April 17, 2007", "id": 7381014}, {"rating": 4.0, "title": "Mainly About the Food", "text": "This is my first review on Trip Advisor. I thought I'd type mainly about the food at this hotel as it seems to create either good or bad reviews. Last year we stayed at the Sharm Dreams (for the second time), had a great time there and would highly recommend it. We chose Sharks Bay this year for a bit of variety and also we felt the kids (7 and 4) would have a greater choice of food and if they didn't like something, we would be able to get them something else to try with the all inclusive package.", "user": "sitar-clark", "date": "April 10, 2007", "id": 7326902}, {"rating": 3.0, "title": "Nice relaxing break", "text": "This worked out great. Having read some of the food reports about this hotel, I was a little concerned, but quite confident that we would find something that everyone could eat. Do not expect a hotel with posh meals and waiter service. This is a place where you stand in a queue with a plate in your hand and you pick what you want. This gives you the advantage to try as many things as you want and go back and get more of the food you like. I'm not a big eater, but I found the food all very good, especially the outside area with the curries (a choice of lamb, chicken and veggy usually), plus succulent chicken tikka and shish kebabs....delicious. I understand that this is new and experimental, but it was very popular and sure to take off. The dishes were all mild, but if you ask for extra chilli, they'll chop some up and bring it to you on a plate to sprinkle on top. If you don't like curry then don't panic, the Il Rustico restaurant has a good atmosphere and the chefs will create lovely pizzas and pasta to order, so if your kids don't like 'sauce', you can get them to rustle up a plain dish for the kids, or a simple margarita pizza. The pizza bases and pasta are all freshly made and the pizzas are cooked while you watch. Upstairs is the Mahfouz restaurant. This is the main restaurant and the place where you will get your breakfast. The breakfasts at all of the Hiltons in Egypt are great with a huge choice and very efficient egg chefs and pancake and waffle chefs. The choice of cereals isn't fantastic, but is definitely adequate. You will definitely find something you like. At night there is a large array of stainless serving dishes. There are several themed nights during the week, e.g. Oriental, Asian and International.", "user": "scubaAngel", "date": "April 10, 2007", "id": 7324080}, {"rating": 5.0, "title": "10th Visit", "text": "DRINKS - they tend to be very sugary and not very alcoholic. The cocktails are particularly sweet. Juices at the bar are orange, mango, guava and pineapple and are all from cartons. Fizzy drinks are Sprite, Fanta and Coca-Cola. The beer is Sakara draft, which is cool, weak and quite gassy, which is refreshing and means you don't get dehydrated like you would with stronger beers like Meister or Sakara Gold. The local spirits aren't strong, although the Ouzo is good on its own with some ice. Speaking of ice, I never had any problems in the stomach/bowel department (and haven't had any problems on my previous 3 trips to Egypt either). My kids were both fine too, but my wife had a few stomach cramps and some diarrhoea. Nothing major though!", "user": "SadofChessington", "date": "April 4, 2007", "id": 7281005}, {"rating": 4.0, "title": "Excellent weather and very hospitabe staff", "text": "Lunch is mainly burger, hot dogs and a choice of sandwiches, either from Il Rustico or down at the Sunset bar. These are all fine.", "user": "Henniker", "date": "April 3, 2007", "id": 7278485}, {"rating": 4.0, "title": "Clean, hot, great dive shop", "text": "Spent a week here for our honeymoon. Rooms really clean, staff helpful. Food got a bit dull and was a little bit canteen style but fine for a week. Diving and snorkelling from the beach was fantastic. The dive shop - Sinai Divers - was brilliant and convenient. Very hot here in August so if you are a sun lover it's the place for you!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "September 21, 2005", "id": 3929940}, {"rating": 5.0, "title": "really good!", "text": "we have just come back from the Hilton Sharks bay, what can I say!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "September 19, 2005", "id": 3915507}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The hotel is fantastic, staff are very friendly and welcoming, and cant do enough for you.", "title": "Fantastic - highly recommended", "helpfulness": 16, "user": "UK_traveller123", "date": "September 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3914478}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We found that the entertainment was ok a nightime, as most of the time you are so tired from the heat you want an early night anyway!", "title": "Amazing!", "helpfulness": 25, "user": "NCollins", "date": "September 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3914351}, {"rating": 5.0, "title": "Just returned from hilton sharks bay resort", "text": "Food was good too, we went for two weeks, so towards the end of the holiday we did get a bit fed up with it, but this is only natural dont you think?!!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "September 16, 2005", "id": 3908289}, {"rating": 2.0, "title": "made the best of it but", "text": "Stayed here end March for ten days. Stayed last year and though building noise was annoying made the best of it and felt sure it would be finished when we returned. Unfortunately not. We had heavy digger noise for five out of the ten days. We certainly felt standards had dropped and the food was certainly not as good. I got terribly tummy upset and spent two days under the duvet! My tummy has only recently settled down. This can only have been down to the hotel food as at this point had not left the hotel. As a seasoned traveller and this was my fourth time in egypt I am very careful to wash hands regularly, not eat salad or have ice in drinks. We made the best of it but will not be returning to this hotel. We would like to say we thought the dive staff were excellent .", "user": "JimandJulieTorquay", "date": "April 25, 2007", "id": 7434548}, {"rating": 5.0, "title": "Fantastic", "text": "I stopped at this hotel in 2005 and 2006 its is a fantastic hotel the staff are brilliant the food excellent i am stopping here again in october 2007 its like paradise all in all a brilliant place highly recommended", "helpfulness": 3, "user": "gill1234", "date": "April 23, 2007", "id": 7420114}, {"rating": 5.0, "title": "Another Great holiday", "text": "This was our 3rd time at this hotel, its still as good. Its nice to go back and everyone remembers you. We had a great time, unfortunately we only went for a week (its not long enough!).", "helpfulness": 9, "user": "angelfacelouth", "date": "April 23, 2007", "id": 7418103}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed from the 11th - 18th April, it was quite busy with Russians but we had no problems. Day time temp was around 32, it was quite hot enough!!", "title": "Fantastic Holiday", "helpfulness": 11, "user": "DorsetFloss", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7415187, "likes": {"liked": "— proximatey to the beach", "disliked": "— nothing loved it all"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Mosquitos were a bit of a problem, all 3 of us got a few bites at some time, take a plug-in bug killer for your room and plenty of spray when you go out at night.", "title": "Great hotel and facilities but beware the diving outfit", "helpfulness": 9, "user": "SueEly", "date": "April 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7389789, "likes": {"liked": "— Rooms were clean and great to come back to after a busy day out"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "We enjoyed a lovely holiday here in January 2005, myself husband and 3 year old daughter.", "title": "Fabulous fish !!!", "helpfulness": 4, "user": "spadge", "date": "October 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4006309}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "We had problems with our first room but they did change it for us , food was ok and plenty of choice - alcohol took some getting used to ! and I was a bit unhappy re plastic type glasses in the day time. Staff were great ! vert tactile with kids my daughter loved it ! BUT the no 1 thing has to be the fish they were amazing ! we could just sit on the jetty and watch them for hours - we are desperate to go back", "title": "The italian point of view", "helpfulness": 17, "user": "Federica A.", "date": "October 10, 2005", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4004498}, {"rating": 4.0, "title": "Lovely Hotel, brilliant resort", "text": "First of all sorry for my english! I'm italian, bt wanted to write a review because I found all the others very helpful in choosing my hotel. So.. here I am! Back in the Alps after a week at the Hilton Sharks Bay!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 8, 2005", "id": 4001295}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We spent a fabolous relaxing holiday.", "title": "Everything you can ask for........", "helpfulness": 21, "user": "UK-Scotty", "date": "October 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4000911}, {"rating": 5.0, "title": "Great Relaxing Hotel", "text": "Just a couple of things to note, even if we were really satisfied with everything", "helpfulness": 20, "user": "A TripAdvisor user", "date": "October 4, 2005", "id": 3987859}, {"rating": 4.0, "title": "Great Place", "text": "Nice hotel. Good selection of food as mentioned by the other reviewers.", "helpfulness": 11, "user": "moonhead99", "date": "October 3, 2005", "id": 3985234}, {"rating": 4.0, "title": "love the people but?", "text": "The main pool was a bit busy and the sun lounger reservers really do my head in, but you get ignorant people wherever you go. The good thing was that there are two smaller quieter pools and of course the beach so there is always a lounger somewhere.", "helpfulness": 6, "user": "Bazzaengland", "date": "October 2, 2005", "id": 3983256}, {"rating": 4.0, "title": "Great Holiday", "text": "Staff were great, friendly and not OTT they made the stay more enjoyable.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 1, 2005", "id": 3981349}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "I had the belly thing in a bad way, do not take immodium go straight to the pharmacist across the road, he will give you streqotin (spelling) and an antiscpetic for your tummy called anadine I think. That sorts it out really quickly, all immodium did was stop the symptoms, this stuff cured it.", "title": "Very relaxing hol....", "helpfulness": 5, "user": "Jan52", "date": "September 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3976182}, {"rating": 5.0, "title": "Fantastic Holiday!", "text": "I would say the only down thing is the booze, the beer was OK but the wine was rancid. The cocktails were a bit of a dissapointment to, if only they sorted this out then I would give it 5 stars.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3931509}], "location": {}, "stars": 4, "variance": {"poor": 242, "average": 498, "very good": 1309, "terrible": 142, "excellent": 2119}, "aka": "Hilton Sharks Bay Hotel", "slim_ranking": 0.280701754386, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Dive into a Red Sea adventure at the beachside Hilton Sharks Bay Resort, an all-inclusive resort in Sharm El Sheikh. Relax on the private beach, swim in one of 7 pools or try your hand at tennis or mini golf on the onsite courts. Just 10 minutes from the airport and 20 minutes from the Go bus station, the hotel boasts a fully equipped health club, a private beach, 7 polls, 13 restaurants and bars, 2 kids' clubs, kids’ playground and shaded pool and daily evening entertainment with animation team program. Sporty types will love the dive center. Explore the Red Sea coast and top dive sites or visit Sharm El Sheikh Attractions like the Aqua land Water Park. Treat your loved ones with a private dinner at the beach, or enjoy a cool drink over Red Sea views at the Sunset Bar. Hilton rooms boast a balcony or terrace with garden, pool or sea view."}