{"user_rating": 4.0, "review_count": 133, "name": "Hilton Garden Inn Chicago Midway Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Clean rooms, good coffee and cookies, Great People!", "title": "Short visit to Chicago", "user": "TexasTraveler062", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129491334}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Greeted with more than the ordinary smile and good evening. The Hilton staff is really there to help make your stay a good experience.", "title": "Great Location/Excellent Staff/$13 Parking Fee Per Day", "user": "caligirl651", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126557806}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The Hilton Garden Inn at Chicago Midway is a good choice for those staying near the airport. Free shuttle service and easy access to trains make it convenient for getting around and not having to drive or pay for a taxi.", "title": "Convienent and great service!", "user": "pine129", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123443653}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The hotel is in the great location less than 2 miles from Midway airport and lots of restaurants/shopping nearby. The staff are nice and friendly. The room is very comfortable and clean...also has a microwave and a small refrigerator. The fitness center is nice (recently remodeled). The beds and pillows are very comfortable as well. The parking fee is $13 per day which is typically for all hotels on Midway airport property (called Midway Hotel Center). Love it. We will be back here again.", "title": "Wonderful hotel and staff", "user": "CaliTraveler90", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123427129}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I had been stranded in Chicago due to snowstorm. I arranged a hotel, but the taxi dropped me at wrong hotel and I could not find another taxi in such bad weather. The check in people at this location were helpful and while they offered me a room, they also tried to help me to get to my original destination as well.", "title": "Best of the hotels near Midway Airport", "user": "Flyinlow427vette", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123330677}, {"rating": 4.0, "title": "Comfortable beds", "text": "We stayed one night between flights from the west coast. Due to a back injury I usually travel with a memory foam mattress topper that I put on all the beds when I travel. On this trip, due to the amount of one night hotel stays, I decided to not bring it. Fortunately I had no regrets with this choice of hotel. The bed was very comfortable. I slept very well. It was close to the airport and the shuttle was prompt and efficient. The breakfast is not complimentary. The staff was friendly and professional. Check in and check out was easy. During our stay there was a very terrible storm, 60+ mph wind gusts,but we felt safe and never lost power. There was very minimal jet noise from the airport even though from our window we could see planes landing and taking off.", "user": "Spottedprincess", "date": "August 8, 2012", "id": 136644309}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "This is a nice hotel. Just be aware the van service to and from the airport stops at 10:30 and the only run on the hour.", "title": "Nice hotel.", "user": "travelerspring", "date": "July 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 135073026}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Stayed overnight before flying out of Midway the next afternoon and Manny at the desk made check-in pleasant and smooth. He was awesome at answering many questions esp about where i should go for dinner and for a few drinks. the room was comfortable and clean. would definately go back!", "title": "Awesome staff!!", "helpfulness": 1, "user": "andi8151", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 134780516}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "If you are looking for a nice hotel close to the airport you have found it. I found the staff to be friendly and check-in was quick.", "title": "Close to airport, good stay", "user": "gregbooras", "date": "July 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134381306}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The room was clean and the bed was comfy. The room had a nice microwave, frig and flat screen TV.", "title": "As always A+++", "user": "johnnyballgame9876", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134271829}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "This hotel is our first choice when flying out Midway airport. Very clean and comfortable. We feel very saving using their park and fly service and leaving our car.", "title": "Great stay!", "user": "tammyu", "date": "July 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133987795}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed there because of access to the Midway Airport. Shuttle service - timely. Minutes from airport. Front desk person, unusually nice and personable. Usual amenities.", "title": "consistent with other Hilton Garden Inn properties", "helpfulness": 1, "user": "bethelandi", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133672372}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We arrived late afternoon, with work to complete, and with departures from crack-o-dawn to late morning the next day. Checkin was quick, easy and very friendly - starting to be a real Hilton trademark in my book.", "title": "Nice Meeting Place for Business", "helpfulness": 1, "user": "Pedalboy", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131495782}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The 3 of us met in the lobby bar / bistro, cleared a table and went to work. Nice touch to have power outlets at eye level - beats crawling around under tables looking for a plug. Wireless was reliable and high bandwidth, and we comfortably worked away. When the bar opened up at 5, the server checked in and we wound up staying in for dinner and drinks.", "title": "Good location for MDW", "user": "jptrpadvsr", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130871396}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Rooms clean, well appointed, good work zone in my room. Breakfast the next day offered lots of choices.", "title": "Just right!", "user": "DeskJobDaydreamer", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129526878}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I stay at a lot of Hilton Garden Inns around the country because the beds are comfortable and the quality is consistent. This was no exception - it's a little odd due to the location - it is in a large compound of hotels right next to the airport. And I do mean right next to the airport! So as a business traveler it was very convenient for an overnight before catching an early flight home. The in-house restaurant was a nice option as I was too tired to hike across the compound to something else (there are a few restaurants scattered around it). The food was fine and the waitress did an excellent job. There was a soccer team and other young'uns staying at the time but I didn't notice any noise issues, which was very much appreciated.", "title": "Convenient and comfortable at Midway", "helpfulness": 1, "user": "PrincessKatja", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140525613}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I stayed at this hotel as part of a wedding party block for three days. First of all, it's important to note that this hotel is in a sort of compound (they call it a \"campus\") of seven or eight other Midway hotels. The shuttle they advertise is the shuttle for the entire campus, so you have to factor in an extra 7-10 minutes for the shuttle to make the rounds before it heads to the airport. Given all the other options that are in exactly the same place I can't say that the Hilton Garden Inn has any particular advantage other than getting you points if you're part of their rewards program. The hotels all look virtually identical from the outside and they're all around the same star/class level.", "title": "Good, Not Great Hotel @ Midway", "user": "kaieisle", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139924564}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "This particular hotel was, in a word, fine. Rooms are a decent size, clean, and there's a gym, pool, and business center with two computers and two printers. There's also a patio area with an outdoor table and chairs where you could sit with the paper and coffee. It overlooks a parking lot, but still a nice touch.", "title": "Close to MDW with free shuttle", "user": "TravelingChumley", "date": "September 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139774472}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The breakfast is decent... for $12 you get a bunch of options and cooked-to-order eggs, waffles, pancakes, etc. For what you get you don't feel like you're being taken advantage of!", "title": "Amazing hotel and staff!!", "user": "dixiedoll30", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138735714}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The most average (bordering on bad) aspect of this hotel was the hotel staff. The people at the front desk seemed totally clueless half the time. There was a box of welcome bags right behind the desk for the wedding we were attending and we had to point them out, and then further clarify that we were supposed to get one of them. When we checked out we asked to split the bill in half to be charged to my friend and I. The woman at the front desk seemed annoyed that we were asking that, and told us we should have said something when we checked in because that \"makes it easier.\" (??) I replied that we had, in fact, said something at check-in and that we were told just to ask at check out. The staff member then said, \"Oh, I bet I know who it was that told you that. She's new.\" Super cool throwing your colleague under the bus, lady. She then had no idea how to split the bill in half, and was trying to do all these weird things like charging tax to one person and cost to another person. She finally had to call over the manager (tall lanky dude with brown hair) who was super nice and said what my friend and I had been thinking, which was some version of \"just split the total charge in half.\" He explained this extremely concept several times, and was very nice about it, but the moron receptionist could not understand what he was saying and then got super defensive about it. It made us uncomfortable. Finally she threw up her hands and said, \"Fine, you do it!\" and walked away. I felt bad for the guy, and hope he had the authority to fire her.", "title": "Two stays, both very nice", "user": "Rich L", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137573894}], "location": {"country": "United States", "city": "Bedford Park"}, "stars": 3, "variance": {"poor": 2, "average": 21, "very good": 46, "terrible": 6, "excellent": 58}, "aka": "Hilton Garden Inn Chicago Midway Airport Hotel Bedford Park", "slim_ranking": 0.5, "description": "The Hilton Garden Inn Chicago is warm and inviting, yet elegant and functional, the best among Chicago Midway hotels. Featuring deluxe guest rooms and suites, our hotel offers one or two beds, an oversized work desk with an ergonomic chair, desk level outlet, and two phones each with a data port. Our spacious rooms and suites support all of your business needs with complimentary high-speed Internet access and secure in-room printing to the business center. Each of our Midway Airport accommodations feature a hospitality center that includes a microwave, coffee maker, and refrigerator. Basic at home amenities include 27\" flat screen televisions, iron/ironing board, hairdryer, and laundry services. All guests can take advantage of our complimentary self-service business center with copier, fax, and computer, indoor heated pool, whirlpool, and fitness center. Complimentary shuttle available 24-hours to Midway Airport."}