{"user_rating": 4.0, "review_count": 3194, "name": "Hilton Hotel and Suites Niagara Falls / Fallsview", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "It was one of the best hotels we have ever stayed in. The room was excellent, very clean and comfortable, breakfast was excellent, and the view from the restaurant breath-taking.", "title": "We loved this hotel!", "helpfulness": 2, "user": "luigi66", "date": "July 25, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5508338}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Restaurant itself, though, was a bit costly.", "title": "bathroom privacy??", "helpfulness": 6, "user": "bason4", "date": "July 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 5502601, "likes": {"liked": "— The cleanliness", "disliked": "— the bathroom with out any privacy"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The swimming pool was impressive.", "title": "big disapointment", "helpfulness": 8, "user": "jetboy24", "date": "July 20, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 5491771}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "My family and I were so excited to be going to Niagara Falls. The room we booked was a fallsview room. On our arrival we were upgraded to a Jacuzzi room at no charge. That would be a good thing you would think. But it was NOT!", "title": "O.K. -Not Anything Special!", "helpfulness": 2, "user": "Tammy B", "date": "July 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 5439769}, {"rating": 4.0, "title": "Pretty Good Stay", "text": "The bathroom had bifold glass doors that opened to the room. These gave no privacy or sound proofing in the room. My son called it the \"show and tell bathroom\". We are a very close family, but there are some things I don't need to hear and be a part of each day. There was NO ventilation fan in the bathroom as well.", "helpfulness": 1, "user": "Pickle00729494", "date": "July 5, 2006", "id": 5427648}, {"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "Well, I am not sure what the hotel was like when the other reviewers stayed, but our experience of this hotel was nowhere near as we expected. From their website, the superior room that we booked had a great view of the falls and a nice jacuzzi etc. However, although walking in to the hotel gives a great impression, the rooms are tired and a little dirty. The falls are a fair way from the hotel down a longish hill, so yes you can see them but you can get a lot closer. We were shown a higher priced suite for another $50 per night but declined as this wasn't much better, so ended up in our room at a reduced rate. Don't expect to sit in your jacuzzi and look at the falls below - it's not really possible without standing up in the tub and twisting your neck! we were very disappointed with this hotel - although we were informed that certain parts of the hotel have been updated and some haven't - so maybe check on that if you have to stay here, but i'd recommend looking around a bit more and getting somewhere a little closer.", "title": "Oh dear, oh dear...", "helpfulness": 5, "user": "111MattO", "date": "July 4, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 5423090}, {"rating": 4.0, "title": "LOVED THE HILTON", "text": "My husband and I stayed at the Hilton Fallsview on the night of June 28 2006.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 2, 2006", "id": 5417013}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We had reserved a king jacuzzi casino view room for $169.00 but were upgraded to an American Fallsview/Casino view room on the 16th floor at no extra charge. The bed was very comfortable and the bathroom was really beautiful and huge. Wewent to see the Marriot Fallsview ,the whirpool suite was just as nice but the view was absolutely incredible even from the 6th floor. This hotel is really the closest one to the falls and if you want to spend the extra money it's really great. All in all we enjoyed the Hilton!", "title": "Not what I expected of a Hilton", "helpfulness": 4, "user": "b4bunch", "date": "June 27, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 5394229}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The hotel did not quite live up to our expectations of a Hilton stay and we feel we paid \"too many points\" for this visit. As Hilton HHonors Gold VIP members, we are used to more features/amenities/benefits and with the high listed room price, we just expected more. This Hilton was lacking--in that there were no added services above walk-in rate, this hotel does NOT offer/have an executive wing (but when we called to ask what will they do for us, they told us in the future they might, as an additional tower is planned to be built onto the hotel). Parking is bad and whether you choose self-park or valet, you still pay $20+taxes (in Canadian). For self-park, you have to pass the stinky garbage bins, walk up a steep hill and cross a busy street to get to the lot, which is adjacent to a Hooters.", "title": "Great Hotel, Great service", "helpfulness": 1, "user": "tenortunes", "date": "June 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5381345}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Upon entering, the lobby is gorgeous and clean. Everything shines! Front desk staff & concierge were helpful, friendly and knowledgeable. The day prior to check-in, we had to resolve being booked in the wrong room and the front desk staff was quick to remedy the problem. We also requested no Down pillows, comforter, etc (allergy issues) and this was taken care of prior to check-in. Housekeeping was pleasant & informative and our room was serviced very well and requests were all met during the stay. However, the interior hallway carpets and wallpaper in public areas had old stains scattered about. The views from our room were \"OK\" but not as nice as pictured online (due to the tall, flashy casino tower across the street). It seemed the elevators were a little slow and overcrowded, no matter the time of day. While the pool was very attractive and clean and we enjoyed visiting there, the floors are SLIPPERY! Three of the four people in our party took a fall during our visit. There are non-slip mats covering parts of the deck area, but not all of completely, and even the mats are a tripping hazard, so make sure you have safe-tread shoes and be very, very careful. The waterslide and waterfall in the pool area do not operate all day long; they are only running for a few hours during the day (this is during the week--there was a schedule posted but I did not pay attention to weekend operation hours) and the pool is not guarded when the slide is not in operation. All the kids seemed to love \"performing\" in the smaller pool, which has a see-thru wall to the lobby area. We did not use the fitness area or the hot tub area during our visit. The attached walkway from the Hilton to the casino is nice, but it takes you thru the bowels of the parking garage/exhaust to actually get inside. It's much easier just to cross the street outside to access the main casino entrance. Our room included the breakfast buffet on the top floor restaurant, which we enjoyed. The views up in the Hotel's restaurant are beautiful. The food was all the right temperature and tasted good, and there was a decent breakfast variety offered. Our servers, hostess, etc were very friendly, too. We didn't eat any \"paid\" meals in the hotel, nor use the bar service, but the menu prices seemed a little steep (even for the Niagara Falls area, they were higher than most).", "title": "Pretty Good", "helpfulness": 1, "user": "cgirl2013", "date": "June 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5375707}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "I stayed here June 14th. We were trying to get a Fallsview room but there were none left. We had booked a package that included pizza&wings, Imax, breakfast - when I asked if there was anything they could do to compensate since we couldn't cancel without full room charges. The manager gave 2 for 1 breakfast - NICE since it was included in our package!!! What did we get? Nothing.", "title": "Not what I expected", "helpfulness": 1, "user": "trijo27", "date": "June 21, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 5372877}, {"rating": 5.0, "title": "Awesome!", "text": "My two children loved the pool (mind you they love any pool) and the lifeguard provided waterwings for my son on June 14th. They were collected when the pool closed and the next morning (June 15th) when we went for our last swim we asked for the waterwings again. We were then told that they don't provide them - we have to buy them - what the....??? Overnight it changed??? Didn't we pay so much to stay here to get pampered - apparently not!", "user": "A TripAdvisor user", "date": "June 21, 2006", "id": 5368729}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Don't get the IMAX package for the pizza - Terrible pizza! Not recommended.", "title": "This is a Hilton??", "helpfulness": 3, "user": "prniel", "date": "June 8, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 5326232}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I expected more with the Hilton name and was sadly mistaken! With the price we paid - we should have gotten more", "title": "Nice Hotel", "helpfulness": 3, "user": "travelersK&W", "date": "June 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5301424}, {"rating": 2.0, "title": "Missing Direct View of Niagara Falls", "text": "I had to pick a hotel to stay at for a night at Niagara and ended up staying at the Hilton. I must say their suite rooms are probably the best I've seen!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 2, 2006", "id": 5293721}, {"rating": 4.0, "title": "Very nice hotel", "text": "The Hilton Hotel in Niagara Falls was very nice. We had a package which included tickets to attractions and free breakfasts. It turned out to be a good deal. There was also a voucher for dinner for $75. The restaurant is on the 33rd floor which overlooks the falls. A lovely view and very elegant. The $75 dinner voucher really only covers one meal because the dinner menu is very pricey. Our room was very nice. The only complaint I would have is that the noise level is quite high. When someone in another room was using their bathtub or shower, it sounded as if they were in our room. Other than that the hotel was located very conveniently to the center of everything and the Fallsview Casino resort is right across the street with an indoor walkway from the Hilton. The view of the falls that is shown on the website is misleading as it was not the one from our room and we were on the 21st floor. But we still did have a good view. The last time we stayed in Niagara Falls we were at the Marriott and that room had a spectacular view so I think we were comparing the two views. If we had not stayed at the Marriott before, we would not have been a bit disappointed. All in all I would recommend this hotel.", "helpfulness": 3, "user": "Annabelle1116", "date": "May 26, 2006", "id": 5222460}, {"rating": 3.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "The room, service, and staff were all very nice. I had a King Jacuzzi Suite which was nicely furnished, and everything was in working order. Room would have had a full view of the falls if not for the new casino across the street. It's a pitty that the casino is blocking the view of all the surrounding hotels since nobody inside a casino cares about the view! When checking out, I took advantage of the express checkout via the print out of my bill which had been slipped under the door. I should have reviewed the bill more carefully before I left. When I arrived at the hotel, I parked in the surface parking lot while unloading my luggage. After placing my luggage in the room, I returned the rental vehicle to Avis. For this, I was charged $20 for parking????? Then, to find that a 9 minute phone call to Vancouver was $34.00 That is ridiculous! I emailed the hotel through their own website indicating that I thought these prices were extreme to say the least. To date the courtesy of a response has not been received. I have been left, unfortunately, with a very bad taste for this property.", "title": "$$$$$ All about extra charges $$$$$$", "helpfulness": 3, "user": "RandyVancouver_BC", "date": "May 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 5179829}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "My husband and stayed at the Hilton for their 2 day getaway package. We also found a coupon in the Ontario Travel book from CAA 2005 edition with a $50 copon for the package we got. So the two night getaway package with king bed jacuzzi and fallsview room was only 329.00. well worth it. It was quite nice. The room we had was on the 30th floor overlooking the falls. It was a spectacular view. There is even a little vent under the window my husband found that if you open it, you can hear the falls. We enjoyed the the jacuzzi tub. The room was very clean and the mattresses were all just changed I think that week, they are so comfortable. Nice to have the king size bed with king size pillows. We got a coupon with our package for the Watermark restaurant. The prices are jacked up so the $75 coupon does help. Daryl was our waiter and he didn't seem to happy to be there that day, but the meal was good with entrees starting at $29.99. I had chicken and galic mashed potatoes and my entree was 39.99 and my husbands entree was 49.99. Salad was extra. I think we spent an extra 60 dollars or so because we did have a drink and salad and then you have to leave a tip too. It was quite a nice view though. The breakfast buffet was spectacular. That came with the room too both mornings. There was so much to choose from including a omlette bar, fresh fruit, yougurts, danishes, you didn't leave hungry. Way better then Denny's any day. You could use the coupon for their breakfast or Denny's. Do the one at the hotel. We ate so much we didn't need lunch.", "title": "Very nice place.", "helpfulness": 6, "user": "BERTAB", "date": "May 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5067222}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We didn't have to pay for parking because on the internet I found a website that advertised the Hilton Niagara and in the amenities it said free parking so I printed it out and brought it with me and they comped the parking when they saw that. I don't remember the site though, just search a few.", "title": "Hilton Niagara Falls Far surpassed Expectations", "helpfulness": 6, "user": "iloveny10", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5030677}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "The pool was very nice and there was a steam room and dry sauna, and a large hot tub. There was hardly anyone there at all, though it was the middle of the week in May. Good time to go.", "title": "Hotel with a nice view but poor housekeeping", "helpfulness": 7, "user": "travelhellokitty", "date": "April 16, 2006", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4977475}], "location": {"country": "Canada", "city": "Niagara Falls"}, "stars": 4, "variance": {"poor": 281, "average": 511, "very good": 1079, "terrible": 192, "excellent": 1131}, "aka": "Hilton Hotel Niagara Falls", "slim_ranking": 0.152173913043, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Rising 53 stories above Niagara Falls, this modern high-rise hotel offers guests luxurious accommodations, 3 on-site restaurants, superior service and the perfect location to experience all that Niagara Falls has to offer."}