{"user_rating": 4.0, "review_count": 1058, "name": "Hilton Anatole", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My wife and I recently spent one night at the Hilton Anatole following an event. Our stay was neither particularly good, nor particularly bad. It was just kind of flavorless...", "title": "Good Value, But Very Lightly Staffed", "helpfulness": 2, "user": "2BAnonymous", "date": "November 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 6164672, "likes": {"liked": "— Very comfortable bed and pillows. Good value for money.", "disliked": "— Service, or the complete lack thereof."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The hotel is HUGE. So huge, in fact, that there are two separate buildings. I would recommend not parking your car until you check in to determine which one you are in so that you can park accordingly (self park at $15/night is not what I would call cheap, either). But what I found most surprising is that for such a huge hotel, there is virtually no staff. There were a few valet guys lurking out front, but other than that, it was pretty much desk staff only. As we headed to the elevator, I overhead someone asking for the concierge only to be informed that \"the desk is not always staffed.\" And this is a Hilton? Hmmm.", "title": "A Pleasant Surprise", "helpfulness": 4, "user": "SteveBazakas", "date": "October 3, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 5905649, "likes": {"liked": "— design details", "disliked": "— parking fee"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Our room was on the big side. The furnishings were pretty standard - a desk, a couch and coffee table. The bed, however, was one of the most comfortable hotel beds I have slept on in a long while. The pillows were exquisite. The A/C was a little wonky as it was either stuffy or frigid. There was not really an in between temperature.", "title": "Anatole Needs Some A.C.", "helpfulness": 3, "user": "wdharrington", "date": "September 22, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 5826394, "likes": {"liked": "— The price was the best part of this hotel", "disliked": "— The parking and the television sets"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "In keeping with the theme of no staffing, there was only one desk personnel for checkout. On a Sunday morning, nonetheless. Are you kidding me...? After waiting in line for 10 minutes, I gave up and returned to the room to do the expedited phone checkout. Turns out this was the wrong decision. Our $3.00 of mini-bar purchases were charged as $10.78 to my credit card. Looks like I will be calling the hotel to sort it out.", "title": "Weak excuse for a Hilton", "helpfulness": 4, "user": "HiltonHonors25YR", "date": "August 21, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "business": 2.0, "cleanliness": 2.0, "rooms": 2.0, "location": 3.0}, "id": 5689517, "likes": {"liked": "— The workout facility is OK.", "disliked": "— Poor service"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "So in total, the Anatole is a good value for (near) downtown Dallas, but do not expect the level of service a hotel of this caliber should deliver. If you keep your expectations low, you will not be disapointed.", "title": "Worst Hilton experience ever", "helpfulness": 6, "user": "HPK", "date": "August 12, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 5602645, "likes": {"liked": "— Bed", "disliked": "— everything else"}}, {"rating": 3.0, "title": "Not bad.", "text": "Excellent location. Being a new hotel the rooms were clean, fresh and comfortable. Lobby and public areas are clean and new, and the hotel has several bars (excellent!) all of which were busy and had good atmospheres (the sports bar had terrific TV's which is important to me when traveling and usually wanting to catch a game). Hotel is humongous, so there is alot of walking to/from your guestroom to meeting space; if you are in the Atrium building it is almost impossible to slip back to your guestroom during conference breaks. The entire staff was excellent, with special note that the banquet staff was the best and most friendly that i've ever encountered in all my years of work & travel.", "helpfulness": 1, "user": "vg411973", "date": "March 14, 2010", "id": 58538015}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Negatives: room service menu is very limited & my order took an hour for a burger. When you walk outside the building looking for a taxi, the private limo's and bellman are very aggressive and swarm you to go into a gypsy taxi (I had heard rumors about this and that the bell staff gets a kickback everytime they steer a guest to do this). Exhibit Hall is outside the hotel and quite a walk, and each time session broke it was a 20 minute walk from the meeting because there were 3000 people all walking along same narrow pathway.", "title": "Comfortable Stay, great staff and food", "user": "Tradewinns", "date": "March 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58317424}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I've stayed at this hotel several times for both business and leisure trips. It is close to the Dallas Market Center (and has a shuttle to the DMC so you don't have to walk or drive if you don't want to) and it's also just 3-5 minutes from downtown so it is close to everything. The hotel is very large and I've stayed in standard rooms and the junior suites. All are a great size and very clean with comfortable beds and bathrooms. I'[d recommend any of the dining options in this hotel. I've tried them all and they are all wonderful. The shops are also great if you forgot something or have an event come up that you were not prepared for. The self parking is only $3 less than the Valet, so I suggest valet parking.", "title": "Don't let the bed bugs bite...seriously...", "helpfulness": 1, "user": "mikeinsacto", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 57492954}, {"rating": 5.0, "title": "Luxury at it's best", "text": "I stayed at the Anatole during a conference in mid February. While laying in bed I discovered what bed bugs look like, from the nymph stage to the adult... All of them were there with me in my bed....I am now home and have to deal with the fact that there are now bed bugs in my bed, my luggage, my clothes and I am daily covered with bed bug bites...", "user": "RitaLane16", "date": "March 2, 2010", "id": 57491226}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Good luck with your stay.... and really, don't let the bed bugs bite, it kinda stings...", "title": "Cool Hotel but Pricey and Poorly Located", "user": "Bittco", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 56990725}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "One of the worst hotel experiences I have ever had.", "title": "Worst hotel experience", "user": "samsela", "date": "June 5, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 5.0}, "id": 7772758, "likes": {"liked": "— location", "disliked": "— everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I was in Dallas on business and reluctantly booked the Anatole (after previous negative experience with a reservation not honored).", "title": "HIlton Anatole is nice, but a little on the pricey side for what it is", "helpfulness": 1, "user": "RBTexas", "date": "May 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7632591, "likes": {"liked": "— bed"}}, {"rating": 4.0, "title": "Huge Hotel--Good All Around", "text": "I arrived at 11AM and they did not have a room available, so we checked our bags and they told us that as soon as our requested room was available, (king bed no smoking) they would put it aside for us. So we went to work and returned to the hotel in the evening. There was no room set aside for us and we were told we got the last available room. However, we were put in a smoking room on a smoking floor and were told there were no other choices because they were sold out. The managers refused to meet with us or speak with us. We spent FIVE nights in the most rancid smoke infested room. When I got home and unpacked everything I own, including the suitcase was smoke infested. I also received zero satisfaction from \"customer service\" after my stay, they do not care.", "helpfulness": 2, "user": "kiddogo", "date": "May 6, 2007", "id": 7551405}, {"rating": 1.0, "title": "Proceed with Caution", "text": "I stayed here overnight a few weeks ago. I like the Hilton family of hotels, am a member of their HiltonHonors club, and am usually pleased.", "helpfulness": 4, "user": "RichieRichPhilly", "date": "March 5, 2007", "id": 6919134}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "This hotel is very nice, but I'm not sure that it is that much nicer than some that are less expensive. I was upgraded to a junior suite which had plenty of room, a very comfortable king bed, and a decent sitting area. The bathroom was a little small.", "title": "Nice hotel, large, needs some room updating", "helpfulness": 1, "user": "travelmutt1", "date": "March 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6901515}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I'm an Hilton Honor's Diamond VIP as well as a Marriott Platinum member, so I've stayed in my fair share of hotels. The ONLY saving grace for this hotel is that I had free usage of the racketball courts next door at the Verandah Club and Spa, but this was only due to my status. Checkin at the tower was quite lengthy, especially when half the people in line were returning with card keys not working (some had mentioned that they had to return up to 5 times!). The first night I was put in a room on the 26th floor of the Executive Tower, but in a room that had two doors to connecting rooms, which I dislike and which became very apparent why at around 1am in the morning. Suffice it to say, there was a travel agent convention at the hotel and they had a Las Vegas night, the woman next door obviously had too much to drink and took the Vegas slogan of \"What happens in Vegas, stays in Vegas\" to heart and applied it to Dallas. Let's just say that she \"met\" someone at the convention and the connectng door was so thin I thought I had an adult movie playing on the television. The first thing in the morning I requested a new room and requested that they get me a new room and move my suitcase and 2 shirts in the closet, when I returned that evening I found that my request wasn't followed and I had to move my own things. Instead of giving me a key to the new room and let me move my things right then, I had to go retrieve my luggage, drag it all back down to the registration desk, wait in line again, get the new room key, then drag my belongings up to my new room. Then I find out that my room preferences on my Hilton Honor profile (non-smoking room, high floor, away from elevator, king size bed) were completely ignored and I was placed in a room next to the elevator on the 4th floor with double beds. The only saving grace about the double beds and pillows was that they were much more comfortable than the King size bed on the Executive floor. The internet was sub-par, keep in mind that I utilize the high speed access in hotel rooms as part of my job, the first night it took at least an hour to successfully go through the charge screens (yes, they charge Diamond members) and connect to the internet. And unlike all other hotels that I stay at, there were no directions available regarding the outgoing smtp server to be used for the mail client. Forget the support number they give you, I called and asked specifically for the outgoing server and either they didn't know what it was or they refused to give it to me. Oh yes, if you should have access to the Executive Lounge and are not on the upper executive floors, you have to request access to the Executive Lounge, it's not a given. If this is the treatment they give a Hilton Honors Diamond VIP member, I would not want to be a guest with a lower status. Both the hotel rooms and Verandah Club are very tired and need a major refurbishing. I would not recommend this hotel to the casual nor business traveler. As with mentioned by another poster, it appears that the Hilton Garden Inn next door is newer and probably not as tired. For Marriott members, there is a Renaissance close by as well.", "title": "Stay somewhere else", "helpfulness": 7, "user": "travelerNSD", "date": "February 21, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 6823193, "likes": {"liked": "— Comfortable bed and pillow in lower grade room", "disliked": "— everything else"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I stayed at the Hilton Anatole for a large group meeting. The entire hotel is very clean and well-updated and all of the food during the meetings/dinner was excellent. My largest concern was that the walls in the rooms in the atrium area were paper thin; I was able to hear the man next to me and his coughing/sneezing, etc. One of the nights during my stay the man apparently had the stomach flu, for I heard vomiting during the entire night. The front desk staff moved me without hesitation which I was grateful for. I would recommend a corner room, as you cannot hear the other guests around you. Overall, a very nice place to stay when you are far away from home.", "title": "Nice Meeting Accomodations", "helpfulness": 1, "user": "juniper1", "date": "February 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6776623, "likes": {"liked": "— The staff and the availability of restaurants onsite; close to downtown"}}, {"rating": 4.0, "title": "Great Service", "text": "My company booked about 50 rooms for a trade show in town and held meetings in the hotel. I stayed there five nights and enjoyed my stay very much. The hotel is large and luxuriously comfortable. The bed is as good or better than Westin's. The pool and hot tub was great. The staff was eager to please, the bell captains and bell hops were prompt and courteous, the wait-staff in the Terrace and La Esquina restaurants were very good. The service and set up in the 27th Floor Honeysuckle and Rambling Rose rooms was awesome with a very nice custom-made ice sculpture and buffet service (great shrimp!).", "helpfulness": 3, "user": "rporter8555", "date": "February 5, 2007", "id": 6746874}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "When I set up for a presentation in the Emerald Room, the hotel technical support team went above and beyond the call of duty in helping me set up my projector with their screen and their sound system.", "title": "Unplesant situation", "helpfulness": 2, "user": "OrlandoBistraveler", "date": "January 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6687398}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "The only mishap of the week was on check-in when the desk wrote the wrong room number on my key slip, which caused delays in delivery of my luggage and presentation materials to my room. Fortunately, the bell captain took care of my things and all was well.", "title": "loved the hilton anatole", "helpfulness": 1, "user": "cchambers97", "date": "January 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6654244, "likes": {"liked": "— large comfy beds and pillows", "disliked": "— no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Stayed three nights for business meeting. Our room was in the tower. Very spacious room with two double beds. Bathroom was large with two sinks and plenty of countertop and storage. Small coffee maker, fridge and safe in room. Large closet. Parking was free with our meeting but it looks like they normally charge $17/night for self-park. Short drive or taxi ride to downtown Dallas with many restaurants to choose from. Our favorites were Trulock's for nice dinner and Sonny Bryan's on Inwood for BBQ lunch. We paid $18 extra a night for access to executive lounge on 25th floor. Nice quiet spot for continental breakfast in morning and snacks in the afternoon.", "title": "Nice, upscale business hotel", "user": "empjm", "date": "May 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65841495}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Very bad, confusion at check out", "title": "VERY BAD", "user": "CARLOSKAMKHAJI", "date": "May 29, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 65771199}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "old hotel", "title": "If the Hotel is Like the Restaurant-- STAY AWAY", "user": "Torchness", "date": "May 28, 2010", "detail_rating": {"service": 1.0}, "id": 65623286}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "chinese style", "title": "Finest Museum I've Ever Stayed In", "user": "AprilAllYear", "date": "May 16, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 64276203}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "not friendly and rude at the front desk", "title": "I was very happy with the help I received", "user": "marye1_10", "date": "May 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 63452163}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "My husband and I came here for a business conference. The conference was catered and we had dinner at the Nana restaurant. This hotel is amazing. The rooms are very modern and clean. I love the bathrooms (see pics) and the roomy area with a sofa is nice. There are some nice upscale restaurants and bars, in addition to a spa and huge fitness center. We stayed an extra night after the conference was over and had a wonderful time. We stayed for dinner and drinks in the Media Grill & Bar and just enjoyed every moment. My only complaint is that the parking is very expensive in my opinion. 0-4 hrs will cost you $9 for example.", "title": "Beautiful, modern and lots of amenities", "user": "tripcasey", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62381374}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "We stayed here for an event my company had. It was a very nice hotel - my room was clean and updated. However, if I was not traveling for work I never would have stayed here. Everyone should be aware what they charge for parking - $17 / day. You have to pay for internet and the gym. The breakfast at the restaurant was ridiculously priced for what it was - something like $25 for a buffet. Luckily I am a Hilton Gold member so it was free for me, but if you are not be prepared to spend $25 to work out. I do have to admit, the workout center is fantastic - the best hotel gym I have ever been to. Overall I would say the experience was good but thank goodness work paid for it.", "title": "Nice Hotel But They Nickel and Dime You to Death", "user": "meg51577", "date": "April 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 61418857}, {"rating": 5.0, "title": "Birthday", "text": "Loved the hotel!! It was a very large hotel, but beautiful with different art throughout the hotel. All the staff was nice, and helpful!", "helpfulness": 1, "user": "luvya1tyme", "date": "April 14, 2010", "id": 61304891}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I am a Gold HHonors member with Hilton, and travel weekly. I stayed Sunday March 28th, and had a horrible experience. I sat on the red bench in front of the bed, and approximately 15 minutes later, my legs and feet were covered in painful, itchy red welts/bites. I nearly called a doctor, I was so worried. I took a long hot shower, and went down to the front desk to complain. They said I could stay in the room, and they would look into it, or move my room and let me know what was going on.", "title": "May not be bugs but there is something wrong here...", "user": "HBiztravel", "date": "March 31, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 4.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 60054082}, {"rating": 5.0, "title": "Satisfied Traveler", "text": "I understand the hotel can not control someone bringing something in, and things happen. What disappointed me was the response I received. I was told that the room would be unoccupied until it had been checked and treated. After I moved rooms, I went back to the front desk repeatedly. Monday night they told me the room had been checked and cleared, and was occupied. They said they would send someone Tuesday morning to clean my clothes and to sanitize my suitcase first thing in the morning. All I needed to do was leave mty clothes by the door. I left contact information, and asked they call or email me first thing in the morning. When I returned to the room at 11 AM, the clothes were still there, and I had an unintelligible message on the phone in the room.", "user": "SexyC430", "date": "March 18, 2010", "id": 58938660}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Stayed here for two nights 1st & 2nd July. The hotel is large, and has plenty of facilities.", "title": "Enjoyed our stay at the Anatole", "helpfulness": 11, "user": "Gurnip", "date": "July 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5528119, "likes": {"liked": "— Overall service & amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "The only small snag was that after a 10 hour flight from the UK, there was a huge queue at check-in, (a blind convention). Asked concierge if there was an executive lounge that we could check-in - but apparently not - the hotel has only just been acquired from Wyndham.", "title": "Pleasantly surprised", "helpfulness": 4, "user": "dezertprincess", "date": "July 25, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 5509897}, {"rating": 2.0, "title": "Tried it twice, never again", "text": "Adjourned to one of the bars and after an hour and a couple or three martini's the of queue had all but gone.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5422646}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Was upgraded to a junior suite - always a nice touch, room was in good condition with all usual Hilton amenities.", "title": "Beautiful Hotel", "helpfulness": 3, "user": "Lako", "date": "June 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 5411371}, {"rating": 2.0, "title": "just ok", "text": "Restaurant - (24th floor?), is v.good, gym is excellent and the room rate was okay $110 per night.", "helpfulness": 3, "user": "NEWLKAT", "date": "June 13, 2006", "id": 5339299}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I stayed at the Hilton Anatole in Dallas, Texas for 4 nights at the end of June 2010. I'm a buyer, and my trade show was just across the freeway at the World Trade Center. Location is outstanding. Hotel staff is as helpful as I've seen at any large hotel. If this is the location you need, this hotel is a good choice.", "title": "Great, but goofy", "user": "jon160", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68724208}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I gather from the pictures and the reviews that some rooms are renovated.", "title": "Wonderful!", "user": "mohnaz", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68200330}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Well I guess we stayed at a renovated one. The hotel and the rooms are comparable to Wynn in Las Vegas. The room and the bathroom are spacious clean and beautiful, the Lobby, art works , restaurant at the top floor with amazing view , and amenities are impressive.", "title": "Upgrade to Club level", "user": "wildflower-Frisco", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 67837002}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Our room was in the Tower , we were not bothered by either the noise of construction .", "title": "It Certainly Didn't Wow Me", "user": "azjeans", "date": "June 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 67172894}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The $17 charge for the outdoor self parking was outrageous though!( come its TX not London)", "title": "Don't Stay Here This Summer", "user": "almychrn", "date": "June 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 1.0}, "id": 66539743}], "location": {"country": "United States", "city": "Dallas"}, "stars": 4, "variance": {"poor": 96, "average": 135, "very good": 355, "terrible": 57, "excellent": 415}, "aka": "Hilton Anatole Hotel", "slim_ranking": 0.197860962567, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Welcome to the Hilton Anatole hotel in Dallas, Texas. The Hilton Anatole hotel has defined Dallas and Texas by its sheer magnitude. Located in the heart of Dallas, Hilton Anatole is just minutes from downtown Dallas, and many top Dallas attractions. With 1,606 richly appointed hotel guest rooms and suites, over 600,000 square feet of premier meeting and event space, a priceless art collection, impeccable dining and full-service fitness and spa facilities. Travelers from American presidents to glamorous celebrities and generations of loyal business and leisure hotel guests have experienced the authentic Texas icon for one reason - this Dallas, Texas hotel transcends expectations into legendary experiences. Come start your legendary experience today at the Hilton Anatole hotel - a warm welcome and world of luxury await."}