{"user_rating": 4.5, "review_count": 2513, "name": "Hilton Garden Inn New York West 35th", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at this hotel for the second time, which speaks for itself, and would definitely do it again. The location is perfect: we arrived from Boston (Penn station) and didn’t even need a taxi – we just walked to the hotel in a few minutes! Shopping area is right across the street, round the corner and so on. Check-in and check-out service is prompt; the room facilities are modern and easy to use. You have really everything that you need: a coffee machine, an iron and ironing board, a spacious and comfortable wardrobe, a good hair dryer (ladies will understand me), free WI-FI in the room. New York is the city which never sleeps, but we do. So, for us a good sleep after a busy day means a lot. And The Hilton Garden Inn gave us that opportunity. We got the room on the 4th floor with no special view, and the receptionist lady was ready to move us into another room the day after, but we were so happy with our room, we could place our belongings in the most comfortable way, and we refused.", "title": "good value and high quality", "helpfulness": 2, "user": "everlastingtrip", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116071622}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "So, we would gladly recommend this hotel to everyone!", "title": "Very good value", "user": "Vitara-1", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116019440}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "First trip to NYC in years. This hotel made the trip. Very good value. Excellent location with good transport links. Free wifi. Will def stay here again.", "title": "Great hotel, definitely stay here again!", "helpfulness": 1, "user": "Rakigirl27", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116005673}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We arrived too early for check in as our cruise ship had docked very early but this was no problem. The helpful staff registered us and the concierge stored our bags so we could go exploring until our room was ready.", "title": "Fantastic location and great service", "user": "rob3693", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115992056}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "The location is excellent, close to everything we wished to see and do and for going further afield, the subway station was right at the end of the street.", "title": "Great People, Great Hotel!", "user": "mishmish310", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115991220}, {"rating": 5.0, "title": "Very Nice Hotel", "text": "This Hotel is in a great location and is about 7 blocks from Times Square and other famous New York City landmarks. The room decor is contemporary and the bathroom was very nice and clean. The bed was very comfortable. The staff was very courteous and extremely helpful. I will definitely stay here again the next time I visit Manhattan.", "user": "Boca_Lady_123", "date": "August 2, 2011", "id": 116192037}, {"rating": 5.0, "title": "Excellent hotel for the value", "text": "We stayed here for 4 nights. The location is perfect near the subway, close to Times Square and Macys right across the street. The property does lack a restaurant, but there are plenty of places nearby. My friend was worried about bed bugs in NYC, but this was not an issue with the Garden Gate. Very clean rooms. I would definitely stay here again.", "user": "BeansVictoriaBC", "date": "August 2, 2011", "id": 116189770}, {"rating": 5.0, "title": "Can't wait to return", "text": "Stayed with a group of friends at the end of July 2011 for 4 nights. Check in was very smooth. Reception staff very courteous and helpful. Location is brilliant - Macy's is practically on your doorstep and plenty of places for breakfast nearby if not included in rate. Times Square was a few blocks walk (around 15mins) The concierge (John, I think) recommended a place for breakfast - Sarabeth's on Central Park South which was amazing! Would definitely stay again. Also lovely complimentary cookies available in the afternoon!", "user": "blue817", "date": "August 1, 2011", "id": 116111425}, {"rating": 5.0, "title": "Perfect in every way", "text": "My mom and I visited New York for a weekend, and wanted to find a reasonably priced hotel (by NYC standards) without compromising on quality or location. Firstly, the midtown location is ideal - bordering on 5th Av means being in the heart of things, with just a 10 min walk up Broadway to Times Square and the theatre district. Equally, there is a subway station at the front door for access to everywhere. The hotel staff are friendly and obliging to a fault. The front desk checked us in within minutes, and were available at all hours for questions, to share a joke and have a chat. The concierge was excellent, from being able to recommend a good restaurant, tell us which subway to take, recommend an afternoon's adventure or reassure us that we were doing what tourists in NYC should be doing. The room was impeccable, with firm, extremely comfortable beds and excellent sound proofing against the mayhem below. Small details made a difference, like free wi-fi, morning paper at the room door, a microwave and fridge in the room, complimentary tea and coffee in the mornings in the lobby. I am well aware that choosing an hotel can make or a break a holiday. I can say without reservation that our choice of the Hilton on 35th was the best we could have made. A big thank you to all the staff, and especially to Jonathan, who gave me a rendition of all the American dialects, and how they pronounce that essential word, 'coffee'.", "user": "yesprey", "date": "August 1, 2011", "id": 116103444}, {"rating": 5.0, "title": "Excellent all around!", "text": "From checkin to checkout everything was wonderful. Friendly, helpful front desk and concierge, very clean rooms and surprised my daughter with a bday cake! Wouldn't stay anywhere else when going to Manhattan now.", "user": "travelnuts0066", "date": "July 31, 2011", "id": 116074256}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "This hotel is a good value for NYC based on its location and being clean and affordable. I stay at this hotel when I'm in town for business with no family with me and I'm focused on work and nothing else. If your in town with the family there are better hotels and better areas of the city to stay.", "title": "Good value for NYC", "user": "wigout1", "date": "February 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 152230198}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The rooms are rather small, but that is what you get for this price", "title": "I was very happy with the room assignment and the condition of the room. Housekeeping did a great job !", "user": "Jess N", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152224495}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The pax deli right around the corner is a good option for breakfast and lunch.", "title": "great location", "user": "DonBuffalo", "date": "February 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 152180657}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I have been a guest a few times and I have never been disappointed with the room or the hotel staff. It's prime location makes it easy to get to any part of Manhattan. The room accomodations are excellent from the quality of the bedding and mattress to the helpful staff. The lobby has a quiosk that will help you check-in with your airline before you depart for the airport. I thought the hotel offered a great breakfast which I enjoyed the day arrived but unfortunately the remainder of my stay keep me very busy and I wasn't able to eat breakfast there again. The lobby always has hot coffee in the mornings and hot chocolate and chocolate cookies later in the day. I'm looking forward to my next visit to New York and my next stay at the Hilton.", "title": "Good choice for mid-town NYC", "user": "TX_Champ", "date": "February 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152131397}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "at 35th and 6th this is a great location for your visit to Manhattan. Subway access is just a couple hundred feet from the hotel entrance. You can get there from JFK with one transfer. We had a king room, regular size. The table and chair for your laptop and internet connection are at the foot of the bed, making it a hassle for someone else to walk by. But this seems to be a typical hotel design problem. The shower is superb--glassed in with high shower head to accommodate tall people, and good water pressure. At the time we visited, the price was very reasonable and perhaps a little lower due to the construction on the street nearby--it was noisy during the day if your room was low and streetside.", "title": "Good Decision.....", "user": "Bajan4", "date": "February 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152075980}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This Hilton Garden Inn is strategically located in the heart of Midtown Manhattan in a perfect location for both business and leisure purposes.", "title": "Perfect choice", "user": "Niqoletta", "date": "November 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50179134}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The whole property is a 100% smoking free facility.", "title": "Good value but could be better", "user": "AnimalBabe", "date": "November 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 50082305}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Cleanliness is outstanding (they change bedlinens every 3 nights).", "title": "Just perfect", "user": "PlansAhead", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49924152}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "Rooms are very quiet, though of small to medium size which seems to be the rule in NYC.", "title": "Fantastic Location!", "user": "Shanazzi", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49885996}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Neighborhood is lively and apparently safe; there is a subway station just around the corner and a major bus stop (MTA) in front of the Hotel.", "title": "Favorite Hotel in NYC", "helpfulness": 1, "user": "HappyParrot1", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49355494}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My husband and I stayed here for three nights over the President's Day Weekend. The hotel was an ideal location for exploring the sights. We were close to Empire State, Rockefeller, Times Square and subway lines. The breakfast was plentiful. We appreciated the refridgerator in our room so we could store snacks and beverages. Our bed was comfortable and the room was clean. The staff was helpful and answered quesions for us which enhanced our trip - especially the transportation advice.", "title": "Convenient Location for Times Square", "user": "LizzChicago", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153071907}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I dont normally write reviews, but after coming home from our amazing family trip to New York i feel compelled to rave about this hotel.", "title": "fantastic... made the holiday complete", "user": "james p", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153027923}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "It was a home away from home, with clean tidy rooms, the comfiest beds. i cant really fault this hotel, the free wifi was also great in the rooms.", "title": "Good location", "user": "Carlielr", "date": "February 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 152980209}, {"rating": 5.0, "title": "Great Stay", "text": "Its location is the real show stopper, iconic NewYork sights only a 2-10 min walk.", "user": "Jon S", "date": "February 23, 2013", "id": 152874135}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "i strongly recommend this hotel you cant really do better.", "title": "Outstanding breakfast", "user": "JY G", "date": "February 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152855142}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "I booked this hotel because they had a special rate so I paid $390 incl tax for 2 nights. I arrived late after a long bustrip from Toronto 2 days before thanksgiving but that was no problem. Check inn was friendly and fast. My room was a bit small but had all what I need such as a fridge and microwave. There is also free internet. This hotel is very new and modern. When checking out they offered baggage storage because my flight home was in the evening. The hotel has also a small shop where you can buy food and drink. There is also a Duane Reade nearby which also sells food and drinks. The location and the staff of this hotel makes this hotel a perfect choice for a New York trip.", "title": "Excellent", "user": "A.Brouwer", "date": "December 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50730004}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We booked this hotel based on the reviews on TripAdvisor and were not disappointed. This is a new hotel, so everything is spotless! Great bed, awesome glass door shower, all new appliances, internet, the works! Location is great, too. About a block to the Empire State building, and a 10 minute walk to Times Square. You will definitely not find a better deal on such a nice new hotel in Manhattan!", "title": "Hilton Garden Inn 35th St - Very Very Nice", "user": "EverydayKnight", "date": "December 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50663927}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "I have stayed in Manhattan several times... we were looking for a place close to Penn Station as we always do. We came across the Hilton Garden Inn... was skeptical at first because there were not many reviews... All I can say is WOW!! After staying in other hotels in NYC... THIS is utterly amazing!! SPOTLESS, cordial, spacious (FOR NYC haha) and overall wonderful! Do not hesitate to book here.. awesome hotel! Macy's is diagnoally across from hotel! GREAT location.... keep it clean!!! :)", "title": "Shocked!!! Couldn't be happier!!", "user": "cpalms1160", "date": "December 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50653270}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I usually use the Hilton New York, but this newly opened Hilton Garden Inn is only two blocks from our office so it made sense to try it out.", "title": "Nice central hotel provided the rates are reasonable", "user": "andreGeneva", "date": "December 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 50485207}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "I had booked two weeks back and found a room for 2 nights at $219 a night + tax which seemed like a bargain. Then due to personal reasons I had to delay my trip by one day and when I changed the resevation online the price went to $359 + tax which would make the room a little pricey considering.", "title": "Excellant Hotel and Location", "user": "Tc+Ac", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 50338595}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This is a \"European style\" hotel, in that the rooms, bathrooms, and closets-- are small---but that is the only accommodation one makes by staying here--and also is the primary reason why the rates are so reasonable. The rooms and bathrooms are very well-appointed, and comfortable.Our HD TV was not working at check-in, but a very pleasant service person showed up immediately and fixed the problem. There is a Euroopean style bar right in the lobby--with friendly bartenders and good selection of drinks. The concierge and staff were uniformly friendly and helpful.", "title": "Great value, great service, great location", "user": "Francis G", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152787969}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "My wife, daughter and I had planned an evening in New York, staying overnight at the Hilton Garden on 35th Street.. We all were looking forward to it and having read the reviews of the hotel on TripAdvisor, I was certain that our stay would be enjoyable.", "title": "Inflexible policies, unresponsive management", "helpfulness": 4, "user": "BernieG", "date": "February 22, 2013", "detail_rating": {"service": 1.0}, "id": 152779444}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Sadly, the weather forecast was not a good one. A mix of rain and snow was expected in the morning and afternoon, changing to all snow by evening. 6-12 inches in total was forecast in our area and in New York City. Knowing full well that we were required to cancel 1 day in advance to avoid a penalty, we held out until the morning of our arrival, hoping that the weather forecast we heard would change, as is often the case. Maybe the warnings would be lifted or the impending snow totals would be revised downward.", "title": "Well-located, convenient, and comfortable", "helpfulness": 2, "user": "maymay777", "date": "February 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152754718}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Unfortunately, the weather did not cooperate and the dangerous conditions that were forecast to exist had actually begun several hours earlier than expected. Once that became clear, I called the Hilton Honors 800# to cancel but was instructed to call the hotel directly. Apparently, many hotels in the Hilton family were allowing penalty-free cancellations via the 800 system but the Hilton Garden was not one of them. I called the hotel but I had no luck as the clerk (politely) refused to waive the penalty.", "title": "Great hotel, great location, and great customer service!", "user": "ADoyle31", "date": "February 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 152691728}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I called the Hilton Honors# again, and the agent offered to call the hotel on my behalf. After a few moments, the agent returned to the line with the same bad news; no waiver of the penalty. Regardless of the impending penalty, I canceled the reservation as of 8:20 am. I didn't want another traveler to potentially be denied a room that I wasn't going to occupy.", "title": "get the high floors", "user": "mld1961", "date": "February 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152627982}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My son and I stayed for 2 nights at the Hilton Garden Inn in N.Y..C.This was our first time in this hotel. The service was excellent from the front desk, to the maid,to the breakfast buffet. The room was well-appointed with all the amenities to make our stay as comfortable as possible.We will definitely stay at another Hilton Garden Inn when we travel again.Very quiet and also very clean!!!", "title": "Loved it!", "helpfulness": 3, "user": "debra G", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116495087}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel is a great choice for its location, cleanness and price. It's not the cheapest place to stay, but it really worth the money you pay.", "title": "Great experience. Definetely will come back!", "helpfulness": 2, "user": "Melissa_KV", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116447020}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The staff is friendly, the rooms have great size and you can't beat the location... Attention ladies, Macy's is just across the street... not to mention all the other great stores...", "title": "Wonderful Facilities, and an even better staff", "helpfulness": 1, "user": "SteveF013", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116258395}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "From now on, this is the hotel I would stay in NYC and recommend for all friends and family.", "title": "Best value for money hotel in NYC", "helpfulness": 4, "user": "Agmeng", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116226356}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I've had the distinct pleasure of staying at this hotel 3 times since they opened in early '09. My first visit was when they first opened in early 2009. Then I stayed for 8 nights in July 2010, and another 8 nights in late July 2011.", "title": "An Excellent Choice", "helpfulness": 3, "user": "amief", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116210228}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "The hotel is great- very clean, well appointed, fabulous location. Rooms are not large (typical for NYC) but extremely well designed- they have everything laid out quite well (even a microwave and fridge!). The staff was A+- very helpful with advice.", "title": "Great deal, great location.", "user": "KSchmidt", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 116634877}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My husband and I arrived late on a Tuesday and found they were over booked. They apologized and put us in a small room and promised to move us the next morning. We were moved the next morning to a very nice end room which was spacious and quiet. Every employee was friendly and said hello the minute they saw you. The hotel opened in 2009 so it was very clean and new. There was a microwave and small fridge in the room. The bed was a sumptuous air mattress that was adjustable. It was in the 90's the week we were there and they offered free bottled water and had a cooler set up in the bar area with free cirtus water. The manager, Ryan Shafi, personally thanked us for coming and gave us his business card to email him the next time we were in Manhattan so he could handle the reservation himself as a way of saying sorry for the first night mix-up. The location is fabulous. The subway is a block away, as is Macy's. Broadway St was a block away and we were able to walk to Times Square, Empire State Building, Rockerfeller Center and many other sites. We were truly impressed.", "title": "We loved it!!!", "user": "GerryandFred", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116618541}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Great hotel. OUTSTANDING service...very accommodating. Value far exceeds other hotels (I am in NYC often). Will definitely return!", "title": "Fantastic location, service and quality!", "user": "MrTourGuy", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116613478}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed here for 2 nights.", "title": "Good hotel for New York City", "helpfulness": 2, "user": "Ms30", "date": "August 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116504424}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "While we have been to New York before, we still went to some of the popular tourist attractions. We walked a lot and we found the hotel to be conveniently located to the places we went to (e.g. times square, empire state building etc.).", "title": "What everyone else says is true: excellent stay in an area with many options", "helpfulness": 2, "user": "travel_wahoo", "date": "August 9, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116497447}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We just got back from New York and it was a great stay. My fiance won tickets to a jazz concert at Lincoln Center, but we only had a week to make travel arrangements from DC. I used tripadvisor to choose a hotel to stay at (that was assoc. with Hilton - since I was going to use points for the first time). We've stayed in Times Square before, and didn't want to this time. Staying Downtown would be too far away, so I focused on midtown (but still on the west side).", "title": "No complaints - great hotel", "helpfulness": 1, "user": "HoosTravelin", "date": "December 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51135187}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I really liked the reviews I read for this hotel. It was relatively new, good location and nice staff (and no knock on the door at 9 am to clean the room or check out like I've read for other places). Anyway, I agree with a lot of the comments posted on here. We were welcomed by staff as we entered the hotel and were able to check in pretty early. Painless check-in! Room was a little small, but cozy enough with a rather large bathroom (for NYC). Standing shower, which was great, and you could tell the amenities and the fixtures were top notch. TV was a little slow to start up, but that was explained in the room (on the placard).......flat screen with quite a few HD channels too. Went to the business center, and there is enough room to do some work on the computer (I think there are 4 in there). Internet is free in the room, but I didn't bring a computer for that trip (if you're there for leisure, the computers in the b center should suit you just fine). Only slight criticism is that the elevators took a while to actually go down. They all kept going up, and we had to get on and go up several flights (picking ppl up), before eventually going back down to the lobby. Interesting. Based on other reviews, we didn't even try the food. There are too many other places within walking distance to try out.", "title": "GREAT - DEFINITELY RECOMMEND", "user": "PINKYnBRAIN09", "date": "December 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51045307}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Besides the room and the hotel, the location was great for us! Macy's is less than a 2 minute walk (less, but you have to cross the street). Good Christmas shopping! You can see it as you walk out the hotel, on the right. Empire State building is very close, as well as TImes Square. The subway stop is right there too, which was perfect for us because it was COLD the entire time we were up there, but we were able to quickly walk to that station (34th Street/Bryant Park, I think) and get out at 59th St/Columbus Circle) and did the same thing coming back to the hotel. No need for a taxi this time around.", "title": "Good hotel", "user": "Michael_East_Sussex", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 51037019}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "All in all, the staff took care of us and answered all our questions, and based on everything stated above (and more), we would definitely stay there again..........and hopefully, it will be a little warmer next time.", "title": "Great location and lovely rooms, could be managed better !!!", "user": "misty1112", "date": "December 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50995201}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "This was a great hotel - great location not to close or too far from anything. They were very accomodating - we arrived very early and they checked us in! They had a great business centre there and a nice little bar that was open each night. The Rooms were nice and spacious with a great tv. We couldn't fault this hotel (other than its a little expensive) and would definitely stay again.", "title": "Wonderful Place!", "user": "NewYorkMellyd", "date": "December 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50759378}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "There is a huge choice of hotel accommodation in NYC, and it's often hard to get it right. This hotel manages to provide everything you could possibly need, at a reasonable price, and it's in a perfect location. We had previously stayed at The Grand Hyatt, but The Hilton Garden offers so much more in terms of facilities and customer service. I emailed the manager before we arrived and asked it we could have a room with a view of the Empire State building. I wasn't sure if this would be possible, but got a lovely reply, and when we checked in we were given a room right at the top of the building with the most amazing views . Our room was really comfortable, spotlessly clean and with everything you could wish for, including a microwave. We loved everything about our stay and were made to feel really welcome by all the reception staff. You can walk everywhere and there are lots of good places to eat nearby, and the management and staff should be commended for their care and attention.", "title": "The best place to stay...", "helpfulness": 1, "user": "KB2010", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152620344}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Basically, this is the perfect NYC hotel and I can't recommend it highly enough.", "title": "Great location", "user": "GnaSeattle", "date": "February 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152550912}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I enjoyed my stay at HGI Herald Square. It has a great location! Right by the subway, Javitz Convention Center and Macy's I appreciated the hand sanitation stations they have in the lobby. Warm cookies are always nice to enjoy!", "title": "Good Value", "user": "Liketotrvl", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152540927}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We liked that this hotel was walking distance to many major sites while being a little further out of the noise and congestion of Times Square. The room was quite large compared to other NYC properties I've seen and it was clean and comfortable. The staff was very welcoming and friendly.", "title": "We absolutely loved this hotel-- and our view!", "user": "Liz R", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152432690}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Great hotel, great service, perfect mid-town location just far enough from Times Square so you don't feel smushed. You won't find a nicer staff anywhere. They even have a free jelly bean dispenser for the kids at check-in and check-out. The concierge was amazingly helpful. Best of all we had a flat-out terrific view of the Empire State Building from the 26th floor.", "title": "Blue Fiddle", "user": "Bluefiddle", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152282638}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at the above hotel on the 20th & 21st December after our flight was cancelled at JFK to Miami. Unfortunately we were unable to get to Miami to embark the cruise ship for Christmas to go to the Caribbean and we had to find accommodation in New York until we could find a flight back to the UK. After spending the night at JKF on the airport floor this hotel was a great find for us. The staff were excellent, so helpful to us and and so friendly a credit to the management. The hotel was immaculate and the room great. It was marvellous having free internet access for us to make all the arrangements to get back to the UK. We did not eat at the hotel but found an Irish bar down the same road that had excellent meals. It was unfortunate that we could not enjoy New York more as we only had our summer clothes with us. This hotel is near Macy's and central for everything. We would definitely recommend this hotel to our friends and if in the future we visit New York would stay there again.", "title": "Wonderful hotel", "user": "MargeYorkshire", "date": "December 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51808607}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "My best friend and I spent two days (one night) in NYC 12/17 - 12/17/09. We got a fantastic deal at the Hilton for $169.00 for a king room. We asked if there was a possibility of getting a two-bed room. There was, and they gave us one with a great view of Macy's and the Empire State Bldg.", "title": "Great hotel.....great location!", "user": "BuffaloChick", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51639785}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "The hotel was clean, modern, and in a fantastic location. The beds were super comfortable, the flat screen tv was great, and the bathroom had a big counter - enough room to put all our toiletries.", "title": "Good location, nice rooms but... dissapointed with work ethics", "user": "John655", "date": "December 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 51593917}, {"rating": 4.0, "stay_parameters": "Stayed December 2009", "text": "Ryan and Tiago behind the desk were fantastic! They were very nice, helpful, and outgoing. They answered all our questions. You can tell they enjoy working together.", "title": "Best view in town", "user": "jordansarah", "date": "December 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51526377}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "A nice hotel, great location, fantastic city....what more can I say?", "title": "Very good hotel overall", "user": "logube", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51200525}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 35, "average": 138, "very good": 843, "terrible": 29, "excellent": 1468}, "aka": "Hilton Garden Inn New York West 35th Hotel New York City", "slim_ranking": 0.162528216704, "description": "Ideal Midtown location with COMPLIMENTARY amenities including Internet, fitness center, business center & more! Hilton Garden Inn New York/West 35th Street was built in 2009 and is perfectly located in Midtown Manhattan just steps from some of New York's best attractions including the Empire State Building, world-famous Macy's at Herald Square, Times Square, Broadway theaters, Fifth Avenue shopping and Madison Square Garden/Penn Station. Located on West 35th Street between 5th and 6th Avenues, this ultra-modern hotel is close to many restaurants, lively nightlife, sightseeing and New York City’s best shopping. The hotel is walking distance to all major subway lines and is convenient to Jacob Javits Convention Center, Port Authority Bus Terminal, Grand Central Terminal and all (3) area airports.The hotel features 298 newly built, contemporary guestrooms each equipped with 32-inch LCD flat panel television, refrigerator, microwave, safe, coffeemaker large work desk with ergonomic chair and complimentary Internet access with secure remote printing to the hotel’s Business Center. COMPLIMENTARY amenities include high-speed lobby and guestroom Internet access, 24-hour Business Center, 24-hour Fitness Center, morning coffee and tea in the lobby and USA Today®. Additional onsite amenities include The Great American Grill (located in the hotel lobby and open daily for breakfast), lobby lounge with flat-screen television, evening room service, 24-hour Pavilion Pantry (stocked with your favorite snacks, drinks & toiletries) and Concierge/Theater Ticket Desk. The hotel is 100% non-smoking. Self parking is available. The hotel allows service pets."}