{"user_rating": 4.0, "review_count": 356, "name": "Hilton Garden Inn Los Angeles/Hollywood", "reviews": [{"rating": 5.0, "title": "4 Nights in Hollywood", "text": "This was a great place to stay. Great food, hot water, comfortable beds and very quiet. Staff cordial and accommodating. I am a gold member so a great cooked breakfast was served by a friendly staff. What more could you ask for?", "user": "James H", "date": "October 8, 2013", "id": 180241054}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Just spent 3 nights at the hotel while my daughter and I attended a few concerts. Rooms were clean, felt totally safe on the property. Walking distance down to Hollywood Blvd. Hotel was quiet - we had a room on the pool side of the hotel so didn't hear any noise from the street at ALL.", "title": "clean safe hotel", "user": "melissa c", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 180239402}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Really need to give a shout-out to the hotel staff though. EVERYONE was seriously friendly, helpful etc etc. Special kudos to Anthony at the front desk. Great guy and we really appreciated his friendliness and made us feel really welcome.", "title": "Adequate and Pleasant Stay", "user": "joantham", "date": "October 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180020581}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Only heads up is the $32 a night valet charge. No other option there but to valet it.", "title": "Clean and good value", "user": "AMLIndy", "date": "October 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 179982906}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Hilton Garden Inn had a good location with just a short walk to the Walk of Fame and the malls surrounding it. But besides that, there really isn't anything else nearby.The rooms though not anything fancy was adequate and comfortable enough for 4 adults. The room and bathroom alike was very clean as well. The staff were all helpful and friendly which contributed to a pleasant stay. All in all, a nice place to stay if you're looking to be in the Hollywood area.", "title": "its real Hollywood", "user": "Timothy P", "date": "October 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180005430}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Good clean comfortable hotel good location. Unfortunatley the fire alarm was deliberately activated by unruly guest(s) causing some people to evacuate but not everyone before it was learned to be false alarm.The manager advised next day he suspected who it was but could not prove it, it has happened before but Hilton will not put in surveillance camera. Also some noisy party guests were verbally abusive to us when requested to please be quiet when fooling around in corridor early morning.", "title": "Alan Australia", "user": "Alan F", "date": "September 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 178536356}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We had a couple of nights here before picking up a RV to do more travel. Is it in a great location so that you can walk everywhere which is what we wanted as we had our 3 children with us. You don't get any fridge or anything like that. It was very squishy but did the trick.", "title": "Hollywood Heights Hotel", "helpfulness": 1, "user": "juliamitchell", "date": "September 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 177983589}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The staff at the hotel was VERY less than friendly and not very helpful with anything. The breakfast was awful and the prices were way too much for what was given. Call your own taxi if you want one on time. Eat somewhere else for better food at less cost.", "title": "Trip to Hollywood Bowl", "helpfulness": 1, "user": "Roberta B", "date": "September 20, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 177975608}, {"rating": 3.0, "title": "Convenient to Hollywood Bowl. Needs a bit of a freshening up.", "text": "We booked it for convenience of location and were pleased that we did. That said, I was underwhelmed by the rest of the hotel's offerings. I found mold in the shower, fraying carpet in the rooms and crowded hallways. There was one small elevator that always seemed to be in use. Yes, my room was right by it. for the location being right on a busy street it was quiet. I found the beds comfortable and clean. Price was good for the location. Found it ideal to park the car and walk to the Hollywood Bowl for our concert. Staff was friendly. Lobby was crowded with guests and luggage. No where to go and wait to check in. Good for a quick overnight. Not where I would stay for a long trip", "user": "Plookey", "date": "September 16, 2013", "id": 177324937}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "I give the front desk and cleaning staff A+. And the breakfast staff in the restaurant well above expectations. The staff sold me on your hotel and I became a Hilton Honors member even though I have stayed a Hiltons before being part of he honors program did not interest me until this excellent service occurred.", "title": "Garden Inn Hollywood excellent staff", "user": "Greg M", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177191895}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Small tourist hotel - the parking lot is all rentals, mostly Chevys - close to Hollywood Blvd and Hollywood Bowl. Expect to pay top luxury hotel dollars or HHonors points plus $32 @ day for parking, and almost $20 for breakfast. For this you get to walk to the Blvd. (big deal) with Swedish, New Zealand, German, or American tourists who don't know any better. I stayed there (with points) because it was very convenient to the three places I had to be for a family event, and I did not want to drive all over LA.", "title": "It's All About Location", "helpfulness": 4, "user": "DrSGPrice", "date": "October 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 181137502}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Overall we were please with the hotel location and value and will return to stay when the next time we travel to LA again. We will recommend your hotel to some of our friends for sure. The area we reckon should be improved are the restaurant, car park, swimming pool facilities. The speed up at the front desk will be a big help to the hotel guests after they have long flight from their place of original. Should there is a delay in the checking in offer the guests a cup of tea or coffee with be a big plus for them!! Thank you for listening.", "title": "Satsify Stay", "user": "Jacky1368", "date": "October 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 181215839}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I really enjoyed my stay at the Hilton. The location was perfect for my training in Hollywood and the staff was very helpful in finding the best attractions. The resturant had a great breakfast and the hotel bar was fantastic! I would recommend this location to friends and family.", "title": "Hollywood's BEST", "user": "Stella H", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181215922}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The Hilton Garden Inn Hollywood provides nice rooms, great service and you can't beat the location: 2 blocks from the heart of Hollywood Blvd., 3 blocks from the Hollywood Bowl, and 5 blocks from the In 'n Out Burger! Who says you can't walk in LA? Less than 4 blocks to the nearest freeway entrance, making it easy to drive to other destinations in and near Los Angeles.", "title": "Convenient Hollywood Location, Great Service", "user": "John T", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181215736}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Would highly recommend this Hotel, small, clean and felt very safe. King size Bed so comfortable. In our room we had a lovely big bathroom, which was really clean. I also liked that we were able to open windows to let a bit of fresh air into room also. EXCELLENT service by friendly, helpful staff which really made us feel welcome, nothing was a problem for them . We were advised to book room at back of hotel which was nice and quite away from the street noise, as motel on main road. Only short walking distance down to Hollywood Blvd, train station, bus stops and shopping malls etc. Would definitely stay here again.", "title": "Excellent place to stay, safe and very clean.", "helpfulness": 1, "user": "j_fratus22", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 180752956}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had a brief stay at the Hilton Garden Inn on our way back to UK from Hawaii. The service from reception was fantastic, thank you Juan and Erika for your advice on what to do on our short visit, perfect. The room was clean, comfortable and quiet (2nd floor overlooking the car park). Only a pleasant 5 minute walk to Hollywood Boulevard and Hollywood Walk of Fame. If we ever came to Hollywood again we would definitely stay here.", "title": "Excellent Location", "user": "SLQEngland", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179782258}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Conveniently located in Hollywood, the Hilton Garden Inn had a clean and cheerful appearance. We got a room on the 7th floor and had a great night's sleep, which was importance because we had to get up early to clean the streets the next day as part of our Clean Thai Town project. From the moment we arrived, the staff were professional and friendly, from our experience with the valet and front desk staff.", "title": "Clean and Comfortable", "user": "ctchung4", "date": "October 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179664110}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Now that I have been to LA, I can tell most people to seriously give it a miss. Unless you're bringing your sprog to Disneyland, need to kiss someone's pawprints lining Hollywood or can't get the Santa Monica song out of your head, you are better off going San Francisco.", "title": "Good price and service but location...", "user": "Linggi", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 179049758}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "If you do have to go LA and stay at Hollywood then the Hilton Garden Inn at North Highland Road is good value for money with spacious rooms and helpful staff. There is a pool somewhere and a small snack counter beside the reception. Brownie points for the gratis coffee and tea with takeaway cups in the morning and apples and cookies in the afternoon.", "title": "Great Location in Hollywood", "user": "julie r", "date": "September 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178890603}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "On the other hand, the in-room airconditioner throbs like a disco at night and the bed and pillows are way too soft except for those with no backbones. But so it seems with every hotel we stayed in California. So plus and minuses here and there.", "title": "Great stay", "user": "Tessa035", "date": "September 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178849647}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 3, "variance": {"poor": 6, "average": 60, "very good": 162, "terrible": 2, "excellent": 126}, "aka": "Hollywood Heights Los Angeles", "slim_ranking": 0.11858974359, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Nestled in the heart of Hollywood within the city of Los Angeles is the Hilton Garden Inn Los Angeles/Hollywood hotel; a short walk, drive or commuter trek to many prominent corporations & local attractions; this Los Angeles hotel is the ideal location for business & leisure travelers. If you find yourself in Los Angeles for a convention at the Los Angeles Convention Center, a business meeting \"Downtown\" or a movie deal in Hollywood, the Hilton Garden Inn Los Angeles/Hollywood has every amenity plus great location the on-the-go traveler needs to pull it all together. The Hilton Garden Inn Los Angeles/Hollywood is centrally located near Disney/Dreamworks Studios, Sony Corporation, Capitol Records, Warner Brothers, Eastman Kodak, Deliotte and Touche and Coca Cola. Located within walking distance to the world famous Hollywood Walk of Fame, the Grauman's Chinese Theatre or one metro stop to Universal Studios, The Hilton Garden Inn Los Angeles/Hollywood is in the perfect \"IT\" location."}