{"user_rating": 4.0, "review_count": 459, "name": "Hilton Melbourne Beach Oceanfront", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "I spent 8 days and loved the place. The hotel was spotless and my room was in the new tower. The staff was great from my room attendant to the front desk and the restuarant and bar staff. Some painting was going on but in the main lobby and out of everyones way (not an issue). The pool is nice and heated and the outdoor tiki bar was a great place to hang out and meet some of the hotel guests. Beach access and rentals for everything from chairs to boogie boards was great. Had most of my meals there, breakfast was good, burgers and the club sandwitch for lunch were always good. For dinner I would reccomend the Flat iron steak it is great!!!. Wall Mart, Winn Dixie and many other shops and stores are one block away. Melbourne beach is a nice little seaside town seperate from the city itself, really quiet and all the people were very nice and friendly. I would love to go back and spend another week there, had a great time.", "title": "Great place, no complaints", "helpfulness": 1, "user": "treynolds37", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 22013008, "likes": {"liked": "— The staff was great", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Staff at check-in was great. Room was as expected, although a little musty, fishy smell. Maybe expected 50 yards from the ocean. The smell went away with the AC turned to a cooler setting. Pool was nice. Mostly adult depths. Bar poolside. Hottub. A short walk over the dunes to a not crowded beach. Many shells to pick up. Computer available for use. Staff very helpful. Would recommend.", "title": "Staff Wonderful, Hotel OK", "helpfulness": 1, "user": "hawkeyetough88", "date": "August 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 19279105}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We had a GREAT time at this hotel. We booked two adjoining rooms in the south tower, which is the new addition, to meet another family for the weekend.", "title": "Great rooms, friendly service, perfect beach location - FUN Weekeend!", "helpfulness": 2, "user": "Texas_Knight", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19214916, "likes": {"liked": "— The rooms, service, beach access", "disliked": "— Pool clutter at the end of the day"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We were greeted by Liz, who was extremely friendly and helpful, and quite attentive to our two children. She told them about \"sea glass\" and brought in some pieces for them to see the next day. Liz was great, and we enjoyed talking with her.", "title": "Would definitely return", "user": "Namaily", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18839083, "likes": {"liked": "— Great View", "disliked": "— Small Balcony"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our rooms were simply great. While the rooms in the south tower don't face the beach, you still have a nice view of the ocean. The rooms were spacious, modern and new. The beds were very comfortable, and it was great having a fridge in the rooms. If you have the choice, I would try to get the south tower.", "title": "Not your typical Hilton hotel!", "user": "cmspina", "date": "May 25, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 16391792, "likes": {"liked": "— Nothing comes to mind!", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We stayed here for two nights and had a great time walking on the beach for hours collecting shells. The hotel itself was very clean and the staff was very friendly and helpful, but there were some areas that need improvement.", "title": "Not perfect, but great deal for the price....", "user": "Starglow", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 2.0}, "id": 16339306, "likes": {"liked": "— Spending hours walking on the beach with family.", "disliked": "— The queen sized beds are too small for two people."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "The queen sized beds are too small for two people to sleep comfortably, but are great for only one person. The clean towel rack is mounted in the shower and the clean towels will get wet if someone forgets to remove them before taking a shower. There was plenty of room to mount the towel rack outside the shower next to the sink, so someone wasn't thinking when the decision was made to mount it inside the shower area. There is no bathroom ventilation fan which creates other issues in the bathroom area. The room doors do slam loudly as stated by another reviewer.", "title": "Unimpressed", "user": "zzzzzz95", "date": "April 25, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 15341877, "likes": {"liked": "— Beach", "disliked": "— The Hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We did not eat at the on site restaurant and there is no free continental breakfast so we brought in our own food to eat. The trash cans are very small oval shaped and don't hold very much.", "title": "great place", "helpfulness": 1, "user": "gaylord19", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14861404, "likes": {"liked": "— view,room and staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The room had wired and wireless Internet access but it wasn't very fast using either the wired or wireless connection.", "title": "Nice and clean", "user": "Touristin", "date": "April 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14766888, "likes": {"liked": "— Beach", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "Despite the negatives, if you're looking for a place where you can spend hours at the beach or just watching the waves, this is the place to be and I can't beat the great deal I got. I would stay here again, but bring your own breakfast.", "title": "Nice, Relaxing Stay at the Hilton", "user": "TripAFan", "date": "March 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14123881}, {"rating": 4.0, "title": "Stayed for business, but would enjoy a vacation here too", "text": "Stayed here for a brief night, but the stay was comfortable. The room was clean and spacious. It was almost a mini-suite, with a couch in the room. Didn't go to the pool or beach, but the view from the room was nice and the facilities seem to be quite good. Currently some construction under way in the opposite tower, but was not an issue for me during my stay. Once this is complete, should be an excellent hotel for a family or couples vacation.", "user": "OilIsle", "date": "January 9, 2008", "id": 12470789}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Living in Central Florida, the Wife and I like to getaway from life and work for short trips to the coast. I picked the Hilton for a three night stay and could not have been more pleased.", "title": "Great Getaway!", "helpfulness": 1, "user": "Windwalker269", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8460822, "likes": {"liked": "— Staff and view", "disliked": "— Small balcony"}}, {"rating": 5.0, "title": "Terrific Staff", "text": "The room was very clean and well stocked. Ocean view was great, the balcony was stand on sized only.", "helpfulness": 1, "user": "Travelnteacher", "date": "July 20, 2007", "id": 8207877}], "location": {"country": "United States", "city": "Melbourne"}, "stars": 3.5, "variance": {"poor": 36, "average": 58, "very good": 170, "terrible": 15, "excellent": 180}, "aka": "Hilton Melbourne Beach Oceanfront Hotel", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Hilton Melbourne Beach Oceanfront hotel in Melbourne, Florida is located on the beautiful beaches of Florida's Space Coast. All 200 of our rooms offer complimentary high-speed wireless Internet and stunning views of the Atlantic coast. Located in the beachside city of Indialantic, Florida, our green, eco-friendly Hilton Melbourne Beach boasts a classic Florida ambiance. From the moment you walk into the lobby of our Melbourne, Florida hotel, you will encounter our beautiful atrium with its floor-to-ceiling glass panels showcasing a panoramic view of the Atlantic Ocean. Each of our luxuriously appointed guest rooms is just steps from the ocean! Wake to a stunning sunrise and watch the rolling waves of the Atlantic Ocean. All of our guest rooms feature FREE high-speed wireless Internet access, a spacious work desk, Hilton alarm clock radio, coffeemaker, iron, ironing board, hair dryer and much more."}