{"user_rating": 4.0, "review_count": 605, "name": "Hilton Strasbourg", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Stayed for 2 nights room was very basic and slightly dissapointing as when I actually arrived on my 1st night I was told my room had been cancelled and they had no where for me to stay they did not seem very sorry about this and I was not very happy with their lack of help. Basicly I ended up going over the road to the holiday Inn I was a woman travelling alone it was 11.30 in the evening wet and dark and I had to navigate my way on my own to another hotel!! I was not happy the woman at the customer desk did not seem helpful or concerned.", "title": "Not Bad Not Brilliant", "helpfulness": 4, "user": "vickeh", "date": "February 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6807506, "likes": {"liked": "— Indian meal in restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I did eventually get my room the day after and ended up staying for 2 nights, as I had stopped at the holiday inn the evening previous I was then very dissapointed with my room as holiday inn was actually a much nicer cleaner room to be in.", "title": "In need of renovation", "helpfulness": 3, "user": "Brian&Alan", "date": "February 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 6782931, "likes": {"liked": "— Breakfast", "disliked": "— Location & Decor"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "All in all my experience was such that I would not seek out this hotel again.", "title": "All you would expect from a Hilton", "helpfulness": 4, "user": "mklovesny", "date": "December 30, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 6520397, "likes": {"liked": "— room service", "disliked": "— bellman on arrival"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006", "text": "Right opposite the European Parliament, the Hilton is about 10 min drive from the beautiful centre of Strasbourg. Location is great for the Parliament but not good for the greats cafes and restaurants of Strasbourg which are well worth a visit. My room was very dated in decor, and a smoking room. Remember to ask for a non-smoking room as there were non available when I arrived. The rooms are a big size and have all the usual facilities, incl. broadband for EUR10. Breakfast was good, buffet style. Would stay in Central Strasbourg next visit.", "title": "Disappointed", "helpfulness": 5, "user": "Tagesthemen", "date": "December 19, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 2.0}, "id": 6471969, "likes": {"liked": "— The helpful staff", "disliked": "— The TERRIBLE breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Stayed for 2 nights at Christmas.", "title": "Magnifique!", "helpfulness": 3, "user": "Karter", "date": "August 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5616682, "likes": {"liked": "— Spacious rooms", "disliked": "— Slightly out of the old city centre"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We stayed only 1 night at the Hilton in Strasbourg, we had a standard room and it was simply a perfect place to stay. You are not in the center of the city (but the Tram transportation is great and easy to use). The rooms are large and the bathroom well designed. The bed is firm and you I slept extremely well.", "title": "Great place, even greater food", "helpfulness": 3, "user": "Zivana", "date": "July 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5458083}, {"rating": 5.0, "title": "New hotel with all the trimmings", "text": "But the real experience is their hotel restaurant. We had the chance to be there while they organized the annual barbecue (it lasts for 1 month). It is fantastic. You choose from a buffet of starters and then you have the barbecue entrées, you finish with a buffet desert. That is something you should try at least try ones.", "helpfulness": 8, "user": "Trisha0001", "date": "September 13, 2004", "id": 2528489}], "location": {"country": "France", "region": "Alsace", "continent": "Europe"}, "stars": 4, "variance": {"poor": 35, "average": 126, "very good": 266, "terrible": 15, "excellent": 163}, "aka": "Hilton Strasbourg Hotel", "slim_ranking": 0.276923076923, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 3.5}, "description": "Right opposite the Congress Center, the Hilton Strasbourg hotel boasts 15 meeting rooms with wireless internet access, an Executive Lounge and a ballroom. Enjoy French and international cuisine at Le Jardin du Tivoli restaurant at the Hilton Strasbourg hotel. Try local wines or savor gastronomic favorites at La Table du Chef. Step outside the Hilton Strasbourg hotel and uncover Strasbourg attractions like the Petite France district and Strasbourg Cathedral. From Hilton Guest Rooms to Executive Rooms with Executive Lounge access, all rooms at the Hilton Strasbourg hotel offer wireless access. Right opposite the Congress Center, the Hilton Strasbourg hotel boasts 15 meeting rooms with wireless internet access, an Executive Lounge and a ballroom. Enjoy French and international cuisine at Le Jardin du Tivoli restaurant at the Hilton Strasbourg hotel. Try local wines or savor gastronomic favorites at La Table du Chef. Step outside the Hilton Strasbourg hotel and uncover Strasbourg attractions like the Petite France district and Strasbourg Cathedral. From Hilton Guest Rooms to Executive Rooms with Executive Lounge access, all rooms at the Hilton Strasbourg hotel offer wireless access."}