{"user_rating": 4.0, "review_count": 883, "name": "Hilton Cincinnati Netherland Plaza", "reviews": [{"rating": 5.0, "title": "My dream came true", "text": "Well two familys went. I have a aunt who works for HIlton and we got a two double bed room on the 26th floor. Also, let me add for 49 dollars a night. HA! We had valet parking and they were really good about unloading and loading when ever we had to. It was really awsome. The rooms had a AWSOME VIEW. We have the river/ball park view. The room was big, nice bathroom with all the stuff. I liked how there were robs in the closet. That was pretty cool. Staff was nice. The lady that work in the Gym/Pool was a RUDE person and I hope HIlton handles with them, turning out the lights and telling us to leave in a verry mean way. The management said that it isnt the first time this has happened. But all in all, everything was awsome. I coudnt wait to stay again!", "user": "Debary241", "date": "July 20, 2006", "id": 5491085}, {"rating": 5.0, "title": "Fabulous Hotel in Every Way!", "text": "My husband and I began our three week trip in the US with this lovely hotel. We used our Hilton Honors points for our one night stay and they rolled out the red carpet for us! The room they gave us was absolutely beautiful. The ceilings were at least 11 feet high! The draperies were lush and our bathroom was not to be believed!! I've never seen such an elegant bathroom in any hotel - ever!! It had a wonderful dark green marblemshower with a large soaking bath tub separate! Oh, and the closet was bigger than most othet hotel bathrooms!! You could fit a twin size bed in it easily!", "user": "Jennifer and Ji... F", "date": "July 18, 2006", "id": 5478368}, {"rating": 3.0, "title": "cool art deco lobby", "text": "We had honors floor privledges which included breakfast and evening snacks and drinks.", "user": "jgodic", "date": "July 17, 2006", "id": 5475472}, {"rating": 4.0, "title": "An historic hotel in downtown Cincy!", "text": "The housekeeping staff was pleasant and really did a great job. Everything shined liked a new diamond. It was such a nice stay in every way. I am very picky about cleanliness and couldn't find a thing wrong.", "user": "A TripAdvisor user", "date": "July 15, 2006", "id": 5468784}, {"rating": 5.0, "title": "Enjoyed the Hilton Netherland Plaza!", "text": "The rest of the staff was marvelous as well. We hated to leave this wonderful hotel and the next time we're back in Cincinnati, we will be staying here!!", "user": "rahir", "date": "July 7, 2006", "id": 5438062}, {"rating": 5.0, "title": "Near perfection - loved it!", "text": "This beautiful hotel is one of the most beautiful buildings I've ever seen. Just to say the archictecture & decoration is beautiful does not suffice - you must see it for yourself! All the wood in the hallways, the engraved metal on the elevator doors, the marble - breathtaking. What I loved about this city and this hotel is that the people are just so down-to-earth and friendly - the kind of people you wish you had for next door neighbors. I'm just a plain-ole middle-class American from central Pennsylvania (and proud of it), but I did not feel out of place in this magnificent hotel - it's not \"stuffy.\" My room was immaculately clean; the bed was very comfortable; and the climate control in the room actually worked! The room-service food and all the food we had at the restaurants was very good. Like I said, all their employees were very friendly, but professional at the same time. I have NO negatives to list - I just hope I can stay here again. If you go - be sure to zip across the bridge to Covington, Kentucky (takes less than 5 minutes to get there by taxi) and take the dinner cruise on the B&B Riverboats; you get a buffet meal, a two-and-a-half hour cruise, and the best view of the scenic Cincinnati skyline, all for about $40.", "helpfulness": 3, "user": "MarciaM", "date": "July 23, 2005", "id": 3695069}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "My husband and I stayed at this hotel on the night of July 6, 2005. (Just like the previous poster. How odd!) Anyhow, we booked it as the first night's stop on a long road trip. We did so because of the excellent reviews on this website (thanks Tripadvisor!) I assure you that this hotel DID NOT DISAPPOINT!", "title": "A gem of a hotel!", "helpfulness": 6, "user": "roadtripper_fl", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3676652}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "From check-in, to our wonderful jr suite, to the great food and friendly service at the hotel's 'casual' restaurant, hubby and I were wowed! Little touches like the custom Kohler faucet buttons that said 'Warm' Cold' and Waste were so appreciated and made the beautiful bathroom that much more 'homey' after our long day on the road. The awesome jacuzzi tub was a big plus for hubby who had driven most of the day and had an aching back!", "title": "Great find in Ohio", "helpfulness": 3, "user": "jppalooza", "date": "July 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3643839}, {"rating": 2.0, "title": "Smallest room ever", "text": "Stayed on the 28th floor in one of the smallest rooms I've ever seen; way smaller than rooms in London, Paris, or Tokyo and about the same size as the Club Quarters rooms in the USA. Map of the floor showed that about half the rooms on this floor were the same size, and the other half were almost twice as big. Bed was very comfortable, and room was extremely clean and well appionted; bathroom was very small but clean and functional. Hardly any room to store a suitcase. Temperature control did not work properly. View of the river from the small window was good. The room at the Westin last year across the street was twice as big and so much better than our room at the Hilton.", "helpfulness": 4, "user": "ats262m", "date": "April 30, 2006", "id": 5021725}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "My two sons and I stayed there March 31 2006 in order to attend a downtown event. We had a standard room with two double beds. It was larger than I expected based on some reviews posted here, about the same as an average hotel room. Perhaps it is the king rooms that are smaller but ours was fine. I'd guess it was about 350 sq ft, with plenty of room beyond the ends of the double beds, so we were not cramped in the least.", "title": "Unexpected Elegance", "helpfulness": 3, "user": "schacholate", "date": "April 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4998354}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "The bathroom was nicely furnished and had no noticeable defects. I could get both really hot and really cold water from the faucets with no delay, which is somewhat unusual. We were on the 23rd floor, and so had a nice view, but unfortunately were not facing the river.", "title": "GREAT STAY AT HISTORIC HOTEL", "helpfulness": 5, "user": "dwicks4", "date": "April 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4957001}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "The lobby is spectacular in its decor. I knew it was an historic hotel, but I had no idea ...", "title": "4 star public areas, 3 star rooms", "helpfulness": 1, "user": "Sniper33", "date": "March 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4736583}, {"rating": 3.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "We ate a simple dinner in the lobby restaurant, which has two sections: one for those seeking fine dining and another for those who are just looking for a meal. There was a pianist playing during our meal, a welcome touch of elegance.", "title": "It was fine.", "helpfulness": 4, "user": "hvanness331", "date": "February 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4500361}, {"rating": 1.0, "title": "Terrible will never stay again", "text": "This hotel is not all it's cracked up to be. The rooms are extremely small and the bathroom's are worse. I also had house keeping come clean the room in the morning which was normal, but the bad part was the comforter that they put on the bed was stained with BLOOD (it also took them approx 25 minutes to respond when they said they was sending someone immediately). This is totally unacceptable. The restaurant was o.k. if you like to only eat and not have anything to drink with your meal. We waited 15 minutes one morning for the wait staff to ask us what we wanted to drink. Oh yeah one more thing, Don't make a long distance call from your room because it cost me 5.14 to just connect the call and .89 for each additional minute. I used think Hilton hotels we great but now I will probably never stay in one again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4456572}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My daughter and I stayed one night for the United States Equestrian Federation's Horse of the Year dinner and we loved it! Such a gracious old building, updated but maintaining the feel of the '30's.", "title": "Loved the Hilton", "helpfulness": 1, "user": "Beth T", "date": "January 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4355608}, {"rating": 2.0, "title": "Disappointed", "text": "Our room was HUGE with a great view of the river and the stadium.The bathroom was a little on the small side but I didn't see that as a problem. The beds were very comfortable with top grade linens.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 3, 2005", "id": 4084923}, {"rating": 5.0, "title": "Netherland Plaza - Art Deco Wonder!", "text": "Every staff member we dealt with was pleasant and helpful. We used the valet parking and that was very convient and easy to use.", "helpfulness": 5, "user": "scorpio5", "date": "August 12, 2005", "id": 3757323}, {"rating": 2.0, "title": "Ok - not great", "text": "I found this to be an interesting hotel, but my room was bizzare. The room itself was huge, but the bathroom was very tiny. The tub even appeared to have been custom built for such a small space. One problem with the large room was that the bed was on the opposite side from the TV without anything in between - just a strage set up. It is almost as if they took what ever space they had and built a hotel room in it.", "user": "rcmjr", "date": "December 6, 2006", "id": 6339735}, {"rating": 5.0, "title": "Great Hotel", "text": "This is an average hotel - nothing special. For the right price, I would stay here again, but it would not be my first choice.", "user": "Diayanne", "date": "November 18, 2006", "id": 6149112}, {"rating": 5.0, "title": "I liked it when I checked in, I loved it by the time I checked out.", "text": "I recently stayed one night at the Hilton. I was here for a business trip. The hotel is lovely and I would definitely reccomend it. The room was big and clean. The bed was great and I loved the pillows. I did not have a car and found the attached shopping mall with a food court to be a big plus so I didnt have to order room service.", "user": "furryriverrat", "date": "November 5, 2006", "id": 6058635}, {"rating": 3.0, "title": "Just okay", "text": "I booked on hotwire so I got about $60. off the regular price.", "user": "smercury", "date": "November 4, 2006", "id": 6056800}, {"rating": 5.0, "title": "A Wonderful New Life!", "text": "Our room was very nice, although I was a bit disappointed when I found that the internet charge was ten bucks a day. I also cringed at the 15 dollar parking fee when I booked. (You may guess that I am a small town cheapskate, you are right.) USE the valet. It is only 3 bucks more and allows you to come and go as you please.", "user": "schnauzerlady", "date": "September 22, 2006", "id": 5828350}, {"rating": 5.0, "title": "Beautiful hotel, phenomenal staff", "text": "I think my mouth literally dropped open when I walked into the hotel and looked up the main staircase (after walking through the door held open by a very polite door attendant.) This hotel is the most beautiful that I've ever stayed in. But, it is very “Art Deco” and is definitely a period jewel. If you’re looking for a hotel that’s decorated in a more “modern” design, it may not be for you.", "user": "WindowSeatPlease", "date": "June 4, 2006", "id": 5296389}, {"rating": 5.0, "title": "We loved this art deco beauty!", "text": "Upon entering the main lobby, I had no less than three employees smile and wish me a good morning. They weren't intrusive or annoyingly \"Can I help you?” \"Can I help you?” They were friendly, but discreet. During my stay, I was overwhelmed by their helpfulness and attention to detail. From the bell stand to the valet staff, they anticipated my next need (sometimes before I even knew what it was.) I was there with a group who had several special service needs and not one staff member ever complained or looked put out by one of our requests (even the late-night, last minute ones.) An example of this hotel’s special touch – I returned to my room at the end of a long day to find a card on my pillow with mints, a good night wish and the next day’s weather forecast.", "user": "lewishogs", "date": "May 30, 2006", "id": 5235082}, {"rating": 4.0, "title": "A great getaway!", "text": "As others have noted, the majority of the rooms are small. I had a small queen on the 28th floor – but the sizes vary, as another member of my group had a large corner queen with a walk-in closet on the 10th. But both rooms were comfortable and clean (and I am VERY picky – I check corners!). The bathrooms, also small, are still well appointed, as long as you understand that you might not be able to spread out as much as you do at home. The water pressure was good, even as high as I was, and, while the design was period, everything looked fairly new. There were no problems with elevator times, even though I was on a higher floor.", "user": "karalee402", "date": "May 30, 2006", "id": 5234528}, {"rating": 2.0, "title": "Don't book a regular room if you are closterphobic!", "text": "We ate breakfast in the restaurant ($13.50 buffet) – it was good, but that was the extent of our experience there. There is a pool located in the gym on the lower level of the building (which also houses a mall and offices that are separated from the hotel.) There is also a business center where you can rent time on PCs, printers and a copy machine. The hotel is connected to several other buildings by skyways and is located in the heart of the downtown area office buildings and hotels. The Reds’ stadium is several blocks away.", "user": "Dtr Stephanie K", "date": "May 18, 2006", "id": 5180857}, {"rating": 2.0, "title": "Early departure charge!", "text": "I truly enjoyed my time at the Hilton. The design, décor and history may not be for everyone, but I loved it. The thing that I will remember most about it is the staff. A short story to illustrate my point: on my last day, I was running late for my shuttle and looked a bit frantic when I entered the lobby. Out of nowhere, a manager-type hurried over, asked if I needed help and grabbed my bags to help me down the stairs. On our way down, another staff member ran in from outside. Having received my name and a description from a co-worker, he confirmed my identity and ran back outside to be sure my shuttle didn't leave without me. Just an example of the staff’s dedication - they are fabulous.", "user": "A TripAdvisor user", "date": "May 16, 2006", "id": 5079057}, {"rating": 3.0, "title": "Great bed, clean rooms, but...", "text": "We are a couple in our mid-30s, and we stayed here for a wedding recently. We are well-traveled, but not snooty (we've stayed in every place from 1-star to 5-star places).", "user": "ChgoAtty", "date": "September 13, 2006", "id": 5797580}, {"rating": 5.0, "title": "Great hotel", "text": "Pros: The lobby is beautiful with its art deco style. The front desk clerks were very helpful and friendly. Check-in was easy. Brunch at the Palms Court is tasty, albeit small. The hotel is in a primo location - across the street is Macy's and Saks in case you need a last-minute dress, gift, or tie. You're in walking distance from the sports stadiums and you're in the heart of downtown. There's even a mall in the lower level of the hotel. Very convenient. The bathrooms are very clean with Crabtree & Evelyn bath products. The bed is awesome - we had a king bed with a nice striped comforter, and it was very comfortable. The A/C ran well, and no problems technically. Alarm clock was nifty and even had an MP3 hookup.", "user": "terryjgardner", "date": "August 30, 2006", "id": 5727770}, {"rating": 5.0, "title": "Extremely pleased with Hilton Netherland Plaza", "text": "Cons: Slow like molasses elevators, thin walls (we could hear everything our neighbors said), night construction noises (who does construction at 3 am?), tiny standard rooms (the suites with 2 queen beds are gigantic, however), closets were tiny, too - not a lot of storage space. If you're in a room near the elevator, you can always hear the BING! when the door opens. On wedding weekends, elevators take a long time, valet takes 45 minutes to an hour, crowds of people horde the lobby, and people run screaming up and down the hallways drunk at 3-4 am. Hotel needs to take better control of loud, unruly guests. I didn't sleep at all that night.", "user": "Southfloridian", "date": "August 29, 2006", "id": 5718414}, {"rating": 5.0, "title": "Love the style", "text": "It's not a bad place. For location and a good bed and clean room (if you don't care about it being tiny), it's primo. For a place to relax and feel pampered, not really. If you stay here when it's not overrun with people attending a softball tourney or multiple wedding, it might actually be a great place to stay.", "user": "Mitzi D", "date": "August 3, 2006", "id": 5545436}, {"rating": 2.0, "title": "Who would have thought that it could take 1.5 hours to go from room to car?", "text": "This is an outstanding hotel, with a marvelous lobby. When in 2002 the lifts were very slow, but that is such a minor quibble. The rooms are fantastic, the views are wonderful from most rooms, the staff was always outstanding, good food in the restaurant and close by outside.", "user": "SmileySnowman", "date": "July 31, 2006", "id": 5534844}], "location": {}, "stars": 4, "variance": {"poor": 56, "average": 122, "very good": 288, "terrible": 25, "excellent": 392}, "aka": "Hilton Cincinnati Netherland Plaza Hotel Cincinnati", "slim_ranking": 0.16, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Opened in 1931, this charter member of Historic Hotels of America features breathtaking French art deco throughout public space. Located in National Historic Landmark Carew Tower with shopping and dining including over 50 shops and dining options, including downtown's only food court. Renovated guestrooms feature Hilton Hotel's Serenity Bed. Connected to area businesses and convention center via skywalk."}