{"user_rating": 4.5, "review_count": 223, "name": "Hilton Garden Inn Sonoma County Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I highly recommend this hotel as a base for touring Sonoma. The staff was outstanding; they were very helpful in assisting us as we made plans to see Sonoma and Napa.", "title": "Terrific Experience", "user": "DCTravelFan100", "date": "June 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 69136830}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The hotel is very well maintained. If you are looking for a hotel rather than a B&B, the HGI is a great option.", "title": "Not the cheapest, but definitely best in class!", "helpfulness": 2, "user": "theglobe", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 68697654}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The last Hilton we had visited was in Waikoloa, Hawaii, so as we pulled up, the kids were a little surprised (we did warn them). All that changed, however, when they saw the fresh cookies at the front desk! Warm, moist, chewy, delicious, 5 different varieties! The room was also spacious, with Neutrogena products, and a flat screen tv, fridge, microwave, real glass glasses (not plastic), herman miller desk chairs, and free wireless and wired Internet access. Our room rate came with breakfast for 4. Indoor pool was smallish, but clean, with nice hot jacuzzi and patio separated from front parking lot by clever landscaping. Movie theaters and fast food within walking distance next door. Really a great place to stay...if you can get a discount rate, jump on it! We paid about $180's through Orbitz, but others have noted less. Other reviewers were dead on - this is a wonderful place, and really is at least 3.5,if not 4 stars.", "title": "Beat All My Expectations", "helpfulness": 3, "user": "John_and_Marianne", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 65432748}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This was my first stay at a HGI and it beat my high expectations. Someone told me that the layouts are the same. In any event, I found everything here to be newer, clean, well thought out and well appointed. The service was friendly and helpful. I am a light sleeper and I can say that unless you have a noisy neighbor this is the place; my room faced the duck pond and the access road. This is a classic 3 star business hotel that is the top end of its class. The only knock on this hotel is that it is not convenient to a downtown. On the other hand, I took the shuttle from SFO to the local airport and hoofed the 1 mile with my roller bag so it was a good bit of needed exercise. The shopping is small, but there is a Carl's, Starbucks and a few restaurants, and even a multi-plex theater nearby. Great value and there are a couple of wine tasting van tours that will pick up at the hotel. I used Platypus and was quite pleased. BTW, there is a hotel van that will take guests to destinations within a 5 mile radius. If the day is nice, consider taking the shuttle to Kendall Jackson and walking the mile or so back to the hotel.", "title": "Great place to stay while in wine tasting in Sonoma", "user": "duck95", "date": "May 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 63746908}, {"rating": 5.0, "title": "Just a Wonderful Stay", "text": "My wife and I booked this hotel for a weekend getaway to the \"other\" wine country. The price was reasonable for a Saturday night and the location worked pretty well also. The hotel and rooms were clean and inviting. However the bed was way too hard for my taste, but every one has their preference.", "user": "sammydog22", "date": "April 18, 2010", "id": 61830632}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This really is a great little hotel - perfect for a quick trip to the wine country. The hotel is fairly new, easy to get to (just off the freeway) and offers you a great base to explore Sonoma, Napa, Russian River, the wineries and of course the Ocean.", "title": "A great find for a short trip", "helpfulness": 1, "user": "dogsareforlife", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85367907}, {"rating": 5.0, "title": "Great hotel in Santa Rosa", "text": "There isn't too much around the hotel but there a a couple of eateries and a small cinema. We went for a walk around the business park and on the the little airport, where we discovered the Pacific Air Museaum (really worth a visit!)", "helpfulness": 1, "user": "NLCPleasanton_CA", "date": "October 25, 2010", "id": 84841485}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Santa Rose is a short drive away and again, it worth a visit - we liked the Charlie Brown characters and the antique shops.", "title": "A lovely hotel", "helpfulness": 1, "user": "Lovestogoonholiday", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82604078}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "All the staff at the hotel were very pleasant - and the breakfast each morning was great (I think it was about $10 each on top of the room price) Loved the chef who was great and would suggest omlette ideas if you couldn't make up your mind!", "title": "A Great Little Hotel With Even Greater Staff!", "user": "JeffWaltersinCalgary", "date": "October 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 82205519}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Overall this is a typical hotel of its type - clean, well appointed comfortable rooms, quiet, spacious, free parking, great litte business centre and a tiny shop for last minute bits. There is also a petrol station over the road so you can fill up before heading out each day.", "title": "Comfortable and quiet", "user": "ejrace", "date": "September 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 78399972}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here one night after doing wine tastings at a few vineyards in Sonoma. It was a little out of the way where we came from and we could have just went back to San Fran, but it was a nice hotel. The ladies at the front desk we great in helping us to find somewhere to eat for the night. There is a movie theater, coffee shop and a few other stores at a complex next door. The room was clean, quiet, and the beds were comfortable. What more can you ask for. It was a great value for the price, and they give you free chocolate chip cookies at the front desk!", "title": "Clean and comfortable place to stay the night.", "user": "trippinNy", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 78159180}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This is a new hotel, so everything is modern and clean. We requested a top floor room to avoid foot traffic overhead and found the room to be very quiet and comfortable. The beds have mattresses that conform to the body for maximum comfort, and nice white, fluffy comforters.", "title": "Very nice", "user": "2BizzyTravlin", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77285324}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The hotel sits back far enough from the road that street noise is not an issue. They also have a very nice breakfast buffet for $10 per person. We opted instead for oatmeal and a muffin at Starbucks about a block away and across the main street.", "title": "An Excellent Hotel in WIne Country", "user": "FinFanAtl", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74491712}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "After reading other reviews on Trip Advisor, book this hotel for my stay in Wine Country. Everything previously written about this location is true! Easy access from the highway, quite airport (was there really an airport there??), very good buffet breakfast, super room with untra-comfy beds. Excellent service from the front desk to the restaurant staff. Free internet access from the business center. Impressed and will certainly recommend to anyone.", "title": "Wonderful clean hotel, great service, & near the wineries", "helpfulness": 2, "user": "MDuser12", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70522721}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I stayed at this hotel for one night last week with a good friend while on a day trip from San Francisco. After narrowing down the northern Sonoma county hotels to this and the Hampton Inn & Suites in Windsor, I decided to stay at this location and couldn't be happier with my decision. The hotel rate for 1 night was $140 including taxes and breakfast. We arrived at the hotel at around 6PM after an afternoon of wine tasting at some nearby wineries (Korbel, Acorn, and Christopher Creek which I recommend all wholeheartedly).", "title": "Great home base for wine country visit!", "user": "CCSC2010", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70481765}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This is a nice hotel, with friendly staff and a super comfortable bed. The room was quiet and clean and we had a very nice stay. The breakfast waitress was very nice, all the staff were friendly, but she went out of her way. We had a wonerful trip and enjoyed our stay here. The only negative is the internet is pretty slow, but I have yet to find any hotel whose internet is fast. They have yummy cookies available every afternoon that we really enjoyed.", "title": "Great Hotel", "user": "wilsonjk01", "date": "April 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61758827}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This hotel is a very clean, bright and spacious spot from which to explore wine country. Upon check in, Sunnie provided us with excellent customer service, along with recommendations and directions. A hot cooked to order breakfast sent us on our way each morning, and Shyla, in the breakfast area, was especially helpful and friendly. I would absolutely stay at this hotel again- great bargain, great customer service, great hotel.", "title": "Excellent customer service at a brand new (or near new) hotel", "user": "txrosley", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59469118}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Stayed here for a weekend getaway of biking, winetasting, and eating. Easy location to access the Sonoma Valley. Rooms were large, clean and quiet. Nice to start the day with a good breakfast as well. The staff was incredible -- we left our laptop behind and it was mailed to us without difficulty!!! Will definitely come back.", "title": "great location for exploring the Sonoma Valley", "user": "Samia1010", "date": "March 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 57810556}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "This is a fairly new Hilton Garden Inn and very like all HGI's. Friendly front desk staff, handy restaurant with decent food & service at dinner. Wine & beer are available. The rooms are comfortable and clean and the beds are very comfortable. Rooms have a handy fridge and microwave. The dining room staff were happy to provide some plates and utensils for us.", "title": "Comfortable and Convenient", "user": "ldygrdnr", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56954591}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This hotel is well situated, most of the rooms are well away from any noisy roads. The back rooms look out over a pond, with views into a nearby vineyard.", "title": "New, clean, comfortable, centrally located for wine country trip", "helpfulness": 1, "user": "umass98som", "date": "January 16, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 53627248}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 4, "average": 12, "very good": 69, "terrible": 1, "excellent": 137}, "aka": "Hilton Garden Inn Sonoma County Airport Hotel", "slim_ranking": 0.0769230769231}