{"user_rating": 4.0, "review_count": 397, "name": "Hilton Cape Town City Centre", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "this hotel offers an easy and safe bo-kaap location on buitengracht street. 30min drive from/to airport, 10min to table mountain cable car and walking distance to downtown. from 9-6 the free hotel shuttle takes you to the v&a waterfront on the hour and back to the hotel 10min past the hour. after 06pm can be arranged against a small fee. across the street of the hilton is a fully stocked liquor store next to a very clean and safe subways sandwich shop. furthermore only a couple of restaurants closeby without many customers as far as we could notice. go to the waterfront for spurs (like chili's or applebees) or try karibu's african restaurant (must do!!) for incredible and affordable quality meats. hotel staff very friendly and accommodating. rooms may either have city/table mountain or bo-kaap/pool view. when staying at the latter you may hear a slight sound from the mosque at 5am, but only when you're a very light sleeper and sleep with open windows. even if you're awake the prayer is barely noticable. I'd prefer those rooms with a pretty view of this capetown landmark with it's colourful houses and the pretty pool deck, while the table mountain is best seen from a longer distance like e.g. the waterfront. rooms have a safe, flatscreen tv, coffee-/tea facilities, bathroom amenities, desk, non sensored mini bar and they are really large. I can also recommend room service (e.g. yummy cheeseburgers) which is not expensive. the parking garage underneath the hotel is safe and costs 90rand a day. when driving in and out frequently, check the reception to activate your room key(-card) which then can be used for getting out (out only). the heated saltwater pool area is just fantastic in summertime. this would always be the reason for me to choose the hilton instead of other hotels of it's class (e.g. westin). overall no major faults at this hilton and you can't go wrong here, however ask for an invoice preview before checking out. I found some mini bar items on there which we did'nt use. capetown area is fantastic, but you will not do without a rental car from the moment you'll arrive. enjoy.", "title": "outdoor pooldeck for the summer season", "helpfulness": 1, "user": "griswolds09", "date": "March 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125581004}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The new Hilton in Cape Town is fresh, clean, elegant and stylish. A warm welcome at reception (though only two check-in desks could cause delays at a busy time). Rooms were bright, airy, tastefully decorated. Beds, as usual with most Hilton hotels were extremely comfortable. Our executive-floor room had views over towards the bay and a small balcony, safely railed for kids. Staff are friendly and helpful. The pool area is small but pleasant, and the outdoor pool is well shaded and heated. Worth noting that both the main restaurants are entirely halaal, and no alcohol (or foods like bacon, etc) is available at either. You can get a drink at the poolside bar, the executive lounge or in-room dining.", "title": "The Halaal Hilton", "user": "thepeckster", "date": "March 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125489234}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Their signature restuarant 'Mezbaan' was closed for a private function leaving only the Bistro and pool bar for paying guests, which was most unfortunate. However, the Signal Lounge (pool bar) manager managed to rustle up a Mezbaan menu for us and we had the meal poolside. Food was tasty and plentiful without being outstanding.", "title": "Good choice for a Cape Town stay", "user": "UkBaggieBird", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125309260}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "It is surprising that a global chain such as Hilton should choose to restrict its choice of menu/drinks in both its restaurants in a country with such a small minority of Islamic patrons, especially given that there are many Halaal restaurant options available in the city. You may as well have made it kosher.", "title": "Prepare to feel like a cash cow", "helpfulness": 1, "user": "ThereGoesDeon", "date": "February 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 125271021}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Stayed here for a week", "title": "Great location and friendly staff", "user": "layla78", "date": "February 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125172370}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We just spent time at the Hilton Cape Town", "title": "Be aware of thieves", "helpfulness": 3, "user": "Gilles H", "date": "March 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 125786586}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "They give new meaning to the cleaning service , they cleaning you out completely of your money and valuables.", "title": "Wonderful suite", "helpfulness": 1, "user": "HannaGustav", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125753797}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "They don't assume any responsibility for any loss material or financial.", "title": "Excellent Well Run Hotel", "helpfulness": 1, "user": "hezac", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125745140}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Our advice is to stay away from this hotel", "title": "too many quirks", "helpfulness": 3, "user": "mzungu f", "date": "March 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 125657980}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We stayed five people in one of the two bedroom suites (707). Nicely decorated rooms, great beds!! Good service - and a nice pool area with sun all day. Only disappointed was a belated check-in but the hotel upgraded us and supplied a complimentary bottle of wine so it was handled elegantly. We can definitely recommend this hotel for downtown Cape Town", "title": "Great Hotel", "user": "mmuggeri", "date": "March 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 125611461}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The staff at this hotel really make the experience. I visited here with a group of coworkers just looking for some fun on the weekend. They were very accommodating. We were able to check in very early in the morning and leave our bags at the hotel while we were out sightseeing. I told the staff member when I checked in that I would be paying in cash at checkout and they didn't even run my credit card which saved me a bundle in foreign transactions fees! We never took the shuttle to the Waterfront, but heard there was one available. The hotel is very close to a bus stop on the double decker red bus tour. Be careful in the neighborhood after dark. Stay in groups or take a cab.", "title": "Friendly staff, clean hotel", "user": "JetSetFiend", "date": "February 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125125678}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The staff at this hotel are absolutely lovely. Very professional and helpful. They did an excellent job providing service to our conference. Absolutely excellent service. I feel sorry for this staff because I imagine they are frustrated with the actual meeting spaces and I imagine they hear many complaints. We held a conference for 85 people in their meeting facilities ... and it was a bit of a challenge. The main meeting room is a VERY strange size. It's a bit like a long, narrow bowling lane - separated by four odd room dividers. It really messed up our facilitation plan. In the end, we figured it out and the conference went well, but I would not recommend this place for a meeting or conference venue. Too bad, because the staff there is absolutely wonderful. Particularly Burhan in the business center. He is a real professional!", "title": "NOT IDEAL FOR A CONFERENCE", "user": "SusanTWood", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 125074349}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "This relatively new hotel in the city centre on Wale Street could not have a better location; it is a short car ride from anywhere (5 minutes to the Waterfront - the complimentary shuttle goes on the hour) and Camps Bay is 10 minutes over the Kloofnek road... a great fun drive as well.", "title": "Great hotel, convenient and friendly", "helpfulness": 1, "user": "DiscerningIrish", "date": "February 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125064086}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The staff are always lovely, friendly and accommodating. The rooms are clean and modern, with separate showers which is always great. Beds are very comfortable. I didn't realise that there was no bacon or alcohol - in Cape Town there are plenty of places to drink.", "title": "good , but would not trust again", "helpfulness": 3, "user": "debra b", "date": "February 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 124907386}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "There is also a small pool in the hotel which is a welcome respite in the heat. However, pool service was slow and the pool could do with a more regular cleaning by staff during the day. It was not pristine.", "title": "Hilton Cape Town Part 2", "user": "truemanagementlc", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124830016}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Check-in was easy and efficient. They were able to upgrade us to the executive floor, and the room we had was very nice, very clean, modern, and comfortable. There was a good sized desk, and a couple of chairs. The bathroom was very modern, with seperate tub, and seperate shower. We had a great Table Mountain view from the room. We enjoyed breakfast in the executive lounge each morning - the coffee was especially good! Plus the executive lounge was a great place to enjoy a cold drink in the afternoon or early evening after being out all day; they provided some light snacks early evening. The hotel location was very good for us doing sightseeing on the red and blue busses. The red bus was about a 3 minute walk away, and the blue bus was about 7 minutes away. All of the staff we met, from check-in, to exective lounge, to consierge, were all very friendly and eager to please. Would not hesitate recommending this hotel to others.", "title": "Excellent location and service", "helpfulness": 1, "user": "ats262m", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126556448}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel is beautiful, nicely furnished, clean, comfortable. I must praise our room 516, I think it was bigger than most of the standard rooms, and we had fantastic views of the Table Mountain and Bo Kaap area. If I'm going back, I want the same room again! :)", "title": "99% satisfied", "user": "Legionella84", "date": "March 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126214270}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Check in was quick, all hotel staff were nice, concierge fantastic! They can help you arrange many kind of tours. The shuttle bus to the V & A Waterfront is very convenient, from 09 am till 18 pm. The hotel has 2 cars, one of them is a very luxurious and comfy Mercedes, we used it a few times and they are charging rates as any normal taxi would.", "title": "trying hard but not quite there", "helpfulness": 1, "user": "roger39", "date": "March 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 126057621}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The location is very convenient for a city center location, the tourist bus line (Red) is very near, the other line (Blue) is a few minutes away.", "title": "A week to remeber", "user": "Beatrice C", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126003358}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I loved the Boo Kaap as well with their colorful little houses. The area is absolutely safe. Long Street and the Green street market are nearby. V & A 5-10 minutes by car.", "title": "A good option", "user": "leighdermick", "date": "March 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125981282}], "location": {"country": "South Africa", "continent": "Africa"}, "stars": 4.5, "variance": {"poor": 16, "average": 39, "very good": 152, "terrible": 11, "excellent": 179}, "aka": "Hilton Cape Town City Centre Hotel Cape Town Central", "slim_ranking": 0.325, "description": "Located in the heart of South Africa’s second largest city at the foot of Table Mountain, the Hilton Cape Town City Centre hotel is only 20 minutes from Cape Town Airport and is close to many shops and businesses, the wine district, a variety of beaches and the National Parliament. All of the modern Guest Rooms at this Cape Town hotel boast large windows, 32-inch LCD TVs and complimentary wireless internet access. Upgrade to an Executive Room for stunning views of Table Mountain or the city and access to the Executive Lounge, with complimentary breakfast, canapés and drinks. Hold a conference for up to 140 guests in one of 8 meeting rooms which offer the very latest in audio/visual technology and ensure your event is a success with our business center. Start the day with breakfast in Bistro 126, savor authentic North Indian cuisine in the elegant Mezbaan Restaurant and sip cocktails and relax with a fragrant shisha pipe in the exotic Signal Hill Terrace Lounge and Restaurant. Work out in our Fitness Center or soak up the glorious South African sunshine and stunning views of the Bo-Kaap and Table Mountain in the outdoor swimming pool."}