{"user_rating": 4.5, "review_count": 708, "name": "Hilton Garden Inn Orlando at SeaWorld", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "My staty at The Hilton Garden Inn was good. I was on business and I liked the free wi-fi, proximately to the Convention Center, and the front desk was helfpul. You can walk to SeaWorld from here and it's right off Interstate. I was worried I'd hear the cars on the interstate at night, but I didn't. However, I did hear people in the hallway, in the next room, and in the parking lot. For me, the hotel is great for families and tourists. If you're on business, you should know that a lot of tour buses / large groups use this hotel. We saw a bus full of people depart and another show up. Some of the rooms were damaged due to a large contingent of students from Argentina flooding a few rooms. Because of this, one of our associates were not able to stay at the hotel even though he had a reservation. Again, the staff was professional, apologized, and found him another hotel for that night. Overall, good hotel and I would recommend it to my friends with children.", "title": "Good Hotel for Families", "user": "ohiocouple", "date": "February 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153191606}, {"rating": 3.0, "stay_parameters": "Stayed February 2013", "text": "Location is ok, but there are many options that are closer to restaurants, etc. Rooms could use updating (faucets had a constant drip). If you have to pay for breakfast, you should be able to order from a menu, not have a buffet as the only option (I don't like community food).", "title": "Ok property...", "user": "hiltongirl357", "date": "February 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 152862715}, {"rating": 2.0, "title": "a very cold service personnel", "text": "No taxis to be found, I ended up calling the guy who dropped me off from the airport.", "user": "li p", "date": "February 20, 2013", "id": 152658490}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Sorry, my English is not very good.", "title": "Would stay again!", "user": "sl137", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152611089}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "In early February, I took my daughter to live in the hotel for six days. Environment and facilities of the hotel, we are satisfied.", "title": "Memorable Valentine's Weekend Get Away", "user": "ilLuganoHotel", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152480042}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "While in Orlando I stayed at the Hilton garden inn it was very clean and the service was outstanding , it is very easy to get in and out of I would highly recommend staying here . Easy to get to all the theme parks in the area.", "title": "Great location to stay at", "helpfulness": 1, "user": "1971ST", "date": "January 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 150516743}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The convenience of an on site restaurant and friendly staff made this trip a pleasure for my daughter and myself. This was my second stay at this particular hotel, and I am bringing my parents back in the spring.", "title": "Pleasant and friendly staff, convenient to shopping and attractions.", "helpfulness": 1, "user": "Dagne546", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150448037}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We have recently returned from another stay at the Hilton Garden Inn SeaWorld (we were last there in June 2012). Travelling with a two year old we booked the 1 bedroom suite so we were very disappointed on arriving to find out that our booked room was not available so our first night was in the standard room. The next morning the Front Desk Manager (Hi Brian) admitted it was the hotel's mistake and he ensured we were moved into our correct room that day, provided Hilton Points as way of an apology and continued to apologise throughout our stay - excellent customer service. As expected the hotel met our requirements perfectly. Loads of space in the suite plus a fridge and microwave. The hotel also has a guest laundry.", "title": "Bit of a hiccup at the beginning but quickly resolved :)", "helpfulness": 3, "user": "Gracie99uk", "date": "January 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 150052293}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The hotel staff are really friendly and it was lovely that the wait staff at breakfast remembered us from our previous visit (Brian you'd have earned extra brownie points if you had acknowledged that we were returning guests). We ate breakfast here most days and twice ate in the evening and had no issues with service or food. We enjoyed the pool area a couple of times and noted that the pool was heated to a lovely temperature and there were plenty of towels available. We took advantage of the hotel's SeaWorld preferred hotel status and got front of line passes for SeaWorld. It is a walkable distance to SeaWorld but in the heat we chose to drive. We did notice on returning a couple of times that there were families entering cars parked in the hotel who had obviously come from SeaWorld and wondered whether some families use the hotel's car park to avoid the car park fees (does the hotel monitor this?).", "title": "Brillant", "helpfulness": 1, "user": "David D", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149943117}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "There is a CVS, a 7-11 and Bonefish Restaurant within walking distance from the hotel. The hotel provides shuttles to the park but we didn't use these. The hotel is within easy driving distance of Universal and Disney. The access to West bound I-4 is literally across the street so you can be in Disney within 10 minutes.", "title": "outstanding", "helpfulness": 3, "user": "stevann0817", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149343457}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Clean room, super staff, very good breakfast bar. Stay is close to convention centers and on trolley line to many good restaurants. I was there one week and my room was always kept very clean, staff responded quickly to a request. Internet access was excellent (on 6th floor) and generally quiet during the night. One note of interest was that i didn't hear police, fire or ambulance sirens the entire time I was there. Coincidence? I don't know, but hope it was the location.", "title": "Excellent stay", "user": "prschatz", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151599796}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Toenails on the carpet! Housekeeping left lots to be desired. Other than the toenail, the hotel was OK. Good location. Near restaurants and Seaworld and convention center. Not within walking distance, though.", "title": "Poor housekeeping", "user": "Lee K", "date": "February 3, 2013", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 4.0}, "id": 151350225}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Special thanks from the Galban-Zavala family to:", "title": "The best Customer service & support", "user": "Jesus_Galban", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150925876}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "- Miss Patricia Levine", "title": "One of the nicest", "user": "Lovethesmokies4ever", "date": "January 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150796157}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "- Mr. James Stephens, and", "title": "Great Location for Peace in the Midst", "user": "Thoughtful C", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150778157}, {"rating": 4.0, "title": "3rd Time. Still no Complaints", "text": "Was here for another business trip. The main lobby area has been renovated since I was there last, though I didn't think it needed to be. Rooms have not been updated though. Air conditioners can be loud when they kick on overnight, I recommend leaving the fan on. It isn't a business hotel specifically, but it seems more family oriented as times go on. There was a huge group of 15 year old girls there (taking up 2 floors). They didn't cause any issues, but they tie up resources like elevators, etc...", "user": "AC_A340", "date": "February 18, 2013", "id": 152472780}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Only 2 things I can say about potentials for improvement...", "title": "Great Stay!", "user": "Amie H", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152459473}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "1.) Even though the front desk is 24 hrs, it looks deserted in the early am (5 am). Lights were dimmed real low, and they don't put out any coffee or anything until 6 am. 5 am isn't that early, especially for a business hotel.", "title": "Good Location", "helpfulness": 1, "user": "Anni_Lim", "date": "February 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152223990}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "2.) The gym is small.", "title": "Not really for your business traveler", "user": "Swampscott-Traveler", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152171683}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I would absolutely stay again. Staff was great, location is fantastic, and more and more restaurants/stores are being built around it.", "title": "Okay place but I would keep looking around", "helpfulness": 2, "user": "Brian C", "date": "February 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 151908202}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 33, "average": 67, "very good": 236, "terrible": 13, "excellent": 359}, "aka": "Hilton Garden Inn Orlando At Seaworld Hotel", "slim_ranking": 0.243161094225, "description": "Welcome to the Hilton Garden Inn Orlando at SeaWorld where Orlando's most exciting attractions are just around the corner! Conveniently located in the International Drive Resort Area next to SeaWorld and ½ mile from Discovery Cove where you can swim with the dolphins. Walt Disney World, Universal Studios and Islands of Adventure are just five miles away. Complimentary scheduled transportation is provided to all the major attractions. The Hilton Garden Inn is an official On-Site SeaWorld hotel that offers amenities and discounts not found at other hotels. Guests staying with us will receive guaranteed entry to SeaWorld and Aquatica; early entry to SeaWorld on select days; discount at gift shops and restaurants; and the opportunity to reserve the Ultimate Quik-Queue front of the line pass, complimentary (limited quantities daily). A multitude of restaurants, shops and entertainment venues are also within a short ride from our Orlando, Florida hotel on the I-Ride Trolley (the trolley has a stop directly in front of the hotel). Moreover, we offer complimentary transportation to the area's three most famous attractions: Walt Disney World®, Universal Studios and SeaWorld. We are the closest, most affordable hotel near SeaWorld, offering Hilton quality at an affordable price. Be our guest next time you visit Orlando, Florida and discover true hospitality at its best. The Hilton Garden Inn at SeaWorld participates in Hilton HHonors®, the only hotel reward program that offers Points & Miles® and no blackout dates. Whether on the road for personal or business reasons, Hilton Garden Inn offers the reliable amenities and services for guests to sleep deep, stay fit, eat well and work smart while away from home. Everything…right where you need it."}