{"user_rating": 4.0, "review_count": 375, "name": "Hilton Bellevue Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I tagged along with my husband on a business trip this week. We stayed at the Hilton Bellevue for no other reason than proximity to his work and availability. We are HHonors Gold members, so we do stay at Hilton properties fairly often. This particular location needs some work. The hotel is starting to show its age and some maintenance items are falling by the wayside, but nothing so drastic as to make us check out early.", "title": "She's a little rough around the edges", "helpfulness": 1, "user": "nrh", "date": "July 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 134922295}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The good:", "title": "A Solid Choice For Bellevue", "helpfulness": 3, "user": "advcardio", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134869740}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Room service was super fast and decent quality.", "title": "Officially, The WORST hotel in the USA.", "helpfulness": 1, "user": "kawoh", "date": "July 19, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 134832242}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The bed and linens were comfortable.", "title": "Nice hotel with large rooms", "helpfulness": 1, "user": "cheetah8", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 134821021}, {"rating": 1.0, "stay_parameters": "Stayed July 2012", "text": "Toiletries were kept well stocked.", "title": "Bad experience with Front Desk Staff", "user": "Sunnyout", "date": "July 13, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 134283586}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Nice , clean , great attitude.", "title": "Great Hotel", "helpfulness": 1, "user": "bentdavi", "date": "June 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131824134}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Nice amenities. The executive lounge is outstanding.", "title": "Lovely hotel in a good location.", "user": "Gerrie M", "date": "June 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131712605}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Stayed here on business. Located in downtown Bellevue. Although the location is great, there is terrible traffic in the 'after work' hours. Main lobby is on the 3rd floor and there are no signs posted anywhere. So if you are like me and entered on the bottom floor, it's a little difficult to find check-in. Other that that, the rooms are nice and the gym is excellent. Lots of treadmills with TV's and a full weight set. Will definitely be staying here again.", "title": "Convenient location neat and well priced", "user": "Evan M", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131515268}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Close to the highway and yet quiet . well appointed and well priced. Nice to have the coffee shop in the lobby.", "title": "Good location", "user": "Bri416231", "date": "June 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131480442}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "If you are looking not to stay downtown this is a great option. It has easy access to HWYs avoids the traffic in Seattle which could be quite intense. Located close to shops,mall and quite location despite the fact that it is close to the Hwy 405.", "title": "Excellent service & facility!", "user": "travbuster", "date": "May 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 131054226}, {"rating": 4.0, "title": "Good choice", "text": "My wife and I were very happy selecting this hotel. Large, clean room with a powerful shower! Free parking and internet and close to Bellevue Square mall. Only 15-20 minutes to Downtown Seattle. We will stay here again.", "helpfulness": 1, "user": "Stella154943", "date": "July 12, 2012", "id": 134158977}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I stayed at this hotel over the Canada long weekend. The elevators were super fast (something that you normally do not get at most hotels), the rooms were spacious, staff was great (always a manager at the front desk), free shuttle bus service and free Internet business center. The breakfast was awesome. They even had a chef who made fresh omelets and waffles! I would definitely recommend this hotel to anyone travelling to Bellevue.", "title": "Best hotel in Bellevue by far", "helpfulness": 1, "user": "Aliya B", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133610898}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I used to travel quite frequently to Seattle and this was one place which i found that was quite classic. They did manage to maintain the original authentic look at the same time providing all the services of the modern day hotels. From what my colleagues told me this is quite an old hotel. You cant expect to find any lockers but it is quite safe. It is about a 1 mile walk from the hotel if you wish to dine outside. The hotel does provide with a comfortable bed and service. The buffet especially the breakfast is good as is the bar. I would recommend this hotel if you would prefer to stay uptown in a calm and quite area yet accessible to most of the facilities and companies.", "title": "Classic yet professional", "helpfulness": 1, "user": "tantrick", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 133248117}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Very nice hotel. We were on a floor that had free breakfasts and happy hour snacks. It was quite pleasant. The rooms were very clean and nice.", "title": "Hilton Bellevue - very nice", "user": "delaneyr", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133137841}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I've stayed here twice now--once for a family trip, and another time for a conference-- and I will stay here every time we come to the Seattle area from now on. The room was HUGE. I can't express how pleased we were with the room. The cleanliness, the decor, the size, and the two sliding glass doors to help with outdoor noise: All perfect. The staff was helpful and well trained, and the food at the conference was wonderful. The only complaint we had was that the pool was sort of cold, unkept, and outdated, and the hotel would be well served to offer their guests a breakfast. But other than that...the stay (both of them) were excellent, and we will likely return.", "title": "Excellent hotel!", "user": "Sarah M", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132487904}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We booked our stay for Father's Day weekend at the Hilton in Bellevue, WA because we were coming up for a baseball game double-header. I looked all over Seattle and the surrounding areas and even the \"bargain\" chains were astronomical! I was in shock! Apparently the streets of Seattle are paved with gold starting the last week of May all the way thru til' fall!!! Anyway, found an incredible deal on Hotwire, where we had to book without knowing which hotel we were booking until after we paid the reasonable price. To our pleasant surprise, we got the Hilton Bellevue! What a beautiful, upscale hotel! We were VERY happy with the beauty, quality, and cleanliness of our room! I would stay here again in a heartbeat! We got a king bed room and it was sooooo spacious, and included a small loveseat as well! It was perfect for our trip as we were traveling with our two kids and needed the extra space for them to sleep (one slept on the loveseat and the other on an air mattress on the floor) MY ONE TIP: Breakfast is NOT included in the price of your room so be prepared to either buy breakfast at the hotel restaurant (pricey) or go eat breakfast elsewhere. But even without breakfast, great bargain thru Hotwire for a beautiful, wonderfully updated hotel!", "title": "very nice!", "helpfulness": 1, "user": "Andria F", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132275773}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Smooth check-in; very friendly and professional staff. Room was spacious, very clean and very well kept. The bed was comfortable and the room was very quiet. The location was very easy for Safeco Field, too.", "title": "Very good facility", "helpfulness": 1, "user": "ColbertGD", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132193926}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I was here on my business trip before I moved here. This is a nice and clean hotel. It has great views on a clear day. Breakfast is very good as well. Friendly staff.", "title": "Nice hotel", "user": "Aaruun N", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132185626}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Some look for Gucci, some for Pucci. I look for value . This hilton hotel bellevue has a great atrium . free internet in massive atrium. Super sized rooms. Great restaurant. Bit noisy rooms on one side, totally quiet rooms on the other side. 10 minute walk to the shops and bars of Bellevue. For me the best balance of value, and location in Bellevue. \"That's so far\". Yes a bit old and slightly dated, but if you love space and look past the Gucci bag thinking, this hotel will be a great choice.", "title": "Giant rooms - Well maintained - Friendly Staff", "helpfulness": 2, "user": "retiredtravelagent", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132182145}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Very helpful staff at the front desk, nothing seemed to be too much trouble. Restaurant (only used for breakfast) had good quality food (healthy options) and the staff didn't clammer around me trying to fill up coffee cups and water glasses!", "title": "Hilton Bellevue, Seattle WA", "helpfulness": 1, "user": "Bob B", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131982634}], "location": {"country": "United States", "city": "Bellevue"}, "stars": 3.5, "variance": {"poor": 23, "average": 84, "very good": 154, "terrible": 14, "excellent": 100}, "aka": "Hilton Hotel Bellevue", "slim_ranking": 0.6, "description": "Our full-service Bellevue hotel features all of the coveted amenities guests look for in a hotel. Tastefully appointed guest rooms, suites and executive accommodations include all the comforts of home and surround the unique seven-story atrium filled with beautiful trees and foliage. After a long day of sight-seeing in Seattle, or business meetings at the numerous corporate headquarters in Bellevue, our hotel is a welcome retreat during your stay in the Seattle-Bellevue area. With the sophisticated Basil’s Kitchen, casual Tully’s Coffee Shop, seasonal heated outdoor pool and whirlpool spa and a full fitness center, guests will find everything they need at the Hilton Bellevue hotel."}