{"user_rating": 4.5, "review_count": 2089, "name": "Hilton Ft Lauderdale Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This beachfront resort has everything you need. It has a beautiful beachfront, intercoastal canal sited location. The service was excellent, pool and hot tub over looking the ocean was well staffed, great towels, lounge chairs etc... What you should expect from a well run Hilton Hotel. Add to this it's proximity to The Galleria shopping Mall with top stores and restaurant and you your partner and family can have a great time. The rooms all have terraces with water views, most give ocean and canal. Owes. High floors just extend the view. Oh I need to mention our room 1915 had a small kitchenette which for a longer term stay or with small children would be ideal.", "title": "Nice Beach Surprise", "helpfulness": 1, "user": "P H", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131831260}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My family and I would like extend a warm thank you to Richard Hess at the Hilton Fort Lauderdale Beach Resort for his exceptional service during our pre-cruise stay this past May. His willingness to provide personalized customer service made our stay a memorable prelude to our cruise and enabled our large family group, including elderly members with special needs, to enjoy proximity in room location, access to transportation that could accommodate our large party, and full enjoyment of the hotel amenities and services. His five-star service is a reason to come back, and we thank him for making us feel “at home” and making everything go smoothly for our large group during our stay. We will be asking for you, Richard Hess, when our travel plans bring us back to Fort Lauderdale!", "title": "Exceptional Customer Service Will Bring Us Back!", "helpfulness": 1, "user": "L H", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131752784}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "To a good price we were offered a studio with balcony and ocean view. First we booked 2 nights, the stay was pleasant and we decided to stay 2 more nights.", "title": "Very good value for money", "helpfulness": 1, "user": "Benedetto16", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131625758}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "My next time in Fort Lauderdale I would go back there.", "title": "Fantastic view and great rooms for a family", "helpfulness": 1, "user": "Kareneastsussexuk", "date": "June 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131588617}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I only was disappointed with two cocktails I tryed from the bar, one of them was supposed to be a margarita. The drinks were made using sweet sirups with strong artificial taste. Is it so difficult to use genuine ingredients?", "title": "Excellent hotel, service and location", "helpfulness": 1, "user": "travelinstylemiami", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131580028}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed in an ocean view suite with our 2kids. The room was spacious and exceptionally clean. The pool was awesome! And the service was fantastic. Turn down service was a bonus too. My only complaint would be the $32/day parking fee. We would definitely go back!", "title": "Great service, great amenities", "user": "BJBN775", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132022010}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "From the moment we pulled up into the valet entrance we were greeted to the hotel and advised of what to expect from their excellent service, service that was carried through the entire weekend stay my partner and I came to enjoy. Every person we made contact with made us feel important and went out of their way to ensure we were taken care of. Richard Hess, the property manager was very personable and went far out of his way to upgrade us to an exclusive Ocean Front Suite which exceeded all of my expectations. Our room was well appointed, very clean and fresh as was all other aspects and areas of the hotel from the pool, restaurant, and bar both inside and out. The beachfront location and beautiful weather we enjoyed that weekend made this experience one that demands a second and third future visit. We've raved to family and friends about this hotel and felt it appropriate to share on this trusted website.", "title": "Top notch service and experience", "user": "JasonD841", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131999478}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Our stay was great! This is the second time we've stayed at this property. The service was outstanding in all cases. The staff in the restaurant was fabulous, remembering our needs and preferences, from day 1, throughout our stay. The valet was good and bellman were super. The rate was as good as staying somewhere away from the beach. This hotel has plenty of amenities, great condition and great service. Don't hesitate to stay here!", "title": "Great Service!", "user": "Fred D", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131994541}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Fred Dennin", "title": "2-years in a row and may go back in November!", "user": "Kevin G", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131970047}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Personally, this property can not be beat for an off season week of R&R. We stayed last year and just got back from another week in late May of this year. Perfect option for a week away with small children. Go for the one bedroom king suite, it offers the best value for money. You get a separate bedroom, massive washroom and the full-sized kitchen allows you to prep. meals and go. If you don't like to cook, full services are offered on site or are an easy drive/boat ride or walk away.", "title": "A Memorable Anniversary Experience", "helpfulness": 1, "user": "Mike W", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131838212}, {"rating": 5.0, "title": "Best Hilton experience ever", "text": "I use Hilton when I travel and when they are available....and that is weekly for business in 23 states. This was the best Hilton experience I have had. The people and customer service surpassed my expectations and even caught me off guard....in a good way. They are able to accommodate you and from the moment you drive up to the valet, it is a very pleasurable experience. I will be back.", "helpfulness": 1, "user": "Blongtin", "date": "June 17, 2012", "id": 132161509}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This hotel was wonderful. We spent a local vacation at the beach and they were so accomodating. Richard Hess, the asst director at the Front Desk (operations) was so helpful. You just had to ask and they were very accomodating. Provided late checkout and did what they could to make it a perfect Stacation! The beach is a quick walk across the road, views were tremendous and the location was just perfect. Thanks for such a great time!", "title": "Works with you!", "user": "Robin H", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132099748}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "This is the forth time my Husband and I have stayed at this hotel and we return time and time again for one simple reason, the people here are fantastic! We always feel so welcomed, so taken care of and ultimately so valued especially by Front Desk Director, Richard Hess that we rank this as being one of our favourite places to stay globally. Thank you everybody at the Hilton Fort Lauderdale Beach Resort for all that you do for us.", "title": "Friendliest hotel in Florida", "helpfulness": 1, "user": "Jill M", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132099204}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We were feeling a little bummed because we might miss taking a trip to Turkey this summer. We traveled to Ft. Lauderdale in search of comparable sun and sand as we might find on the Aegean or The Med. As fate would have it we were greeted at the counter by Sabri Cimenci who just so happens to be from Turkey. Turkish hospitality at the Hilton! We immediately felt at home. Mr. Cimenci gave us a most excellent orientation to the resort and followed up to make certain all was well. We were impressed again and again by the staff at this Hilton property. Christopher could not have been more a gentleman in assisting us. He left a most memorable impression. Shakira and the others in housekeeping were just wonderful to us. Pool staff? Too many to mention but each and every one charming and quick to get you settled around the pool. Particularly the young woman running the children's activities. Wow she knows how to work with the kiddos. Even the folks staffing the towel station on the beach made certain we had everything we needed to be relaxed and enjoying our stay. The folks renting umbrellas and lounges at the beach I don't believe are Hilton employees though. Charging for lounges on the beach? Really? One thing about the Hilton that I liked was that there were no hidden \"resort fees\" to pile up. Some people have complained about the parking rates but it beats the heck out of some other major metropolitan area hotels. The staff in the Q hotel shop were so kind and they were so nice to our little one as he power shopped daily for this and that in their store. The staff behind the counter at the street-front Le Marche were so helpful and the coffee was great. Seriously, do you all ever catch a break or even slow down? And teamwork? Front and center! I have read a few of the blah reviews of this place and it is unfortunate if any of these things indeed happened. Our experience was pretty flawless. I have learned that if you are kind and considerate to the staff anywhere most often you get a solid return on that investment. We had a few snags. Housekeeping was busy and missed our trash. Big deal. A simple phone call fixed it. And yes you may be put on hold and things don't always happen lightning fast. Get over it! This place is huge and requires precision management and staffing. They do a GREAT job. The housekeeping staff rocks by the way. They stay very, very busy and we were so unpredictable as to when we were going to be in the room or out. They were so patient with our erratic schedule. We ran out of coffee (we drink A LOT of coffee) only to have the staff bring us a huge bag of regular and decaf which lasted us through the end of our stay. We drink Lavazza here at our favorite coffee shop so having it in our room made it even more like home. We even bypassed the Peet's Coffee served down the street at the Ritz.. Hilton, you have an incredible property in Ft. Lauderdale and you have an even more incredible staff. Some recommendations: Bigger trash cans in the kitchens; Peter Thomas Roth . . . incredible body wash and shampoo . . . rather blah soap; and the robes could use a little remake. Beige, enough said. Back to the positive. To the people out front who meet and greet and TCB the whole day long. Best I have ever seen anywhere at home or abroad. Poetry in motion. One final thanks to Mr. Kolz ( I hope I got your name right). Our 30-month old watched me lock the safe so the next time it was unlocked he programmed it and locked it up tight. Mr. Kolz came to our room to open our safe. What a kind, professional man. He was so good as our son tried to assist him. A true gem of a gentleman. I have never seen an entire staff so committed to making a stay as close to perfect as one could hope for. Thank you all again!", "title": "Takin' It To The Hilt!", "user": "CitizenB", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132065512}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Only one complaint - the carpet definitely needed a deep cleaning. After wearing socks in the room for just an hour or so they were black from all the dirt and other stuff on the carpet.", "title": "Pretty good", "user": "Joseph60993", "date": "June 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132063115}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We arrived at 8pm after a long day of travel only to be told that our room was not ready, it would be at least 20 minutes. We sat in the lobby, hungry and tired, waiting to be told our room was ready, After 25 minutes, and no one coming to inform us one way or another, I walked up to the desk and was told the room was ready. We arrived at the room, only to see that the room I had booked two months earlier, was beside the elevator. I am a Hilton Honors member and have specifically asked to not be near the elevator. We entered the room and Richard, the bellman assisting us, phoned the front desk asking if an alternative room was available. No. I thanked him for his efforts and began to settle in. I opened the closet and saw a pair of mens underwear and socks on the floor. I notified the front desk of the dirty laundry and asked to have it removed while we dined in the hotel restaurant. It was still there one hour later when we returned. The restaurant experience was ok. They were extremely busy, service was slow, the waiter forgot my initial glass of wine and I had to ask the Maitre'd to please get it, as the waiter was so busy I couldn't get his attention. The saving grace was Lindsay, from the front desk, brought me a meal voucher for our entire table of three. She apologized for the delayed check in and dirty laundry in the room. Lindsay said the hotel would be giving me a partial refund on the 100,000 Hilton Honors points I had used for the two night stay. I said thank you. The following morning we went out to enjoy the day and returned at 7pm, to see our room had been serviced but the dirty underwear was still in the closet. We stopped by the front desk on our way out to dinner in town and asked again to have the previous guests dirty laundry removed. It was gone when we returned at 10pm. In the morning, as we were getting ready to leave, we noticed our room with two beds, had been supplied with only two bath towels. At this point, I was tired of complaining to the front desk, as this is the most I have ever done this, so we shared. This is a busy hotel that seems to be overwhelmed and management does not have a good handle on what is going on. I won't be staying here again. Oh, and I never did get a refund on any of the 100,000 Hilton points I used staying here. I sent a complaint through Hilton customer service in March and never heard back from them. As a long time Hilton customer, I'm disappointed.", "title": "Will not return. Where's management?", "helpfulness": 4, "user": "Knows", "date": "June 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 132385505}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Every single employee, 100% really look out for your well being and sincerely want you to relax and enjoy. From the greetings of the valet personal, to room service getting yout food to the room faster than you expected.Simply the best on the beach and that includes Harbour Beach Marriot! Will make it a staple of mine on my trips to Ft Lauderdale.", "title": "Excellent", "user": "John M", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132367974}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We were looking for a 2 night getaway and decided to try this Hilton. We have been to the marina location and found it to be pretty good but not fabulous. From the time we pulled up to the the time we left every single staff member was kind and helpful. The room was nice (a jr. suite.) I found the view to be very nice, could see both the ocean and intracoastal from our room. Nice tvs, comfortable couches, etc. We were missing a hairdryer and our safe wouldn't work and both issues were resolved quickly. The whirlpool tub was awesome, very nice bathroom.", "title": "Excellent service, good value for the area", "user": "bizbach", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132365809}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The pool attendants were great and the poolside service was great and not too pricey. Try the Kiwi Colada and the chips and salsa, yummy! We only ate at two restaurants, the W's Steak 954 and the Westin's Shula's. Both were awesome! Great breakfast and dinner at both.", "title": "Was not impressed....", "helpfulness": 2, "user": "Renae L", "date": "June 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132326349}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The only downside was the cost of the valet parking but I just figured that into the price of the night's stay and it was still under $200/night for an OF hotel. I would go back.", "title": "poor room quality", "helpfulness": 1, "user": "one_carry-on_max", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 132304458}], "location": {"country": "United States", "city": "Fort Lauderdale"}, "stars": 4, "variance": {"poor": 64, "average": 161, "very good": 524, "terrible": 35, "excellent": 1305}, "aka": "Hilton Ft Lauderdale Beach Hotel Fort Lauderdale", "slim_ranking": 0.0827067669173, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Hilton Fort Lauderdale Beach Resort is located on the shoreline of Fort Lauderdale's exclusive north beach, between the palm-shaded boulevards of Sunrise and Las Olas. The Resort delivers the refined elegance of beach resort living, with unique tropical amenities and upscale accommodations, much larger than a regular hotel. Our vision is to provide Distinct Personalized Service by creating unforgettable experiences for our well-traveled guests."}