{"user_rating": 4.0, "review_count": 1396, "name": "Hilton San Francisco Financial District", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "No complaints at all with this hotel. Great views, comfortable surroundings, and good service. The hotel is close to China Town and other fun attractions. The BART is about 6 blocks away and you can easily grab a cab at the hotel. The beds were soo comfortable, liked the flat screen tv, and the ipod hook up. Bring your own water, because the Evian is $5 a bottle! :)", "title": "Great value in San Fran", "helpfulness": 1, "user": "mdavistempleton", "date": "February 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55017617}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Noisiest hotel I've ever stayed in. Even on the 12th floor, we could hear voices from the street like some sort of party happening. Sirens, honking cars, screaming people. This went on till way past midnight. Same thing on my last visit, but wrote it off to the exception, but apparently the noise is the rule. Windows are just too thin.", "title": "Bring Ear Plugs, Allow Extra Time", "helpfulness": 1, "user": "vanillashake", "date": "February 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 54968601}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Jam ups at elevator were contstant. Only 3 were actually in service, so it was often a long wait.", "title": "Great location, spent much of time waiting for elevators", "helpfulness": 1, "user": "STL_MO_Traveler", "date": "February 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 54946768}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "My wife and I attended a conference at the Hilton. Generally the experience was good with a few exceptions.", "title": "Solid Pick", "user": "mchud", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 54867111}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The rooms are nicely furnished and comfortable. The location of the hotel is outstanding in the financial district on the edge of Chinatown. The food service at out conference was very good (for a hotel).", "title": "OUTSTANDING SERVICE", "user": "jimbo958", "date": "January 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54589607}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The newly renovated room is chic; the room has free Crabtree & Evelyn products (shampoo, rinse, etc.) and the bedding was very comfortable. Even the restaurant food is much better than what you'd expect from a hotel restaurant. When we went they had live vocal Jazz at the bar which set the right ambience. And very friendly service!!! The building itself looks quite run down from the outside but you'll be amazed at how new and comfortable it is inside.", "title": "Much more than expected!!!", "user": "southbreeze", "date": "June 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5337513}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I booked this hotel via priceline. I read the review from this site and I realized that there are room that I should be avoid (xx00, xx01), those room are VERY, VERY small compare to the other rooms (since they are next to the elevator & ice/vending machine, u will be hearing noises ALL night long). It is always a good idea to call a few days ahead to let them know ur preference for the room and usually they will try to accomodate ur request. There is no free internet in the room but you can definitely use it in the lobby. I heard some funny conversation of some customers complained that they got the room where it has only one bed and its too small for 2 guys to even slept next to each other (I did walk by the room one day while they are doing house keeping..u get like a full size bed or smaller). Its so funny. Most of the front desk staffs are friendly except this black hair hispanic lady in glass - she's mean to the customers! be aware!!! She doesn't let ppl have their choices, she does whatever she wants to people .. so get away from her ASAP when u checked in.", "title": "Great Stay!", "user": "Doraemon79", "date": "June 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5314359}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The location is good. Its not the best (not close to the bart station) but its OK to walk a few blocks. I walked myself to the hotel when I checked in , and I have also walked around midnight to go to 7-11 to get some food, the area is not too bad but u know, SF is full of beggers, just say NO. I like the fact that its right next to the chinatown, you can find cheap chiense foods right next to ur hotel, for less.", "title": "Great Experience", "user": "brokerchick", "date": "May 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5055998}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "The Concierge recommended the CityView Restaurant for dimsum, its nice for tourist but if u want authentic chinese food (dim sum), I think Oakland have better food. For those who likes Fisherman's wharf, taking bus 15 is a very convient choice since its not as crowded as streetcar (god its a nightmare to ride on street car).", "title": "mixed review", "user": "bruce_santarosa", "date": "April 29, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5019044}, {"rating": 4.0, "title": "Grat lobby, Nice Rooms", "text": "I had a room in 21st Floor, Overlooking the bay, away from the elevator, its very clean, very nice. I liked the fact that they used the Crabtree & Evelyn soaps (smells better than Aveda!) and their bed is VERY comfortable, better than the bed that i had at Sherton hotel in Vancouver. The AC has individ. climet control and its very quiet (brand new). Unlike the previous review, I think the chair is nice even tho it does has an IKEA feel, but I think its more Crate&Barrel Style to me (at least its solid wood furniture) and TV does have some good channels, Free HBOs for those who want to watch TV in teh room! The only thing is that u get to hear siren and bus sounds late at night (its SF, u know, bars everywhere). Its amazing that I can actally hear them on the 21st floor.", "user": "RichieBAz", "date": "April 29, 2006", "id": 5018910}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Situed in a very nice location, not too far from Union square, California Street. Few blocks to the Embarcadero and Coit tower... and is also near if you want to walk to Pier 39.", "title": "Nice place, nice price, nice location", "user": "EinarWer", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5507214, "likes": {"liked": "— The staff service and very clean", "disliked": "— the pool on the top is not on service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Very clean and the service is great. Only default, NO POOL on high floor.", "title": "Nice Amenities, Location", "user": "johnscookie", "date": "July 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5432216}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We are frequent travelers to San Francisco for a 2-3 day quick getaway. Normally I book a room through Pricelines bidding process and end up with the Hyatt Regency on the Embarcadero. This trip we got the supposedly 4 star Hilton in the Financial District.", "title": "Great everything", "user": "susanned", "date": "July 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5431344}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Like many other reviewers, we liked the decor of the room. And also loved the Crabtree and Evelyn shampoos. The bed was comfortable with nice linens as you would expect in a 4 star hotel, but I felt the room was small. The window wall had a 3 ft wide desk (with only one chair) that made it sorta uncomfortable to look out at the street. You had to lean up against it to look out. Not a big deal but I like having a table with chairs near the window so you can order room service and sit and enjoy. We had to eat our champagne brunch on the bed which was uncomfortable.", "title": "Very Nice Rooms", "user": "IP_Travelers", "date": "June 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5380128}, {"rating": 4.0, "title": "Nice hotel- quite loud at night", "text": "My biggest complaint about the hotel is the way they treat you if you buy through Priceline. They denied having a king sized bed for us even though I called early on to request one. The reception person said they only had smoking rooms with king. Even though I felt they were ruining our romantic weekend I accepted the 2 double room. It was miniature and not what I would expect from a 4 star hotel, no matter what price you pay. I requested to see the king size smoking room and it smelled very strong of smoke. At this point I asked to speak with the manager and asked her if she could help us out. She put us in a \"normal\" room with a king size bed and a nice view of coit tower, alcatraz..etc. I expressed to her we felt \"punished\" because we bought on priceline. She said they used priceline because they wanted people to come and stay again, that it was a way to get the word out about the hotel. I told her that giving the worst rooms to priceline buyers was completely defeating the purpose because they would get bad reviews. She was very nice and polite and we appreciated the view room.", "user": "runnergrl", "date": "June 22, 2006", "id": 5374667}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "After several delays coming from the east coast on a Wednesday/Thursday we arrived at the hotel only to discover our room for 3 had been given to another party. The clerk assisting us seemed unconcerned that it was 3 am and we didn't have a room ~ after much discussion we were given 2 rooms on different floors! The room 2 of us shared was very small and the bed was actually broken and most uncomfortable!! Fortunately the concierge and the clerk who checked us out were very accommodating and friendly and the hotel location was good!", "title": "A disappointment.....", "user": "Pickles302", "date": "July 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 169497995}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My family stayed here and totally loved the hotel and location. We stayed on a high floor and had an amazing view of the bay and coit tower. It is located at the entrance to china town so you can easily wonder around and buy some great items. The rooms were very large and the beds were very comfortable. They have a great happy hour daily and the resturant served some great food. The staff was very friendly and knowledgeable and they gave us some great recommendations. The wharf is a short cab ride away. We had free wifi in our room so we could be in contact with our family back home. If we come back to SF we will stay here again.", "title": "Wonderfull stay!!", "user": "james h", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169461169}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Convenient to everything in downtown SF. Staff very attentive and helpful. Rooms were clean and comfortable. I recommend staying on an upper floor so you may gain nice views of the city. Executive lounge is one of the best I've been to as a Hilton Honors member. My only criticism is that the gym needs updating and could have been kept cleaner. Over all very nice hotel.", "title": "Very nice hotel", "user": "pmny", "date": "July 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169454217}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I have never had to arrange my own travel to San Francisco. I chose Hilton, since two ladies/two rooms traveling can always be dicey. We took an unpleasant trip with Super Shuttle from SFO, we ended up \"touring\" many seedy parts of SF. We passed several other hotels that were on my \"list\" from other hotel sites. When we rounded the corner to the Hyatt, I breathed a sigh of relief! The staff was welcoming, the check-in was lightening fast and paperless. It was 10:30PM and we ordered room service--the food was plentiful, affordable, and served in less than 10 minutes. Suggest you stay on Executive levels: You save TIME with a lovely lounge with beverages, tables/chairs co-workers to meet & talk, and excellent buffet breakfast. Rooms have coffee/tea and ice machine close to the rooms. Doorman got us taxis each time we walked out the door. Check-out was so fast, we were able to dash right out. Front desk people were very helpful with directions and taking care of everything we wanted. OH--almost forgot--When I booked, I asked for extra pillows and towels, and they were waiting in our room! Exec level also had bathrobes and GOOD blow-dryers, nice-sized wrap-around desk and flat screen TV. If you need it, there are adjoining rooms available, too.", "title": "Wonderful Stay on the Bay", "user": "Gail M", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169370836}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This is the place to stay, especially if you are a woman traveling on business. I felt perfectly safe and very comfortable.", "title": "Could have been great...", "user": "jimZon", "date": "July 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 169263915}, {"rating": 5.0, "title": "Loved our stay here", "text": "I'm a hHonors Diamond member, so my Hilton stays tend to be nice. We were upgraded to a Bayview room, & the view was spectacular! From the Golden Gate almost to the Bay Bridge. We will be going back to SFO in September, & will definitely stay in this property again.", "helpfulness": 1, "user": "grapdad", "date": "August 1, 2013", "id": 170335547}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "I am a very honest contributor, as a Senior contributor, and a Hilton Honors \" client\" I am very dissapointed of the moments of truth I have experienced since the moment at midnight yesterday we arrived:", "title": "Aweful moments of truth with the Front Desk.", "helpfulness": 3, "user": "aaa2012", "date": "July 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 170174405}, {"rating": 2.0, "title": "In dire need of a makeover", "text": "1. The Person that attended us did not speak other language that english ( nowadays it seems arcaic to me having someone working at the front office that DOES NOT speak Spanish? Come on! This is a HILTON and it is California!! Where is the globalization and the professional people of the Hospitality Industry?", "helpfulness": 5, "user": "frogbog", "date": "July 30, 2013", "id": 169823285}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "2. I am a very frequent voyager, I arrive almost all the time to Business or Executive Rooms, and the Front Office person wanted to \" fool me\" saying to me that \" I 'll have free internet?\" Helloo! Come on! This is the google era!! Internet is just something that doesnt add value anymore", "title": "Great location for SFO sightseeing", "helpfulness": 2, "user": "LemonLocket", "date": "July 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 169731809}, {"rating": 4.0, "title": "Aussies in San Fransisco", "text": "3. The person at midnight that attended us when we arrived at midnight after 12 hrs of crossing the Mojave driving.. DID NOT answer the questions I asked at the front desk.. Just kept on talking and confusing us at midnight instead of giving us inmediately the rooms! He was confusing himself and us for half and hour!!! Terrible moments of truth with the chinese-calfornian person in the front desk at midnight!", "user": "Roadmaster31", "date": "July 28, 2013", "id": 169525829}, {"rating": 3.0, "title": "Mixed - good and bad", "text": "I stayed at the Hilton Financial District (actually Chinatown) for almost a week while in SF for a conference. Hotel was nice and clean. I'm a Hilton Honors member and had a non-smoking bay view king room reserved. I checked in at 3:30 and was told there were no more bay view rooms available. That's fine, I wasn't going to be in the room very much. The person checking me in put me in a tiny room next to the maid's closet and it wreaked of cigarette smoke even though it was supposed to be a non-smoking room. I went back to the lobby, waited 15 minutes, was told no one had smoked in the room, but finally convinced them I was not going to stay in a smokey room and demanded a non-smoking room. He gave me another room, telling me it was their last non-smoking room, and luckily it turned out to be fine, though being on a low floor looking over the parking structure wasn't exactly what I was expecting. But, it was clean and fairly quiet. Ironically, people checking in after me, going to the same conference, got non-smoking bay view rooms on high floors and they weren't even Hilton Honors members. They did check in w/ a different person so maybe the guy I got was just being a jerk or having a bad day. For the most part, their staff was pretty friendly though the waitress at breakfast acted like bringing us juice and water was inconveniencing her. I'd recommend the small Chinese restaurant next door for breakfast, nothing frilly, but good food for a great price. The food at the Hilton is way over priced, especially for the breakfast buffet w/ it's cold stale waffles and no \"cooked to order\" eggs, just scrambled eggs. Overall, it's an ok hotel. I probably would not stay there again though due to the initial room problem I had and because they allow smoking in some of their rooms, better to go w/ a smoke-free hotel if you are a non-smoker like I am.", "user": "JAustin", "date": "October 14, 2008", "id": 20872352}, {"rating": 5.0, "title": "Best Vacation Ever", "text": "I had to write this review as soon as I got home. I had read some of your previous reviews before we left for vacation and was a little concerned about staying here. It’s a good thing I took the chance. I can't believe how wrong some of these reviews are. This hotel was the most accommodating hotel I have ever been in. The view from our room was magnificent. Never heard any neighbors and the hotel was packed the full week we were there. The concierge was the best. They were always willing to print something or give recommendations. They also were so friendly and nice and truly interested in you.", "user": "debart97", "date": "October 8, 2008", "id": 20725095}, {"rating": 4.0, "title": "Enjoyed our stay - not noisy at all", "text": "Yes, we heard city noise, but you are in the city!!!!!!!! This is what it is all about. Everything was in walking distance. I loved this hotel and I am a Hilton Diamond member and stay at many different hotels. This by far was the best place I have ever stayed.", "user": "AxeMcFookie", "date": "September 29, 2008", "id": 20458178}, {"rating": 4.0, "title": "Surprisingly nice", "text": "First off, we booked this hotel through Priceline and got a great deal for $150 a night. Based on the dollar amount this hotel was worth every penny.", "user": "Espejo", "date": "September 27, 2008", "id": 20429386}, {"rating": 1.0, "title": "AVOID AT ALL COSTS!!!", "text": "We stayed on the 11th floor and had no issues with noise from the street or from our neighbors. There was some construction noise which was there during the day, but it never interfered with our comfort at the hotel. There was the odd police siren at night but that's the reality of a big city. If you're high enough up, the street noise is minimal. I could, however, understand if someone was trying to sleep during the day, this is afterall, in the heart of downtown.", "user": "Inasuitcase", "date": "September 27, 2008", "id": 20413207}, {"rating": 2.0, "title": "Chinatown Hilton", "text": "I was surprised to see the old Holiday Inn Chinatown is now a Hilton and has been given a face lift. We like the new look and feel, but miss the staff from when it was Holiday Inn. The elevators seem to be as busy and slow as before, but everything else seemed fully upgraded.", "helpfulness": 1, "user": "azgays", "date": "July 20, 2007", "id": 8207742}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "Booked my room through priceline, and that's the way to do it. Check-in was smooth and friendly, and they even changed the room type (received a king instead of a double bed because of my height). Quiet and newly refurbished room, and even though the hotel was almost full, couldn't hear my neighbours. Bathroom is rather small, and shower head is only meant for small people (I had to kneel to wash my hair). Wireless internet is free in the room, and the concierge and desk people are very friendly. Location is great: cable cart within two blocks, fisherman's warf half an hour away by foot, and next door is Chinatown. It really is a great hotel if you don't pay rack rate.", "title": "Simpy great", "helpfulness": 2, "user": "flyingdutchman06", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0}, "id": 8101036, "likes": {"liked": "— Excellent value for money", "disliked": "— small bathroom and low shower"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "Loved this hotel!! Got a fantastic rate through hotwire.com. Loved the location, on the edge of Chinatown, North Beach (Little Italy) and financial district/downtown. The room was perfectly appointed....", "title": "Perfect place for visit to SF", "helpfulness": 1, "user": "GracieBlue", "date": "July 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8057872, "likes": {"liked": "— The room and the value for what I got.", "disliked": "— The elevators are occasionally slow, but not a huge deal."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "super comfy bed, great club chair and ottoman for sitting/reading/", "title": "FIve Star Service", "helpfulness": 1, "user": "EHS_7", "date": "July 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8037885}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "watching TV. Excellent desk and features for biz travellers, even though I wasn't on biz this trip. Loved the individual Lazza (?sp?) coffee maker in the room - terrific coffee! The staff was very nice and helpful when needed. This hotel worked out very well for me and I'd recommend it to anyone.", "title": "Paper Thin Walls and Partying Neighbors", "helpfulness": 2, "user": "RoadTripsRUS", "date": "June 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 8015420, "likes": {"liked": "— The bedding.", "disliked": "— The thin walls."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This is the only Hilton hotel in San Francisco with an executive lounge. I recommend staying here rather than the Union Square Location because of this, as well as the attentiveness of the staff. It's an excellent location near ChinaTown.", "title": "Only Hilton Hotel in San Francisco with an Executive Lounge", "user": "Okieboy444", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168807460}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This property is close to all the areas in the city. Easy access via public transportation or on foot. We arrived at the airport after midnight and the Bart does not run at that hour so we took a shuttle from the airport to the hotel. You know one of those vans found curbside at the airport that they fill with people and stop along the way. The room was ready ( I would hope so at 2am) and I was offered a complimentary upgrade. Our room was large and had a coffee maker, large cabinet with drawers and hanging space for clothes, flat screen tv and safe. Large desk/work space area with plenty of outlets and a docking station. Programmable thermostat and remote control privacy shade and black out shade. It had a large bathroom with tub/shower. We had great views of the city because we were on a high floor. The do charge for bottled water in the room unless you are a hilton honors silver or above member. I agree the elevators can be slow but it depends on the time you are using them. There are 6 complimentary computers (3 mac and 3 dell) with a printer in the lobby. There is also a business center near the meeting rooms. They have a lounge and bar area in the lobby and the spa is also located there. I would have appreciated a fan in the bathroom and a way to open a window for fresh air. We had no issues with the air conditioner and it was not noisy in our room. We would stay here again due to the location. This property has no pool.", "title": "Great location!", "user": "Traveler J", "date": "July 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 168657475}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "My wife and I stayed at this hotel as part of a group from San Diego visiting San Francisco to view the Larry Ellison(Oracle) asian art exhibit at the Asian Art Museum. We were locked in to this hotel through our trip leader who had arranged a special discounted rate with special bus pickup for all events. This hotel was not the most convenient for the Asian Art Museum, but it was chosen for the reasons noted. The restaurant was first rate with very good and prompt service and very good food. Because of the side of the hotel our room was on, we had a very poor view, but the other side of the hotel had an excellent view of the bay. Many outstanding asian art objects in the lobby. Elevator service was sometimes slow! Excellent free computer stations and service in the lobby. I would rate our stay overall as excellent!", "title": "Hilton Financial District", "user": "Robert M", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 168610990}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "We booked 2 nights at this Hilton and I loved how convenient it was to all of the places that we wanted to visit!", "title": "Convenient location", "helpfulness": 1, "user": "Longhorngal1", "date": "July 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 2.0}, "id": 168484413}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "It was within walking distance to Chinatown and one short bus ride to Fisherman's Warf.", "title": "Solid, Unexceptional, Downtown Hilton", "user": "BlueHorizon7", "date": "July 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 168458244}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "My boyfriend and I stayed here from March 24th - 31st and loved it! The staff were really friendly and gave us a room on the 12th floor with amazing views of Coit tower and the Bay. The decor is modern and the room was spotless. The location was great and in walking distance of downtown. I hope I get the chance to stay here again!", "title": "Fantastic modern hotel", "helpfulness": 1, "user": "ELLESSurrey", "date": "April 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4956387}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "I attended a conference in town and stayed here. Initially, I was going to stay at a different hotel in Union Square, but I'm so glad I chose the Hilton instead!", "title": "This place is Nice!", "helpfulness": 5, "user": "meyww", "date": "March 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4742472}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "I got into town early and I was able to check in early. The service at the front desk was prompt and friendly. I was given a room on the 22nd floor. The staff were helpful in guiding me to the nearest MUNI stops - there is one a short walk around the corner of the building.", "title": "Fantastic Hotel With Room For Small Improvements", "helpfulness": 3, "user": "sonix", "date": "March 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4732065}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "This hotel is located right in Chinatown and close to the Financial District. It is a nice 10 minute walk to the nearby Embarcadero Center (where you can go shopping). This hotel is about 15 minutes from the SF airport.", "title": "Beware of the 'Hobit Room' and exorbitant valet parking cost", "helpfulness": 5, "user": "d-the-man", "date": "March 24, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 4730324}, {"rating": 4.0, "title": "Hip place away from Tourist Central", "text": "The room was very clean and I was very impressed with everything. The bed was soft, as were the pillows, and the comforter. I wish my own bed was as nice! The towels were fluffy and the bathroom had Evelyn Crabtree amenities.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 22, 2006", "id": 4725693}, {"rating": 4.0, "stay_parameters": "Stayed September 2008", "text": "Staff was nice, room was standard, location was good for area walking to restaurants. There on biz and certainly suited my needs. Valet at $50 per day a little high, but hey it's SF.", "title": "Decent hotel, nothing wow, but okay", "user": "texex91", "date": "September 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 20404863}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "On arriving at the Hilton Hotel, Financial District in San Francisco, it seems perfectly situated between touristy Chinatown and the Financial District. With on-site spa, roof pool, restaurant and friendly consierge, one would think that due to price you'd gotten yourself a great deal, but just wait until you attempt to put your head on the pillow and get some sleep....", "title": "Avoid at all costs", "helpfulness": 3, "user": "Gaelmor", "date": "September 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 20299605, "likes": {"liked": "— Leaving", "disliked": "— Utter lack of sleep"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008", "text": "The windows in this busy downtown hotel have not been upgraded since it was a Holiday Inn in the Sixties, so guests, regardless of how high up they are in the 28 floors are treated to the drunken screams, car alarms and emergency vehicle wails until at least three in the morning.", "title": "Nice but you may not sleep much", "user": "lozaman", "date": "September 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20288132}, {"rating": 5.0, "title": "Fantastic Views, Great Location", "text": "Our personal experience did not end there- we were in a room that had the possibility to be adjoined- we heard every peep, every bowel movement, every pillow wrussle and cell phone discussion about the occupant's brother's STD. UNTIL 5.30 IN THE MORNING.", "helpfulness": 4, "user": "LongHaulMonkey", "date": "September 22, 2008", "id": 20271568}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "If and when they moved out into the hall it was just as loud, and accompanied by the precussive noise of their door slamming shut due to poor maintenance. When I finally complained, the only solution they offered was to move us to another room- so we can wake up, pack up our stuff, and settle in to a new set of equally noisy neighbors? This was supposed to be a romantic getaway, and so when my fiance refused the new room, the night desk clerk suggested I take up the offer for a new room myself. It's supposed to be a romantic getaway, you idiot!", "title": "Great hotel next to Chinatown!", "user": "aptbroker1", "date": "September 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20172326, "likes": {"liked": "— Location and room size", "disliked": "— Valet parking is expensive!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Just got back from weekend in San Francisco, got a great Priceline rate for the Hilton FD ($90/n). Hotel is clean, modern, and staff was always friendly and helpful. Rooms were very comfy with thick fluffy towels, nice linens, good bath products, unforunately Priceline rate doesn't warrant a view room. The spa was great. Location isn't bad, about 8 blocks to Union Square and close to North Beach, Nob Hill. Would definitely recommend.", "title": "Nice Hotel, great service", "helpfulness": 5, "user": "ParisinJuly", "date": "April 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5009963}, {"rating": 5.0, "title": "My stay was wonderful! Great location and the views...", "text": "I stayed at the new hilton financial district and had a great time, the rooms were completely brand new and stylish at that. Wonderful views, ours was a city view (saved a few bucks), but still - what a beautiful city! We were able to see what the bay view side has to offer (just go down the stairwell, there is a little outpost with a beautiful open air view). You can see Alcatraz and accross the bay to the north as well as the most awesome Coit tower view!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 20, 2006", "id": 4989799}, {"rating": 3.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "Service could not have been better - from the helpful bellmen to the housekeeping staff; everyone was pleasant and accomodating of every need. I will certainly stay here again - next time I'll upgrade to the bayview!", "title": "An Average Hotel- Except for View", "helpfulness": 7, "user": "MNsota", "date": "April 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4988663}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "Despite some of the reviews on this site, this is a thoroughly average hotel. It has received a light makeover from its past life as a Holiday Inn, but isn't at the level of the Pan Pacific or Omni. The only distinguishing thing for this hotel is the view from the side that faces Coit Tower.", "title": "A Great Option to Union Square Hotels", "helpfulness": 5, "user": "kolowalu", "date": "April 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4985804}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "I spent six nights at the Hilton and from check-in to check-out everything went smoothly. The room was nicely furnished, spacious, and quiet. The bed was comfortable with a surplus of large pillows to select from. The window opened just a crack so fresh air could be let in. My view from the 18th floor was overlooking Chinatown so it wasn't anything special. After reading the other reviews I will ask for a room on the opposite side next time I stay there. The restaurant and lounge are pleasant spots to enjoy a meal or drink. All of the servers I encountered were well trained, courteous, and efficient.", "title": "WOW! Hilton reborn! Exquisite hotel", "helpfulness": 15, "user": "LoveMinus0", "date": "April 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4976013}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Some reviews have mentioned the pool on the roof - it is closed. There were rust stains on some bathroom fixtures, and the bathroom had no fan. The staff were spotty; some seemed very professional, and some seemed like they were working a Burger King counter. The elevators are incredibly slow - this is something I had never considered in a hotel, but they are THAT SLOW.", "title": "Great location, so-so hotel", "user": "Obelix_WY", "date": "August 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8459056, "likes": {"liked": "— Location", "disliked": "— Elevators"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "But the location is the best in the city.", "title": "Outstanding view of SF skyline towards Coit Tower", "helpfulness": 1, "user": "pjeanne", "date": "August 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8428860, "likes": {"liked": "— The view"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Not necessarily an obvious choice for tourists but we very much enjoyed our stay at the Hilton Financial District. Location is good in the middle of China Town, within walking distance to Little Italy and close enough to the main attractions. Room had a superb view on the Bay (Alcatraz, Coit Tower, Bay Bridge, etc.). Amenities were good, certainly up to the standards of Hilton. We did not need any particular assistance from the staff, so can't really comment, but the hotel seemed to be operating well.", "title": "Nice Stay", "user": "williamtraveler", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8423243}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Overall, I would certainly recommend it.", "title": "Great Stay at the Hilton Fin Dist", "helpfulness": 2, "user": "NomadDad", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8402375, "likes": {"liked": "— Views, Rooms, Forgot to mention Great Work Out Room!", "disliked": "— Driveway Traffice Control"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We booked this hotel on hotwire.com for under $100, definitely great for the money. The room was pretty luxurious and had a great view of the bay. The only annoying part of the hotel was the elevators. There were 4 elevators and there were always long lines in the lobby to go up and it took a long time to get down. (Maybe it was a busy weekend or maybe one elevator was not working?)", "title": "Great Stay", "user": "yorkVancouver", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8398768, "likes": {"liked": "— the bed", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "This hotel is a standard massive business hotel in a downtown. The room was a bit small, but it was comfortable and newly updated. The beds were very comfortable. We were able to walk everywhere and had fun doing some bar hopping and searching out great restaurants. If you get a good deal, this is a nice hotel. But it has the stale business hotel feel.", "title": "Business hotel, concierge and staff seemed overwhelmed", "helpfulness": 2, "user": "ufrc75", "date": "December 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 52254688}, {"rating": 3.0, "stay_parameters": "Stayed December 2009", "text": "Hilton in the Financial Disctrict is not quite in the financial district. It's located right in the china town area. if you don't mind walking back from the Union Square through the dirty roads of China Town. We stayed here at the end December, there was some construction going on and they worked on it night and day. It's very loud, you can hear the drilling...etc. One time we tried to call the Front desk, it took me 15 minutes to be able to get a hold of them.", "title": "If you could stay somewhere else....", "user": "travelernoob817", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 52046453}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This stay started off a little grumpy because the valet parking is $47/day. This is par for the city, but unreasonable. We checked in with a very strange clerk, who would only address me, and not my husband, which was weird. (he's a big guy you can't miss) Then we go to our room and the keys don't work. So I traipse back down and back up. They don't work again. My husband traipses back down and back up, this time with a valet with different keys for a different room. Finally, we're in. It is a small room but everything is nice, including a whole wall window with views of Coit Tower.", "title": "Great location", "helpfulness": 1, "user": "shrimppoboy", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 52035758}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "What I loved about this hotel was the location. It is right across from Chinatown, Little Italy is not far, and Union Square shopping is not far. We took a cab to the Westfield mall for a movie, then walked back thru Chinatown, which was fun. There was a bit of road noise, but not too bad.", "title": "Weekend in San Francisco", "helpfulness": 2, "user": "skibuff", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 51204330}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I stayed at the Hilton for a weekend while attending The Big Game at Stanford.", "title": "Fine location at the edge of China Town and Little Italy", "user": "Minfra", "date": "November 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50288065}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "This is a really great hotel.", "title": "Wow! What a room. What a view!", "helpfulness": 1, "user": "Middle_Aged_Man", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8380785, "likes": {"liked": "— Location, decor and view from Bay View rooms!", "disliked": "— I only stayed one night!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "First the view was spectacular--Coit Tower in the foreground, Alcatrez to the left and the slopes of Russian Hill and Nob Hill to the left. To the right is the bay and the Ferries. In the distance rise the mountains. Simply fantastic!", "title": "Best Hotel Room Ever", "helpfulness": 2, "user": "frankandalisonm", "date": "August 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8349429, "likes": {"liked": "— Totally brand new"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "(These were \"bay view\" rooms. Obviously not all rooms had this view.)", "title": "Good stay", "helpfulness": 2, "user": "irishrover", "date": "August 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8282282, "likes": {"liked": "— location", "disliked": "— street noise"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The location was also wonderful. Chinatown is in front of the hotel. North Beach starts just to the right and Market Street and the Financial District are just to the left. Behind you is the Embarcaderro.", "title": "Marginal at best - decor improved, but little else", "helpfulness": 3, "user": "SheWhoWanders", "date": "July 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 8242090, "likes": {"liked": "— location", "disliked": "— The unavailable and unhelpful staff."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007", "text": "The room and hotel decor is very stylish and modern, giving this rather large hotel the feel of a smaller upscale boutique hotel. The rooms are not large, but are thoughtfully laid out so that they feel quite comfortable and have very nice work space and bathrooms. Loved the flat screen TV's and the sliding door to the bathroom.", "title": "Nice decor, very loud.", "helpfulness": 2, "user": "BrownNCA", "date": "July 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8235463}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "This is the old Holiday Inn and has been refurbished to bring it up to 4 star standards. Everything was up to 4 star standards as far as I experienced. I did not eat there because there are so many great San Francisco eateries within a short walk. This omni proximity is the real beauty of this hotel.", "title": "A true 4 star hotel in a great location: walking distance to everywhere.", "helpfulness": 1, "user": "Taniquan", "date": "January 23, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 54151217}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "As far are my room goes, it was great with all the posh luxuries that come with a 4 star Hilton. Valet only parking was $56 a day but fast and convenient. There was nothing to complain about at the hotel. It is not spectacular or romantic like the Hyatt Embarcadero but it is not priced like it either.", "title": "A Guarantee from the SF Financial District Hilton Means Absolutely Nothing", "helpfulness": 2, "user": "luv2travel2069", "date": "January 15, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 53505539}, {"rating": 4.0, "title": "Our Place of Stay Every Year", "text": "But I can rave about the location. First it is about 100 meters from the restaurant owned by Francis Ford Coppola. Just walk out the front door, turn right and in 100 steps you are there. The name of the place is Café Zoetrope (like the name of his studio). It has great food, wine from the owner’s vineyard, and heated outdoor seating. Right across the street is House of Nan King Restaurant which, I don’t know why, always has a long line to get in so it must be something special. And a little further down the street is City Lights Bookstore which may be the greatest bookstore in the world.", "helpfulness": 2, "user": "travelingfamilyCA", "date": "January 10, 2010", "id": 53137408}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "If you walk out of the front door of the hotel and turn left you can walk to Union Square and Market Street. Everything is close.", "title": "Great view for great value", "user": "plonialmoni", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52512684}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "And one other big plus it that I got free wifi Internet which worked flawlessly.", "title": "The 27th Floor, Bay View Room was great!!", "user": "NoeyNoey", "date": "January 2, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 52379471}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "My wife, daughter and I had a wonderful weekend stay here!", "title": "Great place to stay in the city!", "user": "Calif0rnia_traveller", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56937565}, {"rating": 5.0, "title": "Hilton", "text": "The service was outstanding. Everyone including the valet, front desk staff, bellman, coffee barista and breakfast staff were extremely friendly and helpful. That much good service isn't a coincidence - it permeates the entire hotel staff.", "user": "Phargo", "date": "February 21, 2010", "id": 56681592}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The rooms are very nice and recently remodeling with large LCD TVs. We were on the top floor which has small balconies. A nice touch, but we didn't spend much time out there in January.", "title": "Great hotel, poor location", "user": "crazyloveslady", "date": "February 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 56420654}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The parking may seem expensive, but it's cheaper than many other San Francisco hotels. Even the Best Westerns there charge almost $50 to park!", "title": "Chinatown Central", "user": "pablus", "date": "February 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55991258}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "One word of warning - there are many one-way streets near the hotel. Getting there was a little trickier than the map made it appear.", "title": "Fantastic Location!", "user": "Cindyp183", "date": "February 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55091574}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Pros:", "title": "Very nice hotel with friendly staff", "user": "flea1979", "date": "July 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 168967065}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Very clean and tidy room.", "title": "Amazing Hotel and Woderful Staff", "user": "Deepti S", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168940991}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Spacious.", "title": "Floor and room accommodations", "user": "Ernest T", "date": "July 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 168941442}, {"rating": 4.0, "title": "Very Happy", "text": "Nice big TV.", "user": "Chad G", "date": "July 23, 2013", "id": 168790705}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Cordless phone.", "title": "Not a nice way to treat a repeat Hilton customer", "user": "LAFRMIL", "date": "July 23, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 168783734}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "Loved this hotel. The room was new, stylish, with a great view of the Coit tower. The bed was very comfortable as well - I probably slept better than I do at home. Had no problem with check-in or check-out. I heard parking was expensive so we parked at the parking lot across the street for $26/night. Breakfast was nice and a notch above your usual hotel fare. Overall, was very pleased with our stay and it was a great deal on Priceline!", "title": "Great rooms, convenient location", "user": "esheng", "date": "September 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5772953}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Like the last reviewer, my wife and I booked our room through Priceline for $70-75 a night and luckily got the Hilton Financial District Hotel. I was immediately impressed with our room, seeing the flat screen TV sitting on the desk that extended wall to wall in front of the window that offered a great view to the North. I love the beds at Hilton's as well. This location is very handy to Chinatown (a block or two up the street is the main drag). The TransAmerica Pyramid is practically next door to the East. Coit Tower is an easy walk up some seriously step sidewalks. North Beach is close by as well. Great location, great rooms, a nice hotel bar area, and friendly staff make the Hilton a great place to stay. I would love to stay there again. The parking comes to $47 a day. Just a little side note. But if you get your room through Priceline, who cares about the parking.", "title": "Wow! Very nice rooms and a great location.", "user": "HuskerFaithful", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5727778}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We were a bit nervous having booked the room on priceline (for only $75) and becuase we had to check in at 1:30am. BUT, what a treat this hotel was.", "title": "Wonderful Surprise at the HIlton!!!", "user": "spinner3", "date": "August 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5718683, "likes": {"liked": "— The view and the location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "First off, the front desk clerk was wonderful and gave us a fantastic room with an amazing view of the city. Truly beautiful.", "title": "no problems-great location", "user": "tooley", "date": "August 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5716228}, {"rating": 2.0, "title": "Weird, hit or miss experience", "text": "The hotel was renovated in January (I think) as it used to be a Holiday Inn. The room was very clean, and the bathroom was huge. The best surprise...the bed was super comfortable.", "user": "Girloadventure", "date": "August 19, 2006", "id": 5626763}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband & I stayed at the Hilton San Francisco Financial District the last week of October.... I am a tripadvisor addict before we travel places so I figured I owed it to all my fellow travelers to post reviews from our west coast adventure.", "title": "THE", "helpfulness": 1, "user": "seaclipse11", "date": "November 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21830593, "likes": {"liked": "— the view, the concierge staff, the cleanliness of rooms", "disliked": "— the restaurant service, the thin walls"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "The Hilton San Francisco Financial District has many pros, yet many cons....", "title": "great hotel", "user": "Leesw8", "date": "November 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21643505}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "CONS:", "title": "Great hotel", "user": "jonna30", "date": "November 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21462375, "likes": {"liked": "— Clean comfortable room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "~I didn't want to believe the tripadvisor rumors... but YES it is true... the walls are PAPER THIN... actually it may not be the walls... but if you are in a room with an adjoining door to the next room... you are just out of luck!!! celebrating our 1 year anniversary we were accompanied by yelling and screaming and cursing to a sports channel next door... it was amazing, I mean we felt like we were sitting in the room with the guys next door cheering on the World Series... thank goodness they checked out the next morning and our last 2 nights were quiet!", "title": "Location and Decor Trump All", "helpfulness": 1, "user": "Brian_NVA", "date": "November 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21456650, "likes": {"liked": "— Location", "disliked": "— Didn't really stand out in terms of service and maintenance"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "~The Restaurant... we were very excited to eat in the cool retro restaurant... but this sums it up.. there were 2 other tables in the lounge area... we sat down to have a quick drink and some food b/c we were too tired to venture out into SF... 11 minutes after we sat down we got greeted by a server (forgot his name) I asked for a drink list and menus... 4 minutes later we got a menu... 8 minutes later he took our drink order.... 16 minutes later we received our drinks... anyways I won't even continue... lets just say it was the worst dining experience I have ever had!!! I felt so dumb and out of place... \"be hospitable\" is the hilton motto and yea.... I think that needs to be re-evaluated in the restaurant!!", "title": "Fantastics views in San Francisco", "user": "FlyguyAustin", "date": "October 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 21390476, "likes": {"liked": "— views, nice room", "disliked": "— parking cost"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The drab architecture of the building itself is the only evidence that this used to be a Holiday Inn. The rooms and common areas have been completely redone and now look more like an upscale boutique hotel.", "title": "Not Your Uncle's Hilton", "user": "grobma", "date": "October 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21252446, "likes": {"liked": "— Location, desk faces the window", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The rooms have been redesigned in a very modern but warm decor. The best part is the long desk that lines the window so that you are easily distracted by a great view. I usually prefer wired internet access as I almost always have signal strength and consistency problems with wireless, but not here. Good strong signal at all times. The Japanese style sliding door to the bathroom was one of the best I've seen as there was almost no space along the sides - a common problem that hampers privacy if sharing the room. A comfortable bed was complimented by a stylish chaise lounge.", "title": "OK, nothing more nothing less", "user": "LBtraveller", "date": "October 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 21200378}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "I did not spend much time in the hotel itself but was impressed with the design of the lobby and the food and retail outlets. The staff was pleasant and helpful. Room service breakfast was pricey but tasty and on time.", "title": "Great room!", "user": "anta_8", "date": "October 17, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20966243, "likes": {"liked": "— comfortable bed,view from our room", "disliked": "— delay in check in"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "One of the best things about this hotel is it's location. It is sandwiched by Chinatown and the Financial District, and only one block away from R&G Lounge and House of Nanking - two Chinatown favorites. A short walk takes you further into Chinatown or to North Beach.", "title": "Very disappointed....", "helpfulness": 5, "user": "YvonneNaperville", "date": "October 16, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 20930167, "likes": {"liked": "— Location", "disliked": "— Horrible customer service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "Lastly, all the reviews I read about excessive noise had worried me, but I was not disturbed - by internal or external noise - one iota. I did notice that the ice machine was very loud so had I been in the room next to it I might have thought differently.", "title": "Great location, comfy beds", "user": "Torport", "date": "October 14, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20882101, "likes": {"liked": "— The beds", "disliked": "— The elevators"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Excellent location (across the street from Chinatown, 15-20 minute walk from Fisherman's Wharf and Union Square, practically next door to the Transamerica building, down the street from Francis F. Coppola's studio and 5 minute walk to North Beach - SF's Little Italy); extremely spacious and clean rooms; nice exercise room and very curteous staff.", "title": "Great Hotel, Great Location", "user": "SKrav", "date": "August 12, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 5603556}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I would definitely recommend this hotel.", "title": "One bad apple almost spoiled the rating.", "user": "micahtran", "date": "August 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5537900, "likes": {"liked": "— Clean and comfortable beds.", "disliked": "— Room too small if a cot is needed"}}, {"rating": 3.0, "title": "Pleasant Stay", "text": "All but one staffperson were incridelby helpful and courteous (back to this later). Hotel is conveniently located next to Chinatown and walking distance to Union Square, Embarcadero, and the California Cable Car Line. Newly rennovated; room and bath spotless. Nice selection at coffee bar and hotel bar in the lobby. Sleek minimal design...yet family friendly. We got a great rate for 4 rooms for 2 nights through Priceline. Every staffperson we've encountered from the valet guys to housekeeping to front desk (except for one) were courteous and professional...even nice. The older frontdesk guy (40s maybe 50s, thin with a moustache) that checked us in smirked after he found our reservations when I asked if two of the rooms could be on the same floor since my kids are staying with us. (This is around 2:30 p.m.) He started scribbling something and looked at me and smirked. Asked me to initial the paper which turned out to be my room reservation with the price crossed out (because I booked through priceline which I could care less what they paid because I got a great deal.) I asked for two rooms to be on the same floor again and told him I would be happy to come back if two rooms on the same floor was not avail. now but avail. later. He said no, didn't bother checking, gave me my keys and said \"this is all we had available\". I took the keys, took the family out for late lunch, came back at around 4 p.m. and double checked with a frontdesk person to see if we could get two of the rooms on the same floor. The woman that helped us said sorry for the delay as she checked. She placed three of our rooms on the same floor without any problem.", "user": "AJSG", "date": "July 31, 2006", "id": 5534376}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Tip. Rooms facing the Coit Tower are quieter that the other side. Overall, one snotty staffperson in a nicely remodeled hotel with generally great customer service.", "title": "Good place to stay.....I would recommend it", "user": "sunshine1979", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5530267, "likes": {"liked": "— Comfortable beds and amazing toileteries", "disliked": "— A bit pricey and not very good location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We had a pleasant stay. The hotel is nice and clean with renovated rooms. It is more in Chinatown than in the financial district but that is not a problem as a two or three block walk will put you in the action of Union Square. i am not giving the hotel a better rating because I paid for an executive room that included continental breakfast and hors d'oeuvres and soft drinks in the evening. Upon my arrival to the executive lounge there was a sign that they closed on Fridays and Saturday evenings. The front desk was not sympathetic at all.", "title": "big is beautiful", "user": "chebby", "date": "July 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 5516910}, {"rating": 3.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "I stayed at this hotel for a conference at the end of May. It is in a great location but the day after my stay, the hotel was closed for renovations to be opened as a different hotel chain.", "title": "Long Live this Hotel", "helpfulness": 2, "user": "Amsdentraveler", "date": "October 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4068314}, {"rating": 4.0, "title": "Perfectly located for a 'true' San Francisco experience", "text": "My wife and I stayed at this property in April of 2004.....our first trip to San Francisco. When looking for a place to stay, we looked at a variety of hotels in different locations (downtown, financial district, wharf, etc.) Although our first instinct was to stay in the Fisherman's Wharf area, we decided on this Holiday Inn in the financial district of the city......right next to the famous TransAmerica Building. We found the hotel to be clean, quiet, and hosted by friendly staff. The roof top pool is neat, but we didn't use it. What we enjoyed most was the convenient location to Chinatown and North Beach (Little Italy).....both were within very easy walks. After a day of business or sightseeing, we would hit the hotel, clean-up and walk around \"true San Francisco\" enjoying an evening appetizer, meal, and dessert/coffee at three different (but very good establishments). If you like to \"get out and see the city\" this is a great place to stay.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 20, 2005", "id": 4040385}, {"rating": 4.0, "title": "Fantastic views", "text": "Stayed in this hotel a while ago now but could not believe some of the negative views here so wanted to add my own. We stayed here for three nights when we first arrived in San Francisco.", "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3903031}, {"rating": 4.0, "title": "great location and felt comfortable and safe", "text": "The room we had was big and clean - if a little dated in decor. Loved the bar - very 1970's vibe to it.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 14, 2005", "id": 3357157}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "The location is fantastic - right on the edge of Chinatown and the financial district - easy walking to North Beach.", "title": "OK but not great", "helpfulness": 5, "user": "Richiewoodhouse", "date": "April 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3348530}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed 7 nights (8/29-9/5/07) and got the room through Priceline for $85.00 per night. Priceline considers this hotel “Financial District”, though one may argue it is in Chinatown. Really I think the Hilton refers to it as being in the Financial District, so Priceline does as well. Either way, it is in a great location. We did not have a car, so I cannot comment on parking/driving, although it is expensive. I feel the location makes up for needing a car – my husband and I walked everywhere. The hotel offers a shuttle to and from the airport, $26.00 per person (plus tip). We did this going from the hotel, and a cab cost $60.00 to the hotel from the airport.", "title": "Hilton, Financial Disctrict - Great Location!", "helpfulness": 1, "user": "Oatis_J", "date": "September 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8666066, "likes": {"liked": "— Location!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Pros:", "title": "Book a high floor", "user": "gorka", "date": "September 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8606109, "likes": {"liked": "— The view from my room", "disliked": "— othing, really"}}, {"rating": 4.0, "title": "very central", "text": "Great location! On the cusp of Chinatown, in walking distance to North Beach & Union Square.", "user": "Pineda", "date": "August 30, 2007", "id": 8553929}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Fantastic views! We were given a room with a view of the bay and Coit Tower. I know with Priceline you cannot guarantee this – but we were lucky. If you book your room the old fashioned way, be sure to ask for this side of the hotel. Well worth it!", "title": "Wonderful Hotel", "helpfulness": 1, "user": "egf1960", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8524698, "likes": {"liked": "— We felt, as we should, that we were in a luxury hotel.", "disliked": "— No compiants at all"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Room décor was trendy and modern. In general very clean.", "title": "Thin Walls", "helpfulness": 1, "user": "yolipan", "date": "August 27, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8514457, "likes": {"liked": "— The location", "disliked": "— The noise"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "We've stayed her twice for romantic weekends away (we live an hour South). It is the nicest hotel I've ever stayed in! ( but I'm a cheapskate- I won't pay over $150 for a room, ever. But for $75 once, $100 another time it's definitely worth it!) This hotel is easy to spot on \"last minute hotel\" anonymous services as it is the ONLY hotel in the area with a SPA. What keeps this from being a 4 star property? A lack of restaurants on-site. But excellent restaurants are within walking distance, and the room service is good, though pricey. Both visits we were given rooms on the North side, facing Nob Hill, with bay views to either side of Coit Tower. Service is excellent. The desk clerk saw that I was with my wife so he made sure to find us a room with a bathtub instead of just a shower. Parking is very expensive - $32 a day on weekends. And don't bring anything taller than a minivan! If the rumors are true that Hilton is taking over, then I'll be disappointed because we won't be able to afford to stay here any more!", "title": "Four stars for the price of three!", "helpfulness": 6, "user": "RomanticoYcheapo", "date": "March 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3290631}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 107, "average": 285, "very good": 577, "terrible": 57, "excellent": 370}, "aka": "Hilton San Francisco Financial District Hotel San Francisco", "slim_ranking": 0.382978723404, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Hilton San Francisco Financial District soars 27 stories, offering stunning panoramic views of the city skyline and San Francisco Bay. Located in the historic center of the city, the hotel sits at the crossroads of the Financial District, Chinatown, North Beach and Nob Hill. You are just steps away from San Francisco's most popular attractions such as Alcatraz, Union Square, Fisherman's Wharf, Coit Tower, Lombard Street and the Golden Gate Bridge."}