{"user_rating": 4.0, "review_count": 443, "name": "Hilton Barcelona", "reviews": [{"rating": 4.0, "title": "Great location", "text": "We stayed here before our cruise. Rooms were small but everything is new and the bed was very comfortable. It is close to the metro and wedged between two malls with lots of food options. A perk was the ihome alarm clock. We were able to charge our ipods and ipad without taking turns on the converter/adapter.", "helpfulness": 2, "user": "FlamingoAZ", "date": "June 25, 2013", "id": 165186812}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I have stayed in this hotel for three days for a business trip. This hotel is situated on the Avinguda Diagonal which is considered as Retail outlet stretch in Barcelona. Metro station is very close which is at walking distance.", "title": "Exhilarating Business Stay", "helpfulness": 1, "user": "GurudattaGG", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165140432}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Hotel staff is very cooperative and hospitality shown by the staff was overwhelming. Front office staff Ms. Miriam could guide us for the places of attraction in Barcelona and was very positive and attending to customers. The room was very clean and the bed linen provided was very good. I had a nice sleep during the night with out any disturbances. The continental break fast provided was satisfactory. The internet services and the television channels provided was excellent.", "title": "Classy staff and newly remodeled", "helpfulness": 1, "user": "parcha58", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 164823617}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Totally this was a nice hotel to stay.", "title": "Hilton in courtesy, but not in basic service", "user": "Saket G", "date": "June 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 164259281}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed at this hotel for five nights in early June, and were extremely satisfied. The staff is extremely professional, courteous and knowledgeable. They helped us book a great tour to Girona and Figueres. Rooms are modern and well appointed. In fact, I don't think I've stayed in a cleaner, more spotless room! Breakfast in the executive lounge was amazing--delicious manchego cheese, jamon iberico and other Spanish delicacies. Be aware, though, that it's not located in a tourist area. It's more like a financial area, with modern buildings and a shopping center nearby. We were gone all day sightseeing, so we didn't mind. It just takes a few more stops on the metro to get there, and the metro stop is within walking distance. You can even get on the Bus Touristic within a couple of blocks. The lobby is expansive, beautiful and comfortable. Everything looks newly decorated with ultra modern furniture. We left our luggage with the concierge on our last day so we could finish sightseeing. I wouldn't hesitate to staying there again, even though you won't see it in most travel books. (Note: we observed an American couple with two young children being very rude to the staff at the front desk. It was hard to sit back and observe this behavior. Let's all remember that we represent our countries when we travel too. )", "title": "Very Nice Hotel in Barcelona", "user": "IrishFlorida", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164101424}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "i am here for second time after just 1 year. somethings seems changed . the staffs are more friendly and warm and helpful. the restaurant of hotel has better service than past .the foods and cooking acceptable and better than before and i saw some guides by experienced staffs to young ones to have better service . but the only thing disappointing me that the internet service connecting with more steps and with difficulty . around hotel you will find more areas for shopping and business center is near to hotel . the restaurant of yard area in front of door near full at evening times and has good atmosphere for families and couples also . unfortunately the hotel dose not have pool it was not my decision to come again to this hotel and it was my sponsor choose .but as i know all around hotel , it was easy for me and i think in next trip i will come back to this hotel .", "title": "for second time here", "user": "yashamashhad", "date": "July 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166322445}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "We spent 5 days at the Hilton Barcelona in May. Hotel is situated between two shopping malls and only 15 minutes from the airport. The rooms have been renovated tastefully. Parking is very expensive. As Diamond members we have access to the Executive Lounge, which is very nice. However the offering is very basic and the service at the lounge is inconsistent. The desk is not always staffed.", "title": "Nicely renovated and great location", "user": "Foldees", "date": "July 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165983568}, {"rating": 3.0, "title": "The good and the bad", "text": "Good points:", "helpfulness": 1, "user": "Yamazato", "date": "July 1, 2013", "id": 165882212}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "- Renovated rooms and public spaces, in contemporary style.", "title": "Hilton Barcelona-June 2013", "user": "mohams50", "date": "June 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165728907}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "- Good bed.", "title": "Worst Hilton Experience", "helpfulness": 3, "user": "vibrahim03", "date": "June 26, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 165333155}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This is one of a couple of Hiltons in Barcelona so make sure you have the address handy. This is located in a commercial shopping and business district along the busy Avinguda diagonal. It is only a couple of blocks away from the Maria Cristina Metro stop which then gives you access to most anywhere in the area. The front desk check in was a little questionable with lots of new staff. But those who knew what they were doing were of great help and spoke multiple languages. The rooms are posh and extremely comfortable. I found all of the hotel services rather expensive including wifi. I would eat at the buffet once and eat out in the city otherwise. The buffet was delicious but again pretty pricey. The bathroom was by far my favorite thing about he hotel, nice big walk in shower with a detachable shower head available. We had a fabulous view of the Mediterranean sea off in the distance, so ask for a room higher up. If you can afford this hotel go for it, otherwise there are plenty of other more reasonably priced options", "title": "Upscale in price", "helpfulness": 4, "user": "travelmore30", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 167556038}, {"rating": 4.0, "title": "Barcelona Hilton", "text": "The Hilton is in a commercial district of Barcelona, but you're a couple minutes by foot from the Maria Cristina Metro stop which will then take you to wherever you are heading. Another alternative is to take the buses down Avinguda Diagonal to the Diagonal Metro stop. Either way, you're not too far from the main attractions of the city. As for the hotel itself, it has a very modern lobby with nicely furnished rooms. The rooms are on the small side, but perhaps by European standards it's acceptable. The bathroom was quite large though, which was greatly appreciated. My only quibble is the lack of free wifi which, given that this hotel caters primarily to business persons, is disappointing. There is a business center on the first floor, but it still would have been nice to have free wifi in the room itself. Staff was super friendly and very helpful in answering my questions, even printing off a map to show me how to get to a nearby convenience store. All in all, a solid property to stay at when in Barcelona.", "helpfulness": 2, "user": "klavkonz", "date": "July 12, 2013", "id": 167243893}, {"rating": 4.0, "title": "Barcelona Hilton", "text": "I think the service, room, and the location of the hotel is ideal. For the price that I paid, I would definitely rate this as one of the better choices around the area. I would consider staying here again next time in Barcelona. The staff are very friendly and willing to help. Thank You.", "helpfulness": 1, "user": "klavkonz", "date": "July 9, 2013", "id": 167004690}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Really enjoyed this hotel. Great location , close to the metro , nice restaurants in the area. The rooms are very nice and comfortable. The staff is very friendly and accommodating and helpful with suggesting outings in Barcelona!", "title": "Barcelona Hotel", "user": "aysekennedy", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166810628}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Stayed there for five nights during a business trip. The place is clean and has a very modern decor, white paint and chrome everywhere. The rooms were clean and quite. My room had a nice view of the Mediterranean in the horizon with a nice city view. The lobby has loud music playing, a bit too loud for my taste. The hotel is located in the heart of a the business and commercial district. It is surrounded by many good restaurants, malls, and office buildings. A very convenient place to stay if you are in Barcelona on business. The staff is very helpful and polite. They all try hard to speak English and understand it, so it is easy to get information. The one thing that I believe is a problem is the internet service in the rooms. It is very expensive, 20 Euros per day, it is slow and takes forever to connect, and it is fairly difficult to use and as such, I suggest you use a different service, say Skype Wi-Fi, instead. I would go back if I am in Barcelona but would never purchase the Wi-Fi service again.", "title": "In the heart of the business and commercial district of Barcelona", "helpfulness": 1, "user": "Valiant10000", "date": "July 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166610425}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "a typical average hilton .not much not less.everything in good working order.professional staff.", "title": "average", "user": "telis", "date": "July 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 168904834}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "decoration very modern a bit bland.location in upscale neibourhood but a bit far from city center.", "title": "Good hotel!", "helpfulness": 1, "user": "Anameneses", "date": "July 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 168869973}, {"rating": 4.0, "title": "Very good, ,central", "text": "room windows don't open-feeling traped in the room.", "user": "Chelsea P", "date": "July 21, 2013", "id": 168434177}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "breakfast very good.no swimming pool a big minus for a city with such a good weather.", "title": "Simplistic, but very good", "helpfulness": 1, "user": "BoroTraveller", "date": "July 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 168278327}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The hotel is good - maybe not as good as others Hilton hotels. The staff are very nice and helpful. The breakfast is ok and the restaurant (dinner) is great!", "title": "Stylish hotel, elegant suite", "helpfulness": 2, "user": "KnutKnutsen81", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 168039467}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 16, "average": 71, "very good": 175, "terrible": 2, "excellent": 179}, "aka": "Hilton Barcelona Hotel Barcelona", "slim_ranking": 0.179732313576, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Set in the heart of the financial district, close to the city’s shopping destinations; Hilton Barcelona offers upscale accommodation that captures the essence of the vibrant Catalonian capital. Whether here on business, for a meeting or taking a leisurely break, enjoy a wealth of premium amenities, warm hospitality and its location. Travel to the hotel by car from Barcelona International Airport in just 15 minutes and from Sants Train Station in five. Walk for just five minutes to reach the Maria Cristina underground station or take a bus from in front of the hotel. Both options provide easy access to explore the many attractions of Barcelona and the city centre.Wake up in a stylish and contemporary guest room, featuring high speed internet access and city views. Take care of business at the desk, or listen music with the new iHome player. Upgrade to an Executive room and enjoy all of amenities found in our standard guest rooms, together with exclusive access to the Executive Lounge, offering complimentary continental breakfast and evening drinks.Savour a taste of Catalonia, choosing from a tempting menu inspired by the culinary traditions of Barcelona at the Restaurant Mosaic or meet with friends over cocktails and tapas at the Vibe Bar and Terrace."}