{"user_rating": 4.0, "review_count": 809, "name": "Hilton Santa Fe Buffalo Thunder", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I love nothing more than to go to the Buffalo Thunder, however; they are understaffed in the resturants and bars... Casino resturant terribly understaffed on Monday 7-24 says 35 minute wait with at least 10-15 tables open, bartender rude, hateful and spiteful as we ate at the bar. I feel the workers (mostly reservation residents I encountered) felt we owed them for coming to spend our hard earned cash. I have never encountered this service at a casino resort, will come back and give them another chance, but come on!", "title": "Nice Hotel, Service Lacking", "helpfulness": 2, "user": "DAVID S", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 5.0, "service": 1.0}, "id": 115825989}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I hope that I can prevent the next unsuspecting victim from enduring similar events that occurred during my weekend trip to Buffalo Thunder. I spent a lot of money for premium suite accommodations, 4 Ron White tickets, meals and drinks at the hotel restaurants, and 2 excursions to the Towa Golf Resort for what I anticipated would be an exciting and fun filled weekend. However, the events that unfolded on the night of July 1 changed my opinion of this rogue Hilton resort.", "title": "DANGER: NOT A SECURE LOCATION", "helpfulness": 37, "user": "Average_Joe_2011", "date": "July 21, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115598293}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "After spending quite a bit at the craps table, my friends decided to visit the Blue Tower and enjoy a drink. We went in and sat down at a table near the back of the Blue Tower and couldn't help but notice that there was a table of miscreants sitting behind us. We decided that we would finish our drinks anyway and leave the Blue Tower as soon as we could. Soon I noticed that the miscreants were shuffling out of the Blue Tower and that my wallet was stolen. I hurried to talk to the staff of the Blue Tower and they said that security would have to handle the situation since the thugs had gone out to the casino floor. We noticed that there were cameras everywhere that recorded the events that transpired, and these thugs were the only people in position to swipe the wallet during our short time at the Blue Tower.", "title": "Great except one little thing", "helpfulness": 6, "user": "Aclub", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 115571828}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I then ran to the security booth and encountered the \"security guard\". He showed a general lack of interest in the matter and said he would pull the video and take a look. The next 20 minutes were excruciating because I watched the suspected thugs enjoy a night of drinking and gambling with what I suspected was my hard earned vacation money. The security guard then sauntered out and informed me that he \"saw nothing\" from the video and that he would let me know if anything turned up. We then observed our trustworthy security guard engage in a very friendly conversation with the thugs that I suspected stole my wallet. My next 2 hours were spent searching every trashcan in the hotel and casino for my wallet, calling LifeLock for identity theft protection, canceling multiple credit cards and trying to figure out how I could get home with no money. I also took the time to take a picture of the thugs while playing on the craps table. Because the security guard seemed so aloof, I also snapped a quick picture of him with my camera. A miserable night spent chasing my identity and conducting my own security investigation with no help from the security guard on duty. The events the following day would be even more outlandish!", "title": "Great Resort with Lucky Paying Casino", "helpfulness": 4, "user": "cardscharlotte", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115171800}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The next morning, I arose and went to the security booth to see if my wallet had been turned in. The new security guard on duty looked through the log book and said that there was no log from the previous evening that a wallet was even stolen. I was in shock and said that I wanted to discuss this matter with the security supervisor. When I explained what happened and showed her the picture of our security guard, she said that I needed to file a police report immediately. She was appalled by the lack of security provided by Mr. Trujillo and directed me to the Pojoaque Police Department. The police department was able to pull video within 2 minutes that showed that the thugs I suspected were in deed the wallet thieves and that the theft was obvious and that an arrest should have been made the previous evening. I filed the report with the officer and left encouraged that they would follow through and keep me updated.", "title": "Not What We Expected", "helpfulness": 3, "user": "vacation2424", "date": "July 5, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 3.0, "service": 1.0}, "id": 115065941}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The hotel is beautifully decorated with S/W Indian decor and pottery. The resort sits in the middle of the mountains with the most beautiful views, you can see the golf course from the balcony, and you can enjoy the quiet and smell the fresh air from all around the hotel. If you like to gamble there is a huge casino with slots and tables on the ground floor, very very nice and clean inside casino. Free soda, and water. We had a terrace suite and it was gigantic in size, with a balcony the length of the room with two sliding doors out to balcony. The bathroom is huge as well two or three people can get ready at once if needed. there is a sink / large vanity. A second vanity with lots of electric sockets, mirrors and table and chair, then a huge shower and a separate toilet area. The beds were so nice and comfy with the best down comforters and fluffy pillows!!! The pool is nice with lots of cabanas, and lots of seating area. There is lots of out door seating for late nites enjoying the cool air. I plan to return in the fall, it was so beautiful and relaxing. Only 10 minutes from Santa Fe and 15 minutes to Espanola and sacred churches. The hotel is pet friendly and I seen lots of pets there with a dog run as well.", "title": "BEAUTIFUL RESORT AND VIEWS - RELAXING", "helpfulness": 1, "user": "DebnDen", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116711703}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The Honor Bar in this hotel is set up like a speed trap in Alabama. Be careful. Just by touching an item on the honor bar you will be charged at least $6 and if you actually use andything you will be hit wtih a $25 restocking fee. Check you bill bery carfully to make sure they have not snuck in a charge. The desk clerk said there was a sign on the front desk explaining this and indeed there was. However, it is a tiny placard in the center of the long front desk. If you check in at either end you will not see it. Also the notice in the room is not noticiable. In fairness when we complained, explaining tht we lifted the itmes, looked at them but returned them to the tray, the desk clerk at checkout waived the fee. BUT AN EXCELLENT HOTEL SUCH AS THIS SHOULD NOT BE TRYING TO TRICK YOU INTO A SMALL FEE.", "title": "This is a wonderful, beautiful hotel but beware of the Honor Bar", "helpfulness": 2, "user": "eastsider60763", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116710407}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "This is a wonderful place to stay and play. Casino, golf, spa, great restaurants and shops all in one place. Close to Santa Fe, Tesuque, Chimayo, and other places of interest! Staff is so accommodating, friendly, & helpful! This was our 2nd stay & both have been lovely. The only negative is that you must pay for Internet which is odd for a hotel of this caliber.", "title": "Awesome place! Great golf as well!", "helpfulness": 1, "user": "TexasAli", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116616461}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Thoroughly enjoyed our stay at the Hilton Buffalo Thunder on a recent trip to Santa Fe. The resort is about 10 mins north of downtown and conveniently situated right off the freeway. The large property is relatively new and very well-maintained with several restaurants, bars, shops, a spacious outdoor pool area, a casino downstairs, and even a nightclub located inside the hotel open on weekends. I booked the room type called a 'terrace suite' and could not have been happier with the accommodations- we were assigned a spacious room with 2 queen beds (one king bed was also an option), sitting area with a small fold-out loveseat, the largest bathroom I've ever seen in a hotel, a gas fireplace AND a huge balcony with a gorgeous view overlooking the Sangre de Cristo mountains. All that for an exceptionally reasonable rate that I booked directly through the Hilton website. In spite of the hotel's sprawling size, noise and crowds were never an issue. Check-in was quick and easy, and since we arrived early before our room was ready the staff offered to store our belongings so we could explore the property (check-out was equally painless and efficient). Didn't dine at any of the hotel restaurants, but would have gladly tried the Red Sage for breakfast, lunch or dinner. Was able to connect to the hotel's wifi signal in the room for no charge which was helpful because AT&T's 3G coverage was spotty at best all over Santa Fe. The final reason that Hilton Buffalo Thunder deserves a 5-star excellent rating is because after arriving back home in Dallas, we realized that two robes had gotten left behind in the room's closet and after a quick phone call that connected me with hotel security/lost & found, both items were located and shipped back to me free of charge. Received them within a few days- now that's top notch service. I'll gladly return here to stay anytime I'm back in Santa Fe.", "title": "beautiful resort property near Santa Fe", "helpfulness": 2, "user": "UTgradstudent", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116581946}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The marketing for this north-of-town Hilton is exotic. And in some ways, it IS an exotic property, with lovely native artwork, beautiful rooms, quality restaurants, and even a casino. It is advertised as \"12 miles from Santa Fe,' but it is actually 14 miles from the center of town, which, I suppose, is not a big deal. What WAS disappointing, however, was the incredibly loud outside air conditioning machinery on the north side of the far wing of guest rooms. The place was full (we heard new arrivals being \"walked\" to other hotels) so we were unable to be moved, but we were forced to keep our sliding doors closed to the lovely New Mexico air in order to muffle the noise. Be sure to insist on south-facing rooms, on the opposite side of the air conditioning \"city\" to the north.", "title": "Could be nice, could be NOISY", "helpfulness": 1, "user": "JohnandGlo", "date": "August 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116543446}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Wonderful resort just north of downtown Santa Fe. Very nice rooms with all the modern amenities. Service is great and there is good selection of restaurants on the premises. For those who like some gaming action there is a casino on the property. A pleasant place to spend some time relaxing", "title": "Great Resort North of Santa Fe", "helpfulness": 1, "user": "azjohnny", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116283352}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I love the casino and my wife loves the spa and resort. I visited four of the restaurants and buffets and loved everyone of them. As a diamond member the breakfast coupon for weekdays was awkward and servers didn't really seem familiar with how they worked. The suite was a little smaller than I had expected and they were not able to give me the connecting rooms I had asked for, but there was an emergency and local residents displaced by a forest fire made the hotel \"sold out\". It is close enough to downtown Santa Fe (15 minute) to visit as often as you want, and far enough away to be very quiet and have an out in the country feel.", "title": "Love the buffet!", "helpfulness": 1, "user": "4millionmiles", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115934282}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Fabulous rooms that were spacious and quiet with nice balconies. Room service was slow, painfully slow and the food was, unfortunately, way below average. Spa is excellent but a bit over-priced, but I did have the sauna, steam room and jacuzzi to myself. My wife thought her massage was one of the best she ever had, but mine was not so great. Rooms are very affordable. The kids enjoyed the pool. Nice work out room as well.", "title": "Great rooms and nice place to stay", "helpfulness": 1, "user": "gbreetz", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 115872964}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "We've stayed here a handful of times it a short drive to the downtown square but you get a much nicer room and a casino instead. The price is really good and it sits overlooking the golf course. Good value just don't expect to be close to the square", "title": "Not close to downtown, but on the golf course and casino", "helpfulness": 1, "user": "SOONERJEREMY", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 115863382}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband surprised me with tickets to see Randy Travis at the Hilton at Buffalo Thunder. With his Diamond status, we were upgraded to a very lovely room. However, when the air conditioner kicked on, the noise was quite loud and annoying. We requested another room and were moved to a one-bedroom suite with two fireplaces. Wow! It was gorgeous with wonderful views. The front desk staff was very accommodating. Dinner and breakfast were good and the concert was great. We didn't do much gambling, but are now receiving offers for great rates from the hotel. Would definitely like to go back.", "title": "Randy Travis, Gambling and Luxury", "helpfulness": 1, "user": "TxJenny", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 115845364}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I read a lot of reviews and was a bit hesitant to take my children. I'm glad I ignored the bad reviews. We stayed mid-week during summer vacation through Saturday and the poolside was filled with families (note: Sunday afternoons the pool is reserved for booze parties). Everyone was well behaved and parents and children alike all made new friends.", "title": "Book early for best deal", "helpfulness": 2, "user": "withliberty", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116829805}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Food and drinks were all reasonably priced for a resort-style setting - especially if you do a little digging around. There is a deli in corner of the casino (sectioned off so children are allowed) where you can buy a Boar's Head meat sandwich or wrap for $4 and get a milkshake for $3. Can't do much better on price at McDonald's. Buffets are okay; plenty of food, but nothing spectacular for breakfast, lunch or dinner.", "title": "Beautiful hotel and pool", "helpfulness": 1, "user": "Smkempf", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 116783072}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The artwork in the hotel is gorgeous and this is definitely a new establishment (about 3 years old) that is worthy of a 5* rating. My major gripe was with the booking process. I saw on-line specials for $119/night (and as low as $69/night if you join their casino club), but whenever I tried to book directly via the Hilton website I couldn't get the rate. When I called, I was told they were \"sold out\", yet every website in the world (bookings.com, hotels.com, orbitz, etc.) showed availability so we ended up paying more.", "title": "Great balcony", "helpfulness": 1, "user": "winwinwin333", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 116776636}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Then, the casino offered a $25 bonus that was heavily advertised. Show up and you learn the promotion ended (even though billboards, etc. still show the promotion).", "title": "enjoyed our stay here", "helpfulness": 1, "user": "funmomStLouis", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116763257}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "To add insult, when I tried to add a night I was told the place was again \"sold out.\" I went to the business lounge to use their 10-minutes of free Internet and immediately found availability for $169. When I printed this out and showed the girl at check-in, she happily extended my room keys for an extra night! How can any place treat an Internet shopper better than a current customer? And how could my specific room be available for another night less than 10 minutes after being told the entire hotel was sold out?", "title": "You get what you pay for.", "helpfulness": 1, "user": "C A", "date": "August 14, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116730759}], "location": {"country": "United States", "city": "Santa Fe"}, "stars": 4, "variance": {"poor": 50, "average": 129, "very good": 263, "terrible": 34, "excellent": 333}, "aka": "Hilton Santa Fe Golf Resort And Spa At Buffalo Thunder", "slim_ranking": 0.389830508475, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}