{"user_rating": 4.5, "review_count": 1071, "name": "Hilton Madrid Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We stayed at the Hilton for a single night prior to an international flight. It was great and far better than expected for an airport hotel. The rooms were very clean and modern. Nice bathroom. We had dinner and breakfast at the hotel dining room which was good but not great. I agree with others that it is a bit pricey for meals. You can walk to a metro station which we did and for a euro were able to travel downtown. Shuttle to the airport is about every 20 minutes. The pool in the fitness center is very nice with a retractable roof and large open windows that give you the feeling of being outdoors despite cold weather. I really liked the stay at this hotel and would recommend it to others who are transiting through Madrid or even for a several night stay.", "title": "Very nice motel.", "user": "2dogsAtlanta", "date": "April 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61285542}, {"rating": 4.0, "title": "Gorgeous Hotel but overpriced & too \"Corporate\" American", "text": "We were thrilled to have such a great place to stay the night before catching our flight home to the states. Spain had treated us right & although we loved our vacation, we were ready to go home. The Hilton staff was friendly, helpful, and welcoming. It was nice to be at a place that melded our European experience with some little reminders of travel in America. Unfortunately, those reminders turned into corporate gouging when we had to pay $8 for a cerveza & $14 for a glass of sangria! It ended up costing us more to stay at the Hilton on our way out of town (for less than 12 hours of time there) then it did staying 1 night at a beautiful palace in Sevilla earlier in our trip (Hotel Palacio De Villapanes)! That seems crazy & woefully American. Aside from that annoyance, it truly is a comfortable & well appointed hotel that would be agreeable to anyone willing to spend the money.", "user": "A TripAdvisor user", "date": "April 12, 2010", "id": 61108090}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My girlfriend and I stayed at the Hilton for 2 nights in November 2009. We were looking for a hotel close to the airport given our flight schedules. Our expectations were low. We didn't realize that the hotel had been recently developed and opened. We were extremely surprised by our experience.", "title": "Surprisingly nice and modern hotel", "user": "mishka1809", "date": "April 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 60658055}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "Starting from check-in, the front desk staff was extremely professional and helpful. Check-in was relatively problem free. Once we arrived in our room, we were shocked by how large and clean our standard room was. The bathroom was quite large and clean. The tub had ample room for two. The water pressure in the shower was wonderful. Our bed was extremely comfortable. Did I mention how clean the room was?", "title": "Pricy but Good Quality", "helpfulness": 1, "user": "koba-sf", "date": "March 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 59762372}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We ordered room service during our stay. We found the food to be satisfactory. The delivery was timely. I was able to utilize high-speed internet services with no difficulty. Although located close to the freeway, we did not hear any noise.", "title": "great hotel, but not close to Madrid sights", "user": "stlouistraveler007", "date": "March 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 59081465}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I stay at a lot of airport hotels, but this is one of the best. As a Hilton Diamond member we were upgraded to an Executive \"Relax\" room. It was one of the nicest rooms I have stayed in at any Hilton. Bathroom was great, with Jacuzzi tub being a nice treat after a long day of travel. Breakfast was included with our room, and was great; a huge selection of foods from around the world. Staff were very helpful and friendly. My only compaint is that the hallways are very dark. Searching for the Ice Machine was an adventure, and trying to figure out the key slot in the dark was no fun. Otherwise, a great hotel.", "title": "WOW", "user": "buoybell", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120075053}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "My family of four (2 young kids) stayed in the hotel on 3rd week of October because we were meeting friends the next day at the airport. We caught the shuttle service at T2 (located next to the regular bus stop, not so prominent though). We checked into 2 double rooms, located at the convention wing, which was very quiet. Decor and facilities were new, indoor swimming pool was nicely warmed, with LED lights switching colors, making it a beautiful sight. Pool has a sitting area right in the middle for resting while staying in water, water jet at each end for a quick massage. Been to several Hilton hotels before, but the spread in Madrid was different, due to quality of sausages and ham offered. Would recommend if you need a quality hotel for a good rest in Madrid. Only complaint was lack of free WIFI, a common issue in Europe. Taxi to city area ranges between 12 to 20 Euros.", "title": "Convenient place for a quick stopover", "user": "csh68", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120072065}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Having been here numerous time, I have to admit that over the year the overall quality is not what it used to be, the diner restaurant with large buffet and great selection of fresh product has now been replaced by an a la carte menu, expensive and below average.", "title": "Still very good, but no longer good value for money and let down by the restaurant.", "user": "MikePM", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119983637}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "The Executive lounge is average (see picture) indeed the drink selection is quite poor. The skimming pool is OK but not very suitable in Winter time (even indoor). Overall a good Hilton Hotel, with an excellent contemporary layout and stylish room, great and large bathroom nice fixtures and a decent kettle service, but it is becoming quite hard to find an affordable rate (anything g below 160€).", "title": "Good business class hotel", "user": "RichardB100", "date": "October 31, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 119980037}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "+ Very modern and contemporary hotel", "title": "Good choice for an airport layover", "user": "MenloMichael", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119972115}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We enjoyed our 3 day stay at the Madrid Hilton which offered a convenient free shuttle from and back to the airport upon our departure. The hotel was clean and modern, was staffed with very friendly and helpful employees, and with my Hilton rewards membership, we were upgraded to the executive floors with access to the private lounge which offered snacks, beverages, and internet access. Our room also included the extensive breakfast buffet offered in the hotel restaurant each morning. The room itself was modern and had a very large bathroom by European standards.", "title": "Great Hotel - near the airport", "user": "Dafsmum", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58896901}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "While the hotel is not near the downtown area, it was an easy (approximately 10 minute) walk to the metro station. The hotel also offered periodic shuttles to the bull-fighting museum from which one could grab the metro from that location in order to avoid the walk to the nearest metro station from the hotel.", "title": "One of the nicest Airport Hotels I have ever seen", "user": "caricature", "date": "March 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58651415}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "If you like your hotel to be in the heart of the action, this hotel is not for you. But we were not inconvenienced at all by taking the metro in and out of the city during our stay in Madrid.", "title": "Unacceptably long wait for the courtesy bus.", "user": "misstic", "date": "March 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 58025270}, {"rating": 4.0, "stay_parameters": "Stayed February 2010", "text": "The Good", "title": "My mother and I stayed here on layover...", "user": "mrslauer", "date": "February 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 57315014}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "I chose this hotel based on the reviews on Tripadvisor. I had a long layover in Madrid so I had to stay overnight but didn't feel like going all the way downtown.", "title": "truely 5 star hotel", "user": "shoshosho", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56805324}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Service was good and room was clean. Executive floor lounge was just \"ok\" though. Overall it was a nice stay though.", "title": "Impressive", "user": "Tb H", "date": "October 31, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 119949726}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "I expected more from this Hilton given the glowing reviews, but this is a typical Hilton, just more modern. The staff are polite and the rooms are clean, but there is nothing memorable about it. Internet access is 22€ and breakfast is extra as well. Opt for another well-reviewed European hotel close to the airport with free Internet and breakfast.", "title": "Ok, but there are better close to the Madrid airport", "user": "Dianeinsf", "date": "October 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119867517}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Stayed here for one night because it was near the airport and we had an early flight the next day. They have a free shuttle to the airport which is very convenient. The hotel is very nice with very nice rooms (reminded me of a W hotel). Very expensive breakfast (26 euros per person or 20 if you pay the night before), expensive internet (they offered me free internet if I paid for the breakfast). There is nothing near the hotel and you need to get a taxi to get anywhere. I believe you cannot walk to the metro station because their is a major highway between the hotel and the metro station. It is a good hotel to stay if you are flying early the next day. I used my reward points to stay here for free.", "title": "Nice hotel, but away from everything, except the airport", "user": "czapata", "date": "October 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 119731643}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "PRO...VERY PRO: Room and bathroom decor. Breakfast buffet selection. Dinner in the restaurant WAS ONE OF THE TASTIEST, WELL-PRESENTED, & GRACIOUSLY SERVED we had in Spain. Convenience to airport via free shuttle. Nice pool and adequate fitness facility.", "title": "Go Out In Style", "user": "SALMD", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119675082}, {"rating": 4.0, "title": "Comfortable stay, consider if \"rejuvenation room\" is right for you", "text": "Average: Front Desk staff inconsistently informative, attentive.", "user": "A TripAdvisor user", "date": "October 20, 2011", "id": 119524911}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed the night before our flight home from a two week Spanish vacation. Our cab driver had a hard time getting off the freeway and around to the hotel - then dropped us off at the conference center! We ended up pulling our luggage up the hill to the Hilton - but it wasn't a very long walk. The airport Hilton is ultra modern. We had a large upgraded room and found everything quite comfortable. There really isn't anything around the hotel so we ate dinner in the restaurant. It was nothing special and expensive but convenient. There was a large selection for the breakfast buffet. The shuttle to the airport was reliable and quick. A very nice stay for an airport hotel.", "title": "Modern Upscale Hotel", "user": "DFHS", "date": "May 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 65661574}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We selected the Hilton Madrid Airport for an overnight stay before our flight home from Madrid. I was concerned because some reviews said that taxi drivers had trouble finding the hotel, but the one who picked us up at the train station knew where it was and didn't even need to use his GPS.", "title": "Stylish but hard to live in it", "user": "AThena53", "date": "May 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 64945892}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We were on a Reward stay but, as is typical of Hilton's gracious treatment of guests on reward stays at its European properties, we were upgraded to a room on the Executive floor with lounge access. The lounge actually had a better selection of evening food than the one at the Hilton Diagonal Mar in Barcelona where we'd just been, with a friendly young trainee named Pierre working hard to anticipate everyone's needs and offer refills and extra food. The breakfast offerings in the lounge were slimmer than in Barcelona; mostly breads and cereals. Free breakfast in the restaurant was also available so we chose that. It was fine- the usual breads, cheeses, meats as well as hot items. The lounge had 2 computers with free Internet access. Connection in the room was expensive so I didn't bother with it.", "title": "Excellent contemporary hotel outside city center", "user": "cstratton14", "date": "May 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64078257}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I loved the pool- it had a moveable roof over both the pool and sundeck so that the extent of coverage could vary with the outdoor temperature.", "title": "Great hotel near airport", "user": "TLNewYork", "date": "May 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 63607089}, {"rating": 4.0, "title": "Great hotel", "text": "Ah, but then there's the bad news. They appear to have given some interior designer carte blanche to make the rooms stylish without any notion as to how it would work when actual humans lived in them. The floors in the bathroom, including the shower, were so slick when wet that we put down towels because my husband has a bit of a balance problem. The walls are frosted glass. This means that if you turn on the light when you use it at night you risk disturbing the sleep of the other room occupant. This might cause one to (theoretically, of", "user": "hobbyistravel", "date": "May 7, 2010", "id": 63489366}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The hotel is beautiful! With glass elevators, hallways that are open and all look down to the lobby area below, and dark modern rooms the Hilton is very pleasing to the eye. We were upgraded to a nice corner room, with a rainfall shower, and whirl pool tub.", "title": "Great for Stopping By", "user": "MaritimeExplorers", "date": "May 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 62967798}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "We were there for less than a 24 hour period, so the location was perfect, a quick cab or free shuttle ride to the airport. However beware, if you are coming to Madrid for any extended period of time, there is nothing in this area of town except the airport itself. We also enjoyed the breakfast (which was complimentary, Hilton preferred guests).", "title": "Wow", "user": "Mewsic", "date": "April 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 62389302}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "All in all it was a great stay, and I would definitely recommend staying here.", "title": "Such a great experience, worth the drive into Madrid city center", "user": "jslwest", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 62356179}, {"rating": 4.0, "title": "Great hotel - quite a distance from the city", "text": "Spectacular hotel. New and beautifully designed. My room was well-laid out, well-lit, very clean. I stayed here only because of a 12 hour layover in Madrid, but it was a nice experience. Gorgeous, fully equipped bathroom with a shower AND a tub. The bed was comfortable and even though the room looked out onto a highway and was very close to the airport, when the windows were closed it was very quiet. The food was quite good, too. However, I put a room service breakfast hang tag on my door in the evening for breakfast the next morning and no one came to pick it up. Fortunately, I checked the door in the morning (having learned from other experiences) and saw they hadn't picked it up, so called room service. Also, the room was a smoking room even though I had requested a non-smoking one. Fortunately, a couple of hours with the windows open and max air circulation, most of the odor disappeared. As for the location (a 5-minute free shuttle ride from the airport), I don't know how easy it would be to get into the city from here, but I suspect that the location of this hotel would not be ideal for tourists. And even though it's a great hotel in many ways, it could be anywhere. There was little about it that told me I was outside the US, let along in Spain.", "user": "dmarrs4", "date": "April 22, 2010", "id": 62163827}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I have stayed at this hotel several times on business trips to Madrid. I have stayed at hotels in the city center, as well. However, because I am so very impressed with the staff and service at this hotel, I prefer to stay here. The front desk staff is friendly and attentive. The lounge staff is always there to help. The food in the restaurant is great. Drinks at the bar may take a little longer than most, but it is only because the bar staff takes extra care to ensure your drink is perfect. I have stayed at a lot of hotels and a lot of Hiltons and this one is the best because of the people who work there. I highly recommend this hotel and prefer not to stay anywhere else when in Madrid.", "title": "Better than average hotel airport experience", "user": "Lanie54", "date": "April 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 62115128}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed in room 421 of this hotel for one night; two weeks later we stayed in another room on the same floor. It is close to the airport but I would not stay here and try to sight-see in Madrid, you’re just too far away (the taxi ride from the train station in downtown Madrid to here was about 22E including tip).", "title": "Not For The Shy", "user": "travelman1370", "date": "November 6, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120246284}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "The hotel is ultra modern in design and you’ll either love it or hate it. There are two towers and all rooms appear to open off the atriums. Our room was smallish but they manage to fit in a desk and an easy chair; the space is extremely well used. The bed was a queen size. Check-in was efficient and polite both times.", "title": "Convenient to airport and that's it", "helpfulness": 1, "user": "george01", "date": "November 4, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 120167795}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Things to keep in mind: first, this is evidently a conference center type of hotel. When the conference groups have dinner in the atrium you may hear some noise from that (not much but it’s there). If there are conference groups at the hotel you may also find that they have mobbed some of the facilities (this was the case our first night there).", "title": "Best Airport Hotel", "user": "traveler10071", "date": "November 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120147428}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Another thing to keep in mind is that the room is ultra modern meets industrial in design. Our bathroom was enclosed in fogged glass panels. The toilet is behind another set of fogged glass panels. I wouldn’t want to share this room with someone that I wasn’t really comfortable with as there is little left to the imagination. The sliding glass panel doors don’t completely close all the way by design so you’re never going to have real privacy.", "title": "Clueless Concierge and poor HHonors Diamond service", "helpfulness": 3, "user": "FrequentFrank", "date": "November 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120130000}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "The room has an adequate amount of storage. Everything you’ll need is here, including a kettle and a bedside clock (unusual in Spain based on my experience). Once the sun set our AC seemed to make progress on cooling down the room; the room get the brutal afternoon sun this time of year and really heats up.", "title": "Beautiful, great staff. Why can't it be downtown?", "user": "ChicagoAlli", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 120127708}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We had a layover in Madrid and needed to spend the night. When it comes to European hotels, it's often best to stay with a chain because you know what you're going to get. We had a great room on the 7th floor. Not much for a view in that area, but it was meticulously decorated with a very modern feel. The staff were all very helpful and seem to speak several languages. Shuttle service comes around every 25 minutes. The only reason this hotel didn't get 5 stars is because of a mix up at check out. It seems if you need the shuttle at 5AM that you need to reserve it as it starts regular rounds at 6. I had to shell out EUR 25 for a taxi to go 7 minutes. Annoying, but it certainly wouldn't be a reason for me to not sing the praises of this hotel.", "title": "Great hotel and low cost for a Hilton.", "user": "Ferinha", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119370897}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Spent one night here whilst on lay-over. Hotle is very nice. Front desk was very good, a young man at reception was very helpfull, thank you . Room was more set up for bussiness, more so than vacation, and based on the location (by the airport, duh) would be perfect for its intended use. Be expected to pay 23 euro for a hamburger from the restaurant. Also, do not expect good service from the bar. We waited in the lounge for over 1/2 hour just to have our drink order taken. The restaurant girl finally came over (very nice, and apologetic) and took our order. She also brought our drinks and food when it was ready. I should state that the bar/lounge only had six patrons, it was not busy. The only time the bar waiter showed any intrest was when it was time to present the bill, 72 euro. Knowing that the restaurant girl would NOT recieve the tip, there was no tip given. We are Canadian, and we show great service with tipping. This would be our only negative remark. Would I stay here again?, Yes, yes I would. Read the other reviews, they are similiar to ours..", "title": "Only one night here", "user": "cheezewiz", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119355691}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Stayed for on 10/14. Airport shuttle picked us up after 10 min wait. There are 4 airport pickup points and every 20 monutes appeared accurate. Shuttle took 15 min to go about 2-3 miles as they visit all stops before taking you to the hotel. Hotel is in the middle of nowhere in terms of walking. Check in was fast and room was nice sized, new, comfortable bed, 40\" flat screen, cable, all very nice like the pics. I used 30K hilton points and felt it was a good value. The bad news- internet 10 Euro/hr or 22 Euro/for 24 hrs! There was a breakfast buffet for 26 Euro/person. IF ordered the day before, breakfast + internet was 20 Euro. You can walk to the \"alameda\" metro stop, about 1/2 mile and pay only 1 Euro to ride the metro into the city center \"Opera\" or \"Sol\" stop in about 35 minutes. Safe area to walk to and from metro and the front desk provided an easy to follow map. Would stay again.", "title": "Excellent but pricey extras if you are not on an expense report", "user": "ukier", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 119300811}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "October 2011: Nice Hilton hotel with modern hotel features (especially the bathroom). Nice pool, nice rooms, friendly staff. Bar and restaurant didn't have what I would consider a great selection of food but rather expensive...Very close to the airport with free shuttle service. Would probably stay there again.", "title": "Nice hotel close to the airport_Madrid", "helpfulness": 1, "user": "Bazilu25", "date": "October 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119214648}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Great Hotel, Airport Shuttle, Fantastic breakfast.", "title": "Great Hotel", "user": "bentdavi", "date": "October 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119053450}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 5, "variance": {"poor": 30, "average": 123, "very good": 369, "terrible": 14, "excellent": 535}, "aka": "Hilton Madrid Airport Hotel Madrid", "slim_ranking": 0.105032822757, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 3.5}, "description": "The stylish Hilton Madrid Airport hotel is just minutes from Madrid Barajas International Airport and the bustling cosmopolitan city of Madrid. Take advantage of the complimentary shuttle service to and from the airport and stops at attractions or use the nearby Metro station as your link to the city of Madrid.Indulge in a fantastic selection of rooms at this Madrid hotel which include impressive marble bathrooms, flat-screen LCD or plasma TVs and wireless internet access. Guest rooms feature heated floors and floor-to-ceiling windows. Executive, deluxe and relaxation rooms offer complimentary access to the Executive Lounge. Enjoy a suite that offers a separate living room and fluffy bathrobes for your comfort and convenience. Refresh with a swim in the hydrotherapeutic pool and exercise in the fully equipped fitness center.Consider the self-contained Convention Center located in the North Tower of the Hilton Madrid Airport for business conferences, celebrations and stylish Madrid weddings. Host up to 450 guests in space that includes a board room and elegant ballroom, making this Madrid airport hotel an ideal location.Savor sumptuous Mediterranean cuisine in the Reserva Grill Restaurant and enjoy tantalizing tapas and a glass of Rioja in the Ferrum Bar."}