{"user_rating": 4.0, "review_count": 561, "name": "Hilton Lyon", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "While not in the city's center, this hotel is in a pleasant location between a large park and the Rhone river.", "title": "very good hotel", "user": "kwc196", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77255808}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Make sure to get an outer room with view on either, as the standard rooms overlook a courtyard; the upgrade is well worth it on nicer days, as the carpeted balconies (with powered transparent louvers to, I suppose, keep pigeons out and let fresh air in) offer a nice respite after a long day's work or sightseeing, almost like a veranda.", "title": "Excellent, but sterile", "user": "MissMeIreland", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 76860340}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The room themselves are modern, quite spacious, comfortable, and to the expected standard in this class.", "title": "Good overnight stop", "user": "timwalker101", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76457288}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I found the executive lounge's food quality and atmosphere to be above average.", "title": "Fantastic Hotel and Rooftop Jacuzzi", "user": "gregorw", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75415227}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Staff at this hotel is courteous and competent.", "title": "Great Stopover Hotel", "user": "SimonFrmLondon", "date": "August 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 74777049}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I stayed here for one night with my fiancé, and was very impressed. The toiletries were very nice (Crabtree and Evelyn), the bed was comfortable, and the bathroom was spacious (with a very large tub!). The staff were very friendly and helpful. The only problem I had with the hotel was the internet prices. 10€/hour, or 22€/day!!! Most cheaper hotels have free, high-speed internet, so it seems counter-intuitive that a more expensive hotel would charge so much for internet use. The hotel is in a nice location, right by the Parc de la Tête d'Or. It is a bit far from the main part of the city, about ±4km, but there is a bit right outside the hotel (line 58) which goes directly to Bellecour (line 58 - at Musée d'art contemporain, right behind the hotel, goes to the city center). Tip: the day tickets for the public transportation (un jour - 4,70€) are only for that particular day, and don't last for 24 hours. Taxi to the hotel is extremely expensive, it was 60€ for us on the way there. On the way back, we used the bus (line C1 from 'Musée d'art contemporain') and an airport shuttle (6,70€ for young people). In August, however, the metro will have a stop at the airport (one way on the metro is 1,60€).", "title": "Very nice and clean hotel", "user": "palypat", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72357048}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Hilton Lyon is situated slightly on the outskirts of the city centre, but that's a plus if you're arriving by car. We drove from Bordeaux, found our way easily and were valet parked upon arrival. It's only a short taxi ride to anything which is happening in Lyon, and there is the fabulous Parc de la Tete d'Or on your doorstep. We asked for a room with the best view, and instead of overlooking the Rhone as expected, we were given a spacious room with balcony overlooking the Parc and its lakes - and it was indeed a very beautiful view. We reserved a larger room on the Executive floor with access to the lounge overlooking the river. We left the balcony door open for natural ventilation but found it a little noisy at night when people left nearby restaurants, though this was not a major problem. The other reason we'd chosen to stay at the Hilton is that it's part of Renzo Piano's huge complex, and having stayed at the Meridien in Torino which is also his design, we wanted to compare the two. It was a short stay for business, so we didn't have time to sample the restaurants, but it's a thumbs up for location and service. Pricey, but worth it.", "title": "Arriving in Lyon by car? Stay here.", "user": "DrivenByTheFourWinds", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 72352140}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The hotel may have changed as we stayed there over a year ago, but it was a complete disappoinment because of bad management and very erratic service. We had to ask almost always twice to get anything done and with the exception of very few staff the rest did not care and looked disinterested. The food was ok but below average. Overall I cannot recommend it.", "title": "Disappointing", "helpfulness": 2, "user": "kj-reviews", "date": "July 24, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72170486}, {"rating": 5.0, "title": "as much a resort as a business hotel", "text": "This hilton is located next to a spectaular park with its own zoo. A stay here opens up access to this lovely park. The service and amenities are efficient bordering on elegant.", "user": "s2000imp", "date": "July 20, 2010", "id": 71652735}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "It was the third time we staid at the Hilton in Lyon. The hotel is located next to the conference centre and museum of contemporary art, just outside the city center but with a very good bus connection to all parts of Lyon just outside the hotel. The hotel is focussed on the business traveller but also the tourist is accepted with the same service and is not treated differently as it can happens sometimes in Hotels. The executive rooms have a correct size. the service in the executive lounge is good, although the quality of drinks and appetisers are a bit less then the previous years. Probably the crisis did his work there also, but it was still ok. The staff is friendly and very helpful. Although the best restaurants we found on tripadvisor, we not always known by them. So I would not ask them for advice on picking a restaurant. The spa and fitness are not that big, but bigger than in most hotels and a nice with with a view on the river. But for the rest, we will go back there, as we stay usually once a year in Lyon.", "title": "very good hotel with some nice price deals", "user": "Lierke", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 70462425}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Although the weather was quite cold we didn't have any rain and that helped us to see the lighting events. The whole festival was beautiful and very well organized. The hotel was perfect. Very clean and in perfect condition. The staff was very helpful also.", "title": "Lyon - Fetes des Lumieres", "user": "KOULA_1968", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89978895}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Locating this hotel on the Lyon map it appears to be quite a bit out-of city center (and many hotels with locations like that really ARE `out` of everywhere). Quite suprizingly, this one is not : trolleybus, and regular bus right infont of the hotel connects very easily and frequently, until late night/early morning and at (almost) no cost with the heart of the city. The big park across from the hotel on one side (great for moning jogging rounds around the lake), and the Rhone on the other I can`t even recommend a `preferential` side of the buidling for the views - just nice both sides. Located in a prize-winning piece of architecture it has a few pubs, bars, shopping facilties right in it /next to it. (if you REALLY dont want to go out any more), and the nice gym on the top-floor (jacuzzi with fantastic Rhone-views ) could add to this (not wanting to go out).", "title": "great hotel and great location (even though location doesn`t seem that way)", "user": "antan", "date": "December 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89362190}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "But Lyon is too good to miss-out. I tried the lounge, and the only `draw-back` I felt: this is is a bit `stingy`: free drinks, (ok), but really limited hours for the cocktails, and not really any food (just some peanuts and dips - I have seen MUCH greater lounges in Hilton hotels). Still, and again, this great view (with terraces to sit outsid in summers) over the Rhone is fantastic.", "title": "Try the Citie Hotel instead", "helpfulness": 2, "user": "ninetyfivekilos", "date": "October 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 85200748}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Next time in Lyon I will definitely stay again , also because I found it a surprizing value-for-money (110 Euros I paid for a full 5 star facility).", "title": "Very nice hotel, great staff and very accommodating for families", "user": "Familia09", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81586956}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Average hotel. Average service. The slowest internet access I have experienced in 3 continents - unacceptable. Please try another hotel rather than stay here.b", "title": "Very good hotel", "helpfulness": 1, "user": "Happydutchman", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81022874}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "I stayed there during an Interpol meeting. From colleague's recommendations, I had heard that it was not the best deal to be had but since I had spent time in hospital and had not yet fully recovered, I thought it would be a safe choice: walking distance to Interpol, high standards of accommodation and service. However, my stay turned out to be a momentous nightmare- for service, it was among the worst ever experienced- check in took over an hour ( they did apologize) and none of the services worked. When I had to change rooms, I had to ask twice to get the luggage moved, dry cleaning was not picked up and returned late (no explanation), room service came without a bill etc. Staff is badly trained and has attitude and cannot be depended on- even calling a taxi is too much to ask. The shower in my room was a trickle, the toiletries unremarkable, however, the bed and the towels are of the usual above average Hilton quality. Internet access is ridiculously expensive. In short, the hotel is not worth its price and if you can avoid staying there do so.", "title": "For poor service, this is the place to be", "helpfulness": 5, "user": "grumpyguest", "date": "February 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 97909283}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed here after finding a very good rate in travelsupermarket at the last minute. The hotel is very comfortable and is a fine choice if your staying in Lyon. It is a little distance from the old town, but transport is very easy and not expensive. For us it was all a little clinical, but we did expect that before we arrived. We had a nice meal in the hotels Thai restaurant although it was not cheap. 15 euros for two bottles of beer, 7 for water, but i guess you expect that in a city hotel these days. Breakfast was as you would expect at Hilton. My only real complaint was the maid who was making an incredible amount of noise in the corridor first thing in the morning. Parking was 17 euros a night. We would stay here again.", "title": "Every inch a business hotel", "user": "ronandkristin", "date": "January 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 94188719}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Well another example of a very good Hilton Hotel. Overall the building is nice and modern next to the Europolice building and facing the Saone on one side and Lyon's biggest public park on the other side, the actual building is touching The museum of modern art.", "title": "Excellent, nice location, great public transport and very good value for money!", "user": "MikePM", "date": "January 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 92449748}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Overall the service is good, we had the executive room, with a private terrace and a nice view over the park.", "title": "Better than i Expected", "helpfulness": 1, "user": "mrosen94", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91497016}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "The executive lounge is excellent, with a nice and cosy atmosphere, with various tables, a TV/Sofa area and a decent selection of books, newspaper but a very poor selection of magazine.", "title": "Sipping espresso looking at the Rhone!", "user": "LemonTBrooklyn_Ny", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91163257}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "stars": 4, "variance": {"poor": 33, "average": 78, "very good": 238, "terrible": 9, "excellent": 203}, "aka": "Hilton Lyon Hotel Lyon", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Business-oriented 8-story Hotel, an integral part of Cite Internationale, located in the city center overlooking the Rhone River."}