{"user_rating": 4.0, "review_count": 259, "name": "Hilton Concord", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I have been staying at the Concord HIlton for serveral years. Over the course of this time I have had nothing but the best treatment. The staff at check in are always friendly, and mostly remember my name. When I call for reservations, I am always treated with courtsey and helped in a very timely manner.", "title": "Excellent Service/", "user": "bsgnorcal", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59278654}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I choose to stay at this hotel, even if I could stay at one that is closer to my business meetings. I choose this hotel for myself when traveling alone and also when I travel with collegues. My collegues now stay at this hotel when they are traveling in the East Bay area also.", "title": "Worn and grubby, poor natural light, $11 wireless, no bedside power outlets", "user": "zippy47", "date": "February 24, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 1.0, "location": 2.0}, "id": 56973865}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I am embarrassed that it has taken me this long to send in a positive review.", "title": "Much better hotels nearby... I checked out early and switched.", "user": "Dingo21Illinois", "date": "January 29, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 54680775}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "It's rare that I find hair on the towels in a Hilton. Nor do I expect stained carpet so worn that it's developed visible buckles. Nor do I expect the bed linens to have holes in them. Add to that an unexplained odor of sewage in the room and a toilet that kept running, and I conclude this Hilton is a bad apple.", "title": "nice hotel", "user": "kiwijoy", "date": "January 21, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54048134}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Good things: digital thermostat, convenient power outlets at the desk, down duvets and natural fiber pillows. I slept well enough.", "title": "conc hilton", "user": "ragsnyc", "date": "December 23, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 51771494}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "THE GOOD:", "title": "Average Hotel - Great Location", "user": "EugeneLA", "date": "May 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30569211}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "-Location right near freeway.", "title": "The good, the bad, and the lack of heat lamps", "user": "sweetmotherofmercy", "date": "March 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 25905872}, {"rating": 4.0, "stay_parameters": "Stayed March 2009", "text": "-Friendly staff.", "title": "Very nice experience", "user": "chesstravel", "date": "March 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25860528}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "-Great restaurant inside.", "title": "Great value thanks to Priceline!", "user": "ak2id", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23787933, "likes": {"liked": "— Clean, Quiet and lovely.", "disliked": "— The lame practice of being charged for use of the computer in the business center."}}, {"rating": 1.0, "title": "Stay Away!!", "text": "-Wide variety of good (chain) restaurants in walking distance (including Elephant Bar, Denny's, Claim Jumper, Panera, Fuddruckers).", "helpfulness": 2, "user": "missnicey", "date": "December 17, 2008", "id": 22820481}, {"rating": 2.0, "title": "Check your charges after you get home", "text": "We were charged for Internet that was supposed to be complimentary in the executive room we booked. When we brought it to their attention at check-out, they stated that it was removed from the bill and issued us a new receipt. However, 2 days later, I found that they had charged back against my credit card as a separate charge. If this is how they treat their Hilton Honors guests, cannot imagine how they treat someone who isn't a member.", "user": "MM_TT", "date": "October 7, 2009", "id": 46107582}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Thankfully we only needed to stay one night here. I made reservations for a room with 2 queen beds, and because there were 5 of us, one that could have a trundle bed. When we checked in we were told rooms with 2 beds could not have a trundle because it was a fire hazard. However, there was plenty of room for a trundle. The carpet in our room was absolutely filthy and the room smelled like urine. One good thing however ~ our daughter left her blankie behind and someone from housekeeping went up to the room to verify it was there and took it to the front desk so we could pick it up (we hadn't gotten too far before she realized she'd left it behind) We will not ever stay here again.", "title": "Will NOT ever stay here again", "user": "mcwilson40", "date": "September 7, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "service": 1.0}, "id": 40059928}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Enjoyed the hotel very much. Felt safe there. Parking was excellent. Location very good.", "title": "Good value", "user": "hapytraveler10", "date": "August 16, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 37866062}, {"rating": 4.0, "title": "Nice stay", "text": "We spent one night at the Concord Hilton on 07/09/09. My daughter was attending a concert at the Concord Pavilion and the Hilton seemed to be the best hotel to choose in the area, but still a bit of a drive. Check in was fast and friendly. Rooms are your standard Hilton fare with comfortable beds and pillows. Room service available, but somewhat limited. Several restaurants within a short drive. There was a small shopping complex across the street and a larger mall a 5 minute drive away.", "user": "duttydad", "date": "August 15, 2009", "id": 37786827}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Good location, everything is what you would expect from a Hilton, friendly staff. We would stay here again if in the area.", "title": "Executive level nice for long stay", "user": "Lee4Vaca", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 33029658}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The hotel staff is very friendly and efficient, but the room, especially the bathroom could use some updates. I think the housekeeping staff is doing their best, but they can only do so much with wear and tare from the years of use.", "title": "Average Hilton. Maybe not the best choice for the price", "user": "Fortwood", "date": "March 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 59614788}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I was disappointed by the complimentary services (snack, drink and breakfast) in the gold/platinum member lounge. The room itself was very small and selection of food was very poor compared to the other Hilton hotels I have been to.", "title": "Class, Style, & Comfort. Perfect place to relax at the end of the day!", "user": "NCHT", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59596483}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The hotel is conveniently located near the exit off the interstate, and there is a shopping center with several restaurants across the street.", "title": "A great hotel with friendly people who treat you right.", "user": "luckylll", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59291903}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I travel frequently for my job and have stayed in many different hotels. When I travel to Concord, I always choose the Hilton on Diamond Blvd. The service is exceptional! They always use my name and make my experience very personal, as if I am part of their family! The check-in and check-out experience is quick, thorough, and accurate. The rooms are spacious, very neat and clean, the towels are fluffly, the beds are perfect with luxurious linens, and the housekeeping staff consistently does an excellent job. The staff is very responsive to any needs or requests, and always with a smile! The restaurant and room service are excellent as well, I have yet to be dissappointed. It is in a great location, near the freeway, and right next to plenty of other restaurants and shopping, including a mall, yet the hotel remains very quiet and relaxing. I will continue to stay here for my monthly trips to Concord and recommend my friends and coworkers as well!", "title": "Excellent Staff", "user": "FrequentAZTraveler", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59287680}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I stay at this hotel often and love the place. Clean rooms, great location, within walking distance of many places to eat, drink and shop. The beds are the best as I always get a good night sleep there but, it is the people who make the place. I always get a warm welcome and a friendly smile. Somehow they just make you feel special. Give them a try.", "title": "Nice place to stay in Concord", "user": "egjim", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 59285688}], "location": {"country": "United States", "city": "Concord"}, "stars": 3.5, "variance": {"poor": 17, "average": 30, "very good": 89, "terrible": 14, "excellent": 109}, "aka": "Hilton Concord Hotel Concord", "slim_ranking": 0.125, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Hilton Concord is ideally located in San Francisco's East Bay making this hotel a great choice if you want to be near Walnut Creek and the neighboring Diablo Valley communities. Hilton Concord is minutes from the Concord BART station and provides free shuttle service round trip for our guests to BART. BART is an Eco-friendly & convenient way to get to San Francisco & Oakland airports, San Francisco City Center, Oakland, and numerous other Bay Area Destinations. Hilton Concord was completely renovated in 2012, so it's truly an amazing hotel! Featuring a beautiful lobby, fire-pit courtyard, technology lounge, outdoor pool & hot tub, Precor Fitness Center, Plate & Vine Restaurant, and crisp contemporary new guestrooms. Looking to upgrade? The hotel also has PURE™ allergy-friendly rooms and Executive Level guestrooms available for the most discriminating travelers. Hilton Concord has modern hi-tech meeting and banquet space. Host your next conference or reception in the Golden Gate Ballroom, which accommodates up to 950 guests in a beautiful and elegant setting. The Food & Beverage at Hilton Concord is incredibly good! Hilton Concord is a great place for a conference, family reunion, wedding, or any special event.In summary, Hilton Concord is a fantastic full-service hotel in a great location. The service, food, beverage, and amenities make the Hilton Concord the best hotel in the area!"}