{"user_rating": 4.0, "review_count": 267, "name": "Hilton Shreveport", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I recently held a meeting in Shreveport at the Hilton. I host meetings at facilities often and I utilize the HIlton Properties every time I possibly can... This hotel provide very mixed emotions for me. The rooms were very nice and clean and the meeting room, which I was in the board room, was very nice. The cost of the hotel rooms were in alignment with the area as well as the meeting space however I experienced many frustrations at the hotel. The service was terrible from several departments to include the front desk, the catering department and the catering and events manager. The employees at the hotel front desk were very unfriendly and unwillingy to help and would not let my group into the meeting space early to work since the event did not begin until noon however we were being charged for the entire day. This was reactified via a complaint however never should have taken place...The dining and catering group were awful, however the food quality was good. While hosting the event, I had lunch catered for the group and did not have a good experience. The individuals bringing the food back and forth where very disruptive, slamming doors, reaching across the table and talking as I was presenting material to the point I asked them not to come back until they were requested during a break. The events and catering manager was very uncooperative, unfriendly and unengaged to the success of the meeting and the facilities. I also was charged $400 to get a projector for the powerpoint presentation, which was unfathomable for a charge. The entire experience, for a Diamond Member, and loyal Hilton costomer was very disheartening. I would end by stating that if you are in the area, the Hilton is a very nice hotel to stay with poor service however the catering and events department should deter you from hosting an event.", "title": "Review of Hotel and Events Department", "user": "Johnathanwb", "date": "July 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 71950641}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "Went to Shreveport for a wedding, and didn't want to stay at a casino. The hotel offers free transportation to any locale within 2 miles of the hotel, plus a ride to the airport. And, they'll give you a phone number to call to come and get picked up - so there's no need to get a cab if you are somewhere downtown. The fitness center was great - except that not all of the machines worked...but that may have been operator error. The pool was also really nice. I would strongly recommend this to anyone for any reason - solo travel, family, or business.", "title": "Great hotel - plenty of room and easy to get to any place necessary", "user": "eknott45", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68543362}, {"rating": 1.0, "title": "No Hospitality Here-", "text": "I had 3 rooms booked for 2 nights with colleagues. I am Diamond with Hilton and have been for 4+ years. I called Hilton 800 number to trim the reservation back to 1 night (still 3 rooms). I was informed that this HIlton property decided to enforce a secret \"2 night minimum\" that was not stated anywhere in my confirmation. The hotel refused to honor my request, and I had to stay elsewhere. The prudent manager, with intentions of full disclosure, should have a caveat placed on the webpage prior to booking that \"any changes in this reservation may not be able to be honored due to a 2 night minimum stay\". In my opinion, this hotel should be avoided unless you are prepared to ask questions that you might not ask anywhere else.", "helpfulness": 2, "user": "jp6438", "date": "June 4, 2010", "id": 66420960}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The room itself was very standard. Lackluster. My Hilton honors preferences totally ignored. Bored check in guy. Sticky remote. Too soft bed. Whatever. The River Rock Restaurant was the worst. The service was so bad...actually non existent that I left. The thing that got me the most was the flowers at each table. DEAD. All of them. Mine was just a stem. I mean come on Hilton.", "title": "Attention to detail derailed", "user": "kambachad", "date": "May 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 64136596}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I stayed at the Shreveport Hilton for five nights while attending a \"hobby\" convention. The room was excellent - clean and well appointed. The staff were very friendly and helpful. I ate in the restaurant four times. Service was good, food was good, and prices were usual hotel prices. All in all a good stay.", "title": "Good Stay", "user": "OmahaNEOmaha", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 63083431}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Was a last minute check in due to my terrible experience at The Holiday Inn Shreveport (Downtown), The front desk person, Kenny checked me in no problem. He and the entire staff were wonderful! Will definately stay again.", "title": "Love it,Love it,Love it!!!!", "user": "Scoobydiva", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61031486}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I have stayed in many hotels throughout the country and this Hilton offers guests clean and comfortable accommodations. Attached to the Shreveport Convention Center, this hotel, while three years old, still looks brand new. Valet parking is $8/day; self-park is $3/day. No charge in/out privileges. Check-in was friendly, quick, and efficient. My room was on the fifth floor facing the Red River and the casinos. Ask for a higher floor for a better view. There is a railroad directly adjacent the hotel on the northwest side. I heard another guest complain about the train noise. I stayed two nights and did not hear a train. My room was standard, but nice. The granite countertops throughout has a nice touch to the room decor. Chairs are comfortable. My room did not have a refrigerator. Climate control system worked just fine. Bed was extremely comfortable; I did not experience any trouble with the sheets. Water temperature and pressure were fine. There is a nice bar off the lobby as well as a coffee shop. A restaurant is attached to the hotel; they have a great breakfast buffet which I highly recommend (for big breakfast eaters!). The Hilton is walking distance to the casinos on the Red River and the restaurants/shops on the Louisiana Boardwalk. I was frankly surprised on the empty storefronts along Market Street; otherwise, the area appears safe. The police presence in the Louisiana Boardwalk area is very noticeable. Many other nice Shreveport restaurants are along Line Avenue which require a taxi or car to get to. I would definitely stay here again.", "title": "A perfect choice for business travelers", "user": "Keystone_Traveler", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60602992}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Shower didn't work - maintenance came 5 times to fix it without success. No information about the hotel facilities. No TV channel guide.", "title": "A dump to be avoided at all costs", "user": "dfwmw", "date": "February 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 57386937}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We pulled up to the valet, and there was no attendant. The express check in didn't work. The person behind the counter at check-in talked to a friend standing at the counter for at least 10 minutes while we waited and he ignored us. Our parking/check-in problems were blown off as unimportant with no apologies. The Georgia football team was there for the Independence Bowl and we were treated like 2nd rate visitors. There were typical issues with a college football team...harassment of my wife-inappropriate comments, loitering on our floor. I ran track in college so I understand that this is not the fault of the hotel, it's just my opinion that teams should have their own floors, and other visitors should be separated from these areas. I called to ask for the shuttle to pick us up from where we were dropped off by the same shuttle, and I was told he would \"be there shortly\"-not a problem. After 20 minutes I called again, I was told the same thing. About 10 more minutes later I called again and was told by the woman at the front desk that it was \"not her problem\" after which I said to her that \"it may not personally be her problem but we are paying 150 dollars to stay 1 night in a hotel that she works for that claims to have shuttle service, then it is a problem that she needs to deal with\" at which point I was hung up on. I would expect Hilton Hotels to have much higher expectations for their staff than this. We have family in the area but will not stay at the Hilton Shreveport again. I've stayed at many Hiltons and not had an issue like this issue before, hopefully this isn't a problem with the corporate culture as opposed to this specific hotel.", "title": "worst hotel experience ever", "helpfulness": 2, "user": "acceber5445", "date": "January 2, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 52370700}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "I stayed at the Shreveport Hilton back in October and was pleasantly surprised at the cleanliness of the rooms and the lobby. The hallways were quiet in the evening and everything felt warm and comfortable. From my room I was only able to obtain weak, at best, cell phone reception though.", "title": "Clean and Quiet", "user": "dixierooster01", "date": "December 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50600326}, {"rating": 5.0, "title": "Nice Property....", "text": "It is difficult as a \"Yankee\" to come to Shreveport and remember that the culture is different here! NOBODY is in a hurry, so settle in and go with the flow. The property is lovely, I found a stain on my sheets and some dust on the headboard, besides that, the room was perfect. The check in was smooth, and everyone seems to be very kind here...", "user": "daisy20071960", "date": "April 6, 2011", "id": 103108965}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Thumbs up to Hilton in Shreveport LA!!!", "title": "0 phone service, great location", "user": "wick1979", "date": "March 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98847188}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "No phone service inside the hotel. I carry a Verizon for work and T-mobile for personal neither could get a decent signal inside the hotel. Love the inhouse starbucks, restaurant is decent but there are really no good restaurants in Shreveport. My group and I spent 11 nights at the hotel, in 5 rooms. Bar was good if you sat at the bar, floor service was horrible.", "title": "Room for improvement", "user": "NearRadwell", "date": "February 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 95437176}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "The hotel is a good location if you do not want to stay inside the casino's but want to be close to them, easy access on and off the highway. Will continue to stay here just hope the cell phone problem gets resolved some how.", "title": "Wireless phone connection", "user": "mhtoon", "date": "January 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "value": 3.0, "rooms": 5.0}, "id": 94093784}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Room's are big, and the bed is the most comfortable thing ever.", "title": "Pricey but very nice", "user": "partyboo", "date": "January 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 92666465}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "My sister and I stayed there while attending the 2010 Independence Bowl game. The guys at the front were a tremendous help to us. Being two senior women in an unfamiliar city, we didn't know our way around. Michael and Randall both helped guide us everywhere we needed to go (shopping, stadium, pep rally, how to get back home). They helped with our luggage and were very courteous and friendly. The front desk was not as friendly but was courteous. All the restaurant staff was friendly and professional as well. Our room was very clean and comfortable. Not noisy at all. We enjoyed our stay in Shreveport.", "title": "Nice stay at Shreveport Hilton!", "user": "GTSisters", "date": "December 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 90954864}, {"rating": 2.0, "title": "A lot of wrong and very little right", "text": "I've given the GM two weeks to respond to my private email complaint. Now it's fair game to publish publicly. I burned my finger badly on a room service plate. The enamel had chipped off the side, exposing the stone. I had to hold my finger in ice water for 4 hours until the pain went away. Granted, when the room service attendant delivered my food, he did say, \"The plate is kind of warm.\" Silly me. I took that to mean warm (which is what it was on the front side of the plate) - not stove burner red hot!", "user": "AprilOregon", "date": "October 25, 2010", "id": 84815065}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The shower had to run at least 10 minutes every morning until the water became luke warm enough to actually use.", "title": "Hilton was very clean and close to casino action", "user": "Wiebe_LM", "date": "October 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84006894}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "In the fitness room, half of the cardio machines were broken and were never fixed during my four-day stay.", "title": "Nice, very clean hotel, great mattress", "user": "USAtravelNC", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78021523}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Food on property was fair at best. Service in the restaurant was horrible.", "title": "A great place to stay if you're going to the casinos", "helpfulness": 1, "user": "czechchick1976", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77487949}], "location": {"country": "United States", "city": "Shreveport"}, "stars": 3.5, "variance": {"poor": 27, "average": 41, "very good": 93, "terrible": 15, "excellent": 91}, "aka": "Hilton Shreveport Hotel Shreveport", "slim_ranking": 0.277777777778, "description": "The Hilton Shreveport - contemporary comfort in the heart of Shreveport, Louisiana. Located just off I-20 downtown in Shreveport's Historic District, we are one of the premier places to stay for business or leisure. Our business guests will appreciate the proximity to Chesapeake Energy, Capital One, and Shaw Industries, in addition to being directly connected to the Shreveport Convention Center. For those on leisure - Barksdale Air Force Base, the Louisiana Boardwalk, Festival Plaza, Millenium Studios, and 5 nearby casinos are all available and waiting for you!Our hotel offers up 313 guest rooms, a heated rooftop swimming pool and whirlpool, 24 hour fitness center, and 3 different dining options to suit everyone's palette. Come stay with us at the Hilton Shreveport."}