{"user_rating": 3.5, "review_count": 556, "name": "Hilton Sonoma Wine Country", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "I stayed at the Hilton in Sonoma County over Labor Day weekend. The room was pretty nice along with the grounds of the hotel. The bed was pretty comfortable and the room was fairly spacious but not all that quiet. If you go, request an upstairs room, you can hear every step the people take above you, and I know they weren't stomping b/c as i walked i could hear the steps echo through the room as well.", "title": "Decent Stay, poor restaurant service", "helpfulness": 6, "user": "jbritton78", "date": "September 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3845954}, {"rating": 4.0, "title": "Great hotel", "text": "My husband and I went to the bar/restaurant for a drink before leaving for dinner. I was very disappointed with the service there. We each ordered a drink and once we got the drink, no one came by to see if we needed anything else. There were only 2 tables that were full! We finally found a bus boy and asked him for our check (which the bill was $12) so i handed the waitress a $20 and she said I'll be back with your change. Well she aparently didn't want to bring back the change because we waited a solid 30 mins for our change and then we got up to find her flirting with some men at a dinner table. We never got our change and were running late to our dinner reservation so we just left. But that service is unacceptable.", "helpfulness": 2, "user": "pba1817", "date": "August 31, 2005", "id": 3832401}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "We are hhonors members and paid a one night visit to the hotel on New Years' Eve weekend. The hotel was not crowded and we were upgraded to an executive room. The room was big and ok. No problems with noise. Parking is ample. The hhonors breakfast was excellent as was the service. There was a $6 surcharge given it was their \"Sunday Brunch.\" We were also given a split of wine as a hhonors member. This hotel is in Santa Rosa on top of a hill. While not directly in the Sonoma Wine Country, it is a couple of blocks a way from Highway 101 and about 10-15 minutes south of Windsor and Healdsburg. Given the hotel prices in Healdsburg are higher, we chose this hotel and were pleased with the stay.", "title": "Nice Hotel. Good Wine Country Base", "helpfulness": 2, "user": "capturedplanet", "date": "January 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 12302366}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed here 4 nights. This place is not nearby Sonoma/Napa wine area (unless a 45 minute drive is nearby to you). True there are some wineries on the way, but the cute little towns and restaurants are at least 45 mins away.", "title": "decent place", "helpfulness": 2, "user": "loveca", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 11297200, "likes": {"liked": "— price/service", "disliked": "— location/amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Its about 45 mins to the ocean and right next to the freeway so if you are going to do some exploring this is an ok spot.", "title": "Great stay!", "helpfulness": 3, "user": "camot", "date": "October 29, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 10412899, "likes": {"liked": "— spacious, clean and quiet", "disliked": "— none"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed in the Executive Suite and it was basically just a nice hotel room. No fancy bathroom, only one medium-sized TV, and its really a one-room \"suite\".", "title": "noise and a lot of it!!!", "helpfulness": 3, "user": "swilley", "date": "October 2, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "business": 3.0, "cleanliness": 3.0, "rooms": 1.0, "location": 3.0}, "id": 10028598, "likes": {"liked": "— decorations", "disliked": "— noise"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The price is right and if thats what you are basing your decision on then its a pretty good choice. But if you are looking for a relaxing resort style room in wine country, keep looking. If you are looking for a decent hotel room in Santa Rosa, this is your place.", "title": "Fine hotel depending what you're looking for", "helpfulness": 1, "user": "fkurban", "date": "September 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8696962, "likes": {"liked": "— it was close to the wineries we like to visit and the price of course!", "disliked": "— the carpet in the halls... it needs to be replaced!"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We recently stayed at the Hilton (Sonoma Wine Country) for one night as part of a family get together in Santa Rosa. I have broken down my review into different categories as follows:", "title": "Reasonable Hotel with noise problems", "helpfulness": 3, "user": "folsomplanner", "date": "March 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7190969, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Price: We paid $114 ($128 with tax) for a one night stay. After reviewing other hotels in the Santa Rosa area, this price was competitive and even on the low end. There are other hotels, such as Quality Inn, etc in a worse location that are available from $70 to $100. We preferred to pay a little more for a better location and nicer hotel.", "title": "Not up to Hilton standards", "helpfulness": 2, "user": "CAScientist", "date": "March 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 3.0, "cleanliness": 4.0, "rooms": 2.0, "location": 4.0}, "id": 6927669}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Location: The location of the hotel was very convenient, located in northern Santa Rosa just a few minutes off the Freeway near Fountaingrove Parkway. This hotel would be a good base for those going wine tasting, etc. Not a walkable hotel, you need to drive, nothing within walking distance.", "title": "Nice rooms, but...", "helpfulness": 2, "user": "Bertomom", "date": "March 4, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 4.0, "service": 1.0, "rooms": 5.0}, "id": 6910307, "likes": {"liked": "— rooms clean and comfortable", "disliked": "— Wretched service at breakfast, no PBS on TV"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007", "text": "Hotel/Room: The hotel was in good condition. It is made up of a number to three story wood-construction buildings. There was nice wood decking at the entry and on the back side of the hotel buildings. The room was spacious, even for us with four in the room. The bathroom was adequate and clean. The linens were fine. The big negative with regard to the room was the inability to insulate the rooms from exterior noise. From the room you were able to hear ordinary conversations being held in the hallway and adjacent rooms. We are not sensitive to noise, but something to do with the construction of the hotel allows the noise to pentetrate too easily. For those of you who are light sleepers this could be a problem.", "title": "Avoid the Hilton in Santa Rosa", "helpfulness": 3, "user": "MsrTicket", "date": "February 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 6813049, "likes": {"liked": "— Nothing", "disliked": "— the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Staff: We had very little interaction with staff, only at checkin which was quick and efficient.", "title": "Bed moved for us.......", "helpfulness": 2, "user": "WDH", "date": "January 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6635076, "likes": {"liked": "— The room was perfect! We've stayed in worse 5* Hotels.", "disliked": "— Had to walk outside from breakfast room to room block - but was not a problem for us. Very good to have the excercise in lovely weather."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Just to set the record straight, I booked this hotel through the Hilton website as a Gold member and paid a reduced government rate, then selected my room/checked-in in advance through the HHonors website (pool-view room). The hotel consists of multiple detached wings spreading out from the main building, each three stories tall. The parking lot opens onto the 2nd floor, and the pool is on the 1st floor. Most rooms do not have nice views, except of the pool (half face the parking lot). The vast majority are 100 yards or more from the main building, and do not have a deck, so late-night partying would not affect most rooms. In other words, I think that if you book the hotel in a conventional way rather than Priceline, it's highly unlikely you will be bothered by a party at the main building. (Not that there's anything wrong with Priceline--I use them as well).", "title": "Fine hotel except the Nectar restaurant", "helpfulness": 2, "user": "lebelgo", "date": "September 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8665996, "likes": {"liked": "— Room comfort and amenities", "disliked": "— Lazy restaurant staff"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The rooms were clean, ample in size, and comfortable. Internet was free in the business office (3 terminals), or $10/day in the room (wireless). The sink is in the same room as the toilet and shower :-( . As another reviewer noted, the inner shower drape does cling to you as you shower. No fridge in the room, but another reviewer stated you can get one free for the asking. I never heard my neighbors to either side, or above or below (we were on the 2nd floor), but the noise does carry from the hallway (didn't end up being a problem). Make sure you're far from the ice maker, since it's really loud.", "title": "Great Hotel forVisitors to Wine Country.", "helpfulness": 3, "user": "GlamGirl83", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8537413, "likes": {"liked": "— The room, service, views", "disliked": "— The hotel's restaurant/bar"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "As an HHonors Gold member, the hot breakfast buffet was a $3 supplement over the Continental, except on Sundays when it was $6 extra due to an omlet station. As others have noted, the service was bad at the Nectar restaurant two of the three breakfasts we ate there. It was downright insulting on one of those two days: we were completely ignored until we went back to get the eggs we waited 15 mins for--then had our settings taken away within 20 seconds!", "title": "If you want to sleep stay someplace else", "user": "sullieye", "date": "August 16, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 4.0, "value": 1.0, "rooms": 1.0}, "id": 8438917, "likes": {"liked": "— location", "disliked": "— Noise!"}}, {"rating": 3.0, "title": "No Frills but Wonderful staff", "text": "So I have no major complaints except that someone needs to give the restaurant employees a swift kick in the behind. A refrigerator in the room would also be nice, and I wish they had designed the rooms better to take advantage of views.", "helpfulness": 1, "user": "hotel1809", "date": "July 25, 2007", "id": 8230654}, {"rating": 1.0, "title": "Very Disappointed", "text": "My husband & I stayed here for 4 nights on our visit to Sonoma/Napa.", "user": "Dr_Carl_MD", "date": "June 19, 2007", "id": 7938908}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "We got an OK rate on the Internet but not fantastic.", "title": "Nice room", "helpfulness": 3, "user": "DaveNStAlbert", "date": "May 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 2.0}, "id": 3509755}, {"rating": 4.0, "title": "Pleasant Stay in Sonoma", "text": "The hotel was nicely redone. Our room was very classy and spacious.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 23, 2005", "id": 3400478}, {"rating": 2.0, "stay_parameters": "Stayed February 2005", "text": "The hallways had the thickest carpets I have ever used!", "title": "New, Clean rooms... horrible service", "helpfulness": 4, "user": "Jill P", "date": "March 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 3284394}, {"rating": 4.0, "title": "Outstanding location for wine tasting", "text": "Another reviewer mentioned the unfriendly check-in. I agree.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 9, 2005", "id": 3263017}, {"rating": 5.0, "title": "Excellent", "text": "Driving through the area, I called them and was transferred to the 800 booking service. After obtaining preliminary info, it turned into a hard sell sales tactic, they just wouldn't let me off the phone. I called back a few minutes later to book and was quoted a higher rate. \"The property is booking up and there are limited rooms available.\" I made a reservation at the higher rate but called the hotel to relay my experience. I was given the original rate from my first call and an apology for having encountered this on the phone. (More on this later)", "helpfulness": 12, "user": "peekoe", "date": "September 4, 2004", "id": 2512819}, {"rating": 5.0, "title": "Hilton Sonoma-After renovation=THE BEST!!", "text": "The layout of this property is gorgeous and spacious. Check-in was pleasant and our room was located in the Chardonnay wing. The moment we opened the door to see through the large picture window over looking the pool, we were amazed. Simply gorgeous with well manicured landscaping with large trees providing shade. I could only imagine the view from the rooms looking over Santa Rosa and beyond.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 10, 2004", "id": 2439510}, {"rating": 5.0, "title": "Excellent Stay", "text": "Our room was well maintained and not a hint of any odors with tasteful up to date decorating. The room itself has ample space to move around, maybe 750+ sqft or so with the king bed layout. (Just to note, this was a handicap accessible room so a regular room may vary slightly.) It had the usual desk and a small circular glass table placed next to a lounge chair and ottoman. A nice 25\" TV and enough counter space for items like my camera bags and her purse to be placed on. Lighting in the main room was above average and a couple lamps had 3 way bulbs so reading was easily accomplished in multiple locations.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 28, 2004", "id": 2326316}, {"rating": 1.0, "title": "Really poor - hard to believe it's a Hilton", "text": "The bathroom was nicely set-up though sink counter space was a bit cramped. Very clean and not a sign of any mold or mildew. Lighting in the bathroom was a bit dim though. Water pressure was sufficient though I would have liked a shower massaging head.", "helpfulness": 2, "user": "RhoHarrisburg_Pa", "date": "July 24, 2004", "id": 2318749}, {"rating": 5.0, "title": "Great value", "text": "Climate controls were challenging and setting a constant room temperature evaded us. Setting it at 72 degrees you'd think wouldn't be hard but it would cycle heat to maintain that temp and a cool 72 and warm 72 was obvious. We'd cool cycle till it was comfortable and shut it off.", "helpfulness": 4, "user": "Angus_Inca", "date": "July 18, 2004", "id": 2305090}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "I just got back from a trip to Sonoma where we stayed at the Hilton. The room was very nice and spacious. It was very clean and the beds were comfortable. We had a room with a terrace facing the pool, which was very nice. The only issue we had was there was a wedding while we were there and there was a very loud party on the deck in front of our room. Several people were standing right in front of our sliding door, laughing and talking very loudly. I had to open the sliding door to let them know there were people trying to sleep in the room they were standing right in front of. They were apologetic and the noise died down.", "title": "Nice Hotel, Appalling Breakfast", "helpfulness": 1, "user": "1mermaid", "date": "May 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 7668616, "likes": {"liked": "— Room size and cleanliness", "disliked": "— Breakfast was really poor, sound carried"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The breakfast was absolutely appalling. The hotel was very full and there was no food out for the buffet. There was maybe one or two pieces of fruit and a roll. All of the trays were empty and there were many people standing around waiting for food. (it is buffet only). After about a 10-15 minute wait the food finally came out. I am glad I was standing at the front of the line because all of the food went very quickly and they were out again. I had to flag someone down to get coffee. We figured it was just a fluke but the same thing happened the next morning. It turns out there was only one waitperson and one bus person for the entire dining room and outside area. They should staff the restaurant much more fully considering they charge $25 for breakfast for 2. It was a huge disappointment.", "title": "Good stay Hilton Sonoma Wine Country", "helpfulness": 2, "user": "TrnrMom", "date": "April 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7319036, "likes": {"liked": "— Good value for price", "disliked": "— Some noise, strong room scent"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "If I did stay there again, I would certainly skip the breakfast.", "title": "Very nice", "user": "tencom", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7287848}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "HI, I booked 2 days here for a weekend getaway at the end of March/beginning of April on a blinded travel site with some trepidation, given the mixed reviews this Hotel has received. However, the lobbies, buildings & grounds were pleasant and well kept up.", "title": "Great Hotel for Business and Tourists", "helpfulness": 1, "user": "smhasert", "date": "March 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7260425}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I do agree with the noise problem, which was bad since the Special Olympics were also in town and we are an older coupon desiring a peaceful weekend. However, when we complained about the bouncing in the room above we were upgraded to an upper floor Junior Executive Suite with a refrigerator overlooking the pool which was quite satisfactory and roomy. Don't know if having a Hilton Honors card was the reason for this but it also got us free internet use in the \"business center\" and a split of wine. Did not try the breakfast so can't report on it.", "title": "Recently Renovated, Relaxing Hotel", "helpfulness": 10, "user": "moviegal226", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7194089, "likes": {"liked": "— Recently Renovated, Very Clean, Excellent Service All-Around", "disliked": "— Location Was Far Away From Big Wineries / Attractions"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 57, "average": 127, "very good": 209, "terrible": 29, "excellent": 134}, "aka": "Hilton Sonoma Wine Country Hotel", "slim_ranking": 0.423076923077}