{"user_rating": 4.0, "review_count": 925, "name": "Hilton Garden Inn Bristol City Centre", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed at the Mint Hotel in Bristol for one night and was very impressed with the friendly welcome and well appointed room. The free wi-fi was a nice touch (so many big hotels choose to fleece people with that!) as was the iMac in the room. The bedroom was not huge, but it was very pleasant and quiet which was just what was needed.", "title": "Friendly and well appointed city hotel", "user": "Groovy146", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124543284}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "There was some construction work happening so breakfast was in a different room, but this was carefully explained and the breakfast was a perfectly calm and pleasant experience.", "title": "Very good hotel and friendly staff", "user": "BixWorcestershireUK", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124539670}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The location is very close to Bristol Temple Meads railway station and the main shopping centre so I highly recommend this hotel for a city visit.", "title": "Nice, clean and quiet rooms in good location.", "user": "BronKJ", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124526789}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed overnight in the Mint Hotel when we had booked to see a show. Although our room was small, it was modern, spotlessly clean and well-appointed with a safe and refrigerator. The restaurant staff were extremely helpful and friendly and the food was very good. Car parking was £10 per day.There was a bus stop directly outside the hotel and the regular bus service took you to the flourishing Cabot Shopping Centre and harbourside which has a wide choice of restaurants. The railway station is conveniently located a few hundred yards from the hotel We had a rear room on the top floor and never heard any traffic. The lifts were silent and efficient. Agnes the Receptionist was particularly pleasant and very helpful. We visited the fascinating MShed museum on the harbourside which has free admission and enjoyed an outstanding interactive display of the historical development of Bristol and its people. There was a charge to visit the display of fashion photographs on the 3rd floor. Have booked another stay at The Mint Hotel next month although I understand it has just been taken over by the Hilton so I hope it maintains its high standards and customer focus.", "title": "Perfect for our Needs", "user": "Mark_Helen_8", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124520681}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "Nice clean and quite room, with a nice view over the park. Having the apple mac was a bonus and good to have something to play music on whilst getting ready to go out. Not in the most picturesque location but a good option if going out in Bristol as relatively close to everything. Especially good location if you've driven or got the train.", "title": "Modern equipped", "user": "Vivdo", "date": "February 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 124397082}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Stayed here for a couple nights on business. Rooms not too bad, although they only have a shower not a bath. The TV is an iMac which is great for those that own one but possibly a bit too ahead of its time for the rest of us.", "title": "Not bad could be better", "user": "Susan R", "date": "January 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122569274}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The food was very good - room service was hot and reasonable. Breakfast is full English to order or a contintental buffet. I would say to the Breakfast Manager though that if someone knows what they want and asks you for it on arrival, interrupting half way through the sentence that a waiter will help, who then doesn't materialise, could be handled better.", "title": "Just as good as it always was", "user": "Twizbe", "date": "December 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122174381}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "This is the third time we have stayed here (but first as the Mint hotel) Not much has changed since it was the City Inn (including the staff uniforms)", "title": "Short City Break", "user": "Richard W", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121942218}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "It is in a good location being close to the station and city centre. Room was very comfortable and clean, breakfast was good.", "title": "Great hotel and Value for money", "user": "MS12344321", "date": "December 20, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 121924853}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Always enjoy staying here.", "title": "Good value hotel", "user": "JoTg", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121827907}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "A fantastic overnight stay. amazing chocolate cream tea in the City Cafe. nice clean accommodation, lovely view, very good service, pleasant staff, comfy bed. free WiFi and a mac in the room. nice breakfast as well.", "title": "Lovely Birthday Treat", "helpfulness": 1, "user": "Saphy76", "date": "January 24, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 123561662}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "This is a fantastic hotel and well situated near Temple Meads train station, ideal for business. The hotel is very modern, clean and good value.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "Kneesy-Does-It", "date": "January 24, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 123553955}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I have to say the staff are really friendly and helpful, especially on the frontdesk. I must say a big thank you to Lucy and Opie for all your help and assistance.", "title": "Brand over basics, and expensive", "helpfulness": 2, "user": "Linzini", "date": "January 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 123497974}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I see this chain has been sold to Hilton Garden Village Hotels and is rebranding - but the enthusiastic receptionist told me proudly \"but we're keeping the iMacs!\" And that was really how I found the whole hotel - nice staff, gimmicks, but not the room basics - some real maintenance issues. Perhaps this has suffered because of the prospective sale? I also found it overpriced (and I was on a corporate rate) - I have stayed in better hotels in Bristol on a cheaper rate.", "title": "Lovely City, Lovely Hotel", "helpfulness": 1, "user": "sqh", "date": "January 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122888128}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "On the positive side It's very well located for Temple Meads station (easy five minute walk, very friendly front of house staff (especially the sommelier) and it was very clean throughout. The public areas are pleasant. On the poor side was my bathroom: shower would only pump dangerously hot water. You could rotate what I assume was the temperature control - there are no symbols or instructions - right round and make no difference whatsoever to the heat of the water (I did check the other dial, this just turned the flow on or off). Since the shower was too hot to stand under, I had to wash my hair in the basin using a mug- there are no baths. Hairdryer was missing from room. Metal fittings fell off the bathroom door - appeared to have been glued back on before. Before all this I rang reception to ask something, the call was not answered for ages and was eventually rerouted to room service who said reception would call back. They didn't.", "title": "Good, but let down by breakfast", "helpfulness": 1, "user": "wanderingsar", "date": "January 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122769991}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Great hotel with really helpful and friendly staff. I've stayed here a few times and my last stay was during refurbishment, so was a little bit chaotic but the staff were brilliant. Particularly Lucy on reception, Dave at the bar and Paulo in the restaurant. I will definitely stay here again. The rooms are clean and have everything you need.", "title": "Great staff!", "helpfulness": 1, "user": "thomascat2", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124395701}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "It was a one off. I was working in Bristol and my wife was having a few friends round for a sleep in. I searched TripAdvisor for a suitable overnight stay with WiFi an absolute priority so that I could file my piece for my newspaper on Sunday morning. The Mint was close to the station and with an old, decent Italian restaurant within walking distance. Having navigated a huge roundabout and eventually found the correct street I quickly checked in , left my bags and went to work.On my return I discovered how bleak the area was and apart from the big , imposing roundabout, the office blocks stood bleak and empty on a Saturday night ion the snow. Come to think of it The Mint was rather similar, not the sort of place you would want to linger for a meal on your own or even a drink at the tiny bar. The saving grace was the room. Basic enough with a nice big bed but excellent in terms of plugs, access to WiFi, mac and excellent and multi use apple television. Work was soon done.But there it stopped.The bathroom was so small that when ( if I may be briefly indelicate) I sat on the loo my legs poked out into the room and as a somewhat large man I had to manoeuvre myself around the shower and sink. Not comfortable at all.", "title": "Mint leaves a funny taste in the mouth", "user": "thewriter", "date": "February 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 124382059}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Despite paying £75 for a weekend night, with refurbishments going on, breakfast was not including and the restaurant was not inviting enough to pay for a breakfast. Instead I walked to the station and settled for and orange juice.", "title": "Excellent service", "user": "northernboy1979", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124057956}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Not a hotel I would return to.", "title": "Top quality customer service", "user": "KellyKinetik", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124057664}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We had a weekend in Bristol and pick Mint for location and cost. The hotel far out weighed the small cost of the room for a night. Staff were very friendly and attentive, room was spotless, very comfortable and the iMac in the room was an excellent touch. The breakfast was also very good better than a lot I have had recently. I would recomend staying there again, I have also stayed in the Glasgow location and had a similar experience.", "title": "Excellent Value and Great Service!", "user": "Grant M", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124056125}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Bristol"}, "stars": 4, "variance": {"poor": 30, "average": 104, "very good": 391, "terrible": 12, "excellent": 388}, "aka": "City Hotel Bristol", "slim_ranking": 0.0555555555556, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}