{"user_rating": 4.5, "review_count": 1263, "name": "Hilton London Canary Wharf", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "Upon trying out half a dozen of the TA top 20, for my purpose, this hotel suits me best:", "title": "The best match for me", "helpfulness": 1, "user": "Travellersfromswitzerland", "date": "April 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 60536554}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "- during 2009, the Hilton worldwide site offered attractive half price b&b packages for queen rooms for certain periods, subject to a minimum of 2 nights, firm purchase and payment approximately one month ahead of stay. For me this turned out fine as the dates of my stay were firm.", "title": "Excellent hotel, brilliant staff and a new area to explore", "user": "Topleader", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59500588}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "- Canary Wharf is a modern office district with thousands of white collars flowing in by DLR and subway every morning. Personally, I prefer the quiet evening environment to the bustle downtown, even if it means to get into the tube myself. The hotel is so close to both DLR and subway that I would not even accept the umbrella offered by the concierge on rainy days.", "title": "Great Hotel - Great Price - Great Staff.", "helpfulness": 1, "user": "Benji78", "date": "March 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58118083}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "- Rooms and bathrooms are spacious and cater for business travellers. Fine with me as long as my room has a river view to relax after dinner. I found dinner very nice and always ate at the hotel. As a vegetarian, I am used to choose on the menu among the rare items available, but my favourite waitress Melissa said: I checked for you with the chef, we can do something special vegetarian! Wow, thank you, guys!", "title": "Superb hotel", "user": "Indytv", "date": "March 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57969779}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The rate I gave for service is 3 despite a 5 for Melissa and the chef: the service level is inconsistent. With some staff, you need negotiation skills to get what you want. Receptionists even pretended my language is not understandable, so was theirs to me!", "title": "Great place - Near Tube - Quiet and Friendly", "user": "Ramscubora", "date": "March 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 57939912}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We stayed here as a family of 5 in January, and we could not have hoped for any better. The 2 interconnecting rooms we were allocated on the 11th floor were extremely spacious and decorated to an exemplary standard. There were modern fixtures and fittings in the bathroom, with a built in radio so you could hear what was being said on the TV while in the bathroom! Both rooms were spotless and made us feel as if we were living in luxury, which was complemented by a panoramic view of the skyscrapers of Canary Wharf which was particularly attractive during early evening.", "title": "Exceptional Hotel all round", "user": "roqueAJ", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56652843}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Upon check in the staff were already aware that one of our party could not eat gluten, and the following morning at breakfast everything was professionally taken care of. To ensure our needs were met the executive head chef, Alessandro Fanzola personally spoke to us and indicated what dishes were gluten free. Both the hot english and continental breakfast options were very tasty, and were of a higher quality in comparison to other similar hilton hotels. For instance opposed to receiving plain, unseasoned scrambled eggs it had been enriched with milk and a touch of cream which really added to the flavour. Similarly, the bread of italian origin closely resembled the appearance and taste of what you can find in Italy, and Alessandro was more than happy to discuss how they were prepared.", "title": "wonderful", "user": "mainland06", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56163017}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I would like to particularly extend our thanks to Alessandro Fanzola, and in spite of only trying his breakfast we are eager to return to try out his other dishes. A true gentleman who is a credit to the hotel.", "title": "Perfect stay", "user": "Vasylis", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55084351}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Overall this hotel for its quality and price will be hard to beat, and is one of the finest hilton hotels I have had the privelege to stay at.", "title": "Fantastic hotel with great staff", "user": "Colleen S", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54352106}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I love the hotel and the location, 2 trains (DLR and the jubilee line) we were at central london so early that at 4pm we can go back to the hotel and explore the restaurants and shops in Canary Wharf i think i count 4 shopping centers. The room, the breakfast (English) was perfect, the people that work there very professional. I stayed in 2008 at Wembley Plaza but , what a difference thanks American Airlines Vacations and Hilton Canary Wharf, you may my birthday wonderful, Thanks a lot", "title": "best hilton in london", "user": "barbauchlaw_jedi", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53695156}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "I've stayed here twice for work March 2007 & Feb 2008. My experience was identical both times. Hotel is fine - I find the bed & room to be very comfortable and a decent size, but I can't say the same about the bathroom which is very small and has poor water pressure. Both times I started the week with breakfast in the hotel - and after seeing what it costs, I decided to pick up breakfast in one of the shops in the underground shopping center that runs under the office buildings.", "title": "Perfectly Acceptable for Business in Canary Wharf", "user": "jjjbbb", "date": "May 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 16010827}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I do have to say that the hotel was extremely generous with an ultra-late check out (5pm-ish) for a very minimal charge. This made a huge difference as it allowed me to relax, workout, shower, etc. in the comfort of my private room before departing on the very long haul back to Australia (and work would not have paid for an additional night for this purpose). I would request this hotel again for this reason if I went back to Canary Wharf for work and this is the reason why I'm giving it an above average.", "title": "Best Hilton I have stayed in!", "helpfulness": 1, "user": "Uncleinan", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 15983556}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "Note to London tourists - Canary Wharf is not where you want to be. It is a long tube ride to most of the places you want to visit and it is very dull at night unless you like dining at restaurants that cater to a business crowd.", "title": "Thank you", "user": "weehet", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15567047, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I have stayed in many different Hiltons over the years but this was without doubt the best I have stayed in. I have stayed in Hiltons with 5 star and 4 star plus ratings but Canary Wharf was better than any of them.", "title": "Excellent, can't wait to go back!", "user": "arransue", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 15156746, "likes": {"liked": "— Lovely staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We only had a standard room but it was large, modern and clean. Breakfast was excellent with a wider range of fruit, pastries, and hot options than any other Hilton I have come across.", "title": "Fabulous Hotel", "helpfulness": 1, "user": "mm123", "date": "April 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14757672, "likes": {"liked": "— The spacious rooms", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "We want to go back again!", "text": "My boyfriend and i stayed at the hotel because of its location, we had tickets to see Lady Gaga at the o2 arena. We got the tube which is a 2 minuite walk from the hotel and got off after one stop which was the arena, this could not have been more convenient as it saved money not having to get a taxi!", "helpfulness": 1, "user": "Lulia282", "date": "March 3, 2010", "id": 57599815}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The overall location generally isnt bad as the tubes are easy and quck. We also went to oxford street and it only took about 15 mins which was ideal.", "title": "Great location for O2 & Canary Wharf - great value too!", "user": "MrsMM", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 57503245}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The hotel itself is fantastic we checked in two hours early and the staff are friendly. However we were slightly annoyed that we had to pay a £50 deposit per night which ment £100 was spent already, however on check out we were informed we would recieve it back within 14days.", "title": "Fantastic Hotel with Friendly Staff", "user": "gareth_999", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 57353851}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Our room was amazing with a huge bed and lovely views and overall just what we expected from a Hilton. The breakfast is also great there is a huge selection and the service is 5* but be sure to check you have it included as it costs £20 each if not!", "title": "Beware the tyrant breakfast cooker", "helpfulness": 2, "user": "Leadman", "date": "February 28, 2010", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 3.0, "value": 3.0, "rooms": 3.0}, "id": 57347605}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The bar and food in the hotel is expensive (a Baileys costing £6.90) but there is a shopping centre two mins away with lovely restaurants with cheaper rates.", "title": "Overcharged", "helpfulness": 2, "user": "DublinTravelsalot", "date": "February 26, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 57160489}, {"rating": 5.0, "title": "Great Place for O2 visitors", "text": "Fantastic Hotel Easy Access to the DLR and Tube services", "helpfulness": 2, "user": "SharonSteven", "date": "July 3, 2008", "id": 17482964}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Staff were very freindly and professional and this was our second stay. We will definitly stay again. If your going to any shows etc at the O2 this is the place to stay Fantastic Steve & Sharon", "title": "Great for the O2 Arena.", "helpfulness": 1, "user": "jniv170", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16828553, "likes": {"liked": "— Breakfast", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Fantastic Hotel and Service.", "text": "We stayed for one night as a stopover for the UFC 85 at the O2 Arena. The first thing we done was register for the car park, for £15.00 the concierge told us we could come and go as we liked for 24 hours. For us this was a godsend, the security, piece of mind and flexibilty this afforded us was worth £15.00 without any doubt. The checkin was effortless and the reception staff were polite and professional. The room on the 9th floor was very modern,spacious and clean. We did not experience any noise issues from the nearby DLR, this may have been down to the fact that our room was on the opposite side of the hotel, probably a worthwhile request as when we were walking through the hotel we did hear the trains passing. A good nights sleep was had in a comfortable bed and breakfast/checkout was spot on. In summary, we will be back for the next UFC and wouldnt change a thing. Thanks Hilton.", "helpfulness": 1, "user": "IrishDave2005", "date": "June 8, 2008", "id": 16779384}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I have just returned from a 2 night stay at the Hilton. My reason for styaing here was were were attending an event in the O2 (UFC). The Hotel is within 5 mins walk from Canary Whar Station.", "title": "Great hotel", "user": "kat225", "date": "June 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 16741276}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "It is a little tricky to find, just ask someone like we did and once you find it your sorted for the rest of your stay.", "title": "Another excellent stay.....", "helpfulness": 1, "user": "rebsed", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16591145, "likes": {"liked": "— The rooms and staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The twin room my daughter and I stayed in was spacious and immaculately clean, with a modern bathroom. The room was quiet, and the bed was so comfortable, I wanted to take it home! Staff were uniformly friendly and helpful. All in all, a lovely hotel where I would stay again. The neighborhood seemed safe, with many corporate office towers, several shopping malls and restaurants, and a Tube station nearby.", "title": "Great room, friendly staff, nice location, if a bit out of the way.", "user": "Kitsyn", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 53301423}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The downsides: The taxi from the airport was quite expensive. We could have gotten there via the Tube, but that would have been an ordeal with Tube maintenance closures and luggage. Internet access via Ibahn was expensive. U.S. travellers beware: \"Free Wi-Fi\" at the hotel and other spots in London seems to mean \"free wi-fi for people with British ISP accounts, all others are out of luck.\" Breakfast in the hotel was a pricey 20 Pounds, but there are extensive shopping malls nearby with many restaurant options.", "title": "good hotel, value for money but not perfectly convenient", "user": "littlebc", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 52825893}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Stayed for 6 nights in Hilton in Executive room. Very good value for money as room is big with good deco. The executive lounge offers complimentary breakfast, drinks, etc. Very relaxing and leisurely. Only downside is that the tube service ( Jubilee line ) is always close for engineering work over weekend, rendering the hotel very inaccessible then. Otherwise, perfect !", "title": "Lovely hotel, not ideal location for tourists", "helpfulness": 1, "user": "vicky_b_09", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 52069465}, {"rating": 5.0, "title": "Hilton is it", "text": "My boyfriend and I stayed at the Hilton Canary Wharf for three nights in early December whilst visiting London for shopping and sight seeing.", "user": "donet", "date": "December 26, 2009", "id": 51911373}, {"rating": 5.0, "title": "Excellent buisness hotel", "text": "The hotel itself was very nice, with modern decor and friendly staff who assisted us with all our requests and enquiries including supplying us with a huge champagne cooler full of ice. Similarly, we found the room to be clean, comphy and spacious.", "helpfulness": 1, "user": "GGGSarnia", "date": "December 11, 2009", "id": 51034420}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "This Hilton hotel has great rooms, very clean and spacious. The staff is very friendly and makes you feel very welcome.", "title": "Great hotel, very friendly and attentive staff", "user": "vaneegh", "date": "October 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 20816159}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The breakfast is one of the best I ever got, a very large buffet and a cook who is willing to make whatever you want.", "title": "Still a good bet!", "helpfulness": 2, "user": "Bob1949", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 20568615, "likes": {"liked": "— Luxury", "disliked": "— Distance from Central London but not really a problem"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The only disadvantage of this hotel is its location: if you need to be at the Docklands for business it is great. If you are visiting as a tourist consider taking another hotel because this area is very quiet at night. (however, with the Jubilee line you are in 20 min at Covent Garden)", "title": "A fantastic Hilton, to be highly recommended!", "helpfulness": 4, "user": "BA-traveler", "date": "September 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19974371, "likes": {"liked": "— Everything from the friendly staff till the comfortable room till the great food", "disliked": "— Not staying longer"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "We enjoyed a good week-end at the Hilton London Canary Wharf and it is still a good bet! The rooms are spacious and modern, the Executive Lounge is good with free internet, free drinks and canapes in the evening and there is a modern feel throughout with a good bar area which serves appetising food. It is a little way out from the centre but nothing that should put you off. The staff are unfailingly pleasant and overall, this is great value for London and I am looking forward to returning in November for a week-end stay. It is easier to use the Jubilee Line into London than the DLR trains and a day travel pass gets you everywhere. Overall, a great hotel that is consistently praised by Tripadvisor posters, justifiably so.", "title": "Excellent - surprisingly spacious", "helpfulness": 3, "user": "Naniwa", "date": "August 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19570526, "likes": {"liked": "— Size and quality of rooms; breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "This hotel immediately responded very forthcoming and assist full (thanks Stephanie!) to my e-mail with questions about a rate, so I knew from the beginning this would be a hotel with the true Hilton spirit of guest friendliness. And it was even better than my expectations; we had a true fantastic weekend break in this Hilton Canary Wharf.", "title": "Consistently great", "helpfulness": 1, "user": "Xena444", "date": "August 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19568891, "likes": {"liked": "— Efficiency of staff, Breakfast!!!", "disliked": "— Price of drinks+ tax/service, small gym"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Just arrived back from a weekend stay at this hotel - it is super. Very nice rooms, breakfast excellent, very friendly staff and most of all very clean. I would stay here again when I have another weekend in London. Excellent value for money.", "title": "Fantastic hotel", "helpfulness": 1, "user": "Lichfield49", "date": "August 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 19086141, "likes": {"liked": "— clean", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stayed in this hotel for one night only on a special deal that included dinner, bed and breakfast. I must say that at weekends this is excellent value for money. The rooms was very spacious 21 square metres, nice, clean, modern, discreetly luxurious, it had a safe, Internet access, climate control, ironing board and iron, bath robes, Crabtree Evelyn Toiltetries, shampoo, conditioner, body wash, body lotion, soap. If one needed anything extra all it took was a simple phone call to housekeeping. There is a well equip fitness centre on side. The dinner menu was really nice and of very high quality, customer service very friendly. Breakfast was of high quality, they serve one orange juice, and tea/coffee (any type one requires, decaf expresso, regular expreso, regular coffee, a selection of speciality teas, the rest is self service, on the extras side they have kippers, haddock and poached eggs. A fantastic fresh fruit selection including passion fruit, kiwi, pineapple,mango among others. A delicious bread selection there were several types of speciality breads. Cold meats, smoked trout, smoked salmon and smoked mackerel, olives. Anything one could possibly want. The executive lounge looked very nice, it is on the 14th floor with nice views of Canary Wharf and the docks. The only minor problem was lukewarm water in the shower.", "title": "Lovely modern Hilton Hotel", "user": "Alfie1920", "date": "August 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18894990, "likes": {"liked": "— clean", "disliked": "— TV screen too small"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I have just got back from my second stay at the Hilton Canary Wharf, and have to agree with most of the other reviews here that it is a superb hotel.", "title": "Another fantastic stay at the Hilton Canary Wharf", "user": "e16guy", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 18619653, "likes": {"liked": "— Cleanliness, staff attitude, style.", "disliked": "— Drink prices."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The rooms are large and comfortable, and a nice touch is that bottled water is waiting in the room when you arrive, and replenished on our second day. The price of the bottled water in the hotel has been commented on elsewhere, but if you ask the restaurant staff for \"tap water\" they will happily oblige.", "title": "Very disappointed", "helpfulness": 2, "user": "ClaireHWR", "date": "July 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 18336349, "likes": {"liked": "— Cleanliness", "disliked": "— Security"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We loved the buffet dinner which was included as part of our room deal for the first night - possibly the best buffet I've ever seen with a wonderful selection of starters, main courses and desserts. Having just returned from a holiday in the States where healthy eating was not high on the agenda, it was great to be able to help myself to a variety of fresh vegetables and fruit. It was also nice to help myself to two desserts! The service at the restaurant was good. We were so impressed with the dinner buffet, we opted to dine in the hotel again on our second night.", "title": "Brilliant", "helpfulness": 2, "user": "DerbyDave", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17686469, "likes": {"liked": "— Great Location, opposite pier for Thames Clipper Service", "disliked": "— Shabby Public Areas - But these are being improved"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 21, "average": 86, "very good": 386, "terrible": 5, "excellent": 765}, "aka": "Hilton London Canary Wharf Hotel London", "slim_ranking": 0.0817843866171, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Situated conveniently in the heart of London’s business district, Hilton London Canary Wharf is an obvious and popular choice for business visitors. As one of our guests you will have access to a high-speed internet connection, spacious desks to work from, a 24-hour business center and many other comforts. Rooms are fitted with a widescreen TV and an alarm clock that lets you plug in your MP3 player, meaning you can wake up to your favourite music.When you’re not busy working, make the most of the sauna, steam room or work out in the well-equipped fitness center. Or sip on a well-earned cocktail in the very popular Canary Wharf restaurant, Cinnamon. Hilton London Canary Wharf is very close to the O2 Arena and Westfield shopping complex in Stratford. This hotel is a great choice for anyone wanting to be close to where business happens but not too far from all the tourist attractions."}