{"user_rating": 4.5, "review_count": 203, "name": "Hilton London Islington", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed at the Hilton for my birthday (my husband did mention this to a member of staff, but no treats arrived, never mind!), and we parked in the car park beneath the hotel. We were quickly checked in to room 155, the room was clean and smart, not huge and not having a good view of anything other than a flat roof, but we were only there for one night so we were ok with that. We went out for dinner that evening, there are lots of really nice places to eat in Islington, it makes a nice change from elsewhere in London. There were no noise problems, the temperature of the room was fine, the only issue was that we found the bed to be really hard, but that's personal preference I guess. We booked the breakfast £15 per head, and went down to the busy dining area at about 9.30am. A waitress showed us a table, and rushed through the set up, which is a buffet of cold food, and a buffet of hot food. We went to get some cereal, and returned to the table, hoping to be offered tea/coffee. The waitress passed the table, so we asked for some tea, she replied 'yes', & wandered off, but no tea appeared. So we went up to the hot buffet (on getting up from the table, the same waitress said goodbye as she hurried past - we were just going looking for tea!), and found that all drinks are self service. The hot buffet food is excellent, but there is just one toasting machine, which is just not enough for a queue of hungry people, who are lining up with plates of rapidly chilling food in their hands. Anyway, we got tea, and hot food, and returned to the table, which the waitress had cleared and re-laid! We weren't impressed with their cleaning techniques - flicking the crumbs from the mats on to the floor, all crumbs from the table brushed on to the floor! Nice for the next diner!!", "title": "Not bad, not great", "user": "innerpsystem", "date": "August 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 171940234}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "In all, it was an ok stay, not as good as we expected, breakfast food good, the organisation of it could be better, the staff need more training. The rooms are nice enough. I would eat at one of the delightful cafes that are dotted throughout the area.", "title": "Excellent stay", "user": "mdryden", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 171889658}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We stayed last weekend in rooms 250 (double) and 252( twin). Both rooms were immaculate and looked to have been recently refurbished. No complaints at all...only (tiny) problem was room 250 had no bath so my grandson of four months had to be bathed in our room. Apart from that we couldn't fault it. Location was excellent ...lots of bars and restaurants right on the doorstep. we were spoilt for choice. Breakfast was good too with excellent choice and quality. Would definitely recommend and stay again without hesitation.", "title": "Great hotel in great location", "user": "Arly422", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171845504}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "5 mins from Angel Station, and set back from the busy road so felt very quiet. Lovely hotel, and spacious, well-equipped triple room with view to the front of the Shard etc. Good selection at breakfast. Friendly staff. Great value all round, though did not eat/drink in the hotel so cannot comment on that.", "title": "Very enjoyable", "user": "dustwav", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171755771}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We just stayed at the Hilton for 4 nights. The hotel is located on a small square just off Upperstreet, so it's quite quiet, unless you sleep with the windows open. The girl at the reception was super friendly and asked how we were doing several times during our stay. She also recommended to go shopping at Stratford, it's a brand new, super large mall. The airco in the room worked great though we didn't really need it. Beds are quite comfortable, though we asked to extra duvets to make them more comfy, shame they don't offer toppers for that. Shower is large and very relaxing. Several Peter Thomas Roth shower gels and shampoos ect. The overall hotel is quiet clean though there are some spots that can be cleaned better (but so is our house...), like the lights in the corridor.", "title": "Refurbished and very good", "user": "Dodynic", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171748409}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We arrived in London thinking we way a way to travel to our hotel. We we were pleasantly surprised. Arrived at Euston took to underground 1 stop to Kings Cross then onto the Northern line.2 stops to Angel then a short walk to Hilton islington. The hotel was great, decor so modern. Cleanliness first class , service at breakfast excellent. Can't fault it.", "title": "A great hotel", "helpfulness": 1, "user": "6525", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 172716954}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Lovely modern hotel which is obviously meant to be business-orientated but was perfectly suitable for a stay for my mate & I as we went down to watch the Scotland England. The quiet room was extremely clean with a fantastic TV and nice artwork on the wall. Comfortable single bed. The shower, in addition, was incredible.", "title": "Comfortable Stay, Pleasant & Helpful Staff", "user": "JLKearney", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172638795}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I love Hilton breakfasts and they didn't let me down on this occasion either. Great hot & cold selection and again, a very clean area.", "title": "Refurbished", "user": "Catherine966", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172237911}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff were attentive, polite and helpful whenever we spoke to them and top marks to them for posting the phone charger I left in the room so quickly. Phoned them on Thursday on the train and it arrived this morning (Saturday) after being sent first class! Brilliant work guys, thank you.", "title": "Quiet and pretty in convenient area", "user": "anne s", "date": "August 14, 2013", "detail_rating": {"value": 4.0, "sleep": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172313475}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I've been staying here on business for a few years and the new refurbished rooms are a really huge improvement. It's essentially a business hotel, although there's a good view of the Shard and the City from the front of the hotel. Bar prices are exorbitant as with most London hotels sadly and the hotel is ideally located for access to Upper Street with a wide range of restaurants and bars. Room service is pretty good, breakfast very good and the staff all friendly and helpful", "title": "Great location, quiet and clean", "user": "hellozoeb", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 172023125}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I have stayed at this hotel a couple of times now... the last being last week.", "title": "Good hotel.....", "user": "PB1Oxford", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171743334}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "It is a very good, clean hotel. Room size good & bathrooms nice.", "title": "Good but", "user": "May Z", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 171562287}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I didn't have enough towels & called down & they were knocking on my door within minutes!", "title": "Never Disappointed", "user": "SuirTripper", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171314521}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel is so central... will go back.", "title": "Brilliant stay!", "helpfulness": 1, "user": "Tanialh", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171052167}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I was in a badly located room, this was either due to the fact that I'm very young (and therefore assumed to be a less valuable guest) or because I reserved very last minute. The internet fares were crazy expensive (especially for a service that is available for free in every coffee shop nowadays). Either way, the rest of the service was excellent, the room tidy and fresh, the staff very professional and the food exquisite.", "title": "Simple but Convenient", "user": "Turhan T", "date": "August 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170616754}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We have decided this is our new hotel to stay when staying near the centre of London. For £100 a night you are in a top location in the city and well connected with elsewhere as you're on the northern line. Doesn't look much from the outside but they've just refurbished all the rooms and the corridors and it looks fab, not unlike Malmaison. As for the room, it was nicely furnished and the TV was massive, although the double bed was a bit small for our liking. The new bathrooms are great and the showers are brilliant - one of the best we've ever had with a large cubicle and glass sliding door so you don't have to worry about water on the floor. Downstairs, the bar is pleasant and the prices not far off what you'll pay in nearby bars and pubs. Staff are helpful and friendly. Don't bother staying for breakfast as there are plenty of other places within a stone's throw.", "title": "Decent hotel in good location", "user": "Peejdj", "date": "August 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173056334}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Stayed here for three nights on business. The hotel is lovely and modern and although I think it's tailored for business it would be perfect for couples. The rooms have a lovely cosy feel and are very well decorated. The bathroom was lovely and spacious, although the water pressure wasn't overly powerful and the water wasn't especially hot.", "title": "Lovely hotel - perfect for couple or business", "user": "Laurajporter", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172845998}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Breakfast was good with a nice selection of hot and cold. I stayed bed and breakfast so not sure if it was good value when added on.", "title": "Average by Hilton (global) standards", "user": "biztrav77", "date": "August 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 172816064}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Staff were very friendly and really helpful.", "title": "FANTASTIC HOTEL", "user": "Amanda A", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172801212}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The area is perfect if you are visiting London as a tourist. 10 minute walk to Angel underground station which is one stop from Kings Cross. The Islington area also has a great selection of bars and restaurants and is perfect for people watching at the weekend.", "title": "London stay at the islinginton Hilton", "user": "John P", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172913029}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 6, "average": 22, "very good": 69, "terrible": 1, "excellent": 105}, "aka": "Hilton London Islington Hotel", "slim_ranking": 0.157209302326, "description": "The Hilton London Islington hotel is in the heart of Islington, next to the Business Design Centre. Enjoy delicious international and local cuisine in Axis Bar & Kitchen or unwind with a drink or two. Explore fashionable Islington, full of boutiques, theatres and restaurants, from your Hilton London Islington hotel base. Popular London attractions such as St Paul's Cathedral, London Dungeon, the National Gallery and, for sports fans, Arsenal football ground are nearby. Do business in one of 5 meeting rooms for up to 40 delegates. There are two PC terminals and wireless internet access in the Lobby. Business facilities are available. The hotel is located outside the Congestion Charge Zone. From Hilton Guest Rooms to Suites, all Hilton London Islington hotel rooms have high-speed internet access. Step up to a Suite for extra space."}