{"user_rating": 4.0, "review_count": 399, "name": "Hilton San Jose", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Attended conference in this hotel and found the rooms to be comfortable. There was no safe, and some of the non-smoking rooms got mislabeled. The staff changed our rooms once we alerted them, and this is not something we'd hold against the property.", "title": "Unimpressive business hotel", "user": "paletexan", "date": "May 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 16457785, "likes": {"liked": "— Clean Room and ample parking downtown", "disliked": "— Hard to find something decent to eat"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The fitness facility was awful, and was a single converted hotel room with aging equipment. Room service was expensive with below average food quality. It was hard to find quality restaurants within walking distance, and we had to drive to the outskirts of town (or Mountain View) for decent food. Downtown San Jose otherwise seemed pleasant and walkable, and the hotel was very close to the light rail.", "title": "Excellent Location and Great Rooms!!!", "user": "vanbizman", "date": "April 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15207419}, {"rating": 4.0, "title": "Good business hotel but never stay in SJ for pleasure", "text": "In summary, the hotel was comfortable; but lacked amenities one is accustomed to in hotels catering to business travelers, and it was hard to find a decent bite to eat nearby or on site.", "user": "stumpak", "date": "April 12, 2008", "id": 14984695}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This is wonderfully situated room in the San Jose core. It is about half a mile from the San Jose Diridon Caltrain station. Wonderfully appointed rooms and within walking distance to anything worthwhile in the San Jose core. Great Stay!!", "title": "Executive Suites Are Just Grand!", "helpfulness": 2, "user": "MizKitty007", "date": "November 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10756603, "likes": {"liked": "— Executive suites overall, free food on 18th floor for exec suite occupants, location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The hotel itself is nice enough and staff is friendly and helpful. The downside is that downtown San Jose is a desolate pit with zero amenaties (much less night life or a decent restaurant).", "title": "great location for the RNR 1/2 marathon", "helpfulness": 1, "user": "With2kids", "date": "October 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 10461441, "likes": {"liked": "— location", "disliked": "— cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I stayed at the Hilton San Jose for a week in July, from Monday to Sunday. The Hilton is attached to the San Jose Convention Center, meaning that is is very convenient if you're attending a conference there. This is a good hotel, but for a Hilton is a little lackluster.", "title": "Great Service, Average Hotel", "user": "codelemur", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 38210053}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Good: The location is right in the middle of San Jose, and easily accessible via the light rail. It's about a ten minute drive to SJC. Parking, while a little on the expensive side, is available and easily accessible in the parking garage located beneath the building. There are some good restaurants and a brewpub within walking distance. The service was also outstanding - the room was clean every day, and they even put a nice little towel underneath all my toiletries.", "title": "Great but not quiet.", "user": "adstz", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37204061}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Bad: This is the first hotel I have been in in YEARS that DID NOT have wireless internet. WIRED internet is available (and quite fast), but it kind of restricts you to you leaving your laptop on the desk. If you bring a longer Cat-5 cable, you can connect up, but it's still a pain. The building itself and the rooms, while nice, are definitely starting to show their age. In general, the hotel, while nice, needs an update. This hotel is also right under the approach path for SJC, but the sound padding seemed to reduce it to a dull roar.", "title": "Nice renovation, but lacking in details", "user": "my5qtz", "date": "July 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 35041438}, {"rating": 2.0, "stay_parameters": "Stayed June 2009", "text": "Overall: If this were a Holiday Inn, it would be an extremely nice hotel. But when you affix the Hilton name to it, it loses some of its luster because I generally expect more from a Hilton. Nothing extremely negative to say about it (other than the lack of wireless), but not quite up to the level of other Hiltons that I've stayed in.", "title": "Rooms are newly decorated but facilities are horrible", "user": "Wrldtrvlerillinois", "date": "June 28, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 33400797}, {"rating": 4.0, "title": "Great for business", "text": "Visited August 2 - 7, 2009. Had a great room on the tenth floor. The room is spacious. I had a king bed and the room had an easy chair with ottoman that I used for reading (once). The comforter on the bed was down with flat sheets under and over it for appearance. Because the thermostat didn't work I ended up sleeping with only the sheet. I set the air conditioner at 60 degrees F and would wake up sweating. It never really cooled down. The other problem I had was the noise. There is no weatherstripping or sound barrier around the door and there is a gap at the bottom. Anyone talking in the hallway sounded like they were in my room. Other than that, the bed was comfortable, the room was clean and the staff was pleasant.", "user": "DexterDCE", "date": "June 11, 2009", "id": 32102145}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Cons:", "title": "Great staff but the building and management do require improvement for the price", "user": "solarpower", "date": "August 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 19185886, "likes": {"liked": "— Courteous staff", "disliked": "— Overpriced, especially when compared to the Fairmont nearby."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "•Internet is an additional charge and no wireless option. The internet connection was also down without notification for several hours (front desk told me it would only be approx. 3 hours, total)", "title": "Great Stay", "user": "RiaM207", "date": "August 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19086302}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "•Breakfast – the buffet was mediocre and the service appeared understaffed as they seemed encourage you to get the buffet. We had to ask for menu’s and every time they asked us if we had a coupon for the buffet which lead us to believe we were overpaying unnecessarily.", "title": "Bedbugs", "user": "Gone_walkabout50", "date": "July 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 18190694, "likes": {"liked": "— Attached to the convention center where the event was", "disliked": "— bedbugs"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "•Showers need help - Shower heads aren’t very high – I’m 6’-3” and always find it very annoying to have to duck. In addition, the drain didn’t work as I was standing in 2-3” of water. The lack of a working bathroom fan was also annoying, and the towels need replacement as they were very rough and occasionally had holes.", "title": "Id look elsewhere next time", "user": "wantpeaceandquiet", "date": "July 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 17980234, "likes": {"liked": "— Location", "disliked": "— Constant smell of cigarettes in ventilation system even in non-smoking room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "•Only one overheard light in the room, located in the entryway, provided little light to the room and required beside table lights to be turned on individually.", "title": "good stay", "user": "jeff1232", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17102787}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The San Jose Hilton is the property that I call home away from home. The staff are disciplined, dedicated to client satisfaction and the property is well managed overall. The interior is bright with contemporary lines, the rooms are nice and all have a big flat-screen TV. Housekeeping does a great job. The gym will allow you to maintain when you're away from home. It helps me burn off the chocolate goodies they have waiting for me every time I check in.", "title": "San Jose Traveler's Home Away from Home", "user": "OpsStratConsultant", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31449335}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The property is located in Downtown San Jose, integrated with the convention center facilities, and maybe 10 minutes from the Airport. Stay here if you are attending a conference for sure.", "title": "Updated rooms nice amenities", "user": "localbeans", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27589838}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "You can get anywhere quick from here. The food is good, and reasonably priced, based on my hundreds of nights of hotel stays. Many options in regard to food/drink establishments. Museums and other cultural venues are but a quick walk away.", "title": "Better than expected", "user": "FairwayFound", "date": "March 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26980298}, {"rating": 3.0, "stay_parameters": "Stayed December 2008", "text": "Consultants and business travelers out there: the staff will address you by name in no time and they'll make sure you get what you need to make your stay comfortable.", "title": "Much improved!", "user": "imaima", "date": "January 4, 2009", "detail_rating": {"front_desk": 2.0, "service": 3.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23263275}, {"rating": 1.0, "stay_parameters": "Stayed October 2008", "text": "This hotel looks like it has been recently updated. The rooms are swanky There are complimentary apples and bottled water everywhere. The rooms are quiet (though I stayed mid week and don't think the hotel is very full). The fitness center is spectacular. However they claim a \"lap pool\". It is about 25 feet by 5 feet - skinny and really small. Not great for laps but ok for hanging out. They don't have wireless in the rooms yet which is a drag if you have two people with two computers. You have to plug in. But wireless on the first and second floors.", "title": "Friendly staff, horrible rooms", "user": "ejohnson94", "date": "October 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 21382408}], "location": {"country": "United States", "city": "San Jose"}, "stars": 3.5, "variance": {"poor": 27, "average": 59, "very good": 144, "terrible": 12, "excellent": 157}, "aka": "Hilton San Jose Hotel San Jose", "slim_ranking": 0.138888888889, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Hilton San Jose hotel is located in the capital of Silicon Valley, connected to the San Jose McEnery Convention Center and only three miles from the Mineta San Jose International Airport."}