{"user_rating": 4.0, "review_count": 217, "name": "Hilton Rotterdam", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I booked a room here several months ago and got a very good deal - €70 for 1 night inc. breakfast. Personally I wouldn't pay any more than that, especially as they normally charge double what I paid.", "title": "Bland, over-rated", "user": "matt_1376", "date": "January 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 151000842}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The hotel is a 5 minute walk from Rotterdam Centraal and the first impression was \"it's surrounded by a building site\" which it was. I checked in and the receptionist asked for a credit card in case I decided to raid the mini-bar. I told her I didn't have a credit card so she demanded that I hand over a €50 deposit. Luckily I'd just been to a cash point.", "title": "Very nice, located near shopping", "user": "Andert01", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150949486}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "I then asked for the code for the wi-fi and was told it would cost me €20 for 24 hours. So I asked if there was free wi-fi in the lobby and was told \"no\" !", "title": "All renovated, got the suite 501 so fantastic, quite big. People in the reception less competent than other hilton in europe, at", "user": "maitero", "date": "January 29, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 150902855}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "My room on the 7th floor had a view to the south of the city centre - including a building site. The room was large with en-suite shower room and the usual toiletries. On the wall was a large flat screen TV which said on the screen \"Welcome Mr *******n to Hilton Rotterdam\" which was a nice touch. I decided not to raid the mini-bar but instead went to check out a few bars close to the hotel.", "title": "Excellent place to stay in Rotterdam", "helpfulness": 1, "user": "Mariner500", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150730618}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "When I returned to my room later in the evening it was cold. There was a digital thermostat display on the wall but with no instructions I couldn't get it to work.", "title": "Top quality", "helpfulness": 1, "user": "locoman20", "date": "January 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150610187}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The hotel is undergoing refurbishment. I got a room that was recently renovated. The room is average sized, pretty decent, sufficient room for 1 large luggage and 2 persons, though i stayed by myself.", "title": "Refurbished, impractical toilets", "helpfulness": 1, "user": "friesbandit", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 150442147}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The issue i have with the room is the bathroom. The bathroom looks nice, but did not seem to be designed for practical usage. The towel hooks were right next to the toilet bowl and the towels provided were so huge and the hook was so low that my towel might as well have been cleaning the toilet seat. There were no toilet hooks near the bathtub at all, which means you toss your towel on the sink, or have to drip across the (small) bathroom to get your towel. Also, the bathtub side wall is pretty high, and it is slippery. There isn't any handrails to assist you getting in and out of the bathtub either. The tub doesn't come with shower screen, but a small glass panel to block the spray of water onto the bath room floor. Hence, you can get quite a wet floor if you are a large person. The plumbing also is a little erratic. I recommend letting the water from the shower head flow a little while before you use it as there tends to be a stream of really hot water a couple of seconds after you turn it on.", "title": "My hotel of choice in Rotterdam for business", "helpfulness": 1, "user": "Chris D", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150406716}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "The lobby was small but functional. The restaurant where the breakfast buffet was is ok. The choice is pretty limited, but i expected that of an European country where the staple was bread and cold slices and cheese.", "title": "Inside refurb is better than the outside look!", "helpfulness": 1, "user": "Phill C", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 150353665}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The location of the hotel is good, being right at the start of the shopping district, and yet close enough to walk to the Rotterdam Central station.", "title": "Great Hotel in a Good Location", "helpfulness": 1, "user": "worldtraveler68926", "date": "January 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150125403}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I travel to Rotterdam quite regularly, for business mainly, and this has become my hotel of choice. It is conveniently placed only a few minutes walk from the central station and less the 10 min walk from the world trade centre. Currently undergoing re-furb and the new rooms are lovely with everything you would expect in this price range. Good sleep is essential to me and whilst I know this is personal I find the beds exceptionally comfortable. The rooms are pretty quiet too. I got my laptop out to do some work and exploit the free internet access and realised I had left my Euro adapter at home. No matter, the room has a UK socket by the desk; what a brilliant feature. The staff are polite and particularly helpful and the clean bright new restaurant is pretty decent if not exceptional. Why do all hotel chefs use too much salt? I have not used the new gym but the old one was pretty basic. Value for money is not amazing but you do get what you pay for so, overall, you won’t be disappointed. When the re-furb is finished I expect it will be even better.", "title": "Vastly improved but rubbish shower", "user": "PaulO4442", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 149870505}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "At first sight, the hotel is a bit 1960s soviet-era grim - a monolith of concrete and glass. The reception area is also being renovated so the overall first impression is “oh no – what have I booked?” Do not let the exterior put you off! I stay in a lot of hotels – I don’t always write a review but I have to say this hotel was a complete surprise. I enjoyed my stay here so much I can’t wait to return.", "title": "They try really hard to make your stay here perfect", "helpfulness": 1, "user": "dogsareforlife", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152021762}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The location is excellent – you are surrounded by many businesses and are literally right on the central shopping district too. It’s perfect for business or leisure trips. If you fly into Rotterdam airport get a Rotterdam Welcome Card (1, 2 or 3 days) at the information desk in arrivals which allows you to use all forms of public transport and gets you discounts for tourist attractions – brilliant value for around £7 euros per day (alternatively taxi is around 20 euros to the hotel) You can use the card to get to the Rotterdam centraal train/bus station from the airport – take the number 33 bus which can be found by walking out of the airport terminal building and turning left. Just remember to “chip in” by pressing your card against the reader when you get on the bus (and “chip out” when you get off) The hotel is about 1/4 mile walk from the centraal station (turn left as you exit the main front entrance) - easily done with backpack or wheeled luggage.", "title": "Renovated rooms are very nice !", "user": "SenJAntwerpen", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151814059}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "I'd booked a “KING HILTON DELUXE ROOM MODERN SPACIOUS ROOM, VIEWS OVER THE CITY LARGE DESK, LCD TV, MP3 PLAYER,BATH OR SHOWER - Room only” rate via British Airways. The rooms are being renovated. Many are already complete and after one of the most pleasant check in experiences ever (thank you all for speaking perfect English!) , I was given a king room on the 7 floor overlooking the front of the building. I can’t remember when I liked a hotel room more. It had everything I needed – very comfortable bed, large flat screen TV, desk and chair with great lighting, plenty of storage and space and well stocked mini bar and nespresso machine. There was a table and two chairs with a large lamp over them too – perfect if you had in-room dining. The contemporary décor – grey and blue – worked really well. I thought it was one of the best designed rooms I’d ever seen at a Hilton. 10 out of 10.", "title": "Nice location and the best option in Rotterdam!!!!", "user": "rotterdamerik", "date": "February 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 151281899}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The bathroom was also huge with a walk in double shower, large deep tub and plenty of storage space. The illuminated make up mirror a great touch too. Everything was completely spotless and new – I loved it.", "title": "Excellent hotel, super staff and great service! My favorite hilton!", "user": "MrHiltonFan", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151221767}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "As Hilton Gold, I normally get breakfast included which is usually taken in the exec lounge. The exec lounge at this hotel was closed for renovation in Jan so we had free drinks in the bar off the lobby. This was great as the staff serving were just so welcoming and responsive without being obtrusive. The bar had a lovely atmosphere on the Friday and Saturday nights - a really pleasant place to meet for on hour or two. They served us with hot snacks (bitterballen?) in lieu of the snacks you can usually get in the lounge. You could also order other bar snacks from the table menus if you were peckish", "title": "Bar was closed at 23.45 and refused to re-open", "helpfulness": 1, "user": "Clare M", "date": "February 1, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 151201484}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Comfortable beds in virtual soundproof rooms so peace and quiet is assured. Whereas once you step out of the hotel doors you have everything at hand : shops, theatres, bars, restaurants. So one has the best of both worlds while staying at the Rotterdam Hilton. Their restaurant is also to be recommended as are the wonderful staff of both hotel and restaurant departments.", "title": "Comfortable and peaceful", "user": "Caroline L", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149789980}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The exterior of the Hilton Hotel is dowdy and dated. However the interior is modern, sleek yet comfortable. Hilton is only just finishing a complete overhawl of the interior and it's looking great.", "title": "Comfortable and convenient.", "user": "JulieMSurrey", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149662269}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "This hotel is very central, only minutes away from the station, business district, cinema, restaurants and shops.", "title": "Hilton Rotterdam Hotel was a GREAT CHOICE", "helpfulness": 1, "user": "RFaroukF", "date": "January 10, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 149328670}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The staff are very attentive, helpful and friendly.", "title": "Hilton Rotterdam", "user": "Rob_de_Jong", "date": "January 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149214798}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "The rooms are modern, clean and very comfortable. Water and WiFi in my opinion should be complimentary, but sadly are not in standard rooms.", "title": "Excellent stay", "helpfulness": 2, "user": "Falkvik", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148965040}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Rotterdam"}, "stars": 5, "variance": {"poor": 7, "average": 20, "very good": 88, "terrible": 4, "excellent": 98}, "aka": "Hilton Rotterdam Hotel Rotterdam", "slim_ranking": 0.115384615385, "description": "Set in the heart of Europe’s largest harbour city, Hilton Rotterdam offerscontemporary accommodation and premium amenities, just a shortstroll from the central railway station. Catch up with work using highspeed wireless internet, work out in the fully-equipped gym or roundoff the day with dinner in Stadshal restaurant. Whether in Rotterdamfor business or leisure, experience warm hospitality and friendly,efficient service throughout your stayAT A GLANCE:• Within walking distance of major business and shopping areas• 254 modern deluxe rooms and suites• Executive rooms offering access to the Executive Lounge• 4 meeting rooms and 3 boardrooms for up to 325 delegates• Stadshal bar & restaurant• Hilton Fitness with cardio and weights"}