{"user_rating": 4.0, "review_count": 97, "name": "Hilton Garden Inn Oklahoma City Midtown", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Recently opened. Good staff; great location near everything in OKC. Room seemed a little smaller than some HGIs, but it was more than adequate for our needs.", "title": "New Hotel in Excellent Location", "helpfulness": 2, "user": "Twoprofs", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90839970}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I'm a road warrior who stays in a new hotel almost every night! I came across this hotel by accident and booked a room only a few days after they opened the doors for business which normally is a big no, no!! The front desk greets with a smile and acknowledgement with great attention and care as if you are a star no matter the shift. The beds are also great and this is coming from someone who battles with a bad back from surgery and injury from in past. The bed's actually are self adjusting and have memory foam along with 16 air blatter's not one solid ballon like the Sleep Number! This is the first time I can remember in a long time that I have had dream's and that's no gimmick!", "title": "BEST Hotel! Book with confidence!", "helpfulness": 1, "user": "James567", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79839709}], "location": {"country": "United States", "city": "Oklahoma City"}, "stars": 3, "variance": {"poor": 3, "average": 11, "very good": 25, "terrible": 5, "excellent": 53}, "aka": "Hilton Garden Inn Oaklahoma City Midtown Hotel Oklahoma City", "slim_ranking": 0.167883211679, "description": "Contemporary hotel featuring free WiFi access, an indoor salt water pool fully equipped fitness center and an on-site American Grill restaurant."}