{"user_rating": 4.0, "review_count": 254, "name": "Hilton Garden Inn Worcester", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Nice property but a number of growing pains to be aware of.", "title": "Beware", "helpfulness": 2, "user": "FSA_Squared", "date": "June 12, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 2.0, "location": 4.0, "value": 4.0, "rooms": 5.0}, "id": 7841516, "likes": {"liked": "— Breakfast", "disliked": "— Misvalidation of parking ticket"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Be sure to get OVERNIGHT parking validation. When the parking ticket says that parking expires on XX/XX/XX it actually expires the day before so you won't think anything is amiss. However, the automated gate won't let you out and there was no one there to help. I had to back out of the exit lane, return to the 4th floor to park, go back across the street, have the ticket revalidated then go back to go through the automated exit. Staff didn't apologize for the error and inconvenience.", "title": "OK Stay", "helpfulness": 1, "user": "cooncat", "date": "June 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7838436, "likes": {"liked": "— Near to DCU Arena, attached UNO", "disliked": "— Price a little steep"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Breakfast was exceptionally good - the best I can recall for a complementary breakfast (under Hilton Honors program).", "title": "Never would return", "helpfulness": 4, "user": "elmo399", "date": "May 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7709523, "likes": {"liked": "— Leaving...", "disliked": "— The ten reasons I listed in my review."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Sloppy housekeeping. One rooms was not fully cleaned with items left by the prior guest and missing soap and shampoo.", "title": "Loved the hotel and staff - great UNO restaurant in Lobby", "helpfulness": 1, "user": "paul1828", "date": "May 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7669089, "likes": {"liked": "— new hotel in great location and great UNO Chicago", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Room keys seem to get demagnetized too easily. Keep them away from credit cards. Had problems with both of our room keys.", "title": "Great stay at the Hilton Graden Inn", "helpfulness": 2, "user": "NewEnglandRosie", "date": "April 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7416971, "likes": {"liked": "— The staff"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "This is a late review, but finally had a chance to come back to tripadvisor. Stayed at this hotel last Feb. '07 for 4 nights will at a trade show at the convention next door. We used to stay a few blocks away at the Crown Plaza for years, but figured we would try something different.", "title": "Clean Hotel, Close To Convention Center", "helpfulness": 1, "user": "mainetoday", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8539012, "likes": {"liked": "— Convenient to Convention Center, Very Clean", "disliked": "— Soda Machines Were Out of Soda On All Floors..."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We are glad we did!!!", "title": "Great deal", "helpfulness": 2, "user": "Ms Patty", "date": "August 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8509845, "likes": {"liked": "— The pool area was clean and the breakfast outstanding. Close to Clark University.", "disliked": "— We paid $161 for one night - pretty expensive, but I figure the breakfast offsets some of this."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Everything is brand new, clean and convenient. Just across the street and you are at the Centrum (or whatever it is called now). Not much parking, but there is a valet there and they will park your vehicel in the parking garage across the street. Very centralized and convenient location if you are there on business. The new gov't center is being built right next door as well. There is also an Uno's Restaurant there which has a wide variety of food and a big bar area.", "title": "Clean Hotel", "helpfulness": 2, "user": "MeanGoldfish", "date": "August 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8508456}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We have already booked our rooms to go back next year.", "title": "Horrific Service! Comfy Beds!", "user": "Jonasboston", "date": "July 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 8109051, "likes": {"liked": "— the beds were great!", "disliked": "— the hotel service was horrific!"}}, {"rating": 4.0, "title": "Good choice!", "text": "We are a family of four who stayed here for one night in August '07.", "helpfulness": 1, "user": "Footloose39", "date": "July 10, 2007", "id": 8092217}, {"rating": 5.0, "title": "Loved this hotel", "text": "I was looking for a hotel that was safe for two 30 year old girls to stay. We found it! The rooms were clean and the beds were comfortable. I felt like I was sleeping in my own bed. This hotel was close to restaurants, bars, the convention center and the Palladium. All within walking distance. We loved it so much we decided to stay a second night. I would highly recommend this hotel.", "helpfulness": 1, "user": "cindychittenden", "date": "April 2, 2007", "id": 7271583}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "the nightclub noise is more than slight. I am on the 4th floor, and won't be sleeping until the bar closes. Very disappointing for what seems to be a very nice new hotel. Will be trying to find a different hotel for tomorrow night:-(", "title": "the nightclub noise is more than slight.", "helpfulness": 3, "user": "TooColdinWI", "date": "March 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 5.0, "cleanliness": 4.0, "rooms": 4.0, "location": 1.0}, "id": 7008395, "likes": {"liked": "— clean and new", "disliked": "— the noise from the nightclub"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "While attending an event at the DCU Center, we decided to stay over night at The Hilton Garden Inn, we selected the property since it was billed as being \"adjacent\" to the DCU Center, while that is a stretch (to me adjacent means attached) it was just on the opposite block and certainly a very convenient location. The hotel's check in time is 4pm, but our rooms were ready at 1pm and we were able to check in then, the front desk clerk was very nice as was the staff at the breakfast served in the lobby in the morning ( a great selection). Also very convenient and a big plus is that a Pizzeria Uno is attached to the hotel, (this helps when in unfamiliar surroundings at night and this area appeared a bit unseemly). While The Pizzeria Uno is new and needs adjustment time also, their staff was very friendly, food good for that type of venue. The hotel itself is brand new and beatifully decorated, the rooms clean and also well decorated. Only complaint is that you do hear some outside noise from a night-club across the street, this may be more of a problem on the lower floors on that side of the hotel, we were on an upper level, so not too bad. All in all, a good value.", "title": "Great Location", "helpfulness": 3, "user": "padeamal", "date": "December 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6457935, "likes": {"liked": "— very clean", "disliked": "— pay for parking"}}], "location": {"country": "United States", "city": "Worcester"}, "stars": 3, "variance": {"poor": 15, "average": 29, "very good": 96, "terrible": 15, "excellent": 99}, "aka": "Hilton Garden Hotel Worcester", "slim_ranking": 0.285714285714, "description": "Welcome to the Hilton Garden Inn Worcester hotel. This comfortable and convenient Worcester hotel boasts an ideal location in the heart of downtown Worcester, Massachusetts. Situated adjacent to the DCU Convention Center, our Worcester hotel offers proximity to 13 major Massachusetts colleges and universities and an array of fantastic shopping venues and dining opportunities. Discover comfort and convenience at this bright and airy Worcester hotel. From our oh-so-comfortable beds, to cooked-to-order breakfast and complimentary WiFi, the Hilton Garden Inn Worcester hotel has everything you need for a successful stay. Indulge in a cooked-to-order breakfast at the Great American Grill® or grab a takeaway meal from our 24-hour Pavilion Pantry®. Choose from refrigerated and frozen microwaveable items that you can prepare with your convenient, in-room microwave or simply relax with evening room service in your inviting guest room. Host a meeting or event in our eight meeting rooms or enjoy a grand reception in our beautiful lobby - this magnificent atrium can host up to 175 guests. After a long day in the complimentary business center, unwind with a refreshing swim in the indoor pool or rejuvenate in our fitness center."}