{"user_rating": 4.0, "review_count": 350, "name": "Hilton Garden Inn Orange Beach Beachfront", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "First time in Orange Beach. Very Pleasantly surprised. Quiet beach with great restaurants. Hotel is in great location. Front desk and housekeeping staff very pleasant. Nice pool, inside and out with tiki-bar. Slow elevators and empty ice machines (but front desk willing to get us some). Rooms are nice and there are now flat sceens. Will definately go back. Good breakfast, even though $10 but ordered and omlet besides the buffet.", "title": "Nice hotel", "helpfulness": 1, "user": "Dilweg", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117146931}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Love the Royal Reds for dinner and even proposed to girlfriend at the hotel.", "title": "Nice view, but small cleanliness issues", "helpfulness": 1, "user": "COBB64", "date": "August 22, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117107925}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We checked into the hotel early afternoon on a Sunday, and it was slow. The desk checked us into the type room we reserved (oceanside), and they greeted us with the Hilton Club Member Bag. There's 2 bottles of water and some area coupons in the bag. We stay at HGI quite often, because most are new and are well kept.", "title": "wonderful 1st family vacation", "user": "tinapuckett", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116963076}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "This hotel is in a nice location, and there is a small parking garage. The views are nice from the oceanside rooms, but there are just some minor cleanliness issues that stuck out some. There were some discarded beer containers below our room, which I could see from the 4th floor. There were several including some of the cases the cans came in. Now, I don't expect this not to happen, but we were there a better part of two days and noone picked it up. This morning when we were leaving, apparently the garbage out behind the hotel (on the beach side) was enough to attract the rats.... Yes, there were rats crawling around the hotel at about 0830 in the morning. If this had been at 1 a.m., I may have not given it a second thought. After all, rarely have I seen a rat so bold as to be out during daylight, except in New Orleans....", "title": "Great location, dated facility", "user": "BrittanyDalomba", "date": "August 16, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 116828752}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Maybe a little more attention to the exterior of the building could prevent this again. Just a thought.", "title": "Very good hotel, but...", "user": "Majica26", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 116378345}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We spent two nights here and found it convenient and comfortable. We paid extra for a beachfront room and really enjoyed sitting on our balcony just yards from the dunes. However, for breakfast, we skipped the $10 buffet and bought muffins at the nearby Publix the night before. We enjoyed breakfast on our balcony using our own coffee maker.", "title": "Nice relaxing place!", "helpfulness": 1, "user": "Grandpa117", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118467944}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Everyone was very friendly and we enjoyed the little complimentary extras like afternoon cookies and the Wall Street Journal in the morning, not just the USA Today.", "title": "Nice little hotel", "user": "vsikes", "date": "September 12, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 118035736}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Overall, it is an excellent value.", "title": "Weekend @ Orange Beach, AL", "user": "CharlieTowers", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118021592}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "This was a typical Hilton Garden Inn, however, the staff was very friendly and helpful. Breakfast was great. The iron in the room we needed to stay in needed to be replaced but everything else worked as expected. There was a small refrigerator and microwave in the room also. Great room for 2/3 people.", "title": "Great stay-- we will be back soon.", "user": "ASandlapperAbroad", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 117997511}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Hotel Facility: very clean, staff is very kind, 10$ buffet breakfast (includes ommelettes, etc) is a great deal!!!...the hotel is right in front of the beach, you only pay 25$ for two bed type chairs and the parasol....the beach is nice and clean.", "title": "Our Stay was Wonderful!", "user": "valerie l", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117974106}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The air conditioning malfunctioned at the condo we had rented leaving us in need of immediate relief (my husband was beginning to feel sick with the indoor temp near 100) at midnight. Patty at the front desk was so helpful, first giving us suggestions over the phone to try to help restore the air at the condo so we wouldn't have to move, and then warmly inviting us to stay at the hotel. She even phoned our room after we arrived to personally check that all was comfortable for us there. The room was clean, well decorated and everything we would expect. I was amazed that we were able to get one on such short notice at the start of Labor Day Weekend. We have eaten the $9.95 breakfast buffet with custom made omelletes, pancakes and waffles many times while staying in a condo in Orange Beach and it is always excellent (best sausage I have EVER tasted). The indoor/outdoor pool is small, but of course the oceanfront location is the most important feature. We will definately return.", "title": "Great experience.", "user": "JustHavnFun2", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117589054}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This hotel was wonderful. While it does need updating, the staff absolutely makes your experience at this hotel wonderful. I called from down the road at Hampton. Hilton had 3 rooms left and Sheena held one for me. I was there in five minutes. Sheena was very kind and pleasant and then I meet Josh. You have a gem in Josh. He is funny and very accomodating. The only complaint I have is the temperature of the elevators and hallways...a little warm! My daughter and I had breakfast the next morning at the hotel and it was delicious. Daniel was our waiter and we enjoyed listening to his accent. My compliments to the chef...breakfast was wonderful! Coming to Hilton Garden Inn was the icing on the cake to our little weekend trip.", "title": "Loved it", "user": "Good4Bama", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117555188}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here for 4 nights. Check in was speedy and all the staff was very friendly. We had hoped to get a beachfront room, but we got a poolview with a small view of the beach. Our room was on the second floor, only one level over the pool and our balcony was right over the noisy pool filter (see photos). I wanted to get another room, but they seemed to be full when we checked in, so we just stayed put. So much for hearing the ocean waves. If you stay here, be sure to ask for a beachfront room.", "title": "If you stay here, get a beachfront room.", "user": "FunToReview1", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117531562}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The room was adequate. Included was a fridge, coffeemaker and microwave which was handy. The TV was tube style, (not a flat panel) set inside an armoire. The bedding was all white and seemed clean. The bathroom was small and very dark. Forget about plucking your eyebrows in there. Bathroom fan was definitely a plus. Lots of towels, a hairdryer, iron and ironing board. NO ROOM SAFE! This is very important especially when going to the beach and you want to leave your wallet behind. Overall the room was fine and maid service came early every day. Daily newspaper was delivered at door.", "title": "Gets better every time!!", "helpfulness": 1, "user": "happypatron22", "date": "August 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117275023}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The pool is really small. Towels are provided. There's a poolside bar. Don't order a daquiri there. You'll be overcharged and very disappointed. We had breakfast the first day, but the food was on the lukewarm side. Instead we went down the road a bit toward Gulf Shores to the Waffle House. The food is really delicious, made fresh, served hot and the staff is super friendly and will remember you if you go back. We went 3 mornings in a row.", "title": "Still Good", "user": "Nashville10", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117237464}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This hotel is on a prime piece of real estate, the owner need to put some cash back in for renovations. Staff is very nice! New Hampton by Hilton just down the road will cut into this hotel's bottom line it seems (the Hampton was full or I would have stayed there)...", "title": "Outdated but nice staff", "helpfulness": 2, "user": "daisy20071960", "date": "November 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120017872}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The entire staff at this property is well-trained and very courteous. The location is superb, directly on the beach. Our room was spacious, well-stocked and very clean. The TV was not a flat-screen but functioned very well. The a/c was an upgraded system and worked nicely from a wall thermostat. The gulf view is beautiful. Beds were adjustable for firmness. The breakfast buffet costs $10 and was worth the money. We thought the off-season daily rate was high, but this could be from lack of competition in Orange Beach. There are very few motels, and most rentals are the condo-type long-term rentals. I thought it was odd that the breakfast server did not bring a credit card receipt back to me, but that could have been due to him being a new hire. When I requested a receipt, he brought it to me immediately.", "title": "Attentive Staff And Great Location", "helpfulness": 2, "user": "Cruiser100", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119565047}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I stayed here with 2 other friends. We were driving from Chicago to Ft Myers, FL and it was a great stopping place. Enjoyed our walk on the beach before we departed in the morning", "title": "Great place to stay right on the beach", "helpfulness": 1, "user": "ozzie11_11", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119271435}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "There was nothing wrong with this hotel other than the slow small elevators. We visited on a very busy fall long weekend and the elevators are just way too small for people hauling all their beach stuff (chairs, coolers, etc.) Also, there is NO view from the balcony if you don't have a gulf side room.", "title": "just so so", "user": "janaroo22", "date": "October 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119181792}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed two nights/three days at the Hilton Garden Inn, Orange Beach, AL. I was able to get a good state government rate.", "title": "Excellent Weekend!", "user": "nola1961", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119148809}], "location": {"country": "United States", "city": "Orange Beach"}, "stars": 3, "variance": {"poor": 27, "average": 58, "very good": 99, "terrible": 17, "excellent": 149}, "aka": "Hilton Garden Inn Orange Beach Beachfront Hotel", "slim_ranking": 0.388888888889, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Hilton Garden Inn is centrally located on the beach, in Orange Beach’s famous white sand paradise mere footsteps from local casual and fine dinning restaurants, night life, specialty shops, water sports and family attractions. You’ll enjoy captivating panoramic views of emerald green waters and miles of sugar white sand on Alabama’s famous Gulf Shore. Amenities include oversize guest rooms with private balconies, full service breakfast cafe, indoor/outdoor heated pool & hot tubs, seasonal tiki poolside bar, 2,000 square feet of meeting space, fitness center, 24 hour free business center, free local calls, HBO and Wifi. We are owned by Innisfree Hotels a company built on the concepts of fun, relaxation, exceptional service and guest satisfaction."}