{"user_rating": 4.0, "review_count": 413, "name": "Hilton President Kansas City", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed at the Hilton President for one night at the end of April. Beautifully restored property, excellent bell service, spacious room, on the street but very quiet. (I actually think we were there on an unusually quiet weekend in KC and a relatively quiet weekend for the hotel as well, so did not have excessive waits or issues with noise as others have reported). Found the location convenient - guidebooks had mentioned that you needed a car to get to many of the attractions in KC and we found the power and light district fun to walk around. Only complaint was the fact that the front desk staff was competent but not very welcoming. We would book here again if in KC.", "title": "Classy well run Hilton", "user": "CTtraveler53", "date": "May 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130135906}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "This hotel has the most comfortable bed I've ever slept in! I wish I could replicate it at home. Very nice facility in a nice location near nightlife. Several restaurants nearby. Very accommodating staff. Good breakfast.", "title": "Lovely hotel, good location", "user": "March06_56", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129948444}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "As others have noted this Hilton property is unique in regard to its historic nature and its excellent location footsteps away from the Power and Light District. (Be aware that this is a Downtown hotel - If you are looking to tour the area you will have to drive.Just as you would from any downtown hotel in any city. If you want to be downtown or near the Power and Light District, this is the ideal place for you!) Hilton has done a great job in renovating this Kansas City jewel and certainly a peek into the lobby should be considered even for non guests.", "title": "A Grand Dame Hotel in a Superb Downtown Location", "user": "travelnrelax", "date": "May 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129791226}, {"rating": 3.0, "stay_parameters": "Stayed May 2012", "text": "Upon first arrival we discovered that all the street spaces in front of the hotel were taken and no Doorman or Valet was to be seen. Space to unload a car in front of the hotel is extremely limited.", "title": "Off the beaten path - not in a good way", "user": "love2Et", "date": "May 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 4.0}, "id": 129534938}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Truthfully, during our entire stay we only saw one bellman at the hotel – so based on that we would have to agree with the other comments that have been made here regarding the Valet. From our experience Valet service was nonexistent.", "title": "Disappointing for a Hilton", "user": "Itzalittlesecret", "date": "May 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 129457350}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "When we first arrived there was only 1 person working valet, he actually had to ask us to take up our own luggage on a dolly since he would have to park the car. I wasn't thrilled that we were tipping him to turn around and have to take up our own bags. This was not the only problem we had with valet, when we were leaving it took almost 45 minutes for them to pull around my brother-in-laws car. It also took 30 minutes for anyone to come up with a dolly to take our luggage down.", "title": "Beautiful hotel, poor service", "user": "NewYorkCityGuest", "date": "April 26, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 128649830}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Also, we had a couple friends that arrived late Friday night. They were the first ones to make a reservations. When they arrived the front desk advised them that there room was not available and the only room that was available to them was a king size bed with NO windows. They had reserved 2 double beds and should receive 2 double beds. Once they pressed the issue the front desk said they did indeed have a room with 2 double beds but it had not been cleaned. I assume that if the hotel is completely booked, then all the rooms should be cleaned and ready for guest at 3pm for check in. This was 11:30PM and their room was still not ready.", "title": "Nicely restored art deco building", "user": "V_Pontchartrain", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 128490838}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Lastly, there was a shuttle that was supposed to pick us up the night of the reception and take us back to the hotel. There was a shuttle but it was so full that not all of us could fit. The shuttle never came back for the extra guests, and me and my husband. We ended up walking back to the hotel after waiting longer than we wanted to. It was extremely windy that night and not the greatest conditions for me to walk back in my wedding dress. When we complained to the night manager, he had not explanation or compensation. He did nothing to make the situation better. He acted as if he had not power to do anything for us.", "title": "Old but Nice.", "user": "RoadTrip2NoWhere", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128458222}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Overall, there was a lack of service and consistency. We chose this hotel because it is a Kansas City landmark but instead we got a mediocre hotel with mediocre service. We were given excellent service everywhere we went in Kansas City but it is unfortunate that the weekend was tarnished by the President Hotel.", "title": "Perfect hotel/perfect stay", "user": "David W", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128273633}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "We spent one weekend in Kansas City and this hotel was a very good choice, being within walking distance to the new Kauffman Center for the Performing Arts. The very lively Power and Light district is also very close. Actually, we could hear the noise from the bars late in the night (only Saturday). A lot of restaurants to choose from within 5 min walk.", "title": "Beautiful, old hotel in a wonderful location", "user": "Stacy T", "date": "April 20, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 128248028}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "extremely disappointed with our stay at the hotel on so many levels! NEVER again.", "title": "Offered a room with NO WINDOWS!", "helpfulness": 1, "user": "lola_cyb425", "date": "April 19, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 128205393}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "1. bc of a delayed flight, we didn't arrive until 11:30 pm. the doors were locked (after 10 pm...understandably for safety reasons). BUT, we rang the door bell and stood outside for 5 minutes while there were 2 staff members at the front desk!!! they were helping people but STILL?! you can't hit a buzzer to let us is?!?! FAIL 1. we ended up having to walk around the corner THROUGH the CROWDED bar to get to the lobby.", "title": "Second time around and I'll keep coming back!", "user": "tfurg69", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128136681}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "2. upon checking in, we requested that we change to from 2 doubles to a queen if it was available. apparently, the ONLY room available was the \"quietest room in the hotel but it doesn't have any windows\". Are you KIDDING me with this nonsense?! So pretty much, if our plans did not change last minute, we would have had to share a room with another couple with no windows? how does a hotel like this do business?! after much going back and forth, we had to settle with that room or have no room at all. there was no other option they were giving us. they did offer a lower rate, but that wasn't making us feel better about a room with no windows, on the 13th floor! creepy! but, my husband didn't give up and almost getting to the elevator, turned right about. the thought of sleeping in a room with no windows really creeped him out. then 10 min later (i stepped into the bar at this point) a room MAGICALLY appeared. APPARENTLY, there was 1 room that they thought wasn't cleaned so they did not want to give it to us. but someone went upstairs to check and it was indeed clean and they gave it to us. What boggles my mind is, why the HECK aren't ALL the rooms CLEANED if they are telling us the hotel is booked for the weekend? what happened to our original reservation? and why in the WORLD do they even offer a CLOSET as a room? Hilton President, you failed MISERABLY. they did offer us breakfast for one day, but that will never get those 45 min lost of misery at midnight. 3. our room was never cleaned after our first night. housekeeping came by when we were still in the room and we asked that they come back in 1 hour. nope. they did not. no fresh towels or anything.", "title": "A delight", "user": "TheWilyFox", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128070418}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "This was my second stay at the Hilton President. I am blown away by the service and location of this hotel. I'm loyal to Hilton, and would love to have the company benchmark the Hilton President as a hotel of excellence. I thoroughly enjoy the Drum Room for drinks, dinner, and music. The \"Rat Pack\" feeling is still very alive in this hotel...it is alluring. The decor of the Drum Room, lobby, and rooms is classy, clean, and sophisticated. The option of self-parking is a nice perk as well. I do love valet service; however, their self-parking is on premises. I enjoy their location immensely, as they are within a five minute walk to the Sprint Center and the Power and Light District. The front desk employees are super courteous and professional. I am simply blown away. I stayed at the Hilton President two years ago and had the same experience...which was the reason for me staying here again. I ALWAYS compare other Hilton hotels to the Hilton President, and find that the President is always on top. The only other Hilton that I have stayed at which could come close to the President is the Hilton at the Ballpark in St. Louis.", "title": "Classy, unique", "user": "craig h", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 128007773}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "A lovely hotel with character in a great location. My room was very comfortable and clean and the bathroom was great. Situated downtown, it is right on the doorstep of the Power and Light district where everything happens. The staff showed that wonderful American hospitality and were so friendly and helpful at all times. It provided a very relaxing and tranquil base from which to enjoy the best Kansas city has. Would recommend it to anybody and would definitely stay there myself again.", "title": "KC Power and Light District", "user": "55Fordlady", "date": "April 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127921849}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We haven't stayed in downtown Kansas City for nearly 10 years, but we were ready to explore the Power and Light District and selected what we thought would be the closest hotel to the area. We were delighted to find the Hilton President in excellent condition and updated throughout! Parking was convenient, the Drum Lounge served good drinks and had great service. The walk to the Power & Light District was short and easy and we had no problems finding landmarks and negotiating the area. The standard hotel room was quiet, the bed was just right and the bathroom was modern and spacious. The next time our travels send us to downtown KC, we will definitely stay at the Hilton President.", "title": "A Pleasant Surprise!", "user": "GOmaha", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130590139}, {"rating": 3.0, "title": "There for wedding", "text": "Wedding venue superb. Rooms ok. Needs better airconditioning. Friendly staff. Needs more staff. Inexpensive for area. Good bar", "user": "PhiladelphiaSbb123", "date": "May 22, 2012", "id": 130431585}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Yes its in a good location. Yes it has some great architectural history. No the rooms are small. No they charge you 18.00 to park at their garage. No, the breakfast that they had the nerve to charge 15.00 for was gross and unedible. Mix eggs, oily sausage and bacon with no flavor. I wouldnt have paid 5.00 for this meal and our table came to 150.00. I asked where my minon and lobster was??? Skip this overpriced hotel. You do not get your moneys worth!", "title": "Disappointing to say the least.", "helpfulness": 2, "user": "kansascoach1", "date": "May 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130364339}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We spent a recent weekend in kansas city for my 21st birthday. this location was ideal because it was walking distance to power and light, as well as right downtown. the building is so beautiful and just by looking into the lobby/common areas of the hotel you can obviously tell up keep is a main priority. the rooms were lovely, totally spacious. i was surprised that internet was free and that valet parking was only $2 more than self parking (pleasantly surprised on both accounts). all in all this was a great trip and next time we are in kc we look forward to staying with them again.", "title": "wonderful property - lovely staff.", "user": "graffpaper", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130348219}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Me and a team of my co-workers stay at this hotel regularly, once every months. The place never disappoints. The rooms are very clean and well appointed, the staff is nice, and the breakfast is tasty. This place is located in the middle of Power and Light district and is close to a lot of good dining choices.", "title": "Great place in the middle of Power and Light District", "user": "Dmitri-TX", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130216226}], "location": {"country": "United States", "city": "Kansas City"}, "stars": 4, "variance": {"poor": 19, "average": 60, "very good": 128, "terrible": 21, "excellent": 185}, "aka": "Hilton President Kansas City Hotel", "slim_ranking": 0.144144144144, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "AAA Four Diamond award winning hotel, and the only hotel in the new Power and Light entertainment district. The hotel was originally opened in 1927, closed for many years. Re-opened in 2005 after a 45 million dollar renovation. This stunning hotel is truly one of Kansas City's grand hotels."}