{"user_rating": 4.0, "review_count": 1282, "name": "Hilton Reykjavik Nordica", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Stayed at this hotel as part of a package from Icelandair, which included flights, room only and trip to Northern lights, at a cost of £299 per person for 3 nights.", "title": "Excellent Service, Fantastic Fine Food", "helpfulness": 2, "user": "juejosh", "date": "January 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 93228735}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We had emailed in advance to the hotel requesting a room that was accessable by lift etc, as I have mobility problems, and on arrival were checked in swiftly; Our room (427) was near the lift (occassional noise heard from it but nothing to moan about) and was a fully accessable room with plenty of room to get in and move about in my chair.", "title": "Pleasant Hotel let down badly by it's Restaurant (Staff)", "helpfulness": 1, "user": "CheshireCat99", "date": "January 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 92761466}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The room had tea/coffee making facilities, tv with BBC, ITV and CNN BBC world news plus several icelandic stations 2 of which had english/american programmes with Icelandic subtitles, iron & board, adjustable clothes rail, electronic safe, clock/alarm and comfy beds.", "title": "If you don't mind its location, the Hilton is a great hotel", "helpfulness": 1, "user": "dfisch891", "date": "January 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 92317452}, {"rating": 4.0, "title": "Nice hotel", "text": "On our email we also enquired about adding breakfast, which was 2150ISK per person, which we did as the hotel was far out, however this is my one disappointment in the hotel - we had pointed out that we would not be wanting breakfast on the last day as we were leaving at 4.35am, and although the grab an go breakfast option started at 4.30, so early in the morning and having to be lifted on/off transfer coach would mean I would be unable to eat the breakie without being sick, I was informed though that as we had asked to book the breakfast we would be charged for all 3 days!! I do think that is out of order - that if you have a breakfast and you are charged for all days of your stay - or dont have any!!", "user": "mcfTo", "date": "January 8, 2011", "id": 92221291}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "The breakfast first day was served in a conference room as the retaurant was having maintenace work done and the staff seemed a little out of sync; there was the usual range of breakfast items, hot and cold, juices and tea/coffee, it was ok but it wasnt outstanding. The 2nd day was back in the restaurant, there seemed a little more things in the buffet, but it was still only ok.", "title": "Great Buffet Breakfast on good bus line, Classic Nordic decor", "helpfulness": 1, "user": "scappoose29", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 91459190}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Super country - really friendly, lots to see and do, easy to get around. Really enjoyed our trip. Spend the extra money on the 4WD excursion to the glacier and snowmobiling - expensive but a great day. Nice hotel, plenty room for the 3 of us in the one room and good sofa bed for teenage son. Hotel is just a bit out of the town and needs a taxi each way. Cost around £15 each way.", "title": "Winter Wonderland", "user": "Highlander27", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 170169909}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We spent 4 nights at the Hilton in March. The hotel is clean, modern with all the amenities one would expect. Staff are helpful, friendly and efficient. Our room was nice and spacious. Breakfast was very good with a great selection of freshly prepared food; though a bit on the pricy side. Given alcohol prices in Iceland happy hour is a great deal and the cocktails are excellent. If we had one niggle it was the fact that internet access was an unnecessarily expensive extra.", "title": "Great hotel, 20min walk from town", "user": "Matt_M_London", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 156635780}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Friendly and helpful staff. Slightly out of the way, need to take taxi (around ISK2000) to downtown. Stayed for 6 nights, we booked a room with view. I think it was worthwhile to book the room with a view since we stayed a few days and had a more relaxed sightseeing schedule.", "title": "Great staff, beautiful view, slightly out of the way", "helpfulness": 1, "user": "Goodtrip2222", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 156568727}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We recently spent four nights here over the easter weekend. The hotel staff were very welcoming and the hotel has all the amenities you'd expect of any Hilton anywhere. We were in an executive room on the ninth floor so it was a short hop downstairs to the executive lounge. The lounge was quite busy during the free bar hours (6pm to 8pm). In high summer when the hotel is full,I imagine space would be at a premium. The view from the lounge is amazing,looking across the suburbs and the bay to Esja,the mountain that overlooks the city. The lounge is a self serve affair, which I prefer,with plenty of evening canapés on offer to accompany your drinks. Cooked breakfast is also free in the lounge.", "title": "Fantastic hotel,slightly out of town,small executive lounge,shuttle bus.", "helpfulness": 2, "user": "rolaaand", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 156531187}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Our room on the ninth floor faced out to the back of the hotel, no mountain view, but the room itself was large and comfortable. There is an excellent tour booking office in the lobby. We had booked most of our tours pre arrival but had not booked our last day. Our flight was at 8 pm and we wanted to book a through ticket from Reykjavik to the Blue Lagoon to the airport. I think because it was easter Monday,the busses were less frequent and finished earlier from the Blue Lagoon to the airport. The tour office got us a VW Golf for the day,one way rental to the airport for about £50 (€60) ($90). Good service,good value.", "title": "Executive level is worth it, be aware is not in city center", "helpfulness": 1, "user": "Jennifer C", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 156451845}, {"rating": 5.0, "title": "Best Hotel to stay In Reykjavik when you have a Car", "text": "Didn't have much of a choice but to stay at this hotel when we booked a package through Icelandair, because we would have preferred a hotel more in the heart of the city. But when we decided to rent a car to do our own exploring instead of relying on tour guides, we realized that this hotel ended up being the best choice for us after all. What was so great is that it took us only 5 min to get to all the shopping, restaurant and bars, and there was alway complimentary parking space right in front of the hotel whenever we returned. The Hotel was right by a major intersection so every time we wanted to venture out, it took us no time to get out of Reykjavik. Besides the location, the breakfast spread was fantastic, the bar area was great for hanging out, the room and the bathroom were spacious and the bed was very comfortable. Also, just loved the lady who was working in the tourism office. She was so helpful and patient with us. She really helped us making our first trip to Iceland better than ever imagined.", "user": "Beachlove08", "date": "April 15, 2013", "id": 157878112}, {"rating": 5.0, "title": "Great hotel", "text": "Stayed at the location for 7 days in mid April. Tje hotel is very nice, rooms were clean and staff were very nice and helpful. I have seen people complain that you had to pay for wifi, however it is free in the lobby and restaurant. Only problem is that the hotel is a minute car ride from the downtown. Breakfast was very good. However I did find the Vox restaurant to be over priced and over rated. Otherwise great experience.", "user": "Yashinr", "date": "April 15, 2013", "id": 157819286}, {"rating": 4.0, "title": "Lovely hotel!", "text": "Booked through Iceland air, the staff were polite and helpful. Breakfast was a lovely treat in the morning with all you could possibly want, this was included in the package deal we booked! Although the hotel isn't in the heart of the city, there is a bus stop located at the front of the hotel, and while your a guest at the hotel you are entitled to a free bus pass for the duration of your stay, which allows you all over the city. If you have free time time there is a free gym you can use located on the 2nd floor and a spa (an additional fee but still worth it!) If your planning on booking some trips there is even a booth/room with helpful staff (seperate to the Hilton, I believe) who will help plan your perfect trip. Over all I was very impressed with this Hotel and the high standards that are kept daily. The only niggles were the fact if you wanted to use the wifi you had to pay for it, which in this day and age I find unnecessary.", "user": "Sarah388", "date": "April 14, 2013", "id": 157690793}, {"rating": 4.0, "title": "Wonderful hotel, not quite conveniently located", "text": "We booked this through an Icelandic Air vacation package, we were so pleased that our room was ready when we arrived at 8:00am after a red eye flight. The breakfast buffet was in the grand German/Scandinavian style: cold meats, smoked fish, a variety of breads, sweets, cereals, cheeses, yogurts, hot breakfast items (eggs, bacon, pancakes, etc.). Lovely - on the expensive side, but worth it for the quality and variety. Beds were lovely and comfy, my son slept on a pull out sofa/chair, also quite comfy. Bathroom was very efficient and had a well laid out design. Pet peeve: charge for in room internet access was annoying and expensive. Only real downside was the location - taxis were expensive to downtown (approx US$20 for a relatively short (1-1/2 mile) ride).", "user": "mkhtl", "date": "April 9, 2013", "id": 157213932}, {"rating": 4.0, "title": "Good hotel, a bit off the beaten path", "text": "We stayed at this hotel 5 nights in late March as part of an Iceland Air package. The package had guaranteed room availability at 10 a.m., but everyone who got there at 8 a.m. from US flights had a room ready. Breakfast buffet was included only on the arrival day, but we found it worthwhile to get a package for the remainder of the trip at about $18/per person per day. It is essentially surrounded what we would call a strip mall, about a mile from the start of the city center. The hotel gives you a bus card pass to use, which is well worth using, since there are 3 or 4 bus lines that take you to the main city stop. Cabs are ridiculously expensive. The hotel restaurant for dinner was very expensive and we avoided it.", "user": "larry1005", "date": "April 8, 2013", "id": 157016111}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Great hotel.", "title": "Modern stylish in a Nordic style.", "user": "DanC-in-USA", "date": "November 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 120834267}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Beds are very comfortable. The rooms are very typical of european hotels, compact but very stylish. The shower was excellent. The room was very warm, but the windows could be opened to allow some fresh cool air. The in house resturant is very good as is the hotel's Bar.", "title": "You get everything you expect from Hilton. We were very much satisfied.", "user": "happymamimi", "date": "November 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 120824321}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The in-house spa is also very good.", "title": "Modern and cool hotel, just like Iceland!", "user": "FloridaUSA", "date": "November 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120778778}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "A slight negative is that it is out of the town centre a little. BUT, the town centre is only a comfortable 15 minute stroll away. There is public transport available.", "title": "Great Hotel", "user": "ETP10", "date": "November 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120626048}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Happily stay here again.", "title": "Excellent Choice", "helpfulness": 6, "user": "Tollhouse", "date": "November 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120555125}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Wonderful! Clean! Friendly Service! I would highly recommend this property. Beds very comfortable...rooms plenty big for 2. We had room 610 and it had a wonderful view. Elevators ran fast. We took advantage of the happy hour 5-7PM daily on beer. Takes about 20 min. to walk into town. Very close to local swim spot and great hot dog stand. Coffee shop right next door. The only bad thing was my key card to the door kept deactiviating and like others had mentioned the TV would not turn off at times, but nothing unplugging couldn't solve.", "title": "Great place to stay!", "helpfulness": 1, "user": "GoBeavs", "date": "November 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121094576}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Nice hotel, excellent gym that is included, great breakfast buffet. Free wifi in rooms. Definitely ask for a room facing the water/mountain. There is a free shuttle that takes you downtown but only leaves about 5 times throughtout the day. Nordica spa is located here ( jacuzzis, sauna, massages), looks very nice but comparable to most nice spas in the US ( i live in miami and we have plenty of elaborate spas). Overall great hotel minus its location. Ate at Vox, the restaurant in the hotel, which was excellent, just pricey.", "title": "Great hotel, 25-30 min walk from downtown", "user": "MindyG1981", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121087225}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Really enjoyed my 4 night stay recently at Hilton Reykjavik. We decided to upgrade our room to an executive room whilst here for not much more cost on the standard, definitely a wise decision. Included in this was use of all the hotel leisure facilities (and massage) complimentary Canapés and drinks in the lounge and also a larger room with sea views. This upgrade paid for itself really when you look at the cost of alcohol in bars in Iceland.", "title": "Lovely Hotel! Great room, staff and food", "helpfulness": 1, "user": "jonny_spew", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121082982}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "The breakfast selection was great and the staff very friendly. The in house tour desk was also useful and not over priced compared to other companies as I anticipated.", "title": "Great facilities and service but far from city center", "user": "J S", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121069125}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel is based a little out of the centre being a 20min ish walk but there is a free shuttle service to and from the city for those lazy days.", "title": "Overrated hotel", "helpfulness": 2, "user": "piopio_54", "date": "November 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 121056567}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I chose the Hilton through an Iceland Air package for the Northern Lights tour. When I arrived the checking in was friendly and quick - the staff were very helpful with directions and pinpointing locations on the free maps. The decor is very modern and spacious. All very pleasant.", "title": "A very warm hotel for a very cold visit!", "helpfulness": 1, "user": "Zarafa73", "date": "November 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 121055830}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "My room was at the rear of the hotel, so I didn't have the view of the bay and sea - a shame, but I had no reason to complain as the room was excellent. Clean and warm and spotless as it should be. The bed was very comfortable, not a silly spongy mattress like some hotel beds can be! I sometimes suffer from back ache and very soft beds don't help. This was firm, but not hard - so perfect [for me].", "title": "Beautiful clean sharp friendly hotel.", "helpfulness": 1, "user": "Travelcl", "date": "November 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121001013}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The bathroom was compact, but very well designed and the shower had instant hot water at an excellent pressure. Rooms were cleaned daily [as expected].", "title": "Good hotel - long walk to centre.", "user": "JAS02", "date": "November 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 120919512}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The room also had a mini bar which automatically charged items to your account if removed from their respective slots.", "title": "Price worthy", "user": "knutmosk", "date": "November 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120914982}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "We ate at the Vox restaurant and the food was amazing! plus the service was very good. Attentive, but not invasive.", "title": "Not really close of the town...but a really good hotel", "user": "thedreamerMontevideo", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 120850711}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Have no doubts when booking this hotel. My diamond status with Hilton honored, the room was lovely, the staff OUTSTANDING. The price was VERY reasonable. The spa is lovely, nice walk into the city center, or a free bus pass can be obtained at the front desk. Staff in the executive lounge very professional, and helpful. The food in the VOX is the BEST hotel food ever, only complaint is that I may have gained 10 pounds from the awesome food here! Great vegan restaurant across the street too (Glo). This was our first trip to Iceland, and would stay here again NO DOUBT. Sincere thanks to the front desk, the executive lounge, the Vox staff, housekeeping and the travel planners downstairs. Iceland was the BEST vacation I have ever had, what a beautiful country with such kind, soft spoken and gentle people. Thanks for making us feel at home Hilton!", "title": "AWESOME hotel", "helpfulness": 1, "user": "daisy20071960", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158934131}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Enjoyed first trip to Iceland and stay at Hilton Nordica. Location is not a problem because the bus to downtown is right at the hotel and they will loan you a bus pass for use during your stay for up to 3 people. It only takes 5 minutes or so to get downtown. Rooms were small, but clean and crisp. Windows open -- something I always like. Hotel lobby is a nice place to relax and there are snacks available for purchase 24 hours. Staff was helpful and we enjoyed having access to a computer and printer for preparing boarding passes, etc. The best part of this hotel is the roll-in as part of an Icelandair package which allows early checkin. When flying from the East Coast of the US, you can arrive at 6 a.m., grab a few hours sleep to \"catch up\" and be in downtown Reykjavik for lunch by 11 or so. Really cuts down on the jet lag.", "title": "Icelandair Package Makes it Worthwhile", "helpfulness": 1, "user": "MeginOz", "date": "April 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 158882956}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed at here for 4 nights on an Iceland Air package, booked through Travelzoo. The trip was excellent value. Our room was a standard room, which was compact, but clean with everything we needed. We were at the front of the hotel, which gave us lovely views of the mountains. Ask for a room at the front as the back overlooks the car park. I had enquired before we travelled about the cost of upgrading to the Executive Floor and it was 14,000KR per night (approx £80). We thought we wouldn't use the facilities enough to justify the extra cost. When we arrived at the hotel and saw the prices of the drinks we realised we would easily spend this amount. The cost also included breakfast, as ours was a room only deal. The upgrade also included use of the lounge all day with free tea, coffee and soft drinks, afternoon tea and canapes and happy hour for 2 hours. We also got free internet access, which worked in our room as well. We went to Reception to upgrade after we had unpacked and said we wanted to upgrade to the Executive Floor facilities but couldn't be bothered to pack and unpack again. We were offered the option of keeping our room and having use of the Executive Floor for 5,000KR per night (approx £28. This worked out really well for us and we easily used more than the cost, well worth paying for. The staff on Reception and on the Executive Floor were really helpful and friendly. As mentioned before the hotel is a short distance from the main town, but we didn't find this a problem. We used a mixture of the bus (with the free pass from the hotel), walking and taxi. There is a nice shopping mall 10 minutes walk from the hotel. We found it a nice spot as it was away from the hustle and bustle.", "title": "Worth Every Penny", "user": "Caroline B", "date": "April 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158866134}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "A lovely hotel, staff were very welcoming. There was an error at check in (we were incorrectly placed in a twin room) but this was resolved very quickly.", "title": "Great Stay- not so great location", "user": "dumbo77", "date": "April 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 158739606}, {"rating": 4.0, "title": "A good \"base camp\" for exploring Reykjavik and Iceland", "text": "The rooms are spacious and comfortable, the breakfast is delicious and the bar has a \"Happy Hour\" between 17:00 and 19:00, which is worth going to as Reykjavik is expensive.", "user": "A TripAdvisor user", "date": "April 24, 2013", "id": 158664883}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This was a great hotel for our trip. We booked along with our flight and were pleasantly suprised. It was very clean, great showers, comfortable beds, and nice staff. The tourist office in the hotel was very helpful. The only draw back was that it was not in the center of the city, but they had shuttles that could take you downtown and for most day trips if booked before would pick you up directly from the hotel. Nice place to relax after a long day out in Iceland. I didn't try the spa, but a friend of ours did, said it was nice enough.", "title": "Very Comfortable Stay", "user": "sjsunde", "date": "November 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 88686887}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "Spent three days here and loved it. Staff was very good. Single room was small but adequate, didn't spend much time there. Room was very clean. The breakfast buffet is an absolute must! Cab stand out front, not as expensive as I was led to believe. Long walk to downtown. I'm comming back in march and will stay here again!", "title": "Excellent hotel", "user": "ChuckD1025", "date": "November 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88421255}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "This hotel was amazing. The rooms were fantastic. We had a really spacious family room, all done to a very high standard. The staff at the hotel were fantastic, and very child friendly.", "title": "Wow !", "helpfulness": 1, "user": "Holiday_Monkeys", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 86309380}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "There is a great travel agent in the hotel that will help you book trips, they were very helpful too.", "title": "Would love to go back!", "user": "Akey99", "date": "November 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 86006878}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Breakfast was lovely. Buffet style - from cereals to cooked foods, plus fruit, yoghurts, pastries and cakes.", "title": "Good Solid Hotel", "user": "srm1977", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85565841}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "The Hilton Nordica is a comfortable hotel, typical of a Hilton anywhere else. The rooms are good sized and the decor is modern. Housekeeping staff did a good job of cleaning and restocking the room and were quite courteouse when I ran into them in the hall. My only complaints were the relatively high cost of Internet service and that I had to get a new Internet card from the front desk everyday if I wanted to apply the charges to the room.", "title": "A good choice in Reykjavik", "user": "joeb1249", "date": "January 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 95109009}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Breakfast was included in the room charge and the morning buffet offered good quality and attentive service. The cost seemed rather high if you had to pay separately, as we did on the morning of our arrival.", "title": "A great hotel.", "user": "camack100", "date": "January 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 94581624}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The location of the hotel isn't ideal, but the taxi charges were reasonable when we went into the city center. All in all, the Hilton Nordica is a good choice if you have business in Reyjakavik.", "title": "Adequate, not special", "user": "chilternwelshman", "date": "January 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 93886543}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I thought this hotel was fantastic. The staff were more than happy to help with anything you wanted and were more than happy to make personal recomendations.", "title": "good hotel - a bit out of town", "helpfulness": 3, "user": "banner65", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 93631575}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Iceland is expensive, however the hotel bar had a half price happy hour and a good bar menu.", "title": "Great hotel, a little out of town but the room make it worth it!", "helpfulness": 2, "user": "hisokajp", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 93416717}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "The rooms were modern and very clean, Staff were friendly and more than happy to help. Rooms were cleaned daily and one of the few places where it is done properly. out of all the places i stayed on my 30 day Euro trip this was the place i enjoyed most. The hotel is a little out of the center of town but is walkable if you are keen, but they have a courtesy bus to take you into town which makes it handy. For the price booked with icelandair i felt i got a pretty good deal, would recommend this to all who are staying in Reykjavik Iceland.", "title": "Great place to stay", "helpfulness": 1, "user": "Whydowehavetogohome", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91068836}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Just spent 3 nights in the Nordica and had a great time. Much better than Hiltons I've stayed in before. Very modern, clean and comfortable but with nice, traditional touches eg. The Yule Lads left a Christmas gift on our door handle each night!", "title": "A very pleasant place to stay", "helpfulness": 1, "user": "DDs42", "date": "December 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 90901347}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "Food was good if a little pricey but that's Iceland for you.", "title": "Really nice hotel, with a few drawbacks", "helpfulness": 4, "user": "westcoastgal1212", "date": "December 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 89476835}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Location could have been better but it really isn't that far into town.", "title": "A good hotel in Reykjavik", "helpfulness": 1, "user": "Pretzellogix", "date": "December 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 88765312}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Thoroughly enjoyed Iceland and the Hilton Nordica!", "title": "Very nice hotel, a bit far out", "helpfulness": 1, "user": "WorldAdventurer_7", "date": "November 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 88702104}, {"rating": 4.0, "title": "Nice, clean, modern hotel with incredible breakfast!", "text": "My husband and I and four friends stayed here as part of our Icelandair package, and it was great. Our double room was modern, comfortable, and larger than most rooms we've stayed in during travels abroad. We had lovely views of the mountains from the third floor. The common areas of the hotel were modern and comfortable as well - great places to hang out in while waiting to meet up with friends or tours. The breakfast was amazing! There was a HUGE spread of food - although it was the same every day, there were so many options that you couldn't possibly get bored. There were traditional Icelandic options as well as typical American choices like scrambled eggs, bacon, potatoes, etc. Although it is a 20-25 minute walk from downtown, the hotel provides free bus passes, and there are bus stops in front of and behind the hotel. One great thing about the location is that it's (basically) across the street from Laugardalslaug, the city's largest pool which has 7 hot pools, 2 big pools, an indoor pool, and perhaps the most kickass waterslide ever. It takes less than 10 minutes to walk there from the hotel. All in all, a great place to stay!", "user": "Laura B", "date": "April 23, 2013", "id": 158629335}, {"rating": 4.0, "title": "Great view of the bay and mountains", "text": "We spent five nights recently at the Hilton Nordica, having followed the advice of other Tripadvisor reviewers and asked for a room with a view of the bay and mountains. We were upgraded to a room on the 8th floor. The extra cost was well worthwhile. As with any hotel, if you don't ask you get what you're given! The room was a good size, with space for hanging clothes, and a clean bathroom. Best of all, we awoke to a great view, without which our holiday could have been disappointing. The only niggle was that the windows could have done with a clean. Probably still suffering from volcanic ash. The Hilton is well located within easy walking distance of a geothermally heated .swimming pool which we used twice, and rather less easy walking distance to Reykjavik centre. But the way to go into town is to ask the hotel reception for a bus pass. The bus stop is opposite the hotel, and the drop-off coming back is right opposite the hotel entrance. Another option, if you fancy a walk, is to head towards the city centre and turn right at the first crossroads. This road takes you towards the bay, and you can follow the bay road all the way to the centre. A visit to the Harpa concert hall is thoroughly recommended. What a truly remarkable building! It cost a lot to build and needed government funding to complete, but it's a huge asset to Reykjavik. Recommended eating places include the Sea Baron by the harbour. Great lobster soup for a reasonable price. Also skewers of fish and vegetables, which are excellent. The only downside is whale on the menu, so if you disagree with whaling and prefer to see live whales, don't eat any! Another recommendation is a visit to the Hallgrimskirkja church. If the weather is fine, take the lift to the top of the tower for great all round views and photos of Reykjavik. If you don't like heights, go anyway because there are windows to look out from. The building as a whole is fantastic, beautifully designed? We went to Reykjavik on an Icelandair package, including the Golden Circle tour, the Blue Lagoon, and whale watching. Note that the visit to the Blue Lagoon does not include the entrance charge, just the bus to get you there! A number of us got caught out and assumed a visit to the Blue Lagoon meant the price of bathing was included. It's worth going to the Blue Lagoon once. If you stay for a couple of extra days in Reykjavik, the city is full of interesting streets and buildings, and the people are very welcoming. Locals advise that if you want to see the Northern Lights, go in January - February for best results.", "user": "EdwardH49", "date": "April 20, 2013", "id": 158317506}, {"rating": 4.0, "title": "Beautiful, clean hotel - a cab ride away from the heart of the city", "text": "This hotel was really clean and had some of the most comfortable and beautiful rooms I have ever stayed in. The wood floors and modern furniture were very inviting and the thick blinds were great for sleeping in - as the sun is strong.", "user": "DCF83", "date": "April 18, 2013", "id": 158129962}, {"rating": 4.0, "title": "Great Customer Service!", "text": "The staff all in all was friendly. We enjoyed talking to the bartender late into the evening over drinks (the common area is warm and inviting as well) and also had many helfpul reccomendations from the front desk staff.", "user": "shannipantz", "date": "April 18, 2013", "id": 158111814}, {"rating": 3.0, "title": "Well located but rooms were small. Areas in the hotel looked tired too. Excellent dinners in the restaurant.", "text": "Easy access to the internet on the numerous computers in the lobby.", "user": "DanielEverett", "date": "April 16, 2013", "id": 157896954}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Friendly, helpful staff makes this hotel shine, but then the people of Iceland are all very open and welcoming. I really enjoyed my stay here. The tourist information desk/shop within the hotel is extremely useful and comes in handy when trying to organise the Northern Lights Tour (check here at 6pm for tour cancellations). Most tours offer complementary pick-up from the Hilton.", "title": "Great base for discovering Iceland", "helpfulness": 1, "user": "kpnutsni", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120530222}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "A few reviewers have commented on the hotels distance from the centre. It is a brisk 20 min walk and rain and wind is often a factor. If 20 minutes in the rain is a problem, Iceland perhaps isn't the place for you. To fully enjoy this country you must be prepared for the great outdoors, wind, snow, rain...pack your thermals and you will enjoy it regardless.", "title": "Nice Hotel", "user": "Gorda29", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120480276}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The hotel rooms are well equipped. Electronic mini bar, 37\" TV, i-Pod dock, electronic safe, iron and most importantly, (contrary to what is advertised) free wi-fi. The cleaning service is fast and efficient. While I didn't try them out, a spa and gym are available. Several supermarkets are available next to the hotel and one of Reykjavik's largest shopping centres, Pringlan, is close by. Try to get a room facing the sea. The setting sun is quite spectacular and sets the surrounding snow capped mountains on fire.", "title": "Really good", "user": "Stewartkrav", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120477814}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I stayed here for 3 nights. It was a very nice comfortable, clean hotel.", "title": "Good value hotel as part of Icelandair package", "helpfulness": 1, "user": "UkBaggieBird", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120350851}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I think the location is good. It's not too far from the Center of town. The bus stop is right across the street.", "title": "Very good - but could be Excellent", "helpfulness": 1, "user": "Judy123", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120294316}], "location": {"country": "Iceland", "region": "Capital Region", "continent": "Europe"}, "stars": 4, "variance": {"poor": 22, "average": 150, "very good": 579, "terrible": 10, "excellent": 521}, "aka": "Hilton Reykjavik Nordica Hotel", "slim_ranking": 0.274509803922, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 3.5}}