{"user_rating": 3.5, "review_count": 2712, "name": "Hilton London Gatwick Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We arrived exhausted, after my mum's funeral and just wanted no hassle and to be able to relax. We were successful on both counts. A charming trainee receptionist from Hungary,checked us in to a new room on the Executive room on the fourth floor, which also included entry to the lounge, offering drinks and snacks from I believe 6pm to 9pm.", "title": "After a difficult day, an oasis of peace in a busy airport", "helpfulness": 1, "user": "Tim-Limbach", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119881443}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The room had every amenity one could wish for including a jacuzzi bath and power shower. Wire internet access was also included. We didn't sleep well after all the day's stress, but the bed was very comfortable. Water, tea and coffee were included in the room rate and a continental breakfast in the lounge from 06.00, but as our flight was early, we missed this.", "title": "overpriced hotel", "user": "mrsmaunder", "date": "October 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119874773}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at the Hilton at Gatwick Airport overnight before a flight for convienience.Myself,my husband,my daughter and my 6 year old grandson.", "title": "Makes a relaxed start to your holiday", "helpfulness": 1, "user": "reddragonlady", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 119860970}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "For what we paid for the family room,we were disappointed as we expected a better quality room! The curtains were hanging off the rail,the television remote was faulty(even though a repair man calle dafter 3 requests to \"fix\" the remote,it stopped working altogether when he left),the resteraunt was very expensive but one consolation was that my grandsons meal was free. The breakfast which was included in the price of the booking was however lovely and so were the breakfast staff.Please note,if you use the Hilton car park,check the prices first as my carparking cost me £27.00 for 17 hours:-(", "title": "A bit of a rip off - watch for all the hidden charges...", "helpfulness": 1, "user": "floridabrits", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119854085}, {"rating": 3.0, "title": "Convenient Gatwick Hotel at a Price", "text": "Check is easy, fast and efficient. Rooms are clean and comfortable for a on night stop over. Failed to give us the promised early morning call but had set alarm on phone so it didn't matter too much.", "helpfulness": 1, "user": "SSgt_Fury", "date": "October 28, 2011", "id": 119821707}, {"rating": 3.0, "stay_parameters": "Stayed December 2013", "text": "I have stayed at this hotel on a couple of occasions and always thought it was a stress free way of starting a holiday (& long flight). However on this occasion the Xmas party being held with blaring music until around midnight didn't not make for the relaxing start I had hoped, I was offered another room after I called to complain but feel that we should never have put in the room in the 1st place. Also I booked a non smoking room and the hallway stunk of cigarette smoke & air fresher... next time I will chance rush hour traffic & save myself the money :(", "title": "Disappointing start to a holiday", "user": "T77781", "date": "December 27, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 188702677}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Had to ring hotel a couple of times to confirm where we had to park, meal times etc, not a lot of info when you book on line. You have 10 mins out side the hotel to unload the car, navigate the double doors with your cases, then work out where the lifts are, store your bags, check in then back to the car in 10 mins, not a lot of time. The Hilton car park is 30 yards tops, we had 9 days included parking, you get a ticket at the barrier then park your car. If you have an overnight bag the next morning if time you can take the bag to the car they will give you the keys in our case they let us keep the car keys.There are airport trolleys (£1)inside the Hilton near the walk way to the airport it took 15mins to get to the north terminal walking and using the shuttle. The room was a good size we booked a compact family room there was a Queen size bed and bunk beds for the kids.The room was clean and could not hear the planes at all. I felt the hotel was a bit tired and well used but good value for what we got. The food was good, a little bit to fancy, drinks very expensive.", "title": "Handy Location", "user": "jayne070", "date": "December 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188692629}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Stayed here overnight before our long haul flight..Had used the twilight check in for our flight, so no heavy bags to take to hotel. Quite a walk - but did have escalators up to hotel level...Lovely room in new extension. I am a light sleeper - but never heard anything from the airport..very quiet..Allow average 10 mins to get back to airport along long corridors, and you have to cross a road, so make sure you have adequate coats when it is cold outside....We didn't eat at the hotel (too pricey and average meals) - we walked back to airport, and found a nice pub there where we had a meal and a drink..then a leisurely walk back to room...all in all, not a bad place to stay for your pre-flight overnight accommodation.", "title": "Pleasant stay here", "user": "Sephora M", "date": "December 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 188652258}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We stayed the Sunday evening before our morning departure from the South Terminal; It proved to be as good as the Sofitel we use when travelling from the North Terminal;`", "title": "Spacious room in recent extension", "user": "alanreynolds", "date": "December 26, 2013", "detail_rating": {"value": 3.0, "sleep": 5.0, "location": 4.0, "service": 4.0}, "id": 188572131}, {"rating": 4.0, "title": "Decent airport hotel", "text": "That said; the Hilton is quite a hike (under cover) from the South Terminal so allow about 10 mins.", "user": "rswm", "date": "December 26, 2013", "id": 188554081}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My partner and I stayed at the Hilton 3 weeks ago, the night before going on our holiday.", "title": "Disappointing", "helpfulness": 1, "user": "BuxomWench87", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 119804504}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We've stayed in a few hotels in the Gatwick area before and the convenience of being able to walk to the south terminal really appealed so we decided to try the Hilton.", "title": "Perfect for the South Terminal !", "user": "M55", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 119790159}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The room cost £120 (a considerable amount more than what we've paid at other Gatwick hotels) but we thought it would be well worth it for the location and for staying in a 'nicer' hotel.", "title": "Another accomodating stay at the Hilton Hotel", "helpfulness": 1, "user": "Vegas1973", "date": "October 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119764704}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Check in was quick and easy and the lady at the counter was pleasant and polite. The lobby area was attractive, clean and modern. Our room however was not. The room was seriously dated, like an eighties throwback, and unfortunately the bed wasn't comfortable enough for either of us to get a decent night's sleep.", "title": "Hassle free start to holiday", "helpfulness": 1, "user": "Liz D", "date": "October 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119745106}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "For dinner do NOT have the buffet. We had the carvery which was £25 and the food was bland and luke warm at best.", "title": "Good standard hotel", "helpfulness": 1, "user": "magicbear", "date": "October 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119721343}, {"rating": 4.0, "title": "Xmas stay night before fly.", "text": "We stayed here on Xmas day myself with wife and 5 year old very excited girl. Check in. Very easy and NOT pushy and very helpful. Room was 2112 on 2nd floor. Very quiet and a room been refurbished. Would say try to ask for a new room. Well nice and plush. Only prob is pluming, bath takes long while to drain and loo awful flush. But very good quality and finish. Good size room for 3 and very quiet and lovely beds. Will def stay here again. It is what it is, an airport hotel!!", "user": "Ian J", "date": "December 25, 2013", "id": 188516887}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "This fair and huge airport hotel is suggested if you have an early flight or you like to sleep until the last moment. Very close to the airport and you don’t need any shuttle bus. Breakfast is amazing with a lot of choices to satisfy morning hunger! I’ll be back again.", "title": "Good airport hotel", "user": "orione91", "date": "December 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 188357631}, {"rating": 2.0, "title": "Not As Good As Before", "text": "After staying in an executive room several months before, we decided to stay overnight before our holiday flight. Got a deal on an executive room which included a bottle of wine. Were told that the executive lounge would be closing for holiday period ( I know I am not a business man, but if you are paying, then you should get!) and we would have to have the buffet breakfast next morning (that's okay). The lounge was open though that day. Not much there in the afternoon. Went up again in the evening. Alcoholic drinks were available and hot snack food. Very little selection was available. During our previous stay, there was quite a wide selection. It was as if the fridge was being emptied. Before, the receptionist came round to tell everybody that the alcohol would be stopping at 9, giving everybody a chance to get a final drink. This time, the staff just removed everything and locked the cooler. The whole lounge were not amused.", "helpfulness": 1, "user": "crascott", "date": "December 23, 2013", "id": 188354273}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Breakfast should have been simple. Our names were not on the list. This caused some embarrassment as the server read our details from the computer. Why could one dept not talk to another? The server tried to contact reception but was unable and eventually told us to take seat. The breakfast was reasonable without being great.", "title": "Excellent pre holiday stay", "helpfulness": 1, "user": "garye", "date": "December 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 188273292}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "So all in all disappointed this time. Maybe try the Sofitel at the North Terminal next time.", "title": "Can't fault it", "user": "pilotlady", "date": "December 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 188195583}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Staying here was fab, the triple glazing really drowns out the aeroplane noise, and they do fly close! The meal in Amys restaurant was great, the fillet steak was perfectly cooked. Being so close to the South Terminal, it really makes the start of a holiday relaxing.", "title": "Can't hear the planes!", "user": "Weymouthfan", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186545178}, {"rating": 3.0, "title": "Adequate - Just", "text": "Plus points are location and reasonable room cost if booked well in advance. Try and get a deal to include breakfast which is available 5.30-10.30 am.", "user": "zicobow", "date": "December 2, 2013", "id": 186486820}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Minus points - bed. Why is it felt that putting a matttress topper on a mattress well past its sell by date is acceptable? It does not make a lumpy mattress comfy!", "title": "You Cannot get closer to the South Terminal than this.", "user": "Martin A", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186482558}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "Poor soundproofing - could hear guy in next room coughing and folk walking down corridor talking sounded like they were in my room.", "title": "Pretty average for a Hilton, even an airport", "user": "gordor10", "date": "December 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 186461377}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Food and drink - head over to terminal. Although not top end, you won't spend all your holiday spending money on your first night as you would in The Hilton!", "title": "Is this Hotel really 4 Star?", "user": "Bob0007", "date": "December 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 186455953}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "I was very impressed withe value and service. If you are a Hiltonhonors member you get the best service and amenities.", "title": "4 star value a short walk from The airport!", "helpfulness": 2, "user": "Tb H", "date": "October 31, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 119949043}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The only drawback is the hotel is SO big that its a bit iof a hike coming and going if you stay in the new upgraded wing. But overall you get used to that.", "title": "Good choice for overnight stay.", "helpfulness": 4, "user": "Suzie M", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119931026}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "We got a good deal through Travel Republic inclusive of breakfast for £100.00 / room / night.", "title": "Super for overnight", "helpfulness": 2, "user": "mtmiktaylor", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119915539}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Because the hotel is within walking distance (around 5-10mins) of south terminal and the shuttle to north terminal it means no extra's are required for taxi transfers to either terminal.", "title": "Reliable and convenient", "helpfulness": 2, "user": "TheHolidayQueen", "date": "October 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119890086}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "On arrival (7pm) check in was fairly busy and it took around 20 minutes to check in though staff were friendly, working as fast as possible and apologised for the delay.", "title": "Staff need a lesson in service", "helpfulness": 1, "user": "GourmetEssex", "date": "October 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119889193}, {"rating": 2.0, "title": "It's a dump", "text": "This hotel is a dump. They gave us a room in the executive level 4th floor and the room was dirty and worn out. We asked to be moved immediately to another room. We moved to the other side 7000 series room numbers, which was slightly better. If I had not used hilton points for a free night, I would have requested a refund! Yikes glad I'm only staying one night.", "user": "ROSEOC", "date": "December 30, 2013", "id": 189046586}, {"rating": 1.0, "title": "Shocking service and rooms", "text": "Just checked in and staying in a standard double . No way is this a 4 star hotel ! . And entering the room we wanted to order room service . We noticed there wasn't an \"in room dining menu\" . We called reception and asked for a menu to be sent . We are still waiting after 30 minutes and 7 follow up calls ! Absolutely shocking for the price ! . As I type this we are still waiting for the in room dining menu !! . The last operator to answer even suggested we all room service and note down the menu over the phone !", "user": "James2861", "date": "December 29, 2013", "id": 188932988}, {"rating": 3.0, "title": "Very convenient , comfortable ", "text": "Ridiculous !", "user": "Dar G", "date": "December 29, 2013", "id": 188903628}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "This is a good hotel to stay at if you want to take away the stress of making your flight , it's walking distance to the airport , many other hotels claim to be nearby but require a bus transfer , room was clean , modern and comfortable ( some rooms may not be ,as it's currently under going a refurbishment ) this is a very busy hotel so allow plenty of time to check out , don't drink at hotel bar as it's very expensive and the airport has a few bars", "title": "Location , Location !!", "user": "Flamencolass", "date": "December 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 188886016}, {"rating": 1.0, "title": "Tired dirty disgusting", "text": "Stayed here 2nd Dec then again before Xmas as was flying into, then out of South Terminal. The hotel is so conveniently located , that is the main reason that I booked it. previous years I have booked others where you need a bus and stand around in freezing conditions for 45mins or so having missed one. The hotel standard rooms are a bit dated , however the food was excellent , both times we did the advance purchase of a double room with dinner and breakfast, good value and excellent choice of food. The hotel does get very busy , really popular for business meetings etc also , excellent for those who only want a comfortable evening before a long haul flight , and after !", "helpfulness": 1, "user": "Elizabeth S", "date": "December 29, 2013", "id": 188868301}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Hilton Hotel Gatwick Airport is always the place we stay for a one night stopover. It is very convenient, efficient and caters for most needs. We always have the package which includes dinner in the Garden Restaurant. The buffet is excellent with a very large choice of dishes.", "title": "Convenient stopover", "helpfulness": 1, "user": "Sauvarin", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120190605}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The deluxe rooms are very spacious and clean.", "title": "Great place for late night arrival!", "helpfulness": 2, "user": "psalmist3", "date": "November 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120129324}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We arrived at 12:30 a.m. and were happy to be able to wheel our suitcases through the terminal to our hotel! Some of the signs were a little confusing but we asked several people and eventually found it! It was a very large and spacious hotel room! We had an excellent breakfast the next morning in the restaurant! The next morning we caught the train to downtown London and that too was very convenient and right inside the airport facility. We took the train to Westminster stop and were able to see Parliament in session! Amazing experience!", "title": "For an airport hotel - very good!", "helpfulness": 1, "user": "suffolkdale", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120045145}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed, as I suspect most travellers do, one night and it was a great start to the holiday. As an HHonors member we got upgraded and enjoyed good service throughout our stay. Excellent sleep/bed quality, ideal before a long flight. No worrries re getting to the airport on time, just stroll though to the terminal - great!", "title": "Great Airport Hotel, perfect breakfast.", "helpfulness": 1, "user": "iGareth", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119985075}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "This is our usual airport hotel at London Gatwick and return every year. The location is perfect for access to the south terminal, great service and lovely clean comfortable rooms. We did have a buffet dinner and the Garden View restaurant included in our room rate which was nice but rather average; would probably opt to dine else where next time. The same restaurant does however do an amazing breakfast which offers everything you could possibly want.", "title": "Average Hilton, Great Location", "helpfulness": 1, "user": "Nickpilot", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119953485}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Stayed here for one night after our flight was cancelled. The room we were put in was scruffy, the door to the bathroom didn't shut properly, the ventilator fell off the wall when my son shut the door, etc. On top of that, the bed was sloping to one side and my wife couldn't sleep properly. When we mentioned this to reception, all they said \"oh, that room needs refurbishing\", so why did they put us into that room? I always thought Hilton was a premium brand, but I've stayed in budget hotels and had a much better experience.", "title": "Rooms are tired and need renovating", "user": "Stephen L", "date": "December 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 186490237}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This Hilton is very popular with tourists going or returning from their holidays. Be warned that this Hilton lures you in with low room rates but then sting you with high food and drink prices.", "title": "Very high food and drink charges", "user": "Berkshire_UK", "date": "December 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186440393}, {"rating": 2.0, "title": "Very disappointed", "text": "I have used this hotel several times and always been mindful of this practice, but recently paid £27 for 2 glasses of wine and a beer with is just too much.", "user": "Alan H", "date": "November 29, 2013", "id": 186217538}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "I queried this practice with both the bar manager and the hotel duty manager, but was told that other hotels (and they mentioned the Sofitel in the north terminal) had the same pricing policy.", "title": "What a way to start your holiday", "user": "Squits", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186201963}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I am not naive and realise that this sort of practice is common in strategically placed hotels, but please be aware that if you stay here, don't eat at the restaurant if you don't want to get ripped off.", "title": "Excellent if you have an early flight", "user": "Martin B", "date": "November 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186198426}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Stayed for 1 night prior to our holiday which was a package that included 9 days car parking and an evening meal.", "title": "In a word...awful", "user": "jamiexx", "date": "December 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 186670417}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Good Points :", "title": "FAR better stay", "user": "HiltonEnthusiast101", "date": "December 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186655196}, {"rating": 3.0, "title": "Average. Expensive Bar", "text": "·The Buffet . Better than expected and plenty of choice both for the evening meal and breakfast.", "user": "moomin2523", "date": "December 3, 2013", "id": 186650483}, {"rating": 4.0, "title": "Great access to terminal", "text": "·Price paid : Considering it included car parking and meals, it was pretty decent price.", "user": "Yorkflyer", "date": "December 3, 2013", "id": 186648858}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "·Ease of getting to/from the terminals the next day.", "title": "location location", "user": "neilalexander", "date": "December 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 186620611}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "stayed one night on two occasions recently. First stopover was in one of the refurbished rooms. Staff were very helpful in accommodating an early check in, much appreciated after a trans atlantic flight.The room was well appointed, nice shower head and bathroom in good condition. decor was contemporary and appealing, will be great when all rooms are completed. The buffet breakfast was excellent with a good selection of items. The return journey was good too, though not in a refurbished room. The difference was clear. the sheers had come off their hooks in places and the chair upholstery was worn. had a trouser press but no iron or ironing board, a big miss for my wife. The room The tub had an old style mixer but understanding that in time all rooms will be refurbished it id the job for a brief overnight stay. The major plus is accessibility to the South terminal, no need for a shuttle bus which is a big plus when overnighting. Costa coffee a handy tool early in the morning. Was satisfied all in all, the convenience is a big factor", "title": "Great stopover", "user": "Nigel E", "date": "November 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186070402}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We travel long haul ex gatwick a lot having to fly in from belfast. This year alone I think we have stayed at the Hilton 3 times. Our latest stay disgusted us at the customer service the Hilton thought acceptable. We booked ( well in advance) a luxury double . On arrival we were given a standard twin . They told us they had no doubles. But we booked and paid for a double. They had none . I said that was unacceptable. Mysteriously a double was found. We got into the room after the restaurant had closed after 15 hrs traveling on 2 planes and a speedboat to find that the room was in a mess, bed unmade, food and drinks on all surfaces, clearly the room had not been prepared or cleaned for us. It tooka further 30 mins for an alternative room . No apologies . I asked as a gesture from the hotel, it might be nice to get some complimentary sandwiches. That was clearly a difficult tricky problem that had to be referred to the manager . A phone call came back 10 mins later that we could only have one sandwich between us. I slammed the phone down in disgust. Clearly the hotel cottoned on that that may not be the way to treat its guests as the phone rang again for us to be told that he had decided we could have a sandwich each after all.", "title": "We may not return", "user": "paul1962Belfast", "date": "November 27, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 186051518}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This was a good stay at the airport. I was allocated a room, according to my requirements, which was a great help. The room was fairly typical of an airport hotel - not massively spacious, but clean and more than adequate. The girl at check in was very helpful as was the concierge. They offer free wifi for an hour in the lobby area, but frankly I do not understand why it is so hard for so many of these major brands to offer free wifi throughout the building as a standard process. Food wise - not bad, but nothing to make you go there for an evening's meal if you live in the area. Basically - it is a good transit hotel and very pleasant. If I fly out of Gatwick again I would probably use it again. Its location is excellent for South Terminal and you can be at check in within 5 minutes.", "title": "Perfectly acceptable.", "user": "retro46", "date": "November 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 186033788}, {"rating": 3.0, "title": "Mixed bag", "text": "Hotel is in the middle of a refurbishment programme which it does desperately need. I was unimpressed with our room but the location of the hotel is excellent and the car parking easy. Supper and breakfast in the garden restaurant were fine and the staff in there were quite friendly. If I book again I will be making a request for a room that has already been refurbished.", "user": "Northerntraveller59", "date": "November 26, 2013", "id": 186021652}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "It was right after we missed our flight to Barbados from Gatwick airport, London for almost no fault of our own. ‘Almost’ because only if we had imagined that there could be a minor accident on the road because of which the authorities would block not one, two but all the routes to the airport, we could have left for the airport not 4 or 5 but 12 hours before the flight. But then imagination is not everyone’s cup of tea. Thanks to the sensible airlines staff that they put us in the next flight for no extra cost. But it was next day the same time and the question was where to stay for the rest of the day and a full night. Going back to any lands that lay on the other side of any kind road was a phobia.", "title": "A Little Bit Extra, Makes it a Memory", "helpfulness": 2, "user": "amitclbabbar", "date": "November 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 185985456}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We previously stayed here in Feb. 2012 & once more chose this hotel for its location to South Terminal. Again we booked a car park separately & from there we took the courtesy coach to South Terminal. This meant we could relax on arrival at the hotel & simply access the terminal via the walkway at the hotel the following morning. We found all the staff very courteous with a quick check in at reception & were allocated a quiet room on the third floor as per our email request. The bed was very comfortable & we both had a good night's sleep ready for our flight the next morning. We were on room only basis so cannot comment about the breakfast. This time we found the bar snacks very limited so ate downstairs in the Garden Restaurant where there was a choice of buffet or a la carte. I enjoyed my pasta dish as did my husband his fish & chips. Prices are not too bad if you choose wisely! Again the waiting staff were very polite & helpful. There is also a Cafe Nero in the hotel if u just want a coffee & snack. The Hilton met our needs & we would certainly stay here again. We obtained a very good room rate via Flexible Trips & would recommend that on line providers be checked as well as the hotel direct as special rates may be available.", "title": "Good choice for us", "user": "evieroselily", "date": "December 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188816754}, {"rating": 4.0, "title": "Convenient", "text": "We stayed here the night before our flight as the flight was early in the morning. When we arrived we were able to park in front of the hotel while we unloaded our luggage, and to check in. The checking in process was a little long winded but we got there in the end. Once you've checked in you have to move your car to the airports long stay car park. (If booked), which is a 5 minute drive away. However once y have parked the car you can either catch a shuttle bus back to the hotel or walk. I walked! What was said to have been a 10 minute walk turned out to be around 30 minutes from where my car was parked.", "user": "Kristian D", "date": "December 28, 2013", "id": 188801021}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The hotel itself is huge. We stayed in a executive room which is in a new part of the hotel. The rooms are large, well equipped and clean, and the bathroom has a separate shower which was nice. Staying in one of these rooms you are allowed to use the exec lounge, which serves hot and cold buffet type food and free drink until 11.00pm, which was a nice touch to start off our holiday.", "title": "Stay here only if you have to", "helpfulness": 2, "user": "Scotscouple99", "date": "December 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 188856385}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "I would recommend this hotel to anyone who has an early flight and I will be booking again soon.", "title": "Nothing to write home about", "user": "Alibongo42", "date": "December 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 188714137}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Good location", "title": "Worth upgrading", "user": "dp191244", "date": "December 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 188707191}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 345, "average": 707, "very good": 952, "terrible": 228, "excellent": 480}, "aka": "Hilton London Gatwick Airport Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}