{"user_rating": 4.0, "review_count": 432, "name": "Hilton Nagoya", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "My room on the 17th floor was excellent: very large by Japanese standards, modern, impeccably clean, and a decent view.", "title": "Excellent", "user": "AndyInLondon", "date": "January 10, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23440917, "likes": {"liked": "— Clean, modern room. Good location"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The hotel's location is excellent, just two blocks from the nearest subway, and also within easy walking distance from Nagoya Railway Station.", "title": "Wonderful room, bad service and food", "helpfulness": 1, "user": "Londinium", "date": "September 1, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 19591612, "likes": {"liked": "— The location and the room", "disliked": "— The food, the staff that doesn't speak English and the obligation to use the dinner voucher only in 2 restaurants (and menu imposed!) - expensive wine"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The hotel is 5 minutes away from the station and a taxi costs 900 Yen. We had a room on the 22nd floor which was renovated. The room was quite big, well equipped and we received 2 free bottles of water per day + free cookies. The beds were a bit too small but comfortable. The negative aspec of this hotel was the food. We had taken a bed/breakfast/dinner rate but what they don’t mention on the website when booking this rate is that you can only go to the Japanese or to the Chinese restaurants, not the French one nor the Brasserie. We tried the Chinese one and other bad surprise, you can not choose your menu. It was a set menu of 7 or 8 dishes from the starter to the dessert, too spicy for us, and the beverage is not included. (the less expensive bottle of wine is a Rosé d’Anjou at 5800 Yen, and it was not so good). They don’t speak English very well and they are running between the tables which was disturbing. We checked the Japanese restaurant for the next day, but it was also a set menu so in the end we decided to pay the dinner at the Brasserie. There is a daily dinner buffet and you can also have a “all you can drink” buffet for wine (but they put only 3 bottles of white, 3 of red and only 1 of each is open so you need to ask them to open a new bottle quite often). The food was not exceptional, only the desserts were OK. The breakfast is also average: the bread is so hard that you could break a window with it, the choice is not large for European. I tried their omelette, not really good, same for the cheese and they pretend to offer fresh juices but the orange one was definitively not a real fresh one. When coming in, they ask if you want tea of coffee but we had each time to ask again because nothing was coming … This is really not the best Hilton we’ve been to for the food aspect, and their English is really bad.", "title": "A great Oasis amidst the summery Nagoya outside", "helpfulness": 1, "user": "dunkinky", "date": "August 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19561537, "likes": {"liked": "— The services of Hilton Staff & central location", "disliked": "— The little miscommunication re late Check Out time"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I stayed at Hilton Nagoya for 2 nights from 14-16 Aug 2008 for holiday.", "title": "Great Hotel", "helpfulness": 2, "user": "cricketa", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14672825, "likes": {"liked": "— convenience and cleanliness", "disliked": "— night front desk employee can hardly speak english"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Overall it was a great hotel as expected from a 5 star rating in Japan. A welcoming place to escape the hot summer heat outside!", "title": "Excellent Service", "helpfulness": 2, "user": "ElGavatcho", "date": "December 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12057626, "likes": {"liked": "— Everything is first class.", "disliked": "— No tipping is allowed."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "As part of the Hilton chain I had expected the Nagoya hotel to be of exceptional quality; the grandiose lobby and spectacular array of restaurants were pleasing, however, the rooms were, quite blatantly, ordinary.", "title": "High quality, good service but fell short of expectations", "helpfulness": 2, "user": "StrawberryFrangipani", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 11709866, "likes": {"liked": "— service, grand lobby", "disliked": "— bed too hard, pricey and slow internet, needs more modern fittings"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The spacious 30sqm King Deluxe room surpassed the average hotel room-size in Japan. The room was well-equipped, the furnishings of good quality, but was quite ordinary and not as modern as other hotels I had stayed at. Also, the fancy toilets with extra functions, an easy find around Japan, were not present at the Hilton.", "title": "Very handy to everything & faultless service", "helpfulness": 7, "user": "RickPorgera", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8394084, "likes": {"liked": "— Service...with a smile, a mile wide."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The efforts of the friendly, helpful, efficient lobby staff were impeccable.", "title": "two nights in an excellent hotel", "helpfulness": 1, "user": "lutze2", "date": "May 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7591134, "likes": {"liked": "— rooms", "disliked": "— brekafast on the executive floor was just average and little complicated, too."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Location is not bad; it is 7 minutes by foot to the nearest train station. However, in comparison to the other hotels I stayed at in Japan, this hotel was the furthest away from the station.", "title": "Incredible Service, small TV's", "helpfulness": 3, "user": "gshank", "date": "March 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7010322, "likes": {"liked": "— rooms", "disliked": "— bed/tv"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We went on the inaugural Jet Star flight from Cairns to Nagoya, for the dirt cheap fares, and decided to go a little upmarket with the money we saved, by using the Hilton. We were not disappointed in the least. The rooms were spotless, service was exceptional, and great views from every aspect. Walking distance to the shopping/trains and sights, including the Nagoya Castle etc. Abundant nightlife around the hotel, and plenty of places to opt for a more economical feed if you want. The staff are beyond reproach for their level of service and attention to detail. None of the eyebrow raising scenarios that one can experience at other \"classy\" hotels, and every guest is made to feel special. The guys at the front door have no problems with directing you to alternate venues/facilities (we found a handy little laundromat about 4 blocks away) if you want to do your own thing, but everything you need is in the hotel, if necessary, and you don't want to hunt for the odd bargain. we were very impressed with the level of Japanese hospitality in general, and this establishment is no exception.", "title": "Great location and comfortable stay", "helpfulness": 4, "user": "geop_girl", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5543357, "likes": {"liked": "— The location in the central part of Nagoya.", "disliked": "— The hotel is a bit far from Nagoya Castle"}}], "location": {"country": "Japan", "region": "Chubu", "continent": "Asia"}, "stars": 4, "variance": {"poor": 13, "average": 38, "very good": 190, "terrible": 6, "excellent": 185}, "aka": "Hilton Nagoya Hotel Nagoya", "slim_ranking": 0.0149253731343, "description": "Just 5 minutes from Nagoya's main station in the heart of the business, shopping and entertainment area in Nagoya, the Hilton Nagoya is the city's only international full service hotel providing world class accommodation, banquet and restaurant facilities in the city center. The hotel is close to the world’s largest planetarium of Nagoya City Science Museum and provides a complimentary shuttle service to nearby attractions such as Nagoya Castle and Nagoya station. Guest rooms feature modern interiors, all contemporary comforts with dynamic city view including the most refreshing, restful bed, LCD TV with entertainment channels and high speed internet access. A full range of branded quality amenities, as well as comfortable bathrobes, Japanesse Yukata and slippers are offered in all guest rooms. The hotel offers 16 banquet rooms, with wireless internet access. Swim in the 49-foot indoor pool or work out in the 24/7 gym and relax in the sauna. Choose from 6 restaurants and bars at this Nagoya hotel and do business in the Executive Lounge or one of 16 banquet rooms for 10 -1200. Nagoya, Japan's one of the largest city makes a great base for exploring central Japan, beginning with the highlights of Nagoya's cultural and industrial heritage, excellent shopping and entertainment, as well as exploring the Ise Grand Shrine, the World Heritage sites of Shirakawa-go."}