{"user_rating": 4.0, "review_count": 1296, "name": "Hilton Toronto", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I stayed for 5 nights mid-August and thoroughly enjoyed my stay. Although I chose the hotel for its proximity to the Four Seasons Centre for Performing Arts, it is central to all main Toronto attractions, shopping and is connected to the PATH network.", "title": "Great stay, great location", "user": "SoloTravel32", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78297683}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The hotel was clean, with friendly and helpful staff, and very quiet. The rooms are large and the beds are fantastic.", "title": "Stay was OK but not Fantastic", "user": "Ash04925", "date": "September 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 77985025}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "As a solo traveler, I felt safe both in the hotel and its surrounds at night and would not hesitate to stay here again.", "title": "Good position, large room, gym/swim; some big minuses", "user": "lalloRoma", "date": "August 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77652375}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I recently stayed at this hotel for 2 nights in August. The location is great! Its within 3 blocks from Front street and nearby Rogers Centre. It is also fairly close to Dundas Square.", "title": "A very good, clean hotel in an excellent location", "user": "clarehelen23", "date": "August 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77642658}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The hotel itself is very welcoming. The lobby is beautiful and well decorated. The one drawback of this hotel is the elevators. During the time we stayed 2 elevators were down for repair. I had only known this because I checked the website before hand. No one told me this at the hotel, nor did they have any sings posted. Other guests seemed very upset about this. On the day of check out-which is 12, we waited for 20 minutes for an elevator. Since we were ont he 10th floor, every elevator that stopped was full. We ended up carrying two large suitcases and a cooler down 10 flights of stairs because we were tired of waiting. Then, our next hurdle was the parking garage. Again, there was only one elevator working and for some reason the stairs were locked. We then decided not to wait in line and go down the car ramp into the parking garage. This was extremely anoying. Parking is also very expensive- $32 for the weekend.", "title": "Not What You Would Expect At A Hilton", "helpfulness": 1, "user": "Sheikyerbooty", "date": "August 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 77551071}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Everything about the hotel was great. Modern but not trendy, and extremely comfortable. They really pay attention to comfort. Service was great, location was great and the bed was awesome.", "title": "Great hotel - comfortable and high end", "user": "girlinpei", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75654202}, {"rating": 5.0, "title": "Great hotel!", "text": "The outdoor pool was also incredible in the evening.", "user": "buckigirl", "date": "August 17, 2010", "id": 75620467}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We splurged on a real Hilton, although we almost always stay in members of the Hilton family. Since my husband is a top level member, mostly due to business, we were given a lovely room on the top floor with a great view of the CN Tower.", "title": "Nice ,but...pool needs renovation.", "user": "sharono11", "date": "August 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 75482021}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "However, for anyone who is staying here, we had the wonderful (but not free) breakfast buffet. Because we usually rely on public transportation for the sake of economy, when we are tourists, it was very conveniently located to the subway system -- just ask for directions at the hotel. It was a quick walk -- a real benefit after pounding the pavement seeing the sights.", "title": "Really big beds,nice design", "user": "Marialena P", "date": "August 11, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 74821027}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Stayed for two nights at the Hilton DT location with family the first week in August. The interior of the room and hotel's ambiance where nice and up to date, but the indoor/outdoor pool needed a lot of repairs especially the concrete overhang which l crumbling. It would have been nice not to look at the new building being put up across the way also too. The construction noise was loud.They did have a pool bar, but it had no service. I was disappointed especially since the pool was busy and thehotel seemed to be full.", "title": "Good place to stay in Toronto", "user": "Malveiradaserra", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74801422}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed here for 3 nights over Labor Day weekend. The room was spacious and very clean. We didn't eat breakfast here because it was expensive. I grabbed a breakfast sandwich at Tim Horton's down the street. This was a great location for exploring the city on foot and by subway. The area is not super lively on the weekends because it is the downtown area so a lot of the local lunch spots were closed on Saturday and Sunday. To get anything original we had to go a little further out which wasn't a challenge except when we got super hungry after walking for hours. We splurged on a lunch in the bar of the restaurant and it was kind of expensive for a turkey sandwich. It was delicious just expensive. The fitness center was great, loads of equipment and very clean.", "title": "Good Location for walking Toronto", "user": "LizzChicago", "date": "September 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79067078}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I was a little wary when I saw some of the negative reviews on here. I was there over Labour Day weekend and had a great time.", "title": "Great hotel downtown. Had a fantasic stay.", "user": "Big_D_46383", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 78963252}, {"rating": 5.0, "title": "Seemed like a \"boutique\" hotel", "text": "There are cons...but they were minor: The internet was horrible, the parking expensive, the lobby minimal. But I expect expensive parking in a downtown environment (although if it were free or cheap I would give this place 5 stars). Wired internet was horrible at $15 per day. I canceled the hotels and found an outside wireless source for $9 a day. I don't hang out much in hotel lobbies but it was sparse.", "user": "A TripAdvisor user", "date": "September 7, 2010", "id": 78631126}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "OK, we have the bad stuff out of the way (which was MINOR!)", "title": "The Best I've Stayed At In Toronto", "user": "DetMI", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78620440}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "First, I got the hotel on priceline by bidding $85. At this price point, it was very much worth it. Full price and I would have had more complaints.", "title": "Great Hotel", "user": "mircoe_mcc", "date": "September 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78557243}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I am a loyal hilton honors member who pretty much tries to stay at hilton's or hilton branded hotel every time I can so when I booked a Junior Alcove Suite for my 11 year anniversary I was hoping for something special. This was a total waste of $300+ and I would have gotten a lot more if I spent the same money elsewhere in Toronto. Room was not ready at 5:30pm when we arrived, room was dirty after it was apparently cleaned. TV is small and not visiable from bed, room has no style or decor. 3 small pictures on the wall. Outdated dirty bathroom. Overall is was pretty much disgusting and I won't ever stay there again.", "title": "No frills here!", "user": "CCollinsOntario", "date": "August 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 77544247}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My wife and I stayed at the Toronto Hilton in August to celebrate our anniversary, and decided to try a different hotel than our usual. Boy, are we sure glad we did. The Hotel is perfectly situated in Downtown Toronto, allowing guests to enjoy the sites of the city without much hassle. The room was absloutely amazing, clean, spacious, modern, the bed was sooo comfortable, the bathroom was updated and spotless. We tried the buffet breakfast the next morning and found everything to be prepared very well, everything we tried was excellent. The only thing that wrong was our t.v. wasnt working in our room. We called the front desk, and within 10 minutes, maintenance was in our room looking after our problem. Very courteous and efficient. Over all, I would greatly recommend this hotel to anyone was wants to be in a beautiful, clean hotel in the downtown core, close to everything. We look forward to coming back next year for our anniversary again.", "title": "Great Hotel!!!", "helpfulness": 1, "user": "costa68", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77434120}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Everything was as expected for a Hilton property, \"but\"....being a Diamond VIP member, I would sure have appreciated if they had given me the room upgrade to the executive floor. I always wonder why these upgrades are never available.", "title": "Everything was as expected for a Hilton property, clean and nice, \"but\"....", "user": "PoorDaddy", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76864191}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This was a 2 day getaway to see the Chinese Terracota Warriors at the ROM and the Harry Potter Exhibit at the Ontario Science Musuem. among other things. I rarely travel with the family so I was hoping the upgrade would be available and we would have a little more space to move around in the room. Anyway, everything was clean and we had access to the executive breakfast which was very good. Staff was friendly and helpful, parking was $30.night, better than DC and London.", "title": "First class hotel in a first class city.", "user": "eatondog", "date": "August 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 76572292}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This hotel is centrally located, the CN tower was looming right outside our hotel room window and everything was within walking distance. Bring your walking shoes, there is lots to see. Took the CN Tower ride and the views were spectacular, however, the $97 for a 15 second elevator ride was a bit steep but as the children never been there, they enjoyed it. Overall, very nice hotel, that's why I stay at Hilton properties. The only negative is they wanted $14.95 per day for internet which is just about free everywhere else. The lobby had free wireless if you need to connect to emails etc...", "title": "Worth the Hotwire not the Rack Rate", "user": "johnmOttawa", "date": "August 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 75852923}], "location": {"country": "Canada", "city": "Toronto"}, "stars": 4, "variance": {"poor": 75, "average": 216, "very good": 539, "terrible": 43, "excellent": 423}, "aka": "Hilton Toronto Hotel Toronto", "slim_ranking": 0.212765957447, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}