{"user_rating": 4.5, "review_count": 196, "name": "Hipotels Hipocampo Palace", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We spent a very pleasant week in a suite across the road from the main hotel. The service was good and staff friendly. The spa area was excellent so we used this every day, really good after being out in the sun all day! The hotel was one of the best we have stayed at for food (and we have stayed at some excellent 5star hotels). It was top quality, we couldn't wait for meal times to come to see what delights were available! We thought it was a good idea to be allocated a table in the restaurant for the duration of your stay for both breakfast and evening meal as no matter what time you went in, your table was available.", "title": "Fantastic hotel with fine food.", "helpfulness": 3, "user": "debrakerriehuggins", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 80643977}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The lawned area around the pool was well maintained and there was always ample sunbeds every day no matter what time you arrived at the pool. We would definitely return here in the future.", "title": "An excellent hotel if food is important to you", "helpfulness": 1, "user": "G_EvansWales", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 79667551}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed at the hotel for 2 weeks spanning late August/early September. The food was outstanding in every respect. The choice on the hotplate (cooked to order) each night was fantastic, ranging from swordfish to king prawns, ostrich to pork, steak every night, the range was simply great. We did not find the hotel to be overwhelmingly \"german\". There were quite a few british couples and families staying. The Bar prices were very fair for a hotel of this quality, typically about 3.50 Euros for a 500 cl beer (about £2.90). The rooms were very spacious (we were upgraded to a suite) but none really had what one could call a sea view, the hotel being set back about 250 metres from the beach. The local shops stocked an adequate choice of most holiday essentials and there were a few bars fairly close by. The resort of Cala Millor appeared to be suffering greatly from the recession. The snack bar at the hotel served very good lunchtime snacks (if you have any appetite left after breakfast). Entertainment in the evenings was not the best.", "title": "excellent hotel!!", "helpfulness": 1, "user": "zadadt", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76050193}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We have both stayed at 4 and 5 star hotels and I have to say that this was certainly a very good quality hotel and made even better by the excellent staff. We stayed for a short break and although we were not overlly impressed with Cala Millor itself, the hotel made up for it and was in an ideal position at the quieter end of the resort and a stones throw away from the beach. We opted for a suite which was very nice. Very comfy beds and the bathroom was lovely. It had a large balcony too which was nice. The pool area of the hotel was fantastic. It was never overcrowded as there is so much space there and an over-abundance of sunloungers. The snack area was also good, as too was the standard of service. We opted for half board and as all of the other reviews have stated, the food was excellent. So much choice and again the staff were so friendly and helpful. I would certainly recommend this hotel and although we probably wouldn't return to the same resort, I would definately book into another Hipotels hotel again!", "title": "almost 5 star", "helpfulness": 1, "user": "frommesbeck", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73549690}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I stayed at the Hipocampo Palace with my husband in June for two weeks. The staff, especiallly on reception are excellent. We were allocated a bedroom in the main building and were very pleased, although there are no sea views, we did overlook the pool area and lawn across the road. The hotel is situated in a good area, only a short walk from the beach and yet just far enough away from the nightlife and shops. There are plenty of Spar supermarkets close by to buy all essentials. The food in the restauarant has to be seen to be believed, not only is there a very good selection but it is of an excellent standard for a buffet. The only downside is the layout of the the tables in the restauarant as they are very close to one another and also some are very close to the food area, so consequently if you are allocated one of these there are always people around you queuing for food. The hotel is spacious with plenty of areas for lounging inside and out. My only dissapointment was on checking out, as our flight was later in the day. Despite asking numerous times at reception if we could extend our room we were told to ask on the day of departure. Needless to say we could not extend and as the hotel does not provide a separate room for late departures we had to use the sauna area showers. and leave our luggage in the holding room. Most unsatisfactory for a hotel of this standard, only a minor point but should be addressed for the needs of their customers if it is to be considered a five star establishment. I must also add that the majority of the holidaymakers were German and there were quite a number of small children, which was not a problem to us but might be to some.", "title": "Worth going just for the superb food", "helpfulness": 3, "user": "coolrunnings15", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71487665}, {"rating": 5.0, "title": "great staff, short restaurant opening hours", "text": "As mentioned in previous reviews, this hotel has two main buildings. One stretches north to south parallel to the sea with normal rooms. This part is separated from the sea by one narrow one-way street. The rooms are therefore either facing the sea seen behind one row of tall hotel buildings and one facing the other building. Then there is a larger road bisecting the hotel. The other building is “L” formed. One side looks at the pool, one side facing the sea (parallel to the main building) and the other two sides facing each other and the hotel backyard. This part of the hotel has suits, while the main part has all of the facilities and the restaurant.", "user": "screenname060309", "date": "June 19, 2011", "id": 114406626}, {"rating": 1.0, "title": "not to be trusted", "text": "The fact that the two parts are separated by a main road is somewhat disconcerting. If you have a small child you have to be very careful. There is of course an underground tunnel connecting the two segments, but most pass the main street.", "user": "reluctantourist", "date": "May 14, 2011", "id": 108178475}, {"rating": 4.0, "title": "Brilliant, relaxing holiday", "text": "The best points about the hotel are its staff and its food. The staff is friendly, and helpful. They are genuinely kind and efficient. When we requested that the minibar to be emptied because of our small child they did this very quickly. The food is great, and we specially loved the fruits and sea food. Friday nights the management invites the guests to an aperitif and Thursdays they have sushi and sashimi. The papaya that I have had there was even better than in Thailand. The chocolates are probably low cacao content and not very tasty. The choices of ice-cream are also few. Do not be surprised that some food items from last night might appear the next night, but we were OK with that. Everything was clean and perfect.", "user": "coua10", "date": "October 9, 2010", "id": 82781370}, {"rating": 5.0, "title": "What a superb Hotel", "text": "We had some complaints and these complaints was about to give this hotel a four point. Aside from the street separating different parts of the hotel, the restaurant opened at 8 a.m. which I consider is late. About 5-10% of the customers were people with small children at least in the beginning of June. I usually saw grumpy parents queuing before 8. There is a possibility to get cold breakfast from 7 at the coffee bar, but I found that awkward. I have never been to any hotel with such late opening time for breakfast, and believe me nobody wants a small child hungry from 7 to 8. The opening hours for the evening meal were also short, from 6.30 to 9.", "user": "neville m", "date": "October 7, 2010", "id": 82460595}, {"rating": 4.0, "title": "Excellent hotel.", "text": "The weather was awful when we stayed there. It would have been great if the main pool had been heated. However, there is a much smaller indoor pool. The temperature was marvelous. Also some spa like Turkish bath and sauna are available free of charge. There is an internet café with high price, however there is free wifi. The connection is however poor and we had connection in only one room. We usually went to lobby to use our PCs. The TV selection was good, several English channels such as ITV, CNN and BBC. One movie channel was in English. There are plenty of closet place in the suits. The rate for safety box is 2 Euro per night, however the box is small and I could with a lot of difficulty put my 10-inch PC inside it. I also hate it when hotels charge for safes.", "user": "silverghost99", "date": "September 23, 2010", "id": 80715754}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We had a wonderful time staying at this hotel. We stayed in a suite which is across the road from the main hotel where the restaurant, bar, indoor pool and spa area are located but this was not a problem as there is a covered underground walkway which leads to the indoor pool/spa area. Our suite was clean and modern - it overlooked the outdoor pool and garden area. We had two modern televisions which showed plenty of English speaking stations. The food in the restaurant has to be seen to be believed. There was everything on offer from roast dinners to sushi and everything inbetween!! There is a fresh grill area where a number of chefs cook fish, steaks etc to your requirement. On arrival at the restaurant you are allocated a table which you then use for the rest of your stay. The indoor pool area and spa were clean and relaxing. There was not much evening entertainment but that is not something that we go on holiday for so it didn't bother us at all. We would definately recommend this hotel and can't wait to go back!!", "title": "Can't wait to go back to the Hipocampo Palace :-D", "helpfulness": 1, "user": "HolidayGirlSuffolk", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 66580794}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Don't get me wrong, a lovely, clean, well-equipped hotel with fabulous staff. Great rooms & service and lovely facilities. But steer clear if you're under 40 and want somewhere a bit lively? Even when the entertainment was great it was hard to get other guests enthusiastic. And the sports facilities were under-used by the type of guest attracted there and not helped by the dreary Ents manager. However, resort centre lively and beach lovely, if you walk 5-15 mins.", "title": "German Saga holidaymakers will love it!", "user": "sammorton", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46410342}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Additional charge for poor-quality bikes should have been included in the price and the over-priced 'gala' dinner was unspectacular. Spa and treatments were brilliant, totally recommended and not well-advertised. Only downer is that 2 weeks later we're still disputing a bill we paid in cash (told not possible to charge to the room so not sure how they think it's still outstanding?) Also wish they would ban naked sauna action, eugh!", "title": "Never Fails to Impress", "user": "AlloaCameron", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39945958}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Second time we have stayed here and it was better than the first. We even considered re-booking our return flight and staying on a few days longer. The rooms are always spotless and we were given a front facing with a sea view without asking. The food is as good as ever and never fails to impress, drinks are reasonable and the pool bar menu has a fantastic selection at prices not much more than you would pay in Cala Millor.", "title": "A super place to chill", "user": "comeonmyson", "date": "June 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 33311964}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "The hotel guests were a mixed bunch and we all got on well together espescially during the sports activities.", "title": "Hipocampo Forever!", "user": "Valmilla", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 32062946}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My husband and I have stayed at this hotel 5 times now and it never fails to impress.", "title": "Brilliant", "helpfulness": 1, "user": "TraceyBathNottingham", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30892116}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The hotel staffs are always friendly, polite and courteous. The hotel itself is clean and very well kept.", "title": "Fabulous 5* Food!", "helpfulness": 1, "user": "Simon_Kris_Ben", "date": "September 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20480309, "likes": {"liked": "— Food", "disliked": "— Other guests"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I would, however, recommend this hotel to couples only as the hotel isn’t really setup for children.", "title": "True 5 star", "user": "teeny29", "date": "September 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 19843539, "likes": {"liked": "— food", "disliked": "— beach"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Being neither ‘German or geriatric’ I would highly recommend this hotel for a complete break from the normal routine of life and sit back and enjoy the fact that, even though there aren’t many English speaking people around, you aren’t in England anymore, to get that one should perhaps go to Blackpool!", "title": "Great hotel but not 5 star", "helpfulness": 1, "user": "vampira22", "date": "August 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 18962122}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The Hipocampo Palace is a 5* hotel.", "title": "Very relaxing stay", "helpfulness": 1, "user": "ekuk", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18056026, "likes": {"liked": "— Food", "disliked": "— Nothing"}}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 5, "variance": {"poor": 6, "average": 9, "very good": 32, "terrible": 2, "excellent": 147}, "aka": "Hipotels Hipocampo Palace Hotel Cala Millor", "slim_ranking": 0.016393442623}