{"user_rating": 4.0, "review_count": 345, "name": "Hippo Hollow Country Estate", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Our group of 20 had a disappointing stay. The rooms were cold and there was no way to get warm. Someone broke into one of the rooms the first night and the explanation of staff was poor at best. There were no telephones in the room - so they could not even phone for help. the two ladies were very upset about the incident. We tried to follow the request of hanging up the towels after use to reuse them (to help conserve water). The staff however did not allow them to dry before folding them up for reuse - the result was that we had wet towels to use at the end of the day and by then they smelt not very good! The food was really disappointing. Next time we take a group Hippo Hollow will not be on our list of places to visit! I paid for internet service - which did not happen and did not get a refund even though the computer was down.", "title": "a disappointing stay", "helpfulness": 1, "user": "Meredith95", "date": "July 15, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 3.0, "service": 2.0}, "id": 115401393}, {"rating": 3.0, "stay_parameters": "Stayed February 2011", "text": "My room was clean and tidy but others were dirty and ants in the beds. The food was presentable. The views across the river was beautifull. Do go the elephant sanctuary. A fabulous trip. And interaction with an elephant.", "title": "A busy hotel but very friendly", "helpfulness": 1, "user": "adrianEngland", "date": "June 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 114305944}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "i stayed here for 2 nights. i did the panarama tour from here which visited blyde river canyon , the waterfalls and gods window. i also did the elephant whispering which is just a short walk across the bridge to the other side of the river.", "title": "hippo's at your doorstep", "user": "jeaniethomas", "date": "May 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108014342}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "the room was clean ,i had a verandah overlooking the river and early in the mornings if you were awake you could watch the hippo's grazing on the grass just outside your balcony. the meals were great ,although sometimes the lunch orders took some time to get to you , . one thing i found though, was if travelling alone without a car it was difficult to organise any activities from there as it was just too expensive to get to the location.", "title": "Great hotel-lodges with friendly staff in a quiet relaxing location", "user": "angeldebs", "date": "May 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 107804848}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "if you would like to see the photo's i have posted some on the wild wings safari's facebook page, which is who i booked my whole trip through.", "title": "Magical", "helpfulness": 2, "user": "suzywillows", "date": "April 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 106015962}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Stayed for 5 nights whilst doing the usual tourist things (kapama, Kruger, panoramic tour and elephant whispers). Really enjoyed although the ants in the bed were a bit of a downer! Had a river view chalet and spent lots of time just watching the elephants (no hippos though).", "title": "Enjoyed and the staff were nice.", "helpfulness": 3, "user": "Kerzy", "date": "August 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 4.0, "service": 4.0}, "id": 117093669}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The rooms are really quaint and African, with pictures of rinoes on the walls and vaulted ceilings made of dark rattan. There is ac and a ceiling fan too. The little balcony is wooden and looks over at the creek that winds its way through the property. One night I stepped outside and the smoked a Honduran cigar as I watched the smoke waft up to the African moon shining through the twisted branches of a tree. The neat or cool thing about the place is that it is the real wild Africa you have dreamed about and seen in the movies. there are sighns on the property warning about the dangers of wild animals such as hippos which can attack if you happen to block their way to the water.!!! Best of all, you are in Hazyview, right next to Kruger National Park !!!!-where you are sure to see the \"Big Five\" !!! The only thing I didn't like was the shower. The glass doors leaked and I had to mop up the floor with a towel.", "title": "You are in the heart of South African bush country, you feet it here!!!", "helpfulness": 3, "user": "joedigrazia", "date": "August 17, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116870015}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Stayed in a family room which was basic but very comfortable. Well equipped with a great view of the hippo pond. Ate in the restaurant which was very nice with good and quick service despite being busy. Good breakfast with resident chef on the buffet. Organised trip to the neighbouring elephant sanctuary with reception, which was worthwhile and very interesting. But important to note you cant go and just watch family members as they still charge you.", "title": "Comfortable and relaxed, with friendly staff", "helpfulness": 2, "user": "suew01", "date": "August 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116440830}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "If you like a place that is favored by bus tours stopping over , this is the place for you.", "title": "Last stop in south africa", "helpfulness": 2, "user": "brookdj1", "date": "July 27, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 3.0}, "id": 115848318}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Our family had a 5 night stay at Hippo Hollow from July 12th-17th. We found the hotel rooms very spacious and comfortable. The housekeeping service was excellent. The rooms were cleaned daily and the staff was very friendly and accommodating. We had the buffet breakfast each morning and ate in the dinning room a couple of times. The food was excellent and affordable. The grounds were beautiful and we throughly enjoyed our stay at this property. We visited Elephant Whispers which was a convenient, fun and educational experience. This is a must do in the area. We also found the hotel location to be close to Kruger Park and the other attractions.", "title": "Hippo Hollow was wonderful", "helpfulness": 3, "user": "MmillsCmills", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115735593}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Went to Hippo Hollow in April to get married from the moment we got there everyone could not do enough for us, the chalets were lovely, proper African style the balcony over looked the river with hippo's and croc's I don't see how any one could fail to not fall in love with the place. The restaurant food was excellent a huge selection was available at breakfast. All the staff were extremely helpful and friendly we were very sad to leave. Yes there are some creepy crawlies now and again in the chalets but if you don't like creepy crawlies DON'T GO TO AFRICA!!!!!!!!!!!!!!!!! Will be returning for sure.", "title": "Fell in love with it can't wait to return!", "helpfulness": 3, "user": "Jenkins66", "date": "April 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105843231}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Hippo Hollow is conveniently situated close to the world renowned Kruger National Park, and other magnificently scenic places. The accommodation is fine, and serves as a place to rest your head after a long day of sight seeing. Yes the rooms could be maintained better, cleaned more thoroughly, and lit better... and yet Hippo Hollow has a delightful charm and feeling that may be destroyed if things got a bit too clinical.", "title": "Not too bad... Not too good!", "helpfulness": 3, "user": "mlondozi", "date": "April 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 103292194}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The restaurant was nice enough, and I enjoyed having a cup of coffee outside on the terrace. In Africa one must get used to African time, and African time is not a frenetic rush. African time is slow, and relaxed. I prefer this approach to any other, however if you want instant service then perhaps book into a private lodge at 10 times the price. The staff are friendly and relaxed, and we enjoyed our time at Hippo Hollow.", "title": "AWFUL ROOMS !", "helpfulness": 1, "user": "tokyojane", "date": "April 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 103217989}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "One of the WORST places I have ever stayed ! The room was dark and filthy, by morning everything we had was covered with ants. The roof leaked on us all night. Black stuff fell through the thatch roof all over the beds and table in the loft, as soon as we cleaned it off it would happen again. We had to move the beds so my children could sleep. We didn't get any sleep. We may as well have been camping.", "title": "First Impressions were deceiving.", "helpfulness": 1, "user": "ShiresUK", "date": "March 26, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 101653081}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I told them about all of this at check out. They could careless, and it wasn't cheap. So basically, service is not a strong point either.", "title": "Very nice hotel", "helpfulness": 1, "user": "tomgem_lond", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 100617790}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "We stayed here for 3 nights and enjoyed every minute, having dinner looking out on to the river where hippos are just lazying around. rooms were good food was good, not far to travel to get into Kruger park.", "title": "See the hippos up close", "user": "johnswingler", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98106959}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We stayed with our 2 children (2 and 4 years) in a river cottage at Hippo Hollow. The setting is fantastic with morning and evening views of hippos in the river. Close to the entrance of the Kruger Park. Breakfast was very good and also the restaurant is very good value. Service was very friendly and helpfull. The rooms need attention though. They need some renovation as the thatch roof of our room had some leaks (water drops falling in our bed during night rain), which is unacceptable. For this reason I would not recommend this hotel. Once rooms are renovated, it would be great value for money, so watch out.", "title": "Nice Setting - Rooms need renovation", "helpfulness": 1, "user": "chris_nathalie", "date": "February 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 96621698}, {"rating": 2.0, "stay_parameters": "Stayed January 2011", "text": "We paid for our drinks with a moderate note ( approx £10 equivalent) all we had at the time and the waitress did not bring back the change, we always tipped the serving staff but expect, unless told otherwise the change to be returned and then a tip given.On this occasion the waitress did not bring back the change, we asked the waitress for the change and she said it was not her but another waitress. Therefore we did not drink or spend another penny in this hotel.", "title": "watch the waitress", "helpfulness": 1, "user": "rover03", "date": "January 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 94809092}, {"rating": 1.0, "stay_parameters": "Stayed December 2010", "text": "I stayed here 7 & 8 December 2010 with Just You.", "title": "WATCH YOUR VALUABLES - BETTER STILL: AVOID!", "helpfulness": 1, "user": "MickT90", "date": "January 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 94246709}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "On leaving I and the guy in the next room discovered that money had been taken from our room safe (I believe while we were at breakfast). I believe around £150 in his case, between £400 & £500 in mine. In both cases not all was taken. I also had a decent pair of sunglasses taken (from their case) in my bedroom. I notice from these reviews that we were'nt the first!", "title": "Pay 5 star for a 2-3 star", "helpfulness": 1, "user": "Gvol", "date": "January 21, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 93925937}], "location": {"country": "South Africa", "continent": "Africa", "city": "Hazyview"}, "stars": 3, "variance": {"poor": 26, "average": 59, "very good": 113, "terrible": 14, "excellent": 133}, "aka": "Hippo Hollow Country Estate Hotel Hazyview", "slim_ranking": 0.25}