{"user_rating": 4.0, "review_count": 9, "name": "Historic Maplethorpe B&B", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Off the beaten path but well located to the Confederation Bridge and touring the western, northern and central parts of the island.", "title": "Good Introduction to PEI", "helpfulness": 1, "user": "simpme", "date": "September 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 78959756}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Room is comfortable. Bathroom is a bit small but it works. Bed was comfortable. Breakfast is fabulous. Owner is a trained pastry chef. She runs a cafe at the same location that serves weekday lunches and weekend dinners. All made from local fresh and mostly organic ingredients.", "title": "Quaint B&B", "helpfulness": 1, "user": "MountainMooses", "date": "July 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 34956150}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My husband and I spent four nights here while on PEI for our honeymoon. We were the only guests in the main house at the time, and were very pleased with our experience. Dianna was helpful from the first email we sent many months ago. Our bed was comfortable and while the bathroom was small, it gave us everything we needed to get ready for our next day's adventure. Our room and bathroom were clean and refreshed daily. The breakfasts were large with delicious foods, recommendations for other area restaurants were right on and they even made us a special, private dinner in-house one night although the restaurant was not open to the public. The price of the dinner was excellent when compared to other local establishments. We'd definitely go back and recommend this place to others.", "title": "Not what we expected", "user": "reviewOttawa", "date": "June 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 32113722}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Window screen in room had wide torn gap at bottom and when problem identified was resolved with a large strip of scotch tape. Screen in hall window also in poor condition. This is in mosquito season . Private small bathroom although the only mirror was approx. 8\"x10\" mounted right in the corner and of no use. Towels replaced daily however last one smelled sour. Water not replaced nor baskets emptied. Why did we not move? We were gone all day and meeting relatives in Summerside who fortunately had superior accomodation. Certainly does not deserve even a 3.5 rating.", "title": "Foodies Take Note", "helpfulness": 1, "user": "Canuckle007", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0}, "id": 19944986, "likes": {"liked": "— The amazing food and the friendliness of the proprietors"}}], "location": {"country": "Canada", "city": "Bedeque"}, "variance": {"poor": 1, "average": 0, "very good": 5, "terrible": 0, "excellent": 3}, "aka": "Historic Maplethorpe B&B Bedeque, Canada", "slim_ranking": 1.0}