{"user_rating": 4.0, "review_count": 550, "name": "Historic Inns of Annapolis", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Every year my brothers, my wife and I truck up to Maryland for a mini-family reunion with our 86 year old sister. We go to Annapolis and stay at the Gov. Calvert Inn. It's an extremely historic inn with all the amenities you'd want. Outstanding location, clean as a whistle, with friendly and competent staff and has a 12 o'clock check-out. It's located immediately across from the state Capitol and just two doors down from Harry Browne's fine restaurant (lunch and dinner). For breakfast we go to Maryland Inn and eat at the Treaty of Paris restaurant. Just a couple of blocks away and very historic. The food is excellent. Although it's a mite expensive to stay at the Gov. Calvert Inn, it's certainly worth the price. Go ahead and treat yourself and your better half. You'll be glad you did.", "title": "Treat Yourself to a stay at Gov. Calvert Inn, Annapolis", "user": "johnpowell_99", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106889162}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We had a great weekend in Annapolis - the hotel was perfect. At the end of Main St with all the restaurants and shops. VERY kid friendly - we have a 2 yr old and a 3 month old so when they got tired we were literally steps from home base. Highly recommend this hotel, we will def. be staying there again!", "title": "Wonderful Hotel in a Perfect Location", "helpfulness": 1, "user": "racheli1", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105413552}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "It is one of the most unique places to stay. Historic, beautiful, cozy and staff very very friendly. Restaurant is very good as well, the Crab Bisque is to die for.", "title": "Loved every minute of it - by world traveler", "user": "miawalles", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105300992}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I canceled my reservation within 45minutes after making it online but the hotel would not refund my money nor would they bend their refund rules. I am very unhappy as I would have re-booked for a future stay. Now they have my money, I no longer have a reservation so am unable to visit even if I were able to change my plans. Buyer beware!", "title": "Unpleasant receptionist-rude and unhelpful", "helpfulness": 3, "user": "gofauxit", "date": "April 22, 2011", "detail_rating": {"service": 1.0}, "id": 105019094}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "OVERALL EXPERIENCE:", "title": "Historic Inns of Annapolis (Robert Johnson House) = a fantastic value", "user": "ringostx02", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 104516552}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "A one night stay in the Maryland Inn which could not be described as comfortable. The best feature was the valet parking on arrival which was quick and efficient. The main reception is in a separate building 2-3 minutes walk away. At the Maryland Inn there were no staff evident, the roo rather dowdy (it may have been trying to look period - but failed) and a poor night's sleep resulted from the steady roar of airconditioning units (ours was turned off but nearby units made up for it). Bathroom minute. Breakfast service incredibly slow. I am sure that better accommodation must be available elsewhere in Annapolis.", "title": "Stay elsewhere", "user": "Rover10", "date": "May 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 108489406}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Excellent service and a \"what can I do attitude\" to make one's stay enjoyable. Great location for visiting the USNA on foot and walking about town.", "title": "An enjoyable experience w/o all the bells and whistles associated w/ a large hotel", "user": "saint5", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108461995}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I stayed here once before a year ago and was unhappy not to have coffee either in my room or the little lobby of the hotel. I stayed in the Robert Johnson House, which really has no lobby. In fact, I am in the same exact room as last time. This time at least they put some coffee in the little lobby, but it was not refreshed until sometime after 9:30 this morning. I don't know if they put some in really early and all the early birds drank it all, but I get crabby without a cup of coffee first thing.", "title": "Fantastic Location, Comfy beds!", "user": "Jennjoonthego", "date": "May 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 108242524}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Other than my personal issue with coffee, everything else is great about this hotel, especially with the location and price taken into consideration. I wanted to avoid driving during my stay and that's what we managed to do.", "title": "don't take your valuables to this dated hotel", "helpfulness": 2, "user": "miked18", "date": "May 12, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 108017289}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "My wife and I were there in April. The first suite we were shown required us to go through the bathroom to get between the bedroom and the sitting room. The next suite was a duplex with a sitting room that looked like the fixtures, furniture and walls had last been done during the civil war. Two days into our stay our two ipads were stolen from our room. The locks were not disturbed. A fool could tell it was an inside job. That last night my wife slept with a pair of sissors to protect herself as she tried to sleep. The hotel accepted no responsibility for the theft and charged us in full for this experience. After a sleepless night, we left for the safety of our home in New York City.", "title": "Great value for the location!", "helpfulness": 1, "user": "JackandAnnelise", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107494305}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed in the Governor building. Room was nice; we were put in a WC room, which was fine for one night stay. The one fault was that we were not explained about the dining room and lounge. They are at another building (Maryland house), which by the way is right on main street. We did the bed and breakfast which was excellent. Be advised the parking is $24 dollars a night, but well worth it. Over all excellent stay and would stay again", "title": "Quick get away", "user": "herbparrish", "date": "April 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 103596354}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Love the hotel, the service is great and couldn't ask for a better location. Convenient to walk to historic sites, the waterfront, and for shopping. Would definitely stay here again--However--it just so happens that the night of our stay, there was also a wedding reception being held--which means that as I am sitting in my room--I may as well be attending the reception--it is so loud that I can hear every word that the announcer says (as well as individual conversations of the guests). And although I love their choice of music--I do have to get up early tomorrow AM. In all fairness-we were warned at check in that it would be loud until 11PM--however, after travelling 500 miles by car--I wasn't willing to say--no I better find another hotel. Seems to me that maybe I could have been warned by email a few days in advance that it was going to be loud all evening in my room.", "title": "Perfect location in Annapolis, but ask about weddings", "user": "sierradog1", "date": "April 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 102581777}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "We stayed at the Robert Johnson House and loved it's location. Great view of the State House and close to everything. We chose a Queen Deluxe Room on the top floor (4th floor) and it was perfect!", "title": "Loved our stay!", "user": "RCherricola", "date": "March 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 101557460}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "While my overall stay was not all bad, we spent two nights at the worst possible hotel in beautiful Annapolis, Md. Mice were everywhere, i saw a bug that i never seen im my life. Downtown was awesome, the harbor, the food, the atmosphere was amazing....One of the hotel staff smelled of marijuana and alchohol. It is none of my business, but is this normal? A change in leadership is probably a good idea! So to anyone visiting Annapolis in the near future beware, watch your feet and check your sheets!", "title": "Shoot me instead!", "helpfulness": 4, "user": "sly72", "date": "March 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 101400646}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Although a booking thru Expedia described a reservation at the Maryland Inn , when we arrived to check in we were informed that Expedia does not have true room avail info when booking this 3 building property...anyway, happily we stayed at the RObert Johnson- lovely, quiet , perfectly located building was clean, comfortable with an incredible view of the State House. Although it is so quiet here, with no attendant employees, at first you feel as if you are in a nice rooming house...but that ends up not being a bad thing- we would stay there again>", "title": "A Naval Academy wedding brought us to the Robt Johnson house for 2 nights- perfect for us!", "user": "kimmermc", "date": "March 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100841978}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stopped for the night on our way to Dover, and was very pleased we did. The staff helped right away with getting us a comfortable room at a great rate. It was a great experience from start to finish!", "title": "Great last minute decision", "user": "Raider9909", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97578804}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Too bad, really. It is in a great location, the valet staff (another company) is busting their hump to get the cars out of the way quickly. The hotel staff does a great job of getting your luggage from the room to your car hassle-free. Keeping these old buildings alive is admirable. BUT... no source of heat or ventilation of any kind in the bathrooms only leads to mold. And sure enough, big and black, growing up the wall where no room attendant looks or could reach. VERY UNHEALTHY for one's lungs. The room had a window a/c unit. Perhaps this was also the heat source for the rm. This filter hadn't seen a vacuum or a bleach bath in its lifetime. Even so, mold doesn't restrict itself to just the filters in these units. Really ashame.", "title": "Moldy", "helpfulness": 2, "user": "foryourinterest562", "date": "February 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97465914}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Every year friends and I attend a breast cancer fundraiser in the Annapolis Inner Harbor. This year a few of us stayed at the Historic Inns of Annapolis. At first the location was a little confusing, because the Inns are actually 3 separate buildings around the State House circle, which for Annapolis means the location is perfect. The room was small, but very clean and cozy, however, the best part was the staff. I left my key in my room, not once but twice! Both times staff members came straight to my room and were very friendly about my blunders. I cannot wait for next years fundraiser and for my next stay at the Inns!", "title": "Perfect weekend escape!", "user": "SMSESI", "date": "February 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 96194591}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The staff is very attentive and super willing to answer any questions. The hotel itself is beautiful, very cozy and inviting. My room was great, very clean with an insanely comfortable bed. Very close to the State House and Senate/House Buildings, as well as Historic Downtown Annapolis - Main Street is less than a five minute walk away. I would absolutely recommend this hotel to anyone and intend to stay here each time I return to Annapolis.", "title": "Great place to stay in Annapolis!", "helpfulness": 1, "user": "elh918", "date": "February 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 96173253}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "My extended family stayed at the Governor Calvert House where we also had my daughter and new son in law's wedding reception. The hotel was much nicer than I had imagined. We had paid so much detail to wedding plans that we had not even seen the rooms and had no idea what the accommodations would be like. They were much better than I could have ever believed. The rooms were beautiful. They were charming and elegant. Everything was perfect--and clean! My son, who is handicapped, had no trouble manuevering his mobility scooter around. Everything was accessible for him. And the staff, wow!--so kind and helpful. Every staff member we came in contact with was terrific.", "title": "True elegance and charm", "helpfulness": 3, "user": "Liz21784", "date": "January 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93873706}], "location": {"country": "United States", "city": "Annapolis"}, "stars": 3.5, "variance": {"poor": 43, "average": 48, "very good": 133, "terrible": 45, "excellent": 281}, "aka": "Historic Inns Of Annapolis Hotel Annapolis", "slim_ranking": 0.136363636364, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "History comes to life at the Historic Inns of Annapolis. Located in downtown Annapolis, the Historic Inns of Annapolis comprise three unique hotels - each one with a storied past and significant place in American history. Perfect for a family vacation or a business retreat, the inns exude charm and class that have attracted guests for generations. From guest rooms to banquet rooms, we have all the space you need for the ideal getaway!"}