{"user_rating": 3.5, "review_count": 720, "name": "Hoar Cross Hall Spa Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "I have been at Hoar Cross a couple of times now and understand the mixed reviews it receives. It was opened in the 90s and no doubt then, was state of the art, but now it is tired and the pink floral bathrooms and Greco / French renaissance decoration are definitely of a bygone age. The celebrity endorsements (think Julie Goodyear and Lisa Goddard) also belong to a previous age and this, alongside the constant self-promotion of the owner, are a little grating. The food too, is definitely not 5 star. I can't understand the positive comments about the dining as, I had a red onion and goat's cheese tartin that was clearly in a ready-made pastry, a chicken supreme that was tough as old boots and a tiramisu (that says it all!) that again, was pre-made - and poor quality! Bring on Gordon Ramsay - the chef needs sorting out, as, at the prices they charge, you really expect better.", "title": "Mixed bag!", "helpfulness": 1, "user": "easyriders", "date": "May 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 7721096, "likes": {"liked": "— Friendly atmosphere", "disliked": "— Food"}}, {"rating": 2.0, "title": "Welcome to Parasite!", "text": "However, the staff were delightful: friendly, approachable and well-trained. The treatments were a delight: the water-bed massage is a must and the beauty treatments very high quality. And refreshingly there is no hard sell. The facilities such as the pools and the slumber room are genuinely relaxing and therapeutic and just what you need to improve your general sense of well-being. The classes are good too, we tried the yoga which was very relaxing and try the salsa class - it's a real laugh!", "helpfulness": 5, "user": "No,no,no,oh,okay", "date": "March 15, 2007", "id": 7165832}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "So all in all it's mixed, and as long as you know what you're getting you won't be disappointed but it isn't 5 star!", "title": "Excellent 40th Birthday Suprise", "helpfulness": 4, "user": "Michelle114", "date": "March 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7010805, "likes": {"liked": "— The spacious bathroom with a spa bath", "disliked": "— Nothing"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 84, "average": 131, "very good": 161, "terrible": 58, "excellent": 286}, "aka": "Hoar Cross Hall Health Hotel Hoar Cross", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "We are a beautifully restored Grade II listed building. We Combine the pleasures of staying in an elegant English Stately Home with the facilities of a modern luxury spa resort, you’ll be able to enjoy superb surroundings, fine dining and beautiful bedrooms suites and penthouses. Hidden away in 100 acres of English countryside, the spacious grounds have lakes and wildlife in abundance. Make use of the Tennis Courts, 9 Hole Par 3 Golf Course, Practice Area & Driving range with a PGA Professional. We offer a variety of mouth-watering dishes and a host of therapies to wash away the stresses of everyday life. Treat yourself to a coffee or a slice of cake in the Oasis Cafe. We pride ourselves on our outstanding hospitality, so relax and let our dedicated staff take care of you. Winner of England’s Leading Resort at the World Travel Awards for 7 consecutive years."}