{"user_rating": 3.5, "review_count": 236, "name": "Holiday Inn Toronto International Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "While we were only there for a few hours on a layover we were very impressed by the hotel. Extremely nice Holiday Inn. The bed was extremely comfortable. The room was very clean and well appointed.", "title": "Short but sweet", "helpfulness": 2, "user": "Gerald L", "date": "May 23, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "rooms": 5.0}, "id": 161650491}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Our travel service gave us the room for free because of flight changes so I can't rate value.", "title": "A good place to do business", "helpfulness": 1, "user": "PG_GB", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159950247}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "WARNING - There are two Holiday Inns very close together and both on Dixon Road near the airport. A driver from the other Holiday Inn took us to and left us at the wrong one. Make sure you tell them the address. You would think a professional driver would tell you this. He wasn't even apologetic when he came back an hour later to give us a ride to the right hotel. He even made two stops at other hotels on the way there at 3 AM where there were no clients !!!", "title": "Nice business hotel", "helpfulness": 1, "user": "Ottavian", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159659272}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "When we arrived at the hotel the registration was friendly and efficient. The main floor restaurant seemed very understaffed and service was sloooow but friendly and professional. The food was very good. The rooms are what you would expect in this class of hotel. It appears to be well kept and not terribly dated.", "title": "Great service & wonderful food!", "helpfulness": 3, "user": "I_always_notice", "date": "May 4, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 159618770}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "I was present for a conference. The food in the conference venue was good.", "title": "Great place to stay", "helpfulness": 1, "user": "Brenda K", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159574066}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "First impression, hotel needs a lot of work when you look at it from the outside. Looks old and dated. That quickly changes when you go inside. It is really top notch. Clean and elegant. Rooms are very nice, comfy beds and very clean and updated bathrooms. A very feel at home hotel. There is a bar/ restaurant right in the hotel. Quite large and always busy. The hotel does have a conference centre and this is why its always busy. Free shuttle to airport. You have The Keg restaurant right across the street if you are in the mood for a great steak and dont even have to drive. Hotel s located right across the street from the airport with lots of surrounding hotels and restaurants. This hotel is great and not crazy overpriced. Stayed here multiple times.", "title": "Great stay", "user": "Iluvztravelz", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158900170}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This was a great location for the Airport. Our room was comfortable. Very Quiet and a good place to relax before a long or short flight. Check in desk personnel friendly and accomodating.", "title": "Good Hotel.", "user": "ValpOntario", "date": "April 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158708822}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Only complaint would be the price of the buffett breakfast. At $20 per person it was overpriced. However this was made up for the prompt and free shuttle to the Airport. Would definately stay here again when flying out or in.", "title": "Nice Hotel, Bad Timing", "user": "KaytS", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 158601488}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "We stayed in the airport area on the 13th the night before we left for the Dominican Republic. The hotel was nice, very clean the staff was great. The only drawback was that we were there at the same time as a dance competition so there was quite a few kids running around as well as some parents that were up later into the night. Now that is of NO fault of the hotel itself.", "title": "Clean, Full of Amenities", "user": "alany72", "date": "April 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158068284}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "They informed us about the airport shuttle the night we checked in, as well as where everything was in the hotel. There's a good selection of restaurants nearby which was a bonus so that we knew that not everyone would be trying to go to the same one at the same time. The restaurant in the hotel was also a good choice, as we never heard anything bad about it from anyone that had tried it.", "title": "Nice hotel", "helpfulness": 1, "user": "Canadawj", "date": "April 4, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 156587869}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "Holiday Inn Toronto airport", "title": "Fail from the holiday inns...", "helpfulness": 1, "user": "kenys", "date": "June 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 164338151}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Ok, bit old.. My Room was in the last corner and didn't like it. I stayed 3 nights last week.", "title": "Not as good as last time, but overall a positive experience", "helpfulness": 1, "user": "Mark J", "date": "June 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163775229}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The rooms are a bit old, my washroom had broken counter and the outlet for the dryer and the vanity mirror.", "title": "This Hotel Falls Somewhere Between a 3 & 4 Star", "helpfulness": 1, "user": "Tim C", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 163115667}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Being part of PC I asked for rooms always closer to the elevators and these time I got one at back of the hallway. That as very noisy with se sound of the stairs an the other door that's is just so close to my room door.", "title": "Handy for work", "helpfulness": 1, "user": "steveandjudy1994", "date": "June 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162852333}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The bed was good and I had a good sleep.", "title": "Great Hotel. Stupid Elevator", "helpfulness": 1, "user": "Brad M", "date": "May 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 162468974}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed one night in this hotel while traveling this summer. Booked through HotWire, so got a good deal. Check in was swift and the staff was friendly ... We were offered a room on the first floor (or another floor if we wanted). Since we had a number of suitcases, we chose the first floor. Our room was a good walk from the front desk, and near an area that unfortunately looked like was being renovated/dried out after some flooding. There were many fans in the hallway just outside our door that were going the entire time we were there. The room itself was very clean and the beds comfy. We set the AC to the coldest possible setting, but it did little to cool off the room. We did not use the pool facilities, but had a brief visit and it looked very well kept up. We took the shuttle to the airport early next morning, and this was included in the price of the hotel. There was also wifi, but we had trouble connecting, as the signal in our room was weak.", "title": "Good Value, Poor Air-Conditioning", "user": "terre-neuvienne", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168236519}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The price was right and with our business meetings on the premises, it was functional. The rooms were certainly dated and need of an update and renovations. The staff was attentive and helpful. The breakfast prices were slightly higher for the kind of hotel it was and could have been more reasonable. In terms of location, it is very close to the airport and was convenient. It was slightly noisy at night depending on the room you had.", "title": "A Little Dated: Good Value", "user": "Robert G", "date": "July 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 167645695}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I often stay here when flying through YYZ, the hotel is dated and inconsistent. The rooms are well worn but clean. The room I had on the 3rd floor was just OK, the bathroom had been recently redone, but carpet was in sad shape. Almost ever time I am there the telephone never works. The restaurant was just ok, for service, however the wings were wonderful", "title": "Terrific Location near the airport-but little else", "user": "David A", "date": "July 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 167587169}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The Hotel is starting to show signs of its age. Time for new beds and perhaps carpet. Restaurant in hotel AWFUL!!!! Service is horrendous. I stay here about 3 times a month and that is 2 times too many.", "title": "Though adequate, needs a little pick me up.", "helpfulness": 1, "user": "Kondy1", "date": "June 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 165825368}, {"rating": 4.0, "title": "Good deal for a Stay, Park and Fly", "text": "This is the second time I have stayed at this hotel because I had an early flight out the next day. The room is a bit old compared to the newer hotels but it was clean, the beds were very comfortable and they had a pillow selection. The service was great for check in and check out and the bus to the airport is every 20 minutes on the hour. Good indoor pool and hot tub and then they have the outdoor pool open now too. The workout room is a good size compared to other Holiday Inn's. I didn't eat in the restaurant this time because of my early flight but it appeared quite busy the night before. I will get back from my trip in 5 days and know I will be picked up promptly at the airport and shuttled back to get my vehicle, which is parked in a secure parking area. Overall, I believe the stay, park and fly at this hotel is a good deal.", "user": "MuskokaMan", "date": "June 24, 2013", "id": 165006975}], "location": {"country": "Canada", "city": "Toronto"}, "stars": 3, "variance": {"poor": 21, "average": 63, "very good": 93, "terrible": 13, "excellent": 46}, "aka": "Holiday Inn Toronto International Airport Hotel", "slim_ranking": 0.482269503546, "description": "Our Airport Hotel in Toronto Offers Value & ServiceThe Holiday Inn Select Toronto Airport welcomes you to our newly renovated airport hotel at Toronto International Airport (YYZ). You'll love our hotel's free Toronto airport shuttle, quiet, convenient location and heated bathroom floors.Guests appreciate our hotel's close proximity to the Toronto Congress Centre and International Centre, the major host for area events. Our meeting facilities are the best among Toronto airport hotels. Our 21,000 sq. ft. and 23 rooms with award-winning catering are simply ideal for any event.Leisure guests love our hotel's location near Pearson Airport. Nearby attractions like Woodbine Entertainment Centre and shopping at Square One offer family fun. Easy access to Hwy 401and 427 puts Toronto's world-class attractions just minutes away.Guests of our Toronto lodging enjoy delicious dining and fine wines in our restaurant. Workout in a 24-hour Fitness Centre or refresh yourself in Toronto's largest, heated indoor and outdoor saltwater pools and hot tub, you'll be relaxed whether you're visiting for business or pleasure. For your next stay in Toronto, our airport hotel's associates wait to welcome you."}