{"user_rating": 3.5, "review_count": 73, "name": "Holiday Inn Express Durham", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "My family has frequently stayed at Holiday Inn Express properties in recent years (as well as similar lodging in the Hilton, Marriott, and Carlson chains) because they work well for our needs--two adults, two teenagers--and because they tend to be relatively consistent.", "title": "Exceptionally nice HI Express location", "helpfulness": 1, "user": "BeerNBikes", "date": "June 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 17281627}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "That being said, I felt like this particular Express location was superior to the norm in several ways. The lobby with a fireplace and lots of wood had a more upscale, or maybe just a more location-specific, feel; the breakfast offerings were a bit more diverse overall (although I was disappointed that there was no fresh fruit the morning we were there); and the room my wife and I had felt a bit larger than normal (king-sized bed).", "title": "Great Location and Helpful Staff", "user": "marysunshine14", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14808524, "likes": {"liked": "— Location and the Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We were just passing through, but the location is not far from the U of New Hampshire campus.", "title": "Friendly Staff", "user": "Kayle03", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12468863}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "This was the first time I've stayed at any Holiday Inn Express. I was coming to the Durham area for the Kittery Paddle Show. The front desk was very helpful with directions. At check out the girl working front desk was very helpful with billing issues.", "title": "Filthy under the bed", "helpfulness": 7, "user": "Minervino", "date": "October 21, 2007", "detail_rating": {"front_desk": 3.0, "value": 1.0, "location": 2.0, "business": 3.0}, "id": 10202192, "likes": {"liked": "— nothing", "disliked": "— rooms filthy"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "I have found this hotel to be excellent. The staff is extremely friendly, helpful and knowledgeable about the area. If they didn't know the answer to a question I had, they were more than willing to find the answer for me.", "title": "A lovely hotel, very pleasant stay", "helpfulness": 6, "user": "jonathan020", "date": "January 30, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 4.0, "value": 4.0}, "id": 4398911}], "location": {"country": "United States", "city": "Durham"}, "stars": 2.5, "variance": {"poor": 4, "average": 14, "very good": 28, "terrible": 7, "excellent": 20}, "aka": "Holiday Inn Express Durham Hotel Durham", "slim_ranking": 1.0, "description": "The Holiday Inn Express Durham hotel is New Hampshire s newest Express, conveniently in the heart of Durham in Southern New Hampshire! The hotel is just minutes from the University of New Hampshire & UNH's- Whittemore Center.Our hotel has 68 guest rooms including 2 suites & is 100% Non-Smoking. Our rooms offer wireless & hard wired hi-speed Internet connections! Enjoy free Express Start Breakfast each morning featuring the exclusive Express Cinnamon Buns. While sipping Smart Roast coffee, peruse through a complimentary USA Today! It s Simply the Smart way to start your day!In addition to being located at UNH, the Holiday Inn Express Durham is near many schools; Phillips Exeter Academy, Franklin Pierce College, & St. Thomas Aquinas High School. Durham is minutes from Portsmouth, Rochester & Dover which are full of history, shopping & local flavor. Visit Red Hook Brewery, the historic forts such as Fort Constitution or catch a concert at Hampton Beach Casino. We are within minutes of the Fox Run Mall & the Kittery Outlets.Portsmouth Naval Shipyard, Liberty Mutual & Goss International are just a few places that our business travelers visit.Our friendly & knowledgeable staff is ready to provide you with superior service! When you stay at the Holiday Inn Express Durham Hotel you are Staying Smart!"}