{"user_rating": 3.5, "review_count": 169, "name": "Holiday Inn Sioux Falls - City Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "I had some work to do in Sioux Falls and brought my family along with me for some relaxation after my meetings. The hotel and location was really nice and appreciated the complimentary wireless internet access. We stayed on the 8th floor and had a balcony overlooking the downtown area. The Holiday Inn Sioux Falls staff was wonderful and gave my wife a ride to a nearby store. The kids enjoyed the pool and we ate in the restaurant several times because it was a little cold outside. All the downtown stores are really unique and within a couple blocks of the hotel. We plan to go back sometime in the summer because the front desk said we were located right next to Falls Park and a bike trail. We will definately be back.", "title": "Wow", "helpfulness": 1, "user": "wrldtrvlr68", "date": "January 29, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24017658, "likes": {"liked": "— Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "We stayed at this hotel for a wedding. Our experience was great starting with the desk clerk who checked us in. She was friendly and helpful. After checking us in, she gave us directions to the church.", "title": "Great Service, Clean Rooms", "helpfulness": 1, "user": "gbminn", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 23804678, "likes": {"liked": "— Great food and service", "disliked": "— Snowpile in the parking lot"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We went to our room and found it to be very comfortable and clean. We had a great view of the downtown area from our room.", "title": "Perfectly adequate", "helpfulness": 1, "user": "Kamtini", "date": "October 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 20621291, "likes": {"liked": "— Room service food", "disliked": "— Noise"}}, {"rating": 2.0, "title": "nice but", "text": "We went to the reception on top floor on Sat night and found the food to be delicious. Other guests at the reception thought the same thing.", "user": "dakotatravler", "date": "September 26, 2008", "id": 20394341}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We have gone on weekend trips for weddings before but enjoyed this one the most.", "title": "Great location, recently rennovated, some weird quirks", "user": "xemcats", "date": "August 3, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 18561189, "likes": {"liked": "— Great location", "disliked": "— Bad parking situation, low bathroom ceilings"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007", "text": "The Sioux Falls Holiday Inn City Center has a great downtown location. Near some interesting shopping, free use of YMCA, not too far from the Starbucks.", "title": "Dirty glasses", "user": "2Midwest", "date": "December 21, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 4.0, "location": 5.0, "value": 3.0, "rooms": 2.0}, "id": 11880965, "likes": {"liked": "— Great downtown location, free use of the Y", "disliked": "— 4 filthy drinking glasses in the room marred an otherwise good experience"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "However, the 4 drinking glasses in the room had crud in the bottom, the screen door window needed cleaning, and the balcony had broken glass and a cigarette butt.", "title": "Your standard hotel", "user": "Brad J", "date": "December 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 11634283, "likes": {"liked": "— location", "disliked": "— elevators"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "This is a common issue with hotels: the maid swipes a dirty rag through the drinking glass or coffee cup.", "title": "Wonderful hotel, exceeded my expectations", "user": "mbmommy", "date": "November 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11105038, "likes": {"liked": "— Large, clean comfortable rooms", "disliked": "— You have to walk through the lobby to reach the pool"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The bathroom seemed slightly more up to date than the rest of the room. The bed was firm, the pool was average, the size of the room was average, the TV was standard.", "title": "Decent place, decent price", "user": "Charlie3446", "date": "September 15, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 8718977, "likes": {"liked": "— clean rooms", "disliked": "— ammenities such as shampoo not in room only soap bars"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The parking was generally pretty good the first night. On our second night, it was a little harder to find a space due to a banquet but I've certainly had worse spots.", "title": "terrific hotel", "user": "YorkResident", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6058854, "likes": {"liked": "— location", "disliked": "— some rooms on the north and south ends of the hotel have balconies if you like that sort of thing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We had a very pleasant stay here, no complaints. Pool was a little small and a bit crowded, but the kids enjoyed it. Rooms were spacious enough and very comfortable. We would stay here again.", "title": "Very nice place to stay, no complaints", "user": "gogogadgetmom", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 16539980, "likes": {"liked": "— Friendly service, comfortable clean rooms with modern decor, free parking", "disliked": "— Couldn't access the high speed internet, but it was close enough to a downtown hotspot I was able to log on thru a different company for free."}}, {"rating": 4.0, "title": "Friendly Staff, Welcoming Atmosphere", "text": "This hotel was good. The room was spacious and clean and I was updated to the executive floor when I asked if there were any upgrades available. Staying on this floor you had to use a key to access it and they offered a free continental breakfast with fruits and cereal, etc. which was a nice bonus. The good thing about this hotel was that everyone I ran into who worked there was really nice and friendly. My room and bathroom were tidy and my only complaint about the room was the shower pressure was a little light. They had a fun game room and I didn't use the pool or gym area but both looked nice. I ordered dinner from the hotel restaurant and it was pretty tasty. I would stay here again.", "helpfulness": 1, "user": "ISellSyn", "date": "April 10, 2008", "id": 14942236}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "They gave us the military rate. There is full service restaurant, pool, bar area, conference rooms, exercise room, arcade and the staff is extremely competent. There are luggage carts", "title": "This is the tallet building in downtown Sioux Falls, and well worth the money", "user": "UsedToBeAWaittress", "date": "March 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14182954, "likes": {"liked": "— the full service restaurant", "disliked": "— that we couldn't stay longer"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Overall a good place to stay, nothing wrong. room was clean and well setup, firm mattress, good amenities. On site dining was good also several eateries and clubs are close by, an easy walk. Best part for me is that it's not next to a freeway as so many hotels are these days. It's downtown location is actually pretty quiet. Excellent friendly staff.", "title": "Good Hotel", "user": "Recceman", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 14022483, "likes": {"liked": "— quiet location", "disliked": "— sometimes difficult parking"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "My plane arrived at 9:30 am, so i figured it would be a few hours until i could check in. To my surprise they found a room and let me check in right away. The room was neat and clean, with a firm mattress.", "title": "Great Place", "user": "millhorn", "date": "February 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 13676465}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We netted this room off of Hotwire.com for about $68 including tax. Good price versus its posted rates, and the downtown location was convenient for us to explore the area. Reminded me of the convention hotels I used to stay at as a kid when my parents would travel to Jaycees functions, with its indoor pool and game room. Perfectly fine hotel, nothing spectacular.", "title": "Just fine.", "user": "JRCaesar", "date": "July 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 34959253}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "I've had decent rooms at this hotel - some even have small balconies -when I've booked through the hotel or a discounter. My last stay was booked by naming my own price at Priceline, and evidently my bid was insulting. My room had a small window with a view of the roof of the porte cochere and was obviously used for storing extra furniture, because it was crammed so full I was unable to open the drawers in the corner armoire. The mechanical noise from the HVAC system was very loud; I had to use earplugs to sleep. I never would have accepted this room if I hadn't paid only $48 a night, and I seriously doubt they'd even offer this room to anyone they considered a real guest. The hotel's elevators are VERY slow and the public areas reek of cigarette smoke because the bar is open. At least all guest rooms are nonsmoking, and the hotel is on the great trail system that runs along the river. Wifi is free, unlike another big-name hotel in town. Fitness center is shabby.", "title": "Hit or miss.", "helpfulness": 1, "user": "Richard C", "date": "May 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 1.0}, "id": 30648967}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Let's face it, this hotel is not new. It is exactly what it is, a 3-star Holiday Inn that has been around for awhile. That said, having just stayed in a 3-star old Holiday Inn near downtown Raleigh the week before, I can say that this one in Sioux Falls was much better. In what way? Well, the lights in the room worked, the AC worked, and the free Internet access worked! Our room was clean when we arrived, and kept clean by the hard-working staff. Check-in was friendly, and I love that they don't require a credit card to be kept on file, if you have prepaid as we had, via Priceline. We got a better deal for it off Priceline ($45) than we had via Hotwire for our stay at this same location in November of 2008 ($59) and in January of 2008 ($65 via Hotwire). We find this hotel to be consistently friendly. This was the first time we have tried breakfast in the hotel, and I love that their food prices are very reasonable, especially since most hotel restaurants are expensive. We did not get the breakfast buffet, but I believe it was less than $9, and that included chef-made omelets from the kitchen. We wanted a lighter meal, and they were happy to oblige. Service and food were both excellent. Bar prices are reasonable at this hotel also. Another rarity for hotels. Free parking, also. A very rare thing for downtown hotels in general, but it would be odd for a hotel in Sioux Falls, I would think. Still, it's nice to not be charged for what should, imho, be standard for hotels...parking and internet.", "title": "I like this Holiday Inn", "helpfulness": 1, "user": "LovedToronto", "date": "May 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 29693099}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "I love the location. Downtown Sioux Falls is not a bad place to be. The Falls are pretty. There are some good restaurants, and some nifty shops. Now if they can just work on warmer weather! :)", "title": "Good City Centre Location", "helpfulness": 1, "user": "Happy0nH0liday", "date": "March 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 25360591}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Travelled for business- priority was to be close to town. The rooms are clean and comfortable, although the decor is a little outdated and not as luxurious as other hotels a little out of town. Close to down town restaurants and bars- useful if you do not have your own transport. Taxi to airport approx $15, although the hotel offers a shuttle. Taxi to other stores and mall, approximately $30. Room service/ food a little average but overall good for the price paid", "title": "Nice hotel in downtown area", "helpfulness": 1, "user": "lobster68w", "date": "February 16, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 24610724}], "location": {"country": "United States", "city": "Sioux Falls"}, "stars": 3, "variance": {"poor": 21, "average": 42, "very good": 57, "terrible": 7, "excellent": 42}, "aka": "Holiday Inn Sioux Falls-City Hotel", "slim_ranking": 0.533333333333, "description": "Set in the heart of vibrant & historice downtown Sioux Falls. We are a full service hotel with 290 comfortable guestrooms, complimentary airport shuttle service, a business center and fitness center. Right outside our front door you will find many unique shops and restaurants. Our convenient location offers easy access to the airport, I-90 & I-29."}