{"user_rating": 3.0, "review_count": 33, "name": "Holiday Inn Express Perris-East", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2007", "text": "I would never stay here again. Our tires were slashed in the parking lot...and we were parked in spot closest to the front desk. The hotel was not clean, the rooms were not adequately stocked (no towels in the bathroom!) and the service was unfriendly. We were meant to stay two nights, we checked out after the first one...I'd rather sleep in my car than stay another night...", "title": "Stay away!", "helpfulness": 3, "user": "marentis5", "date": "August 2, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 8282326, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "I thought that the stay was pretty good considering how little I had to pay for the room in comparison. I would recommend this to most everyone. I'm not saying that this place is the four seasons but then again, I really don't have that type of budget. I thought it was a good deal for the money.", "title": "Good Stay", "helpfulness": 1, "user": "ConstantTraveler1", "date": "December 18, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6470492, "likes": {"liked": "— Location", "disliked": "— No \"Wow\" factor"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "the manager act like she is make us a favor to book at this hotel", "title": "the only hotel/ motel in perris", "helpfulness": 4, "user": "AzzulMarino", "date": "July 22, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 1.0}, "id": 5495744}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "the rooms are dingy and depressing so the hallways", "title": "Okay for just one night....", "helpfulness": 4, "user": "memberWestLosAngeles", "date": "May 10, 2006", "detail_rating": {"cleanliness": 2.0, "rooms": 2.0, "value": 3.0}, "id": 5046099}, {"rating": 1.0, "title": "Don't stay here", "text": "this is a tacky hotel only for an emergency night stay", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 31, 2006", "id": 4824815}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "We stayed here for a last minute trip out here for a funeral. We didin't have a lot of money to spend and this was in the right area. This motel is what you would expect for a buget price. Desk staff was just average but helpful when needed. The rooms are nothing special, but clean and decent. No alarm clock - we thought that was strange. The shower was great - good water preassure and one of those nice arced curtain rods that make the shower seem bigger.", "title": "Fine for a Buget-Priced Motel", "helpfulness": 2, "user": "Navilla", "date": "February 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4416243}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "The pool was AWESOME. It is outdoor, but very heated. And the whirlpool was great, too.", "title": "Pass on this one!!", "helpfulness": 8, "user": "Jimpro", "date": "July 6, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 3.0}, "id": 3639608}], "location": {"country": "United States", "city": "Perris"}, "stars": 2.5, "variance": {"poor": 4, "average": 8, "very good": 6, "terrible": 7, "excellent": 8}, "aka": "Holiday Inn Express Perris-East Hotel", "slim_ranking": 0.5, "description": "Welcome to the Holiday Inn Express Hotel in Perris, California Our hotel in Perris, California is located near several Southern California attractions. Guests are sure to enjoy our choice Perris, California hotel where your comfort is our first priority. Perris, California is within driving distance of many, well-known California attractions, including the beautiful Southern California beaches. Families are sure to enjoy visiting the Perris Valley Skydiving School, Orange Empire Railway Museum, March Field Air Museum and Perris Lake. Pechanga Casino and the Temecula Wine Country are also located near our Perris hotel and make wonderful day trip destinations. Business travelers can appreciate our premier business amenities, which include an on-site conference room, business center, audio/visual equipment, catering, computer access, and copy and fax services. Unlike cheap or discount Perris, California hotels, we offer free high-speed, wireless Internet throughout our hotel for your convenience. Nearby corporate locations include Imperial Steel & Tube Co. and the American Cancer Society. We encourage guests of our lodging in Perris, California to take advantage of the outdoor pool and the fitness center. Every morning, we serve a complimentary hot breakfast bar, which features our signature cinnamon rolls. Call today to book your reservations for our lodging in Perris, CA, and enjoy our great rates."}