{"user_rating": 4.0, "review_count": 161, "name": "Holiday Inn Express Hotel & Suites White River Junction", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I stayed at this hotel for an interview at the VA hospital which is across the road (a safe and easy walking distance). From my very first call the staff was incredibly welcoming, friendly, informative and helpful. My standard double room on the 1st floor was clean, quiet and comfortable. I barely heard anyone else, and I don't think the hotel was empty. I would imagine it is less busy than the summer months and had mostly business travelers. The in room refrigerator and microwave were fantastic (they looked brand new) and the complimentary 24 hr tea, coffee, fruit and hot chocolate was a nice touch. The hotel was clean, and the complimentary breakfast was very helpful since there is not much else nearby and I didn't have a car. It had selections for most diets (e.g. yogurts, eggs, breads, muffins). Free in room WiFi, business center and small fitness center were great too. I had to stay an extra night due to the bad weather at home and the staff was able to accomodate me when I made a nearly last minute decision to stay. I ventured up to VT on Amtrak (the station is 5 min taxi ride from the hotel), so I didn't have a car and the staff recommended a local taxi service (Big Yellow Taxi). Prices were reasonable and the drivers were always prompt and friendly.", "title": "Nice facility, great staff, would stay again", "user": "rikabbbb", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55940382}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We had an excelent room, large well fitted and comfortable. Well equipped business centre and acceptable breakfast.", "title": "Would stay again", "user": "Canarytops", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 51649710}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The staff at this hotel made all the difference in the world. They were friendly, patient and", "title": "Would stay there again.", "user": "maggie2050", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47417922}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "cooperative every time I asked a question. They recommended good restaurants and gave", "title": "just ok", "helpfulness": 1, "user": "DeeKajun", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 47389308}, {"rating": 1.0, "title": "Paid Torture", "text": "directions to the best places to see. I will feel good about recommending this hotel to friends and family.", "helpfulness": 1, "user": "GANEZ", "date": "October 15, 2009", "id": 46950606}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed at the Holiday Inn Express for two nights, and had booked a full 2-room suite through Hotels.com. When we checked in, we were given a mini-suite with a half wall, which is not at all what we wanted. When we complained, we were told that they don't guarantee the type of room when booked through Hotels.com. I think that this is true, and that they were within their rights to give us the mini-suite, but they very nicely juggled rooms to accomodate both us and friends, who were in the exact same situation. Our 2-room suite was clean, spacious, and comfortable. Facility in general was clean, and the complimentary breakfast was a nice bonus. Parking was nice, too -- there are outdoor spots but also an underground garage, which worked out great for us since it rained most of the weekend. The hotel is right off the highway and we had some concerns about noise, but it wasn't a problem. Highly recommend overall.", "title": "Very nice facility and helpful staff", "helpfulness": 1, "user": "Clarkthehorse", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39020054}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We were travelling with my brother and his wife, so we got a suite with an adjoining regular room. The hotel made a special effort to make sure our rooms were adjoining and called us after our check-in to make sure everything was okay in the rooms. The rooms were spacious, comfortable, and clean. The free breakfast that was available was very comprehensive - hot items, a variety of cereals, bagels, toast, yogurt, hard boiled eggs, juices, and cartons of milk. The only downside was the kitchen in the suite. It was very spartan: no cutting knife, no dishwasher detergent, no dish towel, no dish cloth or sponge, no paper towels. So if you stay there, bring some supplies. But overall, great value for the price and conveniently located to many things.", "title": "Excellent Value", "helpfulness": 2, "user": "BostonNix", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 38655268}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We have stayed at this hotel twice over 2 years: August 2008 and August 2009. Each experience was perfect. Sparkling clean linens, immaculate rooms and bathrooms; quiet. Large 4th-floor suites have full kitchens and LRs with pull-out sofa. Covered parking is a great convenience. Full breakfast is included and is presented in a large sunny room with choices that include cheese omelets, sausage, and other hot and cold breakfast items. Friendly professional staff. Just outstanding!", "title": "AN EXCELLENT HOTEL!", "helpfulness": 2, "user": "paris7eme", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38235846}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I needed a place to stay for the night on my way to Boston and White River Junction is about half way. I booked this hotel through hotwire and paid just under $85. It perfectly served its purpose as an exceptionally clean and comfortable place to stay for a night. I am not sure I'd want to stay here on a vacation but its not a resort and doesn't bill itself as such anyway. The beds were fairly cozy and the bathrooms are well appointed. The place was simple but not in a cheap motel kinda-way. One of my requirements of hotels is free wifi or wired internet which the hotel had and it worked great. There was a mini breakfast in the morning that didn't appear that appetizing. I had a few sips of the concentrated orange juice (or at least it tasted that way) I would definitely stay again.", "title": "I'd stay again..", "helpfulness": 1, "user": "kabecker", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35942212}, {"rating": 4.0, "title": "Comfortable, Clean but with Haphazard Housekeeping", "text": "I am rating it 5 stars, however remember, its in a 3 star category.", "helpfulness": 2, "user": "1NicePerson", "date": "July 19, 2009", "id": 35127868}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I was a little apprehensive about staying at a Holiday Inn Express as this was my first one in the US. Bottom line is this is a very very nice hotel, all the staff we had contact with were friendly and helpful.", "title": "The Best HI Express yet", "helpfulness": 1, "user": "Denmead65", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31897066}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The room was large and comfortable with no sound problems from the nearby freeway.", "title": "Excellent value for overnight stay", "helpfulness": 1, "user": "travelmom95", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31169482}, {"rating": 5.0, "stay_parameters": "Stayed May 2009", "text": "The complementary breakfast was standard HEI and the breakfast room was well decorated with great picture windows. Only slight niggle was that b'fast was cleared away at 0930 on the dot, a few extra minutes for stragglers would have been useful. Underground carpark was really useful in the heavy rain. but drive to the front of the hotel first to get a room key to get into the elevator from the garage.", "title": "Great place for small groups!!", "user": "David S", "date": "May 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30687433}, {"rating": 4.0, "title": "Excellent choice for a getaway stay!", "text": "My husband, 19 year old daughter and I needed a halfway point to stop between destinations. I had visited the hotel on an earlier trip to see what the accommodations were like, because there are three or four hotels located in the same spot. The manager was very pleasant and welcoming when I asked if I could look at a suite. It was spacious and fine for our needs. It was cheaper than booking two adjoining rooms and had a full kitchen. I booked online, using a AAA discount. I was not disappointed when we arrived a few weeks later.The suite was on an upper floor as I requested. It was very large. When we walked into a large room, there was a bathroom on the left, a large closet with mirrored door -- and on the right side there was a fully furnished kitchen area with a counter, dishwasher, dishes, glasses, etc. The floor was tiled in those areas, but straight ahead was a large carpeted sitting room with a club chair, sofa bed, television, desk and chair. The entrance to a separate bedroom with a king sized bed, with a second television was on the left. It was like a beautiful one bedroom apartment -- I believe we paid about $144 for the room plus additional fees (taxes). There was ample outdoor parking as well as an easily accessed parking garage. Breakfast was provided the next morning in a large seating area. There was a big selection of hot and cold items -- including small omelettes -- yogurt, breads and muffins, fresh fruit, cereal, juices, hot beverages. The lobby area was lovely, and there was a small \"library\" off the eating area with a big flat screen tv and paperbacks for guests on the shelves. I have stayed at four diamond resorts in Lake Placid, NY, and Stowe, VT, and would recommend this hotel to my friends and fellow travelers. I thought it was clean, nicely appointed, and the staff was courteous and helpful. It is off the interstate just before Lebanon, NH. If you think you will want to stop for groceries or other items, it is worth going to the next exit (Lebanon) probably 5-10 minutes away --going to the shopping centers, and then heading to the hotel. We got there later on a Friday night, and there was only a McDonald's nearby.", "user": "MiniRita", "date": "April 28, 2009", "id": 28982278}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "My family just arrived back home from a weekend visit to NH & VT to attend a graduation. When we walked thru the front door, Shannon welcomed us with a big smile. She was very helpful with restaurants and area attractions. Jade who is the General Manager also upgraded me because I am a Priority Club member. The suite was very large and worked out great for my family of 2 adults and 2 small children. Although I don't have a reason to return to the area again, if for some reason I had to come back, I would definately stay here again. Thanks Shannon, Jade and sorry, I forgot the young man who was working the morning shift Saturday morning, but he helped as well while we were checking out.", "title": "Eastern Holiday Inn Expresses have poorer breakfasts", "user": "specht3", "date": "April 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 28794768}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "There are a bunch of hotels in WRJ right around the 89/91 junction. But, we were totally happy with our stay at Holiday Inn Express. The best part: Adrian at the front desk. We arrived 4 hours before check-in with our 16month old kids after a 5 hour drive. Adrian found us an available king suite (similar to the one we reserved) that we could get into right away. He was our hero. The fact that he later saw me wheeling in a very full luggage cart and opened the door - impressed us that much more.", "title": "A good place with great staff", "user": "brifos", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78703477}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The king suite was huge! Everything was clean, the towels were nicer than the usual haggard hotel towels. The suite had a microwave, full size fridge, and 2 stove-top burners. Very handy set-up for traveling with small kids. I thought the free breakfast was really good, too (cheese omlettes, grits, biscuits, sausage, plus all the usuals - cereal, yogurt, pastries). Mind you, this isn't a qaint Vermont B&B. So don't expect fine local cuisine. Its a free breakfast at a Holiday Inn Express.", "title": "Best Holiday Inn Express we found", "user": "TheEnglishTourist", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75246156}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "All around, a great place to stay. Mostly because of staff like Adrian.", "title": "Larger than some one bedroom apartments in the area!", "user": "scoutgirl1228", "date": "July 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 70563756}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Nice hotel, friendly staff, couldn't have found a better hotel in this area. They even managed a room with a balcony, although the Vermont rain didn't allow us to use it.", "title": "In general, a decent place", "user": "clm101798", "date": "April 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62700269}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Room was clean and even had a microwave and fridge in it.", "title": "Nice Room, Poor Service", "helpfulness": 1, "user": "jjnapt1", "date": "February 14, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 55949533}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 13, "average": 20, "very good": 57, "terrible": 6, "excellent": 65}, "aka": "Holiday Inn Express Hotel And Suites White River Junction", "slim_ranking": 0.375, "description": "Holiday Inn Express Hotel & Suites White River Junction, VT is just what you need when you re on the move! Conveniently located at the junction of Interstate 91 and Interstate 89, this 100% smoke free hotel is the perfect place to call home while traveling on business trips, family vacations, or for the long term visitor to the Upper Valley. While located in close proximity to local businesses, including Dartmouth College, Dartmouth Hitchcock Medical Center, VA Hospital, Timken Aerospace, Tele Atlas, King Arthur Flour, and Thermal Dynamics, other area attractions include Quechee Gorge, Simon Pearce, Montshire Museum, as well as Killington, Okemo and Sunapee ski mountains. Our finely appointed guest rooms feature microwaves, mini-fridges, kitchenettes, free high-speed wireless Internet, access to our guest laundry facilities, business center, exercise room, underground parking, free Express Start breakfast, and much more. The White River Junction Holiday Inn Express Hotel & Suites' central location allows guests to visit both Vermont and New Hampshire attractions, including ski areas, fall foliage tours, state parks, tax free shopping, and museums. Guests can lounge by the fire in our beautiful great room, or relax and read in our cozy library. We re here, ready with all you need to make your trip to White River Junction a success. We re the Holiday Inn Express."}