{"user_rating": 3.5, "review_count": 118, "name": "Holiday Inn Express Stony Brook", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I was stunned to read some of the negative prior reviews of this place. The Holiday Inn Express appears to be an older hotel that was converted into a Holiday Inn Express. The property is located on spacious grounds on the Nesconset Highway in Stonybrook, NY. The grounds are very nice and include a volley ball card and several areas to sit in. There are several restaurants within driving distance but nothing that can be reached by foot. The hotel is somewhat tricky to find and turning around on the Nesconset can be a bit of a challenge.", "title": "Super Hotel With Very Friendly Staff", "helpfulness": 1, "user": "DCSacramento", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116133946}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Upon arriving at the front desk both of the staff went out of their way to welcome me. Being a Priority Club Platinum member they offered me a free gift including five dollars off on anything I wished at their in-house store. The lobby is decorated very nicely and has the feel of a larger hotel such as a Crowne Plaza or a Renaissance. I was a given a very spacious room down the hall on the fifth floor. The room included a gigantic jacuzzi which I did not avail myself of. The bed was very comfortable and the room was very quiet. There was a small frig and microwave also in the room.", "title": "We stay in this hotel every summer and will continue to be back!", "user": "bdebnath", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116059598}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "There is a nice pool and gym in the basement of the hotel. The pool is very well kept up and the water was perfect. The gym desperately needs a fan and some of the equipment is out of date.", "title": "2nd time, loved it, will be back!", "user": "PJAM7", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116016990}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The breakfast the next morning was the best that I have ever had in a Holiday Inn Express. Several warm items including great sausage and bacon. The kitchen staff were also very friendly and welcoming.", "title": "Beautiful Hotel and rooms.", "user": "BarbMainer", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115994605}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "There is a small business conference center with two computers to use. When I was having difficulty of printing a boarding pass Jackie, one of the back office staff, gave me her office, to use the computer. Very nice of her. The general manager named Dee Ann is also a delight and I think her friendliness sets the stage for all of the other warm and friendly folk she has hired.", "title": "Large Rooms - very nice", "user": "familyfromthemidwest", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114946203}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The hotel is very clean and very nice. The hotel gym was great and the pool was very warm. The outside patio was really nice and it has tennis courts and horseshoes and volleyball and a playground for the kids. The room was nice with good water pressure.", "title": "Nice hotel. People could have been a bit nicer, but hey it is Long Island", "user": "dascott55", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 2.0}, "id": 113309005}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Now the bad, the shower had a slow drain so water pooled in it. The staff wasn't very friendly. I went down to the breakfast just before it closed and the lady working there huffed and puffed and shut the lights off in the breakfast room. The people at the desk acted annoyed when I came down to buy a salad from the snack place. The WORST thing is that I had to ask for a remote for the TV, and I am not exxagerating, 4 times! I stopped by the desk, I called the desk, finally after 4 times asking they brought a remote up.", "title": "GREAT STAFF, CONVENIENT TO STONY BROOK U.", "user": "AtlantaTalkinghead", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 108459541}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I might look for another hotel nearby that is as nice and maybe friendlier staff.", "title": "nice - close to shopping and restaurants", "user": "cab1002", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102109600}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "I stayed at this property over a weekend while conducting business at Stony Brook University. I found the rooms to be very averae, but clean. The staff was very helpful. They went out of their way to offer assistance in printing documents when I failed to do so myself inside the hotel's business center. The complimentary breakfast was typical of a Holiday Inn Express and certainly did th trick on an early Saturday morning.", "title": "A pleasant surprise", "user": "TigerBait", "date": "March 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 101551786}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The property is a 5-10 minute ride from the Stony Brook campus. It's also within walking distance to several restaurants and a strip mall. The lobby features a pantry where you can purchase sundries, snacks and drinks. Wireless internet is free, although you are required to continually re login if you've been idle for more than a few minutes. That's a pain after a while.", "title": "AMAZING. WILL RECOMMEND TO EVERYONE I KNOW!", "user": "MOPHEADTFC", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99799596}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I am not sure why this hotel has such low reviews but my fiance and I had such a nice time there a few weeks ago that we decided to spend this past weekend there as well.", "title": "Quiet, Clean, Friendly Staff, Great Location", "user": "LoveToTravel513", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82478510}, {"rating": 3.0, "title": "cold", "text": "It has a great location, right near a strip of major stores, and about a 5 minute drive from Smithaven Mall and Stony Brook University. They even offer a student discount which was a pleasant surprise for us. The young lady at the front desk looked rather tired when we checked in at midnight but she was still as pleasant as ever, she even offered us a complimentary late check out! The room itself the first time we stayed there was spacious and clean, the bed was extremely comfortable, with two pillow options depending on your preference. It took a tiny bit of effort to figure out how to adjust the temperature in the room but once we did it was cool and comfortable. The shower had good water pressure and was very clean, plenty of towels to go around. The customer service over all was fantastic. Everyone was really friendly and went out of their way when we asked for something (to refill a breakfast tray, more towels, a sewing kit, etc..)", "user": "SullafaK", "date": "January 16, 2010", "id": 53641263}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Breakfast was pretty generic but still satisfying. For the health conscious they do offer yogurt, hard boiled eggs and fresh bananas. Our only complaint was that there were no trays to bring our food back up to our room. Although we did it anyway :)", "title": "Not what it used to be", "user": "Ryan08", "date": "November 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 48833878}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Our only real complaints come from our second night's stay. The main door and bathroom door both kept jamming and popping open, and the lock didn't work on the bathroom door.", "title": "Not good enough", "user": "basiaczek", "date": "July 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 35044816}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "Overall however I would highly recommend staying at this hotel, and if you are a SB student speak up and take advantage of the fantastic discount they offer!", "title": "Nice stay...until", "user": "debt1206", "date": "July 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 34834013}, {"rating": 1.0, "stay_parameters": "Stayed January 2011", "text": "Vacuum was not used in my room. There was a clean towel that was placed on the back of the toilet. The matress is incredibly old and nothing but springs. The linens are stained yellow. The shuttle service wasn't running to the airport due to bad weather but the roads weren't bad and a taxi was able to make it. They have a nice flat screen tv, but really should use their money on cleaning and new beds. Room was cold regardless of what the thermostat was set on. 30 minutes away from airport. Do not stay here!!!", "title": "Terrible and dirty", "user": "WorldTravelerSMH", "date": "January 26, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 94512987}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Was attending Footlocker Northeast Regional Cross-Country meet. Had booked another motel however, after reading ratings opted to try Holiday Inn Express in Stony Brook. Was very pleased with quality of service, room condition, and the well lit parking area. The breakfast buffet was well stocked and there was always coffee (a number one priority in my book!) I did take a minute to thank the maintenance supervisor for a job well done before we left. I didn't catch his name but hope to see him again next year. He does a great job!", "title": "Will stay here again next year.", "user": "mikefrommaine", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93340459}, {"rating": 4.0, "stay_parameters": "Stayed January 2010", "text": "Sometimes my review might be lower but overall, I think the price is competitive and the location to SB hospital can't be beat. I will be there next weekend again. I don't eat that fatty breakfast stuff, but I do appreciate the all night coffee and bagels with fresh fruit in the morning. I have definitely enjoyed the business center and the pool on my stays. See you guys next weekend!", "title": "I have stayed here numerous times.", "user": "nocomplaintsfromme", "date": "December 3, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 88904005}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The hotel is in a fantastic location. Close to where I was working, plenty of restaurants, and shopping.", "title": "Best location, wish it was a different hotel", "user": "albanyjosh", "date": "November 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88442835}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I was thoroughly disappointed with the hotel though. It was very dingy, the carpets looked old, and the rooms just seemed dirty. While some of the staff was very nice, several of the employees at the front desk were rude to me and my colleagues.", "title": "strange smell in hallway and a little worn out", "user": "wanderlust1966", "date": "November 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 87225261}], "location": {"country": "United States", "city": "Stony Brook"}, "stars": 2.5, "variance": {"poor": 12, "average": 19, "very good": 39, "terrible": 10, "excellent": 38}, "aka": "Holiday Inn Express Stony Brook Hotel", "slim_ranking": 0.666666666667, "description": "The award winning Holiday Inn Express Stony Brook-Long Island offers 143 newly renovated guest rooms: standard kings, queens, two room suites, spa rooms, and handicap accessible rooms. The Holiday Inn Express Stony Brook - Long Island hotel is a designated non-smoking property. All rooms feature: flat screen plasma cable TVs w/HBO, CNN, ESPN, free local calls, high-speed wireless Internet access, iPod docking stations and pay-per-view movies. Additional in-room amenities are: microwave/refrigerator unit, hair dryer, iron & ironing board, & a coffee maker in every room. Our hotel meeting rooms can accommodate 100 people theater style, up to 80 banquet style and we offer use of our audio/visual equipment. All guests enjoy complimentary hot Continental buffet breakfast, 20X40 indoor heated pool and use of our fully equipped fitness center. Roll away beds are available at no additional charge. Children stay free and the hotel has a playground, and there are plenty of local attractions geared toward children. Our amenities include a putting green, horseshoe courts, and athletic fields with basketball, tennis, softball and picnic area."}