{"user_rating": 4.0, "review_count": 486, "name": "Holiday Inn Express Folkestone Channel Tunnel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Stayed on business, booked a room with Internet access.", "title": "Poor reception service", "user": "ratgirl25", "date": "December 18, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 147653675}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "On arrival I found the room very cold and it took a few hours before it warmed up.", "title": "one night stay", "user": "bea b", "date": "December 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 5.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 147295923}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The quilt too small for bed and very thin.", "title": "Change of staff not a great move HI", "user": "Pandymonium", "date": "December 11, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 147261047}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "On trying to connect to the WIFI I found no networks. I reported to reception and was advised I need to connect using a cable. I informed the receptionist that I did not have one with me, to which I was informed that I would have to get a refund when I booked out.", "title": "Good place to stay for tunnel", "user": "oldtimerstoke", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147260914}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "On booking out a different receptionist advised that the hotel had cables for use. I advised that I had not been given this information. Now all this was fine until I noticed another receptionist pulling her face and rolling her eyes at me. I was extremely annoyed as I left the hotel. On reflection I should of requested to speak to the Hotel Manager about the un-professional receptionist, but I was short on time.", "title": "Excellent stopover", "user": "David H", "date": "December 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147148176}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "As expected it was pretty basic. The restaurant feels a staff canteen with food to match. Dinner was acceptable but not at all interesting. Breakfast was dire and the TV was on with no-one watching. However the room was clean and a good size although the bed was only a 4ft6. The best aspect was the staff who were very helpful and friendly.", "title": "Convenient for the tunnel....", "user": "Anne001_12", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 148353455}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed for a couple of nights, and whilst the accommodation was exactly as described the beds and pillows were far from comfortable and the duvet had been crammed into a cover which meant the duvet didn't cover the bed properly. Otherwise the staff were helpful and the inclusive breakfast was a welcome bonus.", "title": "Utilitarian", "user": "jgsurrey", "date": "December 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 148207914}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The proximity to the tunnel is amazing. You drive along the back roads, down a slip road and into the check out lanes within 5 minutes of leaving the hotel. The Hotel is up to the normal Express standard in its decor and setting but what is extraordinary is that it has no European influence anywhere, amazing when its only 40 minutes away from France. The breakfast can be taken from 6.00 am without any extra charge perfect for early getaways. However stay away from the Great-fruit which strips any sensitivity protection away from the teeth. It is also worth checking booking direct with the Hotel rather than HIE central bookings as they often have special deals like a free bottle of wine when eating in the restaurant.", "title": "Pop through the Tunnel", "user": "Raindrop_11", "date": "December 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148077745}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "we stayed here for a short stay in folkestone. The room was spacious even though my son had the pull out sofa bed.The staff were extremely helpful with all our queries and problems. The location is excellent for access to the tunnel and is also not too far away from the ferry port. Shops just a round the corner and a superb gastropub a stones throw away.", "title": "excellent service", "user": "Tania M", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147968342}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Staff friends in the bar area getting obnoxiously drunk.language awful form rowdy friends and staff, staff outside smoking every 5 minutes,", "title": "Staff", "user": "cliveellis", "date": "December 18, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 147663745}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Booked for one night before a tunnel crossing.", "title": "Very nice room in great hotel - Poor breakfast", "user": "winkertonk21", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147008157}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Nice secure car park, friendly helpful staff and a quick hassle free check in.", "title": "location, location ....", "user": "skifanDublin", "date": "November 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146509406}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Great location!! Less than a 5 minute drive to tunnel check in.", "title": "Great stopover for trips to France", "helpfulness": 1, "user": "shugspice", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146388502}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Good sized spacious clean room with decent decor, comfy double bed and sofa bed.", "title": "Calais shopping day trip", "helpfulness": 1, "user": "Joanne E", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145789671}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Cracking power shower, decent shower gel too!", "title": "Rude check-in staff, dangerous car park barrier, rest mediocre.", "helpfulness": 1, "user": "Nossi", "date": "November 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145659712}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This was very good value and convenient, we paid fifty five pounds for the night and given that the suite novotel in coquelles on the other side of the Chunnel is three times this, it felt like a good deal. Yes the restaurant is not pretty, and the food for dinner was very ordinary and not great value (with kids if we did this again we'd eat before arrival) and the rooms are small and not elegant, but they are clean and comfy and we all slept fine. I agree with other reviewers the staff are great, on coming down to breakfast a bit later than we had hoped I said too loudly and anxiously to my husband 'we're gong to miss it!' meaning our crossing, and the guy on the desk immediately chipped in 'its only three minutes drive, what time is your crossing, you will be fine' and he was right. I would choose to stop here rather than coquelles in future on price alone.", "title": "Excellent stopover", "helpfulness": 1, "user": "twoplusonetravel", "date": "January 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149014798}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "With an early morning train to France we wanted a hotel close to EuroTunnel. As long term fans of Holiday Inn Express (reasonable price, comfortable rooms, decent breakfast) this was the obvious choice. Our expectations were exceded!! Friendly efficient staff, well presented room, even a restaurant for evening meals (a rarity in HI Express). By comparison, a few days earlier I had stayed at a Travel Lodge (in Oxford) and paid exactly the same price for an experience that can only be described as dire! Well done Holiday Inn.", "title": "Ideal for a stop-over to/from the Tunnel", "user": "Derek R", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148986230}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family and I sayed there for 1 night after christmas and it was a great stay. It was really cheap and it was worth all the money. The room was not hudge, but big enough for the three of us. And we also had coffee and tea in the room. The included breakfast was so delicios and the staff were very very friendly. We do not go to hotels often but we will deffinetly use that one again because it is also so close to the channel tunnel. I warmly reccomend it.", "title": "Excellent for 1 night stay", "user": "Adriana M", "date": "January 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148969915}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at the Holiday Inn Express for one night before taking the Eurotunnel train across to France early the next morning. We were a bit reluctant to stay here, based on some negative reviews by trip advisor members, but for us, the hotel's proximity to the Eurotunnel trumped all these. We figured we'd survive for one night, even if it was as awful as some people suggest! However, after having stayed here, we cannot understand the complaints. In fact, we were very pleasantly surprised. Reception staff were friendly and very helpful. Our room was spacious, clean and most satisfactory in every way. The beds were comfortable and with two pillows each - even a choice of soft and firm! The bathroom was modern, spotlessly clean and the shower had great water pressure with plenty of hot water. The room was cool when we entered, (which we prefer to the usual over-heated environment in many hotels) but this was easily changed by simply turning off the air conditioning unit. Breakfast was the usual selection of cereals, hot food etc - no better or worse than many other similar hotels. It was a bit canteen-ish, but for a quick bite to eat before an early start it was absolutely fine. Also, we had booked well in advance (via a well-known website) and obtained a very good price - about 50% off the normal tariff. If you want a clean, comfortable and spacious room with good bathroom facilities (as it was in room 118) and a perfectly good, early breakfast with the usual choices, this hotel is great. If you want 5 star accommodation, concierge service and a fine-dining experience at 6.00 am, all for budget hotel prices, get real! We will very happily stay here again on our next trip across the channel! Thank you, Holiday Inn Express for a very good overnight stay.", "title": "Absolutely ok for a short stopover - and pleasantly surprised!", "helpfulness": 1, "user": "baroque-boys", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148869271}, {"rating": 2.0, "title": "Stay elsewhere", "text": "Rooms like prison cells, cold, beds small and uncomfortable, tiny bathroom and lightbulbs not working. Restaurant is a misnomer, if it were a works canteen the staff would all come out on strike. On the positive side it is very convenient for the Channel Tunnel and it is cheap. Must be doing something right as it was full of famillies with lots of noisy children. Try the Premier Inn, can't be worse.", "user": "COUNCILLORJACK", "date": "January 1, 2013", "id": 148512840}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 2.5, "variance": {"poor": 32, "average": 91, "very good": 219, "terrible": 17, "excellent": 127}, "aka": "Holiday Inn Express Folkestone Channel Tunnel Hotel", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Hotel is situated in a prominent position alongside the M20 motorway and the hotel has ease of access to all main national and international transport links. The hotel is adjacent to the Eurotunnel Channel Tunnel terminal which provides regular services to continental Europe. Junction 12 is within a few minutes drive facilitating connection to the national motorway network, the major airports and greater London. Paris and Brussels only 35 minutes."}