{"user_rating": 3.5, "review_count": 121, "name": "Holiday Inn Huntsville Downtown", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2004", "text": "Not the best Hilton I've been to. The hotel is on the verge of 'run-down'. The hotel staff was friendly and helpful. Rooms were a different story, very outdated with old furnature and matresses. I stayed on the executive floor, which needs lots of work too. Next time I'm in huntsville, I'll probably find a different place to stay.", "title": "Just OK", "helpfulness": 1, "user": "chris1005", "date": "April 21, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 3395344}, {"rating": 1.0, "title": "The rooms and staff", "text": "The Rooms are aging and the azalea room smells awful. The Housekeepers are great though. If you need something i would call them first. We stayed in 2004 and we were VIP. we were supposed to have chocolates and water in our room. When we showed up we had no candy and no water our room had urine in the toliet and toliet paper.I called the front desk and they acted stubborn so i called housekeeping and the supervisor i think it was Betty Pickett she said they would have it fixed by the time we returned although when we returned it wasn't fixed. They moved our room and the other housekeepers were very helpful. So i wouldn't stay there again. If you do it's your money to waste. we paid 130.00 for one night. that's to much to pay for the poor service we recieved.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 30, 2005", "id": 3312731}, {"rating": 3.0, "title": "All right", "text": "Nothing special room-wise. The restaurant was outstanding. But the facility is aging quickly.", "helpfulness": 1, "user": "Layover", "date": "December 23, 2004", "id": 2920131}, {"rating": 1.0, "title": "Not too good", "text": "I stayed in this hotel last year during the Huntsville hamfest. The rooms were dirty (stuff on the floor), the concrete in the pool was chipped up and no lighting, the carpet in the halls were patched up in different colors and stained. I had read where this hotel underwent a $$$ renovation. They must have spent the money on the lobby, bar and restaurant and forgot the rooms. For the money, go elsewhere.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 14, 2004", "id": 2823985}, {"rating": 3.0, "title": "Average hotel-needs remodeling-excellent staff", "text": "We stay here every year for the Big Spring Jam, but only because it is immediately adjacent to the event. The hotel is dated and worn, needs remodeling, but the staff is excellent. When we were there the spa was not working, which was a disappointment. Even with every room holding 4 or more people, housekeeping was really on the ball. The front desk folks were also helpful, despite being frantic with the overload and constant 24-hour party atmostphere. I'll be there again this September!", "user": "A TripAdvisor user", "date": "August 30, 2004", "id": 2502207}, {"rating": 4.0, "stay_parameters": "Stayed June 2004, traveled on business", "text": "My goodness, two miserable reviews! We spent two nights in Huntsville because of a business meeting. I spent a great deal of time in the hotel (it was my husband's meeting, and I was left carless).", "title": "Not that bad!", "helpfulness": 3, "user": "Amy413", "date": "August 5, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2422814}, {"rating": 2.0, "title": "needs a revamp", "text": "The staff was friendly. The guy at the Starbucks in the lobby, the gentleman who was tending bar, and half of the front desk persons were just fine. A couple of the front desk clerks acted like I was insane when I asked them for walking directions to \"something to do,\" but I realized afterward that this was because there's nothing to do in Huntsville! I ended up spending the day at the average Art Museum across the street, then walking down one of the old streets in town to check out the cool old historic houses (this would've been more enjoyable if it hadn't been 9,000 degrees with 200% humidity! I exaggerate, but it certainly felt that way!). Be sure to take a car to Huntsville. I found the public/hotel transportation to be lacking (the hotel courtesy van only goes to the airport and back, they won't take you to attractions, malls, etc. in town as other hotels will).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 30, 2004", "id": 1850005}, {"rating": 1.0, "title": "It is Hilton but don't expect more than two STARS!", "text": "Overall, I would stay at the Huntsville Hilton again, if I had to go to Huntsville, but I'd rather avoid Huntsville in the future if I have a choice!!", "helpfulness": 14, "user": "A TripAdvisor user", "date": "May 22, 2003", "id": 1025776}], "location": {"country": "United States", "city": "Huntsville"}, "stars": 3, "variance": {"poor": 17, "average": 24, "very good": 39, "terrible": 10, "excellent": 31}, "aka": "Holiday Inn Huntsville Downtown Hotel Huntsville", "slim_ranking": 0.480769230769, "description": "Holiday Inn Huntsville Downtown is a full service hotel noted for outstanding value conveniently located across the street from the Von Braun Civic Center and Big Springs Park, just blocks from Huntsville's Historic District and within minutes from all business and leisure destinations. Huntsville's unique charm and atmosphere is best experienced downtown and the heart of Huntsville hospitality resides at the Holiday Inn Downtown Huntsville."}