{"user_rating": 4.5, "review_count": 138, "name": "Holiday Inn Express Hotel & Suites", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We went to this hotel because of its proximity to the mall Great Lakes Crossing. The hotel was fully booked and we had people in a neighboring room that were literally up all night. I could hear when they were watching TV, when they were talking, and when they were engaging in other activities I won`t mention. It was one of the worst sleeps I have ever had. I kept thinking that they would call it a night and go to sleep. They kept going until after 5am. The walls in this hotel are paper thin. Everything else about the hotel was great. It`s too bad they didn`t put more money into building the walls.", "title": "Noisy -heard neighbours all night", "user": "TorontoTravelfan", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 77651761}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Had a great 2 night stay at the Holiday Inn Express Auburn Hills. Now this is a hotel that is hard to rate. That is because although it is definitely a 3* hotel (no bar, limited lobby, limited extra service), it performs that role so brilliantly one wants to rate it higher.", "title": "A Hotel at the Mall. What Else could a Teenager ask for?", "user": "The_Lewis", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 76493658}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Check-in was a breeze with friendly staff who quickly accomodated a request for a room change. The rooms were comfortable (although with an odd odour - possibly from the rug cleaning products). FREE INTERNET (take that Four Seasons). Free coffee and tea around the clock and often even cookies were available. Even had a 3 computer business centre where I was able to print for free.", "title": "over and above what I expected", "user": "37209Hoosier", "date": "August 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76170874}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Highly recommend this hotel for die-hard shoppers (including my teenagers)", "title": "Great service - better than the Crowne Plaza !", "user": "Mitch1ok", "date": "August 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 73384880}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "We stayed at the Holiday Inn Express, Auburn Hills, in June. We had the best sleep ever in any hotel. I talked to the front desk person and asked where the hotel purchased pillows, she gave me the name of the Corporate sales manager, Tammy Lynn. She asked her General manager if I could buy 2 pillows. Randy said no, I will send them free of charge to him. I have never had any hotel offer 2 free pillows and free delivery. I will always stay at this hotel when I travel in the area. Thanks again.", "title": "Racial Profiling", "user": "raider419", "date": "July 20, 2010", "detail_rating": {"service": 1.0}, "id": 71645937}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My fiancee and I always stay at Holiday Inn Express because I am a Priority Rewards member. This is by far the nicest one we've ever stayed at. The staff were very helpful. The pool and spa area was very clean. The room was exceptional. The bathroom was absolutely gorgeous with granite countertop and bidet. Let's face it - you can get a cheaper hotel room but you do get what you pay for. The room was a little bit over budget but worth every penny.", "title": "Sometimes you do get what you pay for ...", "user": "Flo96", "date": "July 8, 2010", "detail_rating": {"cleanliness": 5.0, "service": 5.0}, "id": 70169521}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I have stayed at many Holiday Express hotels all over the country and I think they all are great. My wife and I attended a concert at the DTE Energy Theatre last night and to play it safe we stayed at the Holiday Inn Express Hotel and suites in Auburn Hills. Took the shuttle to and from the show. The staff at the Auburn Hills location was five star especially Amy at the front desk, that women could easily exceed some of the best at the Ritz Carleton. The staff was friendly the property was spotless and it was just an overall great experience.", "title": "Outstanding", "user": "panleft", "date": "July 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69667187}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "From Amy and her front desk staff to the cleanliness of the entire location, this is the place to stay in the Auburn Hills area. The hotel is spotlessly clean. For someone with allergies and asthma, there is no better place to stay. Yes, this is a Holiday Inn Express so there is no bar and the breakfast offering is exactly what you would expect from an Express hotel. If you want a drink, walk across the parking lot to any number of local establishments. How this location performs is the beauty of staying here. It changed my mind as to how high an Express hotel could perform. OK, I would like the pool water a bit warmer, but others would say it is perfect. Are there kids in the pool area, of course, it is a great place for families to stay. The rooms are dead quite, the beds are wonderful, and the staff is extremely friendly and eager to serve. If there was one thing I would like to see changed is that the room AC fan could be left in the “on” mode all night. Again a personal preference, I like a bit of background noise all night and don’t like to hear the AC cycling. For sure this will not stop me from using this great hotel anytime I am in the area.", "title": "Top Rated Hotel", "user": "gadgetguy5000", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68451436}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "staff was exremely kind,helpful& friendly,Tammy Lynn Salgot was a super help and great host!", "title": "very pleasurable experience", "user": "bawber", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66313900}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Excellent location if shopping in the Great Lakes Crossing Mall. We stayed there because it was near friends who reside in Orion. The service, rooms and breakfast were excellent. There was only one thing. I traveled with my parents who are seniors, it would be advisable to put grab bars in the toilettes. Also the washroom sink is too far - one has to reach over in a very uncomfortable position to brush one's teeth etc. If one is TALL it's ok. The toilette cleansing seats are awesome! The breakfast lady was always busy and polite. The front desk ever willing to help -Robert was the front desk clerk.", "title": "Excellent Service", "user": "karen007toronto", "date": "May 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65244803}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed here as we had a concert to go to in Clarkston, which is near by. This was on the Weekend. the price was great, The room was so clean and neat. No need of worrying about sleeping ontop of these covers. Very upscale room. Everything you could need or want. and then theres the continental breakfast? No continental breakfast here , this was a full scale breakfast bar. Every thing fresh and tasty. Upkept with fresh breakfast items, biscuits gravy. Not your normal continental breakfast type. Would surely reccomend to anyone, just to even get away.", "title": "Great Place to Stay!!!", "user": "maggie06314", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 70737236}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "i was so impressed with this hotel, their continental breakfest has such a variety, everything was wonderful. the room was clean, and everything was top notch, would stay there again in a minute. the front desk staff was so friendly and helpful.", "title": "awesome stay", "user": "moparbabe2002", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46452458}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "I travel quite a bit for both business and pleasure and have come to trust the Holiday Inn name for value and comfort but I was very happily surprised by this hotel. The rooms are very large with fridge and microwave. Everything was clean and comfortable. The staff was friendly and extremely polite and helpful. This was by far the best hotel in it's class that I ever stayed at and actually exceeded many hotels of a higher price range. One unique thing you will find here is the bidet toilet in the bathroom with heated seat. A nice touch on those chilly Michigan mornings.", "title": "Amazing value for your hotel dollar", "user": "jerseyguy405", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46399009}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We stayed at this local hotel this past week-end, to celebrate my daughter's birthday (we rented a suite, and she had 3 friends). I was actually surprised at how nice this hotel is, since it is just a local hotel by the mall, and seems small from the outside. But is is beautiful, clean and has great amenities (near the mall, great pool, beautifully decorated and clean). AND...the staff is wonderful (very helpful, attentive and nice). We all had such a great time, and we will definitely be back. Normally, we never stay at a hotel close to home, but this was well worth it, and we are looking forward to another stay!", "title": "Great Stay", "user": "nolies28", "date": "October 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45896272}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "This is probably the best hotel we have ever stayed at! It was such a surprise and a great value for our money! We got the standard room, which was 2 queen beds, a microwave, refridgerator, doorbell (for housekeeping), bidet toilet (how cool!!), and electronic switch to notify the housekeeping if your room was ready to be cleaned or to not disburb (a light came up in the hallway outside our room!). Definitely recommend this place!!", "title": "AWESOME!!", "user": "abbymgi", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43168582}, {"rating": 5.0, "title": "Our new \"home base\" for DTE events!", "text": "My husband and I attended 3 events at the DTE Energy Music Theater this summer, and we stayed near there each time because we live over 2 hours away. I *wish* I'd followed my usual routine of checking TripAdvisor sooner! The place we stayed for the first 2 was OK, but this Holiday Inn Express was outstanding. First of all, it was less than 10 minutes from DTE. The hotel is attractive, clean, nicely designed, and the room was large and well-appointed. Our room included a small sink, microwave and refrigerator. Checking in and out was a breeze. The breakfast was good, all items were kept replenished and the area was *never* allowed to get messy, which is not appetizing first thing in the morning.", "user": "A TripAdvisor user", "date": "August 24, 2009", "id": 38622968}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I usually stay near Chrysler when i come in, but my secretary put me at this hotel for the trip. I enjoyed everything about the hotel except for the front desk clerk Amy. Not sure what her deal was that day, but she probably should have stayed home from work. Note to AMY. It is not professional to get frustrated and blame everyone else in front of a customer. I wish i could of had the experience all the reviewers have had, but i guess i picked the wrong day to check in.", "title": "Great Hotel but Rude front desk Employee", "user": "EMC-ENG", "date": "May 19, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64736561}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "Hopefully she finishes her training with supervision after management reads this review.", "title": "Fantastic Stay; A true pleasure....will stay again!!!!", "user": "happyguest30", "date": "May 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 64327297}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "BTW your breakfast is above average for a 2.5 star hotel!! Good job", "title": "They went above and beyond to make our stay enjoyable!!!", "user": "LondonRafter", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56885843}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Clean rooms, pleasant amenities and easy access were just the start. The staff is the true shining pearl in this oyster. Everyone with whom we interacted was not only professional and courteous but genuinely kind and personable, without being fawning or fake. The little details seemed always properly handled, and handled with a smile to boot. We highly recommend this hotel for short, or longer term stays, and feel that the ownership and management should be truly proud of the people that they have chosen to represent them.", "title": "Not your parent's Holiday Inn!", "user": "Ajetlgd1", "date": "February 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54966590}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "First of all, this hotel is as close as you can get to the HUGE Great lakes Crossing indoor Outlet mall. The staff at both the hotel and the mall seemed to love Canadians and treated us with extreme hospitality, (unlike where we usually go, (Birch Run,Mi) The young woman at the front desk asked us if we wanted to join the Prioroty Club, Free, and a result, we were upgraded to a Queen Suite room. She offered many suggestions which helped to make our stay more enjoyable. Also, the woman working the breakfast hours, (free with our room, and had a lot of choices) was also very friendly. I believe my friends and I will switch from Birch run trips to return to Auburn Hills, all because of the warm welcoming reception at the Holiday Inn &Suites, Thanks", "title": "the most perfect hotel stay one could desire", "user": "knight12", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47034256}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Its what you would expect at HIE. The bonus here is that it seems to be all suites. There is enough room in the suite for entertaining three couples.", "title": "Good location for golf and shopping", "user": "simpme", "date": "September 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 80652554}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Good location for shopping and for golf.", "title": "Fantastic stay once again!", "user": "terayon888", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79645192}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "What a great experience! First time we stayed, we just came in off the street looking for a room. Not only were we offered a great room, but we were also offered a priority club membership (free of charge) that gave us a free upgrade. What a great room, great service and perfect location to the mall (which we came for). We were looking to come shoppin again, and once again, we were offered great service and a great stay. Thanks so much to Tammy for finding us a room at the last minute and making the process so enjoyable. I believe that the staff make the experience and with wonderful staff like Tammy, I will come back again and again (and you can bet friends and family will too)", "title": "Great Experience at the Holiday Inn!!", "user": "Alexa19jm", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 79428045}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "A friend of mine and I went to Auburn Hills to go shopping at Great Lakes Crossing in September 2010. We were surprised how nice the hotel was and how close it was to Great Lakes Crossing.", "title": "Fabulous Hotel and Awesome Location", "user": "jasmin8p", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78061757}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The hotel had one of the nicest business centres I've ever seen at a hotel. The free breakfast included hot and cold selections and there were loads seating and lots of natural sunlight in the breakfast room. The front desk staff were exceptional! They also sold juices, water, and iceream sandwiches (among other things) at the front desk.", "title": "Perfectly located for Great Lakes Crossing shopping and Palace events", "helpfulness": 2, "user": "roadtrippervoyageur", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77719291}], "location": {"country": "United States", "city": "Auburn Hills"}, "stars": 2.5, "variance": {"poor": 1, "average": 14, "very good": 26, "terrible": 2, "excellent": 95}, "aka": "Holiday Inn Express Hotel Auburn Hills", "slim_ranking": 0.1875, "description": "Enjoy Variety and Convenience at Our Auburn Hills Hotel The Holiday Inn Express and Suites of Auburn Hills, is 10 miles from Oakland County Int'l Airport (PTK), and offers a free shuttle anywhere within five miles of the hotel, except DTE or The Palace. This suburban Auburn Hills hotel near Metro Detroit, offers activities from shopping at the neighboring Great Lakes Crossing Mall to watching a Detroit Pistons game at The Palace. You'll find something new to do every season, such as splashing away the summer heat at Waterford Oaks Water Park, just three miles away. During the winter you can go skiing at Pine Knob just five miles from our Auburn Hills lodging. Our hotel near Metro Detroit is conveniently located for business travelers, with the corporate headquarters of companies such as Guardian, GM, Continental and Chrysler within five miles of the hotel. Crittenton Hospital is only seven miles from our Auburn Hills hotel. If corporate guests need to host a meeting, we offer two rooms that they can utilize, as well as a 24-hour business center. Our Auburn Hills accommodations offer wonderful amenities such as free high-speed, wired and wireless Internet access, and a complimentary hot breakfast bar. Take time out to relax in our heated, indoor pool and whirlpool or enjoy a workout in the 24-hour fitness center. Our Holiday Inn Express Hotel in Auburn Hills is delighted to meet all of your hospitality needs."}