{"user_rating": 4.5, "review_count": 387, "name": "Holiday Inn Norwich City", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We spent two nights here as a base for visiting relatives in a family room last week. Our 5 year old son absolutely loved the view from the room because we could pretty much see the whole of Norwich City football pitch. Unfortunately, we were not staying on the Saturday when they were playing but if we had've been we would've had a great view.", "title": "Room with a view", "user": "jenniferand2003", "date": "August 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 173472634}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The room had everything you needed and was clean but beds were very uncomfortable and small. It's the first family room that we've stayed in for a while that's not had at least least 1 Kingsize bed. We would stay again just because it's convenient for the city and for family but would probably need to book an executive room, for hopefully, more space and comfort!!", "title": "Comfortable", "user": "Hawtrey", "date": "August 18, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 172869124}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Staff on reception were lovely and very friendly. Bar area was nice.", "title": "Great location and lovely hotel", "user": "Andy W", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 172790515}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Good location close to the station, restaurants and cinema. Good size room with two comfortable double beds. Shower good but would benefit from increased water pressure. Overlooked road but quiet when (really dirty) window closed. Room very clean. Parking was £4.95 per night and breakfast £9.95 each with vouchers bought from reception. Good buffet breakfast and nice service throughout hotel. Irritating that there is no wi-fi in the rooms. Would use again.", "title": "Good Location", "user": "NickAFarnham", "date": "August 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 172488116}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Went to Norwich for the weekend not really having an idea of what to expect. The hotel was lovely with good rooms and very pleasant staff. The location is ideal for a 15 minute walk in to histroic old Norwich with its vast array of shops and history to look at. The breakfast was good and hearty and we had the added bonus of having a view of the pitch which we made full use of to watch the home game. I would certainly recommend this and would consider a return visit to the city and this hotel!", "title": "Stayed a few times now. Good standard Hotel", "user": "JohnD1979", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171447587}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I stayed here for 2 nights for a weekend break with my wife. Good central location meant we could easily walk into town. We didn't fancy the breakfast preffering to go into town where the people watching was a bit better.", "title": "Good central hotel", "helpfulness": 1, "user": "stehen0", "date": "September 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 176479167}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The health club facilities are sparse. The bar is nice and the beer was good. I would stay here again.", "title": "More than suitable for a weekend with a friend", "user": "Federicaontrip", "date": "September 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 175658901}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "I spent one night last weekend (late August 2013) in this hotel; I had a twin room (518) which I share with a friend. The beds were small doubles and more than roomy for one person; they were also very comfortable and came with a selection of pillow types (firm, soft, etc.). The room was clean and relatively spacious; the only downside was the view (front of the hotel) but I wasn't there for that so I didn't really care. Wifi was only available in the lobby area. The bathroom was absolutely fine although the only things you got given in addition to towels was wall-mounted Dove soap and a bar of solid soap. No proper shampoo or other bits. Not a deal breaker but I thought I'd point it out. We also had tea (Twinings Everyday) and coffee-making facilities; best of all the hotel is opposite a shopping area that includes a Morrisons so we popped there to grab some nibbles. The town centre is only a ten-fifteen drive away, about £5 by taxi. I would not worry about the proximity to the football stadium as we were there during a match and could not hear a thing once inside the hotel. So all in all a great hotel, although a little on the pricey side for what it is (around £150/night for our room).", "title": "Much Much Better than expected", "user": "M L", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175388659}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "We went as a family and had four rooms in the hotel. Our ages range from 4 to 76 years. We had booked well in advanced so got quite a good deal. It was value for money. The staff are polite, professional and very helpful. The rooms are clean and you can request a room with a walk-in shower. Breakfast was not included in the price, so we paid for it separately. It was buffet style and there was a great choice. Children under 12 eat free, so that was a bonus. It is next to the football ground which can be a plus or a minus. If you are a fan, it is a plus. If not, it can be intimidating when all the fans are let out at the end of the match. Loads of parking available for a small fee and disabled parking free of charge.", "title": "Fantastic Service at a Great Price", "user": "PhilDeRoom", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175060047}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It is not a luxurious hotel, but it does offer everything you need to have a pleasant and welcoming stay, even a mini gym. I cannot complain about anything.", "title": "Best family room we've had", "user": "chippy_chips", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174983291}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here to meet up with some family during a trip into Norwich. We booked the same day as travelling. Arrived at the hotel and was greeted by the friendly reception team. Our room was a standard double room but it was huge and the bed was comfortable. We dined at Artorios at Riverside (highly recommend) and had a really good nights sleep. Breakfast was brilliant with masses of choice. Would stay again.", "title": "Brilliant Hotel :)", "user": "Bumpkin2010", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174979682}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Stayed for one Saturday night. Check went smoothly and we were able to check in early at 12 before a wedding. It's only a 10 minute walk, left out of the station (follow the road around, don't walk into the retail park). Twin room was comfortable size with modern non-chipped furniture and two generously sized double beds. Everything was very clean. The main light and desk lamp were both broken, which shows a lack of attention/checks but this was the only fault during stay. Reception quickly fixed this though, despite the housekeeping manager telling me it was the maintenance man's day off. Breakfast was well run, not too overcrowded and staff reasonably attentive. Breakfast was also good value at under £10 each, but this discount is only gained by getting a voucher from reception first. All staff throughout the stay were surprisingly courteous and I would recommend this hotel for a decent sleep in Norwich.", "title": "Good value and a good sleep", "user": "James P", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174089781}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed for one night at this hotel, the service from the minute we walked in, to the moment we left was excellent. Every member of staff was friendly and professional. The Duty Manager Nick Huggins was incredible, and genuinely wanted to ensure every visitors experience was a positive one. He had local knowledge and was able to guide to places in Norwich. He even bought us an extra towel up to our room, realising we would be require extra. The rooms are very clean, and well presented - we stayed in a family room, which contained two large double beds, perfect for the three of us - our daughter enjoyed having a large bed to herself. The bathroom has a good shower - one of life's essentials. The view of Norwich City Football pitch was great, all floodlit in its glory. The breakfast offered a good variety of food catering for a wide taste. The car park was good and reasonable at £4.95 per night.", "title": "Excellent service!", "helpfulness": 2, "user": "Deb0rah_L915", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173841223}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It is clear that from other reviews the staff at this hotel are well trained - the Holiday Inn should be proud of their staff - especially their duty manager Nick Huggins.", "title": "Premier league", "helpfulness": 2, "user": "Ruth A", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173786207}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I stayed here for three nights with two children aged 10 and 16. We all loved it. The room had a fantastic view of norwich city football stadium and my son just loved watching all the per match prep going on there. In the reviews I read the hotel staff were commended for their excellent customer service skills and I was not disappointed, from the moment we checked in until the time we left there was not one single member of staff who let the team down. Everyone really seemed to enjoy what they were doing and love their job. The hotel was clean and everything was new. We ate in the restaurant but preferred the bar food, pizzas were on special offer and were really good. The breakfast was also very good value, although you can get a cheap fry up in the morrisons supermarket just across the road. Norwich is a really beautiful city and is a short walk from the hotel. I would definitely recommend this hotel for a short stay, comfortable rooms and excellent service.", "title": "Excellent", "user": "Andrew G", "date": "August 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173597779}, {"rating": 2.0, "stay_parameters": "Stayed September 2013", "text": "I wouldn't recommend this hotel to my worst enemy. No wifi in the rooms (Ethernet is available but not much good if you are using a tablet.) This does of course explain why the lobby is full of people - it's the only place where wifi is available. Only 4 radio stations are available via the TV all playing pop music. I'm still trying to work out what the mystery stain on the bed is. A budget hotel in all but price - soap/shower gel attached to the bathroom wall. Plus an honourable mention for the view from my window - the car park and a large and noisy road junction. Now just waiting for hell to freeze over before I make another reservation", "title": "Welcome to Norwich, please put your clocks back 20 years", "user": "seniledelinquent", "date": "September 30, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 179226294}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Welcome at reception was very good. The only reservation we felt to a great overall stay was the bar. The selection of brandy was very poor (no Courvoisier) and we had to ask for lemon/lime in our G & Ts. Otherwise good location and helpful staff.", "title": "Helpful staff", "user": "Dozymosey", "date": "September 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179158046}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "My wife & I have just returned after spending three nights at this hotel. The hotel is part of Norwich City Football Club. I found this rather good. The rooms are large with two good sized double beds in them, they are cosy, comfortable and clean. The staff are pleasant and friendly and the food was excellent. I enjoyed everything about this hotel but a few of our party, myself included, had a few problems in the bar where one member of the staff charged higher prices than his colleagues. A pint of lager and a brandy cost me £6.90 with most of the bar staff, he tried to charge £8.40 for the same two drinks, and I was charged £11.10 for a lager, a brandy and a glass of draught coke, so I assume the coke came in at £4.20, so be warned. Apart from that, I had an excellent stay & I would go back to this hotel again", "title": "Lovely Hotel", "user": "JoeJoe674", "date": "September 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179115090}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "I know there are other hotels built as part of sports stadiums around the world, but this is first time I have stayed in one. My room overlooked football ground and although nothing was happening it was an interesting outlook and different from the average room! I think this is what is called a USP.", "title": "Good Hotel, Unique Location", "helpfulness": 1, "user": "EdinburghTraveller61", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177563046}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "I was only person checking in and I was early (11 am approx), but I still had to wait 5+ mins as receptionist appeared to be taking phone booking. I could hear other staff in back office, but reception seemed to field all calls.", "title": "Good comfy hotel", "helpfulness": 1, "user": "Linda K", "date": "September 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 177159545}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 5, "average": 45, "very good": 146, "terrible": 2, "excellent": 189}, "aka": "Holiday Inn Norwich City Hotel", "slim_ranking": 0.150943396226, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "This contemporary, stylish, award winning hotel (Hotel of the Year 2011) is the perfect property for business and leisure guests visiting historic Norwich. Holiday Inn Norwich City is the newest full service property in the city and has 150 air conditioned, light, modern bedrooms all of which are non smoking. Many of the rooms offer a pitch view of Norwich City's premier league ground and with a mix of executive, suites, standard, twin and accessible rooms we can offer something for everybody. The hotels atmospheric bar is a meeting place for everybody and serves a superb selection of wines, beers, bar snacks or full meals from our dine anywhere menu, or dine in style in our superb restaurant, the choice is always yours. Thinking of exploring? The hotel is in walking distance of Norwich's two cathedrals, its stunning Castle dating back to the Norman Conquest and the superb Norwich Lanes for individual bespoke shops. Alternatively head for the Chapelfield Shopping Centre with over 90 well known outlets making it a shopping paradise and placing Norwich in the top 10 of UK shopping destinations. With only a 5 minute walk to Norwich station leave the car at the hotel and let the train take the strain and visit the beautiful North Norfolk coast, the delightful Norfolk Broads or the seaside resort of Great Yarmouth what could be easier?"}