{"user_rating": 4.0, "review_count": 94, "name": "Holiday Inn Express Chester - Monroe - Goshen", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Great place for a quick stop outside NYC. Stayed in a room with 2 comfortable queen beds and a pull out couch. Great for 2 adults and 4 kids. Had a fairly large pool for kids. Breakfast included was better than average for this type of hotel. Everything was clean, great towels and friendly service.", "title": "Good stop near NYC", "helpfulness": 1, "user": "TorontoJane", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26684216}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The Holiday Inn Express in Chester proved to be perfect for our 1-night stay. We chose the location since it was close to the Woodbury Common Premium Outlets, and based on our experience the hotel offered a very comfortable stay with nice extras like a hot continental buffet breakfast, free internet access in the room (if you have a laptop), and a decently modern and well-sized bathroom.", "title": "Great 1-night Stay", "helpfulness": 1, "user": "Rye13", "date": "February 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25216403}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I was dreading staying here due to past experiences with Holiday Inns and Holiday Inn Express properties. I must say I was completely blown away by the quality of the rooms, the thoughtful design touches (e.g., plenty of outlets located in various places around the room so you can plug in laptops, PDAs, etc; comfortable work spaces; very comfy bed; well-designed bathroom with very good shower head), and the professionalism of the staff. I'd definitely stay here again if I found myself in the area. This particular Holiday Inn Express beats the typical remodeled Hampton Inns and Courtyards by Marriott, in my opinion.", "title": "Great value for the price", "helpfulness": 1, "user": "uitsmijter", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 22115505, "likes": {"liked": "— Cleanliness and design", "disliked": "— On the highway"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The room was standard Holiday Inn Express - it was very large and nicely furnished however the sheets were unironed, and there was some noise from the neighboring rooms / hallway. Also the breakfast wasn't as good as the average Holiday Inn Express.", "title": "Average Room", "user": "4states", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 19335637, "likes": {"liked": "— Noise from the building site"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The staff were friendly and helpful.", "title": "Convenient & friendly", "user": "Papaleadfoot", "date": "August 11, 2008", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18848399, "likes": {"liked": "— Near shopping outlet mall", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed one night at the Holiday Inn Express in Chester as part of a music festival. Check-in was a breeze, and I found the room to be quite spacious and very clean. There was also a fridge and microwave, which was a real plus. I found the bed perfectly comfortable, and the sheets smelled (and were) fresh and clean. The only drawback in the room was that a lightbulb in the bathroom was burned out, but it didn't make much of a difference to me, as there was other lighting. There was a wide variety of breakfast items, and all were of good quality, although the coffee was not really strong enough. The breakfast attendant was very accommodating. All in all, I would definitely stay at this hotel again.", "title": "Clean and convenient", "helpfulness": 1, "user": "Bandlady", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113533898}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Clean, nice beds, ten minutes from Woodbury Commons. Paid $99 using coupon book from gas station stop on interstate.", "title": "Overnight before shopping at Woodbury Commons", "user": "lamandel", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83258842}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Included breakfast which was fine and a new paper. Cute little indoor pool. Lots of parking which was well lit.", "title": "Staying smart!", "user": "mattmoss79", "date": "September 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81547774}, {"rating": 5.0, "title": "Very nice stay", "text": "only one complaint heat/ac was blowing too strong and could not be adjusted so we just unplugged it.", "user": "Lmcathy", "date": "August 3, 2010", "id": 73665768}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "This is my second time at this holiday inn express hotel and same as before had a great experience the staff was friendly and helpful. Only had one minor incidence in which a non smoking room smelled of smoke and the front desk quickly corrected it. Overall a good stay and i would recommend to anyone coming to this area.", "title": "Don't stay here if you want a quiet evening/night", "helpfulness": 1, "user": "Tanner337", "date": "February 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 56423291}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "the only thing i found wrong was they could not keep the hot tub running it was always breaking down this was not the falt of the staff but the ownners of this holiday inn they havent realalize if you advertise it you must have it running this was down for 6 weeks", "title": "the staff and rooms were great it was my homeaway from home", "user": "grampa70", "date": "February 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55013814}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Went to a wedding at West Point. For some reason, the wedding party was booked here even though there was another Holiday Inn much closer to West Pt.", "title": "nice hotel", "user": "ibbyCalif", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 54790721}, {"rating": 1.0, "title": "Refused to make amends", "text": "Hotel common areas were, modern, spotless, comfortable, and safe. Despite its' location right next to Rt 17, rooms were quiet. Rooms were spacious, clean, and comfortable too. Beds were comfy, tv had good selection of channels, there was a clock radio, phones w no charge for local calls, internet access from the room and business ctr downstairs. Room had iron/ board,coffee maker, hair dryer.", "user": "fkcaz", "date": "January 11, 2010", "id": 53236828}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "There was supposedly a gym, did not see it. There is a indoor pool /jacuzzi, and a business ctr. There was no bar, but I noted some people socializing in the common area by the front desk. There were tables chairs there and wide screen tv too. No restaurant , but they have an excellent self serve breakfast in the am, it is at no extra charge.", "title": "Can't believe it was that bad", "helpfulness": 1, "user": "mittmott", "date": "August 24, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 38630730}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "There is a Mc Donalds , a dollar store, movie theater, and pizza joint ,and a bar across the street. Drive a little further east on Rt 17, there are some malls w places to shop/ eat.", "title": "Good breakfast", "helpfulness": 1, "user": "RichToronto", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 34388414}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We stayed here for 4 nights. Purpose was shopping. It is in the middle between Woodbury common outlets and shops in Middletown. It took as about 10 minutes driving either way. Hotel is next to the highway and rooms facing it can be noisy. Our room was large and included little kitchenette. Opposite the hotel is a strip mall which comes handy. Hotel is nice and clean and staff is helpful. The breakfast on offer is simple but sufficient. There is a swimming pool but we did not use it. We would not hesitate to stay in the hotel on our next shopping trip.", "title": "very good hotel", "helpfulness": 1, "user": "Piskotik", "date": "August 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 18799180}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "During a tour of the Hudson Valley, we stayed at this hotel as it was fairly close to the Woodbury Common Shopping Outlet and were pleasantly surprised by the high standard of accommodation provided. The staff were helpful and friendly, advising on the best places to visit and eat.", "title": "Handy for the shopping", "helpfulness": 3, "user": "Borodog", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10050227, "likes": {"liked": "— Modern accommodation", "disliked": "— Machine noise"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Although the Highway was alongside, there was little or no noise of the traffic. The breakfast was excellent and the pool a reasonable size, clean and little used for some reason.", "title": "great hotel; great location", "helpfulness": 4, "user": "sunsaver", "date": "July 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8128175, "likes": {"liked": "— Proximity to outlet mall", "disliked": "— Felt a bit off the beaten track but wasn't really"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Woodbury Common was only a 10 minute drive away down the highway but there was also other interesting places to visit in the vicinity, such as Sugarloaf with its curio shops (and ice cream).", "title": "Super hotel near Woodbury Common", "helpfulness": 2, "user": "Nevada4girl", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6022159, "likes": {"liked": "— breakfast", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "On our second night, I could hear a subdued hum emanating from some machinery, although my wife could not. The staff could not identify the source but I believe that it came from the machine room next to reception so if you have sensitive hearing ask for a room away from the reception area.", "title": "Pleasant Stay", "helpfulness": 1, "user": "zfny", "date": "September 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5762927}], "location": {"country": "United States", "city": "Chester"}, "stars": 2, "variance": {"poor": 5, "average": 17, "very good": 38, "terrible": 4, "excellent": 30}, "aka": "Holiday Inn Express Chester - Monroe - Goshen Hotel", "slim_ranking": 1.0, "description": "Welcome to the Holiday Inn Express Hotel & Suites, Chester! Conveniently located in the beautiful Hudson Valley area, the Holiday Inn Express, Chester is just 8 miles from the Woodbury Common Premium Outlets and 20 miles from West Point Military Academy, Bear Mountain State Park and Mountain Creek Ski and Water Park. The Chester Industrial Park, less then 1 mile away, includes companies such as C&S Wholesale Grocers, Amscan and Steris. Also, located close by, Orange Regional Medical Center and Saint Anthony's Community Hospital. If you are flying into the Orange County area, we are 17 miles away from Stewart International Airport, and 60 miles from JFK, LaGaurdia and Newark Airports. Public transportation to and from New York City is available through Shortline Bus/Coach USA Company, 1 mile from Holiday Inn Express and Metro-North Train Station only 8 miles from Holiday Inn Express. Come Stay Smart at the Holiday Inn Express in Chester! Relax and enjoy by our large heated indoor pool and Jacuzzi. The complimentary Express Start Breakfast Bar includes our signature cinnamon rolls - delicious! All rooms have coffee makers, hair dryers, irons and ironing boards. Complimentary high-speed wireless Internet is available throughout the entire hotel. Planning a meeting or event in the area? The Holiday Inn Express has a board room and a party room - great for baby or wedding showers! Group rates are available for your party as well."}