{"user_rating": 4.0, "review_count": 216, "name": "Holiday Inn Express Cooperstown", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We stayed at the Holiday Inn Express in Cooperstown for one night in July. The hotel met or exceeded my expectations in all areas. Service was great and the room was spacious, clean, and well-stocked with not only the standard linens and toiletries but also plenty of cups, bowls, and utensils.", "title": "Great stay at the Cooperstown HI Express!", "helpfulness": 3, "user": "paubri", "date": "July 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8228357}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The room was equipped with a refrigerator, microwave, DVD/VHS player, free internet, and had a very spacious work area. The continental breakfast buffet had a good variety of options and was well-stocked.", "title": "This is worth the price!", "helpfulness": 5, "user": "jersey-ites", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8072670, "likes": {"liked": "— terrific room", "disliked": "— nothing"}}], "location": {"country": "United States", "city": "Hartwick Seminary"}, "stars": 2.5, "variance": {"poor": 11, "average": 41, "very good": 91, "terrible": 11, "excellent": 62}, "aka": "Holiday Inn Express Cooperstown Hotel", "slim_ranking": 1.0, "description": "The Holiday Inn Express is a brand new hotel located minutes from the heart of the historic village of Cooperstown, New York on State Highway 28. This places the hotel in close proximity to all the businesses and attractions of this wonderful community. We are a 100% Non-Smoking hotel. Visiting Our Universities? The Holiday Inn Express Hotel & Suites offers great value to those visiting our fine educational facilities. SUCO Oneonta & Hartwick College are just moments away. A Great Business Location! The Holiday Inn Express Hotel & Suites is well located to fine companies such as Bassett Hospital, Brewery Ommegang, Wal-Mart, Fox Hospital, Clark Foundation and many others. The hotel offers all the services a business traveler needs for a productive visit.Great for a Vacation Visit! The amenities of the Holiday Inn Express Hotel & Suites and central location makes it the perfect place when vacationing. Whether you are attending Cooperstown Dreams Park, Cooperstown All Star Village, Cooperstown Baseball World, Cooperstown Diamonds, The National Baseball Hall of Fame, Howe Caverns, Ommegang Brewery, Cooperstown Brewery, Fenimore Art Museum, National Soccer Hall of Fame, Farmers Museum, Fly Creek Cider Mill, Bear Pond Winery or many other local attractions, we are close to it all!"}