{"user_rating": 4.0, "review_count": 113, "name": "Holiday Inn Express Amherst-Hadley", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "This is as good as it gets in Amherst, which isn't saying much. (Sorry, I don't do the \"quaint\" bed and breakfast thing which you might get at the Lord Jeffrey).", "title": "Lap o' Luxury for Amherst", "helpfulness": 8, "user": "islington3164", "date": "August 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3793308}, {"rating": 4.0, "title": "Hol Inn Hadley MA", "text": "Really, not such a bad place to stay, and unless you're willing to drive 30 minutes to Springfield, the only place I'd consider in the Amherst area. The room and bathroom were large and clean, the tv offered plenty of cable channels, and the limited breakfast was adequate given the price of the room. There's no restaurant on site, but you'll surely have a car if you end up here, and there are plenty of places open in the area should you get the midnight munchies as I always do.", "helpfulness": 7, "user": "Joanel", "date": "July 18, 2005", "id": 3679101}, {"rating": 2.0, "title": "Overrun with screaming kids", "text": "I hate the open hallway layout. If the front desk person is not at his/her station (as was sometimes the case), anyone can walk in from the street and access the rooms. I know crime doesn't come to mind when you think of Amherst, but the motel is set back, all by itself, off a major commercial road and the access issue was just a little unsettling.", "helpfulness": 10, "user": "leafpeeper98", "date": "March 3, 2004", "id": 1703476}, {"rating": 5.0, "title": "A very nice place to stay", "text": "I suppose if you're in the Amherst area, this hotel would be your best bet.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 22, 2003", "id": 1143027}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 5, "average": 24, "very good": 45, "terrible": 6, "excellent": 33}, "aka": "Holiday Inn Express Amherst-Hadley Hotel", "slim_ranking": 0.428571428571, "description": "The Holiday Inn Express Hotel & Suites Amherst/Hadley, is located in the Pioneer Valley, conveniently situated near Amherst, Hampshire, Mount Holyoke, Smith College, and the University of Massachusetts. Our 100 rooms include a business class floor and 22 suites. Enjoy complimentary, deluxe 'Smart Start' breakfast, including hot items; wireless high-speed Internet; and use of our indoor pool and fitness room. Explore all our area has to offer and Stay Smart at the Holiday Inn Express Hotel & Suites."}