{"user_rating": 3.5, "review_count": 184, "name": "Holiday Inn Charleston-Mount Pleasant", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "the hotel was one of the nicest places I have stayed in. The staff was professional and kind. the room was clean and had free Wi-Fi available. The best of all was the restaurant that was supberb. The hostess (Theresa) was very very nice.", "title": "Very clean stay and great food", "user": "collick66", "date": "April 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7393984, "likes": {"liked": "— very clean"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "The Holiday Inn @ Mt Pleasant is a great location-convenient to downtown Charleston and all the suburbs, as well as the small 'islands' and beaches. It was clean-but some service issues. At check in we were sent to a room that had the cover to the air conditioner/heater hanging off kilter and groaning as if in pain. We were cheerfully and promptly given a different room. The wireless internet was hit and miss at best. One complaint to the front desk yielded being told it was an event week end and they didn't think there would be any repair to the service or any discount in the price. The next day the manager was helpful-but asked us to directly call the wireless help desk and call him with their instructions. The service never did work properly. Everyone was courteous and friendly--and I would recommend this hotel, and will most likely stay with them again in the future.", "title": "mixed review", "user": "suntoday", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7293737, "likes": {"liked": "— convenient location", "disliked": "— not all services advertised actually worked."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Very conveniently located just north of the bridge into Charleston on route 17S, we found the Holiday Inn to be ideal for what we wanted: a no-nonsense, quiet place to stay out of the city centre but close enough for easy access to downtown.", "title": "Convenient, quiet stay", "user": "ams", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7279007, "likes": {"liked": "— Convenient location & ease of access to city centre.", "disliked": "— Stuffy hallways!"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We were checked in early by a very friendly and capable clerk who advised us of the best way to find parking in central Charleston - incredibly useful information, as we'd already tried (and failed) to do so alone.", "title": "disappointed", "user": "AlabamaAlabama", "date": "February 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 6751807, "likes": {"liked": "— nothing"}}, {"rating": 4.0, "title": "Nice Stay", "text": "While the hallways were stuffy (as mentioned in previous posts) this was not a big problem for us at this time of year and our room was kept at a nice cool temperature by the (admittedly rather loud) a/c unit under the window.", "helpfulness": 1, "user": "upstateSC5150", "date": "August 8, 2006", "id": 5577043}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Hotel is very convenient, which is its only advantage. Rooms are clean and nice, but out dated. Staff is unhelpful and rude. I arrived early and they would not let me check in even though my room was ready. Staff acted as if I was inconveniencing them when I asked them questions.", "title": "ok", "user": "nicholasbrown1", "date": "November 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 10741501}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Overall stay was good. For the price however, could be much nicer.", "title": "Disappointed in service", "helpfulness": 2, "user": "dfbf", "date": "October 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 5.0}, "id": 10410287, "likes": {"liked": "— servicde"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The hotel has an excellent location for seeing Charleston and the beaches. The room was clean when I arrived, quiet, and comfortable. I was disappointed in the service I received. Housekeeping did not touch my bed on my first night but did change linens and turned up the air conditioner. The front staff did nothing in response and was not very helpful otherwise.", "title": "Friendly staff", "user": "Midwestern2", "date": "August 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8452376, "likes": {"liked": "— Location", "disliked": "— Cleanliness"}}, {"rating": 2.0, "title": "No A/C? Stolen items", "text": "The staff was very congenial and helpful. This hotel also has easy access to the beach, Patriot's Point, and Historical Downtown. The down side was I squashed a huge pest in the room. I'm still hoping none of the creatures hitched a ride home with me. The hotel management gave us 4 complimentary breakfasts ( which we never used). The room was okay. The hallway was hot and had a strange odor. We didn't make it to the pool. I booked through Priceline for $100/night. Next time I will probably stay in Historical Downtown, mainly because of the nightlife. Everyone should know that S. Carolina has \"zero tolerance\" and swarming state troopers. If you are someone that enjoys a drink or two, It would make sense to spend the extra money on a hotel downtown within walking distance.", "helpfulness": 1, "user": "ch55662lex", "date": "August 15, 2007", "id": 8431551}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Room service stole some personal items, so asked them not to come back after first day. I had to clean the bathroom myself upon check-in. Dirty carpet in lobby. Air conditioner in whole hotel was broke. Room units worked but then broke second day and replaced with one as loud as a helicopter. Dirty pool and everynight there was a party or reunion hosted at ther hotel which brought unwanted guest everywhere. We did not receive our pack of baseball cards that were advertised.", "title": "a 3 star hotel that needs an upgrade,ok,but not great", "user": "cundifffamily", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8364687, "likes": {"liked": "— location between downtown and beach", "disliked": "— price ,no free breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Like several other postings I have to agree that this hotel is a pretty typical Holiday Inn. If you’re looking for a Beach vacation, you don’t want to stay here. If you’re looking to see several different tourist attractions in Charleston, the location is pretty convenient. It’s right at the bottom of the bridge, so there is very easy access to I-26. Patriot’s Point is less than a five minute drive where you can get a boat to Fort Sumter. Sullivan’s Island and Isle of Palms are both about a 15-20 minute drive. The airport is about 20 minutes and Folly Beach is about 25 minutes. If you’re flying in to Charleston, don’t bother packing snacks. There is a grocery store right across the street and also several other stores very nearby – Walgreens, Target, K-Mart, etc. - if you forget to pack something!", "title": "Convenient Location", "helpfulness": 1, "user": "StephanieCincinnati", "date": "July 19, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 8193121, "likes": {"liked": "— Easy access to highway", "disliked": "— Not a whole lot of amenities"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I booked this hotel through Priceline. If you book through Priceline you will NOT save any money so if you want this hotel it’s best to just book straight through Holiday Inn. The price I bid on Priceline was actually higher than what the room costs through the hotel. I called Priceline and was reimbursed the difference – if this happens to you, I would suggest doing the same.", "title": "Reservations mean nothing...", "user": "mom2threeMichigan", "date": "July 19, 2007", "detail_rating": {"front_desk": 1.0, "value": 1.0}, "id": 8190767}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The Lobby is attractive and the front desk employees were very friendly and helpful. Since we booked through Price Line we automatically got a queen double. When I asked for a King they gladly met the request. They were also helpful with directions whenever we had questions. We were on the second floor and the walkway connecting the elevators to the hall where the rooms were did not seem to be air conditioned. It felt like walking through a sauna every time we walked through there.", "title": "Excellent Customer Service-Great Location-awful odor in hallways..", "user": "TravelingCrazyGirl", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8138284, "likes": {"liked": "— very close to beach (Isle of Palms) and city of Charleston", "disliked": "— the smelly hallways"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The room was very clean with the exception of a few stains on the chair which we avoided using. The bathroom was large however there was not a fan so it got pretty steamy whenever a shower was taken. There was no microwave or refrigerator which would have been nice to have. There also was not a free breakfast which I think several other hotels in this same price range did offer. The bed was not exactly the most comfortable bed I’ve slept in and the pillows were awful (if I ever went back I’d bring my own!).", "title": "Asthma/Allergy Triggers", "user": "ontheroadagain4fun", "date": "June 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8005577}, {"rating": 4.0, "title": "Pretty good, not fantastic", "text": "The pool was nice and never crowded. The chairs around it could use replacing as they are obviously old and some are very discolored and stained.", "user": "CSChilds", "date": "June 11, 2007", "id": 7835974}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "This was the worst hotel experience I've ever had. The carpet in my room had not been vacuumed in a LONG time, the wall beside the elevator was dirty, the ice machine/vending room had an overflowing trash can, the public bathroom was filthy, the food for our meeting was, at best, so-so, and the staff became even more rude when complaints were made. Food for breaks and meals was not always what had been ordered. I would never stay here again.", "title": "Terrible hotel, terrible service", "helpfulness": 1, "user": "Sron", "date": "April 24, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 15323608, "likes": {"liked": "— free wireless", "disliked": "— it was truly filthy and the staff were rude"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008", "text": "Located just a few miles from downtown Charleston and very close to Patriot's Point, this is a convenient hotel if looking to stay close to the attractions without being downtown.", "title": "Close to Charleston and attractions", "user": "bubbafb", "date": "March 24, 2008", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 14481691}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We were here on a school trip with a large group and had no choice on the hotel. I usually avoid Holiday Inns because I have seen them to be inconsistent over the years (except the Inter-Continental and Crowne Plaza). However, this hotel was actual pretty good.", "title": "convenient location, good stay", "user": "b0nnylass", "date": "March 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 14352284, "likes": {"liked": "— room", "disliked": "— bar staff"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The rooms were clean and comfortable. All the amenties worked and it was a good size.", "title": "Enjoyed our stay", "user": "Maisy47", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12587974, "likes": {"liked": "— Convenience to major highway", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Although I did not use it, the gym looked small but enough for a quick workout. Did not eat in the restaurant as we had breakfast catered in one of the meeting rooms. The food was fair.", "title": "Roach Hotel", "user": "sugabutt", "date": "November 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 11033741, "likes": {"liked": "— Pretty decor", "disliked": "— Roaches"}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 28, "average": 39, "very good": 54, "terrible": 20, "excellent": 43}, "aka": "Holiday Inn Charleston/Mount Pleasant Hotel", "slim_ranking": 0.789473684211, "description": "Take a video tour of our hotel. The Holiday Inn Charleston Mt Pleasant is at heart of it all, located just minutes from Historic Charleston. Our convenient location is easily accessible and known for being at the foot of the Arthur Ravenel Bridge. Our Holiday Inn hotel is conveniently located to Charleston s beaches, islands, plantations, golf courses and other Lowcountry attractions. In addition, we are convenient to shopping, ports and local businesses. Enjoy Festivals & events: Southeastern Wildlife Expo 3rd Weekend Feb Cooper River Bridge Run 1st Weekend April Spoleto Festival Memorial Day Weekend to June 10 Family Circle Cup Tennis 2nd Weekend April The Holiday Inn is surrounded by southern charm and fine antique reproductions found throughout the hotel. Our spacious guest rooms are filled with lovely antique reproductions as well, yet feature modern conveniences. Our hotel is designed to meet the needs of our corporate, group and leisure travelers offering exceptional service to our guests and amenities to meet your every need. If you re planning a meeting, banquet, wedding or family reunion contact our expert staff to make your event memorable."}