{"user_rating": 4.0, "review_count": 119, "name": "Holiday Inn Express New York - Manhattan West Side", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The hotel is located a 15 minutes walk from Times square. If you want your NYC experience to include staying in the heart of the city's tourist attractions, don't book this hotel. Otherwise, its location is a decent distance from all the chaos of midtown Manhattan. The staff was very helpfull and did everything possible to make our stay at the hotel as pleasent as it could be. The breakfast was a refreshing change compared to what we are used to in NYC hotels(which is usually: No breakfast for you). The hotel has over 160 rooms and 11 floors. The two elevators and the not large enough dining area are not enough to handle all the hotel guests. Expect delays when going down to eat your breakfast.", "title": "CAN be a very good choice for Manhattan stay", "user": "TA-IS-traveller", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 181550587}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Positives:", "title": "ehhhh", "user": "rjproof", "date": "October 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 181306372}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "-within 15 minutes walking distance of the javitts center and the cruise port.", "title": "Just far enough away", "user": "va70aux", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181048533}, {"rating": 4.0, "title": "Great staff, nice room", "text": "-within a 30 minute walking distance of Rockefeller center.", "helpfulness": 1, "user": "brentb1166", "date": "October 13, 2013", "id": 180864069}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "-free hot breakfast (typically choices, but free none the less)", "title": "Excellent Place", "helpfulness": 1, "user": "Lucio M", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180694165}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "What more can you ask for? A price of less than $304 per night would be welcome, after all it is ONLY a Holiday Inn Express, but given that the best room we could find on a popular weekend was at this hotel, through priceline for $250 per night plus tax (=$304), at least it was very good. An easy and pleasant walk to the N or M1 bus that crosses the city, a fun neighborhood on the upswing (***love the Hells Kitchen Flea Market on Saturday and the awesome restaurants on 9th...and some nice shops, too including Housing Works- where the money goes to victims of AIDS, HIV and homelessness) . We would stay here again for sure.", "title": "Excellent hotel, wonderful location, nice staff, comfy rooms, good breakfast", "user": "MaCherie57", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 180589803}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Very clean rooms. The beds and pillows were very comfortable. The front desk staff was very helpful and friendly. The breakfast buffet was very good and the breakfast crew was very friendly. The breakfast crew made me feel welcome, always had a smile and made the extra effort to say hello and good morning. They really added to the enjoyment of my stay. I would definitely stay here again.", "title": "Scott M - Great stay", "user": "Scott M", "date": "October 11, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180580083}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The hotel is in a good location and within walking distance of many main attractions. The staff were extremely friendly and helpful and check in / out was efficient. Room came with a breakfast and the scrambled eggs were the best I have eaten from any hotel buffet. Beds were very comfortable but the bathroom fan was very very noisy, sounded as if the bearings were badly worn. But I must emphasise, this did not detract from the pleasantness of our stay", "title": "Good location", "user": "Gomin", "date": "October 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180183650}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "like all the Holiday Inn Expresses I've stayed in, loved it. quietly great service, awesome breakfast. would stay here again without a doubt. Times Square/Midtown central without the craziness. only gripe is subways are a five to ten min walk away, however strolled passed a few lovely local landmarks (eg. Clinton Community Garden) on the way to.", "title": "loved", "user": "missroberts", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180173384}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Our five night stay here was very comfortable with modern rooms (if a little small) but with all the amenities required. Breakfast provided was excellent and we had no problem with over-crowding. Location a little off the hustle and bustle track, but everything within walking distance so not a problem for us. Staff we encountered were extremely helpful and friendly (all had lovely smiles!) and although we were dubious about staying in a Holiday Inn Express (based on previous experiences in London), we can honestly say that this was an exception and we would have no hesitation in returning here should we be fortunate enough to visit NY again.", "title": "Delivers exactly what you'd expect...", "user": "MiloLingfield", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 179437397}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "We went up for a 3 night stay in NYC and had a great experience at The Holiday Inn Express. It was excellent, very clean and centrally located. The staff was very friendly and helpful. They went out of their way to accomodate us when we needed an extra room and helped us by making restaurant recommendations. The breakfasts each morning were delicious and there was alot of variety. The staff came through during breakfast to make sure all was well and that we were enjoying the food. There is a nice sitting area outside the hotel and when you enter the lobby there is a large cooler of water with fruit slices in it. It is very refreshing. This was my second stay at a Holiday Inn Express (the other was in Ocean City, MD) and both have been outstanding. In particular the staff at both hotels have been extremely friendly, welcoming and helpful.", "title": "Wonderful Stay at the Holiday Inn Express Manhatten West Side", "user": "M Bonnie D", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183325238}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "This place is clean, comfortable, and very very friendly. Good concierge service. Breakfast included, including eggs and sausage in addition to the typical carbs. Free wifi work very well. Construction on this block, but safe. This hotel is in Hell's Kitchen, but short safe walk to Time Square and subway.", "title": "Great place to stay", "user": "L B", "date": "November 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 183195929}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "First, the staff members of the hotel were all very friendly and accommodating and the room appointed to me was well-maintained and clean. The hotel is located on 48th and 11 so that it's 2 streets and 3 avenues away from Subway A, C and E (blue line) - about 10 blocks or 10-minute walk. It's right across a construction site and a Salvation Army shelter for the homeless. If you need to park a car, there are ICON Parking lots about 2 blocks away.You'll need to walk to 9th avenue to get to the foodie scene of Hell's Kitchen.", "title": "No Sleep from Construction Noise Across the Street", "helpfulness": 1, "user": "SmartTravelerLee", "date": "October 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 183091859}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Everything was good except that the hotel management forgot to notify hotel guests of the ongoing construction across the hotel. I had a dinner and party on the night I checked in, and got home fairly late - around 3 AM. I went to bed around 330 AM. I woke up abruptly around 7AM to the tune of jackhammering and pile hammering. Unfortunately, my room is facing the construction site next to the Salvation Army shelter for the homeless. My room was on the 8th floor, but the noise from the jackhammers is still very loud.", "title": "Great Staff and Service", "user": "KiwiTraveller69", "date": "October 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182522711}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "I called the front desk around 730 AM and told them about the issue and they can only offer me ear plugs. I requested for a late checkout, and they gladly gave me one as I thought the jackhammering wil subside after a couple of hours. I tried going back to sleep but the pile hammering was relentless and incessantly annoying that I went in and out of sleep for a couple of hours until finally I couldn't bear the noise and had called up again and spoken to the hotel director to let her know of the situation. She said that it's too late for me to be transferred to another room since I am checking out a few hours later. She said that the construction workers are contracted to do work from 7AM-5PM. The jackhammering was non-stop from 7AM to 1PM when I checked out.", "title": "Do not recommend if you want to sleep and friendly staff", "user": "TPietscher", "date": "October 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 181974744}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "Very impressed with this hotel. Staff were great and room was very comfortable. Good features including a bath (rather than shower), good wifi, in room fridge, room safe and a large LED tv. Breakfast was good vareity and never issues relating to availability of tables or running out of food. Very short walk (less than 10 mins to Times Square or 50th Street subway station).", "title": "A very nice stay", "user": "EasternWestSussex", "date": "November 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184732782}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Hotel was very clean and staff could not do enough to make me feel welcome or offer advice.", "title": "Great place to stay--Best value in NYC", "user": "tzorn", "date": "November 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184709539}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Will definetly be back.", "title": "Excellent find through discount website!", "user": "venividinapi", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183829862}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Thanks", "title": "Clean hotel, Friendly staff, Convenient Location", "user": "bowlesbuilders", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183790410}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Perfect hotel for family. Rooms were clean and spacious enough for family of 4. New furnishings throughout hotel. Every employee we came into contact with was gracious and accomodating from the asst. manager to the employee who brought us a new hairdryer. Quick response to all our requests with a great attitude. Breakfast bar was well stocked with lots of options for a healthy breakfast. Perfect place to stay--only a few blocks from restaurant row and Times Square. My daughter lives in NYC and I have stayed in lots of hotels while visiting her--this is by far the best value for the money.", "title": "Hotel", "user": "james t", "date": "November 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 183513012}], "location": {"country": "United States", "city": "New York City"}, "stars": 3, "variance": {"poor": 7, "average": 14, "very good": 44, "terrible": 5, "excellent": 49}, "slim_ranking": 0.458239277652}