{"user_rating": 4.0, "review_count": 235, "name": "Holiday Inn Vancouver Airport", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Very close to airport. Very clean, recently renovated. Free Shuttle service available. Very friendly / helpful staff. Surprised breakfast wasn't included and that internet was available for a fee vice free (priority club member). Parking was free and underground (and gated). Only complaint is that room was not set up well for two females traveling together. Only plug/outlet close to a mirror (important to females when doing hair) is in bathroom so couldn't get ready outside of bathroom in room.", "title": "Good Enough for a Quick Airport Stay", "user": "worldgypse", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33773716}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Stayed there last night. I booked on Hotwire and got a great rate. The airport shuttle was convenient - it leaves every half hour as was the McDonalds in the parking lot. Other than that, there is nothing around this hotel. The room offered a no-frills Holiday Inn stay. Nothing to complain about, but nothing to cheer about either.", "title": "Free high speed internet? ha!", "user": "Hockey_goon99", "date": "May 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 29303361}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The web site touts \"free wireless high speed internet\". Unfortuanately that means one modem in the lobby and lousy connections from every guest room. The guy at the front desk advised me to walk up and down my hallway with my laptop to see if I could get a better connection. After trying to make it work for 2 hours, and getting intermittent service, I gave up.", "title": "Great place to stay for a layover in Vancouver", "user": "traveljunky81", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28838039}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "If you have work to do on your computer, or just want to surf while you unwind, don't stay here.", "title": "Awful. Avoid.", "user": "korokoro", "date": "March 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 26479335}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "Hadn't read the TA reviews before staying one night. I wasn't as impressed as others.", "title": "Liked it, but not wowed", "helpfulness": 1, "user": "ABtraveller", "date": "January 25, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 23902730, "likes": {"liked": "— comfy bed", "disliked": "— fitness room"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The parking garage no longer has gates. There are 6 steps from the parking garage to get to the lobby - but the lobby directional sign has no indication of that. The 3rd floor ice machine was out of service (but no sign). The entry light in my room was not working. My room's view was of a car dealership - with bright lights overnight. My guest room seemed filled with furniture, but no fridge, and only basic storage space.", "title": "Hotel loves money", "user": "zdot", "date": "January 21, 2009", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 23760557, "likes": {"liked": "— Leaving", "disliked": "— The attitude of the Management"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Fitness room (on the 2nd floor) had a non-working treadmill, and the hot tub is in the same room with no divider or any sort. No soap or shampoo in that fitness room shower.", "title": "Good place to stay", "user": "snipes28", "date": "January 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 23386782}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "But it was a good stay: check-in was fast and friendly, cleaning staff make a point of speaking as you pass by, the lobby is a nice size with big picture windows and a computer.", "title": "Perfect for a business traveller", "user": "ganieda845", "date": "December 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 22635224, "likes": {"liked": "— Fast internet access", "disliked": "— Workout area / pool"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "My room had a comfy king bed, upholstered, funky chaise lounge - rather than the usual reading chair - great sound from the clock radio (that's IPOD compatible), inroom internet connection worked well (password from front desk at check-in), great local prints on the walls, huge countertop in the spacious, well-lit bathroom includes a coffemaker. Open closet has wood hangars.", "title": "fantastic airport hotel", "helpfulness": 1, "user": "homeperm", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 21755143, "likes": {"liked": "— i booked the hotel because it was close to the airport, but i also loved the service", "disliked": "— if i was going to vancouver to see the city i would have wanted a better location - but as an airport hotel it was GREAT."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We stayed 2 nights pre-cruise. Took scheduled shuttle from the airport and check in was easy and fast. Room was nothing unique but clean and comfortable. If you need absolutely quiet to sleep, this is not for you. You can hear a bit of traffic noise. We like the fact it is a non-smoking facility.", "title": "Good for short stay but no internet connection", "user": "wen_c82", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 45344845}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Staff are friendly and service is good. We had 2 problems during our stay and were resolved quickly. My sister was allergic to 'down' material, once we discovered that duvet was down we called the front desk and they brought up blankets within minutes. The other issue was with internet connection, I was able to see the connection but no internet. Manager Stephen offered us 20 minutes free internet in the lobby. That was fine as we just needed to check e-mail. They also connected us with the help desk to figure out the problem but no luck. I know the problem is not with my computer as I was able to use it Safeway Supermarket's wi fi without any issues.", "title": "This hotel cuts all the corners, nice now but probably won't last.", "helpfulness": 1, "user": "csnoke", "date": "September 21, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 43211857}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We rented a car to get to cruise terminal but We notice the hotel also offers shuttle to cruise ship terminal at a reasonable fee. Over in over, good place for a short stay and we appreciated friendly service.", "title": "NICE HOTEL BUT LOCATION NOT SO GOOD", "user": "dom&jess", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 42168086}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I would rate a 4 Star if internet connection had worked.", "title": "Great stay", "user": "elnerico", "date": "August 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 36374852, "likes": {"liked": "— free parking", "disliked": "— not much happening in richmond"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed at this hotel on a spare night in Vancouver after an Alaskan cruise. We got the room for $65 from a \"name your price\" website. The hotel is about 30 minutes from downtown and in a not so nice part of town. There's a McDonald's in the parking lot, but other than that there isn't much to eat near by. There is a restaurant and bar inside the hotel.. but I didn't eat there.", "title": "Terrific value, service & a overall great experience.", "helpfulness": 1, "user": "Jayy27", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35990437}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "This hotel was very modern but I could not believe that the television was over 25 years old.", "title": "A Zenith TV!", "user": "monarg", "date": "January 19, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 53906102}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The bathroom was super large and the shower was top class but the television ruined the whole experience for me", "title": "Great for Airport Layover or Business", "helpfulness": 2, "user": "AJay1974", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 51074937}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This is a modern, clean, quiet hotel with the amenities you would expect for a hotel with this rating. It is about 10-15 minutes from Vancouver International and there is a free shuttle service that runs every half hour.", "title": "Good value, but average 3-star hotel", "user": "veeRob", "date": "November 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 50024887}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The rooms are very modern with comfortable beds and large bathrooms complete with granite counter tops. I was only here for one night but I cant really complain about anything.... it exceeded my expectations.", "title": "A good HI close to the airport", "user": "Swan_tim", "date": "November 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49937563}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Just completed a 5-night stay at the Holiday Inn a few days ago, and I was pretty pleased with our choice. We booked it through Priceline, so we only paid $50/night, which was the main reason we were pleased. The hotel itself was a standard 3-star hotel, and we actually had a couple of hiccups when we first checked in. First off, the first night they were out of king rooms, so my girlfriend and I had to stay in two beds. They fixed this the next day for us, though. Next, we had trouble originally requesting a fridge in the room, but we were able to get that sorted out as well. Parking wasn't free, but $5 was pretty reasonable. Only problem is there's not much near the hotel... there's a McDonald's in the parking lot, but anything else and you'd pretty much need a car. Unless it's not raining. Oh yeah, the biggest problem we had was with the Internet... they have free wifi, but it's pretty bad. It worked great at some points, and barely acceptable at other points. At least it was free, I guess.", "title": "Overall great stay and would return in the future!", "user": "Franklin M", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 47884554}], "location": {"country": "Canada", "city": "Richmond"}, "stars": 3, "variance": {"poor": 9, "average": 27, "very good": 88, "terrible": 2, "excellent": 109}, "aka": "Holiday Inn Vancouver Airport Hotel Richmond", "slim_ranking": 0.375, "description": "Closest Holiday Inn to the Vancouver Airport. Award-Winning Richmond, BC Hotel Offers Excellent Service For a comfortable stay in a well-appointed hotel, come visit the 100% nonsmoking Holiday Inn Vancouver Airport Hotel in Richmond, BC. Our hotel offers complimentary shuttle bus to the nearby Vancouver International Airport (YVR). Our hotel's location in Richmond puts you in close proximity to both Richmond and downtown Vancouver. Minutes away from the Riverport Sport and Entertainment complex. Spend the day exploring the historic Steveston fishing village, Richmond Centre, River Rock Casino, or head to Vancouver to see Gastown, Chinatown and the beautiful North Shore Mountains. If you're on business in Richmond, BC, our hotel's northern location will give you easy access to McKesson, BC Lotteries, MDSI, CSA Airport Executive Park, Crestwood Corporate Centre, Key West Business Park and the businesses around Vancouver Airport. Our hotel also has 1,900 sq. ft. of meeting space, a business centre and a separate business floor to meet your needs. With amenities like gated parking, our Fogg n' Sudds on-site restaurant and the fitness centre , we go beyond regular hotels near Vancouver to give you the comfort you deserve. Every room has free high-speed Internet access, an iPod clock radio, a cable TV, triple-sheeted bedding and a workspace, ergonomic chair and two-line phone. Our Vancouver Airport hotel's staff looks forward to welcoming you."}