{"user_rating": 4.0, "review_count": 348, "name": "Holiday Inn Hotel & Suites Indian Rocks Beach/Clearwater", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We use this hotel often to put out of town guests. The property as a whole is very different. A kind of resort but not really The bar almost always has music. Restaurant is good in a pinch but not great. If you are lucky to get a water view, it is very nice. You can't beat the marina or the tiki bar on a nice day.", "title": "Your experience depends on the room you get!", "helpfulness": 3, "user": "iconracrone", "date": "January 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149866688}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The basic rooms are very... Well.... Basic! They are very small and on the second floor the frontage of the nicer rooms that they call cottages. It depends on who has the \"cottage\" behind your room on the notice level and traffic. And also the noise level depends on how close you are to the band. The room has basic amenities and decor has very little imagination, cost or effort. More like a Days Inn type of room. But, it is clean. Very important. And I feel these rooms are over priced.", "title": "Nice Hotel But Noisy", "helpfulness": 2, "user": "JGB514094", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 148501679}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Now if you are one of the lucky ones to be upgraded to a \"cottage\" your experience will be much different. This is really a two story small apartment. The room is attached to the main building and NOT a cottage as the word suggests. You enter on the second floor of the hotel to the living quarters (behind the smaller rooms) with open 2 story high ceilings. A small kitchen, sitting area and dining area with the bedroom upstairs. With a nice view. Water view is spectacular but the parking lot view is still nice because of the sunsets over the Gulf of Mexico. Very comfortable but not plush. Decor is on the bottom of the scale and kind of cheep. I would really like to see a little \"plush\" in this space or maybe nicer carpet. When we had this room it was clean and the staff very nice.", "title": "A mixed bag", "helpfulness": 1, "user": "Tom C", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148354066}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "If you get a standard room I would recommend this property if you will not be in your room much. The entertainment, pool, tiki bar are nice. And a short 3 block walk to area restaurants and the beach for sunsets. Pool is very nice with an area for the kids to play. Adults will love the tiki bar where you can also order food.", "title": "Family Gathering", "helpfulness": 2, "user": "Isabelle_8", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147140152}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The bar is in the main building with all the tropical favorites and entertainment. It really adds to the property. The restaurant is ok. Service is good and food is good for what it is. Definitely adds to the property making it a full service property. There is no spa.", "title": "Great place to stay for Couples, Family or Business!", "helpfulness": 4, "user": "funlovers9", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147123165}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I brought my husband and 3-year old son to the hotel, and here is pros and cons about the hotel.", "title": "Great location, OK food, poor service, noisy room", "helpfulness": 1, "user": "Orlando_Travler", "date": "February 4, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 151378854}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "pros:", "title": "Great Location, comfortable bed, friendly staff", "helpfulness": 3, "user": "FranGalan", "date": "January 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 151133220}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The location is good. It is within walking distance to CVS, many local restaurants and the beach.", "title": "Awesome place:)", "helpfulness": 4, "user": "joa23", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150552363}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "cons:", "title": "Great stay", "helpfulness": 3, "user": "chubmasterp", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150452316}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel is a little bit noisy. I can hear the people upstairs walking, and I can hear the people walking in the hall way.", "title": "Excellent Hotel", "helpfulness": 5, "user": "jenbeba", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149883575}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We often visit the St. Pete's area of Florida as our grandfather lives in Seminole. We have stayed at this hotel now three different times and I just love it. Granted it's a bit on the Jimmy Buffet style ..... and the bar can be a bit active ..... but nevertheless it's comfortable and relaxing. The rooms are quite large and often have their own little kitchen. The hotel overlooks a river with a long porch that most rooms have a door to. We would often sit on on the porch overlooking the water.", "title": "Yes and Yes", "helpfulness": 1, "user": "bbjj0827", "date": "February 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152781131}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Granted that this isn't typically where I would stay on my own accord .... but it's really perfect for long weekend stays visiting family. We will be staying here quite often in future visits.", "title": "Great suites and comfortable rooms", "helpfulness": 2, "user": "Nova H", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152700402}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "We stayed here for 3 nights during the week to attend a family funeral. We needed to sleep 6 people and got a suite w 2 queen beds and a queen pull out sofa. The rooms were nicely decorated and the kitchen was very big! We had a beautiful view of the inter coastal and boats docked below. Parking was easy and nice to have in a covered garage since it was raining 2 of the days we were there! Unfortunately we didn't have an opportunity to eat at the restaurants or get in the pool (it was unseasonably cool and raining), but we have been before and love it!! A great hotel and we would definitely stay here again!", "title": "excellent", "helpfulness": 1, "user": "red4476", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152669642}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "stayed here for a couple days on business while on the water in a suite. the rooms were plenty big with full kitchen and everything was well layed out. there are numerous restaurants/bars within walking distance which is a plus. i'll definitely consider returning in the future.", "title": "Awesome Stay!!", "helpfulness": 3, "user": "Gina P", "date": "February 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151671615}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We are a family of 5 that stayed around Christmas time for 2 nights to visit family. We booked a suite that was very reasonably priced. It was a large divided room with a pull-out sofa and fully equipped kitchen with TV in one area that could be closed off to the bedroom which had 2 beds with TV, nice big bathroom with 2 sinks. The beds and pillows were very nice and I didn't wake up stiff!! The room was clean and the maid service did a nice job cleaning the room. The kids enjoyed the putt putt which was laid out nicely and if they held onto their ball could replay several times (the price included playing for 24 hrs if you wanted). We ate at the restaurant which was okay, we did have good service. The music was great the night we stayed to listen. The hotel is close to the beach and overlooks the marina with all the boats which is very scenic. The hotel also is all open with wooden boardwalks which gives a cute quaint look to it. There is a nice pool too but it was too cool that day to take advantage of it. We would definitely stay here again since we had great service, a very clean room, and it was priced right!!", "title": "Quirky and unique - we loved it!", "helpfulness": 5, "user": "DLCAlberta", "date": "February 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151507239}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Great location to Indian Rocks Beach, swimming pool, views of the water and boats, rooms clean and comfortable,. Ours had a refrigerator and coffee pot. There is a bar/restaurant on site and if you are a priority club member you get a for a free beer or wine. Booked at the early bird rate of $99 and when a week later it went down to the high $60's, was unable to change as I had been locked into the higher rate. Would not recommend booking early when it's not high season as the hotel was pretty empty. There are some other restaurants a short walking distance away so you aren't stuck with the on site fare. no pet policy so leave the little ones at home. iNo breakfast, continental or otherwise, provided but they do have coffee.", "title": "Great Holiday Inn", "helpfulness": 3, "user": "chicagotoots", "date": "December 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146724640}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My wife and I just held our wedding here two weeks ago and the hotel/venue/staff definitely exceeded our expectations. The location is probably the best part. You can walk just about anywhere you need to go. The beach (which is beautiful) is just four blocks away and there are several restaurants you can walk to as well. One side of the hotel is also right on the harbor and it makes for a beautiful sight at night. There is also a good restaurant/bar called Jimmy Guana's at the hotel with outside and inside seating. Very fun place with live music every night.", "title": "Great spot for Weddings/Family Outings", "helpfulness": 4, "user": "Andrew S", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146404837}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "What makes the hotel unique is the fact that when you walk out of any room you are outside. A roof covers everything, but it makes for a very open layout. On the first floor, you can literally watch people play mini-golf just a few feet outside right outside your window (if that might bother you, just get a room on the second or third floor).", "title": "fun hotel for families", "helpfulness": 3, "user": "billybab1", "date": "November 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 146326613}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The mini-golf course is great. My family had a whole tournament and had a blast. It's actually a pretty tricky course.", "title": "QUIRKY HOTEL", "helpfulness": 6, "user": "davref", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145304320}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "It costs a little more, but I would recommend getting a suite on the third floor. They have a ton of space and great balconies right off the harbor.", "title": "Hidden Gem", "helpfulness": 5, "user": "eds1956", "date": "November 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144997293}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "We booked into this hotel after 10 days in Orlando. We hoped to have a quiet few days - close to the beach - and expected the usual high standards that we have had in other US hotels. First problem was the room. It was a bit tatty - tired but bearable. Problem was the noise! The hotel had allowed a party of women to stay in the adjoining room (4 in one room). They were joined by another 4 for drinks in the evening and then by a couple of men who were out for a conquest. Their very noisy 'party' continued until 4am - security did nothing. Also they all smoked outside their room and our room stank. Then there is the swing bridge nearby. All night you hear a constant thud as traffic cross it. Thirdly, the aircon units are ridiculously loud. All in all we had no sleep. I'm much travelled and can usually sleep anywher - this place was the worst. I complained the next day and was told that I had to give a days notice to quit the hotel. The staff were quite rude about it. We gave notice that we would quit and stayed the next night. Next day we checked out and were told that we'd have to pay for the full stay because they have another policy of 21 days cancellation! Again the staff were very rude and arrogant but eventually I left without paying for more than 2 nights. We moved to a Marriott hotel in Clearwater which was brilliant. Another thing about the Holiday Inn - the beach is not a 'few steps away' - it's more like 1/2 mile. The swimming pool water stank! Do yourselves a favour and stay somewhere else. I stayed there because of the reviews on this website - big mistake - reckon the hotel must write half of them. Dave.", "title": "Noisy, poor service.", "helpfulness": 3, "user": "gabsterUK", "date": "July 8, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3647928}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "Read the reviews and thought great option for taking my mother and nephew. Little did I realize that I would end up paying extra because the front desk staff gave me an upgraded room, indicated there would be no charge and refused to recognize their error. I would like to recommend to all that if your considering this hotel look elsewhere. The hotel is loud, food expensive and not great, the walk to the beach is over a busy road, pool very cold, and a room with a view is the parking lot. There are plenty of other options in the area.", "title": "Taken for an expensive Ride", "helpfulness": 4, "user": "kimber2525", "date": "May 3, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3435218}], "location": {"country": "United States", "city": "Indian Rocks Beach"}, "stars": 3, "variance": {"poor": 24, "average": 40, "very good": 124, "terrible": 31, "excellent": 129}, "aka": "Holiday Inn Hotel And Suites Indian Rocks Beach/Clearwater", "slim_ranking": 0.75, "description": "Welcome to the Holiday Inn Hotel & Suites Clearwater Beach South where the fun never sets!Our Intracoastal waterfront location is just steps away from white sandy beaches and the Gulf of Mexico, and minutes away from St. Petersburg/Clearwater Airport (PIE), and Tampa International Airport (TPA). On 15 tropical acres, your perfect location for your next family vacation, business meeting or social gathering. Enjoy playing volleyball on sandy courts. Take a dip in our spectacular 3,000 square ft. free-form heated pool with cascading waterfall and majestic pirate ship. Enjoy our fitness center, game room or experience fun in the sun when you visit our 50-slip marina with boat rentals, chartered fishing and dolphin watch expeditions. Relax in your own tropical Islander Guest Room, Key West Studio with kitchenette, 1 BR Condo Suite with separate living area, or your 1,200 square foot two-story Villa with in-room Jacuzzi. Enjoy a great meal at Jimmy Guana's Waterfront Restaurant serving breakfast, lunch and dinner daily, or unwind with our nightly drink specials and live entertainment. Planning a meeting, our Key West Conference Center is the perfect location with over 4,000 sq ft of flexible meeting space. The Holiday Inn Harbourside is everything you expect and much more."}