{"user_rating": 3.5, "review_count": 1075, "name": "Holiday Inn London - Regent's Park", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We got a great deal for this hotel on Expedia, and chose it mostly for its location: just a few blocks from Regent's Park for jogging, very quiet street, near 3 different subway stops that take you anywhere, and only one block from Villandry, a superb gourmet food store, bakery, and restaurant. We went there for breakfast every day (much cheaper than in hotel) and to get provisions for the plane ride home (pastries, breads, etc.) Anyway, the hotel is very new inside, the staff very helpful, and our room was very spacious for London. The bathroom was fine although the water pressure left something to be desired. Overall, I'd stay here again and again because of the reasonable price and the nice location. Do be aware that the nearest subway stop, Great Portland St., closes fairly early at night.", "title": "Great hotel in a great location", "user": "pepoling", "date": "February 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4446714}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Both husband and I are regular visitors to London, and we have stayed at this hotel on several occasions. The hotel is in a excellent location being only minutes away from a tube station. The hotel is clean and the staff are friendly. This is a great place to stay for anyone who is looking to book a reasonably priced hotel.", "title": "Great Location", "user": "ellybell", "date": "January 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4332109}, {"rating": 4.0, "title": "Good hotel", "text": "We booked this hotel through a package on Priceline and were very pleased. We requested a renovated room, and while it was small (by American standards), it was very clean and comfortable. The location is excellent and is literally a 2 minute walk from 2 tube stops (Portland Street and Regent's Park), however, we rarely took the tube to those stops and opted for Oxford Circus instead (which is more central and is also only a 10 minute walk). Travelers should note that the area around this hotel is VERY sleepy. I.e. there is very little to no street or foot traffic when we would leave in the morning and return at night. However, the neighborhood is quite nice and is well situated and safe. The only downside that we experienced was the concierge was not so helpful or knowledgeable - 2 examples: 1) when asked where to go for breakfast he recommended Starbucks. When we said we wanted a place with hot breakfast he had no recommendations (incidentally, Villandry around the corner is very nice as is Cafe Meze next to the Great Portland Street tube stop); 2) when we booked the Original Tour Bus with the Concierge he gave us incorrect information as to where to pick up the bus. Still. overall a good hotel and we would stay here again.", "user": "A TripAdvisor user", "date": "January 5, 2006", "id": 4327441}, {"rating": 2.0, "title": "Things Go Bump In the Night", "text": "I stayed here because everything else was filled up. The heat didn't work, and after fruitless discussions with the desk clerk I went out and bought a small electric heater, then demanded the hotel reduce my bill by the cost (about $30). There were noticeable clanking, banging, and thudding noises 24 hours a day: I guess because it's a '70's vintage concrete UK building and all the mechanical noises like elevators etc. resonate throughout. The hallways are really the worse for wear, and the rooms were pretty small. The whole thing felt claustrophobic to me. The rates were graciously jacked up to around $300 per night because of the tight availability--I wonder why all the other Holiday Inns were filled but this one still had availability? I usually stay the the Holiday Inn at King's Cross, which is much nicer. The only advantage to the Regent's Park is its proximity to lots of things, but I will never stay there again. The whole thing felt second-rate for first-rate prices.", "user": "A TripAdvisor user", "date": "January 3, 2006", "id": 4321601}, {"rating": 4.0, "title": "We love our stay at this fine hotel!", "text": "When we booked this hotel, we expected it to be a decent hotel for a very good price. Wow...we were very happily surprised by how nice this hotel turned out to be. The rooms were modern, clean and a nice size for a London hotel room. The location was very close to the Underground and within walking distance to great shopping including Oxford Street. The staff was pleasant and our room was very quiet and very comfortable. I would stay there again in a second.", "user": "A TripAdvisor user", "date": "January 2, 2006", "id": 4318350}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Stayed here for one night due to working late. Hotel was clean, nice and simple. Check in was simple and straightforward. Room was okay size, but modern and very clean. Bathroom was clean, the shower was really good. No parking at the hotel but there is a NCP National Car Park next door. Its a vry good location as its just off Great Portland street. Great Portland Street station i sjsut about 3 minutes walk. Oxford Circus is about 7 minutes walk to the south. Marylebone Village and Marylebone High St is about 10 minutes walk away. There are lots of restaurants on Great Portland Street, Titchfield Street. Foley street is called the village with all restaurants bars, cafes and pubs also nearby.", "title": "Good for the purpose", "helpfulness": 1, "user": "Jessica", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147625860}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "An excellent place to stay. Friendly and helpful staff, good choice at breakfast, could maybe do with more choice for evening meals but could still find something for everyone.", "title": "Good value for money", "helpfulness": 1, "user": "M0nkey01", "date": "December 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147536330}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Rooms were clean and had everything you need.", "title": "Always a good stay", "helpfulness": 1, "user": "michellep459", "date": "December 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147195300}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Hotel was in ideal location, 10 minute walk from Oxford Street for shopping so not in centre and noisy but able to get to everything quickly. There was also a Sainsburys on the corner for anything urgent you needed/ forgot.", "title": "decent hotel", "helpfulness": 3, "user": "PMACCA", "date": "December 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 147156744}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Be careful if choosing to drive as although there is parking 'onsite' this doesnt belong to hotel and there is a charge. Though hotel does offer duscount to guests at end of your stay.", "title": "Ripped off!", "user": "magoo29272", "date": "December 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 147085124}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "A group of us had 3 rooms at the Holiday Inn recently - the location was great. It's only a short walk to Regents Park where they often have open air entertainment (a champagne tent was there when we arrived...heaven!), and not far from Oxford Street, Chinatown, and lots of reasonable pubs.", "title": "Location Location Location", "user": "polarbear", "date": "August 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3791744}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The hotel itself was ok - rooms were pretty small but clean. Our only complaint was that the walls seemed thin and we could hear the people in the next room - one of which was coughing all night long, which did spoil our sleep somewhat. Our friends were also woken very early in the morning by people talking loudly in the corridor - this hotel obviously isn't too great for soundproofing!", "title": "Great Hotel, Good Location - will definitely be back!!!!", "user": "liztheblondeone", "date": "August 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3731713}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I was pleasantly surprised. I enjoyed four nights here. Holiday Inn is a tarnished brand, IMO, in the US, but this place is pretty nice.", "title": "Wonderful", "user": "34isit", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 79978381}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Pros:", "title": "good central location", "helpfulness": 3, "user": "Bluemountain69", "date": "September 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 79962457}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Early check-in!!! Very nice after a long flight. Thank you H.I.", "title": "Straight 'C' pass", "user": "bellytubby", "date": "September 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 79877505}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Staff was top notch, very clean, secure lobby", "title": "Good location - hotel standard Holiday Inn", "user": "worthingwanderer", "date": "September 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 79508259}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "On a quiet street, in a safe neighborhood, pleasant area.", "title": "Not bad hotel, but this one ugly hotel to look at", "user": "pjkeay", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 79431930}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "My daughter and I were on a theatre break weekend organised by Omega holidays. The hotel was very clean and the full english breakfast was excellent. Our room was comfortable but the bathroom, although adequate, was small. ALL the staff were very helpful and we were able to leave our bags with the Concierge after check-out until we were ready to travel home. The location was good, a five minute walk from a tube station and in a quiet area. Near to Regent's Park and within walking distance of Euston station (approx 15min walk) if you haven't got too much luggage.", "title": "Clean, comfortable, excellent breakfast, good value!", "helpfulness": 1, "user": "jdharry", "date": "September 6, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 78434659}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "I had a superb time when i stayed here. The rooms were clean and spacious, as was the main reception area. The breakfast was the BEST buffet breakfast i have ever had. We had a good laugh with the staff and fellow guests", "title": "Great hotel in a superb location", "helpfulness": 1, "user": "DansTours", "date": "September 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77942019}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Oxford street is a short walk away for those interested in shopping. A pub around the corner called the green man is also worth checking out for food and refreshments.", "title": "Great location, good clean hotel", "helpfulness": 1, "user": "pandrEngland", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76686375}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Would stay again for sure.", "title": "Tidy and great location", "helpfulness": 1, "user": "vashka0310", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 75516334}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We stayed at the holiday inn on 13/14 August.", "title": "Nice Hotel spoilt by unhelpful reception staff", "user": "gareth_999", "date": "August 6, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 74065630}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "In London over the weekend with friends & stayed here due it's great location. Tube station, Great Portland Street, is less than 2 minutes walk away and being on the Circle Line means that most places of interest are literally within easy reach.", "title": "Excellent location, very comfortable & hot breakfast!", "helpfulness": 1, "user": "Steve D", "date": "December 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147072807}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "Rooms are clean and tidy, bed comfortable. Only criticism would be that the rooms are on the small side. We were in an Executive room.", "title": "Wouldn't come Again...small, stuffy noisy rooms. Didn't sleep because every noise was heard...coughing neighbour all night. My w", "user": "Kellyjjj", "date": "December 9, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 147041939}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Another bonus is the breakfast. £13 each is a little expensive but food was hot and very tasty.", "title": "Great Stay!", "helpfulness": 1, "user": "ClaireJayneJ", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146841834}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Whether my stay was ruined by being surrounded by noisy disrespectful guests I don't know?? Surely their rooms were the same as mine...people would walk down corridors on a Sunday morning chatting at 7.30 wheeling their cases. All heard. The door has a gap under it. The toilet doors are fire doors, if the person next to me shut the door it would have been better but they left it to slam...overall I'm tired and grumpy and need to go home to bed! Had a great night out in London for my 30th birthday but hotel ruined my shopping trip the Sunday as I just went home to peace! I have a better lie in at home with two children than this noisy hotel.", "title": "Terrible value", "helpfulness": 1, "user": "Robbert B", "date": "December 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 146775181}, {"rating": 3.0, "title": "Good result", "text": "Great Holiday Inn. Upon arrival we were greated by Dana who was extremely friendly and helpful. We were also extremely happy that we had been upgraded to an executive suite free of charge. In terms of the room, it was spotless, provided good tea making facilities and even had a variety of magazines, a dressing gown and slippers which we thought was a very nice touch. The bar staff were also very friendly and even changed the tv channel in the bar area for us as we didn't want to watch the news. Nothing seemed like too much bother for the staff and they were all so friendly. In terms of location the hotel was great as it was just near Great Portland Street Station. We had a great stay and will definitely be recommending the hotel to others. Thank you for a wonderful stay and keep up the good work!", "helpfulness": 1, "user": "Ali0763", "date": "December 2, 2012", "id": 146611424}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed here for one night with a large group of people. When the keycards of our room wouldn't work we got a new room within the next 10 minutes!", "title": "The hotel staff deserves all the praise they get", "helpfulness": 1, "user": "JJulie_88", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148364889}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Everyone was very friendly and extremely helpful.", "title": "Holiday Inn London Regent's Park", "helpfulness": 1, "user": "Judith C", "date": "December 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 147823662}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Great location, comfortable and clean rooms.", "title": "Expensive Wifi but friendly and efficient", "helpfulness": 1, "user": "Neil D", "date": "December 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 147776268}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I would certainly recommend this hotel to friends and family.", "title": "Small Rooms but Otherwise Excellent", "helpfulness": 1, "user": "traveller_72", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 147767969}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed here for 10 days on vacation. On arrival our greeting by the receptionist was less than welcoming. (we are Holiday Inn Priority Club members) Perhaps it was a bad day for her but still no excuse for the way we were treated. The rest of the staff were so friendly and accommodating and the concierge were more than helpful. Our room was basic but adequate. Well positioned but average Hotel. The breakfast was outstanding with a good selection for people with Gluten Intolerance. Gluten Free toast available on request. Supermarket over the road from Hotel. Walking distance to Great Portland Street Underground and 15 minute walk to Euston Main Train Station.", "title": "Andre Rieu Concert", "user": "old-relic", "date": "December 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147628362}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Stayed at this hotel for one night in December 2012 as our work Christmas party was being held in the function room downstairs. The hotel was therefore in the best location imaginable (staggering distance) but from a less drunken perspective was also in a good location for work (5 minute walk away) and also for the tube had I been going home.", "title": "Great hotel for what we wanted", "helpfulness": 1, "user": "kathrynjc", "date": "January 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149086548}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The room itself was nice, very clean and well appointed. The bathroom was huge but this was mainly because the room was for three of us so they put us in a disabled room. Had good amenities such as mini-bar, tea/coffee and slippers which all adds to the excitement. The food provided for the Christmas party was exceptional. The breakfast next morning was wonderful as it is buffet-style so you can choose exactly what you have from the hot selection. Was lovely and the staff were very friendly and speedy. I do think it is a poor show however that the croissants were stale. I am not that fussy, especially when hungover, but couldn't eat them.", "title": "another good visit", "helpfulness": 1, "user": "julie l", "date": "January 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148954631}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Overall our stay was great and I would certainly consider the hotel again if I were staying in the London. The lobby area has a great cosmopolitan feel and there are plenty of pubs and restaurants nearby (The Albany round the corner opposite Great Portland Street tube is great or the wonderful Riding House Cafe is a five minute walk away). Would have given this place a better score if I had been staying here more for leisure and if the croissants were fresh but other than that don't be put off.", "title": "GOOD LOCATION", "helpfulness": 1, "user": "LindaEastYorkshire", "date": "January 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 148770887}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "this is our third visit in a row and we always have a good time. The hotel is a great location to get around London with Oxford Street a ten minute walk away and various tube stations easily accessable.", "title": "Exactly what is says on the tin...", "helpfulness": 1, "user": "MattScot", "date": "January 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 148672755}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Breakfast offers a good choice for all with the hot buffet style traditional breakfast to a good selection of pastries, fruit and yoghurts. We don't eat in the restuarant on an evening as there are so many good places to eat in london. Not sure how busy it gets.", "title": "Great Value, location and staff", "helpfulness": 6, "user": "Martin D", "date": "December 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 148422110}, {"rating": 5.0, "title": "Beautiful and Cheap Hotel in London", "text": "Stayed Dec. 30 to Jan. 3, 2006. Celebrated New Year in London. Beautiful hotel and a very cheap one. The breakfast is excellent. I'm currently writing this review in my room. I did not expect to find a cheap hotel in central London considering all other hotels are at 200 pounds range, meaning 400 Us dollars a night. I got a rate of only 170 US a night. a bargain. London is very expensive so it would be a steal if you could find a decent place to stay, a warm and comfortable accommodation in winter.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4315995}, {"rating": 4.0, "title": "Practical, convenient business orientated.", "text": "As many other reviewers have said this is a well situated easily accessible functional hotel with good public transport links that is ideal for the business traveller but perhaps a little souless and bland for those wanting a more romantic experience. The rooms are a trifle claustrophobic but are fully equipped and the housekeeping standards appear high. Reception/concierge staff are pleasant and knowledgeable. Breakfast is perfectly adequate but steer clear of the Hotel restaurant - there are several good Mediterranean/ Greek/ Indian eateries of good standard and reasonably priced within spitting distance. There is an attached Conference facility which makes for a busy lobby most of the time. Having stayed here a few times recently the room uptake rate seems high so you will be lucky to get a reduced cost deal.", "helpfulness": 5, "user": "Clarissa_Firebucket", "date": "March 29, 2006", "id": 4773192}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "I stayed in the Holiday Inn Regents Park on a brief stopover in London.", "title": "Well located but \"compact\"", "helpfulness": 4, "user": "David_mc", "date": "March 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4739426}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "The hotel is well situated, convenient for shopping and nightlife, close to a tube station, but still quiet due to its location on a residential side street.", "title": "Small rooms are OK if in the right location", "helpfulness": 19, "user": "ARegularVacationer", "date": "March 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4721878}, {"rating": 4.0, "title": "Clean and comfortable", "text": "The bedrooms were adequate: a little cramped, but well furnished, standard business hotel facilities - everything you need but somewhat unimaginative.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 10, 2006", "id": 4450127}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Really quite worried by some of the reviews here so we were pleasantly surprised that not only did we have no problems we actually enjoyed our 2 night stay. Every member of staff we dealt with was polite, smiley and friendly. The standard room we booked was spotlessly clean. We found no problem with the size at all! True it wasn't palatial but we have been in many much smaller rooms. There was no traffic noise during the night, the air con worked well and the bed was the more comfortable than home!", "title": "No problems at all", "user": "Janboo", "date": "August 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 73233381}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "If I had to pick fault I could say that the TV could have been updated with more channels; I would have liked a few more hangers; and breakfast was too expensive - but that is it.", "title": "It's a Holiday Inn in a Spectacular Neighborhood", "helpfulness": 1, "user": "2008travellover", "date": "July 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 72102422}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "It's the location that saves this place. They won't make promises about the size or number of beds in your reservation. The constricted rooms and corridor dimensions are very reminiscent of a cruise ship. And any smoker who passes their time in the front drive can see there's a lively bit of prostitution being done in the hotel many evenings, though it's discreet and one may have to know what they're looking at to recognize the meetings and meet-ups taking place. It's NOT as though street walkers are discomfitting the families passing by.", "title": "surprisingly spacious and well turned out rooms", "helpfulness": 1, "user": "lizandtone", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72021813}, {"rating": 1.0, "stay_parameters": "Stayed July 2010", "text": "The rooms are small, but otherwise perfectly nice. We had a waiter in the restaurant two nights running who was endearingly incompetent. The staff was generally friendly and willing to help.", "title": "Extremely rude staff.", "user": "jordan447", "date": "July 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 71166637}, {"rating": 3.0, "stay_parameters": "Stayed April 2010", "text": "The hotel's room rates are very high for the level of service and amenities provided, but I imagine it's the neighborhood that accounts for that. It's a very posh area, and near some glorious restaurants on Charlotte Street in one direction, and Great Portland in the other.", "title": "Great Location, Nice Hotel, Teeny-Tiny Rooms", "user": "Kula762", "date": "July 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 70220157}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "we stay in various Holiday Inns for leisure across the country and this is one of the better ones. The staff are friendly and helpful, the lounge/bar cosy and comfortable and very modern decor leather seats etc. like lots of Holiday Inns in the UK. Breakfast great like all Holiday Inns. One thing is the rooms - theyre spotless and clean all the three times weve stayed in here and have all the facilities you expect, comfy beds, duvet etc. the reason for why the previous reviewer said about some rooms being tired tho is that some floors were given a total makeover a couple of years ago I think and are very contemporary and stylish and look new and everything, I think theyre the 3rd and 5th, last time we stayed there, and some floors look contemporary and v.modern but are a bit more tired cos they were refurbished a couple years previous when it was a posthouse but theyre modern too, and then a couple of floors (like the photos on here) are a bit older. For all I know though they may refurb these rooms by the time you go and one thing in this hotel - is the high standards of cleanliness and maintence is good. The rooms are very comfortable.", "title": "Lovely hotel", "helpfulness": 3, "user": "kitty1960", "date": "December 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4280132}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Worst hotel experience I have had for years. Corporate pre-paid booking, yet staff had mixed up our reservations and tried to charge us again. 25 minutes at the check-in desk trying to sort out the mess and the duty manager was the rudest I have ever experienced. He hid in the back room whilst I made calls to the travel company to reconfirm booking. When I offered my phone to him to speak to the travel company, he refused and retreated to his office. Extremely disappointed when I eventually got my room key. Carpets and in particular the walls in the corridors were shabby and uninviting. Room was very small with overly soft pillows. Overall, this place is stuck in the 70s and needs a major facelift. And a new duty manager!", "title": "Never again", "user": "pathughes2", "date": "July 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 70069029}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The room was tiny, but very clean. The bed was fairly comfortable, but it did tilt to the center, so my husband and I rolled toward each other. There were many businessmen staying here, so it was very quiet. The room itself was freshly painted, but there was a whole in the curtain. The TV was one of the old boxy sorts. The luggage rack was in bad need of repair.", "title": "Clean, but needs refurbishing", "user": "sacagewea", "date": "July 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 69996475}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The hallways gave a poor impression since there was an area where there were some holes. The fire extinguishers were the prominent display. No decoration.", "title": "Lovely .", "user": "Tullagirl", "date": "July 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69601036}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The bathroom had very old sink hardware - almost rusty looking; definitely not shiny. The tub did not drain properly, so I was standing in ankle deep water, even after a short shower. The tiny hair dryer I finally found attached in a desk drawer. The button had to be held down while drying the hair in order for it to work.", "title": "excellent hotel", "helpfulness": 1, "user": "yvonne34", "date": "June 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 68362543}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "In order to print the boarding pass, I had to email my document to the front desk. There was a 2-computer work desk in the lobby (don't know the price, but there was a fee), but no printer.", "title": "Looking for Hospitality- Impressive & decent one to stay on...", "helpfulness": 4, "user": "tulipy_05", "date": "June 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 67965132}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 83, "average": 258, "very good": 502, "terrible": 36, "excellent": 196}, "aka": "Holiday Inn London - Regent`s Park Hotel", "slim_ranking": 0.382899628253, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Holiday Inn London Regent's Park hotel is ideally located near main attractions including Madame Tussauds and London Zoo, a short stroll to Lord's Cricket Ground, and the green open spaces of Regent's Park. We are also one of the most convenient central London Hotel's to Wembley Stadium via National Rail. The Holiday Inn is also very close to the famous shopping districts of Oxford Street and Regent Street. The hotel is easily accessible if travelling from Paddington, Euston or the Eurostar at Kings Cross St Pancras International Station. Leave your car in our NCP managed car park beneath the hotel as we are located just a 1 minute walk from the closest tube station which is Great Portland Street on the Circle, Metropolitan and Hammersmith & City Tube Lines. Also in very close proximity are the Victoria, Northern, Jubilee and Bakerloo Tube Lines. This makes exploring London's top attractions easy and convenient. Should you wish to enjoy comfort dining without leaving the hotel, our Junction Restaurant is a modern and contemporary eatery with both the individual traveller and families in mind. The Holiday Inn Regent's Park Junction Restaurant offers a wide range of menus, including an A la Carte and Table d’hote option as well as a pre theatre menu, and serves a variety of traditional and more international dishes. You will find a mouth-watering meal for every taste. The bar at London Regent's Park hotel has an extensive wine list and a full range of local, international beers and spirits which provides our guests with a great choice. Light meals and snacks are also served all day in the bar until 10.30 pm, and the bar is always open until late for guests staying in the hotel. All of the hotel's 332 rooms, made up of 264 Standard bedrooms and 68 Executive bedrooms which are allocated to our dedicated Executive floor, are double-glazed to help you enjoy a great night’s sleep. You will never be short of entertainment with our new state of the art TV system which has been installed throughout the hotel. The user-friendly interactive system gives access to the latest films before they are available on DVD/Blu-Ray and home Pay-TV. You can also enjoy 31 free-to air channels, 13 Radio stations as well as cartoons, favourite TV series, sit-coms and sports programs. For your central London accommodation whether it's for a short break, a long weekend or if you are in London for business, the Holiday Inn Regent's Park is a perfect place to stay. Our hotel is near the Eurostar International Terminal at Kings Cross St Pancras station - a major UK railway station located in Central London. St Pancras station has many facilities including shops, places to eat and drink and a daily farmers’ market. Hop on the Eurostar and enjoy a smooth comfortable journey to Paris, Brussels and Lille. It’s just an easy walk from the Regent's Park Hotel to London’s Theatres, including the London Palladium and Dominion, the shopping mecca of Oxford Street and Regent Street, and London's top attractions such as London Zoo, Madame Tussauds, London Eye, Buckingham Palace, the British War Museum and Hyde Park."}