{"user_rating": 4.0, "review_count": 128, "name": "Holiday Inn Express @ Williamsburg Square, State College", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "This hotel is located in an area of shops, restaurants, and hotels convenient to Interstate 99 and Penn State’s main campus. The rooms are spacious and the hotel provides a fairly nice complimentary breakfast bar. My recent stay here would have been great if it were not for two housekeeping/maintenance issues the otherwise spoiled my stay. There was a second sink located out of the bathroom in the main room. The coffee maker was situated on the sinks counter. When I went to use the sink, I noticed that the drain stopper was closed. I opened the drain and started to run water and was immediately hit with a blast of pungent mildew odor coming from the drain. I ran the water for a while but the smell did not go away so I closed the drain and did not use the sink again. The second housekeeping issue was the bathroom floor. It did not look clean and as you can see by the attached photos the grout is white under the sink and in the edges of the room but black in the middle of the floor. The floor really could use a through scrubbing.", "title": "Nice hotel but beginning to show housekeeping issues", "user": "Steeler_Pens_fan", "date": "December 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 187177024}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "My teenage son and I recently were looking to stay in State College for a football weekend (fans of the visiting team). Prices were extremely high, so we used Hotwire and kept our fingers crossed. Our hotel was the Holiday Inn Express outside of State College, at about half the going price for a football weekend. We found the hotel, staff and even the guests very welcoming. The room was clean and beds comfortable. The location was very good - easy to find off of main highways, ample parking, close to several chain restaurants, including a Cracker Barrel. The hotel breakfast was essentially cereal and sweet rolls, and better than average. We took advantage of a shuttle to Beaver Stadium with a stop less than 1/4 mile from the hotel, which was definitely the way to go to avoid parking hassles, etc. All in all, a very positive experience, and I would not only recommend the hotel but would stay there again.", "title": "Nice choice", "user": "guswho1", "date": "November 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186205383}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "Great location, great main facilities, great room layout but the sheets were like starch filled sandpaper and two doubles in a room that big, cmon folks its 2013 the queen size bed does exist for nearly the same cost.", "title": "Great location and facilities but...", "user": "pizboin", "date": "November 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 185730960}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "My overnight stay at the Holiday Inn Express was very accommodating. Employees helpful and rooms clean. Like the outside of bathroom sink but did miss the refrigerator. Great hotel for the value! Great access to good shops and restaurants!", "title": "Business trip to State College", "user": "bookrep87", "date": "November 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184737864}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This was a great site for our conference!! It was convenient and easy to get to! There were a couple restaurant options close which was nice as well. Can't beat free breakfast (and it was really good!)", "title": "great conference site", "user": "aysenu", "date": "November 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 184466557}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "When I walked into this hotel \"opulent\" was the only word I could think of to describe the lobby and breakfast area. Absolutely gorgeous! The man that checked my mom and I in was extremely friendly and nice! I believe his name was Alex. We got upto the room and it was also very nice. I work at an IHG hotel and therefore wasnt overly upset when we had problems in the room. If anything I kept thinking thankfully it was me and not someone else who would get really upset. My mom and I had several problems which we told the Front Desk Clerk and he kept apologizing and I said \"Im just glad it happened to me and not someone else\" My mom didnt feel the same but she got over it. ;o) The Front Desk Clerk said he would let a supervisor know of the problems and to let him know if we have any other problems.", "title": "Excellent Hotel!", "user": "Tracy H", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150347710}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "Despite the problems we both enjoyed our stay and will be returning next month. The location of the hotel is ideal with lots of shopping and restaurants closeby.", "title": "Great Price, Decent place", "user": "latebrake54", "date": "January 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 150136395}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "We stayed at the Holiday Inn Express during a trip to Penn State for a college audition. We reserved two doubles but when we got there,we were informed that we had been \"upgraded\" to a King with pullout sofa. I had seen them for the same price when I made the reservation so I know it was not really an upgrade. They had at least 2 high school groups there and needed the doubles. But, it was not that big of a deal.", "title": "Great stay!", "user": "NinjaMom82", "date": "December 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148360447}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The hotel on tbe outside was beautiful. The hallways and rooms were nice and reasonably clean.The beds were ok but the pillows were not the greatest. My biggest complaint was breakfast. They were obviously not prepared for the school groups. No sausage and the eggs were cold and runny. Many other items were out. That being said, I have travelled with school groups and know it can be challenging.", "title": "Super comfortable", "user": "James M", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144727514}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "For the price we paid, it was a decent value.", "title": "Convenient to Penn State campus", "user": "junkdon", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 144424742}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "From appearances this seems like a really nice hotel. Outside and interior are very nice, clean and mostly colonial in appearance. My issues with this hotel are:", "title": "Nice looking hotel BUT..........", "user": "RofoBeth", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 158488009}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "DOUBLE BEDS! These seem very out of place since the rooms are quite large and could easily accomodate Queen size beds.", "title": "Good Choice", "user": "Chris L", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158068366}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Refrigerators and microwaves are NOT standard in the rooms. Again, these rooms are very big and have a lot of \"empty wall space\". Since this is a college town and a lot of money is made during events at the school and for athletic events refrigerators should be standard. They say they are available on first come first serve but we couldn't get anything (including a rollaway).", "title": "Good, Could Have Been Greater", "user": "kapjdp", "date": "April 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157045759}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hotel looks nice but lacks certain comforts that we enjoy and that are offerred at many of the State College hotels.", "title": "Really nice place to stay; close to PSU & nearby attractions.", "user": "Lovetotravel001_9", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 156891599}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Stayed here for two nights and it was a nice experience. Room was clean, and well lit, bed was comfortable, as was the chair they provided. Internet was strong and did not drop out. Breakfast was expansive with multiple hot choices. Staff was friendly and helpful. Will be back", "title": "nice accomodations, convenient location", "user": "Boomerang025", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155710115}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Pros: Easy location right off freeway, plenty of well-lite parking, dinner choices to walk to, clean room and common areas, large well-kept breakfast area, very nice walk-in shower, comfortable bed and pillows, large TV, and fast WIFI. Room also had an extra sink area outside of bathroom – perfect to use for the coffee maker, to set-up a bar, and to give another person a mirror/sink to get ready. They also solved one of my pet-peeves of not having electrical plugs at the bedside; they had a single lamp bedside with two plugs built in (see pics). Other hotels – take note!", "title": "Just what I hope for at HIE!", "user": "MIRay", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167708079}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Cons: Did not greet me as a Priority Club member and there was no refrigerator in room.", "title": "great place to spend a night", "user": "hockeymum11", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167041196}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "stayed here on a driving trip around Pennsylvania. The hotel is very conveniently located near the highway and close to shops and restaurants, it is very clean and well cared for and quite new in appearance. We had been booked at another hotel but we sent here due to overbooking and although we were disappointed that we were not able to stay at the resort we had planned to, we were very happy with this as the alternative.", "title": "Nice Overnight", "helpfulness": 1, "user": "charleygop", "date": "May 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 161030916}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "From the moment we checked in we received excellent service, special mention to Angelica on the front desk who was so polite and helpful and her professionalism and personality was certainly appreciated after the situation we had found ourselves in.", "title": "A Pleasent Stay", "user": "Steve A", "date": "May 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161023680}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Our room was very clean and modern and despite being surrounded by parking lots we heard nothing, the beds were very comfortable, and overall it was a very quiet and restful night.", "title": "Up to date convenient facility", "user": "Jeanette D", "date": "May 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160362061}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We were just staying one night because it was close to where our daughter had a volleyball tournament. The rooms were clean, the continental breakfast was good and the service was pleasant and accommodating. I would stay here again and recommend it to other travelers. We arrived around 10PM on a Friday and left out early Saturday morning so we didn't get a chance to use any of the facilities. So I can really rate anything else. I will say that about two weeks later we stayed at a Comfort Inn in Blairsville, PA and this place put the Comfort Inn to shame.", "title": "Nice Place", "user": "pefinpa", "date": "March 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155689400}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Our family recently stayed at the Holiay Inn Express in State College, PA. Although we only stayed one night (4 rooms), we we treated like we stayed there every weekend. Felica, the front desk person was extremely helpful. We called the night before to ask for the 4 rooms to be together, Felica took the time to make sure that this happened. She also made sure we had everything we needed. Special thanks also goes out to Linda, the breakfast person. She was extremely helpful and friendly. She went out of her way to ask the kids if everything was good and what else she could do for them. We will certainly stay at this facility in the future.", "title": "Excellent Service", "user": "Margaret D", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154352283}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This hotel offered clean rooms, nice amenities. The staff was helpful and courteous from reservations, front desk and house keeping. They provide coffee and tea 24/7. The breakfast was plentiful. The location was good to near by restaurants, such as Outback, Olive Garden, Texas Road House, and Cracker barrel. There is shopping not far away either. Also close to the stadium and the BJC. So", "title": "Best around!", "user": "Paula G", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153182662}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Just a few weeks ago I stayed at the Holiday Inn Express. What can I say? It was great!! I have never used this site before until the staff told me about it. First off the property is beautiful, I was surprised it was an express. The beds were comfy, made my night sleep very relaxing! The staff is Amazing, Kimberly was very informative and was fast. I was asking her so many questions about the area, I thought I was bugging her! She listened to all my needs and put me in I would say looked like one of your best rooms. Allen was also great, I couldn't imagine working those hours. I couldn't sleep and decided to come down stairs to get some of the things I forgot in the middle of the night. He was friendly, and was able to get me everything I needed. Breakfast was good, enjoyed all the hot food! I will be staying here again when I am here to visit family. I enjoyed my stay. Everyone should stay here!", "title": "Great Stay!", "user": "John E", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151016123}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Quick check-in, polite staff, clean well stocked room, plenty of close parking, comfortable, easy check-out. I didn't need much for this fast trip, and this hotel gave me more than I needed. I hadn't realized that this was part of a massive hotel complex... they all looked more or less the same quality, but if I went back, I would be fine staying at the HIE again.", "title": "Just what I needed", "user": "dsdc", "date": "January 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150572567}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 8, "average": 10, "very good": 47, "terrible": 2, "excellent": 61}, "aka": "Holiday Inn Express @ Williamsburg Square, State College Hotel", "slim_ranking": 0.115384615385, "description": "Welcome to the newly renovated Holiday Inn Express Hotel at Williamsburg Square. This friendly, award winning hotel is located just off Interstate 99/ U.S. 220 (322 bypass) minutes from downtown State College and in the heart of Centre County, PA. Visiting Penn State? Situated only 5 minutes from the Main Campus of Penn State, Beaver Stadium and the Bryce Jordan Center. The hotel is also located near South Hills Business School in State College and Juniata College in Huntington. Visiting a customer or other local business? The Colonnade Shopping Center, located close to the hotel, includes such stores as Target, Michael's, Kohl's, Dick's Sporting Goods and Wegman's Grocery store. Hungry? We are a 2-5 minute stroll from Outback, Olive Garden, Cracker Barrel and Texas Roadhouse restaurants. We are also a short drive from Accu-Weather, Raytheon, Chemcut, ARRIS, Schoolwires and PMG. Our hotel offers all the services a business traveler needs for a productive visit including free high-speed Internet! Visiting for leisure? Nestled in the heart of Lion Country, it would be our pleasure to have you as our guest while you are attending the Central Pennsylvania Festival of the Arts, Peoples Choice Festival, Centre County Grange Fair or Bellefonte Art and Crafts Fair. Visiting for an Athletic Event? We are closely located to all the main sporting venues at Penn State University, the McCoy Natatorium, Recreation Hall and the Indoor Track. We are also minutes away from the State College Area High School, Bellefonte Area High School and Hess Field."}