{"user_rating": 4.0, "review_count": 510, "name": "Holiday Inn York", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I booked this property via Priceline at a rate which equated to around 20% less than the best published rate. At published rates I would have been even less impressed!", "title": "Mediocrity Defined", "user": "kingdom100", "date": "November 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 85566543}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Location is about 1.5 miles outside of the city centre, but I was more than happy to walk and appreciated the plentiful car parking (I found York to be a nightmare from a car friendliness perspective!).", "title": "Excellent staff,clean tidy and very comfortable room.", "user": "rickipike10", "date": "October 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 84994639}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Check-in was efficient enough, as were all the other services, there was just nothing that made me smile or think that the hotel was really trying to make an effort.", "title": "Very impressed. Would recommend to anyone.", "user": "jessie80", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 83924124}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The room is very boxy, small, and with very basic furniture. Bathroom is very hard to use without having to shut the door, it is simply that small. Housekeeping is not brilliant as tiles/bath were not cleaned thoroughly on a daily basis, and a previous guest's hair remained on top of the showerhead throughout my entire four night stay. The mattress had labels to assist housekeeping as to which way round to turn it so that it wears evenly. Mine was on the April-May-June side, despite my stay being at the end of October.", "title": "Tired room, disorganised systems", "user": "aloneinkyoto", "date": "October 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 83437176}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Holiday Inn's much advertised \"choice of pillows\" is restricted to one described as firm, and the other type as soft. The former is like trying to sleep on a sack stuffed full of hay, ridiculously firm and far too large... this limited choice is nothing like the pillow library offered by other hotels (nor should one expect it to be, as it's a 3-star budget place, not luxury). In fact, when I requested an additional soft pillow I was informed that the hotel was fully booked, and families were using the sofa beds so none were available. This is simply not acceptable, rather like Titanic not having enough lifeboats! If hotels are going to try and offer choice at this level, then they should be able to fulfil their claims otherwise the customer will be disappointed.", "title": "Very nice", "helpfulness": 1, "user": "pdclark14", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 83344794}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "I stayed here for 1 night in a family room. Small room for 3 adults, bathroom was even smaller. Bath very small and the wall tiles could do with a good clean or refurbished. Breakfast was the usual buffet style and was very good. Reception staff very friendly. When I booked this room I was told it had views of the racecourse or the countryside. The view we had was of the car park and the roof of the hotel!!! I don't think I would stay here again for the price.", "title": "OK HOTEL, NOTHING BRILLIANT", "user": "sweetFife", "date": "December 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 89650671}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Living in North Yorkshire, we often stay in York when it is difficult to get home after social events in the city. This is a box standard modern hotel that has undergone several changes of ownersip and refurbishment since I first stayed there 20 years ago.", "title": "An OK hotel well situated close to historic city", "user": "PaulausTirol", "date": "November 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 88116375}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Its location, staff and rooms are all what you would expect from a Holiday Inn. Nothing spectacular, but perfectly adequate, and if you can get a deal, relatively reasonable. Not all hotels in York come out as well as this, so all credit to them. And, by the way, unusually for this very expensive city, their own free car park!", "title": "Good hotel, good location", "user": "cocoonbarbie", "date": "November 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 88030702}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We have stayed at this hotel several times for weekend breaks. We have always gone on the Holiday Inn Special Offers - 2 Nights B&B with dinner on one night. Very good value.", "title": "Friendly and comfortabe", "user": "NorthWalesSam", "date": "November 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 86764728}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "There is a bus stop a couple of minutes walk away, with frequent buses into York.", "title": "WEEKEND DELIGHT", "helpfulness": 1, "user": "Tim60", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85573681}, {"rating": 3.0, "title": "Average stay - not impressed with the \"executive\" room", "text": "We stayed here for one night in January for a weekend in York. The location of the hotel is good, not hard to reach by car and as it is on the outskirts of the centre there is plenty free car parking within the hotel grounds. Plenty buses in and out of York stop outside of the hotel and a taxi into the centre cost us £6 - £7.", "user": "A TripAdvisor user", "date": "February 8, 2011", "id": 95880691}, {"rating": 2.0, "stay_parameters": "Stayed December 2010", "text": "We booked an executive room although weren't impressed with what is meant to be an upgrade for which we had paid. The rooms are quite small, and drinks and chocolates in the room included within the rate conisted of a KitKat and a small bottle of water. The wooden blinds are just timber screens that slide along the windows, and rather than the stated view of the racecourse, we had a view of the hotel flat roof. No slippers were provided as stated in the rate description. The bathroom is small and it is difficult to close the door behind you once in. The telephone in the room did not work meaning that we had to visit reception during the night to order room service. On a positive note the bed was comfortable.", "title": "Think twice, don't stay over Christmas.", "helpfulness": 1, "user": "Sugarqueen72", "date": "January 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 94350375}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We chose to eat at the hotel restaurant for our evening meal rather than trawling back into York after a long day. We were seated on a small table in the middle of the breakfast buffet area, which did not feel comfortable nor inviting; in addition they had run out of many dishes on the set menu so we apologised to the waitress and told her we would eat elsewhere. The Vintage Inns pub across the road is only 2 minutes walk and felt much more inviting so we opted to eat in there. We returned to the hotel bar after our meal in the pub and the bar area is nice, drinks are moderately priced. Room service snacks arrived quickly when ordered later on.", "title": "Tired but nice enough", "user": "poprocks_and_coke", "date": "January 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 94316958}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The check-in staff were helpful generally but didn't offer an apology for the broken phone or say that they would get it fixed. The hotels common areas are looking tired and not sure if they are up to the standards of other Holiday Inn's we have stayed in. Overall an average stay and if staying again I wouldn't pay more for an \"executive room\".", "title": "Great Stay", "user": "Clive S", "date": "December 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 90231229}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Spent the worst Christmas break here. Absolutly no festive cheer.", "title": "adequate nothing special", "user": "redtyke", "date": "December 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 90169217}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "We took a chance and booked this hotel being a mystery. We needn't have worried it turned out to be very good . From the excellent accommodation to the delicious breakfast and all for the princely sum of £59 per room. The location is approximately 2 miles from the city centre ,this might give problems to people with walking difficulties but there is a very good bus service and of course taxis.", "title": "No longer a mystery", "user": "DaxieConsett", "date": "February 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 97749734}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "This is a standard UK Holiday Inn in one of their old buildings so if you have stayed in these round the North of England, you know what to expect from the rooms and facilities.", "title": "good for carless visit to york", "helpfulness": 1, "user": "travelt00much", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 97358729}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The only difference here is that the staff service is one of the best experienced it was natural and willing and did not feel they were akward, or were false in trying to provide the excellent level of customer service.", "title": "never again", "helpfulness": 1, "user": "orissa1234", "date": "February 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 97336471}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We travelled by train from elsewhere in the UK, and the public transport links trainstation, hotel and city centre are fast efficent and good value for money.", "title": "No complaints at Holiday Inn York", "helpfulness": 2, "user": "Ferg64", "date": "February 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 97205053}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I will admit that my 3 night stay was free, on room only, due to redemption of free nights being a member of the Hoilday inn loyalty club,This can work for or against you with the staff but this was not the case here .", "title": "Extremely Enjoyable Stay", "helpfulness": 1, "user": "minky35", "date": "February 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 96762517}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 30, "average": 138, "very good": 220, "terrible": 12, "excellent": 110}, "aka": "Holiday Inn York Hotel York", "slim_ranking": 0.510638297872, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 3.5}, "description": "The Holiday Inn York Hotel enjoys a prime location overlooking York Race course and is just 1.5 miles from the Historic City Centre of York, which boasts the York Minster, Shopping at The Shambles, University of York and the National Railway Museum. The Hotel is 1.5 miles from York Station and is easily accessible by road from the A64 and M1.Whether you're visiting York for a meeting, leisure break, sight seeing or simply to sample the great shopping delights that the city has to offer, the Holiday Inn York Hotel offers comfortable, modern, accommodation, fully air-conditioned throughout, suitable for both the business and leisure traveller.The Holiday Inn York is well equipped for hosting business meetings, weddings and social gatherings with seven meeting rooms that can accommodate 2 to 100 guests.The facilities and services at the hotel include our Family Friendly Restaurant; with 24 hr room service wireless internet access, and ample free car parking.Both Accessible and family rooms are available at the hotel.Kids Stay and Eat Free.* Also a fabulous location for a day at York Races"}