{"user_rating": 4.5, "review_count": 196, "name": "Holiday Inn Express Waynesboro - Rt. 340", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband and I stayed here after we did the Skyline drive and then again after we went south and back on the Blue Ridge Parkway. It is your average Holiday Inn, but was more expensive than most. The rooms could use some upgrading in the decor department but they are okay. We got a family suite both times for just a few dollars more and they are bigger rooms with a sofa. The problem is that the TV (a flat screen) wasn't big enough to view from either the bed or the sofa, so we had to move the sofa up some to watch TV and then move it back before we left. The bathroom is showing it's age except for the new tub/shower enclosure and it was very clean. We had to accept a smoking room on our second visit as that is all that was left. I was surprised that in this day and age the hotel wasn't smoke-free. The air conditioner was rather old and noisy, but not really a problem A very good perk was the free breakfast in the morning (although it may account for the higher than average price). The food was hot and there was a good selection...definitely try the pancakes. There was also free coffee, bottled water, apples and once some delicious cookies available in the lobby. The staff was super friendly and helpful. So all in all we had a good stay both times.", "title": "Nice enough", "user": "Dreaming", "date": "October 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119160391}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "They are priced a little high for me but they are worth it. The rooms are so clean, and quite. The beds are comfortable. It is worth paying the extra money for a nice place to stay.", "title": "The best place to stay", "user": "morganmyles", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119120521}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stopped here for one night after driving the Skyline Driveway and it was great. Lovely and clean and we had a lovely welcome from Michelle the Receptionist, she was very friendly and informative ( and about to give birth in 2 weeks !! )The room was what we expected and nice and clean. The hotel was busy but was quiet at night.Plenty of places to eat and drink within walking distance and we chose our favourite , The Outback !!", "title": "Lovely and very convenient", "helpfulness": 1, "user": "Eneth_bach", "date": "October 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118995677}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "A very convenient place to stop and I would recommend it.", "title": "Frequent Visitors", "user": "FF13", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118755907}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stay at this location frequently when visiting family in the Waynesboro area. Our stays have always been fine. The front desk employees are friendly and helpful. We always enjoy the breakfast but it can crowded on weekends - sometimes difficult to find an open table. Our preferred rooms are on the upper floor (same level as the lobby). We will continue staying here when we visit the area.", "title": "Hotel is good for a weekend stay", "user": "Moontatt", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118373296}, {"rating": 1.0, "title": "Bed Bugs", "text": "After a two night stay on Memorial Day Weekend, I left the hotel with severe bed bug bites completely down the left side of my body - face to ankles. Dr's office told me the bed had to be invested for me to have as many bites as I did.", "helpfulness": 4, "user": "sama714", "date": "June 13, 2011", "id": 113214639}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I called the hotel to report that room 117 was infested and NO ONE from the hotel called back. Had to call the corporate office to file and report.", "title": "Excellent Stay", "helpfulness": 1, "user": "obx4sure", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110016463}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "DO NOT STAY at this hotel for they did not want to address the problem at hand. When staying at any hotel, I will check under the matress for any sign of bugs.", "title": "Customer Service comes first!", "helpfulness": 1, "user": "PolishRifle12", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108186990}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed on Friday, April 29th for one night at HIE Waynesboro on our way to the Outer Banks. We requested 2 Queens with our reservation and upon arrival were upgraded to a King jacuzzi suite. It was one of the nicest rooms we've ever stayed in...very clean, very quiet and a comfortable bed. The desk clerk was friendly and helpful.", "title": "Great place to stay", "helpfulness": 1, "user": "Doolish", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106730568}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "In town for a wedding, and read reviews on tripadvisor for HEI. Glad that I did. Everyone at the hotel goes above and beyond to make sure the stay is pleasant, and always with a smile. Specifically, Andrea at the front desk was helpful with our requests.", "title": "A great hotel, again and again", "helpfulness": 1, "user": "hamiltzp", "date": "April 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106155179}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This inn was in a convenient location close to lots of restaurants. An Outback Steakhouse is right next door and there are several other chains nearby too. We ate at Greenleaf restaurant downtown but I can't recommend it. The hotel itself was very nice, clean and quiet, not to mention extremely comfortable. Very nice mattresses! We had a reservation and the checkin was very friendly and efficient as was the checkout procedure. The hotel offered a free breakfast but we did not take advantage of it so I can't make any suggestions regarding the food. We enjoyed our short stay here on our way to Shenandoah. This is a great place to spend the night before beginning a tour of Skyline Drive, just a few minutes away.", "title": "A Pleasant One Night Stay", "user": "Smiles4miles", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115552108}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Our family stayed here after visiting Monticello and before doing some hiking along the Blue Ridge Parkway. The hotel is relatively new and neat. We used the indoor pool to practice snorkeling. The breakfast was great.", "title": "Good stay; right off I-64", "user": "wsflyer", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115366051}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My daughter left her bathing suit behind and I phoned a few days later and informed them I'd be traveling back to the area to retrieve the suit. The night clerk inidcated it was not in lost in found and that she'd check with housekeeping and someone would phone me. I followed up a week later and got the same story but no one every phoned me. I went to the hotel to find no action was ever taken and no one every talked to housekeeping. There was no record of the brand new suit in lost and found so the maids are finders and keepers. Not folks you'd want in your rooms when not around. Additonally, the rug in our basement room was totally damp and the the clerk indicated it had not been cleaned and that a cooler had probably drained --- but all over the rug??? In all the HI Epress hotels I've stayed, NONE of the bathroom fans work. Needless to say, I am now in a Hyatt Place. What an upgrade for the same pricing point.", "title": "finders keepers/dungeon", "helpfulness": 1, "user": "Boomer1967", "date": "July 7, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 2.0, "service": 2.0}, "id": 115139593}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I had occasion to stay at this hotel while visiting family and attending a family celebration along with other invited family and friends. We all raved about this hotel. It is first rate from management to desk personnel to housekeeping. The rooms were stellar clean, and comfortable. The Staff could not have been more accommodating and friendly. The full hot complimentary breakfast was awesome. Something that particularly caught my attention was the fact that the room card key actually worked every single time....something that I have rarely experienced in even larger and more luxurious hotels. I would definitely recommend this hotel above all others in Waynesboro and will stay there again should the need arise.", "title": "A first rate hotel", "user": "PatriciaJoyce", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114989676}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed here after a day driving through the Shenandoah National Park. This hotel was clean and comfortable. I would recommend this place for those in the area looking for a nice place to stay.", "title": "Comfortable stay", "user": "63impala", "date": "June 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114766812}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I took three employees to the annual VRWA Rodeo at the Augusta County Fairgrounds.We stayed at the Holiday Inn Express in Waysnesboro,Virginia.The property is located off of Interstate 81,with many restraunts and box stores in the general vicinity.The property is well maintained and the service was excellent.I would highly recommend this hotel for family and business trips.", "title": "Virginia Rural Water Trip", "user": "glynr34", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117266453}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at this hotel after spending the day on the Skyline Drive. When we arrived our room was ready & we had our pick of which floor to stay on. We stayed on the first floor, the lobby, pool & breakfast area is on the second floor. Our room was cool and clean. We needed more towels, which was no problem. The internet connection worked very well. The woman at the front desk was very helpful, she helped us find a restaurant & gave us directions. We had a hot breakfast, which was good. I didn't realize there was a back room or we would have sat in there. We filled our cooler with ice and continued on to our vacation at Great Smoky Mountain National Park.", "title": "Will go back next time.", "user": "Off2CtheCanyon", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117251007}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "When arriving to the hotel, the front desk informed us that we were already on the 2nd floor. We had to go downstairs on level 1 to get to our room, 102. Not a problem. Once arriving to our room, a very strong odor took over the room. The AC was left on 62 for us (I am guessing this was in hopes of getting rid of the dampness!). The bed was damp and cold. The next morning when I took a shower, I noticed what appeared to be black mold on the wall in the bathroom. The toilet bowl itself was also cracked. After reading the reviews on here, I thought I would be walking into a newly remodeled hotel. This was not the case. Don't get me wrong, it was very clean and I would probably stay there again. However, I will never stay on the first floor again. When we opened the curtains before leaving, we realized we were basically in the corner on a concrete slab which was holding vast amounts of water. No wonder it smelled. The staff was very helpful and polite. Enjoy your stay - just don't stay on the first floor!", "title": "Good, but bad room.", "helpfulness": 2, "user": "ahneal", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117023528}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stayed one night enroute to Williamsburg. This hotel is at the base of the Blueridge Parkway so it is a great location to base yourself at. Only a half hour to Jefferson's home. This is a newer hotel and is in great condition. Breakfast was excellent. Staff was helpful and friendly. Many restaurants close by too. We did not use the pool, but it was nice and busy. Great hotel for one night or a few days to see the area. tHis is right off the interstate. We will return again.", "title": "Holiday Inn Waynesboro was a wonderful experience", "user": "gnerg", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116940664}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "After finding this hotel and thinking it sounded perfect for the area, we read the review on 'bed bugs' and decided to quesiton the hotel. They informed us that there had been one incident in '1' room and they had traced it to someone who had moved in from another hotel. They had addressed it and taken extra precautions to guard against bed bugs. We checked in, did the 'expert bed bug' check on our room and found it to be exceptionally clean and free of any bugs at all!!", "title": "Will stay again!!", "user": "travsc2", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116805368}], "location": {"country": "United States", "city": "Waynesboro"}, "stars": 2.5, "variance": {"poor": 5, "average": 18, "very good": 57, "terrible": 5, "excellent": 111}, "aka": "Holiday Inn Express Waynesboro - Rt. 340 Hotel Waynesboro", "slim_ranking": 0.375, "description": "Award winning hotel. Hot breakfast is included. Indoor pool, hot tub and sauna are open 24 hours. Come stay with us and you will understand what hospitality in the valley really is!"}