{"user_rating": 4.0, "review_count": 38, "name": "Holiday Inn Express Hotel & Suites Miami", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "The hotel is OK, but the maintenance and cleanliness are inadequate. My room was filthy and the ventilation didn't work correctly; a courteous staff member found me a different room. When I wrote the management about the problems, they didn't even bother to respond. The Hampton is a better bet.", "title": "Clear management problems", "user": "Twoprofs", "date": "September 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 81548208}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "My room was given out to someone else twice during my stay. The first time all my things were gone and no one had a clue about where they went. They gave me another room, with not so much as an apology, and then it happened again. This time all that disappeared was my one extra pair of underwear and the meds that I'd gotten to hold me over til I got home. I will NEVER stay in a Holiday Inn Express or any other IHG hotel again! Inexcusable!", "title": "Horrible!!! Inefficient and rude!", "helpfulness": 1, "user": "jtp005", "date": "September 26, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 81110580}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Running across America for The Way to Happiness and Youth requires a restful night after running 40 miles a day! The Miami, Oklahoma Holiday Express was a great relaxing stay. Comfortable rooms, very clean and roomy. The staff very friendly and caring to your needs. Bob Lowrance the General Manager really takes cares of his guests and a very friendly person.", "title": "Outstanding Holiday Express and Staff", "user": "JohnRadich", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79501208}, {"rating": 1.0, "title": "Don't go there", "text": "The breakfast buffet is just great! One of the best! If your traveling through Miami, OK make it a point to spend a night at the Holiday Express!", "helpfulness": 1, "user": "FredMissouri", "date": "January 29, 2009", "id": 23998348}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Striding on Across America,", "title": "Great Hotel", "user": "kissinkousin", "date": "November 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22220960, "likes": {"liked": "— Cleanliness, wonderful beds, pool/hot tub", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008", "text": "not worth the money we had to pay!!! Staff was rude and looked dirty - rooms were a mess. This is suppose to be a new motel - sure didn't look like it - everything had stains!!!! Won't be back!", "title": "not worth the money", "helpfulness": 1, "user": "jshook", "date": "March 12, 2008", "detail_rating": {"value": 1.0}, "id": 14239054}], "location": {"country": "United States", "city": "Miami"}, "stars": 2.5, "variance": {"poor": 1, "average": 3, "very good": 15, "terrible": 3, "excellent": 16}, "aka": "Holiday Inn Express Hotel And Suites Miami", "slim_ranking": 0.375, "description": "Welcome to the Holiday Inn Express Hotel & Suites in Miami, Oklahoma Conveniently located off I-44, our Miami, Oklahoma hotel is less than two miles from downtown Miami, giving guests easy access to local attractions and businesses. Your family will enjoy a stay at our Miami, OK hotel because of its convenient location near area attractions like Twin Bridges State Park, the historic Coleman Theatre, the Motorcycle Museum, Mickey Mantle's childhood home and the Dobson Museum, where you can learn about local Native American tribes. Downtown Miami, which boasts the longest original strip of historic Route 66, features premium shopping and a variety of local restaurants. It is located just two miles from our hotel in Miami, Oklahoma. Our hotel is situated close to several local companies such as Discovery Plastics, J & M Farms, Wal-Mart, Eagle-Picher Industries and Newell Coach. The Peoria Ridge Golf Course, home of the annual NGA Golf Tournament, is just four miles from our hotel in Miami, Oklahoma. In addition, we offer deluxe amenities to accommodate business travelers, with a 24-hour Business Center and meeting rooms. During your Miami visit, enjoy our excellent hotel amenities including free high-speed Internet access, a heated, indoor pool with a Jacuzzi, a Fitness Center and free hot breakfast bar. Start planning your trip today and take advantage of our great Miami, Oklahoma hotel deals and rates."}