{"user_rating": 4.0, "review_count": 314, "name": "Holiday Inn Resort Batam", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We stayed at this resort for a quick vacation and were generally satisfied. Hotel provides free shuttle from Sepukang (20min) and Waterfront (5min) ferry terminals, which is a plus for family with kids and elderly. It is a large compound with around 6 blocks of buildings (some as high as 10-11 stories, some 5-7), so it is sometimes easy to get lost. The pool is in the middle and there are special areas for kids to play. There is also a small playground. Our room is very spacious with a kitchenette, a dining area, and a living area with sofas. We were upgraded to the 10th floor and the view was quite nice. Breakfast buffet at the Terrace Cafe was OK with enough selections. We ordered room service for dinner and it came quite fast (20min). The back massage at the Tea Tree Spa I had was very relaxing, although it was only 15 min (complimentary from hotel). Staff was all courteous and helpful. A lot of families were staying when we visited. We will definitely consider this hotel again when we visit Batam next time.", "title": "Relaxed Family Trip", "user": "lizzylizzy", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 188537788}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The resort is very near to the Waterfront ferry terminal. It's good that there is free shuttle service to and back from the ferry terminal and shopping centres. Do note that you'll need to reserve seats for the free shuttle to the shopping centres as the seats are limited. Same experience with late check-in. We arrived at around 12+pm but our room is not ready. We had lunch at the dragon inn restaurant and went back to check, again it wasn't ready but the free shuttle leaves at 2pm, therefore we ended up checking in only after our return from town, which is around 7+pm. It'll be great if the shuttle bus service time slots can be adjusted so that the 2pm slot doesn't clash with the check in time, then guests could wash up before they continue their trip to town.", "title": "Rest and relax", "user": "Cthopper", "date": "December 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 187685298}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Totally agree with previous reviews that the hotel should provide free wifi in the rooms as the hotel is far from town, if you are back early, there's nothing much to do at night. The smaller kids maybe bored. The rooms are also pretty dated but clean. Only unpleasant experience is with the choked toilet in our room.", "title": "1st day blues....", "user": "humaira01", "date": "December 15, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 187677816}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "The staff are very friendly. Overall, a great place to just chill and relax. Avoid weekends if you can as it can be very crowded.", "title": "Great Hotel!", "user": "Bob G", "date": "December 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 187676742}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "check in was late....did not get my room till after 3.....", "title": "Always my choice of stay", "user": "Everest S", "date": "December 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 187663403}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 21, "average": 60, "very good": 152, "terrible": 11, "excellent": 70}, "aka": "Holiday Inn Batam Hotel Batam", "slim_ranking": 0.0967741935484, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "description": "The Holiday Inn Resort Batam is the only all suite luxury accommodation in Batam. Ideally situated just minutes away from the Waterfront City and Sekupang Ferry Terminals and a short ferry ride from Singapore. The ultimate height of pleasure comes in the form of our award-winning Tea Tree Spa. Sooth your mind and body with a selection of signature spa packages at one of 14 spacious Balinese-styled couple villas or individual treatment rooms. Spread across 3.4 hectares of open space and lush greenery, each of our 235 premium suites features a private balcony and guests can choose from spacious one or two bedroom suites, all elegantly furnished and equipped to provide unmatched comfort. When it comes to leisurely activities, guests of all walks of life are spoilt for choice at the Holiday Inn Resort Batam. The Panda Kids Club offers families a real treat. Our selection of six restaurants and bars, offers a variety of cuisines from around the world. For the business traveller, the Resort's multi-functional Meeting rooms complete with a variety of options for corporate meetings, functions, and events, supported by 24-hour business centre and a dedicated concierge. Whether you are a family with children or a corporation with a team of employees, the Holiday Inn Resort Batam has the facilities and activities to ensure that your trip is one you will never regret making. Come experience world-class hospitality infused with traditional Indonesian island charm!"}