{"user_rating": 4.0, "review_count": 367, "name": "Holiday Inn Express Frankfurt City Hauptbahnhof", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled solo", "text": "Extremely nice hotel located just a few minutes from the Hauptbahnhof. Check-in was quick and friendly. Very nice lobby, with small bar and large breakfast area. Room was on the 4th floor away from the street side of the hotel, it was very quiet. Room was large with a double bed, work desk, flat screen TV, the bath room offers a large walk-in shower, Hotel does offer wi fi internet but does charge for this service unless you are a Platinum awards member or higher. Smoking in the pubic areas of the hotel or rooms is not permitted. The breakfast buffet is complimentary and has a good variety of foods on offer. Pubic transportation is less than a block away. The area is mostly middle eastern with a great many restaurants to choose from.", "title": "A+", "user": "yvr1", "date": "December 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 188856666}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "We booked for an additional day at this property, because we were arriving early in the morning, much before the specified check-in time.. We were given a room on arrival and was never charged for the couple of hours we arrived earlier. The hotel does not have a Restaurant, but the staff was very courteous in helping us order food from outside and helped us with language too. Location amidst some facties and there is nothing around as you step out of the hotel. congested rooms..", "title": "Excellent value for money", "user": "Vijay0601", "date": "December 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 188727066}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "we arrived at the hotel early morning hoping to leave our baggage until check in time and was told by the receptionist we could have a room straight away, excellent start to our stay. the room we got was quite big and very comfortable with a kettle and a safe. it was kept very clean aswell. the hotel is in a good location & a 5 minute walk from the main station, the main shopping areas and the river. there are plenty of cafes and restaraunts nearby. there is a bit of a dodgy looking red light area a few streets away but it doesn't spread near the hotel. the hotel in general is kept clean and quite secure inside. the receptionists were that we spoke with all seemed friendly and helpful and spoke English to a good standard. the breakfast was ok and was constantly kept well stocked up.", "title": "did for us,but beware, early cleaners", "user": "1mickt", "date": "December 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 188430019}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "we only really had one complaint, don't know if it was normal practice or not, but every morning of our 3 night stay the cleaners tried to come in and clean the room between 8.30 - 9a.m,now we", "title": "Exceptional service and value", "helpfulness": 1, "user": "MsafiriTexas", "date": "December 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188174849}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "know why we managed to get an early check in! other than this I would have no complaints about staying here again.", "title": "It's an ok hotel", "helpfulness": 1, "user": "travel53NewJersey", "date": "December 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 187739330}], "location": {"country": "Germany", "continent": "Europe", "city": "Frankfurt"}, "stars": 3, "variance": {"poor": 7, "average": 58, "very good": 190, "terrible": 9, "excellent": 103}, "aka": "Holiday Inn Express Frankfurt City Hauptbahnhof Hotel", "slim_ranking": 0.0981132075472, "description": "Welcome to the Holiday Inn Express Frankfurt City Hauptbahnhof. In the heart of Frankfurt, next to the “main station Frankfurt“, the new Holiday Inn Express Frankfurt City Hauptbahnhof Hotel recently opened in March 2011. Just a few minutes walk to the city centre and famous sights of Frankfurt like the Opera Frankfurt, the Staedel Museum, the German Museum of Architecture, the Goethe House or St. Leonhards’ Church. The Holiday Inn Express Frankfurt City Hauptbahnhofis the perfect place to stay to discover the famous business city Frankfurt am Main. Our 116 comfortable air-conditioned, non smoking bedrooms, with flat screen colour TV, offer a telephone, a safe, high speed Wi-Fi internet connectivity, hairdryer and tea and coffee making facilities. Our continental breakfast buffet is included. We have integrated the dynamic philosophy of the Holiday Inn Express brand into the meetings sector and look forward to your request for a professionally run conference. 1 modern meeting room, 25m² with air conditioning is available for your meeting.We are looking forward to your visit at the Holiday Inn Express Frankfurt City Hauptbahnhof!"}