{"user_rating": 4.0, "review_count": 193, "name": "Holiday Inn Express Anchorage", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Didn't expect anything special but was very pleasantly surprised. Service was very friendly -- I asked for early check-in and they made it happen no problem. Many hotels won't. The hotel and the room were clean and quiet and comfortable, everything worked and was in good condition. Had free internet, free breakfast and free parking, which are three things I look for in every hotel, because if they aren't free you end up paying a lot more. Close to airport. I would definitely stay here again.", "title": "Excellent all around", "user": "Paul99501", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180999380}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We booked this hotel on a website that only lists Star rating and price. We had stayed here in the past and were happy before.", "title": "Good location, good price, but beware Room 210!", "user": "SewardAK", "date": "October 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 180290547}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We checked in at midnight, and unfortunately had to wait for another guest to check in and ask many, many, questions about the hotel and different services (strange since she was leaving at 4 AM that morning anyway, but I digress).", "title": "Decent hotel, great staff", "user": "Tuhughes", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 179862707}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "I think that the rooms have been renovated since we last stayed here and we were vey happy with the comfortable sitting chairs, the duvet and the HD TV. The only problem with our room was that one of the corner protectors on the wall had fallen off and was leaning in the closet. Not a problem, but just something that should have been fixed with a bit of glue.", "title": "Express not so impressed", "user": "SrTravelers3", "date": "September 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 178891198}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Like I said above, we got in late from the airport late and were planning to leave early to shop before returning home to Seward after a trip 'outside'. When we checked in, it was late and we were glad to be put in room 210, the first room you pass after leaving the front desk - since it meant a short walk. Unfortunately, we didn't realize that this meant that everyone leaving the hotel would pass our door on their way out.", "title": "Good location to airport, good value", "user": "tuck78", "date": "September 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177247740}], "location": {"country": "United States", "city": "Anchorage"}, "stars": 2.5, "variance": {"poor": 8, "average": 29, "very good": 82, "terrible": 4, "excellent": 70}, "aka": "Holiday Inn Express Anchorage Hotel Anchorage", "slim_ranking": 0.115942028986, "description": "The Holiday Inn Express-Anchorage Airport is conveniently located just 1 mile from the Ted Steven s Anchorage International Airport and 10 minutes from Anchorage s historic downtown district, with all the major shopping and fine dinning restaurants. Take a ride on the Alaska Railroad, see the starting line of the world famous Iditarod trail, kids can play at the Imaginarium or H2Oais Indoor Water Park. Attend events at the Egan Center, the Sullivan Arena,the new Dena ina Civic & Convention Center or Anchorage s Performing Arts Center. Alyeska Ski Resort and the town of Girdwood are a short drive south on the New Seward Highway, along the Turnagain Arm where you can look out for wildlife such as moose, Dall sheep and the bald eagle. But if you don t see them on the road, you can visit the Alaska Zoo or Big Game Alaska Wildlife Center. Surrounding companies include, BP Exploration, Conoco Phillips, North Slope Telecom, Inc., and Arctic Slope Regional Corp. The Holiday Inn Express-Anchorage Airport has 129 smartly appointed guestrooms, with microwaves and refrigerators in all rooms, Free wireless Internet access throughout the hotel, 24 hour airport shuttle, and our Express Start Breakfast Bar featuring our world famous cinnamon rolls."}