{"user_rating": 4.0, "review_count": 353, "name": "Holiday Inn Express HONG KONG SOHO", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Location is good...near Sheung Wan station... which opens up all your travel needs...Lan Kwai Fong is a short walk away...Plenty of places to eat nearby..the list goes on. Check in was quick'n'easy. Reception staff efficient and friendly. As far as hotel room goes..The holiday Inn does it simply. Smallish room...clean room...comfy bed...TV...free internet...coffee and tea...fridge... Never had the breakfast do cannot comment. The only thing I didn't like was the configuration of the bathroom. It was just small and awkward. Particularly the shower door which acts as as 2 in 1 ...shower/bathroom door. it just didn't seem practical. But hey. At the end of the day it's cheap....it's clean..and if you are only using it simply for somewhere to lay your head at the end of the day...it's a no brainer. I wouldn't recommend for a long stay or with family.", "title": "It's a no nonsense Holiday Inn Express", "helpfulness": 1, "user": "TheGeez", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 167731203}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Short stay at this property. Check-in was easy and the reception staff were friendly and helpful. Room itself was small but that's the Hong Kong standard. Room had everything you needed and the bed was extremely comfortable. I didn't like the configuration of the bathroom and the disposable soap and shower gel was a bit tacky. Housekeeping service needs to be improved upon. Requested an iron and board and waited at least 15 minutes until having to call again. This happened twice. Same thing happened when asking for extra towel and blanket. Shouldn't have to ask twice and wait for 20 minutes. Also found hairs in the room in several places. These were my only minor gripes!", "title": "Great location, comfortable", "helpfulness": 1, "user": "TeddybearWu", "date": "July 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 167590684}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "2 minutes walk to Sheung Wan station, 1 station away from Central to connect you to almost all tourist attractions in HK. A lot of local restaurants around the hotel to choose from, with 7eleven, Subway, McDonalds and Wellcome at the corner. Room is a bit tight but ok for a family of 3. I would not complain about the variety of food served at breakfast, because for that price, the breakfast is already a good deal. The staff also are very good, specially Angel at the front desk.", "title": "Very good location and value for money", "helpfulness": 1, "user": "PamAnn_C", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167491032}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed here for several nights in June. The hotel is really conveniently located, close to the MTR, airport express and attractions. Very clean and comfortable, breakfast was very good but could use a little more variety, laundry facilities are good. Very good service. I would definitely stay here again.", "title": "Great location, great hotel", "helpfulness": 1, "user": "Mirage2011", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167423593}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed for 3 nights at Hong Kong, friendly and fast checkin, nice and clean room.", "title": "nice hotel with good location", "user": "DerBjoern", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 167233541}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This is a great hotel for Hong Kong if you plan to explore a lot of the city. If you plan to spend all day in the hotel, this is probably not the place for you, but if you need a place to crash in the evening to relaxe and get ready for the next day of HK exploration.. holiday inn express in soho is the place for you.", "title": "Great Place - no nonsense, not luxurious, but value for money", "helpfulness": 1, "user": "Sujay N", "date": "July 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167173421}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Location - Excellent - Less the 5 min walk from the MTR. Next door to a 7/11, McDonalds, Subway and Pizza Express. Lots of great local restaurants all around. At first glance the location seems a bit dodgy, its in one of the backalleys and not on the main road.. which is great because it cuts down on traffic noise and all the rush but the main road is 100 mtrs away. but when you walk about the hotel, the alleys seems dodgey but they are very safe", "title": "Clean, comfortable stay", "helpfulness": 1, "user": "soperverse", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 167051792}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The place is a no nonsense hotel, so dont expect to get all the luxuries like pool, room service, etc. but there is a restaurant in the hotel which we didnt try. the rooms are nice and spacious, service is professional, free wifi, common laundry room. The hotel is well maintained and has a modern feel to it. not old world.", "title": "Nice stay in SOHO", "helpfulness": 1, "user": "provocareprovocare", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 166792666}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "The one thing which is a let down is the breakfast. The hotel does provide breafast with the room deals which is in the restaurant on the 2nd floor, we stayed there for 4 nights and the breakfast was the EXACT SAME food all 4 days. nothing changed not even the juice choices and not one thing on the food list. The food itself is ok. nothing great but not so bad also. choices inclided eggs, sausages, hashbrowns, noodles, soup, bread, and a couple of other items.. but all the same all teh days... for us this was a let down. Also the restarant gets crowded for breakfast and its very cramped since they fill up the place with all the guests.", "title": "Terrific Location and Very Pleasant Rooms!", "helpfulness": 1, "user": "nalieva", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 166721748}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Overall, its a great place if you want just a comfortable bed and breakfast.", "title": "Great location, new, nice staff and competitive pricing", "helpfulness": 1, "user": "jetsetlife888", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166708435}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Booked this hotel after reading extensively about all the hotels in tripadvisor and sure tripadvisor did it again :D eeeeeee", "title": "Excellent expect for breakfast!", "helpfulness": 1, "user": "ArasiArul", "date": "July 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166365672}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "3rd hotel booked after great reviews and it was up to the mark!!!!", "title": "Wonderful family stay", "helpfulness": 1, "user": "Grandma2012_2013", "date": "July 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 166211597}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed until last evening.", "title": "Frequent travellers to Hong Kong", "helpfulness": 2, "user": "Debbie R", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166101372}, {"rating": 4.0, "title": "Great Value!", "text": "Got room in the higher floor. Since I am a member of the Holiday Inn group, they extended my check-out time by 2 hours.", "helpfulness": 2, "user": "sfw67", "date": "July 2, 2013", "id": 166098409}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "But they did not provide me with a room for quick fresh-up when I requested to them even though I checked out by 11am ( 3 hours before the actual check- out time )", "title": "Great Location and Price for Hong Kong", "helpfulness": 1, "user": "StephenHalifaxUK", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165855429}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Stayed in this hotel from 23 May to 26 May 2013 with a gf.", "title": "Small but convenient overall", "user": "Langetan", "date": "July 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 165841481}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I was a IHG club member and able to book via their website and (supposedly) to get welcome drinks but that didnt happen. No sweat.", "title": "Good location, nice rooms and good breakfast!", "user": "OanaJurca16", "date": "June 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165691670}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Check in was ez as we were late, like 12 midnight. Took the airport express to HK island and got a taxi to the hotel. The lifts needed room passes for access so security was quite standard.", "title": "Good for a local experience", "helpfulness": 1, "user": "Angela k", "date": "June 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 165631140}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Small but quite new room with 2 single beds. My gf & I literally kissed each other's backsides as we walked pass the beds together. It was that tiny. OK for Asian ladies but not sure about Caucasians....", "title": "Feels like a 4 star plus hotel", "helpfulness": 3, "user": "eadriant", "date": "June 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165283007}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Having said that, I must say the bathroom was ingeniusly designed to make use of space with just one door to flip between bathing facility and toilet facility. I must remember that for future reference if Singapore (my hometown) gets popular with shoebox residential units. Again, we are Asian ladies so of smaller build. Caucasians may find it a tight squeeze.", "title": "Great HKG location", "helpfulness": 1, "user": "Julian B", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "location": 5.0, "service": 4.0}, "id": 165154219}], "location": {"country": "China", "continent": "Asia"}, "stars": 3, "variance": {"poor": 4, "average": 39, "very good": 207, "terrible": 1, "excellent": 102}, "aka": "Holiday Inn Express HONG KONG SOHO ", "slim_ranking": 0.113924050633, "description": "Let Holiday Inn Express Hong Kong SoHo be your home away from home for your next visit to Hong Kong.Conveniently located at Sheung Wan, we are close to a number of prosperous areas such as SoHo, Lan Kwai Fong, the Central (the financial hub of Hong Kong), IFC Mall, the Hong Kong & Macau Ferry Terminal as well as the famous Hollywood Road & Cat Street. Travel easily to other parts of the city with the nearby Sheung Wan MTR station or readily available taxis in the district.All guestrooms of Holiday Inn Express Hong Kong SoHo are equipped with flat TVs, comprehensive TV channels, work desk, complimentary Smart Breakfast & free high-speed Internet access with Wi-Fi. Our Superior Room is located on a high floor & features a Victoria Harbour View. Our hotel has harbour view meeting rooms on the 38 floor and all necessary facilities which serve the needs of commercial clients. Last but not the least, kids under 18 can stay free when sharing room with their parents.Holiday Inn Express Hong Kong SoHo is the first hotel in the world to achieve double platinum of Green certificates: (1)LEED (Leadership in Energy & Environment Design) new construction by USGBC (US Green Building Council) & (2)BEAM Plus by Hong Kong Green Building Council. To achieve this, the design & construction of the building need to be \"Green\" concerned & oriented on sustainability, water efficiency & energy."}