{"user_rating": 4.0, "review_count": 650, "name": "Holiday Inn Express London-Swiss Cottage", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The short version: This hotel is a well-run, very clean, modern hotel with a number of excellent features in an excellent central London location with very competitive rates. We found the staff pleasant and helpful. This property is particularly suitable for travelers arriving in London by car or who might need a car while in the area. The negatives are primarily that the rooms are small and the furniture, while modern and of good quality, is relatively simple; shelves, cubby holes and limited open hanging space substitute for chests, drawers, and closets. For many the flaws will not be very significant; for those staying more than a night or two and who like to unpack fully, they may be more irksome.", "title": "A Good Choice in an Excellent Central London Location", "helpfulness": 1, "user": "Rags2006", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154910480}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Now to flesh out with all the details, the long version: Note: this hotel is not the former Holiday Inn Swiss Cottage, but a new purpose-built seven-story (two modern elevators) hotel up Finchly Road from Swiss Cottage. The area is a lively one with many restaurants and shops and excellent public transportation connections. The \"O-2\" center, a shopping and entertainment development that includes a large Sainsburys supermarket, a good bookshop (Waterstone's), a VUE cinema, several restaurants and fast-food spots, and a lively pub, is directly across the street. In bad weather (we had rain, sleet, snow, low temperatures and windy conditions during our early March stay) it was a pleasure to have it right across the street, after a day of taking care of business, we were happy to go across the street for dinner a/o a drink.", "title": "Excellent value - our 2nd visit", "helpfulness": 1, "user": "cal88", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153918917}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Major advantages for those with cars are that, while conveniently close-in, a few Underground stops to the West End, the location is outside of the London Congestion Pricing Zone. Parking, at BPS 20 per night (24 hours, in and out) is limited but reservable. (This rate is not high for central London, and most hotels in or near the congestion zone have no parking available, charge much more, often will not reserve a space, and I could not locate others that include in-and-out privileges.)", "title": "Excellent value - spotlessly clean - smiling helpful staff", "helpfulness": 1, "user": "AnnRachlin", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153477668}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Our room, 604, faced the back of the hotel and was quiet, even with the window ajar. (We consider a window which opens a real plus when so many properties have sealed windows.) Our view was surprisingly pleasant; behind the hotel is a steep uphill and on it is a densely planted terraced garden. We heard birds singing even during much of the unpleasant weather. We had one double bed which had a good mattress and bedding. There was a choice of firm or soft pillows, but we thought them both inferior to the pillows in U.S. Holiday Inn Expresses. As mentioned above, it will be difficult to stow more than a couple of days of clothing on the limited shelf, cubby and hanging space, a minor nuisance for those staying longer periods. The room contained a desk and chair as well as an easy chair.", "title": "Decent budget hotel.", "helpfulness": 2, "user": "TheCursedVagrant", "date": "March 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153433647}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The hotel does not have an available coin laundry, nor do they have service laundry or dry cleaning services, but there are a number of dry cleaners in both directions on, and a coin laundry a reasonable walk up, Finchly Road.", "title": "Highly Recommended for Family", "helpfulness": 4, "user": "MikeKwan", "date": "February 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153350669}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "just returned from staying here on a Saturday night,stayed with my wife and daughter in a room which sleeps up to four.everything was great,we arrived earlier than the check in time which wasnt a problem,our room was ready so were able to go straight to it.All the staff were most obliging and even after we had checked out on the Sunday we were able to leave our luggage in the luggage store whilst we did some touristy stuff.The hotel is in a great location,only a couple of stops on the tube from oxford street and theatreland but far enough away to get an undisturbed nights sleep,the breakfast was good and plenty of it, and all in all our stay was fantastic value for money,we will definately stay again.", "title": "Great location", "user": "andy2465", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151365197}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I recently stayed here for one night whilst visiting London. I paid £55 for a family room, and that included breakfast. I honestly thin that is fantastic value for a hotel very near to central London.", "title": "Great Value London Hotel", "user": "Henster79", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 151340647}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The room was very clean and had everything I needed, including tea and coffee. I forgot my toothbrush and they were kind enough to provide me with one free of charge!!", "title": "Good value and definitely recommended", "user": "fictionaldaze", "date": "January 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150672047}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "The reception staff were very friendly and helpful. The breakfast was basic, but as it is included free of charge I certainly wouldn't complain. There was cereal, danishes, some cooked food, juice etc - all good quality.", "title": "Clean and good location.", "user": "Jen A", "date": "January 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150537838}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "A very clean and comfortable hotel. I had a very pleasant stay here for 5 days, in early February with a group of colleagues.", "title": "A very pleasant stay", "user": "tef2004", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152687588}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Location of this hotel is excellent. Only about a hundred yards walk to Finchley Road tube station and 4-5 stops to Central London. This was very important for us since we had to travel to Westminister every day to attend meetings. There is a shopping mall right across the street and another bunch of shops and restaurants nearby, including a Waitrose and a Sainsbury’s supermarket.", "title": "Would recommend.", "user": "CrazyHorseOban", "date": "February 18, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 152440286}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Our rooms were clean, bed and pillows very comfortable. Had tea and coffee making facility in the room. Breakfast, which was complimentary, was pretty basic but good and adequate with coffee, tea, toast, cereals, beans, scrambled eggs, sausages and pastries.", "title": "Budget Hotel well situated", "user": "nessabella11", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152414355}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The staff were very polite, friendly and helpful.", "title": "Just another Holiday Inn", "user": "Spurs1985", "date": "February 18, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152401271}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "I wouldn’t hesitate to stay here again.", "title": "Clean, comfortable and affordable", "user": "snorkles", "date": "February 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 152236104}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "A very nice, clean, quiet hotel. Staff wonderful to talk to. Continental breakfast very good and plentiful. Location to surrounding restaurants and tube station very convenient. We stayed for 3 nights and the hotel made all our arrangements for the required cabs for our departure. In our opinion the hotel rate was very reasonable.", "title": "Would stay here again", "user": "Kimberly S", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153135392}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We flew in Christmas day then rented a car at the airport and drove to HI Express. We were exhausted after our long flight from the US with our kids. They let us check in early(noon) gave us breakfast, and helped us to our room. Tamas and all the staff go above and beyond to make sure everyone enjoys their stay. We stayed 4 night went to Paris and Rome came back to London and I wanted to finish the trip at a very exclusive hotel for the kids sake, but I knew Holiday Inn was excellent and the kids loved it too, so we finished our trip with them for 3nights. I will always stay with them when ever I return to London. Eat across the street at Nanodos in the cinema complex, excellent and fun atmosphere,also 2 blocks down at Guglee Indian restaurant, excellent. Breakfast was the best in London at the Hotel and filling.", "title": "Excellent Customer Service 5 star everyone take another look at HI Express's overseas", "user": "NewOrleansLady_13", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153112143}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Great location for Wembley Arena and Stadium, just one tube stop away. O2 Shopping centre across the road with Vue cinema, restaurants etc. Nice Wetherspoons! Lovely modern reception area. Staff very accomodating on arrival let us take our room early as it was ready.", "title": "TEENAGE CHILDREN SHARED A DOUBLE BED IN A FAMILY ROOM!", "helpfulness": 1, "user": "CeliaBA15", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153056994}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Assumed a Family Room would have a sofa bed that split into 2 singles,(like a Premier Inn) but no just a double one! This made it very awkward when staying with our two 17 year old Boy and Girl Twins! My Daughter was horrifed with the thought of sleeping with her Twin Brother in the same bed! She was also really upset as we had come to London over night especially to celebrate their Birthdays! I asked to move rooms,but the Hotel was fully booked. I did ask for another Double duvet, so the children did sleep separately, but still had to share the sofa bed. The children said that the sofa bed was really uncomfortable too, It was actually broken and we propped it up with spare pillows/cushions and padded it with towels. Also try to avoid rooms overlooking the main road, the sirens and traffic didn't stop all night! On a positive note the rooms do have nice bathrooms with a quirky door that works both ways to make either a separate toilet area or whole private bathroom. Not sure about the obscured glass shower panels tho,especially the one next to the loo!! Nice hot shower and toiletries provided, no bath.", "title": "Functional, clean and great value", "user": "selsay", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152981741}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Breakfast was really busy! No spare tables, nobody spare to clear the tables either! We were shown through to a Private Meeting Room to eat. The food was of a nice quality if you could grab some quick! My Husband tried 4 times to get some bacon. They did not seem to bring out enough each time, hence it was gone too quickly!! We complained to the Breakfast Manager and they brought us some across especially to our 'meeting room'. The fruit juices,cofee and bread rolls etc were really nice. Would I stay in a Holiday Inn again? We have stayed in Premier Inns, with their Goodnight Guarantee for Years. Now the Children are 17 we chose Holiday Inn because of their under 18 kids stay free policy for children as the age is still only16 with the Premier Inn.", "title": "Great stay", "user": "KelstonGH", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152717386}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 3, "variance": {"poor": 26, "average": 64, "very good": 344, "terrible": 10, "excellent": 206}, "aka": "Holiday Inn Express London-Swiss Cottage Hotel", "slim_ranking": 0.226976744186, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Experience the enjoyment of a warm welcome & benefit from convenient location at the Holiday Inn Express London-Swiss Cottage – 7 minutes from central London.This newly renovated, contemporary hotel, has excellent transport links being adjacent to Finchley Road Tube station. Finchley Road & Frognal overground station is also only 3 mins walk from the Holiday Inn Express London-Swiss Cottage. National Express coaches serving Stansted & Luton stop directly outside the hotel. Enjoy sightseeing & the culture London has to offer by hopping on an 82, 113 or 13 Routemaster bus.Attentive, friendly & multi-lingual staff are waiting to welcome you 24 hours a day to make you feel comfortable and at home by providing you with information about the local area & beyond.Begin & end your day in friendly, sociable surroundings - Start your day with our compliments with free Continental Breakfast & a selection of hot items from the buffet.Relax & unwind after a day’s business or sightseeing in our Cocktail Lounge by enjoying a leisurely drink or one of our speciality hot beverages.42\" plasma screens keep you up to date with current affairs and sporting events.Holiday Inn Express London-Swiss Cottage has one naturally lit, fully air-conditioned meeting perfect for business meetings for up to 25 people. Our lobby area with wireless internet serves as a break out area for lunches and offers secluded areas suitable for private meetings.The Holiday Inn Express London-Swiss Cottage is two train stops from Lord’s Cricket Ground, 4 stops from the West End, Theatreland & central London. It is one train stop from Wembley and with excellent transport links, Westfield (White City & Stratford), Earls Court, Heathrow Airport, Hampstead, Camden Market, Kings Cross St Pancras (Eurostar) and Euston are all in easy reach.When travelling by car, the Holiday Inn Express London-Swiss Cottage is conveniently located outside the congestion zone. Our hotel has limited on site parking."}