{"user_rating": 4.0, "review_count": 53, "name": "Holiday Inn Express - Sumter", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Conviently located by a lot of resturants. Clean and well maintained. Staff very nice and professional. A little more than I wanted to spend but reasonable.", "title": "Holiday Inn is okay", "user": "alwaysbussiness", "date": "February 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124027123}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "The Holiday Inn Express & Suites--beautiful! The staff was informative on the area and gave her honest opinions. The rooms have a flat screen, desk, chairs, mini refrig. and microwave. The rooms were clean and had all the information in the hotel booklet. The hotel is near great restaurants, ie: Logans, IHOP, and Applebee's (to name a few). Walmart is near so that is a bonus in case you forget any items. The hotel does not accept cash so remember to bring your plastic (credit/debit cards). At most Holiday Inn's you can possibly extend your checkout time to 3PM IF a Priority Club Gold member and you call to inform them in advance, but you can only extend your checkout time to 1:30PM at this particular hotel. Great comfortable rooms!", "title": "Customer Service with a smile", "user": "decemberfavmonth", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122165255}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Once again I was treated with utmost respect as I checked into the hotel. The management and staff had everything to my liking. Keep up the good work.", "title": "OUTSTANDING", "user": "Nat H", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121933849}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I found the reception area very nice, staff very friendly and helpful...BUT, my room was very small, the carpet dirty, the bedskirt dirty, and the bathroom floor could use a good scrubbing especially under the sink where it's hard to reach to clean. The beds were okay...and the sink, tub and toilet were clean. The breakfast was nice...had bagels and cream cheese for those who don't like rubber eggs and gravy..I booked on the internet and went by the reviews, description of the hotel and pictures...but once we checked into the room I felt it was comparable to Motel 6 ( a place I stayed when I was very young )...all I can think of is that the senior discount room is the bottom of the barrel in accomodations..if we weren't so tired we would have asked to be upgraded to a more espensive, clean room...glad to get home and have a nice bath..get clean.", "title": "don't book the senior discount room", "helpfulness": 3, "user": "carol F", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 121883397}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Easy check-in, nice new interior and exterior. Nicely appointed room and very clean. Breakfast was a typical continental with a couple of hot/reheatable options (bisquits & gravy or rubber eggs).", "title": "Nice place, but a little expensive", "helpfulness": 1, "user": "Mike L", "date": "December 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121622287}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "It was an amazing experience and the staff was extremely friendly and helpful to my every need. Thank You", "title": "Amazing service and price", "user": "nat_hopper", "date": "October 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119536789}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "It's wonderful staff have been nothing but helpful! It's always clean! The room is comfortabl! The breakfast is great! I plan to come back every year with my familyyy! :) We love The Holiday Expresss in Sumter SC!!!", "title": "I've stayed at this hotel for the last 6 years!", "user": "Amelia R", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119085210}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I absolutely loved my stay at this hotel. From the professional front desk / house keeping staff to the awesome hot breakfast in the mornings. I loved the room that I was placed in for my stay, a king standard wheel chair accessible room. Although I am not handicapped, the front desk staff did a wonderful job of explaining to me, before hand, that this was the type of room that I was going to be placed into. They also explained that it was one of the last available rooms that they had for that night... This was still a very nice room! The front desk staff and the house keepers also did a very good job of making sure that I had everything I needed to accommodate my stay. If I needed more towels, they got them for me.. Laundry Detergent.. they supplied that too. I just really loved how helpful everyone was and if they couldn't fix something on their own, like the internet problems.. they would get on the phone and call someone to get it fixed . Very professional and helpful staff.. I will be recommending this hotel to friends and family :).", "title": "Excellent/Professional staff", "user": "Nichelle W", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119077271}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "- One very happy customer!", "title": "Clean, comfortable, convenient", "user": "debbiesdreamtrips", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119075050}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed in this hotel on Sept 28th, 2011-- checked in late at night after a long day of travel. The front desk clerk was very professional and friendly and the room was a perfect place to lay my head to get a good night's rest before my training presentations in Lake City, SC the following day. The room was large, the bed comfy, and there was a microwave and mini-fridge. A refreshing shower in the morning and a free breakfast in the lobby got me up and on my way. No complaints-- had a lovely stay! :-)", "title": "Terrible experience", "user": "sun d", "date": "September 29, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 118759498}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This place is a bad news. The building is brand new and beautiful. The rooms is immaculately clean and quiet. But, that is all that is positive about this place. The staff are untrained, unhelpful and occasionally rude (one of them actually told me to move out if I didn't like the service--which I immediately did, checking into another hotel). Items are missing from the rooms: facial tissues, trash cans, light bulbs, reliable internet connection, etc. The breakfast menu is a disaster (just the convenient store boxed sugary/greasy pastries, the ever-present cold boiled eggs, and the cheapest sourest coffee you can find. Of course, tea was missing, because as one the staff boldly and rudely told me \"This is America; we don't do tea\"!!!! (was it then the \"Boston Coffee Party\"? I wondered)", "title": "Terrible, totally terrible", "user": "sun d", "date": "September 21, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 118415759}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Everything in my room was weird. The area to hang my suits were only about 4 feet off the ground and just about 3 feet wide. The bathroom was equally odd, with no tubs and the shower head right above the head instead of on the wall to the side. The showerhead was just 6 feet off the ground, meaning it was inches shorter than me. I had to bend down under it to wash my hair and the upper body. There was a kitchenette in the room, but it was missing the fridge and the microwave. So, what exactly was the kitchenette for? I suppose this also explained those fancy desk lamps without working light bulbs.", "title": "Very Nice Place to stay", "helpfulness": 1, "user": "Mommyof3girlsMD", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116425563}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "When I complained, one of the untrained children working upfront (young is one thing, but acting like a child is another), they told me the room is actually for the people on wheelchair. I asked why am I put inside one of those, the answer was that they were out of rooms! Ok, this is like paying to eat in a 4 star restaurant, but being served hospital food or an army ration; with the explanation being they have run out of the normal, advertised food!!", "title": "Very clean and friendly:", "helpfulness": 2, "user": "angie4863", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116233064}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I travel constantly. This place was the second worst place I have lodged at in the past 14 years. Absolutely unacceptable for the money you pay or the standards you expect from a hotel. I am glad I took the advice of one of their staff and moved to another hotel (Hampton Inn--a quaint, but sweet place with fantastically helpful and friendly staff-- to stay on the same road)..", "title": "Quite nice!", "helpfulness": 2, "user": "EphraimWilliams", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116016517}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "My family and I traveled to Sumter for a birthday party. We requested an early checkin and when we arrived the room was not available however after about 5 minutes of waiting the clerk stated she would move us up a level to a room that was available which was great after a 9 hour drive with 3 small children. The room was very spacious and clean. The breakfast was really nice also. I would definately stay here again if we are in that area.", "title": "Clean, comfortable hotel in good location.", "helpfulness": 1, "user": "KLOE78", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115469725}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "I've just returned from a 4-night stay here, and I have no negatives to report. For the value, I was very pleased. This was a HotWire hotel. I did some research, and was 95% sure it was this hotel before I made the HotWire purchase - which dropped the price considerably.", "title": "Pleased with the HIE", "helpfulness": 2, "user": "sfm132", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127741912}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "The hotel was clean, and had very nice bedding, including a feature I appreciated - the lightweight bed comforter was encased in clean, white sheets. I sometimes get a little grossed-out at the thought of what those nylon dark-print bedding covers in most hotels have been subjected to. The HIE bedding looked and smelled clean and new. Each bed had 4 pillows marked as soft or firm. Housekeeping swept the tile, and vacuumed the carpet areas (I had left some sock-lint behind, which was gone each day). Even though the hotel is on a very busy road, it was quiet (the rooms run along the sides - no road-facing rooms. I always try to get a room on the top floor, so I don't hear plumbing & footfalls above me. My 3rd floor room was quiet - I don't know if those below me were.). The small microwave and mini-fridge come in handy, and are set in the little hallway by the entry door, bathroom & closet. Nice flat-screen TVs, with about 40 channels including 2 HBOs.", "title": "Great alternative to hotels along I95", "user": "merrydb", "date": "April 1, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 127084667}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I found every employee encountered pleasant and polite. I did not take advantage of their free breakfasts, but judging from the number of people who did, it appeared very popular.", "title": "Business to Sumter", "user": "ld_myers", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126997105}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "There is no shortage of food options nearby, including an Outback 20 paces from the hotel. And Walmart is 1/2 mile away.", "title": "Perfect!", "user": "TLM2005", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124749797}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I was there alone (to do some genealogical research in the area), and felt very safe. It is in an area of other chain hotels, restaurants, and services.", "title": "Lovely breakfast", "user": "Julie F", "date": "February 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124243928}], "location": {"country": "United States", "city": "Sumter"}, "stars": 2.5, "variance": {"poor": 3, "average": 5, "very good": 13, "terrible": 3, "excellent": 29}, "aka": "Holiday Inn Express - Sumter Hotel", "slim_ranking": 0.2, "description": "Welcome to Sumter South Carolina. Our hotel in Sumter, SC is near Shaw Air Force Base, International Paper, Pilgrims Pride, McEntire Air National Guard, Sumter Palmetto Tennis Complex, Becton Dickenson, Caterpillar and Sumter Exhibition Center. The Holiday Inn Express is located right next to Outback Steakhouse and across from Wal-Mart Super Center. Our clean and comfortable accommodations in Sumter, SC include a full hot breakfast, sleeper sofa, micro-fridge, iron & board, hair dryer, coffeemaker, 27' television, two speaker phones, voicemail, alarm clock and free high speed Internet access. We also feature a fitness center, a business center, a guest laundry and to make your stay even more relaxing we offer an indoor heated pool and outside patio. Whether you are traveling for business or pleasure Stay Smart in Sumter, South Carolina and make the Holiday Inn Express Sumter Hotel your home away from home!"}