{"user_rating": 4.5, "review_count": 69, "name": "Holiday Inn Express Hotel & Suites Newton Sparta", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2007", "text": "I am having a wedding saturday at a nearby hall in Lafayette and I wanted a nice place for my guests to rest in and sleep in after the reception. I booked 4 rooms at this hotel way back in JANUARY. Online it allowed me to book 4 jacuzzi suites (and charged me for them!) but when I called the hotel directly in MARCH they told me that they actually only have 2 jacuzzi suites and that someone other than myself had the second one! Can you believe that? They said that the other \"jacuzzi suites\" were just jetted tubs in the bathroom and not realy jacuzzi suites (even though in january I called to make sure, they said they had quite a few jacuzzi suites available). I had a really difficult time communicating with the woman who answered the phone. She was extremely combative and the only option she would offer me was to cancel all the rooms, so I let her. I wanted to make sure that we had enough rooms and that we had them all together so we wouldnt bother the other guests, but this hotel chain doesnt seem to care if you bother other guests. I called Holiday Inn Express guest services at the 800 number and they did little to help the situation (however they did reverse the cancellations). So I called the Wyndham Garden in Mt Olive and for half the price they gave me everything I wanted, with a smile to boot. Needless to say I cancelled all rooms at the Holiday Inn Express. Granted, the wyndham doesnt have jacuzzi suites but their indoor pool is open until 10pm and they have a great bar and restaurant in house that the holiday inn doesnt have so this is a much better choice. This is my second problem with the customer service at the Holiday Inn Express in the past few years, not just Newton, so it must be a training issue with the chain. I WILL SLEEP IN MY CAR BEFORE I EVER SLEEP IN A HOLIDAY INN EXPRESS.", "title": "Poor Customer Service - Didnt even get to stay", "helpfulness": 7, "user": "muzebiz", "date": "March 12, 2007", "detail_rating": {"value": 1.0}, "id": 7080930}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Overview: For Thanksgiving each year, we usually have about 17 relatives over to our house. It has gotten to the point where we cannot accommodate everyone in our home or in the nearby bed and breakfast (the little kids have grown to be big kids!). That being the case, I was pleased to learn that a new hotel was built nearby, just eight miles from us. I was a little disappointed when I found out it was a Holiday Inn Express. Before I booked three rooms there, I went to take a look at it. I was quite surprised. My wife and I asked to look a couple of rooms and management was more than happy to show them to us. This hotel was great! Being brand new, everything is top notch. We booked the rooms and awaited the verdict from my relatives. Their verdict: three thumbs up!", "title": "Only hotel in the area - but a good one!", "helpfulness": 6, "user": "ENBB", "date": "January 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6555671, "likes": {"liked": "— Location and newness.", "disliked": "— If in this area, there ar ot many good choices of where to stay. Look at this hotel as your first and best option."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Plusses: Location, location, location. Just fifteen minutes from our home. The hotel is just a few months old and the rooms are spacious and the beds high and comfy (my niece and nephews had to be helped onto the bed). Bathrooms were “luxurious.” The breakfast buffet was a big hit with everyone. There are fast food restaurants a really short drive away and an Appleby’s across the parking lot. The staff was very accommodating when I requested (five days before Thanksgiving) to have all three rooms next to each other.", "title": "Pleasantly surprised", "helpfulness": 4, "user": "cressydoodles", "date": "November 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6171907, "likes": {"liked": "— Luxury amenities at a low price", "disliked": "— breakfast selection"}}], "location": {"country": "United States", "city": "Newton"}, "stars": 2.5, "variance": {"poor": 0, "average": 5, "very good": 25, "terrible": 2, "excellent": 37}, "aka": "Holiday Inn Express Hotel And Suites Newton Sparta", "slim_ranking": 0.5, "description": "Welcome to theHoliday Inn Express Hotel and Suites of Newton Sparta. We are located in the heart of Sussex County, NJ and the closet Hotel to Sussex County State Fairgrounds. With location 12 miles north of Rt. 80 and just off Rt. 206, we are ideal for both the business and leisure traveler. We are minutes away from businesses such as Selective Insurance, Thor Labs, Rubber Fab and Newton Memorial Hospital. Guests will enjoy area attractions such as Space Farms, Mountain Creek Ski Resort & Water Park, State Parks, Delaware Water Gap and Lafayette Village.Our guestrooms are 100% smoke free and offer free high-speed Internet, free local long distance phone calling, microwave, refrigerator and coffeemaker as well as flat screen TV, movies on demand and free HBO. The hotel features a complimentary business center and fitness room as well as a spectacular Starlight Ballroom accommodating up to 230 guests. Start your morning with our hot complimentary Express Start breakfast offering a variety of hot and cold items including our famous world s best cinnamon roll. Stroll down Historical Main Street in Newton and browse unique gift shops and antiques. Enjoy area restaurants ranging from simple fare to gourmet cuisine or just simply walk across our parking lot to our Neighborhood Grill, Applebee's.Whatever brings you to Sussex County, be sure to Stay Smart and stay at the Holiday Inn Express Hotel & Suites of Newton."}