{"user_rating": 4.0, "review_count": 69, "name": "Holiday Inn Express Wilkes-Barre/Scranton Airport", "reviews": [{"rating": 5.0, "title": "Very helpful staff", "text": "We had 2 rooms for college graduation, a suite and regular room with two beds. Although they were booked solid, the staff were quick to make sure we had everything we needed - extra sheets, pillows, etc.", "user": "Maavis49", "date": "June 21, 2007", "id": 7958741}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The suite was very spacious, with one room that could be closed off, with its own separate TV. It was great for us traveling with a senior citizen who needed some privacy and quiet away from the kids.", "title": "Excellent!", "helpfulness": 1, "user": "Mignonette-7", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 7219359, "likes": {"liked": "— Staff", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Everything was clean and well kept up. This was our second stay, and", "title": "An average hotel made special by the staff", "helpfulness": 1, "user": "UKPeripatetic", "date": "June 2, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5293493}, {"rating": 4.0, "title": "Great Hotel", "text": "I would recommend this hotel to my friends.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 1, 2004", "id": 2858892}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Very nice looking facility (looks new). My room had a very spacious, open feel to it (larger size than what you will normally see). The room was well appointed (and included a fridge and microwave hidden away in nice looking large cabinet). Wi-fi was good speed in the room (just plug in & go . . very easy & fast).", "title": "Would return", "user": "KentuckyColonel", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 16220598, "likes": {"liked": "— Large spacious room, nice facility", "disliked": "— Lack of eating choices close by"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Only negative I will express was . . . this hotel is in an area that is still being developed and I couldn't find a lot restaurant choices nearby. There's a restaurant next store that appeared to be closed. I'm sure this situation will improve in the future. Although the hotel is near the airport, there really was NO problem with any noise.", "title": "Excellent all around", "user": "docpoco", "date": "February 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 13769493, "likes": {"liked": "— Very Friendly", "disliked": "— Not that close to everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "This is the hotel that I went to after I checked out of the one in Wilkes-Barre. Here are the facts about them.", "title": "Did not live up to expectations", "user": "gardenerBuffalo", "date": "January 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 1.0}, "id": 12814827, "likes": {"liked": "— Staff", "disliked": "— Reservation process with non English speaking personnel"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "1) Very very nice, clean hotel.", "title": "Just what I wanted", "user": "Sunscreensaves", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10430533, "likes": {"liked": "— Good value, convenient location, clean and comfortable.", "disliked": "— Lack of other businesses, such as restaurants, nearby."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "2) As friendly as any staff I have ever met", "title": "Very Nice Staff", "user": "grandmahornick57", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8419010, "likes": {"liked": "— Staff", "disliked": "— Not one thing, loved it"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Park n Fly was great. They took us to the airport and picked us up. 24 hour service.", "title": "Very convenient to airport", "user": "Deb L", "date": "December 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 50636245}, {"rating": 3.0, "stay_parameters": "Stayed June 2009", "text": "For starters, this is not a bad hotel. It is a clean, quiet and comfortable and you will get a great night sleep. The breakfast is outstanding! I would stay here again, but I also will be checking out other hotels when I return here for the next Pocono race before I would make another reservation here.", "title": "Good, but a bit overrated overall.", "helpfulness": 1, "user": "kristen2514", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 32292313}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I was in a room with two beds, so this room is designed for families, right? Well, there was one chair and one desk. Very little room to walk around in the room, which is made more of a challenge by the limited closet space. There were only two of us in this room, I can only imagine the difficulties faced by a family of four or five.", "title": "wonderfull time", "user": "adamsduo", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30931890}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Hotel Staff is average. Nothing to make me write a report about great service, nor a report about bad service.", "title": "Great Stay - Jonas Brothers Concert crisis averted", "user": "PA_Traveler_Guy", "date": "August 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18548089}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "It's a Holiday Inn Express, so you get what you pay for, right? No. I stayed on a peak weekend so my rate was high, but for curiosity purposes I inquired about the rate for a random date in early November, and found that they still want over $100 for this room. This hotel is simply not worth that in a market in which rates can be around the $70 or $80 range. That range would be fine for this hotel, but not triple digits on a non-peak weekend.", "title": "A Wonderful Break from the Road", "user": "fightingturnip", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 17123946, "likes": {"liked": "— The wonderful staff and cleanliness.", "disliked": "— Loose tub spigot which wasn't much"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Stranded in Scranton by the 12/26-27 snowstorm, this Holiday Inn Express offered quality service and comfort during a time of need. The hotel is adjacent to the Wilkes-Barre/Scranton Airport and conveniently located near Interstate 81. A restaurant is located on the property, though we did not dine there. The hotel is minutes away from the Montage ski resort. too. The staff was friendly and courteous; we will certainly consider this hotel again.", "title": "Convenient Wilkes-Barre/Scranton Airport and Greater Scranton Area", "helpfulness": 1, "user": "TexasEXtraveler", "date": "January 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91583891}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I would reccomend this hotel to anyone who wants a moderatly priced hotel to stay. It located next to a fine resturant and lounge with reasonable prices and good food. The staff was friendly and helpful and alot of fun to talk to. Housekeeping was Outstanding. I would have given the room 5 stars if they had flat screen TV's. I understand they are going to get them. Internet access is very fast and easy to use and they have a hot breakfest. There is a free shuttle to and from the airport.", "title": "One of the Best Holiday Inn Express.", "helpfulness": 1, "user": "SimBob12", "date": "September 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81484316}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "There is a $69.99 coupon for this hotel on RoomSaver.com which makes it attractive for a Holiday inn Express. They are eager for customers as it has many rooms over 5 floors and is located a bit off the highway. The lobby is spacious, breakfast the usual Holiday Inn Express fare with hot items and those cinnamon buns. However room maintenance leaves something to be desired. On our trip South, we got a handicapped room despite the fact the hotel was far from full and the front desk clerk wanted $10 extra for a king sized bed. There was some dental floss left in the bathroom sink from aprevious guest and a pill on the floor that we stepped over. On our return, we easily got the king size bed at the same price but had to change rooms twice. The first room no. 222 had a overpowering chemical smell which nust have covered some previous problem. The second room no. 214 we switched to had a stong urine smell in the bathroom that seepd back into the room. The third room no. 221 had no strong smell but had linens that didn't look the usual spotless Holiday Inn express white. The hotel is located right at the end the Wilkes-Barre airport runway but we didn't hear anyy planes during our visits. The parking looks full but is rented to people flying out of the airport. Wireless Internet is free but a little slow and was not working for a while during the night.", "title": "Good price but some problems", "user": "AZFrequent_Traveler", "date": "September 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 79282347}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Stayed one night and was very pleased .Very friendly service,clean and comfortable room. First floor sitting area with tv,newspapers,fireplace,even a bowl of fresh fruit,free pastries at the front desk. Breakfest was very good and it was free.We will go back again.Stayed at many places in the area and this was the best byfar.", "title": "Wonderful place to stay", "user": "smz123", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56317005}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "checked in on a saturday evening. Hotel was easy to get to and looked good from the outside. It turns out that hotels.com completely messed up my reservation, the only thing they got right was my last name. All my info was wrong, and the evening manager didn't want to give away the room to me in case the real Mr \"XYZ\". showed up. I can understand that, and he found a room for us while keeping the reservation for the 'other' person (whom I am 99% sure never showed!!). I also asked for a 1-day extension to my stay and he easily made that happen!! I asked for a smoking room facing the airport (Im an amateur plane spotter) and he also made that happen!! Great service from the evening front manager, and many thanks!!", "title": "great experience!!", "user": "sasd209", "date": "February 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56085332}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 4, "average": 11, "very good": 23, "terrible": 3, "excellent": 28}, "aka": "Holiday Inn Express Wilkes-Barre/Scranton Airport Hotel", "slim_ranking": 0.25, "description": "The Holiday Inn Express Wilkes-Barre Scranton Airport Hotel is conveniently located at the Wilkes-Barre Scranton International Airport, just off I-81 at Exit 178A and only minutes from the Pennsylvania Turnpike Northeast Extension (I-476). Centrally located between Scranton and Wilkes-Barre, this property is just a short drive from all area attractions and businesses. Featuring 100 beautifully appointed guest rooms, which include several luxurious two-room suites. Free wireless high speed Internet! The Holiday Inn Express offers a free 'Express Start' HOT breakfast, fitness center, and shuttle service. Do Business the Smart Way!The Holiday Inn Express makes doing business easy, located just minutes from Lowes, Clarcor, FedEx, UPS, Cascade, Pride Mobility, Keystone Automotive, Letica Corporation, TJ Max, Proctor and Gamble, Naval Reserve Center, and many more. Visit Area Attractions the Smart Way!Be close to all that this area has to offer, including Mohegan Sun Casino, Wachovia Arena, Sno Mountain Ski Resort, Toyota Pavilion, Steamtown National Historic Site, Shoppes at Montage, Lackawanna Coal Mine, Pocono Downs Racetrack, Yankees (AAA) Baseball, Pocono Raceway (NASCAR), The Ice Box, FM Kirby Center, Steamtown Mall, Wyoming Valley Mall, and an abundant array of restaurants! Packages available.Stay Smart!Experience outstanding hospitality and the finest array of amenities, experience the Holiday Inn Express!"}