{"user_rating": 4.5, "review_count": 1335, "name": "Holiday Inn Lake Buena Vista Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Very Clean, Excellent, friendly staff. Room size, King bed with sofa sleeper was comfortable. The room was near the elevator, but was very quiet. No room noise from the other rooms. The shuttle bus service from the hotel to the parks was on time. The shuttle bus service to Downtown Disney was provided, but it is much quicker to walk, only about 10 minutes. The housekeeping staff was friendly, and the rooms were cleaned properly and on time. The only negative was the small bathroom, and vanity space in the bathroom. The bathroom was clean, but small. Overall the hotel stay was very good. The staff was very friendly.", "title": "Very Good", "helpfulness": 2, "user": "Robert M", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147032477}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Hello,", "title": "This was the actual email I sent to the hotel managers", "helpfulness": 1, "user": "Liane A", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147027123}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I recently had the pleasure of staying in your hotel and I wanted to let you know, personally, just how much I enjoyed it.", "title": "Restaurant", "helpfulness": 2, "user": "Snowman2010_10", "date": "December 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146848586}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "All of the staff were helpful, smiling and happy. From the reception staff, the restaurant and bar staff, the shop keepers to the housekeeping staff, each and every one was smiling, happy to help me and friendly.", "title": "ACF Holiday Party 2012", "helpfulness": 1, "user": "ACF_HR", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146780317}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I especially want to point out Kella and Whitney, who went above and beyond the call of duty. Both of these ladies were truly exemplary in their interactions with me. I observed them being no less incredible with each and every other person with whom they came in contact. We even got hugs when we were leaving! Real sweethearts!!", "title": "Good place to stay", "helpfulness": 1, "user": "AnnaO29", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 146658426}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I stayed in this Hotel in May '11 with my wife and son. The Hotel is nice (not very friendly ONLY proffessional) people at the reception. One expects to see some smiling faces after a tiring flight !", "title": "Good hotel with wrong people particularly in the Hospitality industry.", "user": "ZubinD", "date": "May 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 109088202}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Well the rooms are great and so is the pool.", "title": "THE BEST SERVICE IN ORLANDO", "user": "todski85", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108462844}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Most importantly, the restaurant is an absolute farce considering it's a 'Holiday Inn'. Their franchise in Mumbai has much better food with a larger variety ! N friendly staff.", "title": "We'll be back next year!", "user": "MoodyPoint", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108333757}, {"rating": 3.0, "title": "Be warned - when they say \"balcony\" they don't mean \"balcony.\"", "text": "The choice of food is very poor, not even 5 Pasta dishes, no Continental, Chinese, and NOTHING for the vegetarians ! I think not many hotels consider vegetarians particularly Indian travellers who are today one of the biggest spenders compared to the Americans themselves !", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 13, 2011", "id": 108056988}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The waiters in the restaurant will ONLY give you good service IF they are happy with your tips. God forbid if you leave a Dollar less, be prepared to be royally ignored the next day EVEN if you call out to them. Do I smell Racism here ?", "title": "An Awesome Surprise!", "helpfulness": 2, "user": "Leisure2Travelers", "date": "May 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 107988017}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "This hotel had a great location on Disney property without paying the high price. The rooms were very clean and the staff was helpful. Pool area was nice with plenty of room for everyone. Parking is a bit hard to find and annoying to pay $10 per day. Always hot water in the shower but the pressure was lacking and the same goes for the toilet. I appreciate a quiet flush from a but it could barely even get toilet paper down. No major problems.", "title": "Great location", "user": "aicirtapc5", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 112808117}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "All in all it was a good a hotel and we would stay here again.", "title": "Good value", "helpfulness": 1, "user": "NearlyRetired68", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112572037}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We are senior citizens who appreciate a quiet environment. We stayed at the Holiday Inn for 5 nights and have only positive things to say about it. The employees were pleasant and consistently helpful. The room was fine. Internet was free, which was great. The location was great as we could easily walk to Downtown Disney or to a non-Disney strip mall which had several restaurants. We only used the restaurant once, and we thought it was over-priced, so after that, we ate elsewhere. The shuttles worked as described (every 30 minutes). We would definitely stay there again.", "title": "Highly Successful Conference", "user": "mccutcha", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111851082}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We held a conference for 105 people at the location and could not have been happier with the service, food, location, and the room accommodation. The staff was highly professional and went above and beyond to meet our expectations. I would definitely use this hotel again for a conference.", "title": "Loved this Holiday Inn Great Pool just a little too hot", "user": "grandmamajoy", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110827671}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We usually stay at WDW resorts but wanted to be around Disney not in DIsney But we really were in Disney they even had a shuttle for teens to go to parks I laid out by pool all day Pool was a little too warm for me which usually hotels not on WDW grounds are not really heated Breakfast bar was a rip off waiter explained it different than what the real price was language barrier Emailed hotel 4 times on breakfast bar matter and still haven't gotten a response", "title": "AMAZING", "helpfulness": 1, "user": "Jeand1966", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110686966}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Wow, what can I say about Sascha Voss and the Holiday Inn Buena Vista Catering crew and Sales Events Staff. Sascha was there the whole night, we have had events at many other locations, and what made it for me is there is only one ballroom event per night. You will get 100% customer service all night and feel like you are a VIP. The event went flawless and Sascha made sure I was happy and everything went as planned. We stayed on schedule and all I can say is thank you to the Holiday Inn Lake Buena Vista for making our Event a perfect night! If you are planning an event make sure you book it with Sascha this was our End of the Year event but it's perfect for ANY event, I can imagine what a wedding would be like. I will recommend to all of my friends and family.", "title": "Ritz-Carlton Service at the Holiday Inn!!", "helpfulness": 1, "user": "maldonora", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147574854}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The room and hotel itself were clean...the pool and hot tub were not. From a distance it looked lovely but upon entering you see French fries and other foods scattered on the bottom. We stayed for a week and each day, the same food was on the bottom of the pool - not cool.", "title": "It gets the job done", "helpfulness": 1, "user": "Jenn G", "date": "December 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 147378647}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "The front desk was extremely helpful, they have maps and tickets to everything incase you want to get your theme park tickets there. A shuttle runs every twenty minutes directly to all Disney parks and the hotel is within walking distance to many many restaurants, a mini golf place and downtown Disney.", "title": "Best customs service!", "helpfulness": 1, "user": "ACN2010", "date": "December 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147186371}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Rent a car and go to gator land! It's a nice break from the packed theme parks and there you can pet, hold, feed, see, wrestle and eat gators - amazing. Also check out universal theme park and Harry potter land, but schedule every other day with no theme park, you'll appreciate them, and your trip more.", "title": "No mistakes at all", "helpfulness": 4, "user": "mistereletronic", "date": "December 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147159634}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Overall, I'd say this hotel gets the job done - it was in a very convenient location, it was really cheap and it was far enough from disneyworld that you didn't have to do everything Disney - but close enough with the shuttles that if you wanted to you could. I'd recommend it for families but not adults without kids.", "title": "Good Hotel, Very good Staff, Excellent Location", "helpfulness": 3, "user": "sebastianfitje", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147107072}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Our family of four stayed there for a week. It is very clean and quiet. We were on 4th floor facing the beautiful pool. Had a good view from the balcony. The pillow-top mattress is super comfortable. With two sets of pillows (firm and soft), we got good night sleep every night. The hotel food service is a bit slow, but the food tastes good. The staff is friendly. We requested an extra blanket, and received it the same day. Ask for the shuttle bus schedule if you need one.The buses are on time. There were no buses go to the water parks after 10 am. Took us long time to get there.", "title": "It is clean, quiet with comfortable beds", "user": "Lan998", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 107752255}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This place was fantastic, it's within a 5 minute walk to Downtown Disney, it has shuttles to the various Disney parks every 30 minutes, the pool view is gorgeous, the rooms are clean and bright, the decor is new and service was brilliant.", "title": "The best Disney hotel outside of Disney.", "helpfulness": 5, "user": "Mcnunu", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107535322}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "My significant other and I thoroughly enjoyed our 4 night stay at this hotel. For cheaper than what you'd pay to stay at a Disney budget hotel (read dingy Pop Century) you can stay here.", "title": "Wonderful Location", "helpfulness": 2, "user": "s246002", "date": "May 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 107145716}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The staff were very friendly and accommodating and the shuttle service was excellent. It's not like those hotels which only offer 1 shuttle pick up and return a day, it offers them every 30mins until 90 mins after the parks close. Even if you miss that last shuttle because you got too caught up in capturing those hard to come by empty park photos, you can just grab any Disney shuttle that goes to Downtown Disney and walk back to the hotel because it's so close!", "title": "Great pick on the Boulevard", "user": "CHEERNMOM55", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 106285041}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "They have an arcade and a fitness room, not that you'll need it with the amount of walking you'll be doing at the parks all day and the pool looks simply amazing, I wish I had the opportunity to take a dip in it.", "title": "Great service", "helpfulness": 1, "user": "Jocey42", "date": "April 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 106269689}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Following a transatlantic cruise, we headed to Orlando for a 3 night stay at the Holiday Inn. We chose this hotel due to its' close proximity to the Disney attractions, Downtown Disney and of course the high traveller ratings. Upon arrival we were allocated a room on the 9th floor overlooking Downtown Disney. We had a great view of the Disney and Epcot firework displays each evening, which was great.", "title": "Location, location, location", "helpfulness": 1, "user": "iloveorlando", "date": "December 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147828118}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel itself is nicely located in the Buena Vista area. The room was extremely large and comfortable and the balcony with picture window a pleasant surprise. The Kingsize bed was very comfortable, with a choice of pillows; housekeeping did a nice job keeping everything clean. There is a coffee-maker, fridge and microwave which is very handy.", "title": "Wonderful stay", "user": "C Y", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147706370}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I was surprise at how quiet the room was - the hotel was full. The large central atrium was very different. Other hotel facilities included a gift shop, small general store, bar and restaurant, conference rooms etc. The pool area, (although we did not use) looked attractive and had nice private seating areas.", "title": "Believe it!", "user": "D H", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147699921}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The hotel staff were extremely pleasant and helpful; we purchased attraction tickets quickly and without fuss or pressure. We did not use the shuttle bus on this occasion, but felt this would be very helpful for those without transport.", "title": "very clean!", "helpfulness": 1, "user": "RFloricel", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147644666}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "We used the Valet parking with ease ($16:00 per day) which we found to be a great service. Ernie at Valet was especially knowlegeable and friendly.", "title": "STAY HERE!", "helpfulness": 1, "user": "K1829", "date": "December 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147597783}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "My friend and I are just back from a wonderful four night stay at Holiday Inn at WDWR. The location is a 7 minute safe walk to Downtown Disney. Our room was clean and safe. It is bare bones but very sufficient for a comfortable stay. I loved the 4 pillows on each queen size bed. The shuttles ran frequently. The pool was cool and the hot tub hot just as it would be in May. The expensive breakfast ws over priced at 14.95 for cold scrambled eggs and so so buffet. Don't eat there. The hotel itself and stay was was perfect.", "title": "Enjoy but avoid the Orange Lake Time share trap at all costs", "helpfulness": 13, "user": "shewill50", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110167904}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "But be very aware of the Time share trap known as Orange Lake. It is disguised as a ticket seller right next to the main desk at teh Holiday Inn . I was stupid enough to take the tour promised to be a mere 90 minutes. It took 3 hours of hard sell pressure a total waste of time at the most rock bottom of all possible timeshares. Orange Lake eems to specialize specialize in tattooed, poor black and red neck families who can not possible afford $90 a month and $800 a year in dues forever. I am a 60 year old recent widow with out grandchildren. I should have been an poor prospect but that did not seem to matter. I had to say no to four different pushy sales men. Do not buy tickets from the Holiday Inn buy them from the park. You will save yourself a time share nightmare.", "title": "Surprisingly good value and recently renovated", "helpfulness": 2, "user": "RichR49", "date": "May 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110109163}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Arrival at the hotel was uneventful and efficient. The hotel appearance and room condition was remarkably nice. Plenty of room with a balcony facing the pool. Pool closes late, around 11 pm, and not full of kids when we were there. Lots of chairs and towels. The hottub was too hot for us. 10 min walking distance from Downtown Disney, and bus service to the attractions. Getting back was a problem as the bus didnt show up at the specified time. Standing for an hour on a blazing hot parking lot waiting for the A bus was no fun, but not the hotel's fault. Breakfast is either $9.50 for an omlette/waffle, or $15 for everything. The omlette station had limited ingredients to choose from, but was good value, coffee and juice are included. Waitstaff was good. Internet is fast, setup is a bit confusing.", "title": "Great stay and amazing location", "helpfulness": 8, "user": "emma&simon", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109925496}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Gripe: to management:", "title": "Poor customer service", "user": "panterka27", "date": "May 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109868620}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Self-parking 1s $10/day, and not in the most convenient spots. Those spots near the entrance are blocked by traffic cones, taken up for the valet parking people who run to bring the cars to the entrance. Go figure. The paying guests who walk to their cars should get the good spots, let the valet parking kids park their cars out back.", "title": "Clean and good value for the Disney World area", "user": "Nick R", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 109678075}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We had such a wonderful stay at this hotel and plan to go back for all of our Disney trips. The hotel was very clean, affordable, and the walk to Downtown Disney was perfect. During our stay we got engaged and Lauren who works in the resturant made our trip extra special, we couldn't have been more suprised of her kindness to people she had just met. Thanks again for a wonderful stay!!! See you next year!", "title": "Can't wait to go back!", "helpfulness": 2, "user": "Katie H", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146656724}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I had the opportunity to stay at this hotel during a work trip. The staff is wonderful!! they were helpful with my priority club issue and just overall gave amazing service. My room was very nice clean with a very comfortable, definitely held up to the standard I have come to expect from an IHG hotel. Would definitely stay again!!!", "title": "Great Stay!!", "helpfulness": 2, "user": "Terrise P", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 146499842}, {"rating": 5.0, "title": "Great value", "text": "We stayed four nights recently for a trip to Disney. The cost per night was great! The rooms were very clean and comfortable. The staff was very helpful. The hotel is a 10 minute walk to Downtown Disney. Also has shuttle service to all of the Disney parks. Would stay again.", "helpfulness": 1, "user": "Dhud0929", "date": "November 29, 2012", "id": 146433532}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We stayed for 4 nights. We got the room package with breakfast buffet and self parking. It was well worth it. The staff at this Holiday Inn is superb. The breakfast buffet was tasty. The fresh cooked omelet was yum,yum. Zeny and Amelia are super in the restaurant. By the way, the fish and chips and the cheeseburgers are the best. The bed on the 14th floor was firm but very comfortable. The shuttles were great and on time. When we come to Disney again, we are staying with the Holiday Inn LBV.", "title": "Our Family Vacation to Disneyworld", "helpfulness": 1, "user": "atmguy61", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146308893}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We recently stayed five nights at this hotel. It was extremely clean, comfortable, and the staff was excellent. There was transportation provided to the parks every thirty minutes which was reliable and consistent. In addition to this, the restaurant had a delicious breakfast and you could order waffles and omelets as well as choose bacon, sausage, baked items, grits, etc. We also ate one dinner and one lunch in the restaurant and they were both good as well. When we return to Disney, we will definitely be staying at this hotel. It was especially nice to come to a quiet, calm place at the end of a long day at the parks.", "title": "Convenient and exceptionally clean and comfortable", "helpfulness": 1, "user": "SHale63", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146105855}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 28, "average": 77, "very good": 402, "terrible": 11, "excellent": 817}, "aka": "Holiday Inn - In The Walt Disney World Hotel", "slim_ranking": 0.063829787234, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Welcome to the Holiday Inn Lake Buena Vista Downtown. This J.D. Power & Associates award winning hotel is fresh from a $25 million top-to-bottom makeover, making it the perfect place to stay during your vacation to the Walt Disney World Resort. With deluxe rooms, lobby and business amenities and facilities, you are sure to enjoy the comfort and convenience of our charming Orlando hotel. Whether you are in town for a weekend getaway, destination wedding or family vacation, our hotel in Lake Buena Vista puts you in the center of it all. Located within the Walt Disney World Resort, our hotel is just a short walk from everything the Downtown Disney area has to offer, as well as several Orlando attractions, golf courses and shopping. If you're in Orlando on business, feel free to utilize our 10 different meeting rooms with space for 18 to 600 guests, on-site audio/visual equipment, catering services and sales & meeting professionals. During your vacation, enjoy our choice Orlando hotel amenities, which include free high-speed Internet access, a delicious on-site restaurant and lounge, brand new 32' LG LCD HDTVs in every room, Bath and Body Works bath amenities in every bathroom, a zero-entry pool and an on-site game room for the kids. We also offer Rainforest Alliance certified coffees. Check out our Orlando hotel room deals, and make your reservation today."}