{"user_rating": 3.5, "review_count": 276, "name": "Holiday Inn Bolton Centre", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The high spot of our visit was the warm Lancashire welcome. I expect to be in the area again soon and will definitely use this hotel.", "title": "Good value, good location", "user": "luceo", "date": "March 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 126030548}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Stayed this weekend for 2 nights with the family (up for football) from the moment we arrived the staff were very friendly.Asked for a quiet room (we have 2 small boys) gave us room 423,very spacious and clean.Booked dinner in the restaurant good value kids eat for free,breakfast very good selection,the stay was very nice if we are up that way again we would stay at this hotel.", "title": "very nice hotel", "user": "sisuttonLondon", "date": "March 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 125945775}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed here while on business. I was allocated a room on the 3rd floor which was an executive room. The room was OK but I found the temperature was very warm. I tried to change the temperature on the air con system but it didn’t help, in the end I had to open the window, which wasn’t ideal as I was staying in February.", "title": "Good Stay", "user": "MDA160", "date": "March 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 125616062}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The reception staff where helpful especially when I need directions to other places in Bolton.", "title": "Good if you get a deal.", "user": "redvanman", "date": "March 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125592582}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Overall I would recommend especially if you need to be in the centre of Bolton", "title": "Good value", "user": "countyfanuk", "date": "February 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 125195076}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I've stayed here at least four times and each time it has got worse. I'll not be staying again!", "title": "Nothing good to say!", "user": "pascho2000uk", "date": "January 16, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 123159898}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The rooms range from tired to exhausted. Even the executive rooms leave a lot to be desired. Some rooms face a brick wall, if the state of the room itself isn't depressing enough!", "title": "A bit tired", "user": "Golden-mole", "date": "January 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 123152090}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "If you stay at the weekend, rooms at the back of the hotel on the lower floors are flooded with noise from the wedding venue, whilst room to the far left of the reception area are subjected to noise from the night club opposite.", "title": "Disappointing!", "user": "welltravelled800", "date": "December 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 121737943}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I really don't know how this place manages to stay open.", "title": "Staff excellent", "user": "Newquaygreen", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121623394}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The sign outside said 'Celebrating 20 Years' and the hotel felt like it. It is probably time for a complete refurbishment. If some rooms have been refurbished we did not get one. Location is good in the centre of town and there are 2 car parks, one underground that is tight for larger cars and one along side with free parking for residents. We had an Executive Room which was disappointing. First it was a very small room, which explains why it was not a king size bed, There was only one bedside reading light, where the other had been was covered up. The bathroom shows that you can get a bath, toilet and wash basin into a 2m square room. No good if you if you are not slim. The room and public areas were clean.", "title": "Getting Tired", "user": "vvrich", "date": "November 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 120398053}, {"rating": 1.0, "title": "Never again", "text": "Stayed here for 3 nights on business and to be honest if I had been closer to home I would have left after the 1st night.", "user": "Blearagirl", "date": "December 14, 2007", "id": 11542697}, {"rating": 3.0, "title": "Budget Break", "text": "The room was OK but dirty in places and basics such as a shower cap were not provided. The hotel is noisy with doors slamming all night and it is close to nightclubs and a casino.", "user": "Raystravels", "date": "December 4, 2007", "id": 11249446}, {"rating": 4.0, "title": "good, solid hotel", "text": "They overcharge, I accept that they corrected all mistakes but you need to check your bill if you stay here.", "user": "carol_ann_noble", "date": "November 6, 2007", "id": 10649977}, {"rating": 4.0, "title": "A good central hotel", "text": "The restaurant was poor. The staff couldn't be bothered, service was slow even with only a few customers. The staff new little about the food and obviously hadn't eaten it. The food tasted bought in and deep fried or microwaved. \"Fresh\" coffee was from a machine. Fine if you like weak espresso or pre-sugared cappuchino, ok if free, but at over £2.50 a joke. The problem is there are few alternatives to the hotel when it comes to eating. The choices nearby are mainly take-aways and the area is not nice to walk around on a dark night.", "user": "CatBow", "date": "September 24, 2007", "id": 8885509}, {"rating": 2.0, "title": "Back again... and better, but customer service hit and miss.", "text": "Breakfast was self service although they advertise food cooked to order. I sat for over 20 minutes and, as no-one came to take my order, I gave up. The staff can't even be bothered to ask if you would like fresh tea or coffee rather that muck from the machine.", "user": "Five-Oh-States", "date": "April 19, 2007", "id": 7395489}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Satayed here overnight recently. Check in was fairly speedy - but that was about it. The rooms we had were small, cold, no min-bar or any other usual Holiday Inn trappings. The pool is tiny and cold, the gym is straight out of the ark, filled with crappy old equipment. While I was there the girl on reception kicked a guy off the treadmill so she could put a poster up!", "title": "Possibly the worst Holiday Inn anywhere", "user": "Lapchien", "date": "April 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 15231788, "likes": {"liked": "— Free parking", "disliked": "— Poor reflection of the Holiday Inn brand"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We ate in the restaurant - standing waiting for a table we were ignored by 3 members of staff on the till right by us, until I ran out of patience and blocked the way, when I then asked 'any chance of a table'? The guy said, 'sorry I'm just in the middle of something...' The food was slapped on the plate, boring and frankly we'd have been better off going to the kebab shop over the road.", "title": "Good location, good facilities, shame about some of the staff...", "user": "mupsmoore", "date": "April 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 15195763, "likes": {"liked": "— Location", "disliked": "— Rude waitress, faulty shower switch, room size"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "The breakfast was self-service, usual thing, a couple of bad points though are the self-service so-called coffee machine, and the self-service so-called fruit juice machine.", "title": "Well recommended!! Friendly", "user": "MurielNorthWest", "date": "March 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 14532867, "likes": {"liked": "— bed, shower and breakfast", "disliked": "— view"}}, {"rating": 3.0, "title": "Just the job for a short stay!!", "text": "Glad to get out of this place, won't stay here again - neither should you.", "user": "lmairjones", "date": "March 4, 2008", "id": 14031475}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Just came back from a long week end spent at Holiday Inn Bolton Centre.", "title": "Give this one a miss", "user": "anonim", "date": "January 18, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "business": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 12764852, "likes": {"liked": "— Motorway", "disliked": "— Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I stayed here recently as I have family who have just moved to Bolton. On arrival the receptionist was pleasant and very helpful, I explained that I had heard that the surrounding area was noisy and that I would prefer a quiet room and was given room 226 which I found to be just fine, and in all honesty didn't hear anything all night. I had room service which was delivered quickly and was quite nice (room for improvement) but i still enjoyed it. The rooms are a little dated but comfortable and clean. In the morning breakfast was good the restaurant staff made us tea and coffee. Check out was good and I signed up to Priority club which is a must if you stay at holiday inn's and crowne plaza's often! Overall I had a lovely stay, If i was to suggest room for improvement it would be the TV and channels they need updating maybe a modern TV and more channels to choose from bring back sky!", "title": "Great stay Excellent staff!!!", "user": "geordishorebbe", "date": "February 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125048806}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "A comfortable, friendly place to stay that was not over priced. We did not eat here so cannot comment on the dining experience. A few of the areas are a little 'tired' but overall was clean. Just one gripe, the male changing rooms in the pool area were not that clean, there wasn't any hand soap; the area would benefit from a deep clean. Would stay here again.", "title": "Good Value Stay", "user": "Squirrel-review", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124789596}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed here with colleagues. The Hotel is outside of the nice victorian centre and the surrounding area looks a bit run down but its just a short walk to the nicer part of the town. I explained at check in that I was concerned that the trip advisor reviews were very mixed and so was allocated room 317 which was an executive room. The room was just OK with a comfortable bed but the bathroom was'nt that clean (long black hairs in the bath) and had an overall grubby feel to it. The room was at the back of the hotel so was nice and quiet. Breakfast is buffet style which isnt to my taste as food always looks very sorry for itself sat under heat lamps but the staff greeted me with a very warm welcome and offered me poached eggs instead of the sad looking dried up fried ones on the buffet. We had dinner in the hotel on Valentines night and the meal was very good, I had the Lamb Rump which was perfectly cooked. My colleagues had some special dietary requirements which were met gladly. However, it took a very long time to arrive and so the pace of service spoilt it for me and the food wasnt that hot. It wasnt busy at all. Eventually we had finished the set menu which was good overall. They gave us some complimentary cupcakes which was a nice touch but it was so late by then that we didnt want them. A previous guest had filled up the sparkling water in the mini bar with tap water, I called reception and got a very speedy replacement with profuse apologies and some complimentary orange juice. This could be a really good hotel if it was brought up to date with some investment by Holiday Inn, the staff offer a very warm and genuine Lancashire welcome which is worth a lot nowadays. Free parking is a bonus. There is a gym but I didnt get round to using it. Overall I would reccommend", "title": "Free Parking, Nice staff, OK room, overall very dated", "user": "intrepidexplorersid", "date": "February 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 124670492}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Staff were very friendly and pleasant. Pay tv did not work properly in our room but the staff offered for us to change room and they made sure no charges were put onto our account for movies we didnt watch. We ordered room service which arrived hot and in great time. Food was very tasty was was not over expensive. Room was small and cosy but bathroom was a little small and bath was a bit dated. There was a function on at hotel and music could be heard but not to the point of spoiling our night. Over all me and my husband had a comfortable night and would go back again. Can not fault the staff at all. Recommend for a cosy night in or a place to stay if going out in bolton. Thank you very much.", "title": "Great Time had.", "user": "mandipet", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124467811}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The outside is an 80's classic, for all the wrong reasons.", "title": "Worn, Slow.", "user": "neveratrest", "date": "February 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 124437787}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Easy parking in the centre of Bolton so easy access to shops/pubs and restaurants etc. The staff are are very friendly and helpful. TIP OF THE WEEK the point for electric shavers is under a liitle plastic flap in the hair dryer!!!. I did eventually find it after help from the Housekeeper!", "title": "Central for the north west and Manchester", "user": "LewPontypridd", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124378141}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Good Wetherspoons in the High Street..The Spinning Mule!", "title": "Excellent stay, great hotel", "user": "gypcgirl", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123752264}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I recently stayed at this hotel when attending an event. The hotel is lovely, it is built around an old church. The room where the event was held was the old church with arches, high ceilings and atmosphere aplenty. I felt welcome as soon as arrived. The staff are very friendly and attentive, they couldn't do enough. The food was presented well and tasted great. The room was very comfortable, although a flat screen tv would give a modern feel. The room, restaurant and bar was very clean and I would certainly stay here again. It was really easy to find, and get to. Straight off the A666. Highly recommended.", "title": "Good value and friendly", "user": "james_rutherford83", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123535374}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We stayed overnight to watch a football match.", "title": "Central location, quiet room", "user": "Nelly-6", "date": "January 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123446716}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Very comfortable.", "title": "In need of a refurb I feel", "helpfulness": 1, "user": "BudgieYouKay", "date": "January 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 123162779}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 22, "average": 67, "very good": 97, "terrible": 24, "excellent": 66}, "aka": "Holiday Inn Bolton Centre Hotel", "slim_ranking": 0.375, "description": "Holiday Inn Bolton Centre is within easy reach of the M6, M61, M62 and M60 motorway networks making us ideally situated for both business and leisure. A large hotel boasting 132 bedrooms including 7 Executive bedrooms all with individually controlled air-conditioning. For conferences and events, Holiday Inn Bolton Centre can accommodate upto 340 delegates. We will ensure your conference, function or event runs like clockwork. Our superb facilities include wireless internet access. So for a successful conference in Bolton , look no further. We also boast the perfect venue for civil ceremonies and weddings in Bolton with our very beautiful Cloisters suite, a converted church and hidden jewel of the North West. And for a place to dine, the stylish Lounge Bar and Restaurant offers cuisine to suit all. Our leisure club, includes an indoor swimming pool, sauna, and gym. Local attractions include The Reebok Stadium, home to Bolton Wanderers, Old Trafford, home of Manchester United and City of Manchester Stadium, home of Manchester City FC the Trafford Centre, is close by aswell as other places of interest such as The Lowry Centre, Bury, Blackburn, Horwich, Chorley, Manchester, Oldham, Heywood, Rochdale and Darwen. In accordance with English law this hotel is non-smoking throughout."}