{"user_rating": 4.0, "review_count": 103, "name": "Holiday Inn Express Corvallis", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "While the river view is mainly trees in the summer, the beds are big and soft, and the rooms big enough for a good eight people to hang out. Bathrooms could use updating and a better showerhead but overall, solid for the price.", "title": "Comfortable and spacious", "user": "David W", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167241699}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I agree with other reviewers that this hotel is good value and is in a great location in Corvallis. What concerned me a little is that there were lots of little dogs around, and so I asked about their dog policy and how they accommodate people who suffer from allergies. While I don't suffer from allergies, I have friends that do.", "title": "Good hotel, but not sure of their dog policy", "helpfulness": 1, "user": "2wsx3edc", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165904412}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Unfortunately, their policy is that dogs can stay in any room. They were completely insensitive to the fact that this might impact those who have allergies. They agreed that often the owners will not admit when their dogs have \"accidents\" in the room, and simply pick up or dry up the problem,", "title": "Good location and updated rooms", "helpfulness": 1, "user": "conalvo", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162188023}, {"rating": 5.0, "title": "Just great!", "text": "It's a shame that the policy seems to favor little dogs over humans :(", "user": "pixiecat1979", "date": "May 25, 2013", "id": 161835743}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Pete", "title": "Tournament visitors will love it", "user": "GertOregon", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 160850520}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I've stayed at this hotel many times since it was built years ago. The property has been well maintained over the years. The rooms are still nice, beds comfortable, and the breakfast is standard for a Holiday Inn Express. The staff is always pleasant and helpful. The hotel is not in a convenient location for anything in Corvallis, but then Corvallis is not very big (15 minutes to anywhere). The underground garage is nice to get to your room and stay dry on those rainy days. If you stay on the river side, you will have a nice scenic view and may get to see the Oregon State crew team practicing on the river. If you like walking or running, there is a very nice path that starts just a block from the hotel.", "title": "Nice place to stay", "user": "Rangemgr", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 144707696}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We recently reserved rooms for wedding guests and arranged a wedding breakfast in their conference room. Staff were extremely helpful and went out of their way to create a great experience for family members and a wonderful post wedding breakfast event. The motel is close to town and our wedding venue which was another bonus. Shuttle service is available for wedding guests with prearrangement. Overall a great place to stay and wonderful staff to work with.", "title": "Great place for wedding guests to stay", "user": "ingabinga52", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140127952}, {"rating": 5.0, "title": "Great location, friendly service", "text": "This was my second time to stay here and it was once again an above average HIE.", "user": "Ron S", "date": "September 4, 2012", "id": 139395449}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "They have a great location on the river and you can easily stroll into downtown via the parkway river path directly behind the hotel.", "title": "Good stay, nice staff", "user": "3Magpies", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139194167}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Typical hotel of this brand. Everything was comfortable and clean We paid up for the river view and were glad we did, but we didn't spend enough time in the room to say whether it was worth it. The full breakfast is great, everything from fresh eggs and bacon to pancakes and cinnamon rolls. The staff is super friendly and the pool is clean and warm. Nice garage parking area with elavator access for guests A good choice for a Corvallis stay. The downtown is fun to walk around and there are many good restaurant choices. We'd stay here again.", "title": "Very Ordinary with a river view if you pay for it.", "user": "wanttogotoall50", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 139108192}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Located on the river with nice views. Really enjoyed the late night cookie snacks at 8pm, followed by PB&J at 9pm. Clean rooms and very friendly staff ! Quiet rooms and great for both business or families.", "title": "Great value", "user": "RickLee0288", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154871327}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "This is a nice hotel that is safe, clean and comfortable. Rooms are spacious. A small fitness center and indoor pool are available. A decent breakfast is included. You can park the car in the underground garage and explore downtown Corvallis on foot which is 10-20 min walk away depending on where you want to go. Sidewalks or a nice trail along the river make it easy to stroll and find a bar or restaurant that's right for you. The only concern that I have is that the price can be very high for what I think is a budget brand hotel. I would not pay 130, 150, even 180 dollars a night there. Hotels are generally pricey in Corvallis.", "title": "Comfortable and close to city center", "user": "Conrad_21", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154590056}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Clean, great bed, large screen TV, work desk, computer hook up free, microwave, coffee maker, ironing board with iron. Continental breakfast with hot entrees, underground parking was nice, especially when it rained. Hotel staff friendly, efficient and helpful. Since we had a car, getting around was not a problem. Everything is close by in Corvallis, it is not a large town.I would definitely stay there again.", "title": "Great place to stay", "user": "Watson O", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154517600}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I can't say enough good things about this hotel. The room quality with the hot tub in it, the good breakfast, the beautiful riverfront location, and teh front desk and customer service are all excellent. Highly recommended.", "title": "Wonderful hotel with great service", "user": "metava1", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154288699}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Love, love, love this Holiday Inn Express. The service is what makes it so special. The housekeeping staff takes immaculate care of this hotel. The front desk staff is genuine and caring. Lyndsay and Shanan take care of each guest and make sure their stay is seamless. The hotel has new televisions and comfy beds. I hear the rooms and public areas will be undergoing a renovation update soon. This will push this hotel even further over the top. Corvered parking, excellent breakfast, pool and spa help to set this hotel apart.", "title": "By Far The Best Hospitality in Corvallis", "helpfulness": 1, "user": "Nathan S", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 146188202}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "During check-in i was given an upgrade to a King Room with a river view. Everything else about my stay followed suit. The room was spacious. The bed very comfortable. The internet worked great. Parking was easy and the complementary breakfast was quite good as these types of breakfast go (read \"hot food\"). Most importantly the service was wonderful. The clerk at the front desk could not have been friendlier nor more helpful. I enjoyed my brief one night stay at this HIE and will most likely return in the future.", "title": "Excellent Stay", "user": "highdesertbadger", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174580866}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This was our third visit and we recommend this hotel highly. I grew up in Corvallis so we go there about once a year and we have stayed in many hotels there. This is our favorite because of the view of the river. But, a caution, get on the top floor and call them the day you arrive to remind them you are c coming and the approximate time you will arrive and ask them to please save a really good river view room for you. We had problems with this the first year we stayed there. The room is a standard, comfortable room, not the Ritz, but very good, well thought out, clean, large with the usual amenities. The breakfast room is large, faces the river and there is a large terrace reached by french doors where you can eat breakfast overlooking the river, heavenly! The food is above average for this type of hotel help yourself breakfast. The staff is friendly and helpful. We will be back again.", "title": "Our favorite place in Corvallis, get a view room", "user": "Dulciana77", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174501504}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This hotel has a great view, a friendly staff, clean rooms and it is in a great location. However, we booked our trip months in advance and when we got there they told us there was a plumbing problem and we had to move to a different room. We went from two queen beds to one king bed, a twin rollaway bed and an air mattress. The air mattress went flat after 4 hrs. We asked for a different one but they told us that they didn't have anymore because the plumbing problem relocated a lot of guests. So two of us had to share a twin bed. The parking lot was packed which was interesting considering they told us there were a lot of empty rooms. If you get the room you booked, you should be fine. But if they try to give you an air mattress, watch out! Also the water pressure is terrible and the air conditioner in our room was incredibly loud.", "title": "Not the best", "user": "NRMac360", "date": "August 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 173092628}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I have never been to Corvallis before this trip and relied on reviews to select my hotels and destinations. I was very happy with this hotel. It was in the most convenient location to walk to town, shops, restaurants, but it was not within normal walking distance to the university, if that is what you are in Corvallis to see. It is located right on the river with an outside area to sit and eat overlooking the river. There is indoor parking, and I felt very safe and comfortable here. There is a pathway along the river that leads you into town or you could walk along the street/sidewalk too. Lots of nice shops, restaurants, even a Farmers Market on Wednesdays.", "title": "Great location", "user": "SPKK06", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172135570}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel is situated close enough to other establishments so the guests will not have to drive too far for necessities such as food. However, it is also far enough to feel the peace and tranquility the Willamette river has to offer.", "title": "Amazing view!", "user": "exaggeratedsmile", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171419819}], "location": {"country": "United States", "city": "Corvallis"}, "stars": 2.5, "variance": {"poor": 7, "average": 8, "very good": 34, "terrible": 4, "excellent": 50}, "aka": "Holiday Inn Express Corvallis Hotel", "slim_ranking": 0.444444444444, "description": "Welcome to the Corvallis Holiday Inn Express on the River. We are home to Oregon State University and the Corvallis Knights Baseball Team. Our Willamette River location will inspire you! We welcome all ATS Systems and Hewlett Packard guests. While staying with us you will enjoy complimentary wireless Internet, complimentary breakfast buffet served each morning, and fresh-baked cookies with ice cold milk every evening. Don t miss out on our renowned PB&J sandwich bar to satisfy those late-night munchies! Our hotel is convenient to everything Corvallis has to offer. We are within walking distance to downtown restaurants and shopping. Additional amenities such as our fitness center, indoor pool and spa, in-room microwave and refrigerator will make you feel at home! For your business needs, we offer a 24-hour business center equipped with a PC, printer/ copier/ scanner. Plus, earn free enrollment in the Priority Club Rewards program and receive airline miles or points for your stay. Corvallis Holiday Inn Express on the River"}