{"user_rating": 3.5, "review_count": 629, "name": "Holiday Inn NYC - Manhattan 6th Avenue - Chelsea", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "A fantastic view from the room.", "title": "A great hotel", "helpfulness": 2, "user": "EasternWestSussex", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21910333, "likes": {"liked": "— The View", "disliked": "— Not applicable"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "That sums up the hotel room for me.", "title": "Never stay at this hotel for more than one night", "helpfulness": 1, "user": "luischable", "date": "November 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 21535893, "likes": {"liked": "— Staff tried but looked shell shocked", "disliked": "— Terrible Elevators"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "It also had a fantastic HD Flat screen TV, perfect air con, a comfortable bed and a great location. The 28th Street subway station is a 2 minute walk away, or you can be at MSG (Penn Station) in 5-10 minutes.", "title": "Good hotel with some things to look out for....", "helpfulness": 1, "user": "JackLond", "date": "October 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21434692, "likes": {"liked": "— Central Hotel, good bed.", "disliked": "— Internet was very slow in the mornings."}}], "location": {"country": "United States", "city": "New York City"}, "stars": 3.5, "variance": {"poor": 45, "average": 142, "very good": 281, "terrible": 32, "excellent": 129}, "aka": "Holiday Inn Nyc - Manhattan 6th Avenue Hotel New York City", "slim_ranking": 0.647058823529, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "New Hotel in Midtown Manhattan boasts state of the art new facilities. Enjoy comfort at the Holiday Inn Manhattan 6th Avenue in midtown Manhattan. This hotel is convenient to the JFK and LaGuardia airports and the attractions of NYC. Families looking for lodging in Manhattan are sure to enjoy staying at this New York City hotel, located on 26th Street with close proximity to many local attractions. Some of these attractions include Penn Station, the Statue of Liberty, Madison Square Garden, the Empire State Building, Times Square, Broadway, Herald Square, FIT, NYU, and Central Park. Corporate travelers are impressed by the convenience of our Manhattan accommodations. Situated in the business hub of New York City, our hotel is within walking distance of numerous large companies such as Motorola, Siemens, Metlife, IBM, Bank of America, Deloitte, JP Morgan Chase, Viacom, Verizon, Pfizer and Merrill Lynch. We are also close to Julliard, NYU and the Fashion Institute of Technology. In addition, our hotel offers a Business Center with fax, copying, printing and computer services, so you can stay in touch while you're on the road. Hotel amenities include a full-service restaurant and lounge, the Prime Cafe. While lodging at our midtown Manhattan hotel, you can keep up your daily routine by taking advantage of the 24-hour Fitness Center, or you can relax in the lounge and watch a game. Book your NYC hotel reservations now and save."}