{"user_rating": 4.0, "review_count": 187, "name": "Holiday Inn London Sutton", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "i've stayed here a few times, rooms are well maintained & equiped, close to train station staff are nice. never dissapointed if i stay here when i visit sutton, would definatley reccomand to other travelers", "title": "good place to stay", "user": "Craig L", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157887374}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed at this hotel over a weekend (we are Priority Club members) and found the rooms comfortable and clean and the staff helpful and courteous. The facilities were good and children enjoyed the swiming pool so much that they didn't want to leave it. Car parking cost £7 per day. The breakfast was included and was a good quality English breakfast.", "title": "Good hotel but bar food pricey", "user": "TramTourist", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157437981}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Our only gripe was the cost of the food in the bar at lunchtime and it was also slow to arrive. However alternatives are available in the centre of town which is just 2 minutes walk away. We were also disappointed that although we had reminded the hotel the previous day, the baby's cot had not been put in the room so the sleepy baby had to wait about 15 minutes whilst this was prepared.", "title": "Decent hotel", "user": "TheCatLady21", "date": "April 9, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 157154399}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "However overall it was a good experience and would certainly consider staying there again as it is close to the station with frequent trains to London.", "title": "Good stop over", "user": "Jean660", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156988735}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Stayed here for two nights, mainly as it was the only Hotel in the area and being members of Priority Club received a good room rate. However, breakfast was not included so we opted to walk into Sutton as it was reasonable weather and found some excellent cafes.", "title": "Enjoyable Experience", "user": "Sikace", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155699141}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "lovely time spent, very pleasant people and hotel i.s located centrally so everything and everywhere is within reach. The whole atmosphere is serene and calm, you cannot help but relax. Strongly recommended", "title": "Very comfortable", "user": "Danjuma O", "date": "March 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 155009480}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Stay here for work and it's an ideal business hotel.", "title": "Good value for money", "user": "CheekyChops14", "date": "March 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 154852142}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Only downside is that you get charged for Internet access which is bizarre when you can get free wifi in a host of places including the tube!", "title": "First class", "user": "kevin m", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153932483}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Hotel is clean, tidy and staff are friendly", "title": "Expensive wireless Internet connection", "user": "MsMunn", "date": "February 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 153038384}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Would recommend any for any business users", "title": "Steady improvement", "user": "Sloveniadave", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 152795497}, {"rating": 4.0, "title": "Perfectly acceptable", "text": "I was only in Sutton for a one night stop over as I had flown to the UK for a concert that evening and was returning home the next morning. The hotel was chosen on the basis of location and that it would hopefully be of an acceptable minimum standard. As it turned out it was really quite good. Why a hotel in Sutton would be near to full on a Friday night is beyond me but it was. I grew up nearby and in those days, although a bit scruffy, the town had a sort of charm about it. Not now! The hotel is modern, clean and the staff friendly - I was given an upgrade on arrival which was nice because I am not a frequent Holiday Inn customer. The room was of a reasonable size and the bed comfortable with a choice of pillows. My only complaint would be that the shower was in the bath rather than separate. Breakfast was of a good standard and the lady who was covering my table was attentive without being overbearing. This is my second experience of a Holiday Inn Express in the last month or so and at £80 a night for B&B I thought it offered satisfactory value for money.", "user": "BigMac58", "date": "May 17, 2013", "id": 161021992}, {"rating": 4.0, "title": "According to expectations", "text": "We were in London for 3 days on business. Our initial intention was to stay close to the center, but nothing was available (on budget!) so we resorted to Holiday Inn Sutton (which proved ideal because the job was in Sutton anyway!). The hotel was what you would expect of a Holiday Inn 4*. The twin beds were very comfortable and the service very good.", "user": "MikeAAthens", "date": "May 8, 2013", "id": 160099654}, {"rating": 4.0, "title": "Good Hotel & Service, Great Location as a base for sightseeing", "text": "One snag, which others have commented upon, was the pricey wi-fi: I understand it will be free as of July, but still! Another snag was the TV-screen: no-one thought of nailing it on the wall, instead of wasting half a desk and half a mirror?", "user": "Cangolf", "date": "May 7, 2013", "id": 159875542}, {"rating": 4.0, "title": "Good hotel, good location.", "text": "Did not try the spa, so I cannot comment.", "user": "Coley65", "date": "April 24, 2013", "id": 158693389}, {"rating": 4.0, "title": "Decent hotel", "text": "Sutton is a nice suburb, also, and the hotel is as central and as quiet as one would wish.", "user": "Dossie", "date": "April 16, 2013", "id": 157953966}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We booked this hotel and confirmed on booking our needs for a disabled room with a walk in shower and interconnecting room. On arrival we were shown to our rooms...the second room being on a completly different floor!! We complained and got an apology from the manager who blamed the booking line operator, we got upgraded to a suite but our weekend away was ruined. It was hard work for my friend to get around in her wheelchair so I ended up having to move furniture!! She couldn't access the bathroom facilities at all and the staff suggested I take her downstairs to the showers and cover her with a towel to go back to the room! Needless to say we haven't booked there again.", "title": "Very dissapointing", "user": "Tasha L", "date": "February 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 152044724}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel is comfortable, quiet, with a very good restaurant. It is close to everything - shopping, train station, bus lines. Parking is ample and convenient. Make sure you ask for the breakfast voucher at check-in, otherwise, breakfast costs more without the voucher. The hotel is a bit expensive to stay at, however.", "title": "very nice and convenient", "user": "Liva A", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151885060}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "had over 30 stays here - business obliging - therefore I deem to be in a position to be able to", "title": "question of monopoly", "user": "okrased", "date": "February 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 151669808}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "rate this hotel at its right value.", "title": "Internet should always be free!", "user": "Scott W", "date": "February 4, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 151419843}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "can t really complain about the service level, being a regular which would be recognized every time, but ultimately I am not asking them for much.", "title": "Lovely Stay!", "user": "musicjazz", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150179897}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 37, "very good": 92, "terrible": 8, "excellent": 40}, "aka": "Holiday Inn London - Sutton Hotel", "slim_ranking": 0.666666666667, "description": "Welcome to the Holiday Inn London-Sutton, a modern, full service hotel situated in the heart of Sutton town centre. Perfectly located for many famous Surrey & South London attractions and events Chessington World of Adventure, Wimbledon All England Tennis Club and Epsom Racecourse to name a few. The Holiday Inn, Sutton is easily accessible from Croydon to the east, Kingston to the west, Wimbledon to the north and from the M25 to the south. The hotel has 119 air conditioned bedrooms, including 4 suites, 2 DDA rooms as well 20 Executive rooms all which have en suite facilities, including high speed internet access (HSIA). Kids stay and eat free*. Our Hotel restaurant, lounge and bar offering tempting dishes from around the world including the famous Holiday Inn breakfast. Squiggles Lounge also offers wireless internet connections. The Holiday Inn Meetings Network Rooms and Orchard Suite are self contained on the first floor. A well known venue which comfortably seats 160 for a celebratory meal, or 200 for a corporate meeting. Spirit Health Club, located within the hotel, is open to members and residents. The gymnasium, indoor heated pool, spa, sauna & steam rooms are available to residents on a complimentary basis. *Terms and conditions apply."}