{"user_rating": 4.5, "review_count": 1961, "name": "Holiday Inn Resort Phuket", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "As a family of four we stayed for 5 nights at the Holiday Inn, in 2 connecting superior rooms which were fabulous. The rooms were spacious enough for two and clean and well maintained. The staff were friendly and helpful - when we had a problem with our safe they were up within minutes of us ringing the front desk. The buffet breakfast was great with plently of choice and excellent service. The pool area was faultless as was the service around the pool.", "title": "Faultless", "helpfulness": 4, "user": "whatthe111111", "date": "July 16, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 8126214, "likes": {"liked": "— clean rooms", "disliked": "— having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "The hotel is in a great location - opposite the clean beach and close to all the shopping, restaurants etc. No street noise could be heard from in the grounds of the hotel yet depending where your room is situated you might hear the solo singer/band from 10pm - midnight most nights from one of the bars near the reception area. Could be a problem if you are a light sleeper - not an issue for us and we were directly opposite the bar.", "title": "No faults from us.", "helpfulness": 3, "user": "shezcayley", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8120354, "likes": {"liked": "— The service", "disliked": "— Rude tourists"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Really could not fault the hotel go and enjoy!", "title": "Great hotel", "helpfulness": 5, "user": "dragonlady2411", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8115484, "likes": {"liked": "— The Busakorn pool", "disliked": "— The hard beds; no bath"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The Holiday Inn is a fantastic place to stay and I cannot understand some people complaining. We stayed at the Busakorn wing and had no problems. There is no swimming after 8pm but we sneaked down and as long as people are quiet I don't think they really mind.", "title": "bad service but good for children", "helpfulness": 1, "user": "suruchisethia", "date": "June 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 8023805, "likes": {"liked": "— the kids pool and kids club", "disliked": "— the rooms and bellboy"}}, {"rating": 5.0, "title": "Superior room Family Holiday", "text": "The servicer is excellent and we had no problems with noice or anything else. It was a wonderful relaxing holiday and we as a group of six adults ranging from 21 to 53 had a great Holiday and were in no hurry to come home. We stayed 2 weeks and will return. We stayed also in the main wing October 2006, The ocean is calmer at this time. The weather this July was perfect and I have a great tan. Arrived home yesterday the 14/7/2007 and want to go back already.", "helpfulness": 18, "user": "Tritton", "date": "June 27, 2007", "id": 8003184}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Well...what a fantastic time. Really all that has been said before was exactly as it is. I stayed with my 2 children (8 & 10) in the Busakorn Wing. it was originally 3 nights there then over to the Main Wing but I found the bed setup in the Busakorn worked better for us so upgraded for the other 6 nights. Only cost an extra $100 so wasn't a problem. If you want piece and quiet at breakfast time head to the Busakorn as the Main Wing is very noisy and busy. They both have virtually the same food. The Busakorn pool lounges are reserved for Busakorn guests only which is Ok but the lounge hogs really need to be sorted out. Towels were on lounges from 6.30 then not used for hours then at lunchtime lounges would be left with books etc and nobody there for hours. The hotel really needs to sort out this problem as it isn't fair for everyone. They have staff monitoring the situation but don't really take towels away too often although they do watch out for main wing people using the lounges which i didn't see as a big a problem. The over 12 club is fantastic place for the kids when they are oh so over shopping. They also had the free henna done there which is great as it's a bit pricey out on the beach.", "title": "Great Family Resort", "helpfulness": 6, "user": "Jennyr_au", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8418644, "likes": {"liked": "— Location", "disliked": "— Pool Hogs"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We did a few trips around. We travelled with another 2 families who were staying in the main wing. Went by Tuk Tuk to Kata Beach (400 bht) which was a great day out and a lot nicer beach than Patong Beach also a nice drive. There were 9 of us so quiet cosy in the tuk tuk. We also went Elephant treking, Monkey show (not fussed) Snake show and Go Karts. All good fun. We also visited the Cashew Nut shop....unreal.....all the cashews you can eat .....had no idea they could do so much with Cashews!! Brought home a bag load that's for sure.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "Paige_je", "date": "August 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8404071, "likes": {"liked": "— Location", "disliked": "— Absolutly Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We went on a trip to Phi Phi island as well. Were very lucky as the seas had been really rough and the day we went it was great. Make sure you find out before you go what the seas are like, we were told at a diving shop it was too rough so put off our trip and it worked out perfect. Went by speed boat which was heaps of fun. Mayer Bay was a disapointment due to so many people. Would still go but don't expect to have the place to yourself. Would only go for a drive by next time. The rest of the trip was great.", "title": "Good Service & Locality", "helpfulness": 3, "user": "Lynndier", "date": "August 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8370726, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "We went to Fantasea and definately wouldn't bother again. The show itself was ok but strange with a magic show in the middle of it. As you walk through the park it's just one big push to buy tacky souveniers. Then you can't take your camera in but are then inundated with people trying to take your photo so you'll buy them.", "title": "Thank you Holiday Inn Phuket!!", "helpfulness": 13, "user": "hutchoPerth", "date": "July 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8245948, "likes": {"liked": "— friendly helpfull staff, fabulous room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The Holiday Inn is in a great position next to the markets. We went there to eat , shop and drink as well. Great cheap alternative to most restaurants charging 17% ontop of everything.", "title": "FRIENDLY PEOPLE.", "helpfulness": 3, "user": "TheEnglishGentlemen", "date": "July 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8238214, "likes": {"liked": "— very comfortable and clean.", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Just got back from two weeks at the Holiday Inn and could not fault it in any way", "title": "fantastic", "helpfulness": 5, "user": "cassieja", "date": "June 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7998224, "likes": {"liked": "— great location great service extremely good food and pool", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I went with my parents in their 70's my husband and two children ages 16 n 13 and it catered for all", "title": "sawasdee, fantastic, outdone reviews", "helpfulness": 6, "user": "jcdandrd", "date": "June 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7924072, "likes": {"liked": "— everything about the busakorn wing", "disliked": "— the odd bull frog singing at night, which was relocated when requested"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The staff are more than kind as they went out of their way to accommodate any wish we had.. we stayed in the buskorn wing which was great.. especially the shower it was actually hard to leave it!", "title": "Great place to stay in Phuket", "helpfulness": 6, "user": "Ozzieflyer", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7871033, "likes": {"liked": "— Aspara Spa", "disliked": "— Having to leave :-("}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Guards are posted on the elevators and entrances so you feel totally secure there at all times", "title": "Great Hotel", "helpfulness": 15, "user": "kimnrich", "date": "June 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7838848, "likes": {"liked": "— Busakorn wing pool", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Having ur own fridge in ur room to stock with what u want meant we saved so much money on drinks especially for the kids as we bought everything at the 7/11", "title": "Absolutely The Best!", "helpfulness": 15, "user": "crystalkong", "date": "June 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7817033, "likes": {"liked": "— ambience & location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We have just returned from 12 nights of absolute bliss. Friends of ours had stayed there before & recommended we stay at the Busakorn wing at the Holiday Inn so we did & just loved it. We stayed in a pool villa room, which meant we had the pool right at our doorstep, which was heaven! The main wing is still quite nice but we found the pool & restaurant had quite a different feeling as there were a lot more families & kids! We were there in the \"Monsoon season' but we had such great weather, only a couple of days with an afternoon shower which lasted about 20 mins and any other rain was overnight. It was very hot though, about 34 everyday with what felt like 100% humidity! but with the pool & air con it was fine.", "title": "Love this place!", "helpfulness": 14, "user": "DeeandGraham", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8231374}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I have to recommend you visit the following-: the first is the gibbon rehabilitation project at Bang Pae Waterfall. This is like our RSPCA & they take in mistreated Gibbons. They receive no Government support they rely on donations and volunteers. We were heartbroken by some of the things we found out these animals had been through and decided to sponsor a Gibbon. This money helps provide food and other supplies (to ‘Bam Bam’ our gibbon as well as the others). We met a wonderful girl there who was donating 4 weeks of her time to work there to help these amazing animals. There is also a waterfall not far from the Gibbon center to see. Take some water though as it’s very hot! Tell everyone you know that is going to Thailand about this because I don't think it gets much publicity.", "title": "The sensational Holiday Inn family suite", "helpfulness": 7, "user": "snoopcoop23", "date": "July 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8230366, "likes": {"liked": "— Room, food choices, location and pool's"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My 2nd recommendation if you are going to do an elephant ride is to go to Baan Chang (elephant & Gibbon rehab) which is near the Kata view point, this is one of the only places in Phuket where the elephants are kept and ridden through almost their natural surroundings, an amazing jungle like area which is awesome for these animals and makes for a great ride! It’s a center for elephants that had been formerly abused in the heavy labor logging camps in the north of Thailand. They are kept very well and you can feed them bananas at the end as their reward! You also get to spend time with 2 wild Gibbons afterwards that that hang out at the bar, they are beautiful, so tame and placid & just love your affection & rubs! Charley was just so cute I am sure he thought he was a human! I have to say after to speaking with a lot of people & our great experience this is without doubt the best place to ride an elephant in Phuket. Call Richard on 081-893-4686 when you are there & he organises your transfers so cheaply (about 100Baht each from Patong) & gives you a de-brief before you go.", "title": "Great family hotel but not exceptional", "helpfulness": 9, "user": "Rowie1", "date": "July 24, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8225644, "likes": {"liked": "— Children's facilities", "disliked": "— Staff attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I would also recommend not going to the Zoo, the tigers are drugged there so they can make money from tourists having their photo taken, the tiger can hardly lift it’s head off the ground, and the other animals are in very small cages so if you have any love for animals DONT GO!", "title": "Great for families", "helpfulness": 1, "user": "Brossie", "date": "July 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8183924, "likes": {"liked": "— Overall level of service", "disliked": "— Noise from street"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled with family", "text": "We found a great Taxi driver which drove us everywhere (except the Elephant rehab) while we were there, he took us to the most amazing places (some of which only the locals no about) & gave us all the history of the towns & with the absolute necessity of air con! If you are interested his name is Wit & his number is [--]. We found this much cheaper than the tours the hotel organised (like trips to markets etc).", "title": "Great Location, great for kids, can't wait to go back", "helpfulness": 8, "user": "Shashie", "date": "July 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8131700, "likes": {"liked": "— The buffet breakfast and hotel location", "disliked": "— That the busakorn wing had a better pool"}}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 44, "average": 130, "very good": 516, "terrible": 22, "excellent": 1249}, "aka": "Holiday Inn Resort Phuket Hotel", "slim_ranking": 0.0236220472441, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "“Patong’s best choice for Everyday Travelers”Holiday Inn Resort Phuket, perfectly located in the heart of Patong, Phuket’s most famous beach. Holiday Inn Resort Phuket is an oasis in the middle of Patong and is within walking distance to shopping, restaurants and night life and just steps away from the beach. 10 minutes away from Jungeceylon shopping center, Soi Bangla Nightlife, and Patong beach is just across the road.High speed internet is provided FREE of charge for hotels guests.Holiday Inn Resort Phuket is part of the world’s most recognized upper mid-scale brands, and it offers a fantastic choice with seven different room categories, separated in two distinctive wings. The contemporary-designed main wing is popular for its kids and family-friendly rooms and facilities. The resort is honored as a top 10 Family Resort in Asia by Tripadvisor. The Luxury Busakorn wing with Thai design offers spacious rooms with pool view or pool access in a tranquil pool and tropical garden environment appreciated by couples seeking a more intimate resort experience.Holiday Inn Resort Phuket is well-known for its excellent breakfast buffet and great value cuisine in the resort’s 4 restaurants. Holiday Inn Resort Phuket provides daily guest activities and dedicated kids facilities. A refreshing spa and several pools in tropical gardens give choices to relax or be active.At the heart of Patong, Holiday Inn Resort Phuket offers guests a warm Thai welcome, friendly service and total ease, simply Patong’s best Choice."}