{"user_rating": 3.5, "review_count": 115, "name": "Holiday Inn Express Hartford-Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Great location across from Bushnell Park. Best free continental breakfast I have seen. Nice internet room and fitness room. Staff friendly. Comfortable beds. Just need counter space in bathrooms There is none. Also didn't like that it cost $12 a night to park in the hotel lot which is added to your bill.", "title": "Not A Bad Place", "user": "ValleyRoad", "date": "October 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10152662, "likes": {"liked": "— The continental breakfast", "disliked": "— The $12 a night fee to park"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "My new lower company expense plan made this a necessary choice. Lets start with the positive - The bed was a decent sleep and the location is great. I traveled on this business trip with two other co-workers and their assessments were quite the same. The view is a choice of the park and what we guessed was the Capital Building (beautiful); one co-worker had this. Or the very expensive parking lot (more on that later) and a view of a bar in the near distance. Two of had this view and the bar was only noticeable because at about 9PM until very late the blaring and pounding music was ever present to help soothe you to sleep. As a bonus when you look out your window when the tunes first start you get a view of two very large projection screens of chicks (in one case 2 cheerleaders) dancing together late into the night. Sure I would normally look at this as a bonus, but I could not help but think of any family vacations going on and the conversations this would start. The room was clean, with a weird smell that only got worse when you walked through the very warm halls to and from your home away from home. The bathroom has NO counter space and the free toiletries were adequate except for one thing - the mouthwash. I polled my fellow travelers and 2 of 3 had this experience: The small bottle of mouthwash looked as if it had spent the night lodged in the wrong orifice for which it was intended. It was really nasty looking and that is the only way to describe the way it appeared.", "title": "Watch the Mouthwash...", "helpfulness": 2, "user": "cdcart", "date": "August 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 8347920, "likes": {"liked": "— Location", "disliked": "— Nearby loud bar and Icky mouthwash incident"}}, {"rating": 1.0, "title": "Strong Oder in Room", "text": "We stayed two days, one day there were no newspapers delivered - small thing and the manager did apologize to us, even though we never intended mentioning it. The second day there was no breakfast because \"someone called in sick.\"", "user": "smitty1289", "date": "June 11, 2007", "id": 7832943}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The parking lot is directly behind the building, but beware of the little dudes trying to run it like they are playing a massive game of checkers. No matter where you decide to park, they will try to get you to move for no apparent reason. Just say no and refuse their very open requests for tips (not sure for what.) They will also try to get money from you in the lot, but you pay inside the hotel - DO NOT PAY THEM. They are only there for evening parkers who will visit the many GREAT restaurant choices within walking distance.", "title": "Only if you have to. Parking extra$", "user": "joeyjcc", "date": "March 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6916921, "likes": {"liked": "— Cleanliness", "disliked": "— Noise and parking."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I have stayed there three times in the last two months for work. Two of those times the room had has an strong oder of some kind of cleaning chemicle. It hits you the second you open the door & walk in. What really makes matters worse is that the windows are all sealed shut. There's no way to get any fresh air! If the windows opened it really wouldn't be a big deal at all.", "title": "adequate for short stay", "user": "fpk1005", "date": "November 16, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 2.0, "cleanliness": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6137336, "likes": {"liked": "— proximity to our meeting locations", "disliked": "— noise level"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Has no parking [parking is on an adjacent pay lot][nine dollars per day]. Eigth floor has a good view over looking a park and the state capitol bldg. Dirty carpets. Extremely small bath, no place to set a shaving kit, bath room does not have an exhaust fan. Street noise is very loud. Hartford has lots of loud motorcycles and ambulances that travel on Asylum St. They sound like they are coming thru your room. The hotel is adjacent to the Amtrac train line and the trains makes a lot of noise when they pass by. The room was small with two double beds and a desk. The T.V. must have been ten years old with a blurry picture. All in all for approximately $140.00 per night That was highway robbery. I have been a guest at Holiday Inns in many states and without a doubt this is the worst hotel that I have stayed in. If I ever have to travel to Hartford again I will definately stay in a different hotel...", "title": "A twenty five cent hotel with a million dollar view", "helpfulness": 5, "user": "MdIslandHopper", "date": "May 9, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 5046187}, {"rating": 3.0, "title": "Holiday Inn Express Conveniently Located", "text": "Although the Holiday Inn Express on Asylum Street in Hartford, CT, is opposite the State House and therefore a good location for business travelers, it’s also a convenient place to stay if you are in Hartford for pleasure.", "helpfulness": 1, "user": "LFAN", "date": "February 20, 2006", "id": 4474279}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I tend to belive the negative reviews, so I was a bit nervous about staying here (although my company was paying for it!). I was in town with my partner for an awards dinner and had been wondering what we going to be getting from the moment we started packing. One thing to remember is that everyone has different tastes and different expectation levels - mine tend to be a tad too high sometimes - THIS HOTEL DID NOT DISSAPPOINT AT ALL.", "title": "QUITE nice, actually!", "helpfulness": 1, "user": "ddbodine", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6111949, "likes": {"liked": "— The bed.", "disliked": "— The slow elevator."}}, {"rating": 3.0, "title": "Ok for the price", "text": "We arrived around 10:45am. Assuming this was way to early we were just going to have them keep our luggage while we walked around the city (which they do for FREE). Much to our surprise there was a room available! The only down side was that it had a view of the parking lot & interstate rather than Bushnell Park & the capital across the street - having been driving, flying & riding since 4:00am we didn't care & jumped on it! We were advised of this by the front desk clerk up front, so it was no surprise.", "user": "DEEPnIT", "date": "October 7, 2006", "id": 5924798}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The room was very nice - much better than Holiday Inn's around here (NC). It was an avg size room, but nicely appointed, on the 9th floor. The bathroom was tiny, but again, VERY nicely appointed (just needed another shelf for toiletries). Great water pressure too! Typically I like a mini-fridge in a room, but since we were hardly IN the room, it was fine. The bed was VERRRY comfortable w/great sheets & pillows. They give you a selection of pillows, each marked \"soft\" or \"firm.\" Very nice full-size chair/ottoman and work desk with lamp & coffee maker.", "title": "Great value in downtown Hartford", "user": "TrippettF", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5768521, "likes": {"liked": "— Location downtown. Comfort."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The front desk staff were also QUITE helpful. They have a large binder they'll let you borrow for a bit CHOCK FULL of menus from local restaurants, including those that will deliver @ 2:00am! **on a side note, go eat at \"Hot Tomato\" next door..mmmm** I asked for extra towels & the clerk gave them to me immediatly - no waiting for housekeeping as you may expect!! The lobby furniture is also quite comfortable if you're waiting on a friend or taxi.", "title": "Wonderful Experience at Holiday Inn Express!", "user": "elananic", "date": "July 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5515474, "likes": {"liked": "— The sheets.", "disliked": "— Paying for parking....$9 a day."}}, {"rating": 1.0, "title": "stay away", "text": "The only down sides were the slow elevators and having to go from the 9th floor to the 7th or 4th floor for ice. Other than that it was a GREAT stay - these little things are easily forgiven.", "user": "suzyqq", "date": "June 28, 2006", "id": 5407125}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I stayed here for a short sales meeting. The staff was very friendly. The guest room and meeting room were fine. The fitness room was pretty well equipped. The breakfast room was big and the food was well stocked. Good location with great view if room is in front of hotel. Quite a few restaurants and bars in within close walking distance.", "title": "Pretty good but internet was an issue", "user": "MIRay", "date": "March 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 27029221}, {"rating": 1.0, "stay_parameters": "Stayed January 2009", "text": "The glitches were that one of the two elevators was broken for the three days I was here. This would not have been such a big deal except that the stairways gave only limited access to parts of the hotel. You could not access the meeting room floor using the stairs and if you came down to ground level, you were outside.", "title": "no sleep on Friday nights", "user": "happymike21", "date": "January 29, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 1.0, "rooms": 5.0, "location": 5.0}, "id": 23999271}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The biggest issue I had was the internet access which was important to me as I was traveling on business. For three straight nights I was unable to log on to the internet in my room because their maximum number of users had been reached. Very strange. The manager was concerned - she apologized, told me that this issue should be corrected this spring, and gave me additional points for my stay. If having internet is important, I would double check with the management before booking a room here.", "title": "Very nice hotel, but beware the loud dance club!", "user": "MARKHROTH", "date": "November 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 21669889, "likes": {"liked": "— Location, cleanliness", "disliked": "— Small bathroom, loud club opposite"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The hotel is in downtown Hartford, surrounded by night clubs. So, it's not the hotels fault -- and the hotel staff -- every person --was wonderful. But on Friday nights (and I am told Saturday nights) -- the music on the side of the hotel we stayed in was so loud as to make sleep impossible...at 1AM I drove to an all night pharmacy to buy ear plugs...bring them in advance and save yourself the hassle.", "title": "Your typical Holiday inn", "user": "LauraLovesZippy", "date": "May 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 16199660, "likes": {"liked": "— Comfy bed and yummy breakfast.", "disliked": "— Grumpy breakfast attendant."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This is a very nice hotel, conveniently located 1 minute off I-84. The hotel is compact but clean and comfortable. We were traveling with our 2 younger kids (16 and 14) and had requested a cot, only to be told at check-in that all rooms have 2 double beds and are too small for a cot. That was unfortunate. Also, the bathroom is small with a pedestal sink that allows NO room for storage of any personal items. The breakfast was very nice, typical HI Express, with a very attentive server making sure everything was clean and refilled. There are several restaurants in walking distance. We had a room in the back overlooking the parking lot, and we discovered at 10PM that there is some kind of dance club across the parking lot, playing as you would expect very loud music. So best to request a room at the front if you want to go to sleep at a reasonable hour!", "title": "Excellent Stay", "user": "djkbooks", "date": "February 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13493602}], "location": {"country": "United States", "city": "Hartford"}, "stars": 2.5, "variance": {"poor": 13, "average": 34, "very good": 38, "terrible": 11, "excellent": 19}, "aka": "Holiday Inn Express Hartford-Downtown Hotel", "slim_ranking": 0.7, "description": "Welcome to the Holiday Inn Express Downtown Hartford . Our hotel is conveniently located in the heart of downtown Hartford, the Insurance Capital of the World, and is easily accessed from I-91 and I-84. We are steps from the Union Station for visitors traveling via bus or train. The hotel is located directly across from Bushnell Park and features views of the Capitol Building. We are also just 14 miles from Bradley International Airport. At the Holiday Inn Express Hartford Downtown, you will find newly renovated guest rooms with all the comforts of home. You can stay connected in our modern business center or with our complimentary easy access, high-speed Internet. For the health conscious, stay in shape in our state-of-the-art fitness center. Guests on the go can start their day right with our complimentary Smart Start Breakfast featuring our world-famous cinnamon rolls. Business travelers are sure to enjoy our hotel while visiting the 'Insurance Capital.' We are in walking distance to many area businesses. Guests here for leisure will be happy to know we are walking distance to the XL Center, the Bushnell Theater, Connecticut Convention Center and many award winning restaurants. Whether you are traveling on business or pleasure, Stay Smart at the Holiday Inn Express, Hartford Downtown where our staff will be sure to exceed your expectations."}