{"user_rating": 3.5, "review_count": 511, "name": "Holiday Inn Sydney Airport", "reviews": [{"rating": 5.0, "title": "Great location and secure parking to leave your car whilst away", "text": "I have stayed at this hotel before both experiences have been great. The rooms are clean and comfortable, beds super comfy and choice between firm and soft pillows. The bar and restaurant downstairs has a good atmosphere and good food. Staff are friendly and helpful in planning your trip to the airport. The shuttle is cheap but can take a bit of time depending on how many people need to get dropped off a domestic first as international airport is second, the traffic to the airport can be quite thick so allow a bit of extra time. I have parked my car here for 2 weeks whilst I was overseas, it was secure and the parking cost was very reasonable compared to other options near the airport. Would stay at the holiday inn again", "user": "Bayleigh P", "date": "December 2, 2012", "id": 146602788}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Hotel is a little dated.", "title": "Not up to advertised standard", "helpfulness": 1, "user": "AucklandTrammie", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 146353967}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Hallways were shabby with worn carpet.", "title": "Clean, quiet and a cheap airport shuttle", "helpfulness": 1, "user": "Tghu V", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146197655}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Family room was a little cramped.", "title": "park, stay and go", "helpfulness": 2, "user": "LCC20", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146101694}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Very little room to put suitcases.", "title": "Close to airport and a good place to stay", "user": "PDM77059", "date": "November 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146092173}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "lovely hotel, friendly staff, great clean comfortable rooms (some with a runway view - but little noise as airport closed at night)", "title": "comfortable hotel, good location", "user": "ds999999999", "date": "November 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145983474}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "easy from airport - either catch hotel shuttle (about every 30 minutes or so, at oz 6 each way) or bus 400, destination bondi junction, every 20 mins which takes about 12 minutes from international terminal, 2 mins from domestic (it is about 10 minutes walk) bus costs OZ 3.50 each way.", "title": "Chaos among the calm.", "user": "crocnsw", "date": "November 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 145918783}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "from the city take an airport line train from central station and get off at mascot. walk up the hill, over the lights, and the hotel is fifty yards on the left hand side - opposite the qantas building.", "title": "Very Convenient Position & Package", "user": "holly255060", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145848261}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "rooms have nice clean, crisp bedding with lots of pillows, plenty of drawer and hanging space, spotlessly clean.", "title": "Handy to airport if you can put up with the shuttles", "user": "WATravellerPerth", "date": "November 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 145682204}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "full size bath with shower and a nice range of toiletries. fluffy towels!", "title": "Sufficient for a night in transit", "user": "johnny3_16", "date": "November 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145630529}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I stayed at this hotel for 1 night whilst attending a business meeting at the hotel. The rooms have that old renovated feeling which never compares to a new modern hotel. The restaurant in the lobby (Amelias) was first class. I had an awesome steak and wine and the following morning had a buffet breakfast which was excellent, the Omelette I had was one of the best ever and the Coffee and Fresh Juice was Top Shelf. Forget the hotel bus that leaves from the airport, I waited nearly 1 hour for the bus (Which cost $6) and it turns out you could walk to the hotel in 10 minutes.", "title": "OLD RENOVATED HOTEL WITH EXECELLENT FOOD", "user": "NickJodySiena", "date": "November 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 145120928}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I have found that Airport Hotels can be variable in quality, but my Wife and I have now stayed in this Holiday Inn a number of times before & after o/s trips.", "title": "Great Convenient Place", "user": "FarmerJohn45", "date": "November 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145119294}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "At each stay we have found, friendly helpful staff, good food in the restaurant, excellent shuttle service & a general all round good experience.", "title": "A reasonable place to stay", "user": "Judi B", "date": "November 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144990583}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I can recommend this to any travellers through Sydney.", "title": "Very Close to Airport", "user": "Martin G", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144801472}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Additionally we were on our way o/s and booked a show in town, the train station was located nearby and just 7 minutes ride from City Central, trains ran frequently and were sufficiently clean & uncrowded to make it a reasonable ride", "title": "Great Package", "user": "Jennifer F", "date": "November 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144447471}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Not wanting to endure a long rail trip to the airport for a morning flight I opted to stay at the Holiday Inn, Sydney Airport. The location is convienient and an easy walk from the \"Mascot\" City Rail station. The hotel shuttle is a nominal AU $4.00. An easy, safe, walk to Mascot station & all of Sydney area is within easy reach. Usual \"airport pricing\" for food, however the drink prices were reasonable for the area. Don't plan on walking to any resturants as the area is mostly large commercial complexes. Take the rail as mentioned above. You can negotiate a rate on the weekends. Check your bill upon checkout as I found my billing was $10.00 above the rate quoted upon checkin. Probably an oversight as there was no problem in obtaining adjustment.", "title": "Short on time-stay here", "helpfulness": 4, "user": "hiwayhowie", "date": "November 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4090727}, {"rating": 5.0, "title": "Hotel experience", "text": "Great hotel, very friendly staff. Rooms great, they have carried out a lot of refurbishment and offer great facilities. New gym is great.", "helpfulness": 4, "user": "SydneyBeaches10", "date": "October 5, 2005", "id": 3995239}, {"rating": 2.0, "stay_parameters": "Stayed June 2004", "text": "We have also stayed at the Holiday Inn on several occasions and each time have had problems with the hotel's restaurant. Bad service mostly, and on one occasion it was an hour before the meal was served! Not what you need when either coming off a long flight or preparing for one.", "title": "Restaurant Woes", "helpfulness": 8, "user": "Vilavisitor", "date": "June 29, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 2229896}, {"rating": 2.0, "title": "Serves the Purpose (overnight stopover etc..)", "text": "My daughter and I arrived at the Holiday Inn Syd Airport at 6pm, we had just got off an international flight (as a lot of guests do). We went to have a meal in the restaurant, but sadly we were informed we should have booked ahead as there wasn't a table for two available until 8pm.(It was Wed night) Being an 'airport hotel' how do you book ahead for the restaurant?? We didn't want to sit around for 2 hrs and wait for a table to become available, we wanted to eat, have a shower and get some sleep. Isn't this what most travellers want? We went to our room where we tried to book a wakeup call and an airport bus for the following morning, an answering machine said to leave all the details and the hotel staff would listen to the message later and book call and bus. I just didn't feel comfortable talking to a machine about my wakeup time and my 5am airport bus. Maybe it was the overwhelming sense of efficiency I didn't get when I checked in that worried me. I phoned the reception to ask if I could verify the message left on the machine. They assured me it was ok. It was. We were awoken the next morning on time and took the bus on time. The rooms were extremely spacious and acturally quite luxurious. The bed was a king single even though we were assured it was a double by reservation staff. We made do. Basically the extra frequent flyer points I earned for staying at Hol. Inn were almost worth it.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 24, 2004", "id": 2220135}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The Holiday Inn Sydney Airport isn't a horrible choice, but it certainly did not distinguish itself. My first impression of the room was that the decor was somewhat modern, but I could also see ring stains on the night stands, which indicated a poor housekeeping job. The lighting in the room was poor and it gave the room a dingy hue in the evenings. My biggest complaint is that the mattress was saggy, worn, and obviously well past the age at which it should have been replaced. I give credit for the choice of pillows, though.", "title": "Mediocre at best...", "user": "joeb1249", "date": "December 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 147078051}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Internet connectivity is available in the rooms for a whopping AUD27 per day, which is well above average for most business hotels nowadays. Worse was the fact that I couldn't get any wireless signal in my room and had to rely on the cable connection. This worked fine for my laptop, but rendered my phone useless unless I went down to the lobby to get connected. I complained twice about this, but the issue was never addressed.", "title": "Fantastic Service, Conveniently Located, Quiet for an Airport Hotel!", "user": "TravlinMan_12", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147032013}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Breakfast in the hotel restaurant is priced at an exorbitant AUD25 for a hot meal and AUD16 for a continental breakfast. My one visit to the restaurant for dinner rendered a passable meal, but service was extremely slow. I finally was able to flag down a server to get my check, but would have appreciated the opportunity to order dessert and coffee if the main course had not taken so long.", "title": "Just ok,", "user": "mj316", "date": "December 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 146803293}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Given the proximity to my customer's location, I will probably stay at the Holiday Inn again, but my expectations will remain low.", "title": "Holiday Inn", "helpfulness": 3, "user": "foxycoxy59", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146739904}, {"rating": 4.0, "title": "Great location", "text": "As with most Holiday Inn's I've stayed at outside the US, a VERY nice hotel. Not inexpensive, but a good value for its location and convenience factors!", "helpfulness": 1, "user": "Roselyn K", "date": "December 4, 2012", "id": 146733874}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "One of the nicer Holiday Inns I've stayed at. Great location to the airport - the shuttle to the hotel is free - you have to pay a nominal price ($4) to get back to the airport which I thought was a bit cheaky. Paid $145 Aus for a very nice room. Nice staff. Would stay there again.", "title": "Great location, great hotel", "helpfulness": 7, "user": "mmccormi", "date": "March 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4773755}, {"rating": 5.0, "title": "Great hotel", "text": "We stayed overnight in February after an overseas trip on our way home to Queensland.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 16, 2006", "id": 4627579}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "We arrived about 9pm, ordered a meal (which was great). The room was spacious, clean and very comfortable. Bed was great!", "title": "Good for stopovers - not a holiday hotel", "helpfulness": 8, "user": "JelliB", "date": "February 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4450866}, {"rating": 3.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "After a long flight we just wanted a good night's sleep, which we got! Room service that nightwas good, we had it for breakfast and it was great!", "title": "Convenient for stop-overs", "helpfulness": 1, "user": "winediva", "date": "February 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4405463}, {"rating": 5.0, "title": "From now on this will be my base in Sydney if time is an issue!", "text": "Lots of lotions and potions in the bathroom and i used the bath bomb to have the best bath i'd had since i'd left home!", "helpfulness": 1, "user": "Comfy-Traveller", "date": "December 24, 2005", "id": 4298618}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 32, "average": 99, "very good": 270, "terrible": 21, "excellent": 89}, "aka": "Holiday Inn Sydney Airport Hotel", "slim_ranking": 0.4, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Conveniently positioned, Holiday Inn Sydney Airport is located only minutes from the international and domestic airport terminals, providing regular transfers to and from the hotel. Situated in the centre of the local business district, the hotel provides you with easy access to the CBD via the motorway. A two minute walk to nearby Mascot train station will also have you in the city within 10 minutes.All 250 guest rooms have views towards the city skyline or airport and have been custom designed with guest comfort in mind. Standard rooms come equipped with a choice of soft and firm pillows, 32-inch flatscreen TVs, high speed internet access and ensuite with dual pressure showerhead. Enjoy a delicious Moroccan-inspired meal in the hotel’s signature restaurant, Sirocco, or socialise with friends and entertain colleagues with a relaxed drink and light meal in Biggles Bar.Within Holiday Inn Sydney Airport is an in-house gymnasium, same day laundry for the last minute rush and a business centre to stay connected and prepared for the trip ahead.Experience the relaxed and friendly service at Holiday Inn Sydney Airport."}