{"user_rating": 4.0, "review_count": 1130, "name": "Holiday Inn Washington - Capitol", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "We stayed at the Holiday Inn Capitol Feb. 1-Feb. 4 2007, Family of 3, 2 double beds. The room was clean, and brightly lit, I think there were 4 lamps in the room plus one overhead light near the door. Check in and out very quick. Paid 134.99 a night plus 22 a night for parking, saw someone else here got $99 deal with no parking fee, ouch that hurts. Beds are firm but they were very comfortable. We stayed on 5th floor and could hear the metro, but it's nothing annoying. They have free internet connection but it's for 1 computer. We have 3 laptops and they say they don't have wireless, but they do. Just have your network detect it and pick holiday inn free 1 day service. We were able to connect wirelessly the entire stay.", "title": "Good Location to See National Gallery of Art", "helpfulness": 8, "user": "painterlymuse", "date": "February 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6766029, "likes": {"liked": "— Location, Clean, Big Room", "disliked": "— Small Closet, Needs to Really have Wireless in all rooms, Needs nicer cafe with more selection"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I picked this hotel due to its location. It was a 10 minute walk to the National Gallery of Art (loved it!), my reason for the trip. Even though the weather was in the 20's and 30's kind of rainy, there was absolutely no problem walking to the national mall area. There are 3 cafe style restaurants in the National Gallery, We ate at the Cascade Cafe there. Nice atmosphere by cascading waterfall. Food isn't cheap but it's worth the convenience and it's a large selection. Next day went to the Hirshhorn Museum, 1 block closer than the National Gallery. Interesting art collection to check out.", "title": "Average room, great location", "helpfulness": 1, "user": "walkersc", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6750161, "likes": {"liked": "— Location, price", "disliked": "— Room size"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The breakfast buffet at the hotel Smithson restaurant is ok, but the eggs and potatoes are not very salted if you like your food seasoned well, but the fruit was really nice. It was 11.95 per person so I felt I didn't eat enough to order the buffet again. The next breakfast I ate there I ordered off the menu my husband and I both got omelets and they were very good. Daughter got pancakes and they were good too, each costing less than the 11.95 buffet. The morning restaurant service is very friendly and quick. on the other day we got breakfast at mcdonalds on the corner.", "title": "Decent for the $$. Good location for sightseeing, but dull if you want nightlife", "helpfulness": 4, "user": "Clemens-gal", "date": "January 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6713778, "likes": {"liked": "— Great location for sightseeing. Safe and reasonably priced", "disliked": "— Located in the museum/business section of DC-- so no nightlife, shopping, restuarants, cafes, etc"}}, {"rating": 2.0, "title": "What an Overpriced Dump", "text": "We ate one dinner at Smithsons in the hotel and I was very pleased with it. I got the special of the night, catch of the day, which was salmon with a cream pesto sauce and it was above average. I wanted to have it again next night:), but we went to a restaurant nearby Market Inn on E street. It's really close together seating which is ok, They have live jazz.. Valet parking. I thought the food was just ok, but husband really liked.", "helpfulness": 1, "user": "bchipman", "date": "January 22, 2007", "id": 6641696}, {"rating": 3.0, "title": "Great stay, good location", "text": "The hotel gift shop is open until about 10pm and it sells cold soda, juice,water etc. we got drinks there but the soda machines on the room floors have choices too, we got from those too and they are a little cheaper. CVS (doesn't have the pharmacy) is just next door to hotel and they have large selection of cold drinks and candy and snacks. Good choice because they are cheapest.", "helpfulness": 5, "user": "TA_Scott", "date": "January 19, 2007", "id": 6621897}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Last minute my husband and I decided to get away for an extended weekend. I booked this hotel the Wednesday prior to our stay on the AAA.com website for $30 cheaper than the quoted AAA rate reservations gave me over the phone. What a great surprise. Hotel was clean. Staff plesant and helpful. The room was standard with a king size bed. Not spacious but it was comfortable. We were on the 4th floor facing the courtyard. The hotel is within a half a mile walk to most everything we wanted to do. The metrorail L''Enfant Plaza station is one block over just a few minutes walk from the hotel lobby. Independance Avenue is two blocks over. Exit the front lobby and walk to the corner of 6th and C St. Turn your head right and look down the street. You see the entrance to the Air and Space Museum. That is how close you are to many of the museums. The weather was unusually warn for January. Each night we were able to take a walk on The Mall seeing the Monument and Capital lit up. Th White house is less than 1 mile walk away. or take the metrorail. Help was everywhere. Security people are on the streets and in the metrorail stations.", "title": "Great Choice - Close to everything", "helpfulness": 7, "user": "arewehavingfun", "date": "January 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6604214, "likes": {"liked": "— great location", "disliked": "— muffled noise heard in the room from surrounding rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "I have two suggestions.", "title": "Decent", "helpfulness": 6, "user": "rachelsstudio_com", "date": "January 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6597837, "likes": {"liked": "— Internet, Location", "disliked": "— Boring Interiors"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "First: Know the time you are coming into DC. If it is a slow weekend like ours was consider parking on the street. We parked in the hotel offered garage for a fee of $22 a night. After speaking to the security guard, we felt comfortable parking on the street would of been okay. He said this hotel is in a good area. Walking around we noticed many spots on the same street as the hotel where we could of parked for free. We did not know weekend and holidays you dont feed the meter. Also being the first time staying in DC, we did not know the area. However, if it is a busy time of year or a work day then the parking garage is probably a good idea. You will not have to worry about your car, finding a spot and feeding the meter.", "title": "wonderful hotel and in the center of where you want to be.", "helpfulness": 4, "user": "lbaker", "date": "December 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6335402, "likes": {"liked": "— center of museums, capitol etc.", "disliked": "— I can't actually think of anything, I didn't go to the pool area so don't know about that."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "My second observation was you can hear muffled noise from the other rooms. The room above shower running woke me up. Also a young child trying to settle down for the night cried for almost a half hour and then about 10pm all went quiet. I felt for the parents having two little ones myself and was thankful during the night we did not hear anyghing else.", "title": "Great hotel", "helpfulness": 2, "user": "portabello", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6163123}, {"rating": 4.0, "title": "Great Stay!", "text": "I reccomend this place. And would stay here again.", "helpfulness": 4, "user": "cube_slave", "date": "November 15, 2006", "id": 6132952}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "This hotel is a typical Holiday Inn with some extra added benefits. It is a great location if you want to see the sights. It is only about a block from all the Smithsonian Museums including the Air and Space Museum. There is a Quizno's and a CVS Pharmacy next door for added convenience. However, the hotel has some great bar and grills and restaurants located in the hotel itself. The rooms were clean and spacious with a 1/2 size refrigerator. You also get free internet access for surfing the web or doing email. Only complaint would be the thin walls. You can constantly hear the toliets flushing within the hotel, your neighbors next door and the doors to the rooms are heavy which ultimately slammed shut which you could hear up and down the hotel hallway. Also, the person who delivers the newspaper every morning at 3 am just drops the paper in front of each door which is pretty loud going up the hallways. If you have quiet neighbors, no big deal, the rest you get use to and for the most part it was pretty quiet after 11:00.", "title": "Great Location - Clean Hotel", "helpfulness": 4, "user": "shelieg34", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7347761, "likes": {"liked": "— Location", "disliked": "— Noise Level - Paper Thin Walls and Loud Doors"}}, {"rating": 5.0, "title": "Excellent hotel for sightseeing or business", "text": "The Holiday Inn - Capitol really exceeded our expectations. We stayed for two nights 30 March - 1 April in order to enjoy the cherry blossom festival. The location just can't be beat - one block from the L'Enfant Plaza Metro station and one block from the express bus stop for Dulles Airport. The Departments of Education and Housing and Urban Development are within 1/2 block of the hotel. It is one block from the Mall and the Smithsonian Air & Space Museum, 10 minutes to the Washington Monument and about 15 minutes walk to the Jefferson Memorial and the Tidal Basin.", "helpfulness": 9, "user": "John_of_GA", "date": "April 1, 2007", "id": 7268158}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The rooms were spacious and very clean with plenty of towels and a 1/2 size refrigerator. Maid service was very thorough. As Priority Club members we received a handful of coupons for free tea/coffee at the restaurants and a discounted buffet breakfast. There is stylish bar and grill at the hotel as well - I didn't expect facilities of this caliber and was pleasantly surprised.", "title": "Geat location, close to all attractions", "helpfulness": 9, "user": "cmy2bleweyez", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6819849, "likes": {"liked": "— The central location to everything", "disliked": "— cold weather :)"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "If you arrive early or are leaving late, the bell desk will be glad to hold your luggage. There is also a tour desk to help you with Gray Line tours and the like.", "title": "Nice, bright, clean rooms!", "helpfulness": 7, "user": "ivorysalmon", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6817940, "likes": {"liked": "— Clean rooms, proximity to National Mall.", "disliked": "— Not many food choices in area"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I would recommend this hotel to anyone who wants a clean establishment with added amenities in a perfect location.", "title": "Location Location Location!", "helpfulness": 4, "user": "Suzy_Shopper", "date": "February 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "business": 5.0, "cleanliness": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6801224, "likes": {"liked": "— The location!! One block away from museums!", "disliked": "— The hotel needed some updating"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Since Holiday Inns are a chain hotel, I didn't have high expectations. However, we had a pleasant surprise. The staff was friendly and informative, the room clean and adequate for the price ($178.)", "title": "Good deal for the money", "helpfulness": 5, "user": "artypat", "date": "November 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6110047, "likes": {"liked": "— location", "disliked": "— parking fee"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The \"27th Ammendment Bar & Grill\" on the premises was a lot of fun. Good food, drink and music in a warm atmosphere.", "title": "Good for the Price", "helpfulness": 5, "user": "owlyn", "date": "November 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6107308, "likes": {"liked": "— Location and Price (Good Value)", "disliked": "— Needs some updating and minor repairs"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The best thing about this hotel was it's location. One block from the Air/Space Museum and the Mall. We took the trolley tour offered at the hotel ($30.) which brought you to all the major sights, and you could get on & off as many times as you wished.", "title": "Average", "helpfulness": 4, "user": "PlateMan", "date": "November 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6106307, "likes": {"liked": "— Lobby", "disliked": "— Bathroom; Trains"}}, {"rating": 2.0, "title": "Great central location...but...", "text": "Pretty much the same as everyone else has written. This is currently a 2.5 star hotel, not a 3 star, but it is clean and a good value. The location is excellent for visiting the Mall area. The room was large enough and clean enough. We've been in better hotel rooms and in worse hotel rooms. This one needed a little work, but it was clean (and NO mold in the bathroom) and comfortable enough. There was a slight unidentifiable smell in the room, but it could have been a deodorizer. It was really no big deal. A/C/heat worked great. Smithson's was okay for breakfast (we ordered off the menu.) The price was reasonable.", "helpfulness": 2, "user": "PMA1709", "date": "November 7, 2006", "id": 6081158}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Be sure to ask for a room that is NOT facing the railroad. Also, sign up for the Holiday Inn rewards program when you reserve. You will get a 2PM late checkout, free coffee/tea coupons for Smithson's, as well as $2.00 off the breakfast buffet. Parking was 422/day with unlimited in/out. It was very convenient.", "title": "Beware of Trains", "helpfulness": 4, "user": "TravelWombat", "date": "October 22, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 5982384, "likes": {"liked": "— location", "disliked": "— Property on train line."}}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3, "variance": {"poor": 71, "average": 238, "very good": 544, "terrible": 37, "excellent": 240}, "aka": "Holiday Inn Washington - Capitol Hotel Washington Dc", "slim_ranking": 0.720930232558, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Welcome to the Holiday Inn Washington-Capitol. We offer the ideal location for business and leisure travelers coming to Washington, DC. We are conveniently located one block fromSmithsonian s National Air & Space Museum. Walk to major Washington area attractions including the United States Capitol Building, Smithsonian Museums, White House, Washington Monument, World War II Memorial and the Holocaust Museum. This Washington, DC hotel is within reach of DoEd, DOE, DHHS, FAA, FEMA, HUD, NASA, USDA, and USITC. Stay connected with our complimentary high-speed Internet access in all guest rooms and 24-hour business center. Maintain your exercise regimen in our 24-hour, state-of-the-art aerobic fitness center. All hotel rooms are equipped with refrigerators. Our superb location, friendly and experienced staff, makes the Holiday Inn Washington - Capitol the best choice for business and leisure travelers alike. Enjoy a hearty breakfast at our new Capitol Bistro, where Kids Eat Free, grab a quick meal at the Shuttle Deli Express, or coffee from our full service Starbucks. Unwind in the modern, comfortable surroundings of the 21st Amendment Bar & Grill or take a relaxing swim in our seasonal rooftop pool overlooking the US Capitol. Make the Holiday Inn Washington-Capitol your first hotel choice when traveling to Washington, DC!"}