{"user_rating": 4.0, "review_count": 931, "name": "Holiday Inn Resort Penang", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We stayed on the 11th floor of the tower block which is connected to the main hotel block by a private overhead walkway. This is a very useful feature because the bisecting main road can be dangerous to cross.", "title": "Don't expect too much", "helpfulness": 5, "user": "DelayedAgain", "date": "May 16, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 5078949}, {"rating": 5.0, "title": "Absolutely Loved it!", "text": "We arrived after staying in a fabulous hotel in Singapore and it was immediately apparent that the Holiday Inn was not in the same class. My first impression of the accommodation was not favourable. The decor and some of the furniture looked tired and in need of refurbishment. On the plus side, we had a magnificient sea-view from our balcony, providing one did not mind standing, there being no balcony furniture.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "May 16, 2006", "id": 5078792}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "The plumbing was rather noisy and the air conditioning vents needed cleaning. Very powerful shower though and the individual safe in the rooms is a nice touch. Unfortunately, I discovered the odd cockroach. Not an infestation by any means and easily dealt with, providing one is not squeamish.", "title": "Good enough", "helpfulness": 3, "user": "SJX", "date": "May 6, 2006", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 5037964}], "location": {"country": "Malaysia", "continent": "Asia"}, "stars": 4, "variance": {"poor": 62, "average": 174, "very good": 434, "terrible": 36, "excellent": 225}, "aka": "Holiday Inn Resort Penang Hotel Batu Ferringhi", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Holiday Inn Resort Penang, together with its excellent location in the heart of famous Batu Ferringhi makes it easily accessible to the Night Market, shops and restaurants. The resort is situated right on the beach, split into two buildings- the Beach Wing, located at the beachside, or Ferringhi Tower, located directly across the road to the beach. The Ferringhi Tower commands spectacular views of both the hills and sea front and is linked by an overhead covered walkway. 358 spacious rooms with a great combination of Family Studios and Kidsuites, the resort is perfect for families and couples looking for a retreat. To also make your every moment of your stay an absolute delight, we make every dining experience special in its own way. As the only hotel offering speciality Northern Indian cuisine, it will be feast that will leave you with 'spicy'memories. At the Holiday Inn Resort Penang, you will discover an exotic way to truly enjoy your vacation and cherish every minute of it. Right from the warmth of the people, the quaint sights & sounds of the island's rich cultural heritage and the rejuvenating hospitality of Holiday Inn Resort Penang."}