{"user_rating": 4.5, "review_count": 65, "name": "Holiday Inn Express & Suites Fairmont", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This property is clean, quiet and friendly. They graciously accommodated a three-hour early arrival with only a 20 minute wait. The double queen room was clean and spacious. I would definitely recommend this motel to anyone traveling I-79 through West Virginia. Plenty of restaurants at the exit and many more at Exit 132 (1 mile south).", "title": "Excellent Saty", "helpfulness": 1, "user": "vatraveler2110", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132228298}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stayed at this property for 6 days and it is well worth the rate. The entire front desk staff, breakfast staff, and cleaning crew are GREAT! The front desk staff always gave us excellent directions to the places we wanted to go. The rooms are exceptionally clean and comes with a microwave and fridge. The exercise room has very good equipment and the breakfast was GREAT as well. I would definelty stay here again if ever in this area....", "title": "WOW! Awesome Place to Stay!", "user": "MemphisLove2travel", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131550246}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Best place yet!! Excellent service, staff, room, amenities! Do not hesitate to stay here!! Friendly and courteous. Highly recommended!", "title": "WVmiss", "user": "Karen M", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131164505}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "this was a stopover for our trip to DC, excellent stay. Everyone was welcoming, the beds were comfortable, the pool was still open. The breakfast was very good, with lots of choices like, cereal, oatmeal, pancakes, omelet, hardboiled eggs, fruit, muffins. This is our 1st stay with any Holiday Inns, and we will look for others in the future. Even the housekeeping staff was very friendly.", "title": "very friendly staff", "user": "NAVACA", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130424056}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "quality one comes to expect at holiday inn, nice clean rooms with frig, coffe maker and microwave. staff was great from reservation through check out. highly recommend.", "title": "Quality Place to stay", "user": "rlkwv", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129790274}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Just stayed at the Holiday Inn Express in Fairmont the first week of October 2012. We have driven through Fairmont countless times over 25 years from Canada to vacation in the Carolina's and Florida. We typically stop over for the night in Virginia, West Virginia or Pennsylvania. I have to say that this is the best hotel we have ever stayed at on the way down south. It very new, very clean and has a very friendly and inviting atmosphere. We have stayed at many Holiday Inn Express hotels in Canada and the US and they have become a family favorite. This hotel is little pricey for the area but it is worth the extra money. The complimentary breakfast is very good compared to other hotels and rooms are good size with comfortable beds, flat screen TV and fridge included. They have a nice exercise room and indoor pool as well. Staff very friendly as well. Great stay...we will back next year.", "title": "Great New Hotel for Snowbirds travelling South!", "user": "J-Roc123", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 143077789}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I chose this hotel because I have usually had good experience at other Holiday Inn Express locations. We were checked in quite efficiently, and quickly. The room was very nice, and clean and well appointed. The common areas of the hotel were very nice and clean. It was very quiet as well. The only complaint that I had was that the water in the swimming pool was ice cold, colder than the ambient air which was set at 70. I went to the front desk and the attendant stated that she didn't know that the water was cold - that she had never been in the pool. Maybe that would be a good place to start! This is October, for crying in a bucket, not July!", "title": "Fairmont Holiday Inn Express", "helpfulness": 2, "user": "klawv", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142681068}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "You need to be very wary of this hotel. Usually, Holiday Inns are great places to stay. Unfortunately, not this one. Front desk staff was dismissive of a simple request. I was shocked when the gm acted as if I was bothering her.", "title": "Terrible service", "helpfulness": 2, "user": "Mark P", "date": "October 2, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 141874979}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Hopefully you will have better luck than me.", "title": "A great place to stop.", "user": "NCGrimbo", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141274580}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "On my trip home from visiting my relatives in Sept. 2012, my mom and I stayed at this HIEx and we were very pleased with everything. The rooms were nice and clean, the bathrooms are very spacious, and the King sized beds had more pillows than one person can use. Waking to pillows on the floor is a good thing as long as you still have some on the bed, and I did. :-) The staff was quick to check us in and the express check out the next day was a very nice feature.", "title": "What a wonderful home town place", "user": "Mary V", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140541102}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Had a very pleasant surprise on our way to Florida with a couple of the grandsons. The staff were very pleasant and helpful. Gave a list of nearby restaurants and told us their favourites. We ended up walking right next door to the Cracker Barrel - we'd had enough driving. The rooms were surprisingly large with a separate living room type area. The pool area was nice and bright and well maintained. All looked new and clean. Even the staircase area was carpeted and finished nicely. Not the usual concrete stairs and grey paint. The breakfast was very good with good selections (eggs ham, cereal, breads, yoghurt, juices, fruit, etc. and even an automatic pancake maker - new to us). I would definitely recommend this hotel. It's right off the highway and this makes for a quick getaway the next morning.", "title": "Roomy, Clean, Large Rooms. All Good", "user": "rpaters53", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140145566}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed for one night at the Holiday Inn & Suites located at 2256 Landing Lane in Fairmont, West Virgina. The facility is clean and has a nice swimming pool and lounge area.", "title": "Warning this location has BED BUGS", "helpfulness": 2, "user": "elliott n", "date": "September 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 140010416}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "After breakfast we returned to our room and my wife spotted a bed bug crawling across the sheets on the bed she shared the night before with our 18 month old daughter.", "title": "New hotel, service was understaffed and not reliable", "helpfulness": 1, "user": "JulesKDepew", "date": "August 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138141614}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We captured the bed bug in a plastic cup and took it to the management. After that we had to seal all our possessions in large plastic bags. It took over 14 hours to treat the interior of our car and all of our stuff. Do not stay here unless you want to share this unpleasant experience.", "title": "Great Stay!", "user": "Kaitlyn M", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137474920}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed here for the first time last Saturday for one night on our way home. We liked that it was a new hotel so we choose this one. Rooms were very nice, beds were very comfy as were the pillows. Rooms were very clean. Hallways smelled like paint or who knows what on the 3rd floor but once you got into your room it was fine. Checked in with no problem. Got to room, crummy tv reception, plate half coming out of wall. Called girl, who said I can send someone in the am, I'm the only one here on the property and I don't know how to fix it. Never offered to move us and after unloading all of our stuff we didn't want to move. If I wanted crummy tv reception I would have gone to an old hotel, not expecting this from a new property. We called my inlaws who said they'd call us back. Well they never got through Why: Because there was only one girl working the entire desk on a Sat night when there were 50 rooms out of 72 sold. She said the entire hotel was short staffed. My father in law calls my husbands cell and said nobody answered the phone after 10 rings he hung up. Funny thing is, I was at the desk at the time when I was waiting for the clerk to come back and the phone was ringing off the wall at the same time he was calling and she was over making coffee and never heard it. Thought she saw me, I was in plain sight of the desk. She goes into the back room for a few minutes and another lady comes up and has to wait. I tell her the tv still isn't working after she suggested my husband try to tighten some things. After finding out she was the only person working in the hotel and after not getting our phone call and hearing the phone never being answered I wondered who was watching the desk or taking care of the desk when she being the only clerk on wheeled our rollaway cot to the third floor. What kind of security is this! She said she carries a phone on her except when she goes to the bathroom and claimed she was in the bathroom when my father in law called when in fact I was standing right at the desk when he did. So not only was that a lie but I pointed out to her that when she was just a little bit away from the phone making coffee the phone rang off the wall and she didn't have a phone on her because it went unanswered. Breakfast was so so. Better than the donuts, juice but so so. Next morning we didn't have to get up to early and at 6:50 am the fire alarm goes off. I have to wake my sleeping son and go downstairs to find out some fool in a room leaves their door open when they shower and the steam sets off the fire alarm. If you know this why wasn't something done about it before. The morning clerk said \"the woman in room 104 leaves her door open when showering. Don't know if this was the door to her room or the door to the bathroom into her room and not her hall. Either way how over sensitive is this system? Fire company never showed up to be sure everything was okay. Here at home they show up no matter what. Must be different in each area of the country. Like I said, nice clean rooms, service for the night time was not good. Funny they had three people at the desk Sunday morning though. Very unhappy.", "title": "We were in town for neither leisure or business, family funeral", "helpfulness": 2, "user": "SMDent2001", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 136533720}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My husband and I liked this hotel very much. We just stayed overnight both times we 've been there. Brand new hotel. Right off the highway. Nice rooms, good free breakfast, free internet access. Fridge in room which is nice to have when travelling long distances.", "title": "Good Hotel Accommodation", "helpfulness": 2, "user": "LLJess", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136317055}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed at this hotel on our trip home after our visit with family in NC. When we arrived, we had made a reservation and also discovered that it was completely booked. I guess it was full from everyone traveling home after July 4. Shirlee was the front desk attendant and was pleasant to work with. I was originally a little hesitant to stay here since we haven't stayed at a Holiday Inn Express before. When we checked in, we discovered that our room had been upgraded for free to the King Executive Suite (from the King Leisure room). What a surprise!", "title": "Excellent hotel - AAA Discount and room was upgraded", "helpfulness": 2, "user": "Michael W", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134026243}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The hotel was easy to find and looked clean from the outside. The room was very clean and the bed was very comfortable. Since the hotel was completely booked, we avoided the continental breakfast and the pool, but these were amenities at this hotel. We enjoyed our stay and appreciated the free upgrade. Thank you.", "title": "the best place for at least 60 miles.( probably way more)", "helpfulness": 2, "user": "teamster175", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133383339}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The exit for this hotel is easy to get on and off of I-79 and there is a gas station and Cracker Barrel.", "title": "Highly recommended", "user": "TripC85", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133337572}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I must say you can stop at this exit and get the worst and the best...If you want the worst go to the comfort inn across the highway, if you want the best stop here( please read my review on comfort inn)...anyway back to the holiday inn review, I arrived around 215 pm for a 10 hour stay.hotel has a dirt / gravel parking area beside hotel for trucks..I was welcomed by a lovely girl named Stormie check in went well she offered fresh cookies, I ask for a few breakfast items to take to the room since Id be up around midnight it was not a problem..room was great..comfy bed , good internet,good water pressure...everything was perfect...price was a bit more than I wanted to pay for a 10 hour stay but it was worth it...Ive stayed many places from morgantown to weston and this is the finest within that area..I will be back in the future", "title": "Wonderful oasis in the middle of a long drive!!!", "helpfulness": 1, "user": "rowada", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132957412}], "location": {"country": "United States", "city": "Fairmont"}, "stars": 2.5, "variance": {"poor": 1, "average": 4, "very good": 11, "terrible": 4, "excellent": 45}, "aka": "Holiday Inn Express & Suites Fairmont Hotel", "slim_ranking": 0.111111111111, "description": "Holiday Inn Express and Suites in Fairmont has all of the amenities of the Holiday Inn Express brand plus a well trained and organized staff to make for the most pleasurable stay. The hotel is a brand new property. The extra quiet rooms are complimented by Holiday Inn's Simply Smart Bedding Collection with the added choice of firm or soft pillows, these features will help insure a great night's sleep. Every room in the hotel is equipped with a microwave and refrigerator for added convenience. There is also a work desk or table in each room. Whether traveling for business or pleasure this extra area will allow you to stay organized while away from home. The 37\" flat screen TVs are the highlight of the stylish decor. The hotel is outfitted with hard wired and wireless high speed internet. You may choose to start your day with the many choices from the free Express Start breakfast such as tasty cheese omelets, piping hot sausage patties or bacon and delicious cinnamon rolls. The other useful amenities are the heated pool and spa, the 24 hour fitness center, the business center, guest laundry and a meeting facility for business meetings, luncheons and parties. We are right off of Interstate 79. Take Exit 133 (Kingmont Rd.) We are located near the Cracker Barrel."}