{"user_rating": 3.5, "review_count": 177, "name": "Holiday Inn Luton-South", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We had an executive room which was still pretty basic , old decor & not terribly clean. The front office seemed pretty inexperienced & undertrained getting out check in wrong several times. The breakfast & dinner is o.k. The location is very good if visiting Whipsnade Zoo & the hotel is easy to find off the M1...the pool is good and there is a harvester near buy as well as a run down Thai restraurant & Pub/exotic dancer bar(that didn't look very exotic)", "title": "pretty basic", "helpfulness": 2, "user": "familymanHongKong", "date": "August 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8282892, "likes": {"liked": "— pool & location", "disliked": "— room decor"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 23, "average": 35, "very good": 55, "terrible": 11, "excellent": 53}, "aka": "Holiday Inn Luton-South Hotel", "slim_ranking": 0.384615384615, "description": "Holiday Inn Luton South is the perfect base to discover a host of nearby attractions. For a family day out, visit the fantastic Whipsnade Wild Animal Park, the Roman city of St. Albans, or take a bracing walk and admire the nearby Dunstable Downs. Located just off junction 9 of the M1 and only a 10 minute drive from Luton Airport. We are situated in an easy and accessible location. Park, Stay & Fly Rates availableIdeally suited for both the business and leisure traveller,Holiday Inn Luton-South offer a range of facilities including newly refurbished bedrooms, wireless internet access and five flexible function rooms as well as high-class equipment for hosting business and social gatherings. For a meal or light snack the informal Borders restaurant provides excellent cusine in a sociable and inviting atmosphere. Work out in style and take advantage of the extensive facilties provided in the leisure club including an indoor swimming pool, sauna, whirlpool, and fully equipped gym. Or why not treat yourself and indulge in our beauty services? Visit Holiday Inn Luton South M1 Jct9, within easy reach and close to Wembley, Woburn Safari Park, Capability Green business park, Luton, Hemel Hemstead, Maylands Avenue and Buncefield Oil Refinery. In compliance with English Law smoking is only permitted in designated smoking bedrooms in this hotel."}