{"user_rating": 4.5, "review_count": 787, "name": "Holiday Inn Harrisburg East (Airport Area)", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2011", "text": "We choose this hotel based on location. Hotel decor is dated and good renovation could do this place wonders. nice pool in the pictures and play area for children. BUT management has to see all the broken pool chair & the pool towels are something I wouldnoy wash my car with. Definately not even close to enough chairs for pool this size.", "title": "Just Ok", "helpfulness": 1, "user": "Lizzay", "date": "July 2, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 114971550}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "we came back from park so kids could play it wasnt crowded but no place to sit.", "title": "Very disappointing stay. Reflects poorly on the entire chain.", "helpfulness": 3, "user": "GoYankees70", "date": "July 2, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 114950861}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Get more pool chairs! You have a big great pool but maybe 15 useable chairs. It looks cheap to have broken chairs.", "title": "HAD A WONDERFUL TIME!!", "user": "MAXANDSARA", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114931969}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Even your members STANDING beside me were miffed.", "title": "Friendly Staff, Clean Room = Nice Weekend Trip", "user": "mel12345_11", "date": "June 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114853269}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stay again but only due to location & if major renovation occurred.", "title": "Would stay again", "user": "twirler92", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 4.0, "service": 4.0}, "id": 114810351}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "just would like to say this hotel is one of best i have stayed in.the staff goes out of there way to make things right,help,or just make the stay pleasant. the van service is A+++++ DANIELLE was very helpful in telling me the many places to go,and driving me there.also she is an A++++ driver.", "title": "great service,great and caring staff", "user": "toot1955", "date": "June 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113301022}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "The hotel overall is very very nice, from the lobby to the bathrooms. I was staying overnight for a wedding there and I was highly impressed. I didn't want to leave the next morning. Staff were wonderful; they allowed me to check in early since I was in the wedding and had to get ready. I got a two-room king bedroom suite and it was really nice and well kept. Very clean. Didn't notice any outside noise from the hallway or pool outside - sleep quality was excellent. I have no complaints whatsoever.", "title": "Will be staying again!", "user": "Leah M", "date": "June 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 112563925}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had our wedding reception at the Holiday Inn Hbg East and spent the night that evening in the presidential suite. The reception flowed so smoothly thanks to Brenda and her great staff. We didn't have to think about anything and were able to just relax and enjoy our day. The presidential suite was awesome! It was absolutely huge!! Also, after we checked out, I realized I had left my ipod in the room and I thought for sure I'd never see it again. Well I was wrong. Thanks to their honest employees I was able to get it right back. I'd definitely recommend this hotel for wedding receptions and overnight stays.", "title": "We'd definitely recommend", "user": "kkoller", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 111005937}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The hotel staff was very kind and helpful. The front desk assistance by Mick was superb. The best part of the hotel was the restaurant, outdoor pool and playground for the children.", "title": "Very nice stay with adequate amenities", "user": "albrito21", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 110355902}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My dealings with the reservations all the way through our stay was excellent. Mick took our reservations and helped me work within my budget for the trip. He had several suggestions on how to get the best rates and truly sold this hotel to me. As a Priority Member I just had to write a review. Over my 32 years with my company I have had to travel frequently and Holiday Inn is the standard I compare other hotels to.", "title": "Excellent customer service and great value.", "user": "Penguin59", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 110103282}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I stay in hotels alot and most of them are ok, but Holiday Inn east stands out above all the rest. The grounds are well kept and the employees were fabulous. I will be back nexttime I come through this area. Thank you for a relaxing, enjoyable stay.", "title": "The most enjoyable hotel stay ive had in a long time", "helpfulness": 1, "user": "scotttagg", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114584958}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We used Hotwire and were fortunate to get a very fair rate for 3 nights (blindly) at this hotel.", "title": "Good family hotel", "user": "Jason_W_in_Indiana", "date": "June 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114222677}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "For the positives as many have already stated, the service was very courteous and personable. They assisted us with locations to go for hiking as well as helped out with opening a toy my son purchased at Hershey that required a screwdriver. Our children also very much enjoyed both the indoor and outdoor pools in addition to the outdoor playset. The facility was in a good central location to Harrisburg as well as Hershey with easy access to the highway and close to area shopping. It was also nice to have plentiful free parking. The room was a standard double queen with decent room for our family to move around. The bathroom did seem a little tight, but was fine with good water temp and pressure. It was nice to have the free Wi-fi, although it had some issues on our 3rd night.", "title": "Stay away - bugs, odor, security doors not functioning", "helpfulness": 2, "user": "AverageJoe55", "date": "June 18, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 114204290}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "As far as negatives, our initial room smelled strongly of dog (they are a pet-friendly hotel), so we had to request a new room, which they were good about allowing but was a minor inconvenience after having already unloaded our belongings into the room in hopes the smell would fade away after using the AC for a while and having an employee spray our room. We wished that our room would have had a refrigerator or microwave as standard amenities but realize that may be uncommon at these types of hotels. We would have liked a complimentary breakfast option also. Their restaurant could very well be OK and they do offer the Kids Eat Free deal, but the menu seemed to be more expensive than my wife and I cared to spend. It was pretty quiet for the first two nights, but there was considerable more speaking noise in the hallway as well as an apparent need to vacuum the hallway around 9 pm on our 3rd night.", "title": "Excellent experience", "user": "sholehan0816", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114012098}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Overall, it was a good place for our family to stay while checking out central Pennsylvania and would consider doing so again if in the area.", "title": "best place to rest", "user": "john52932", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113704578}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "First time stay for me at this particular Holiday Inn. The staff was very friendly and the accommodations were great. There was a large group of us staying here for a bowling tournament and although we were all on the same floor it would have been nice if our rooms were closer together. Other than that I would not hesitate to stay here again and also recommend it to a friend. Thanks for sending me the jacket that I left behind... hope to see you again next year Randy :-).", "title": "Friendly Staff", "user": "I8ridium", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109859700}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "We recently had our 2011 Prom at the Holiday Inn East. There staff could not have done a better job assisting me with the planning process. Nearly everything I asked for was done as soon as they could!!! The venue was perfect and all of the students enjoyed Prom 2011, had fun and were safe. We are looking at extending our contract with this fine locations.", "title": "Prom 2011", "user": "shaff33", "date": "May 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 109776622}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I have been staying here for over 20 yrs. and I look forward to every stay. Continue that great job & providing the (CUSTOMER SERVICE) that all Holiday Inn's s/Express's needs to follow your management template from Sales to Service Mr. Stuart.", "title": "I have been a priorty member for over 25 yrs. This hotel without question, the mgt team that promotes custome service.", "user": "psiron", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109556809}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Thanks again,", "title": "Successful Getaway", "user": "Tom_elg", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 109477053}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Ron Foose", "title": "Don't do it.", "helpfulness": 1, "user": "wisewoman15", "date": "May 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 109310193}], "location": {"country": "United States", "city": "Harrisburg"}, "stars": 3, "variance": {"poor": 47, "average": 64, "very good": 146, "terrible": 28, "excellent": 502}, "aka": "Holiday Inn Harrisburg East (Airport Area) Hotel Harrisburg", "slim_ranking": 0.12, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Holiday Inn® Harrisburg - East hotel offers a location that is just minutes from various attractions such as Hersheypark featuring 11 thrilling roller coasters and over 65 rides and attractions including over 20 kiddie rides, so there is something for everyone to enjoy, downtown Harrisburg offices, the PA Farm Show Complex, Giant Center and Hersheypark Stadium. History buffs can visit the National Civil War Museum and Gettysburg Battlefield. If business brings you to Harrisburg or Hershey, our hotel is designed to keep you productive. A 30,000-sq-ft meeting facility features a state-of-the-art amphitheater, and there's free high-speed, Wi-Fi Internet access. We even offer a free shuttle to the airport to keep travel simple. No other hotels near Hershey have the amenities to match a fabulous location off the PA Turnpike like we do. Families appreciate the wide variety of kid-friendly activities that include a playground, arcade, sports courts (basketball and tennis) and indoor pool. And did we mention the Olympic-size outdoor pool? After a day of fun, our pet-friendly hotel is the ideal oasis. You'll agree we're the best Harrisburg - Hershey hotel!"}