{"user_rating": 4.5, "review_count": 156, "name": "Holiday Inn Daytona Beach LPGA Boulevard", "reviews": [{"rating": 5.0, "title": "Should be a model for all hotels!", "text": "I travel frequently for business and have stayed in a lot of different properties over the years. This Holiday Inn stands out for a lot of reasons, but the biggest difference are the quality of the employees. We made our reservation via phone at 11:00pm. Robert, the night manager, was both professional and very accommodating to our group of three.", "helpfulness": 2, "user": "Bill L", "date": "April 15, 2011", "id": 104121765}, {"rating": 5.0, "title": "Excellent service, clean and new hotel!", "text": "While the breakfast fare was unremarkable, the wait staff was unbelievably attentive. I observed one of the waitresses spending a lot of time with an elderly couple, making sure the women had eaten before taking her medication. You don't see that level of genuine care in many places any more.", "helpfulness": 1, "user": "Travlinround", "date": "April 10, 2011", "id": 103495739}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Almost forgot - the property was built in '09 and the rooms and facilities are all high quality and modern.", "title": "great stay", "helpfulness": 1, "user": "PickeringAbbycat", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 103069868}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Our stay last night was spectacular! The staff couldn't have been nicer. From the front desk staff to the restaurant, you could tell everyone enjoyed working there and helping people. The rooms are clean, fresh & new. The beds are sooo comfortable. My husband joked that he wanted to lower the mattress out the window and take it home! The pool and jacuzzi were the perfect temperature. Our boys played for hours. The frozen drinks are great and the food in the restaurant was tasty! An easy 5 stars!", "title": "Wonderful experience", "user": "Cort75", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 102333664}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband and I stayed overnight on the way from Orlando to Hilton Head. Great surprise: very comfortable room, great bed and bedding, very clean throughout hotel. Checked in late with Carrie; she made us very welcome, explained all of the amenities (handy tuck shop available), really efficient. Hotel next to LPGA course. Only downside was the breakfast, somewhat slow for number of guests and eggs undercooked. Free Wifi in the room. Small fridge in room , with microwave.", "title": "very good hotel experience", "user": "telllikeitis", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 102250150}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This place was EXCELLENT and the service i received by the front desk clerk was awesome awesome awesome. She was the best and the room was nothing less than perfect perfect perfect. Vinny Fischetti #307", "title": "Great place to call Home", "user": "vfischetti", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78537922}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Very, very nice hotel. The desk staff were very friendly. The bathrooms are gorgous! Very clean and the bed very comfortable. We will definately stay there on ALL our visits to see our Son at Embry Riddle!", "title": "Awesome!", "user": "Nurseminnie", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75536607}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "I was delighted with my 3 day stay t this hotel..Everything exceeded my expectations. I was just looking for a good nights sleep and found a quiet place with rooms with exceptional linens, flat screen TV and amenities. The pool area backed up to woodlands and offered a lovely private view. It was also nice to have a restaurant and lounge on site. After my busy days it was nice to come back to the hotel and relax without worrying where to go for dinner.", "title": "Impressive hotel", "user": "naples445", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73656886}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "The racetrak is a mile away and the beach is about 4 miles.", "title": "Luxurious!", "user": "bearboomer", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73620357}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I am a single women travelling and I felt very safe at this hotel.", "title": "Thank you Holiday Inn!", "user": "razorfish355", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73291911}, {"rating": 4.0, "stay_parameters": "Stayed January 2011", "text": "Stayed here for family funeral/visit - location right off I95 so convenient if driving down. Staff very nice - hotel clean and mattresses comfy BUT sheets, though clean, very scratchy/rough and pillows very lumpy/uncomfortable. Food was good and price not bad. But very disappointed internet in room didn't work but maybe 15 minutes total all week. Front desk gave us ethernet cable but that didn't solve problem - we didn't have problem at other hotels this week so not our laptop. Staff did say system being upgraded but for 5 days? Otherwise I find Holiday Inns a good place to say if it weren't for the sheets. Also bathtub has not traction at all so slippery but many hotels are like that I find. Noisy people in nearby rooms a few nights, slamming doors and kids running in halls - after 9 pm - wish staff had noticed and said something but I guess they can't control all the guests. Free easy parking. Overall good.", "title": "Good hotel overall", "user": "lilums", "date": "January 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 94994105}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Modern, clean hotel with nice room that is well-appointed. Free wi-fi, fridge, microwave in room. Great front desk service. Needed a pet friendly hotel. They have a pet weight limit and put you in a room near the lobby with easy access to the doors for ease of walking. Nice restaurant but free breakfast only with coupon. Good area for walking dog.", "title": "Nice new hotel", "user": "HavingFun50", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91462670}, {"rating": 3.0, "stay_parameters": "Stayed October 2010", "text": "My USTA team was playing in a tennis tournament and this hotel was closest to the tennis venue. It didn't hurt that we were offered a pretty good group rate that included continental breakfast. Check in was quick at 6pm on a Thursday. we had a corner room on the 3rd floor (the top floor). Don't expect a view. The room was decent size with a small fridge and a microwave. Decent drawer and closet space. The bathroom was great as it had a large stall shower with glass door. Good water pressure. Alot of space on the vanity for stuff. The only thing that was missing was a magnifying mirror. The bed was comfortable but I cannot understand why some hotels still use very small pillows. These actually had signs on them that said \"firm\" and \"soft\" but I couldn't tell the difference. The air conditioner was another story. When it went on, it sounded like a jet plane taking off. It was very very loud. Also the location of the fan and blower was right below the window not far from the bed. Since it was so low, the cold air blew directly onto the person on that side of the bed. There was free wifi so we brought our laptop. Unfortunately, the reception was spooty, it worked well some of the time, then it would just turn off. As for the hotel itself, there were two elevators for three floors and we never had to wait long for one. My team would meet every day behind the lobby and sit in the comfortable sofas and chairs. The pool area, though small, seemed clean and pleasant. Even though the hotel is non-smoking, I did notice a smoking area by a table at the back end of the pool area. I don't know if that would affect anyone in the pool. The continental breakfast was good with juices, bagels, muffins, yogurt, cereals, etc. They even had a soda dispenser which I like because I get my caffeine int eh morning from coke or pepsi instead of coffee. If you wanted a hot breakfast, for $3 more, you could make yourself a waffle or have french toast, scrambled eggs, bacon. As for location, it worked for us but it is about 25 minutes away from the beaches. Not that much right around the hotel. If you're a golfer, LPGA is just down the street. All in all, my team had a good time here and the staff did make us feel welcome.", "title": "OK for the Price", "user": "fernh", "date": "October 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 81982839}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed at the Holiday Inn on LPGA Boulevard very close to the LPGA Champions Golf Course. The clerk that checked us in was great. She was extremely fast in checking us in, gave us a very good run down of the hotel and its amenities and had a wonderful personality.", "title": "Excellent Value, Good Location, Great Staff", "user": "TwoputtandMore", "date": "September 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 80825621}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "The hotel has a small restaurant and bar that serves very good food and beverages. Happy hour is 2 for 1 drinks. Upon check out, the manager asked if we were playing golf that day and provided us with an additional discount for the LPGA course. The location was perfect, we were 5 minutes away from the course. The only negative was the air conditioner in the room, it sounded like a jet engine everytime it started up and ran. We told the manager about it at check out. It did cause us to not have a sound sleep but otherwise than that the hotel is very nice.", "title": "Very nice hotel", "user": "Rockdale", "date": "September 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 80151090}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The hotel was nice and clean. But unfotunately that is where anything good I have to say ends. We were travelling with a group of 15 people booked into 9 rooms for three days. The rooms were booked under a single reservation and paid for by a single card. Upon check-in, the front desk staff was incapable of assigning rooms in an orderly manner or with any efficiency at all. At check-in, they required a credit card for each room seperate from the main card used to booked the rooms. Supposedly this card was to be used for \"incidentals\" during the stay.", "title": "The worst customer service I have ever experienced.", "helpfulness": 2, "user": "daisy614", "date": "March 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 1.0}, "id": 101389782}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "After checkout, we arrived home to find that the hotel has charged us seperately for the rooms as well as charging the original card. Watch out groups, this hotel is double charging by using the guise of needing a credit card for incidentals. Be sure to check your charges carefully.", "title": "Customer Service was BY FAR the best ive seen in a hotel yet.", "user": "mccalpinml", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 100557668}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "After realizing they made a mistake, I immediately called the hotel to get the charges undone. I have called for two days, left messages with both the person in charge of reversing charges and with the general manager. No one has bothered to return my call. This is the worst experience I have ever had with a hotel and its personel. I have travelled to every continent but Antartica and have dealt with tons of hotels. Apparently the Holiday Inn chain does not believe in making the customer happy nor do they care about repeat service.", "title": "Nice hotel, operations were a little rough.", "user": "MNLowroller", "date": "March 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 100147370}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "I would definitely think twice before booking this hotel or any Holiday Inn if this is the way they choose to treat their guests.", "title": "Nice hotel", "user": "jessbomb7", "date": "February 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 98388277}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "My family and I stayed at this hotel while taking care of some family business during spring break this year and we were all very impressed. The rates were very good for what the hotel has to offer, the staff was ALWAYS friendly, accomodating, and eager to go the extra mile. My grandparents were able to keep their dog for a small extra fee, and where they could cut us breaks on the rates they did so. We ate breakfast at the hotel restarant everymorning and the food was delicious, or they have a cold breakfast buffet you can take back to your room for a very reasonable price. The hotel had everything you could need...a pool, a jacuzi, a workout room, laundrey room, restarant and bar, and an area with snacks and drinks available 24 hrs. The rooms are beautiful, new and very clean, and although house keeping did miss a day during our stay the staff was quick to supply us with fresh towells and anything else we might ask for. The location is also great for anyone who wants to stay in Daytona, but not directly on the beach. It is right off of 95 and LPGA blvd giving you an easy drive to the shore. I highly reccomend the hotel and if my family and I ever stay in the area again it will deffinitely be at this hotel! our group ranged from ages 17 to 68 and everyone was extremely satified.", "title": "Pretty Nice, with some exceptions..", "user": "Shars123", "date": "February 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98155371}], "location": {"country": "United States", "city": "Daytona Beach"}, "stars": 3, "variance": {"poor": 4, "average": 7, "very good": 33, "terrible": 1, "excellent": 111}, "aka": "Holiday Inn Daytona Beach Lpga Boulevard Hotel", "slim_ranking": 0.121495327103, "description": "Whether in town for business, pleasure or both, the Holiday Inn Daytona Beach LPGA is convenient to all the Daytona Beach area has to offer. We await your arrival, from Welcome to Welcome back! Holiday Inn® Daytona Beach - LPGA Blvd Hotel. We are just 10 minutes from the Daytona International Speedway, home of NASCAR's Daytona 500, Coke Zero 400 and the AMA's Daytona 200, help every year during Bike Week. If golf is your game, we are just 5 minutes from LPGA International, which features two championship 18-hole golf courses, the Champions and the Legends. If the beach is calling your name, we are just 15 minutes from the Worlds Most Famous Beach. Our location is business-friendly and corporate guests can easily get to meetings held anywhere in the Daytona Beach vicinity. Two of our hotel's amenities include free Wi-Fi and a 24-hour Business Center that has copy, fax, and print services. We also have almost 2300 square feet of flexible meeting space, for your corporate or social gatherings."}