{"user_rating": 3.5, "review_count": 177, "name": "Holiday Inn Express Hotel & Suites - Marina", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "This was our first experience at a Holiday Inn, but not our last. We booked another one in Sacramento after this one. Wish we'd used more during our travels. Friends had booked this for the four of us and we were very pleased with it (and the AAA discount). The friendly staff helped us change to a smoking room that was just off the lobby, next to the breakfast dining room, but wonderfully quiet. A good location if you have a car, nice hot pool with outdoor sitting area and a sauna. After a full day sightseeing we spent our evening here with our own snacks and drinks. Breakfast was good, it was a little crowded being labour day weekend.", "title": "Very good value, great stay", "helpfulness": 4, "user": "NorthForWinter", "date": "September 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3914021}, {"rating": 5.0, "title": "Great Hotel", "text": "Great Hotel. This is a new hotel. The rooms are spacious with granite countertops in the bathroom. Huge hotub and Sauna. Request a room off of the main road if possible. It is only a 10 minute drive tops to Monterey. For the price and location, this is a great hotel. Most of the hotels in Monterey are old and expensive. You have to drive back out this way to get to the highway to return to San Francisco or Yosemite anyway.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 24, 2005", "id": 3804720}], "location": {"country": "United States", "city": "Marina"}, "stars": 2.5, "variance": {"poor": 16, "average": 29, "very good": 71, "terrible": 13, "excellent": 48}, "aka": "Holiday Inn Express Hotel And Suites - Marina", "slim_ranking": 0.625, "description": "Welcome to the Holiday Inn Express Hotel & Suites Marina, CA!We are located on the Monterey Peninsula, just minutes from Downtown Monterey, Cannery Row and Monterey's Fisherman's Wharf. Santa Cruz, Seaside & Sand City are also nearby.Close to the natural beauty of the dunes and Marina State Beach Park, this hotel offers the guest great value and proximity to the areas world-class golf, dining, and attractions. We are a short drive to the Monterey Bay Aquarium, Carmel-by-the-Sea, 17 Mile Drive, & Pacific Grove.Our beautiful hotel features complimentary Deluxe Express Start Continental Breakfast, free high-speed Internet access in all rooms, and free local phone calls. After a day of sightseeing, return to your comfortable room to relax or enjoy an invigorating work out in our fitness room or dip in our oversized hot tub. We look forward to welcoming you to our hotel very soon!"}