{"user_rating": 3.5, "review_count": 197, "name": "Holiday Inn Express Gent", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "If you have a car, this is a great choice. The rates are very reasonable. The rooms are spotlessly clean and very large with all the necessary facilities, including free wi-fi. There's a decent restaurant too. Great experience overall.", "title": "Only If You Have Transport", "user": "Col1959", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 140147962}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "However, if you are a tourist without transport it is far from ideal. There is a bus stop near the hotel but it's really too far out to be practical.", "title": "Real Value for Money", "user": "Krish_srinivasan", "date": "September 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 140078724}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I was plesantly surprised at the size of the room. Much bigger to other H Inn or Express. What was more surprising was the room could accomodate 4 people. So if you are travelling as a family I gues just one room is enough for 2 adults plus 2 children. See picture to find out what I am saying. Very friendly and ENglish speaking staff. Clean rooms, good dining and breakfast typical H inn spread.", "title": "One night stay.", "user": "fiznlil186411", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 139821528}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Hotel typical Holiday Inn, a bit drab but the room was clean and the bed comfy. Only had breakfast, usual European buffet and was fine.", "title": "Great if you travel by car", "user": "Suze009", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 139543788}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Rather a lot of road noise, even with the window closed.", "title": "Booked for a one night stopover - could have stayed all week", "helpfulness": 2, "user": "Jonny-Northerner", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139392600}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "It was the best choice for an one-night stay on my way to Brugge, giving us also the option to spent a couple of hours in Ghent. I was recognised as a Gold Priority Club member and the welcome envelope included free WiFi access codes and vouchers for free beers at the bar. For ~50night (including breakfast as in all HI express) using a meber's exclusive prepaid rate, the deal was unsurpassed. The room was spacious, shower only (not full size bathtub given that it is not a 4*), and the matress was super-comfy. Even better sleep quality compared to the much higher ranked Crown Plazza (of the same IHG hotel group chain), we had stayed in Brussels.", "title": "Unsurpassed value for money", "user": "Enoikos", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145445766}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This was the second time for me in this hotel. The entrance is nothing special but nice and clean. The service was quick and very frendly.", "title": "Considering the price very acceptable", "user": "Jacob_Nu", "date": "November 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 145128438}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The rooms are nice and offer all you need for a simple business night. The breakfast has good choice, not enourmus but there is something for everybody. You can not expect to much for a free breakfast. Anyway the food is ok.", "title": "Good value hotel, need a car though", "user": "SeaViewAbroad", "date": "November 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 144859179}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I would come back again. The service here is much better than at the more expensive Holiday Inn in Gent.", "title": "Reasonable hotel let down by poor wifi", "user": "DavidSHQ", "date": "November 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 144761949}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Good quality hotel with good sized rooms for families. A couple of problems were that I didn't realise when I booked that a charge was incurred for parking in the hotel car park of 10 euros, thought this should have been made more clear when booking. Another issue was with breakfast, when I booked it didn;t really state that breakfast was included and on arrival no mention was made of breakfast to me, therefore we left in the morning without eating breakfast to save money and ended up in McDonalds in France on the way home, was gutted when we arrived back home only to find out breakfast was include for us and children! We stayed here as we wanted to go to Brugge but nothing of any quality was available (all booked up due to a carnival) so went here. It was a bit of a drive in to Brugge (30 mins) but nothing major and we did venture briefly in to local Ghent which looks like it would also be worth a proper visit some time.", "title": "Good clean hotel", "user": "icelollyonthebeach", "date": "November 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144392821}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Did NOT like the squishy beds and lack any kind of support. Oh my back. Teens running and screaming down the corridors. No real supervision either. Parking costs 10 euro's and not really secure. open gate all the time. Not good. Had to ask for a ice bucket, took 20 minutes to find one.", "title": "We are not whiners but Very uncomfortable beds. Need an update please. Shower lever is broken.", "helpfulness": 1, "user": "LarryN", "date": "August 26, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 138371191}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Air conditioner was very LOUD and not usable to sleep by. Buy some ear plugs for this hotel. Open window with traffic noise, can't win here. Will NOT be back. Going to try the continental breakfast now. Wish me luck.", "title": "1 night in Gent", "user": "D B", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 138123966}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed here 1 night. It's an okay place. Rooms are average, breakfast was average. At least there was a bar where I could get some food since we got in late. Bonus points here for good working internet! That was kind of a rarity on our family recent Europe excursion. Horrible location if you wanted to visit Gent. But it's right off the freeway and easy to find if you're just stopping through.", "title": "Excellent food", "user": "Paul B", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137497620}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed overnight to break a long journey to Holland by road. We booked a family room which had adequate space for my wife and I plus our two young children. The beds were comfortable enough. For me the best part was the food in the all you can eat buffet. This tasted like gourmet food and honestly the best I've had for a long time. The breakfast was nearly as good and there was plenty of it. I definitely recommend staying here.", "title": "Excellent four nights' stay and don't listen to the whingers!", "user": "45eminence45", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136406260}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "No wonder the Aussies call us whingeing Poms!", "title": "Affordable accomodation quite outside the city", "user": "Eric D", "date": "July 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 133702424}, {"rating": 4.0, "title": "Reliable stay in Gent", "text": "Have stayed here on a regular basis for a number of years. Always reliable and the restaurant is good. Friendly barman who's been there for years and is always attentive although bar itself is a bit spartan. It is out of town but very easy to get to from the motorway system. Wifi is reliable throughout hotel, even in the rooms farthest from reception.", "user": "ifand", "date": "October 16, 2012", "id": 142978102}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Never tried the buses as the taxis are easy and not overly expensive.", "title": "Nice accomodations, nice price", "user": "lmcwyc", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142656535}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "People complaining about lack of bath should remember this is a Holiday Inn Express. They don't have baths! If you want a bath stay in the Holiday Inn but the restaurant isn't so good there.", "title": "Brilliant for the price", "helpfulness": 1, "user": "RoyalPeanut", "date": "October 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142152766}, {"rating": 2.0, "title": "Poor", "text": "Ideal for business or travel.", "user": "phukface", "date": "September 28, 2012", "id": 141474177}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The Holiday Inn Ghent was a nice place to stay for a reasonable price. The room was clean and comfortable for three people, the breakfast was fantastic, and the location was very convenient to the motorway and Brussels. The hotel was not located near the downtown historic area, but it was not difficult to reach via automobile and parking was available downtown. There was also a nice restaurant and bar on site.", "title": "Very good !", "helpfulness": 1, "user": "Mr_Chulo", "date": "September 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140191056}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "stars": 3, "variance": {"poor": 14, "average": 57, "very good": 92, "terrible": 3, "excellent": 31}, "aka": "Holiday Inn Express Gent Hotel", "slim_ranking": 0.416666666667, "description": "Find your gateway to Flanders with convenient transport connections close to the Holiday Inn Express Gent hotel.Just a couple of minutes from the convenient E17 motorway and 4km from medieval Gent city centre, make the contemporary Holiday Inn Express Gent your base for exploring the Flanders region. Major business centres such as Brussels and Brugge are within 35 minutes' drive of your welcoming Gent hotel.You can reach Holiday Inn Express Gent via regular rail services from Brussels Airport, which arrive into Gent St Pieters station, 3km from the hotel. We have an ample car park, which adds good value to your stay. Your spacious Guest room is the ideal environment for catching up on work with complimentary wireless Internet.The hotel is close to popular sights in the city, notably the atmospheric charm of the medieval Old Town including St Bavo's Cathedral, with its mystical paintings. For the great outdoors, try Belgium's northern coastal resorts, within a 40-minute drive from us. Kids under 18 stay for free with their parents in one of our spacious Guest rooms.This Green Key eco-label certified hotel uses 100% renewable electricity to lessen its impact on the environment. Help yourself to a hot drink and the complimentary continental breakfast options at Holiday Inn Express Gent. Our helpful staff can advise you on which city-centre attractions to visit."}