{"user_rating": 4.5, "review_count": 62, "name": "Holiday Inn Express Ontario Airport - Mills Mall", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This hotel is very nice. It's been recently renovated and it shows. It is in a great location, walking distance to the Ontario Mills Mall & all it's food/shopping/entertainment!", "title": "Very Nice Hotel in a Great Location", "helpfulness": 3, "user": "Tuckers", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7194598, "likes": {"liked": "— The location was great, room was nice, price was good!!", "disliked": "— I liked everything."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "The hotel itself is very clean, and well kept. It's not a huge hotel, which is nice. Its 3 stories. We were on the 3rd floor with a view of the pool/jacuzzi.", "title": "Love this place!", "helpfulness": 2, "user": "515Traveler", "date": "December 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6341299, "likes": {"liked": "— The room was beautiful, clean, and comfortable."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Checkin was quick and easy. Took all of about 90 seconds. The desk person was very friendly. He told us how to get to our room and informed us about the free breakfast. We needed a bandaid during our stay and the same guy helped us (cannot remember his name). He dug through boxes and boxes of first aid kits to find one for us. Nice guy :)", "title": "Wonderful new hotel!", "helpfulness": 1, "user": "Olathe_KS_Traveler", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5488643, "likes": {"liked": "— New, Clean & Safe area", "disliked": "— Pool closed at 10:00 pm"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The room itself was nice. We had 2 queen beds, with lots of pillows and nice white bedding. There was a piece of furniture across from the closet that doubled as a seat and also as storage, with a huge drawer underneath. The closet had a mirrored door, which was a nice touch. The room had an armoir with tv and drawers underneath. A frig and microwave unit, which was great. We used the frig a lot! There was a desk, and a chair. The tv had many stations, we had no trouble finding something to watch. The beds were comfortable, but the pillows too stiff for our liking. We were too tired to call and ask for any others, but I am sure we could have. The walls are a little thin, and we could hear our neighbors, both above us and beside us. The people next to us were up kind of late, and that was slightly annoying, but not the hotels fault.", "title": "Large, beautiful room, great amenities - nice, new hotel", "helpfulness": 1, "user": "ceeshel", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5188805}], "location": {"country": "United States", "city": "Rancho Cucamonga"}, "stars": 2.5, "variance": {"poor": 2, "average": 6, "very good": 20, "terrible": 2, "excellent": 32}, "aka": "Holiday Inn Express Ontario Airport - Mills Mall Hotel Rancho Cucamonga", "slim_ranking": 0.666666666667, "description": "Welcome to The Holiday Inn Express Hotel & Suites Rancho Cucamonga. A 100% non-smoking hotel in Rancho Cucamonga, CA, we are the newest Holiday Inn Express Hotel & Suites. We are just 5 minutes from Ontario Airport (ONT), and we offer a complimentary taxi to the Ontario Airport with advanced notice. The unique design of the suites include some with Jacuzzi suited for the needs of business and leisure travelers. Swim year round in our outdoor heated pool, relax in our hot tub or workout in the fitness center. Catch upon work in our business center or in the comfort of your room with our fast & free wireless and wired high-speed Internet. Our two boardrooms, conference rooms and outstanding service make this Holiday Inn Express the place to meet. This nice, upscale hotel is located just minutes from Ontario International Airport, Ontario Convention Center, Ontario Mills Mall, Citizen Business Bank Arena and California Speedway. We are just steps away from over 30 restaurants like Famous Dave's BBQ, Dave & Buster, Red Lobster, Boston s, BJ s Brewery and many more. Businesses near hotel: Mercedes Benz training center, Frito Lay, Coca Cola, BMW training center Attractions near hotel: California Speedway, Scandia, Ontario Mills, Victoria Gardens mallThe Holiday Inn Express Hotel & Suites Rancho Cucamonga - always fresh, always clean, everything you expect and much more."}