{"user_rating": 3.5, "review_count": 28, "name": "Holiday Inn Express & Suites Phoenix Tempe University", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Had some stuff stolen out of my luggage my the maid and had to have the police come out. Staff were not overly concerned, nor did they show a sense of urgency. 3 days later and still no call or email from mgmt to apologize or tell me that my things were recovered-the police did call to say my things were found hidden in the laundry room along with other guests' possessions. Probably have to head back to AZ from CA to get my stuff because it's been booked in as evidence, but who knows when. This is the short version, believe me, but needless to say I will never patronize this chain again.", "title": "Worst experience ever!", "helpfulness": 1, "user": "Casey K", "date": "March 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 126420160}, {"rating": 1.0, "stay_parameters": "Stayed March 2012", "text": "This places is a totally failure when it comes to guest service. Requested two bed room only got one bed.understandable with a busy weekend but unwilling to find a rollaway bed or provide sufficient alternatives to help out. Served cold breakfast that was meant to be hot. They seemed very unwilling to listen to any compliant or to provide a service solution. Would definitely never stay in this place ever again.", "title": "Wow", "helpfulness": 2, "user": "benchy6", "date": "March 17, 2012", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 126212481}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This was the old Comfort inn. For a 3-star, I won't say it's cheap... but well, it was recently renovated and we stayed there in early Jan ... pretty much shortly after they first opened. The location is also relatively convenient.", "title": "Well, recently renovated.", "helpfulness": 1, "user": "keltzar", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125707840}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "It was nice as everything was still new, though there were things that certainly needed to be tweaked. The staff were friendly, though not always as helpful as could be primarily because some of them did not seem very familiar with the environs.", "title": "Clean and Restful- Near Light Rail Line", "helpfulness": 5, "user": "LasVegasMike", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124500436}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We were upgraded to a King Suite which was a very ample space. The staff was friendly, the bed very comfortable, the room clean and inviting, no issues with the internet. Breakfast was as expected, hot and tasty.", "title": "Pleasant stay in Tempe", "user": "Chris P", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145325323}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Well here we are in Tempe this week, and at another Holiday inn. I have to say I had a wonderful night sleep. We got here in the late afternoon in the heat of the day. Check in went well. got to our room, and it was very nice. We had a King suite, and it was roomy. As I said I had a very good night sleep. The room was cool, and quiet.", "title": "Just a few bumps", "user": "leahtots", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135494516}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "My husband had to work, so I had a day planned at the pool with a book. I went down to the pool, it was green. Not good, but that's was ok, I could still go back to the room with my book and read. Then the tv went out. I know I was reading, but I like background noise. It was out for about 1/2 hour then it was all ok.", "title": "Another Great Stay At Holiday Inn!!", "user": "drives2much", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135210070}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "All in all, it was a good stay.", "title": "Above average for average hotel", "user": "JP W", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131302884}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I've been staying at holiday inn on business for 5 years now. This was the best stay so far. Very nice rooms, Nice flat screen tv, nice and cold A/C unit. Very comfortable bed and pillows, and most of all, its nice and quiet! Friendly staff. I always have a great experience when i'm in Arizona and at holiday inn. Dont let the construction on Rural rd and Apache Rd. discourage you (June of 2012). Your close to all the malls and restaurants. Thanks again and keep up the great work.", "title": "No help at all.", "helpfulness": 1, "user": "raymond v", "date": "April 28, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129000128}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Stayed this week at the hotel and found it lived up to the reviews as a nice hotel at a decent price. One of the reasons I stayed here was because of their airport shuttle service. The driver who picked me us Tuesday night was prompt, friendly and knowledgeable. Check-in and the rooms were as to be expected.", "title": "Good hotel, Failure on Transportation", "user": "Bill L", "date": "February 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152786106}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "However, the following morning I was planning to use their shuttle once again. Upon arriving in the lobby I learned the morning driver was sick and his replacement wouldn't arrive until 12:00 Noon. So, I had to call a cab. Sure, it was only $10 bucks, but I was still perturbed due to the time for the cab to show up. My question is:", "title": "Nice hotel, great service, can be noisy with college kids", "user": "Frank H", "date": "February 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 151327796}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "1) Why don't you have a better Plan B when an employee is out due to illness?", "title": "Clean, Average rooms, helpful staff", "user": "ML B", "date": "January 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 149612425}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "2) If your Plan B is requiring the guests to call cabs, why don't you take the initiative and see if any cabbies would be willing to wait at the hotel.", "title": "Good location & facilities, average staff", "user": "Joe M", "date": "January 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148696144}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Stayed here for three days while visiting Tempe on business. the service was good, the staff was friendly, the rooms were nice. However, there are problems:", "title": "Stay in Tempe", "user": "Lis K", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146725387}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 2, "average": 5, "very good": 7, "terrible": 3, "excellent": 11}, "aka": "Holiday Inn Express And Suites Tempe Arizonia - Asu", "slim_ranking": 0.510638297872, "description": "New in 2012, the Holiday Inn Express & Suites Phoenix Tempe - University is exquisitely designed in modern styling. With convenient access to I-10, we are within walking distance to Arizona State University as well as the popular Mill Street District featuring a wide variety of shopping and restaurants. Guests will appreciate our close proximity to Tempe Town Lake, Tempe Market Street that has some of the well know names all in walking distance and the Phoenix Sky Harbor International Airport. In addition we are located not to far from many corporate business such as Limelight networks, US Airways headquarters, Microsoft, Rockford Fosgate, Hybrid Designs, Quiktrip Division office, First Solar, and Salt River Project to name a few. Coming to town for Spring training? We are located closely to the ballfields. So the next time you are traveling to Tempe Arizona how about giving the Holiday Inn Express & Suites Phoenix Tempe University a try.We now have a complimentary shuttle that will run our guest to different venues within a certain mile radius of the hotel."}