{"user_rating": 3.5, "review_count": 27, "name": "Holiday Inn Louisville I-264 Airport East", "reviews": [{"rating": 2.0, "title": "Under Renovation until Sept 2006, Take Care!", "text": "Stayed here June 2006. I had booked on Holiday Inn Website which made no mention of the fact that the hotel was being extensively renovated until September. Upon check-in we were advised that the pool and health club were closed, by a very apologetic young man. I felt quite bad for the staff as it seems all guests are unaware until they get there. There is a Bob Evans in the parking lot, where, in hindsight, we should have eaten. But we made the mistake of eating at the hotel. Our waitress informed us there was no kids menu and no draft beer (not a good start) As she told us this, another waitress came over and gave our children kids menu's?? We were then informed they had the menu's but not the food on them! We were the only guests eating there, I wonder why?", "helpfulness": 3, "user": "TraceyJ1453", "date": "June 10, 2006", "id": 5330375}, {"rating": 4.0, "title": "Enjoyed Our Stay", "text": "Room felt old and neglected, we awoke at 8am to hear a crew of electricians working in the hall outside our room, we opened the curtains to reveal a painter outside our window painting the balcony, luckily we were all clothed!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 18, 2005", "id": 4124543}, {"rating": 4.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "Breakfast was complimentary, but very makeshift. Large plastic bowls containing yogurts(they only had kids Danimals) or cereal (Rice krispies or frosted flakes) Great for my 10 year old!", "title": "Decent hotel", "helpfulness": 5, "user": "babybird", "date": "October 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4039597}, {"rating": 1.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "Its sad, this hotel had 'good bones', and I'm sure will be fine when finished. But a very stressful stay right now!", "title": "Don't Bother", "helpfulness": 1, "user": "kingen", "date": "September 23, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 3933814}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "We visited this Hotel during a convention. The location was ideal and just a short distance to the convention center. The Staff is very helpful. Most everyone smiled and said hello when passing in the halls. We had a slight problem in the restaurant which was quickly corrected. Our room overlooked a small lake and pool area. The grounds were beautifully landscaped. We will definitely return to this property.", "title": "Kentucky Fried Chicken friendliness", "helpfulness": 1, "user": "mjgatto", "date": "June 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3558062}, {"rating": 4.0, "title": "Charming Hotel", "text": "Our stay at this Hotel was delightful. It is unlike any Holiday Inn we have ever visited. Beautiful woodwork! Loved the Staff, the lake and the Ducks!Made us feel very at home. Prime Rib and Bourbon Tasting were Awesome. Thank you fo a very enjoyable stay. We will be back next year.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 16, 2004", "id": 1553857}, {"rating": 1.0, "title": "Old and worthless", "text": "Upon arriving to this property on 11/01/03, I was pleasantly surprised by the age of the property, it seemed nice until I walked in. The front desk staff seemed to be annoyed that I was interupting her phone conversation, after a minute or 2 she reluctantly checked me in. My room was very dark and smelled very and musty. The seemed to have a decent menu, but the service was terrible, again more upset staff and the food was not worth the money. My steak was overcooked, I asked for rare and got well done, I sent it back and asked for rare, it came back well done AGAIN and with the same fries, now cold! I sent it back and did not want another one. The bar server was plesant and talked me into having an appetizer, which came out cold and 35 minutes later. I would not recommend this Holiday Inn to anyone who wishes to not have a smelly room and good food. I only wish there were more restaurants near, I would have definately gone. I ordered pizza from Dominoes instead.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 18, 2003", "id": 1492027}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "First, I have to disclose that my review may be colored a bit by the fact that we stayed in a stellar Holiday Inn Express the night before.", "title": "Are you a budget hotel, or a full-service hotel?", "helpfulness": 4, "user": "Redbeard25", "date": "April 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3369667}, {"rating": 4.0, "title": "Service is a plus!", "text": "Like a previous reviewer, we also booked the Holiday Inn Airport East on an Entertainment card rate. The hotel is a bit hard to get to from the freeway. Basically, keep turning right until you see the green sign! Once you're there, it's evident that this 1971 hotel, built in conjunction with the Kentucky Fried Chicken headquarters, is a substantial property. The front entrance is worthy of the \"old south\" area of Disneyland. According to their website, the hotel was renovated in 1996 and \"further enhanced\" in 2001. I'm guessing that the 1996 work was new carpet, some furniture, wallpaper, air conditioning upgrades... that sort of thing. 2001 enhancements probably involved converting smoking rooms to non-smoking and doing a \"bath fitters\" treatment to the guest bathrooms.", "helpfulness": 7, "user": "kingter", "date": "October 13, 2004", "id": 2700439}, {"rating": 5.0, "title": "Great place, great experience!", "text": "Our single king was in good shape: clean and not showing too much wear for a 34-year old room. Our TV exhibited some odd issues - the mismatched remote somehow put it into radio mode and we couldn't get it back to television. Every room in the hotel has a \"balcony\" about two feet deep. About all that it's good for is smoking (if you're into that kind of thing.) The window air conditioner/heater was a little loud, but that was nothing compared to the traffic noise: the occasional big rig hitting its brakes really bugged me. Big tip: all odd numbered rooms, and all rooms between X32 and X70 face away from the highway. Ask for one.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 24, 2004", "id": 2318764}, {"rating": 5.0, "title": "Best place to stay", "text": "Hotel amenities include wireless Internet which worked right off the bat for us, laundry, and a swimming pool which was drained. The staff seemed competent and friendly. The guest after us looked like he was bumped from a flight, and was gladly given free toothpaste and toothbrushes.", "helpfulness": 7, "user": "cruisinmeli", "date": "May 27, 2004", "id": 2124002}, {"rating": 5.0, "title": "Loved this Historic Hotel", "text": "The continental breakfast was straight off of a Sysco food service truck: too big gooey pasteries, assorted cereals, bread and bagels, coffee, tea, hot chocolate, and a tip jar. Again, having spent the previous night in a stellar Holiday Inn Express, it seemed like the breakfast was underwhelming... and we were being asked to tip for the honor.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 24, 2004", "id": 1741841}], "location": {"country": "United States", "city": "Louisville"}, "variance": {"poor": 3, "average": 6, "very good": 12, "terrible": 2, "excellent": 4}, "aka": "Holiday Inn Louisville i-264 Airport East Hotel", "slim_ranking": 0.729166666667, "description": "Experience Southern Hospitality, Louisville-style, at the stately and charming, Holiday Inn Airport East, Louisville, KY . Surround yourself on our Southern Living landscaped grounds or relax on the patio overlooking the spring fed koi-filled lake. Your spacious guest room awaits you in the Heart of the Bluegrass. Guest rooms are well appointed, offering one of the largest rooms in the area. Free wireless high-speed Internet access is available in all areas of the hotel. The SportsVille Grill offers breakfast 6-10am. Our full service restaurant serves dinner and room service daily from 5:00pm-9:00pm. Kids eat free with a paying adult. Join us in our SportsVille Bar to unwind in the evening from 5:00pm-11:00pm. Be sure to check out our Kentucky Derby Package on our reservations page! We offer newly renovated banquet rooms with state-of-the-art audio-visual equipment. We proudly offer a full-service catering service. Our professional sales staff will plan your special event. A complimentary 24-hour shuttle is offered within a 3 mile radius including Louisville Int. Airport, Bowman Field, UPS Hub & Training Center, KY Exposition Center, Six Flags, GE, Ford, and Yum, just to mention a few. The hotel is in the center of it all, only minutes away from any location in the city. The hotel offers a 24-hour on-site fitness room. Free parking is available to all guests, including those with motor coaches and RVs. Our Guest Service staff finds pleasure in working with you and for you to make you feel at home!"}