{"user_rating": 4.0, "review_count": 327, "name": "Holiday Inn San Jose Downtown Aurola", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The Aurola is a good sized Holiday Inn located across the street from the Morazan Park in downtown San Jose. The hotel itself is fine, but as many other reviewers have noted, the area where it is located is not the best. We only walked around during the daytime. We did enjoy seeing parrots and other birds in the park across the street.", "title": "Good Hotel across from Morazan Parque", "helpfulness": 1, "user": "807wheaton", "date": "February 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96642163}, {"rating": 2.0, "stay_parameters": "Stayed January 2011", "text": "We stayed at this hotel as part of a Caravan Tour, which was wonderful. However, I am probably the only person in a week or so of tour guests that was interested in using the swimming pool. The pool was closed because they were redoing the tile and fixing other things. The first night we were there we could and did use the hot tub which is in the same nicely decorated area. They also have a ping pong table in the pool area. The second night entrance was not allowed in the pool room because they were painting. This was very disappointing to me as it was the middle of January and the pool and hot tub were high on my list of things to do for my \"winter break\". Why they would do this when the hotel was full of tourists I don't know. We also had no hot water for our shower for two days. Pool towels were provided at the pool.", "title": "Didn't care for it.", "helpfulness": 2, "user": "Capnemo", "date": "February 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 96222984}, {"rating": 2.0, "stay_parameters": "Stayed January 2011", "text": "The elevators are operated by using the room key card and we could not get off the elevator at any floor but our own. This was a problem as the friend we had with us was put in a room on another floor......she finally got a second card so we could go back and forth. Too bad they didn't put her next to us because we had a room with the adjoining door. Hotel management at its best, I guess.", "title": "Skip it if you can...", "helpfulness": 2, "user": "TXRosie50", "date": "February 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 95300536}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "When we returned from our tour, the pool and hot tub was up and running. We even enjoyed a good game of ping pong. The restaurant is very pleasant here and the food was excellent. We enjoyed fresh pineapple at every breakfast and dinner which was included in our tour. There is a business area where we could print our boarding passes and there is a tiny gift shop in the lobby.", "title": "Nice Stay", "helpfulness": 1, "user": "WeLoveCR1", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 93460582}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The bathroom and bedroom were clean and the towels were getting a bit thin but were fine. All the lights worked and the lighting was very good for reading in bed. We had one bathrobe in the closet in a room for two people. Oops.", "title": "Lovely Hotel", "user": "VenusianTaurus", "date": "January 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92827368}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Our recent stay at the Holiday Inn Aurola in San Jose, Costa Rica was very disapointing to us. We were staying on the \"executive level\" which includes some extra services. When we came to the breakfast area at 9AM there was almost nothing left to eat and no one was there to refill anything. There was seldom anyone in this little office so checking out in there was also impossible. When we asked if we needed to make a dinner reservation in the upstairs restaurant we were told it was not necessary during the week but no one told us they were having a huge party in there that same night...........so the restaurant was packed and very loud. Basically, the only people that were very friendly and helpful were the busboys out front.", "title": "very dissapointing", "user": "flycouple2", "date": "November 20, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 87708876}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Some of the staff spoke very little English and checking out was difficult, to say the least.All in all I can not recommend this hotel to anyone and we will not return.", "title": "Not on my top ten. Or on my top 200.", "user": "Kats858", "date": "November 17, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 87440569}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "Terrible service! I should mention that after a very long afternoon at the dentist office we came back to the hotel that evening and went to the bar, which is open until 12PM. It was 9:45PM and the bartender had decided to close up and was very rude to us when we asked to have a drink. Unbelievable! to make matters worse, the 24 hour restaurant decided to close at 10pm.", "title": "was a very nice hotel!", "user": "timgiglio", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86016369}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "This hotel needs a new manager badly.", "title": "average but still decent value because of the location", "user": "rchaudry", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 83905206}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I stayed at this Holiday Inn after a colleague insisted, as it was supposed to be near the place where we had scheduled a meeting. Please remind me to never ever let him pick a hotel again.", "title": "Satisfactory but no more.", "user": "bruceklein", "date": "October 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 81850355}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "My stay at the Holiday Inn San Jose was excellent, punctuated by the outstanding front desk staff. I'd like to mention Joseph, who was is an exemplary front desk agent in that he is cordial and extremely professional. He made our stay here particularly worthwhile. The hotel fulfilled all my expectations and I would recommend this hotel to anyone staying in the San Jose area.", "title": "Excellent stay, very enjoyable", "user": "sazaragovia", "date": "December 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88942925}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "If you use priority club points they will not let you have the free breakfast even though there is NO WHERE online that says that. So its false advertising and their english is so poor they pawn you off more easily...wasn't happy with stay in general. Prostitutes were outside in the park across from hotel working their strip, not a safe city to wander at night!", "title": "No free breakfast if you use priority club points and wifi not reliable", "user": "abbyaudi", "date": "December 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 88853056}, {"rating": 3.0, "stay_parameters": "Stayed November 2010", "text": "The Aurola Holiday Inn is actually a 5-star hotel by Costa Rican standards, probably closer to a 3-star experience by American standards. Nonetheless, it was an enjoyable stay. The lobby area is nicely decorated, and the staff is courteous and very helpful. The rooms are a decent size, neat and clean, and furnished with modern decor. The sleep quality is very good. Many people complained about the noise, but I stayed on both the 6th and 12th floor and was not bothered by any street noise, so I'm not sure what the issue was. The hotel is in an excellent location. It's about 3 blocks from the main Avenue where a bunch of shops and restaurants are located. There is an internet cafe literally across the street, and a huge grocery story about 1 block away. It's easily walkable to all of these locations. While not a true \"5 star\" experience, it was more than I expected for a city like San Jose, and I definitely had no complaints.", "title": "Great hotel location!", "helpfulness": 1, "user": "TravelAdvice101", "date": "November 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 88540249}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Stayed here at the beginning and end of a tour of Costa Rica. Enjoyed the very central location in the heart of bustling San Jose. The room and public spaces are extremely clean and comfortable. The hotel staff was helpful and personable, and we were relieved to find they also spoke English quite well. We had a lovely view from our seventh floor room, looking out over the adjacent park, the jumbled rooftops and the distant mountains. The streets adjoining the hotel are busy day and night, but the insulation was good and we had no problem with street noise. The food in the hotel is mediocre. You can do better by finding restaurants in the immediate area.", "title": "Quiet oasis in center of busy San Jose.", "user": "bluejean18", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 88489691}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "After reading about San Jose, and the area around the hotel, we were a little intimidated to venture out on our own the day we arrived. However, with a very nice tourist map (provided at the hotel front desk) and a few tips on interesting things to see within walking distance, we thoroughly enjoyed exploring the local area. The pedestrian friendly Avenue Central is only a couple of blocks from the hotel. Leave your valuables in the hotel safe and go there. Visit the marketplace, the parks, and dine at the local eateries. We were so glad to get a feel for the city in this way. Our most treasured souvenirs were purchased from the stalls at the artist market only a few blocks from the hotel.", "title": "Not the Quality of a Holiday Inn That I Have Come To Expect", "user": "mukilteomaniac", "date": "November 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 87933062}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This hotel is within walking distance of most things to see in central San Jose, although San Jose is a pretty rough city and walking other than during daylight and business hours may not be a good idea. The staff was courteous, but quite stiff by Costa Rican standards. The hotel says it is Five Stars, but that is a big stretch. It may have been so once, but it is faded. We stayed two different times over two weeks. First room was a little worn but generally well-maintained. Second room was notably shopworn. Cleanliness was good in both. In general, the place feels like it is in decline. We ate at both the first-floor buffet and the top floor elegant restaurant. The food was mediocre and the service was less than mediocre.", "title": "Perfectly OK, but not Five Star", "helpfulness": 1, "user": "hcajones", "date": "February 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 98418419}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I stayed at the Aurola upon our arrival to San Jose for a Caravan tour. We stayed two nights at the beginning and three nights at the end of the tour. The hotel itself is lovely, clean, the staff including housekeeping and bellboys were all very respectful and courteous. We ate free with the tour but they did not offer free breakfast after the tour. We walked a couple of blocks to the local supermarket for food which was fine with me. All other hotels in the area offered free breakfast. That being the only drawback, we enjoyed ourselves greatly and made many new friends in San Jose. The downtown area at first seemed liked it could be a dangerous place and I am sure that it can, but we didn't walk around with big bags, camera or anything of value showing. Most of the gift shops and restaurants accept you credit card so there wasn't a need for colones. The more you walk around San Jose, the more you will enjoy it. Beautiful weather, beautiful people, beautiful trip! We are already making plans to return!", "title": "For downton San Jose, it is the best hotel..", "helpfulness": 2, "user": "Bigbeautifulplanet", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 98102012}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My wife and I had a one night layover in San Jose at the Holiday Inn Aurola on our way to and from the Caribbean coast. The staff was great, the room was perfect and they had transportation arrangements with the local taxi service to take us to the airport for a flat rate ($25 US). We were delighted by the vouchers for welcome fruit punch cocktails at the second floor bar we received on our arrival. The hotel accepted currency in US dollars or CR colones. They also had a business center we could use to print out our boarding passes for the next morning's flight ($3 US for 30 min of $10 US for 24 hours). All in all it was a pleasant experience.", "title": "One night layover in San Jose", "user": "zzolvin1", "date": "February 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 97349554}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Everyone was very courteous, helpful, fast and friendly. The pool is awesome and the restaurant great. I will stay there again!. The only issue I have is that there is a club or something that plays music at night. It's faint and it didn't bother me much.", "title": "Very Nice", "user": "Smilemani", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 96812470}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The summary says it all. Location is excellent. Hotel is clean but appears a little worn. Service in Mirador Restaurant was uneven over several meals, most of the time excellent. The food was very good. There was a misunderstanding relating to our order, which was probably due to a language problem.", "title": "A Good Place to Stay", "helpfulness": 1, "user": "arovin", "date": "February 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 96644357}], "location": {"country": "Costa Rica", "continent": "Central America"}, "stars": 3.5, "variance": {"poor": 31, "average": 75, "very good": 109, "terrible": 10, "excellent": 102}, "aka": "Holiday Inn San Jose Aurola Hotel", "slim_ranking": 0.325301204819, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Experience a relaxing getaway in the heart of Central America at the Holiday Inn ® Hotel San Jose Downtown – Aurola, conveniently nestled in the center of lively San Jose, with panoramic views of the beautiful Central Valley. Conveniently located within walking distance of a variety of local attractions, guests will enjoy superior modern amenities and facilities such as free high speed WIFI access, an on-site business center, large meeting rooms, swimming pool and hot tub, fitness center, pub bar, and two restaurants. Discover a hotel where technology and hospitality come together in perfect harmony, where you can stay connected with modern Internet wireless access, and disconnect with a relaxed Costa Rica ambiance and modern luxuries. Whether visiting for a leisure getaway or a business connection, this San Jose hotel offers a peaceful, productive atmosphere where you can get the most out of your San Jose experience.Conveniently located within walking distance of all the best downtown attractions as well as downtown businesses. You will enjoy people watching in Parque Morazan, located just outside our front door. This park features a number of sculptures and monuments which decorate the expanse of urban green, including a beautiful domed structure, known as Templo de Música, or the Temple of Music."}