{"user_rating": 3.0, "review_count": 527, "name": "Holiday Inn Manchester Airport", "reviews": [{"rating": 3.0, "title": "Functional", "text": "stayed recently and took the offer to leave the car whilst on holiday in the USA and in this respect it was good value but on the website removing the car parking the hotel was quite expensive. The hotel itself has small rooms and looks as if it is for travellers only - i.e. people staying only one night before moving on. There is not much else around and we decided to eat in the hotel which we found to be extortionate. The hotel is clean and tidy befitting a Holiday Inn but unless we travel from Manchester Airport again will probably not return. Best bit is the coach service to the airport - a regular and very efficient service and drivers helpful", "user": "Wanzebra2", "date": "May 26, 2007", "id": 7700404}, {"rating": 5.0, "title": "Lovely Stay", "text": "We decided to book this hotel on the last minute as we had a flight early the following morning. Having used Holiday Inns before, and considering the price £49 for the room, and the fact that we could leave our car there for an extra night for just £8 we decided to book, as it would have cost nearly £40 just for the airport long stay car park.", "user": "lnt999", "date": "May 25, 2007", "id": 7695400}, {"rating": 4.0, "title": "The parking was great", "text": "The room was very comfortable with the usual facilities you might expect but for convenience we also decided to have dinner for 2 at £15 each and breakfast for £10 for the both of us. This actually ended up being cheaper than booking a dinner bed and breakfast deal. Both the dinner and breakfast were very nice and it was the perfect start to what turned out to be a very good weekend.", "user": "Duncans", "date": "March 13, 2007", "id": 7153606}, {"rating": 1.0, "title": "Not Nice and Not Near Airport", "text": "The staff were very friendly and pleasant and I will certainly consider using this hotel next time I fly from Manchester Airport, which, actually, might not be too long off.", "user": "Historiana", "date": "January 27, 2007", "id": 6705362}, {"rating": 5.0, "title": "excellent stay", "text": "My husband is quite particular about his precious car, so we were a bit concerned about leaving it at the airport for the first time (having heard the horror stories on Watchdog). We need not have worried. Check-in was a bit slow as there were a lot of people waiting and only one person on reception, however we were given instructions on where to park the car and how to get into the car park which was well lit and had ample spaces with two barriers to go through.", "user": "barton77", "date": "January 12, 2007", "id": 6582332}, {"rating": 3.0, "title": "Insecure carpark", "text": "Room was fine and teamaking facilities and toiletries were welcome. Enjoyed the pool and spa facilities. Staff were friendly and helpful and the airport bus was efficient and had a very helful driver.", "user": "Worldofweasels", "date": "January 11, 2007", "id": 6574500}], "location": {}, "stars": 3.5, "variance": {"poor": 91, "average": 132, "very good": 163, "terrible": 61, "excellent": 80}, "aka": "Holiday Inn Manchester Airport Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "Holiday Inn Manchester Airport is superbly located just 2 miles from Manchester Airport and within easy access to the M56, M60, M62, M6, and Manchester City Centre. Holiday Inn Manchester Airport offers 126 bright, modern and contemporary bedrooms. All rooms offer AC and WIFI Internet Access, an ideal hotel for the business and leisure traveller. The hotel's Conference Centre offers 13 suites all with AC, WIFI, and contemporary Conference Cafe. The Cheshire Suite holds up to 300 delegates and is an ideal venue for Weddings, Private Banqueting and Christmas Parties and Business The Park and Fly packages provides guests with on-site secure parking and shuttle bus to and from the Airport terminal.For the healthy minded our Club Motivation Leisure Club offers a 46ft Swimming Pool, fully equipped Gymnasium, Squash Court and Spa.Holiday Inn Manchester Airport makes an ideal base for visiting local attractions including Manchester United Old Trafford Football Ground, Tatton Park, Trafford Centre, and Manchester City Football Club. The Manchester Airport hopper service runs to/from Manchester Airport every 15 minutes at peak times from 4am-11pm daily. 3 Single, 5 return per adult. 1 Children. Pick up points Terminal 1 Bus Stop 4, Terminal 2 Bus Stop 3, Terminal 3 Main Bus Stop and Train Station Main Entrance"}