{"user_rating": 4.5, "review_count": 681, "name": "Holiday Inn Central Plaza", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I stayed at this hotel with my Teenage daughter. Nice large rooms - comfortable and clean. Very helpful and responsive staff. Our toilet broke - chain fell off flapper. I called the desk and it was fixed in 15 minutes. Also, My daughter was not feeling well. I went to dining room and explained that she wanted tea, toast and jam. Five minutes after returning to my room the food appeared.", "title": "Great Place to Stay - also had great guide in Bejing", "helpfulness": 2, "user": "drmagref", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76962806}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Nice breakfast with chinese and euro-american food. The only hotel I stayed in durin g our two week sin China that had cheese at breakfast. The breakfast included a Beijing Breakfast Pancake - very yummy - and broad choice of chinese food and fresh fruit.", "title": "Helpful and attentive staff made our stay a pleasure.", "user": "FamilyDUk", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 76811301}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The location is a bit out of the way - but only a RMB 22 ($3.25) cab fare to Wanfujing or Forbidden City. Other benefits are nice local restaurants and a grocery store near by.", "title": "Comfortable, generous and friendly hotel", "user": "Lorchetam", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 75762748}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Lastly, we had a wonderful guide in Beijing. He was provided by the tour company we booked with for the trip - TravelChinaGuide. The tour company was very good. Attentive - we were delayed on our flight between Xian and Bejing. They stayed in contact and made sure our guide and driver were at Bejing Airport at 4AM to pick us up!! So, I reccomend TravelChinaGuide.", "title": "Highly Recommended", "user": "allspice50", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75542722}, {"rating": 4.0, "title": "awsome place in Beijing", "text": "More importantly, if you are planning a trip to Bejing I suggest a driver and guide. It is worth the $ as traffic and logistics of visting tourist sites can be hectic. If you have lots of time - you can do it all your self - but if you are time constrained I reccommend a guide. Our guide was great - Alex (Jian) Wong +86 13552672224 or wj2053@yahoo.com.cn", "user": "shubz81", "date": "August 11, 2010", "id": 74720918}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Fantastic Service – fantastic Storm – the legend continues.", "title": "Storm makes this hotel go from good to GREAT", "user": "macofamily4", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67650279}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My family stayed at the Holiday Inn Central Plaza for eight nights at the end of May. It was our first time in Beijing, and I booked this hotel based on the feedback I’d received on Trip advisor, especially the feedback about Storm. We are seasoned travellers and have been to many countries around the world, and have stayed in many hotels.", "title": "Good hotel in a quiet area\"", "user": "burgew", "date": "June 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 67555803}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Well what can I say – my expectations were surpassed. The hotel itself is fairly standard for four stars. It is very clean, check in was fast and efficient, rooms big, services, toiletries, buffets etc… all at the standard required. Location was not an issue and quite refreshing to get out of the tourist areas. They are only a quick train ride (40cents Aus) or Taxi ($5) away and with 4 of us great value.", "title": "Good value for money in central Beijing", "user": "charoos", "date": "June 12, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 67249105}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I enjoyed being around locals, the restaurants were fun, the food fabulous and at great prices ($20 for family of 4 for a banquet dinner). People watching was also interesting. There is also a Chinese pork roll that they sell down the road (10 meters away) for less than $1 that was scrumptious.", "title": "Nice Hotel", "user": "Geoff_st", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 66607391}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "What makes this hotel go from good to great is Storm. I have never experienced such warmth, generosity and service in all my travelling years. He really puts back your faith in humankind. My experience with Storm started when I was trying to book internal Chinese flights from Xi an to Guilin on CTrip. Note the destinations are not even Beijing. Ctrip would not accept my credit card – so I emailed Storm based on the Trip Advisor feedback and asked for his help. Storm booked the flights for us and at a much cheaper rate than what I saw using his personal credit card. He had not even met us nor had we checked in and yet provided this fantastic service. Storm also booked our train tickets to Xian.", "title": "Very good - Staff spoke good English and were helpful", "user": "LIGHTHOUSEKEEPER2010", "date": "May 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 64425016}, {"rating": 5.0, "title": "Excellent stay", "text": "As everyone was speaking about Storm, we chose this hotel.", "user": "F J", "date": "July 11, 2010", "id": 70545403}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "It was an outstanding stay at this hotel and Storm gave us a lot of information where to go and what to do. The second day he offered us a private tour to the Great Wall. The price was fair and the tour was really impressive. No tourists at the places he took us.", "title": "Day trip to Beijing", "user": "jfischer1231", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69920416}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "The hotel itself is very clean and not too far from a subway station. As a taxi ride is relatively cheap, this might be the best option to move around. I hope this helps.", "title": "Good Value, but here's what others don't mention", "user": "Kjlevitt", "date": "June 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 67975508}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Best, Frederic", "title": "Thank you Storm!", "user": "Talisker1227", "date": "June 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67949763}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "My 16 year old son and I had only one day to see as much as we could of Beijing. All the reviews about Storm are accurate - he is amazing. He arranged a full-day private tour including Tienanmen Square, Imperial Palace, Olympic Stadium, tour of secluded part of Great Wall with private tour guide, lunch for two at a farmer's house near Great Wall, and then right to the airport for the next leg of our journey. All this for about $150 USD for both of us!", "title": "The only hotel I would consider staying in when I return to Beijing. Good value, excellent staff.", "helpfulness": 2, "user": "exploringtheworld_10", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 67754741}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed here for four days in early July and were very pleased with the rooms and the generally high standard of service which the hotel provided. Air con was working, the showers were good quality and the beds confortable. The mini bar was not overpriced though I felt the restaurant was. Breakfast was very good and probably worth the 100CNY (12€) as there was plenty of choice and tasted delicious; a good start to the day. The only criticism about the hotel is its location and the lack of free internet access. I suspect the internet charges are more to do with the Chinese authorities, and the hotel business centre is very helpful if you have a problem. There is an ATM on site and plenty of taxies waiting to take you anywhere (as long as it isn't raining!). When arriving at the airport you MUST have the hotel written in Chinese (you can print this off with a google map and a picture of the hotel beside it) this will allow taxi drivers to know where to take you. The hotel will give you plenty of the much needed address cards when you arrive. The location of the hotel is the only serious drawback; you need to travel by taxi everywhere. This is inexpensive but, in busy Beijing traffic, can take up to 30mins to get to Tiananmen Square. However, don't let this put you off choosing this hotel. All things considered, I'd return here. Excellent value.", "title": "A very good choice", "helpfulness": 2, "user": "BillParis", "date": "August 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 73213161}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Stayed here five nights in July. The Manager is the only person who understands any real English, and many cab drivers cannot, or will not, drive you back to this hotel. The bed was hard, and the restaurant was poor and severely overpriced. We went on a tour with some people staying at the Holiday Inn Express Temple of Heaven, which is in a better location and they paid half the price and still received the buffet breakfast (included) -- that is where I will stay next time.", "title": "Not sure why this hotel is so highly rated", "user": "airlinetraveler", "date": "July 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 72886899}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Our trip to Beijing was great, thanks to Storm. Once we arrived at the hotel around midnight, Storm was there to greet us. He knew our names and immediately asked us how long we were staying and what we wanted to do. He set up trips for us to the Great Wall, then to the Forbidden City and to the Emperor's tomb. The cool thing was that we went to the great walls by train, like the locals do. We stopped by some small villages and went down walking from tower 7 to tower 1 of the great wall.", "title": "Excellent service by Storm", "user": "billgates44", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71971289}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Me and my wife are vegetarians and we told that to Storm. He took us to a very simple Chinese restaurant in a local neighborhood where we had the best mushroom soup ever. The food was excellent and the staff was very friendly.", "title": "One in a Million", "user": "Noel44", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71442380}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "One of the days we went shopping and I sprained my ankle and I could barely walk. We tried getting a cab in a large avenue, but by law the taxis cannot stop in large avenues (we did not know this), so we were waiting there and my ankle was swelling. So we called Storm and in 25 minutes he appeared to pick us up and took us back to the hotel. Then after a while Storm brought me some typical Chinese medicine to apply on my ankle. The next day my ankle was ok.", "title": "Very comfortable hotel and family friendly", "helpfulness": 2, "user": "millieWa", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71004566}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We just came back from Bejing holiday. We have stayed nearly one week at the hotel. Service was pretty good and most of staffs were really good and helpful. But some of staffs English were poor, but I believe this is same for all the hotel in Beijing.", "title": "Good hotel, but terrible location", "helpfulness": 1, "user": "churachura", "date": "September 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 1.0}, "id": 80848157}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I like the room. faily big and nicely decorated. We were first taken to the room which was dark and small windows and I felt bit sick imagining by staying there for one week, so I asked the front desk staff, if they can change the room and they did give us a room with a big windows. Our room did not have enough sun, so you shoud request the room which is the main road side and you can get more sunlight. I was really happy about the man who took us to the room. He was extremly helpful and kind. ( sorry do not remember his name....But I remember Michael and Frank from Reception were very sweet and polite.)", "title": "A brilliant hotel!", "user": "Ian B", "date": "September 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80680209}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The breakfast was just average. I have stayed the hotels which had much better breakfast. But I should not complain so much, as this is not 5 stars hotel.", "title": "Good Hotel - Helpful Service - Not the best location", "user": "papasmurf888", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 80456405}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The laundry is very expensive. I ended up washing everyday, so bring enough clothes.( I found that there are not good clothes shops in beijing.)There is dry cleaner near the hotel, but they are not so cheap. If you can wait for 3 days, then it is worth taking there. But if you want to be done next day, they are just bit cheaper than hotel.( the lanudry is located 5 mins walk distance)", "title": "Excelent place and better price", "user": "Jesus R", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78820576}, {"rating": 5.0, "title": "\"Storm will simply blow you away\" OR \"Um, WOW!\"", "text": "As I did not like the staff at massage in the hotel, I went to the massage place just outside hotel. They were good and fairly clean. I think it was about 80 yuan for one hour foot massage.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 3, 2010", "id": 78175165}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our cheapest hotel in China, a very good value for money. You get a very nice room, with a huge comfy bed (no bathtop in the bathroom) and the staff is very nice and helpfull. We booked in advance with breakfast included for cheaper.", "title": "very good value for money", "user": "Garpflus", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 74701724}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "On the first day we arrived early morning and went to sleep. We woke up at about 12 and decided to order hamburger in room, it was so good. One of the best ever...", "title": "Understand why it is highly recommended", "helpfulness": 1, "user": "goforholiday", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 74043521}, {"rating": 4.0, "title": "Good hotel & great staff", "text": "The only minor problem is that the hotel is far from metro. Twice we walked, but it takes about 30mn. The best is to take a taxi to the nearest station for 11 yuans. To come back is sometime a little bit harder because even though you have the card of the hotel written in chinese, some old taxi drivers have problems to read it because it's a bit small, and some others just don't understand how to get there (even with the map drawn on the card). So once I had to explain (my wife was translating in chinese) to the driver how to get there by saying \"right\" or \"left\" at every corner, it was my 3rd day in Beijing...Anyway it's in theory very easy to get back to the hotel and should not cost more than 20 yuan from Tiananmen square.", "user": "asalbogabhar", "date": "August 3, 2010", "id": 73526380}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I know this hotel from day 1 of it. befor i stayed inmany 5 stars hotels in beijing but from the first time that i stayed in this hotel i never changed it. there are few good things about the hotel: first and most important is the freindly and most helpfull personal service that i and even my family in a family holiday that i/ we got from the staff and especialy from Mr. Storm who is alwayes there for you, ready to do almost anything for your pleasent stay. second the design of the hotel is gentle, simple and very calm which is important after days of hard work. as well as that the food is great, the Zen resturant is very unique.", "title": "the best and most freindly hotel in beijing", "user": "ronisapir", "date": "May 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64118903}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "I can said that there is not much to do at night around the hotel, but usally I get some rest or complete my work, so it can be an advantage. the executive launch is pleasent, calm and helpfull as well.", "title": "Good hotel, not so good location", "user": "JIMMY_PAGELondon", "date": "May 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 63483722}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I would like to thank Mr. Storm again for his great service and I hope that he will continue serving me in the future as he does.", "title": "dissapointing", "user": "KSJHongKong", "date": "May 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 63075107}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "thanks", "title": "Nice but far out", "user": "2dutchboyz", "date": "May 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 63006799}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Don't arrange airport pick up, unbelievable expensive 525 RMB. I wasn't told of this price when booking the car. A taxi only costs around 100 RMB.", "title": "Addition of one more good review !", "helpfulness": 1, "user": "vasco-da-gama7", "date": "May 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62986840}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 14, "average": 53, "very good": 241, "terrible": 4, "excellent": 369}, "aka": "Holiday Inn Central Plaza Hotel", "slim_ranking": 0.0137042339947, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 3.5}, "description": "Holiday Inn Central Plaza Beijing, an Award-Winning hotel, is conveniently located in Guanganmen commercial and civic area, adjacent to the new Municipal Government Office Building and is within a stone's throw from Beijing's Financial Street. The hotel is close to tourist and shopping attractions such as Wangfujing, Oriental Plaza and the Forbidden City. It is 10 minutes drive from the West and South Train Station and 45 minutes from the Capital Airport.The hotel has 322 contemporary guest rooms, including suites and two floors of Executive Club rooms, all equipped with wired and wireless broadband internet, speaker telephone and multi-language voice mail. With a 640 square meter, pillar-free ballroom and 8 other function rooms ranging from 35 to 176 square meters, the hotel is an ideal venue for business meetings and social functions alike. All the meeting rooms are equipped with state-of-the-art audio-visual facilities, built-in work station, wireless broadband connection and video conference facilities. The hotel's professional meeting team will ensure every event a success.The hotel also provides other facilities like business center ticketing and tour desk, kiosk, car rental, concierge taxi and limousine service, baby sitting service, karaoke as well as a Mini Golf Club."}