{"user_rating": 4.0, "review_count": 163, "name": "Holiday Inn Express Hotel & Suites Marysville", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "After having a really bad experience at one of the other hotels in the area I was thrilled to hear there was a new hotel near the outlet mall! My friends and I like to go to Marysville to go outlet shopping at least twice during the year.", "title": "Funky new", "helpfulness": 3, "user": "YVRshopper", "date": "November 30, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 11172447, "likes": {"liked": "— how new it is"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel is easy to find. It is right off of the highway but I didn't hear any noise at night.", "title": "Great hotel & location!", "helpfulness": 1, "user": "hmoney", "date": "November 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10974199}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "We were greeted very warmly by the front desk staff. I had registered online and joined their points program.", "title": "Nice new hotel", "helpfulness": 3, "user": "cegiraffe", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 10088126, "likes": {"liked": "— Everything one needs available in room", "disliked": "— No dining facilities"}}, {"rating": 2.0, "title": "Don't stay here if you are a light sleeper", "text": "Everything was ready for us and the front desk ladies suggested we park in the secure underground (at no charge, it's usually $5, but because I joined their program it was FREE).", "helpfulness": 3, "user": "coolhand18", "date": "October 9, 2007", "id": 10060581}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "The hotel still smells new. The modern lobby was attractive with a fireplace and seating area. The room was clean, had a flat screen tv and the linens were modern in brown and tan. The towels still fluffy!", "title": "Brand new modern hotel, best in Marysville.", "helpfulness": 4, "user": "advcardio", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10049338, "likes": {"liked": "— Brand new and modern everything, very clean with great beds!", "disliked": "— The pool and starchy cont-breakfeast, but understand they are changing it soon."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We were on our way to Vancouver from Seattle and stayed at this wonderful hotel on the way. A little distance from Seattle, this hotel is ideally on the way. Located in a quiet town yet not far from a casino and shopping areas. The check in process was very friendly and pleasant.", "title": "good hotel for the Canada traveler", "helpfulness": 1, "user": "brij27", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18187229, "likes": {"liked": "— clean, nice", "disliked": "— a little drive away."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The room was spacious, looked new, and had a flat screen t.v. The bed was comfortable too. The bathroom was clean and nice. The breakfast was good with hot cinnamon rolls, eggs, many other items.", "title": "Great Place to Stay!!!", "user": "horizon79", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17373806, "likes": {"liked": "— Wonderful staff!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "Overall a great stay.", "title": "Great hotel close to Outlets!", "user": "MontanaGo", "date": "May 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15675954, "likes": {"liked": "— New rooms and location", "disliked": "— Front desk staff had a little trouble with each other using their computers, came across to customers"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "What a wonderful place to stay. The staff was super friendly. We can't wait for the new restaurant next door to open. We really liked the underground parking that was FREE due to being in the Priority Club. We also like the convenience store right next to the front desk.", "title": "Wonderful stay!", "user": "MzPiggy66", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14819814, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I just returned with my mom from a one-night stay at the Holiday Inn Express in Marysville. The hotel is brand new and very clean. We had a nice, large (standard) room with refrigerator and microwave. We booked the shopping package directly with the hotel which was a great deal. With the package we got a $50 gift card that brought the room price down $10 plus a few extra food goodies. (We are priority club members, so some of the food may have been for that). I love the Holiday Inn's new look with white bedding, two kinds of pillow & four pillows per bed, and a Flat screen tv. The breakfast was very good with real, fluffy scrambled eggs! The hotel is right off of I-5 and very easy to access the Seattle Premium Outlets without having to get back on the Interstate. There is an Applebee's close by. I would definately stay here again when shopping at the outlets.", "title": "New hotel", "user": "XJSA", "date": "February 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13587877, "likes": {"liked": "— New Hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "This hotel delivers everything that it promises and more. The staff are extremely friendly and helpful, the rooms are clean and spacious, the free breakfast is generous and of good quality....all this plus secure underground parking, a pool and a basic, but well kept, little gym. I am not suggesting that this is a five star experience, but for a hotel off of the freeway in a small town, this is a nice offering. I used to stay at the nearby Hawthorne Suites but think that, for the price (about $50 a night cheaper), the Holiday Inn Express is a better deal. The location is also terrific, being next to the Tulalip Casino and the Seattle Premier Outlet Mall.", "title": "Great Little Hotel", "user": "Rabidpuppy", "date": "September 29, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 20460584}, {"rating": 5.0, "title": "Very nice hotel", "text": "I really enjoyed staying at this hotel. It was recently renovated and looked great. The staff was very friendly and helpful. The room was also very comfortable and clean. It had an updated bathroom which had a beautifully tiled shower instead of a drab old tub like most hotels. This also meant that the bathroom was more spacious. So that was a nice touch. Breakfast was also superb and so was the service. Location was excellent right off the highway. Absolutely no complaints. Overall, I would give this hotel very high marks.", "user": "aeverest7", "date": "September 27, 2008", "id": 20430170}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Hotel was very clean and well kept,staff was excellent, friendly,and attentive. Breakfast was ample. Grocery ,bank and starbucks across the street. Avoid the Applebys restaurant the service sucked and food was mediocore.", "title": "Happy with the HI", "user": "tripstress", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 19578483, "likes": {"liked": "— Clean and comfortable great staff", "disliked": "— No smoking area other than ashtray by entrance to Hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "This Holiday Inn Express is typical of the Holiday Inn brand...excellent. What you see is what you get and that suits us just fine. We travelled all the way from Newfoundland for this journey to do some shopping and catch a Seattle Mariners game. Service was fine. Accomodations were fine. The area is breathtakingly beautiful. The complimentary breakfast is a nice touch. The only issue with the breakfast is the cereal is not Kelloggs but some generic brand, so the cereal is tasteless. But it is included in the price of the rooms(s). It would be nice to serve to Kelloggs Corn Flakes, Raisin Bran etc to the guests instead of tasteless bargain brand cereal. The hotel left me a nice message via e-mail a few days after the stay. That's mighty decent of them. I highly recommend this very nice hotel.", "title": "Typical Holiday Inn...excellent.", "user": "JackcookOntario", "date": "August 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19526281, "likes": {"liked": "— Clean rooms", "disliked": "— Cheap generic cereal"}}, {"rating": 4.0, "title": "Comfortable and Clean", "text": "Our family (2 adults and 2 teenagers) booked a stay at this location. Not being familiar with the Seattle area this decision was made after reading some earlier reviews on Trip Advisor. The location lived up to the expectation that was created. The front desk staff were extremely friendly at all times. The room was clean and comfortable and everything worked. The continental breakfast was good and the hot items were hot. We did not have an opportunity to use the swimming pool. There is a supermarket within walking distance (Haggen's) and an Applebee's restaurant is just around the corner. The hotel is also close to the Seatte Premium Outlet mall, a Walmart Supercentre, and the Tulalip Casino, so if the main purpose of your trip is to visit the outlet mall, this is a great location and it will not disappoint. Downtown Seattle is about an half hour's drive down Interstate 5.", "user": "Bryan023", "date": "August 15, 2008", "id": 18999850}], "location": {"country": "United States", "city": "Marysville"}, "stars": 2.5, "variance": {"poor": 6, "average": 20, "very good": 66, "terrible": 4, "excellent": 67}, "aka": "Holiday Inn Express Hotel And Suites Marysville", "slim_ranking": 0.4, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "Hotel in Marysville, Washington Offers Comfortable Stay on Puget Sound Just minutes from Puget Sound, the Holiday Inn Express in Marysville, WA is close to many of Snohomish County's largest businesses and attractions, and is just a half-hour north of Seattle. Our hotel in Marysville, WA is just minutes from the Everett Events Center and is close to many corporate locations. Agilent Technologies is just five minutes from our hotel, while Kimberley Clark and New Glasair LLC are just ten miles away. The Port of Everett is also nearby, located just ten minutes from our Marysville hotel. For leisure travelers, Tulalip Casino is just a minute away. With dining and live entertainment, this is a great place to spend an evening. For the best shopping, the Seattle Premium Outlet Mall is also just a minute away. It has 110 name brand outlets to choose from. The Future of Flight Aviation Center and Boeing Tour, located 15 miles from our hotel north of Seattle, features the only public tour of a commercial jet assembly plant in America. Also just ten miles from our Marysville hotel is Everett Marina. With shopping, dining and whale watching tours, this is a great place to see Puget Sound. Our Marysville hotel offers you choice amenities such as an indoor pool and whirlpool spa, Business and Fitness Centers and free high-speed Internet access. Come experience all our new Snohomish County hotel has to offer."}