{"user_rating": 3.5, "review_count": 141, "name": "Holiday Inn Express Deadwood", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "PLEASE READ!!! This was the worst experience ever. My friends and I (16 total) had reservations for 6 months and a confirmation #. When we arrived there from NC, they had given our rooms away even though they had held our credit card #. They were INCREDIBLY RUDE to us and didn't give a darn that we had no where to stay. They made the comment that we'd \"take what we give you!\" My friend that made all they arrangements had called 3 times during that 6 mth period to double check our arrangements and room type. That confirmation meant nothing to them. The receptionist slung paperwork at us and then called us jerks, etc. Needless to say after that the cops were called because of 16 angry people that have just been insulted. NEVER, NEVER STAY HERE!!!!!!!!!!!!!!!!!!!!!!!!", "title": "Worst Experience Ever!!!!!!!!!!!!!!!!!!!!!!!!!", "helpfulness": 1, "user": "hrwilliams123", "date": "August 26, 2007", "detail_rating": {"front_desk": 1.0, "value": 2.0, "service": 1.0, "business": 3.0, "location": 5.0}, "id": 8508378, "likes": {"liked": "— Absolutely Nothing, read my blog", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Stayed for 2 nights on our recent trip out west. This hotel has a great location in the town of Deadwood. Room was comfortable and clean overlooking lobby. Continental breakfast was good. Indoor pool was nice but small. Hotel has its own casino as do most other hotels in town.", "title": "great location", "helpfulness": 2, "user": "bdib", "date": "July 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8210067, "likes": {"liked": "— Location, cleanliness and comfort", "disliked": "— size of pool"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Great location! Middle of Main Street, walkting distance to all of the Casinos on Main Sreet. We stayed four days and three nights with five adults in what they called a \"suite\" which was a regular room with two queens and a roll out. Made for interesting situations but we survived, made the best of it and had fun.", "title": "A little overpriced", "helpfulness": 1, "user": "foxtStCloudMn", "date": "July 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 8077285, "likes": {"liked": "— Location", "disliked": "— Listing as a"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Been to Deadwood many times and this was one of our better times, just expected more hotel room for the money and the \"suite\" designation. Had a large (many choices) continental breakfast if you didn't want to venture out to the two I thought to mention here. Tin Lizzies, all you can eat $4.00 (normal breakfast Items) or the Four Aces (Hampton) a $7.00 breakfast buffet.", "title": "Over priced, poor service", "helpfulness": 1, "user": "TravelgalMissouri", "date": "June 29, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8025546, "likes": {"liked": "— very nice room", "disliked": "— Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Most rooms on Main Street are quaint but not fixed up very well. If they are, the price goes up considerably. Our room was quite, clean, and had a great location. We just expected a two room \"suite. \" We made do and had a great time. Other than the Hampton (Four Aces) I don't think any hotel in deadwood is more than a Two Star.", "title": "A Pleasant Stay", "user": "packman8484", "date": "June 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7961597, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I have stayed at this hotel many times and would say it is probably the best place to stay in Deadwood because the location is great, the rooms are nice and comfortable, and the property does seem very quite. BUT, the company that runs this property has gotten spoiled with high demand over the years - and lost sight of customer service.", "title": "Great Hotel - Poor Staff", "helpfulness": 3, "user": "jackrabbit91", "date": "June 5, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7781172, "likes": {"liked": "— Location", "disliked": "— Poorly trained staff"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I just returned from a stay at this hotel and could not believe the absolute inability of the staff to accomodate simple requests. Just know this: If you make a reservation, confirm it several times - and again when you check in. If you would like to switch rooms (even when others are clearly available) you will not be able to. When you talk to the staff, you will get the feeling they are not interested in helping you. The standard response is: \"We can't....\"", "title": "Great location", "helpfulness": 1, "user": "NNMinAL", "date": "May 29, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 7711925, "likes": {"liked": "— Location", "disliked": "— Buffet"}}], "location": {"country": "United States", "city": "Deadwood"}, "stars": 2.5, "variance": {"poor": 18, "average": 21, "very good": 43, "terrible": 11, "excellent": 48}, "aka": "Holiday Inn Express Deadwood Hotel Deadwood", "slim_ranking": 0.818181818182, "description": "The Holiday Inn Express Hotel & Suites Deadwood-Gold Dust Casino brings you the hottest action, the best location, and the coolest digs in Historic Deadwood. Our luxury hotel is literally the centerpiece of Deadwood's Historic Main Street, just steps from the famous Gold Dust Casino Gaming Complex, where you'll find their delicious buffet serving breakfast, lunch, and dinner, plenty of exciting action at the poker and blackjack tables, and the hottest slots in town. If you're planning a business conference or meeting, we're ready to accommodate you with first class conference facilities and banquet rooms. Hotel features include complimentary continental breakfast and free local phone calls. Enjoy a unique breakfast experience at our new Express Start Breakfast Bar served every morning featuring a selection of fruits, juices, cereals, breads/pastries, and even hardboiled eggs. We have also created the world's best tasting cinnamon roll. Visit Deadwood, SD and stay smart at the Holiday Inn Express Hotel."}