{"user_rating": 3.0, "review_count": 221, "name": "Holiday Inn Montreal Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "As I live 2 hours away from the airport I often stay at an airport hotel if I have a morning flight, especially in winter due to bad driving conditions. As a result I had the chance to try a few. Usually one has limited expectations for such hotels: clean rooms, quiet, free shuttle to the airport and wi-fi (free preferably). This hotel has all of these.", "title": "Convenient and good for families.", "helpfulness": 1, "user": "Jean-Pierre D", "date": "January 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123234760}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "But it also has more. I found the restaurant slightly above average for this type of hotel. It also has recreational facilities (swimming pool and various games) which makes it a unique family destination. Keeping the kids busy inside in an otherwise boring airport hotel is a big plus for families.", "title": "Never again", "user": "chaton2411", "date": "December 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 122329172}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We were booked at this hotel by Air Canada due to a schedule change. Next time, I will just pay to go to Marriott at the Airport!", "title": "Excellent hotel to stay when on a business trip!", "helpfulness": 2, "user": "cbern648", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121221760}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Air Canada booked around 20-25 passengers to this hotel, plus passengers already booked here. The shuttle admits around 20, no more, so it was a battle to get on board, and it was -20 that night. It wasn't a surprise for them to have that many guests coming, the shuttle should have been arranged in consequence.", "title": "poor room and very noisy", "helpfulness": 1, "user": "gioraba", "date": "November 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 121192305}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The room was small, there were hairs in the tub, and on the walls....Grimme in the corners of the bathroom, just disgusting. Beds were comfortable, for the little sleep we were able to get.", "title": "Nice Hotel", "user": "wkelly67", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121122478}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "My familly and i went to the Holiday Inn aeroport for a little week-end getaway and we had a really good time. The kids enjoyed the warm pool and the ping-pong table. Service wand food were both good! Thank you", "title": "A fun time", "user": "Martin A", "date": "October 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119392448}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I wanted to stay at holiday inn express but as they where over booked I was sent to Holiday inn airport, and I I arrived in a very bad moon, was welcomed by the manager and asked the reason of my behavour, after explaining the front desk staff about it i was offer a drink by the manager, I alway get good service , but this hotel seemed to be above and beyond that i have come to expect from an organization: I have now become a new client too badt for holiday inn express.and even so tha t holiday inn airport is still in renovation, I will come back , good job guys", "title": "i was overbooked at holidayninn express andI was bad moon but", "user": "john m", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119276594}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "stayed with my office co worker and pleasantly surpirsed despite some bad reviews:", "title": "very nice stay good value", "helpfulness": 2, "user": "timothyprince", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119119468}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "chek inn was welcomed very nicely and firendly staff. few minutwes after check inn I get a call from staff to see if we were happy about room: pool area was tremendous, but was not ready to get wet : restaurant was still under renovation: but de hell with it , had a great stay , the bar was open.", "title": "Excellent", "helpfulness": 1, "user": "Anil29", "date": "October 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119061317}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "timothy prince", "title": "confortable stay", "helpfulness": 1, "user": "john t", "date": "October 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118861160}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The hotel is located near the Montreal airport. It has a huge indoor atrium area with a pool and games room. It also has a nice bar area with a few televisions and a restaurant (didn't eat there). Our room was quite nice with a king size bed, small fridge, large bathroom, free WiFi. The room was very clean and the bed quite comfortable. We also received very good service when checking in.", "title": "Good Hotel", "user": "sensfan12", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 124536250}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The location of the hotel leaves alot to be desired - there is only a bus stop in front of it, no subway station, no nearby restaurants or stores. You basically have to drive to get anywhere from the hotel. In addition, they offer a shuttle to the airport and let customers park their cars there during their trips. They don't seem to manage the number of cars in their lot so it was absolutely jam packed - we had to park completely on the other side of the hotel on Saturday night. Having so many cars parked long term also prevents them from clearing the snow from the lot. We were there in early Feb - it was an absolute mess - about 6 inches of bumpy ice everywhere! Very dangerous! The other thing to look out for is that our room was facing the atrium / pool area so it was very noisy during the day. It didn't bother us because we only got back to the room at 10:30pm at which time the pool was closed. But if you need to rest during the day, it could be an issue.", "title": "Very nice stay", "user": "DownEastNewbie", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124536231}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Overall, this hotel is ideal for families (because of the atrium area), sports teams, or for people flying out of the Montreal airport. If you're looking for a romantic getaway or doing the tourist thing, then you should probably stay somewhere else.", "title": "Old style resort type hotel", "user": "Brejdak", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124327750}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "The staff was friendly and helpful.The room was quiet,with comfy bed,and pleasing to the eye.I enjoyed the pool daily.Parking was a little tight,but there always seemed to be someone leaving as we were entering.Our room was spotlessly clean.The restaurant was hit or miss on our two nights dinning in.The fried calamari is excellent,but not impressed with the dumplings,Enjoyed steak dinner but let down on the scallop and shrimp.Club sand.& fries good too.The breakfast was half and half:Cold breakfast with fresh fruits and pastries was really good, not so good was hot breakfast;greasy sausage(should put on a rack to stay out of grease) blah eggs,beans tasted straight from the can.But you can have a really good breakfast if you watch your selections.Waitstaff is friendly and helpful.It's great to sit at the atrium tables by the pool in a bright tropical setting;Especially in the coldest period of Winter.All in all we had a wonderful stay and it will be our #1 pick in Montreal.Almost a perfect stay.And there is no such thing as perfect.We will be back.Thank you for a pleasant stay.", "title": "Good hotel", "helpfulness": 2, "user": "Gucci85", "date": "January 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123657375}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Good for family. Swimming pool area in the middle of the hotel makes attractive for children. Kind of a resort concept with palm trees and game tables around pool. The restaurant is OK, what is important in the area close to the airport that badly lacks of good restaurants since Le Bifthèque went under.", "title": "Nice Restaurant", "helpfulness": 1, "user": "betty l", "date": "January 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123528729}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I had a few problems when I first arrived but the staff went out of their way to sort things out for me, showing great customer service. Many thanks to Magda, Heurig and Terri. There are some bad reviews for this hotel but I was here for a month and I had a great stay. I was upgraded to a suite which was newly refurbished, clean, comfortable with a great shower. The room was cleaned daily and I was called each week by various members of staff to ensure everything was OK.", "title": "Great Stay", "helpfulness": 2, "user": "Steve C", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121048205}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "There were some minor renovations still going on but didn`t inconvenience me in any way. During my stay the newly refurbished gym/sauna area was opened, which was very well equiped, and the newly refurbished restaurant was opened which was very nice, with good food.", "title": "absolute great welcome", "helpfulness": 2, "user": "john d", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120796799}, {"rating": 2.0, "stay_parameters": "Stayed April 2011", "text": "It`s not a new Hotel like some along that road, but they have carried out a lot of modernisation and refurbishment. The holidome, with the indoor pool and many plants gives it a nice atmosphere and made for a pleasant stay. Easy check in/out, no problems with the shuttle service, good customer service, would stay here again in the future.", "title": "First Holiday Inn in Canada, yep getting oldDespite several renovations.", "helpfulness": 1, "user": "Cdorais", "date": "November 18, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 120727168}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "on arrival people at front desk were absolute great, big smile, welcome to holiday inn,", "title": "Resort Like!", "helpfulness": 1, "user": "ReneeMC79", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119502570}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "they even called me back after check inn to find out in If was doing well, plus they gave me free internet access and they offert me the free transportation to airport;;;; room was nice and very clean, during my two nights stay i was always called by my name, good job, despite some renovation hotel is a very good three stars", "title": "Don't believe the bad reviews.", "helpfulness": 3, "user": "DB1988", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119459884}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 3, "variance": {"poor": 42, "average": 42, "very good": 55, "terrible": 50, "excellent": 32}, "aka": "Holiday Inn Montreal Airport Hotel Montreal", "slim_ranking": 0.523529411765, "description": "Pour de l'information en Francais, visitez: Holiday Inn Montreal Aeroport Hotel. The Best of Montreal Airport Hotels, the Holiday Inn Montreal Airport hotel is a full-service tropical oasis conveniently located minutes away from Montreal-Pierre Elliott Trudeau International Airport (YUL) via our free 24-hour airport shuttle service. Our location enhances any Quebec vacation or Montreal travel itinerary.For the business traveler, our Montreal hotel is perfectly situated close to major businesses, such as Bombardier, CAE, Rolls-Royce, Air Canada and Nortel. We're also 15 minutes from the downtown area and 10 minutes from the West Island, meaning guests' travel time is short and painless. Known for being the place to meet, the Holiday Inn Montreal Airport features over 12,000 square feet of meeting space. While enjoying a stay at our Montreal airport hotel's tropical facilities, guests can enjoy an exciting Quebec vacation thanks to our convenient location near a wide variety of attractions. Some nearby places of interest include Saint Josephs Oratory, the Biodome, Botanical Gardens and several professional sports teams. The Holidome offers guests plenty of diversion on-site. A soothing tropical atmosphere, excellent dining, great location and free high-speed, wireless Internet access make our hotel the best choice for anyone on a Quebec vacation or business trip."}