{"user_rating": 3.5, "review_count": 75, "name": "Holiday Inn Manahawkin / Long Beach Island", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "This is the nicest of the Holiday Inns that I've ever stayed at. Beds were very comfy, hotel was clean, rooms were nice and so was the shower. I believe the hotel is less than 2 years old, which makes a difference.", "title": "New hotel, clean, contemporary", "user": "Karch72", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6815856}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "The only negative was the exercise room. I tend to enjoy a workout when I travel and the exercise room just consisted of a few cardio machines ... no free weights or resistance equipment. That was a bit disappointing.", "title": "Really Nice!", "user": "spidersart", "date": "January 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6584674}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Attached to the hotel is a Perkins restaurant. The food was OK, but the service was a bit slow at times, especially during the morning at breakfast. I'd recommend going to a local diner instead for real homestyle cooking.", "title": "new hotel, little problems", "user": "newjerseyfamily", "date": "December 28, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 2.0, "location": 3.0, "value": 3.0, "rooms": 4.0}, "id": 6510742, "likes": {"liked": "— The location and the attached Perkins restraunt", "disliked": "— Check in could have been smoother - took a long time, needed adjustment"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Overall, a great experience. There aren't too many other hotel options in the area ... so I think this hotel is great for the price and location.", "title": "Brand New Hotel", "helpfulness": 19, "user": "lost_forever", "date": "March 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 4691399}], "location": {"country": "United States", "city": "Manahawkin"}, "stars": 3, "variance": {"poor": 7, "average": 21, "very good": 32, "terrible": 3, "excellent": 12}, "aka": "Holiday Inn Manahawkin / Long Beach Island Hotel Manahawkin", "slim_ranking": 1.0, "description": "Enjoy all the attractions of Long Beach Island with the amenities of a full service hotel!The Holiday Inn Manahawkin/Long Beach Island is located at the heart of the Jersey Shore.Our new hotel features 110 comfortable guestrooms six spacious suites, a delicious signature restaurant and a cozy lounge In addition to our indoor pool, Jacuzzi, and fitness center, we also offer wireless internet throughout the property. Our hotel is located minutes from Barnegat Light House State Park, Surflight Theatre, Tuckerton Seaport, and Jersey Shore beaches . We are also a short ride to fabulous Atlantic City The hotel also serves as the premiere conference center for Long Beach Island with up to10,000 sq ft of banquet and meeting space Our elegant Grand Ballroom caters any affair with style, from a focused business meetingof 50 to an opulent wedding for 500. Shuttle Service is available to accommodate groups for weddings, reunions, and corporate events. Whether you are traveling to Long Beach Island for business, a family vacation or a romantic weekend escape, our hotel and friendly staff cannot wait to welcome you home to the Jersey Shore."}