{"user_rating": 4.5, "review_count": 77, "name": "Holiday Inn Express Melbourne", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I enjoyed my stay at the Holiday Inn Express, Melbourne. Check in went flawlessly although I did not get a PC Platinum upgrade which I get from most Holiday Inns. But it was only a one night stay so I did not even bring it up. Other than that, the young lady at the front desk was very pleasant and accommodating. I got a King Leisure with refrigerator, microwave and a bottle of water, so I was good to go.I ran into the manager later that night when I went down to brew a cup of tea, and he seemed genuinely interested if you were being taken care of. However, the location leaves something to be desired if you are looking for a beach or Patrick AFB. It is quite a distance to either. I would wholeheartedly recommend this hotel to anyone traveling on I-95. You will be more than satisfied.", "title": "Great value on I-95", "user": "svargasi", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 118486114}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I was satisfied staying here while on travel. Very friendly staff and it was nice being greeted as a platinum member with the welcome gift provided.", "title": "A nice place to stay", "helpfulness": 1, "user": "mrlittlejohn", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116158090}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The bed was comfortable and internet service was very usable.", "title": "Very Professional and Accommodating\"", "helpfulness": 1, "user": "Palmview", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115172781}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "A couple of days before the last space shuttle was to lift off, we decided to go to the Kennedy Space Center then watch lift off the next day. Rooms were scarce, however, we were able to get accommodations at the Holiday Inn Express. We were more than pleased with our room especially since it contained a small refrig, and we were told we could have a hot breakfast in the morning. As a priority member (which is free), we even received a little snack bag which we greatly appreciated since we had been on the road for a while. We also were surprised that we could get a late check out on the day the shuttle was to lift off since it was a Friday and I assumed there would be weekend guests coming in for beach activities. Lastly, everyone we met at the hotel was extremely helpful as well as cheerful. We'll stay here again if we're ever in the area.", "title": "Found My Happy Place", "helpfulness": 1, "user": "m0mma0f3", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84914016}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Breakfast has alot to choose from and staff are really happy. They always talk to me when I come and are quick and happy to make me comfortable. No matter what I ask they help and eagerly accommodate my every request. They treat me like family. If my company stops sending me here i would have to bring my family on vacation.", "title": "Fire Ants in Room", "helpfulness": 2, "user": "ansco", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 73962418}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "BREAKFAST WAS GREAT!!!!! Sooooooo many choices.", "title": "NICE little Hotel, Very COZY", "helpfulness": 1, "user": "m0mma0f3", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59526083}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Room need updating but Super CLEAN.", "title": "Good value for business traveler", "user": "ScMetalman", "date": "January 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53055408}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "BEST Pit stop off of the I-95.", "title": "Wonderful Choice", "helpfulness": 1, "user": "bataylor", "date": "October 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 47639087}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Clean Room, good breakfast, convenient location, great value.", "title": "Mediocre hotel at best.", "helpfulness": 2, "user": "HaagenDazs78", "date": "September 9, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 40439449}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "My husband and I stayed in this motel for 3 nights while in town to visit relatives. The room was clean and very roomy. The free breakfast was great and kept well stocked. All the staff was very friendly and check in and out was very easy. Our room only had a shower which was no problem for us but might be if trying to bathe a small child. The only problem was the road construction going on out front but that was not the motels fault. Would stay again if in the area.", "title": "Great hotel with a great value!", "user": "eml52926", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38701910}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We made a good choice for this hotel. Close to the Interstate, easy to find and on a major street. Check in was quick and the person at the reception desk was very friendly. Hotel room was clean and quiet. Only downfall is that there are no restaurants within walking distance. The closest one was Perkins - nice dining on New Year's Eve!", "title": "Very Nice Hotel", "user": "Holly5_12", "date": "April 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 127383490}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My husband and I flew down to help his sister move and stayed at this Holiday Inn. It was clean, extremely well managed and surprisingly well-appointed and comfortable. More like a Marriott than a Holiday Inn. I can't discuss the location because it was convenient for us. I have no idea what else it's close to. There were an awful lot of thoughtful little touches that you associate with a higher-end property. Free bottled water, wide array of toiletries, nice shower and such. The bed was extremely comfortable and there were plenty of good pillows. The breakfast was better than average for that sort of thing. And the air-conditioning worked well and hummed just enough to drown out any other noise there might have been. I don't always sleep too well when I'm away from home and I slept well here.The next time we have an occasion to visit my sister-in-law, we will call them first.", "title": "Best Holiday Inn I ever experienced", "user": "Lise A", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 127267477}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "Spent 3 nights here in March 2012. Lovely hotel, spotless rooms, very near 1-95 but too far away from downtown.", "title": "Great hotel but out of the way", "helpfulness": 1, "user": "WinifredWicklow", "date": "March 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 126416635}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "new, clean hotel, comfortable bed, quiet,(even on New Year's Eve!) very friendly & helpful manager on duty", "title": "Clean & Comfortable", "helpfulness": 1, "user": "D0sad0", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122688047}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We were driving from Key West to Orlando but stayed in Melbourne as the driving was getting a little tiring. We stayed 2 nights in this hotel and got a good deal through Hotwire. The hotel is right next to I-95 and the Kennedy Space center was less than a hour's drive and we spent a whole day there. The place was a little older but for the rate we paid, it's fine. They could have kept the washer/dryer inside the hotel buidling (you have to walk to the Days Inn facility next to it for the washer/dryer as both the hotels seem to be owned by the same owner). The girl at the front desk was very helpful during check-in and she provided other info about the area as well.", "title": "Good location near Orlando & Kennedy Spc Ctr at economy rate!", "helpfulness": 1, "user": "tourist116", "date": "January 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122474601}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We have stayed here on two separate occasions, we found it to be comfortable, affordable and clean. Most recently we had a death in the family and had to stay for a week. It is relatively close to the hospital by just a few miles, and close to many restaurants. The staff seems to be mainly young and quite helpful, one day they had a meeting in the breakfast room and we came down with about half hour left we were given plates and a discount for that day for the inconvenience. We were given a continued low rate since we booked for the week when we extended another day and when we had to book another room for our son for a few days. The manager Rianna was very helpful and very professional, so was the other young lady. The cleaning woman is very nice and nobody ever rushed us to clean the room, they always waited till we left. The rooms are ok in size and comfortable. The other HIE in Palm Bay is newer and has an indoor pool etc but it was too expensive for us this time, we will stay here again since we felt welcomed and at home.", "title": "Very comfortable", "user": "Myrts78", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144518051}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Spent the weekend in Melbourne on some family business. This Holiday Inn was close to where we needed to be, and we had a very plesant experience. Complimentary breakfast, located right at 95 and 192. Rooms were immaculate and had a small fridge, a microwave and coffeemaker. Bed was excellent. Front desk staff was friendly. Probably a small thing for some people but that Ice Machine was the best Ive ever used. Lots of Ice and not trickling into your bucket two cubes at a time. Highly recommended if you need to go to this area. Only ten minutes from the Downtown area and night life too. Maybe 15 minutes over the causeway to the beach. Not bad at all and a good value.", "title": "Very nice two night stay", "user": "Wayne G", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137723872}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Very goode hotel, nice stay, everything is clean and smell fresh. The breakfast is good and a lot of choice. fast check in-out . Courteous, helpful and caring people", "title": "Nice stay ! Excellent choice !", "user": "lyne24", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134354081}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Wonderful front desk staff. Very informed about priority club quirks. Offered all of the rewards without being prompted; this is a rarity and has never happened before! Very friendly and guest oriented. I was tired from driving all day and sight seeing. The clerk was a \"genuine\" ray of sunshine. The hotel is conviently located to everything.", "title": "Best staff", "user": "Theressa C", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131962829}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I was very pleased with this hotel. I arrived mid-morning and asked if it would be possible to check in early--I was thinking that maybe they would let me check in around noon. Since I was a Priority Club member they let me check in right then. They also gave me a goodie bag with snacks. The room was clean and larger than most Holiday Inns. The staff was very friendly throughout the stay and you can't beat the location right off of the interstate. Although it's not a vast selection, there are many restaurants on this street, as well as a movie theatre, a mall, and a Target. You can also follow New Haven right to the beach, or to the downtown Melbourne area where there are a lots of neat shops and restaurants. Free breakfast is the typical hotel fare, although I did not try the pancake maker. All rooms have a mini fridge and a microwave as well. Will definitely stay here again!", "title": "Friendly staff, great location", "user": "EconMom2", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130293863}], "location": {"country": "United States", "city": "Melbourne"}, "stars": 2.5, "variance": {"poor": 6, "average": 2, "very good": 25, "terrible": 2, "excellent": 42}, "aka": "Holiday Inn Express Melbourne Hotel", "slim_ranking": 0.190476190476, "description": "Whether you are coming to Melbourne for business or just for fun, your room at the newly revitalized Holiday Inn Express is your personal retreat. You ll have room to work, relax and make the most of your day. Amenities such as high-speed Internet, business center, plush towels and luxurious bedding mean every night is a great night and every day starts right with our free hot buffet breakfast which includes our famous cinnamon rolls. Just 15 minutes from downtown Melbourne and the central business centers, the Holiday Inn Express is only 6 miles from Melbourne International Airport. We are minutes away from major businesses, including Harris Corporation, Bombardier, Northup Grumman, Rockwell Collins, GE Corporation just to name a few. After an energized workday, you can relax in our new pool which is surrounded by lush landscaping and palm trees giving you a true feel of the Florida lifestyle. The best of Melbourne is waiting for you at the Holiday Inn Express."}