{"user_rating": 3.0, "review_count": 354, "name": "Holiday Inn San Francisco - Intl Airport", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "I stayed with a friend for five nights from Dec 2006 to Jan 2007. Our stay met most of our expectations, but we were disappointed that there was no refrigerator or microwave in our double-bed room, as we noticed in the pictures posted by a reviewer from Washington, perhaps only king-bed room has these amenities.", "title": "Mediocre", "helpfulness": 1, "user": "writeyou", "date": "January 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6559556, "likes": {"liked": "— No bedbugs", "disliked": "— Hotwire/Priceline purchases are also paying customers who deserve niceties"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Hotwire gave me a room at this Holiday Inn, and I was alarmed by the negative reviews on TripAdvisor. But give it a try, it's not that bad. We did not use the shuttle service (to SFO), the gym, the pool, or the restaurant. The complimentary in-room/LAN internet service was too slow to download podcast, but good enough to check e-mails and find directions via Google Maps.", "title": "Let's Go Monster Park! Let's Go Holiday Inn!", "helpfulness": 4, "user": "Kairbear", "date": "December 6, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6336150, "likes": {"liked": "— Easy to find with a great central location to area attractions.", "disliked": "— Bed could use some improvement. Seemed a little like a motel bed."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed in a king room with microwave and bar fridge. My wife and I found the room very clean, quiet and the bed was comfortable. Extra pillows were promptly provided when requested. The first night we ate in Houlihans the hotel restaurant and enjoyed the meal. The hotel is extremely easy to find and the highway access is right across the street so travelling to SF or south to San Jose/ Monterey was quick and no hassle. Part of the time we were without a rental car but the included shuttle service got us to the Bart station at SFO in a matter of minutes. The $5 fare to the Embarcadero/Union Sq. was a bargain considering the high cost of parking in those areas and took less time than driving. Staff were cordial and helpful in providing travel tips/directions. When we asked for restaurant locations at the front desk they printed out Yahoo maps for our convenience :)Our room was spotless on our return each day.", "title": "Good Value for the $", "helpfulness": 1, "user": "djmcm101", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7368589}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Check in and out were quick. The location is a bit remote in that other than other hotels and the nearby IHOP there is nothing within walking distance. We have no complaints about our stay here and would definitely recommend this hotel for the value we believed we received", "title": "Worth it for a Cheap Price", "helpfulness": 2, "user": "neandrtl", "date": "April 5, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "value": 5.0, "location": 3.0, "service": 2.0}, "id": 7283716, "likes": {"liked": "— The price", "disliked": "— The location - a long ways from the city."}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I read some pretty bad reviews on this hotel, so was a bit worried when Priceline booked me in here. I have to say I was pleasantly surprised - for the money I spent this was a perfectly fine hotel.", "title": "Ok for $50/night", "user": "gosaka", "date": "February 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6812079, "likes": {"liked": "— Location near SFO and price", "disliked": "— Cleanliness"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My room was clean and comfortable - nothing spectacular, but certainly adequate. I think I would have been upset if I'd paid full price (I paid $40, the travel websites were listing around $110), but it's a great choice for the discount price.", "title": "Simple - avoid like the plague!", "helpfulness": 1, "user": "df1606", "date": "February 6, 2007", "detail_rating": {"front_desk": 3.0, "value": 1.0, "service": 3.0, "business": 3.0}, "id": 6749897, "likes": {"liked": "— Nothing", "disliked": "— Dirty and shabby"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "I only stayed one night, but this hotel was everything I required. I've stayed in many Holiday Inns over the past couple years, and come to expect a clean & safe place to stay from them (and not much more). This hotel was exactly that.", "title": "3 star Roach Motel is more like it", "helpfulness": 1, "user": "LinFullerton", "date": "January 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 6596049}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "Our one night stay here was booked through Hotwire---we have had much better results with Priceline---and thanfully it was only for one night! The lobby is lovely, the parking free, and Hungry Hunter is just across the stree. Those are the positives for this establishment. To begin with, the men at the front desk (6/27/07)", "title": "Oops!! Never before, never again!!", "helpfulness": 1, "user": "bessiedear", "date": "July 8, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 1.0, "location": 5.0, "value": 2.0, "rooms": 2.0}, "id": 8077954, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "were arrogant, rude, and clueless. It seems you are treated like a second class citizen if you book through a third party and don't walk in off the street to pay FULL price. We were given our keys to the third floor, only to find they did not work. After THREE additional attempts, and two more rooms, we finally were able to unpack. I won't bore with you the details of the key mix-up, only to say that after two sets of keys that didn't work, they gave us one that did, only to find that the room was already occupied, and the party was in it! OOPS! (In all our years of hotel stays, that has NEVER happened) Then they screwed up our reservation from 3 people/2beds, and said it was 1 person/1 bed. OOPS! When we finally got what we had reserved, we found the wall paper peeling off the walls, and the pillows wrinkled as though they had been laid on. The hallways were stinky, the beds very uncomfortable, and the decor long outdated and due for an overhaul. We had dinner later that evening in Houlihans, the in-house eatery, only to be ignored and not promptly seated because we were a family seeking dinner, not bar goers coming to drink. When we gladly checked out the following day, they would not even give us a receipt , but said we had to contact Hotwire. This won't be on our list for the future. Holiday Inn was a huge disappointment.", "title": "Great for a early morning flight", "helpfulness": 1, "user": "Blaize76", "date": "June 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 7843670}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "P.S. Learn from this: When you check into a hotel room, ALWAYS immediately put the inside security door bar across your door and hang out your \"Do Not Disturb\" sign.----just in case the front desk gives your room to someone else! :)", "title": "At least I didn't see any roaches", "helpfulness": 1, "user": "LC1968", "date": "May 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7714379, "likes": {"liked": "— Pretty lobby, free breakfast for kids, free internet and parking", "disliked": "— Smelly corridors"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I was surprised to see all the really negative reviews. I found the lobby and my room to be clean and well kept. The bed was a little lumpy and I could hear some traffic from the adjacent freeway, but for $50 and a stay less then nine hours, I was completely satisfied.", "title": "Didn't love it", "helpfulness": 1, "user": "Stargirljen76", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7581174, "likes": {"liked": "— Friendly staff", "disliked": "— Ugly/cheap decor, didn't pay for parking"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My room was located in the back tower so maybe it is a newer room. I also enjoyed the hotel restaurant.", "title": "Disgusting Is Too Kind", "helpfulness": 1, "user": "MIKEANDMARTINE", "date": "May 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 7548977, "likes": {"liked": "— Close To Airport", "disliked": "— Couldn't Give A Damn Attitude"}}], "location": {"country": "United States", "city": "South San Francisco"}, "stars": 3, "variance": {"poor": 61, "average": 94, "very good": 117, "terrible": 40, "excellent": 42}, "aka": "Holiday Inn San Francisco - Intl Airport Hotel", "slim_ranking": 0.607142857143, "description": "The Holiday Inn San Francisco International Airport North is located in the birthplace of Biotech and ideally situated for travelers. It is adjacent to the South San Francisco Conference Center, just 1.5 miles from the San Francisco International Airport, a short distance to DowntownSan Francisco, Less than 30 minutes from Silicon Valley, right off Highway 101, with easy access to Interstate 280 and 380. The hotel features 224 spacious rooms, a brand new lobby with marble floors, fireplace, and all accommodations are thoughtfully appointed with modern amenities such as Free High Speed Internet Access, Free Parking, Free Airport Shuttle Service, and 24 Hour Fitness Room. Along with the South San Francisco Conference Center s 16,500 square feet of premium state-of-art Conference Facilities, we offer 6 additional rooms totaling 23,000 sq. ft. of Meeting Space. A friendly welcome awaits families and tourists at our hotel. We are located near many tourist attractions such as Fisherman s Wharf, Chinatown, Golden Gate Bridge, Harding Park Golf Course, SBC Park, home of the San Francisco Giants, Monster Park...Go 49ers!, Great America Amusement Park, and the Cow Palace. For business travelers, we are near Genentech, Amgen, Cell Genesys, and United Airlines Western Hub offices."}