{"user_rating": 4.0, "review_count": 202, "name": "Holiday Inn Columbus N - I-270 Worthington", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I've stayed here for several meetings and was in the area for a festival and booked a room. It's very clean and the beds are super comfortable. It's obviously an older property but it is well kept and good value for the money. Can't go wrong if you are looking for a clean, safe, comfortable place to stay.", "title": "Very nice.", "user": "hellommg", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82328896}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We just needed somewhere to stay while on the road. This hotel was right off 270 and easy to find. Room was very nice and clean. We had breakfast at the hotel the next morning and it was surprisingly fair priced!", "title": "Nice place to rest!", "user": "Alicialee45", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 73630861}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I am writing this review for my father since he is blind. When I came to visit him he had some strong complaints with this hotel. To start off... his friend brought him to the hotel around noon of his check in and went through the halls and had dirty plates, maids carts blocking the hallway, and the halls smelled very fowl. The front desk did not inform my dad or his friend of an easier way to get to his room (I would think this would be important because he is visually impaired) They had to go through a very long hallway to the very end, take an elevator down and walk all the way back at the other end of the hotel to get to his room. (This I understand the hotels location because it is smoking, but after I came to the hotel and had to experience the same thing he did, it was ridiculous! I knew there had to be an easier way. So once I got to my fathers room I knew exactly where I could park to get my father and take him on a short walk instead of a mile walk.) He was part of the Ohio State School for the Blind and we had a short meeting the first night with snacks. When we found out what we got at 18 dollars a plate/per person it seriously was not worth it. It was water, fruit, salad, and vegetables -oh and some meatballs that were cold. When my father and the other people had asked for more, they were told they would get it for them but they never did. The second night he stayed there they had a full dinner meeting. My dad and I got there at the hour it began and I had saw there was no place for us to sit so I had to hunt someone down! I told the waitress who was very nice and willing to help but she did not know how to make accommodations for my father and I. Eventually someone from the OSSB board helped us. We got a late seat last to serve. We were served chicken and beef with no knifes. I don't know if they know but the only thing missing with visually impaired people are their eyes not their ability to cut food!!! (made me very upset) Needless to say the food was delicious..although not good enough for 35 dollars a plate for a salad, beef, and dessert. My father wasn't pleased all because of these reasons. It was an unfortunate event for us and he is now re-thinking if he should do it again in 2012 if the OSSB chooses this hotel again for reunion 2012.", "title": "Some good, some bad...mostly bad", "user": "A0730", "date": "July 20, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 71696246}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "I just love this hotel, in fact so much, that I'm going to stay there again this summer. Annette could not have been more helpful or nicer. She and Todd are such great employees, always helpful, friendly, willing to go the extra mile. Room was great! Nice, clean, spacious, comfy beds with a choice of different pillows, soft or firmer, great tv, little frig came in so handy, and an indoor pool, too! And a business center with free computers, well what's not to like! My home away from home!", "title": "BEST HOTEL IN WORTHINGTON or Surrounding Area", "user": "JoJoGulfCoast_FL", "date": "June 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66222774}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Walls are thin. We heard the phone ringing and voices in the next room. Made it hard to sleep. The place was clean and staff courteous.", "title": "Staff was courteous, but walls thin.", "user": "HarleyFamily072", "date": "April 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 62339203}, {"rating": 5.0, "title": "Incredible service", "text": "The staff and management were excellent, friendly and accomodating. The room was comfortable and clean and got exactly what we wanted. Only negative was the ice right outside the door to the patio and the parking lot had not been cleaned by the time we left (three days later) and my partner fell.", "user": "MistressMidnight", "date": "March 8, 2010", "id": 58063165}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "My husband and I recently worked an event here. We have been to this hotel for numerous events and enjoy coming back every time. The staff are extremely helpful and courteous. If we ever have any problems they make sure to fix them right away. They have surpassed the level of service we have gotten at 5 star hotels. I would recommend staying here to everyone.", "title": "Great Place to Stay", "user": "KerimaLysanter", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55979808}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "My Partner and I recently attended an Event at your Hotel and were absolutely amazed by your willingness to go above and beyond the call of duty in all areas of support which included your little Restaurant, the Buffet and Room Service.", "title": "Sensitive, persistent and compassionate support!", "user": "Mahalaveda", "date": "February 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55892199}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "On another note, the beds were extremely comfortable. My only issue was the pillows. I prefer Down Pillows.", "title": "Enjoyable stay, impressive staff in a snow storm", "user": "always_economy_class", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55800960}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I stayed with friends here. The ride out was a stressful mess because of a snow storm.", "title": "Great place to stay!!", "user": "tatNewJersey", "date": "February 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55725819}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Spent two nights in this hotel. The rooms were very clean and well appointed. The bed was very comfortable. The staff was friendly and the restaurant food was good.", "title": "Great Experience", "user": "browneyez7", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55597884}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "We were there Feb 5-7 during the great blizzard and even though our large group overwhelmed the staff because we were trapped in the hotel all of the staff was very accommodating and helpful", "title": "Could not have been better!", "user": "happycamper074", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55596212}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The Holiday Inn Worthington hosted a conference my family and I were attending. They weren't staffed to handle the overload of people in their restaurant on Friday evening as a result of being snowed in, but they were upfront about the fact, and were obviously making heroic efforts to accommodate everyone and minimize the wait. The staff was relaxed and friendly, even telling jokes for the large groups dining there! Any little thing we needed, they made sure we got it! All while affording us privacy and security. Thank you very much!", "title": "Great Conference Hosts!", "user": "Drake-Leather", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55592705}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Robert Schneider", "title": "Great experience!", "user": "upstartartist", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 55569093}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Staff went above and beyond for our group which was hotel bound due to snow storm..facilities was clean and well kept and loved the very plushy king size bed in our room! Restaurant food was delicious and fairly priced and our stay was a very fun and comfy one!..Would highly recommend and we will defintely be back!", "title": "Gracious and Accomdating Staff", "user": "ravendancer3", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55566368}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "I attended a social event at the hotel and stayed 2 nights. The entire facility and staff was wonderful. Things were clean and in good order, the food was very good, and the entire staff was friendly. Really enjoyed staying here.", "title": "Just a great place to stay", "user": "DomLite", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55607707}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The hotel staff went above and beyond during our stay. Given the circumstances of the nasty snow storm, they worked with our large group and provided good service. This is not the first time we've stayed there and we will be back!!!", "title": "Excellent service and accommodation!", "user": "Cincinnati_Layla_A", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55606468}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "was there with group of about 300. the weekend there had large snow fall, the hotel and its restaurant had to quickly adjust for so many clients using its services. staff was pleasant and prompt with requests. rooms were clean.", "title": "highly recommened", "user": "jawrftu", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55606378}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "beds are very comfortable and pillows were wonderful. lobby attractive and welcoming. staff even assisted with battery in vehicle.", "title": "Friendly Service", "user": "EricaHart", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55602210}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "more luggage carts would be my only suggestion.", "title": "Friendly staff, comfortable beds; a pleasant experience!", "user": "thesleepiest", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55601671}], "location": {"country": "United States", "city": "Worthington"}, "stars": 3, "variance": {"poor": 14, "average": 24, "very good": 42, "terrible": 12, "excellent": 110}, "aka": "Holiday Inn Columbus n - i-270 Worthington Hotel Worthington", "slim_ranking": 0.333333333333, "description": "Worthington Hotel's Location is Near Major Columbus Highways Welcome to the Columbus - Worthington Holiday Inn. Our Columbus, Ohio hotel is located off I-270 and I-71, less than 16 miles from the Port Columbus International Airport (CMH). Vacationers to our Columbus hotel can enjoy a long list of area attractions. Downtown Columbus is just 10 miles from our hotel and offers a variety of activities that include tours of the Ohio Statehouse. Other attractions within 10 miles of our Worthington hotel include the Columbus Zoo and Aquarium, the Zoombezi Bay Water Park, Six Flags, the German Village and Brewery District, the COSI Museum and Ohio Stadium. Business travelers can enjoy the convenience of our hotel's ideal location near many Columbus businesses. Worthington Industries, MedVet, Cardinal Health, Mettler Toledo, Nationwide, JP Morgan Chase and Anheuser Busch are all within 10 miles of our hotel in Columbus. The Columbus Convention Center is also just 10 miles away. Ohio State University is nine miles from our hotel in Worthington. Guests can enjoy many premium amenities while staying at our hotel in Columbus, Ohio. Our amenities include free high-speed wireless Internet access, 15 meeting rooms, a heated indoor pool and our restaurant Connections Cafe. Enjoy great Columbus hotel deals and rates when you book your reservation with us."}