{"user_rating": 4.0, "review_count": 1083, "name": "Holiday Inn Express Hotel & Suites Hollywood Hotel Walk of Fame", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed for 2 nights in a double queen. Everything was spotless, the staff pleasant and the swimming-pool a definite plus for the kids.", "title": "Pleasant stay close to Hollywood Blvd attractions", "helpfulness": 2, "user": "fraire", "date": "September 1, 2011", "detail_rating": {"sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117535240}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The hotel has valet parking, which cost us approx $20 a night, but it was good for peace of mind.", "title": "Good hotel with an excellent location..just a few flaws!", "helpfulness": 3, "user": "sarah_sunshine14", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117531945}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The free breakfast was just fine, though a bit crowded at 8:30 to 9:30 am, as can be expected. Try to get one of the tables outside the breakfast room, beside the pool, much more relaxing.", "title": "Second Time as good as the first!", "helpfulness": 3, "user": "sford87", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117462829}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The only issue we had was that there was no hot water in our shower both mornings. I mentioned it at the front desk, and maintenance came to fix it in our absence, apparently, but I think the problem was just due to too much demand at a time everybody is getting up. (I tried the shower when we got back from eating out on the first evening and it was perfectly hot at that time of night).", "title": "Top Notch Hotel", "helpfulness": 3, "user": "Robert154", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117414738}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "To summarize, this is a comfortable, clean hotel in a strategic position. It is more expensive than your average HIE precisely for that reason. Maybe management should put some of that extra cash into installing a new hot water boiler to cope with the number of guests.", "title": "Excellent Location", "helpfulness": 3, "user": "Wilburdogs", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117222084}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Stayed here back in July 2006 and i think it was just called Holiday Inn Hollywood back then, anyway we found this hotel to be a great location for exploring Hollywood, easy walking distance of the Hollywood Bowl and the Hollywood Blvd Strip (Grauman's Chinese Theatre, Hollywood/Highland complex including the Kodak Theatre).", "title": "Great Hotel", "user": "Globetr3kka", "date": "May 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29984490}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The rooms are very clean, neat and very comfortable and roomy. The service and staff were excellent and always offered to help any way possible. I've read that the hotel moved next door and is all new and plush now, so i could imagine that the hotel has gone from great to great ++. Overall a pleasant stay.", "title": "Perfect Location, Great Value", "user": "LovesDogs5", "date": "May 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 29762829}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Stayed for 3 nights in a suite (sofabed/refrigerator, etc) with husband and teenage son that I booked through Holiday Inn's website as a priority club member. Very spacious with flatscreen TV. The price for this room was cheaper than other hotels' standard double rooms. Incredible free breakfast (hot & cold) included. Walking distance to many attractions including Graumann's Chinese Theater. Tour companies have their kiosks in that area. We booked a 2-hr movie star tour of Hollywood/Beverly Hills, which was great. Hotel wanted to \"book \" a tour for us, but we decided against it after we let them get a cab for ride to Universal for a flat fee of $20 when the return trip by metered cab was only $13.00!! Otherwise, the experience at this hotel was excellent.", "title": "Great Hotel - very helpful staff", "helpfulness": 1, "user": "Tweetiepie99", "date": "May 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29640054}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We stayed at the HI Express on the 20th - 22nd of April and were in room 516 on the 5th floor. We booked through the website for $282 for the 2 nights.", "title": "Great location for visiting LA", "user": "Zanika2005", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28832750}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "This was our first time in LA (we'd just spent 12 nights in Vegas and were on our way up the coast) and having only 2 days we thought it best to stay in the middle of it all and the hotel was very well placed for this. On arrival we were allocated a room on the 3rd floor, then the gentleman on reception mentioned the breakfast room was on the floor above this - I queried if we were directly below it (as we had just been in a really noisy hotel and I needed to get some sleep!) and he said 'no but tell you what i'll upgrade you anyway' - how nice. We had just booked a standard king room but he gave us an exec room instead which had a bit more space. This was very kind of him and he was very helpful the whole time.", "title": "Fantastic hotel", "user": "gilloconnell11", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28787678}, {"rating": 5.0, "title": "A \"Gem\" in Hollywood", "text": "What a Blessing this Hotel was. Bailey and all the rest of the Staff were excellent in customer service, area knowldge and all smiled while they did their jobs. The Hotel is just a 1.5 blocks from Hollywood and Highland which is right in the middle of the Walk of Fame. After fighting traffic all day to get there we were so glad to pull in and escape the Hollywood/LA scene. Rooms are oversized and quite. Breakfast is served on 4th floor so you don't have all the Lobby business and bustle going on around you. Brekafast was more than just your typical HIE cinnamon rolls and eggs. The Ladies upstairs took care of the food like they were serving their family a Holiday meal. I want to go back to LA just to stay at this Hotel and maybe take a Studio Tour, which we did not do this trip. 20.00 Dollar a day for parking sounded steep but was worth it for the convenience.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 14, 2011", "id": 116715747}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "The check in process was easy and quick and the staff were great!", "title": "Definitely Recommend and would go again", "helpfulness": 2, "user": "xangelfacex", "date": "August 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116697903}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "The room was quite big and excellently priced, we stayed there for 2 weeks and had no issues at all.", "title": "Great Location & very neat", "user": "Snowruby", "date": "August 11, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116583026}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The free buffet breakfast was such a bonus and the food is quite decent- you end up saving quite a bit of money by having breakfast provided by the hotel, not to mention time too!", "title": "Good Hotel!", "helpfulness": 2, "user": "Jadersk8er", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116481352}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "At night, there is a security guy who sat in front of the elevator, which makes you feel a lot safer too!", "title": "fantastic stay, wonderful service!", "user": "adrian h", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116453592}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Stayed at Holiday inn express 2 nights in july. It may be close too \"walk of fame\" and Universal and the hotel has got many good rewiews from other who have stayed her, but we where not satisfied. Awerall no problems but many small problems that not should been on a hotel like this make the rewievs not satisfied. For exampel had we problems with our door, we had booked for 5 persons but didnt get any bethclose for the sofasleeper. The ramp too the parking on floor 2 is wrongdimensioned for many cars so you \"bump in\" with the front of your car. We got home late from Universal one day and there's was no parking left for us, the hotel had rent out all places to people visiting Hollywood bowl. Also the smell on our floor (probebly something from the pool) is almoust disguisting. And the internet did not reach our room. No, overall not as good as expected.", "title": "Many small problems", "helpfulness": 2, "user": "Eriksen1", "date": "July 14, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 34694809}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Probably the best holiday express I have stayed in. The location couldn't be faulted - just 5 mins walk (if that) to Graumans Chinese theatre etc from where you can explore LA. There is also a few stores just across the road.", "title": "Fantastic", "helpfulness": 1, "user": "rock_30", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34661588}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Hotel seemed brand new, clean and spacious. Asked for a quiet room and didn't hear a thing. Pool looked good, but we were there only 3 days and there's too much in LA to sit around a pool all day. Breakfast clean and fully stocked all the time - standard holiday inn contiental style breakfast - just enough to start the day. Would defo stay here again", "title": "excellent location in heart of hollywood", "helpfulness": 2, "user": "WemberlyWi", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34278157}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Hotel is only one year old, so still in great condition. Front desk staff friendly throughout stay. Received two rooms as reserved. One room had view of wall directly in front of window, so requested room with city view and received it immediately at no additional charge. Rooms clean and decently sized with desk, big chair, large TV, fridge. Bathrooms clean with standard cinnamon scented amenities. Wireless worked in one room but not the other. Hotel provided us with ethernet cable during stay. Parking an additional cost but worth it because safe and connected to hotel elevators. Area has large amount of traffic and with events at Hollywood Bowl would have made finding our own parking incredibly frustrating. Stayed three nights and location was perfect for our L.A. visit. Breakfast was standard HI Express fare and tasty. Seating is limited given size of hotel. Get there early if you don't want to miss the cinnamon rolls. Pool and weight room. Tried all-in-one machine for weight lifting, kinda confusing but okay. Sister liked elliptical. Laundry machines satisfactory. Halls can kind of wind around, especially above 5th floor but not too bad once you learn your way. Area ideas include: The Hideout, inside the Hollywood Heights Hotel, is just a few doors down from HI Express. Went for dinner, service and food was excellent - try the sweet potato fries. The mini strip mall across from the HI Express has a decent Subway (with fresh avocado) and a small grocery with a Pizza Bella pizzeria inside - these are above average options for late night noshing - take food to your room though. Another pizza place in the neighborhood is just off Hollywood,at Yucca and Ivar, called Village Pizzeria. This serious NYC 'za is awesome. Create your own slice and save room for the italian ices. Finally, if you're a make-up junkie like me, there is a Sephora just a few blocks walking distance within the enormous open air mall along the walk of fame called the Hollywood & Highland Center. Highly recommend this hotel, I would definitely stay again.", "title": "great hotel", "helpfulness": 2, "user": "leobabe", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33247293}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Would reccomend anyone to stay here. We arrived after 4 nights in Las Vegas and loved the quiet location of hotel but able to walk within 5 minutes to walk of fame, restuarants, sightseeing tours. Staff lovely and helpful, rooms clean and pool peaceful, free internet access.Thanks for a great stay.", "title": "Best Value in Hollywood", "helpfulness": 3, "user": "bognor", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33216185}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "No complaints on this place; stayed with 2 young teens our our room with plenty of space; Starbucks, Subway and market just across the street and within a safe, 5-minute walk to the Walk of Fame area! Skip the free breakfast as you get what you pay for; instead grab a breakfast sandwich at Subway or Starbucks for a quick breakfast, or walk to Mel's Diner. You won't need a rental car as public transportation is just down the corner. And plan on a show at the Hollywood Bowl; you can walk there in 5 minutes!", "title": "Great Location for a family stay", "helpfulness": 2, "user": "TravellingBs", "date": "August 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116366494}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Great Holiday Inn just a few blocks north of Hollywood Blvd. Easy walk to all the attractions.", "title": "Would recommend", "helpfulness": 2, "user": "CCMark", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116324036}, {"rating": 4.0, "title": "Great LA option", "text": "Enjoyed a very courteous staff and a nice two bed suite. Note that the suite is one large room with a nice sitting area. Hotel had a nice pool and good size breakfast area. The pool is surrounded by rooms on an upper floor so you don't need to deal with the wind and elements. There is a full grocery market and a Subway right across the street. Keep in mind this is Hollywood so the market is higher priced than normal. Overall, we definitely enjoyed our stay.", "helpfulness": 1, "user": "k17", "date": "August 5, 2011", "id": 116294191}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This hotel is very clean and modern, and the staff were friendly and helpful. The location is fantastic - within view of the Hollywood & highland shopping complex and associated restaurants, and a short walk to the Chinese theatre etc. The area feels very safe. The subway located at the H&H centre takes you to Universal studios in one stop, and makes a large amount of the rest of LA very accessable (for example, we caught the subway to Dodger stadium for a night time game, no problems). There are also numerous buses from the H&H centre, we caught one directly to the Grove shopping mall and a quick change of buses took us directly to Santa Monica. A very good option for LA.", "title": "Terrific location and staff", "helpfulness": 5, "user": "Marty5136fair", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116224375}, {"rating": 4.0, "title": "Clean, comfortable, convenient", "text": "This hotel is amazing close to Hollywood and Highland, the main intersection of Hollywood. We took the Fly Away bus from the airport to Union Station for $7 each and then rode the Metro to the H0llywood and HIghland stop for $1.50 each, which is a total of $8.50 for transportation. The cab ride from LAX to the hotel is $100, so pack light (They have washers and dryers at the hotel.) and take public transportation. You'll save a bundle. There is a grocery store across the street from the hotel and a liquor store, too. Hollywood Bowl is only three blocks north, so you can easily walk there. Our room was quiet and as described on the hotel web site. We had a king suite with a sofa hide-a-bed. Both the king bed and hide-a-bed were very comfortable, although we did have to put the sheets on the hide-a-bed to use it. Breakfast had lots of choices and Marieta, the hostess, did an outstanding job keeping all the food and drink items restocked and the tables wiped off. (The earlier you go, the easier it is to navigate the food line and to find a table. The later you do, the crazier it is. Between 9 and 9:30, when the breakfast area closes, it is extremely crowded and very difficult to find an empty table, especiially on the weekend.) The exercise room is adaquate as there are two treadmills, which run quite loudly and an exercise ball. There are no free weights. The swimming pool is not heated, but it is a clean and neat area. Jessica, the day desk staff and Alfonso, the night desk staff, are extremely helpful. Both of them are eager to make your stay very enjoyable memorable. Stay here. You'll be glad you did.", "helpfulness": 1, "user": "LuvsFoodnWine", "date": "July 31, 2011", "id": 116057491}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Our family enjoyed this hotel! Very close to the Hollywood Walk of Fame and all of the different tours! Our room was froom was very accommodating for a family of four, large and very comfortable. We made use of the hotel's washing machine and dryer as well as the pool. The breakfast room was large with flat screen TV's,next to the pool and the breakfast was very good. I chose this hotel based upon other Trip Advisor reviews and would like to pass it along to others.", "title": "Within walking blocks of Hollywood Walk of Fame!", "user": "Comesanas", "date": "August 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117008880}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Excellent location, a 3 minute walk to Hollywood Boulevard & Mann's Chinese Theatre & the Walk of Fame. Close to shopping & restaurants. Valet service was excellent. All the staff we encountered were very friendly & helpful. Breakfast buffet was certainly adequate. The king size bed was better than mine at home! Location is a bit noisy if staying at the front of the hotel as we did but nothing to complain about. I slept like a baby. We had an executive king suite which was very spacious & clean as was the whole property. Our room had a window that opened which was nice to let some fresh air in. Would definitely recommend for the price & location.", "title": "Great location & service", "helpfulness": 2, "user": "Kjd773", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116924502}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I stayed at this hotel for 2 nights, Aug 5th-7th, while in town to see Hairspray at the Hollywood Bowl. It was a very nice hotel, in a great location for walking to the Hollywood Bowl and other nearby attractions, ie Walk of Fame, Hollywood and Highland etc...", "title": "Nice hotel, would return if in area", "user": "BuffaloAmy", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116922517}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The room wasn't ready upon checkin, but was a few hours later, it was a very nice two queen bed room, room 504. The rate wasn't bad, as I had the AAA rate. The room was very clean with standard amenities, it also had a nice flat screen TV, comfortable chair for sitting, and a nice work area desk. The one room downfall was the wireless internet, though free, the connection was extremely slow and horrible. The desk clerk said it was because of everyone getting on it, I don't think everyone in all the rooms was getting on at exactly the same time.", "title": "Great hotel with outstanding location", "helpfulness": 1, "user": "jeff-from-hamilton", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116778907}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "The hotel has a very friendly and helpful staff. The breakfast was very good, with a great variety of food, pancakes, sausage, bacon, cereal, danishes, coffee, juice, milk, better than most free breakfasts at similar hotels. I can't comment on the fitness center, or pool, as I didn't use either. I did walk out by the pool and it looked like a calm area, and was clean. The business center is free to use, and the internet is wired and way better than what's in the rooms. There's also a small store next to the front desk, that sells drinks, candy bars, chips etc... and also has a microwave for guest use.", "title": "Great location but overpriced", "helpfulness": 3, "user": "colbuck", "date": "August 14, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 116724083}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed here from 16 to 20 May 2009. The location was great, with spacious & clean room as well as sumptuous breakfast. However, if my friends/family or I were to visit LA in the near future, I will not return or recommend this hotel at all.", "title": "Good Location, Terrible After-Sales Service", "helpfulness": 4, "user": "joeybuzz", "date": "June 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 31909178}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Due to some last minute changes, we booked a Suite on the first night and a Standard Room for the rest of the nights. On the first night, two strangers knocked on our door repeatedly at 4am and tried to force it open. Being a light sleeper, I was woken up by it but thought it was probably just my imagination. Minutes later, when the nuisance continued, I woke my husband up and he talked to the men. The seemingly drunk men insisted that we should open the door as they believed the person they're looking for is inside our room. As tourists, we were scared for our lives. Security was obviously lacking there. We called the Reception, police came, we heard some loud noise outside and found out the next morning that the guests in our next room were asked to leave. Our following day was ruined as we didn't have a good night rest and were too tired to enjoy our itinerary.", "title": "Excellent", "helpfulness": 2, "user": "lemmingstone", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31255754}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "One of the Reception staff was friendly but gave us the wrong directions to Warner Bros Studios. We hard to learn this the hard way, where we walked aimlessly for 30 mins searching for the place, when we could have come off the bus much earlier. So do double check whatever directions/facts before you leave for your intended destination. Also, as we wanted to do web check-in for our flight home which is past midnight and this can only be done 24 hours before, we requested for usage of computer the night before at the Reception. The Reception staff on-duty wasn't very happy that we interrupted her 'sleep' and was grumpy throughout the 10 minutes we were there. We would have gone to the Business Centre if we could, but the printer was faulty there and we had to print our boarding passes as part of the process.", "title": "peaceful", "helpfulness": 2, "user": "adamsduo", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30927101}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Those were just little hiccups which we can afford to forgive and forget. But what happens next is rather intolerable to me.", "title": "We Loved It", "user": "montecarla", "date": "May 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 30532328}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "When we went to the Reception on 17 May morning to be transferred to a Standard Room which we've booked for the next 3 nights, the Reception upgraded us to remain in the Suite although we did NOT ask for it or complain about anything. Little did we know the real trouble began here.", "title": "Good location, Good value", "user": "Luv2CtheGlobe", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30119217}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Great hotel - beds are so comfortable, pillows amazing, nice clean rooms. The best is the location, a short walk to the walk of fame and where it all happens, close to all shops and restaurants. Reception staff very friendly and obliging. This was our first stop on a six week tour of America and it was a great start to our holiday. Highly recomend", "title": "Location location location", "helpfulness": 2, "user": "gradiperth", "date": "June 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33207412}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We came to this hotel from Las Vegas - we took the Luxbus from Vegas which took 4 1/2 hours. It was a really pleasant journey. the bus was modern and drinks, snacks and movies were provided. there was also a stop along the way. This bus was only $64!", "title": "Great hotel , good service, good location for seeing hollywood", "helpfulness": 1, "user": "BUNSTERBOO", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 33128259}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We stayed at this hotel from the 2 June 2009 to the 6 June 2009.", "title": "Excellent Hotel", "helpfulness": 1, "user": "traybird", "date": "June 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33023437}, {"rating": 5.0, "title": "Excellent Hotel - Great Location!", "text": "We stayed in a standard room which was well laid out and of a good size. it had all of teh usual bits and pieces...nice smellies in the bathroom, a good hairdryer, two large and very comfortable double beds, TV with many channels, air con, fridge and tea/coffee making facilities.", "helpfulness": 2, "user": "mwooduk", "date": "June 22, 2009", "id": 32900973}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The rooms were very clean and we had new towels anmd sheets every day.", "title": "fabulous stay", "helpfulness": 1, "user": "sukidsntravel", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32888719}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 2.5, "variance": {"poor": 25, "average": 99, "very good": 488, "terrible": 16, "excellent": 455}, "aka": "Holiday Inn Express Hotel And Suites Hollywood Walk Of Fame", "slim_ranking": 0.0766773162939, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Experience the Holiday Inn Express Hotel & Suites in Hollywood, CA. Located in the heart of world-famous Hollywood, California, our uniquely designed hotel appeals to style-oriented guests desiring exceptional service and comfortable amenities. During your stay at the Holiday Inn Express Hollywood, take time to tour the city and see all that Hollywood has to offer. We are centrally located near several historic tourist attractions such as the Hollywood Walk of Fame, Hollywood Bowl, Universal Studios, Paramount Studios, Sunset Strip, Rodeo Drive, Beverly Hills, Bel Air, Santa Monica and Venice Beach. Our hip hotel in Hollywood is the perfect place to stay as you explore the city. Built in 2008, our brand new Hollywood hotel is perfect for business travelers. We provide an alternative to local, traditional hotels without sacrificing any of the business amenities you expect. Our Hollywood hotel near the Los Angeles Airport (LAX) is just 20 min from the LA Convention Center and in close proximity to the LA Business District, the Century City Business District, ABC, NBC, the Warner Center and CNN. At the Holiday Inn Express Hotel & Suites in Hollywood, CA, we provide an oasis that inspires and re-energizes travelers. From our hip lobby and state-of-the-art fitness center to the convenient high-speed Internet access and a delicious, free hot breakfast bar, this Hollywood hotel provides all the amenities to make your trip to California a great one."}