{"user_rating": 3.5, "review_count": 83, "name": "Holiday Inn Express Calgary", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Not really many complaints about this Holiday Inn Express. The hotel is very well located at the south end of 8th Ave and is completely in walking distance of many good restaurants and tourist photo opportunities.", "title": "Pretty good location", "user": "cwb27", "date": "June 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 17063633, "likes": {"liked": "— Location, underground parking, very small hotel", "disliked": "— Underground parking can be cramped getting in/out of"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Breakfast at the hotel is slightly above average offering hot bacon, eggs and tea biscuits.", "title": "Great Customer Service, Pretty Good Location", "user": "dsysana", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11904075, "likes": {"liked": "— Customer Service", "disliked": "— N/A"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The absolute best tip I can offer is to sign up for Holiday Inn's Priority Club rewards program. At check in you'll receive a free bag of snacks and you'll also get access to the secure, underground parking lot.", "title": "OK for Business", "helpfulness": 1, "user": "mark d", "date": "June 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8000216}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Stayed here a week in December 2007.", "title": "With earplugs, a good bet for a good price", "helpfulness": 2, "user": "RoadWarrior", "date": "December 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 6441312, "likes": {"liked": "— The value", "disliked": "— The noise in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Hotel is not large at all. I think there are maybe 10 rooms per floor, so it was very quiet. Good sized bathroom with nice showerhead (adjustable). Room also had a microwave and minifridge.", "title": "Good value", "user": "Tixilix", "date": "October 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5980041}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "This hotel is nice and clean and the staff are very helpful and pleasant. The rates are good for what it is. The only negative remark I have about this hotel is the location. It is situated on the edge of downtown Calgary in a quiet area. It is a little out of the way but if you don't mind catching public transport it is OK and if you like lots of things happening around you I suggest you choose another hotel. However for the price, service and cleanliness it is hard to beat.", "title": "Nice and clean", "helpfulness": 2, "user": "Sydneytravella", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5837383}, {"rating": 5.0, "title": "Great Hotel", "text": "Stayed here in May 2005 ........... great hotel, excellent value for the price. Rooms are a good size aircon worked well considering the temperature swung from +28c to -2c over three days. Staff were great- we had booked a tour of the Badlands on the net before we left home, however the 'guide' didn't appear at the time we were told - went back into hotel to check if any messages etc - nothing, so we headed off to do our own thing around the city. On our return, we found, the receptionist (unasked) had located our guide - we didn't have a fone number- she said that she didn't like visitors to Calgary being let down, and had told him so, and if we agreed he would collect us the following morning, guess one can't ask for better service than that!! Location is great for getting cabs, and is just around the corner from the 'C' train terminus. Highly recommended!!", "helpfulness": 7, "user": "flymo68", "date": "January 25, 2006", "id": 4386285}, {"rating": 5.0, "title": "Great reasonable hotel", "text": "Have stayed in this hotel many times. The rooms are nicely decorated and clean plus each room has a nice workstation. Rooms also have fridges and free high speed internet. Every room also has a balcony which is nice. The location is great downtown, the price is reasonable and the hotel has a charm that many of these holiday inn expresses don't.", "helpfulness": 19, "user": "craigyb", "date": "May 31, 2005", "id": 3513618}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "My favorite part about this hotel is the tasty breakfast buffet which is included in the price. It's one of the reasons I like the express hotels from Holiday Inn so much. The room was also very nice and clean. The location was excellent, close to shopping and restaurants. Really liked this hotel and would definitely stay here again.", "title": "Would definitely stay here again", "helpfulness": 1, "user": "nbologne", "date": "March 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26749246}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had a fantastic night stay at the Holiday Inn Express in Calgary. We arrived late but were pleased to find that the hotel had covered parking at the back which was free to hotel guests.", "title": "Great stay", "helpfulness": 1, "user": "Selinaz", "date": "March 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 26172849}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Check-in was quick and efficient and we even got a welcome goody bag of water, cookies and a few other treats. We paid an extra $20 and got a fire place and a hot tub. Both were very welcome to help us get over the shock of the -20 temperatures!", "title": "Super (Holiday Inn) Express", "helpfulness": 1, "user": "Rob1965", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 21025136, "likes": {"liked": "— Service and the large bed", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "The room was large and clean with a kitchenette and seating area, a hot tub in the corner and a large comfortable bed. The bathroom was small but light and had a powerful shower.", "title": "Great Choice In Calgary", "user": "ED44SF", "date": "September 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20412715, "likes": {"liked": "— Very clean, and conveniently located.", "disliked": "— No negative issues, I enjoyed my stay."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Unfortunately the heating system was quite noisy so having the fire was perfect and kept the room warm all night even though we had turned it off.", "title": "Great stay with a [-] lacation", "user": "Dewey1", "date": "August 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 18616175, "likes": {"liked": "— 9th floor balcony", "disliked": "— 2 am fire alarm from adjoining building....no fire fortuneatley"}}], "location": {"country": "Canada", "city": "Calgary"}, "stars": 2.5, "variance": {"poor": 4, "average": 23, "very good": 31, "terrible": 4, "excellent": 21}, "aka": "Holiday Inn Express Calgary Hotel", "slim_ranking": 0.505154639175, "description": "Calgary, Alberta Hotel Offers Free Parking You'll enjoy an unbeatable location when you stay at the Holiday Inn Express Hotel & Suites - Calgary, just 15 km from the Calgary International Airport (YYC). Our hotel is also only one block from Calgary's Light Rail Transit (LRT). Want to be in the center of the action in Calgary, Alberta? Our hotel is just minutes from TELUS World of Science, the Pengrowth Saddledome, the Glenbow Museum and other popular attractions in downtown Calgary. Our hotel's guests can see a concert at the Jack Singer Concert Hall, visit history at the Mewata Armoury and shop in the CORE shopping centre. Business travelers also enjoy our close proximity to TELUS Convention Center, Shell Canada, SNC-Lavalin, NEXEN Inc., Husky, ATCO, NOVA Chemicals, Halliburton, the main branch offices for Scotia Bank, RBC and Alberta Treasury Branch, as well as other numerous businesses in downtown Calgary. Lodging here gives you easy access to our 430-sq. ft. meeting room and the business centre. We go beyond the other hotels in Calgary to offer top-quality amenities, from the complimentary hot breakfast bar, fitness centre and currency exchange service to each room's free high-speed Internet access and balcony overlooking downtown Calgary. Our hotel's rooms feature triple-sheeted beds, a workspace, a 27-inch TV with in-room movies, a fridge and a microwave. Our pet-friendly hotel looks forward to serving you."}