{"user_rating": 4.0, "review_count": 171, "name": "Holiday Inn Express Walla Walla", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "This is the second time I have stayed at this hotel and my experience both times has been nothing short of excellent. The staff is friendly an helpful. They seem to genuinely like what they do and it shows in the attitudes of the entire staff. Kudos to the management of this fine hotel...you have a great location and an outstanding staff. The downside to this hotel was their internet connection was slow and their tv service had very poor reception (fuzzy and pixelating) but neither of these would prevent me from returning to this hotel.", "title": "Excellent Staff", "helpfulness": 1, "user": "nebrtraveler", "date": "December 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 89471240}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I rarely see a Holiday Inn Express that is as clean, comfortable and affordable as this one in Walla Walla. We had two queen rooms, all the cable channels you could want, coffee pot/micro/fridge, and very comfortable beds. Breakfast was far more than I expected - even had scrambled eggs, bacon and fantastic hot cinnamon rolls. This hotel was better than the B&B I stayed at in-town previously, which didn't offer a hot breakfast, shared a bathroom and cost almost $40 more.", "title": "Great Value, Got More than I Expected", "user": "SeattleLisaS", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77550565}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We just stayed in the Walla Walla Holiday Inn Express. It is a very nice place.", "title": "Nice place - avoid executive rooms", "user": "Wallawallafan", "date": "July 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 70939596}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "However, we stayed in room 223, an executive room. The room stunk. They moved us after the first night because they agreed that the room odor was unacceptable. We just had them come up and smell the room, and they quickly agreed to move us.", "title": "Excellent facility, excellent value.", "user": "ScoreboardPub", "date": "June 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 68786486}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We don't know what the odor was, but the maintenance man told us it was the hotel mechanical room and the elevator hydraulics. Half of the executive rooms are adjacent to the elevator.", "title": "Just Dandy", "user": "alwaysamber", "date": "June 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 68645644}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Arrived very late at night and was cheerfully greeted by the staff on duty who gave us a couple of bottles of water and a bag of popcorn to be popped in the microwave in the room. The room was clean and well-equipped - fridge, iron + board, hair dryer, and as mentioned a microwave. Beds were very comfortable and each double had two soft and two firm pillows. Toiletries were the standard HIE ones - nothing special but adequate. Breakfast was included and quite okay - eggs, biscuits, bacon, cereals, danish, toast and jam, juices, bananas, yoghurt. Certainly more than enough to get you on your way each morning.", "title": "Very Clean, friendly and perfect for what we needed", "user": "1North", "date": "March 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 58336279}, {"rating": 3.0, "title": "Fine hotel on the outskirts of town", "text": "Plenty of parking spaces, and although the hotel is within 100 yards of Route 12 we were not disturbed by any traffic noise. The location is about a mile or so from the town centre, but very easy to get to Whitman College or to the many wineries in the area. Almost all of the better restaurants are in town but be warned - Walla Walla sleeps early so bear this in mind when planning dinner. Closing time tends to be at 9.00 on Mondays - Thursdays and a little later for the rest of the week.", "user": "HockeyFan6", "date": "October 19, 2009", "id": 47255704}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "The public areas are well kept, staff cheerful, wifi is free, - so overall for the price this is a definite addition to my list of hotels I am happy to stay at again.", "title": "Great stay - excellent service", "user": "brewergirl", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 46593541}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Spent one night, a quick visit while in the wine country. The hotel is outside of the \"downtown\" though just a few minutes away, but there is really nothing much in walking distance. Staff was very friendly and pleasant, otherwise a typical Holiday Inn Express.", "title": "Very good stay in Walla Walla", "user": "sage102", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 46411509}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I had a great stay at this Holiday Inn Express. My room was clean and very comfortable with a microwave and mini-fridge. The morning breakfast selection was very good ... everything from eggs and bacon to cereal and bagels. I had no trouble using the computer & printer in the business center to print my boarding pass on the day I left.", "title": "Awesome hotel!!!", "user": "Zanika2005", "date": "September 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 41642241}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "This Holiday Inn Express offered high-quality service, with the staff going the extra mile to make sure our stay was comfortable. Because we only stayed one night, it's challenging to write a complete critique. The hotel was clean and orderly, and had no real concerns with the room. One moment that caught our attention - in a positive way - was when a family member was late and missed the continental breakfast. A staff member stopped by our table and offered to bring anything back out that our family member might like. While the family member declined, this was one of the few times we can remember such an offer.", "title": "Good hotel and service...", "user": "TexasEXtraveler", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 98455881}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I stayed here for two nights and it was great. The staff was very friendly. The rooms are ncie and clean. It was a wonderful stay.", "title": "A very nice stay", "user": "kestech", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98002463}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I stay at this hotel on a monthly basis and have never had a less than excellent experience. The staff goes out of there way to ensure all my expectations are not only met, but exceeded. I have numerous options regarding accommodations and will always make every effort to stay at this HIE because of the great service provided by the staff.", "title": "Staff goes the extra mile", "user": "goducks20", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 94497393}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "I would like to say it is never great to be away from home...", "title": "They have treated me like a Queen, NO BAD DAYS at this Hotel", "user": "dakotalh9176", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91112398}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "But if you have to be someplace else the Holiday Inn in Walla Walla Wa is the place to be!! I have been staying here since continously since August 2010 as I am unable to go home between this lag of my assignment. When you have been here as much as I have, you really know there are NO BAD DAYS here at Holiday Inn, the staff is consistently superior, the kitchen and dining and rooms are clean. Breakfast is nice and hot and the staff cators to everyone whom comes through the front door of this Hotel.", "title": "Great place to stay", "user": "Ring800", "date": "December 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89876340}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Stayed here on a business trip/vacation. The check in staff were nice. The room we had was clean and spacious, everything worked as expected ( TV's, AC, lamps, etc.). Our room had a separate living room with a second TV which was nice. Location was so-so, there wasn't really a whole around the hotel, but Walla Walla isn't that big or hard to find your way around. My only real complaint was the price. I think we paid around $130 per night. All around a nice place though.", "title": "A tad pricey for what it is", "user": "jparent", "date": "September 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 39963776}, {"rating": 4.0, "title": "Nice Experience", "text": "We stayed two nights for a bike ride in Walla Walla. Buffet was good, not great--cinnamon rolls wonderful, lots of variety, powdered eggs not so yummy, but lots of food, hot, clean, fresh coffee wasn't bad. Sheets high quality, soft, room clean, I have no complaints about this Holiday Inn. Great value. I would stay here again. Don't expect a view and it's not in walking distance to much, lots of construction going on, but room was quiet at night. Nice place to let dogs run around in back. Pets are only $20 a night.", "user": "Seredni", "date": "June 25, 2009", "id": 33156561}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "we had a great experience, the staff was awesome. my husband was there on a business trip and we were just hanging out at the hotel while he was in classes. the staff were great at taking care of me and my two month old. they were friendly and always recommended places we should go or see. housekeeping would always clean our room when we went down to breakfast so i could put the baby down and let her take a nap. it has a pool/hot tub/gym that entertained us. we were able to walk to some shopping locations close by. the staff was very friendly and made us feel welcome and at home, but better because some one else was cleaning up and feeding us!", "title": "the staff were awesome", "user": "UnitedStatesMom", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 32535261}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The location is a little out of the way, but it was worth it. We paid a few dollars more and got a room with a sofa and recliner. It was so worth it. We had a lot of company (visiting our college age son and his friends). I was there when the cleaning people came in and they did a very thorough job. The staff was super helpful, the breakfast was terrific, not crowded like most places that serve free food. They kept it well stocked too, not stingy with food. Quality of food good. Bathroom products were pretty upscale too for this type of hotel. surprising.", "title": "Great value, very friendly staff!", "helpfulness": 1, "user": "jdmRedlands", "date": "February 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 24474504}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The rooms were very clean, and larger than the typical room. There is a number of pillows ranging from soft to firm on every bed. Although the hotel is located on the outskirts of town, it is only a 5 to 7 minute drive to downtown.", "title": "Clean and Well Appointed Rooms --", "user": "foodisourpassion", "date": "September 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 20049266, "likes": {"liked": "— The rooms", "disliked": "— The pet policy"}}], "location": {"country": "United States", "city": "Walla Walla"}, "stars": 2.5, "variance": {"poor": 6, "average": 18, "very good": 62, "terrible": 5, "excellent": 80}, "aka": "Holiday Inn Express Walla Walla Hotel", "slim_ranking": 0.307692307692, "description": "Surrounded by wineries, and vineyards, one of Walla Walla's newest lodging facilities, the Holiday Inn Express Hotel welcomes you. Whether you are here for business or pleasure, our location offers easy access to all this community has to offer. The Balloon Stampede, Winery Barrel Tastings, graduations/ events, Walla Walla County Fair, sporting events, art, car and horse shows are a few events held in our historical town. We have 81 spacious rooms, an indoor pool and spa, 24-hour fitness room and business center. We serve a complimentary super deluxe Continental breakfast and every night we make fresh baked cookies and milk. All of our rooms offer either king or queen size beds, microwaves, mini-fridges, irons and ironing boards. Corporate travelers enjoy over-sized desks and ergonomic chairs plus free high-speed wireless and hard wired Internet access. Whether you are in town to sample one of our award winning wines, visiting our beautiful historic downtown , or just getting away to relax, Walla Walla and the Holiday Inn Express have just what you need!! Stay smart at the totally smoke free Holiday Inn Express Hotel."}