{"user_rating": 4.5, "review_count": 735, "name": "Holiday Inn Resort Baruna Bali", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "My friend who is a priority member for intercontinental hotel group came down from Singapore for 4 days to visit me during my 15 day travels through Bali as I am an American on vacation working in South Korea. We split the cost after his discount and even though I was paying less than half price for the room, the cost per night it was still more expensive than either of the 2 other hotels I stayed at in Bali so I expected it to be the best. However I was quite wrong.", "title": "There is far better, nicer, and cheaper for your families hard earned money on your vacation...", "helpfulness": 6, "user": "HunterWright", "date": "January 24, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123574904}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I was surprised to find that I was a bit more comfortable and got more for my money at the smaller more quaint Balinese-style hotels where I stayed for half (if not a fraction of the cost). After traveling extensively through Bali and the southern tip of the island I was very shocked to see the prices of food, WIFI, laundry, gifts, tours, and even ice cream at this hotel. The prices are almost the exact same if not MORE than what I would pay on the US, Europe, or in Australia at a resort there. I could easily leave the resort and get an American breakfast or a filling, beautifully cooked Balinese meal for $3.00 usd which would literally cost FOUR TIMES that much in the Holiday Inn. I'm sure the Holiday Inn says it is only for guest convenience however I have had my fare share of eating in Balinese hotel restaurants and they are drastically cheaper than at this place. Even at swanky upscale restaurants on Legian Street and in Ubud I did not pay near as much for the one meal I had here. Even two bintang beers at the hotel bar \"Evny\" cost $9.00 usd when you could get two at the mini-mart down the street for a little more than 2 bucks and crack them open on the beach for a better experience, nothing I can \"envy\" about that. Heck, we went to Starbucks and got two iced mochas for only 7usd. The only reason why we got beers at the bar is because they don't serve mixed drinks past 10 or 11. What kind of bar in Bali stops serving mixed drinks before midnight?", "title": "We absolutely loved this hotel!", "user": "pepnz", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 123571557}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This hotel is filled with (and great for) families with young children who don't mind trading the convenience of low Indonesian prices for the same prices they pay at home only to keep their children sheltered from seeing and experiencing the true colors and realities of vacationing in a third world country. (I don't even understand why come to Bali with children if that is the case)", "title": "Fantastic Family Holiday", "helpfulness": 2, "user": "darwinlyn", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123291989}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Another thing I did not like about this hotel is that for the price that you pay it does not include WIFI. I have to use the Internet for work and other things when I am on vacation but they charged about 7 dollars USD per hour whether we use wifi or the computers in the business center or WIFI in our rooms for something as simple as e-mail. The connection was poor as well, I was calling my family in the US on Skype and it cut out two or three times. The other two hotels where I stayed in Bali for less than 50 dollars a night always provided free strong WIFI. 7 dollars per hour in Indonesia is outrageous. Outrageous ANYWHERE! Many internet cafes in Bali offer one hour for only 1 or 2 USD. After complaining upon checkout about this they reduced the WIFI bill 50% however I'm not going to dance in circles over that.", "title": "Fabulous hotel for a family", "helpfulness": 1, "user": "MissJaneAustralia", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123127782}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We were also awakened on a Sunday morning at 8am to the sound of drilling on the balcony in the room next to us (see the photo I've included below) once the men saw me take a picture of them drilling away at such an inconvenient time for guests they had stopped but were back 10 minutes later only to finish the work. ON A SUNDAY MORNING at 8am!!!!", "title": "Great Family holiday", "helpfulness": 2, "user": "TwoDogz", "date": "January 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123057621}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The resort is located close to the airport and a non-metred taxi should cost you no more than 35000 Rp or about $4.50. Security is good with no vehicles allowed anywhere near the enrance until screened. The reception staff were a little inexperienced but as is the usual in Bali very friendly.", "title": "Great resort that with time will be better", "user": "headinajar", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49022075}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We stayed in a double room out the back on level three for 6 nights. As previously described the rooms are small but as long as you know this and don't plan on spending lots of time in the room they are fine. The rooms are very modern, clean and well equipped with ipod compatible radio and LCD television.", "title": "Tranquility, great service and good cocktails", "user": "Strangyhk", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 48954364}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The pool area/swim up bar are great but I was regularly sharing the pool bar with children ordering milkshakes. There is a kids pool but I understand why it doesn't get used by the adults as it is too shallow. The bar staff seemed more interested in serving the kids rather than taking my money for more expensive drinks. At no time whilst I was lounging poolside did anyone ask me if I wanted to order food or a drink. They would have made some good coin out of me and my travelling companions. When you are at the pool bar (in the pool) or beachside lounge areas you can order customised pizza's and pasta's which were tasty and reasonably priced.", "title": "Paradise", "helpfulness": 2, "user": "edenhh", "date": "November 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48796464}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The grassy lounge area and beachside bar are really relaxing places to chill out although the lounge areas are not shaded. Relaxing in the lounges with relaxed tunes playing watching the sun go down was one of my favourite Bali resort moments.", "title": "Simply Wonderful", "user": "matakanaisland", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48014990}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The breakfast buffet was good but nothing to rave about but once again you can customise what you want egg wise and all the standards were there.", "title": "Could not recommend highly enough - amazing hotel", "helpfulness": 1, "user": "Olivia335", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47678241}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We stayed at a ground floor room with garden access and enjoyed our stay at the resort. The room size was ok and the access from the balcony to the garden and pool was convenient. The facilities in the room look a bit worn though. Breakfast was good with enough selections. We had dinner one night and the food was ok. The food price at the hotel might be a little high as compared to outside. There is beach access and plenty of beach chairs around. The Discovery Mall is around 20min walk along the beach, and it has everything you need (food, souvenirs, department stores). Transportation to the airport was quick (5-10 min).", "title": "Resort for families", "helpfulness": 1, "user": "lizzylizzy", "date": "December 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 188538389}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "On arrival, we were greeted with a herbal drink and ice towel which were soothing in the humid climate of Bali.", "title": "Loved staying here!!", "helpfulness": 2, "user": "Vyshnavee", "date": "December 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 188424842}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Rooms were very clean. Daily maintenance was provided.", "title": "Perfect place for family", "user": "Ariyatn0M", "date": "December 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 188325428}, {"rating": 5.0, "title": "Event restaurant", "text": "Private beach near by, was very comfortable even to be accessed at nights. Guards keep supervising the beach area even in nights.", "helpfulness": 1, "user": "Janet T", "date": "December 20, 2013", "id": 188120703}, {"rating": 1.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Swimming pool was well maintained.", "title": "A hotel with the worst service for locals", "helpfulness": 1, "user": "trite", "date": "December 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 187841649}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Have stayed in Bali at various Hotels in the last 8 years, but the first time here. Now we would not stay anywhere else. Very friendly staff, lovely modern surroundings, beautiful comfy beds......actually couldn't fault it at all. 5 mins cab ride to Kuta shopping and many restaurants. Very clean. Right on the Hotel's private beach, with security guard. Entertainment most nights and great food. Just a perfect resort!", "title": "Just Perfect!", "helpfulness": 1, "user": "BettyBoopMebourne_", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50409523}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "B & S", "title": "Great Stay", "helpfulness": 1, "user": "eXiTeD1", "date": "November 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 50314099}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Melbourne,", "title": "Perfect!", "helpfulness": 1, "user": "KarenTAustralia", "date": "November 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50124140}, {"rating": 5.0, "title": "The relaxing and great hotel with great food and facilites", "text": "Australia", "user": "sharmaineyeo", "date": "November 26, 2009", "id": 50086638}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Just arrived in Australia after 4nights at this hotel. Great staff, who always remember your name with a smile (just watch communication barrier when making meal orders). Great service at all resturants & pool bar (Happy hour 2 for 1 cocktails made everyone very happy!:).", "title": "Great hotel", "user": "onlyfinchy", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49378592}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Tripadvisor advice defintely was right. This hotel was the perfect family vacation spot. Good food, good rooms, good facility, great people, great kids club, and outstanding family friendly environment. I would highly recommend this hotel for people with families, especially young children and want 'it all' while still trying to keep within a decent budget. There are numerous choices in Bali and for a family on a budget and looking to have fun I find it hard to believe there are better ones. I also enjoyed the spa also which was very good. Some of the rooms were getting a little old, especially in the bathrooms but nothing really serious to complain about.", "title": "Great Family Vacation!", "helpfulness": 2, "user": "MurphyFamily4", "date": "November 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186030978}, {"rating": 1.0, "stay_parameters": "Stayed November 2013", "text": "At check-in", "title": "It was not that good afterall!", "user": "GelinaTay", "date": "November 24, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 185733446}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Upon arrival no assistance when unloading luggage", "title": "Nice hotel, convenient location", "helpfulness": 2, "user": "Marie-S Beijing Y", "date": "November 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 185656310}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "1. realized busy chatting with other", "title": "Awesome resort for families", "helpfulness": 1, "user": "RHBI", "date": "November 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 185539796}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "At 1pm - Room not ready, when asked what time ready told check-in time is 3pm.", "title": "Average rooms", "helpfulness": 1, "user": "pinklyn", "date": "November 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 185367523}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed at this hotel for 3 nights with 2 adults, a 10yo, a 2yo and a baby.", "title": "Good family hotel, location had pros and cons", "helpfulness": 11, "user": "Ellebana", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 122793983}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Our room was a King Baruna Suite on the second floor at the end of a wing. It consisted of a bedroom with King bed and bathroom, and a separate sitting room which had a futon style fold-out bed for the 2 kids as well as a table and four chairs. A decent portacot was also provided for the baby at no extra cost. There was a good size balcony with seating which could be accessed from both rooms, however we spent all our room time inside in the airconditioning and away from the mozzies. There were also TVs in both rooms, as well as internet at a cost of USD$20 a day (which I was not prepared to pay - I used the Envy Bar's wifi near the pool). The suite was on the end of the building and looked directly across beautifully manicured gardens to the ocean (the view of the shoreline itself was impeded by trees, but we could see the water at a distance). I would call it Ocean View rather than Ocean Front.", "title": "Great for families,excellent pools", "helpfulness": 2, "user": "Naseema_10", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122767474}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The Holiday Inn was renovated in the last couple of years and everything was in good, clean condition; including the lovely large bath. The King bed was very comfy and had decent linen and pillows in excellent condition. The pillowslips even had notes embroidered on the edge indicating the firmness of the pillow inside (hard, soft etc). Unfortunately the kids’ fold-out bed did not live up to the same high standard; it was exceptionally hard and could only be slept on by the 2yo who will sleep anywhere if he’s tired enough. After the first night 10yo pleaded for a different bed so I spoke to reception and they arranged for a single bed to be provided at no additional cost. This was a mattress and base rather than a fold-up bed (thankfully), and it was more comfortable than the futon bed, but still pretty hard.", "title": "Amazing experience", "helpfulness": 1, "user": "Aztravelernew", "date": "January 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 122766754}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The check-in staff were very friendly and we were given a lovely cool facecloth and fruit jelly in a glass (with spoon) on arrival. We were checked in without waiting and shown to our suite which was easily accessible with a pram. The only problem we encountered was trying to get to the downstairs level (for the restaurants, pool, kids club etc) because the lift is tiny and couldn’t accommodate our stroller. I spoke to a staff member about this and he showed us how to access the porter’s lift, which had plenty of room for the whole family and stroller. Whilst we had no problem using the porter’s lift, I would have to rank the Holiday Inn as NOT being wheelchair friendly, because the buttons in the porter’s lift are very high (a person in a wheelchair could not use this lift without assistance).", "title": "Family Fun. Great service: Smiles Included", "helpfulness": 1, "user": "thecameradude", "date": "January 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122549369}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Breakfast was an excellent buffet served in the poolside restaurant. The cost was included in the price, and one kid ate free with each adult. There was a good range of hot and cold Asian and European choices and plenty of staff to re-fill coffee etc. We particularly liked the fact that bacon, sausages and all varieties of eggs could be ordered via little notepads kept on the table. This meant you could get up and select juices, cereals, fruit, pastries, pancakes etc while the other stuff was being cooked to order then delivered directly to the table. The only thing missing from the buffet (in my opinion) was freshly squeezed juice, however a variety of commercially prepared juices were available. The poolside location was fabulous and mozzie-free. The only downside for our family was the fact that we had to spend a lot of effort restraining the 2yo the first morning, but after that we relied on the Nanny to keep him out of the pool while we ate in peace.", "title": "Ok place", "helpfulness": 1, "user": "Dell73", "date": "December 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 122339866}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Spent 7 nights in a Family Suite which was great as the kids had their own room with TV/Bathroom etc.", "title": "Excellent Hotel", "helpfulness": 1, "user": "78Christopher", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123762476}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Rooms were nice and clean and a really good location, about 30 second walk to the pool.", "title": "Excellent Service, close to airport, quiet and family friendly", "helpfulness": 1, "user": "K0500", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123759634}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Staff were the best we have come across in all our visits to Bali and nothing was ever to much trouble if we needed something.", "title": "Our 2nd Home in Bali", "helpfulness": 2, "user": "pinkfrangi", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123735289}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Breakfast was excellent with a good selection and plenty of tables each morning to choose where you wanted to sit.", "title": "Nice hotel", "user": "Alexey_viajando", "date": "January 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123688905}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Envy Bar on the beach was great, realy good food plus view of the beach and pool.", "title": "Made our stay more enjoyable!!!!!", "user": "MeghnaKishan", "date": "January 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123583251}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "4th time back since this property opened and it never dissapoints.", "title": "4th time back to this hotel and it never dissapoints! Definitely take my family back again and soon!", "helpfulness": 2, "user": "zedmeister", "date": "January 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123943694}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Stayed 7 nights in a Grand Ocean room. Huge room and fits the family in well.", "title": "Great Hotel, good location", "helpfulness": 2, "user": "waljul", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123891193}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Must admit the curtains could do with replacing but I noticed the rooms next door now have timber blinds so it's likely this will be attended to soon.", "title": "good hotel", "user": "vithia", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123816903}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I can't recommend this hotel more highly. Great for families!!", "title": "Best hotel in Bali! just the location didnt suit...", "helpfulness": 5, "user": "ab_n_tam", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 123775799}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Definitely stay here again and again!!", "title": "Memorable holiday.....", "user": "ankur467", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123771443}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "By far the best hotel I've stayed at in Bali. Travelled there with a group of friends for a special birthday and the staff made us feel very special. Main things about this hotel are:", "title": "Ticks all the boxes for me!", "user": "Terri_Lee14", "date": "December 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187359012}, {"rating": 5.0, "title": "An amazing hotel!", "text": "Location, location, location..... a quick 10 min. taxi ride from the airport and close enough to walk into Kuta along the beautiful beach boardwalk. The hotel's decor is warm, trendy and inviting -", "user": "Anitabirdi", "date": "December 10, 2013", "id": 187314857}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "great value for money - lovely rooms - awesome breakfast buffet - fantastic pool with swim up bar - loved the Bale Bale's (cabanas) to relax in and watch the sunsrise/sunsets. No beach road so no annoying scooters. Will definitely be staying there again :)", "title": "Great beach front property, lovely pool, live entertainment.", "user": "7caratz", "date": "December 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 187000784}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We have stayed here for 5 nights and have had the most amazing time. The rooms are immaculately clean, modern & stylish. The staff are friendly & very helpful. All the food is so tasty & reasonably priced. The pizza from Envy should not be missed. Wish we had booked to stay here for longer! We will be back!!!", "title": "Very nice hotel and excellent service!", "helpfulness": 1, "user": "Dennis-Rosario", "date": "December 7, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 186968169}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "It's one of the rare resorts which has a beach front without any road in bw. Room views from front sea view r great, while on the sides don't offer a great view. The resort offers a great spread of b/f to suit all palates. Also it lends free cycles for tours which is great. The weather was warm so hv sun tan lotions n hats. The discovery mall n kuta beach are quite close. Can pick good souvenirs at the mall. Must live in resort. They hv live entertainment 2-3 times a day with live music, fire dance etc.", "title": "Truly Magnificant Accommodation", "helpfulness": 2, "user": "KBRED", "date": "December 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 186591009}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Baruna was really enjoyable - very professional and friendly staff and management. Visually, it's fresh, clean and interesting. All restaurants were good quality, not exceptional, but as good as many other more expensive \"5 star\" resorts I have stayed in in Bali & SE Asia. The family room was fun for the children though we were barely ever in the room - there are plenty of bales around the pool that you can comfortably set up for the day in - they even have a power socket to charge i-pod's etc - nice touch.", "title": "As good as the Trip Advisor reviews said", "user": "fronsey", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 52420673}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The empty bar fridge and 'market priced' goods in the hotel mini mart is also a fantastic innovation.", "title": "Warning about pick-pocketing", "user": "jessica_aus", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51662637}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We had a negative experience with the hotel kids club howvere this was promptly and professionally addressed by the staff and they genuinely seemed to learn from mistales which is, again, a refreshing attitude.", "title": "Very nice resort but they need to have some entertainment at night", "user": "travelguy1944", "date": "December 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 51492150}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "I would stay at HIB again (if I had no desire to shop or leave the resort) and hope the service and pricing remains the same - if it wasn't branded Holiday Inn (never associated with anything above average in my experience) the place would no doubt be swamped.", "title": "First trip to Bali", "user": "lulu-chan", "date": "December 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 51180123}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The Holiday Inn is a fabulous hotel I am currently staying here.", "title": "highly recommended", "helpfulness": 5, "user": "markad6971", "date": "December 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 50947604}, {"rating": 5.0, "stay_parameters": "Stayed November 2009", "text": "This was a very pleasant surprise! And new!!! And if you've been to Asia before, you'll know that NEW is a very important part of a nice hotel.", "title": "Fantastic hotel right on the beach with everything you could ask for!", "user": "lovecat", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53138198}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Apparently this hotel is the first \"resort\" that the Holiday Inn has done and its a great place to stay!", "title": "A great place for young children", "helpfulness": 1, "user": "yohanawu", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53136319}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "They've thought of everything. From the icecream shop to the many big bales around the pool to pool toys to the lovely lighting, the 2 different types of restaurants, the well-priced 'essentials' shop which is open to midnight, to the 'teenagers only' area with playstations etc, I can't even remember everything this place has.", "title": "Clean and Modern", "helpfulness": 1, "user": "slk8000", "date": "January 9, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 53061508}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The rooms are lovely, the only downside being that they're pretty cramped. But the twin rooms have WONDERFUL king-sized single beds - so comfortable I thought I was sleeping on my $4k kingsdown mattress at home.", "title": "A view from a first time traveller to Bali.", "user": "SydneyKittyKat", "date": "January 8, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 52982474}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The breakfasts are brilliant. As good as any breakfast including the expensive hotels in Nusa Dua (where we often stay).", "title": "it was ok", "user": "sunnymc84", "date": "January 8, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 52899199}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Wonderful room, great view, lovely pool deck. Very gracious and accomodating staff. Pool bar serves very weak drinks, unless you ask for \"real drinks\" and pay accordingly. Security present and visable; located minutes from the airport. Surrounding neighborhood safe to walk and only a block to the \"main drag\". Great breakfast buffet. Smoking allowed on pool deck and balconies, rooms are non-smoking. Lots of young kids...got kinda loud on the pool deck at times...and the place is family friendly.", "title": "Beautiful", "helpfulness": 1, "user": "Todd T", "date": "November 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 185363996}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We stayed here for 4 nights just recently. Check-in was smooth, the staff all welcoming to us all. Our room was a studio garden view, on level 2, at the far end of the resort, away from the lobby. It suited our family (2 adults, 3 kids aged 6, 10, 12) with the bunk beds and the sofa bed. The bathroom was a bit of an eye opener at how open it is, but we got over that and actually found it to be good to keep an eye on the kids while they were showering without having to be in with them. We had no issues with the housekeeping cleaning our room, as soon as we were up and out for breakfast, we hit the switch to let them know we were happy to have the room cleaned, and every afternoon at about lunchtime, it was done. We love the cleaning fairies.", "title": "Fantastic for families, yet not over-run with kids", "helpfulness": 1, "user": "EyeCee", "date": "November 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185354418}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Even though there is only one pool, there is a kids pool to the side for the young non-swimmers, while the rest of us can float around, or sit at the bar, or play a game of water polo. The pool bar staff are friendly and funny, kudos to them for having to put up with the occasional drunk Aussie cackling loudly and making the rest of us cringe. Happy hour can be a noisy time.", "title": "Fantastic place to stay with kids", "helpfulness": 1, "user": "puppy0", "date": "November 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 185147528}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The food at Envy was delicious for dinner. At The Palms, the breakfast buffet had a wide enough range to suit all tastes, even the woman who literally cleaned out the fruit station 2-3 times in one sitting- my 6yo was very disgruntled that she didn't leave him even one piece of watermelon. Thankfully the staff replenished foods/drinks quickly so little time was spent waiting. The staff were attentive and friendly, always keen to help. They made a mean Virgin Mary too!", "title": "The Weird and the Wonderful", "user": "Blaqjaq84", "date": "November 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 184733580}, {"rating": 5.0, "title": "Awesome family resort", "text": "Our 2 younger kids used the kids club, they found it boring. The set up is very efficient though, with locked doors for safety, a playground right outside and a phone being provided so the staff can contact you if needed. Our oldest child used the teen room a couple of times, specifically to play the xbox (and chat to the cute boy who was there sometimes too).", "user": "BruceKimYoung", "date": "November 14, 2013", "id": 184659721}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Tuban"}, "stars": 4, "variance": {"poor": 20, "average": 77, "very good": 252, "terrible": 11, "excellent": 375}, "aka": "Holiday Inn Resort Baruna Bali Hotel Tuban", "slim_ranking": 0.176470588235, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "On the Island of the Gods, the beachfront Holiday Inn Resort Baruna Bali is guided by its namesake, the Balinese God of the Ocean. Located on three hectares of beautifully terraced tropical gardens, this contemporary, Balinese-inspired resort features 195 guest rooms and suites along a perfect stretch of white sand beach. Appealing to families and couples alike, Holiday Inn Resort Baruna Bali is situated in the secluded enclave of Tuban, an easy 10 minute drive from the airport, and a short stroll to the vibrant shopping and entertainment area of Kuta. Guests will be spoiled for the choice with families enjoying the themed KidSuites, Family Suites and the many creative children s and teen s activities. Couples can groove to the beat at The Beach chill out bar & restaurant or relax with a soothing treatment at the oceanside Tea Tree Spa. For those choosing the resort for meeting and incentive programs, whether it is the naturally lit Balinese-styled ballroom, roof-top terrace or the many themed events, a program at Holiday Inn Resort Baruna Bali is sure to bring the team together."}