{"user_rating": 3.5, "review_count": 71, "name": "Holiday Inn Minot - Riverside", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We arrived around 9 pm, had not had dinner and asked the front desk clerk what would be open in town. He said only the restaurant in the hotel, or a truck stop down the road. We checked in and proceeded to the on location restaurant where we were told that they were in fact closing, but we could have something from the bar menu to take to our rooms. Wasn't exactly what I had hoped for to eat, and then we found out the next day that there were many restaurants in fact still open on the south side of town. The room was clean but had that dirty rug smell. The gap under the door to the hallway was quite big and the light shone into our room in the bed area all night. The worst was the breakfast the next morning. The coffee was watery, barely a hint of beans in that brew, the bagels were overtoasted, and freezer burned tasting. Only one choice of topping, strawberry jam, not even cream cheese! I've stayed in worse rooms, but the meals were terrible. We found many better lodging choices the next day when we went to the south side of town to the mall, and guaranteed we will stay at one of them", "title": "Could use an update", "user": "Travellers007", "date": "September 15, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 8717046, "likes": {"liked": "— comfortable bed", "disliked": "— room smelled like dirty carpet, and terrible restaurant on location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This hotel was fantastic. It has a great kids play area, where the pool is very shallow and there are water guns, mini slides and a trojan themed fort for the kids to play in, that is in the center of the pool. The rooms are comfartable and spacious and the hotel has a great breakfast cafe. This was an extremely pleasant stay.", "title": "Great Staff - Wonderful for Children", "user": "EveninhisYouth", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8590086}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This hotel has a staff that will bend-over backwards to please you.", "title": "The Riverside Holiday Inn is an Excellent Hotel", "user": "jomoud", "date": "May 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7642151, "likes": {"liked": "— excellent service and cleanliness", "disliked": "— none"}}, {"rating": 5.0, "title": "Best Place in Minot", "text": "The check-in was fast and efficient and extremely courteous.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 12, 2006", "id": 4349695}], "location": {"country": "United States", "city": "Minot"}, "stars": 3, "variance": {"poor": 7, "average": 17, "very good": 26, "terrible": 4, "excellent": 17}, "aka": "Holiday Inn Minot - Riverside Hotel Minot", "slim_ranking": 0.612903225806, "description": "Welcome to the Holiday Inn Riverside! Minot's best choice for your full service or convention needs. We are a beautiful 7 story atrium hotel located on Highway 2 East, right across from the North Dakota State Fair Grounds. We are within minutes of the downtown shopping area, Medical Park and Roosevelt Park & Zoo. Our rooms, pool, lobby & convention center have all been recently remodeled & we offer free high-speed wireless Internet throughout the facility. Brand new in March 2005 is the Atlantis Interactive Waterpark with a lap/bubble jet pool, hot tub, sauna and game room. Room rental includes 4 wristbands. Pool area is for hotel guests only. Birthday packages available Sunday - Thursday. Please call hotel for more details. Must be booked through hotel directly. The Pavilion restaurant is open daily from 6:30 AM to 2:00 PM. The Ground Round Bar & Grill is open 11:00 AM - 11:00 PM. Relax in our Oasis Lounge & Casino open 5:00 PM - 11:00 PM. Meeting facilities available up to 2000 people."}