{"user_rating": 4.0, "review_count": 668, "name": "Holiday Inn Express Berlin City Centre-West", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This wasour first trip to Berlin and we were impressed to be stayng at the city's first completely non-smoking hotel. On arrival, we were dealt with quickly and efficiently by the young reception staff. Our room was located to the front of the fairly busy K'strasse, but we soon learned that the double glazing was very effective at keeping out the traffic noise. The bed was comfortable and the room clean ansd generally well presented. We knew that the HIE brand was a basic one and our expectations were ranked accordingly, but we were very happy with ehe overall presentation. Slight minus points on the lack of a wardrobe to speak of and safes in the room. The bathroom was very nicely preesented, and we both loved the funky violet light! Good shower, towels and tea making facilities were fine. Breakfast was included in the price (not always the case), and was decent with a limited choice but tasty and excellent value. Bar prices a bit of the high side, and range of drinks limited. Lifts were on and off during our second day of stay and I had to leave my showere when the fire alarm went off and we had to evacuate. Another minus point here is that some of the staff hung around the side of the building while the guests were left to exit the building and mall around outside on the street. A young staff to be sure, but they tried hard to please and they were polite, friendly and generally decent. Location is great fro Wittenbergplatz, the Ku'damm and Zoo all within 5-10 mins easy stroll. We wanna go back, but would like to see just how quickly the building will wear own.", "title": "A Good Deal All Round", "helpfulness": 5, "user": "BillyMcIlroy", "date": "May 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15735324, "likes": {"liked": "— The price, the cleanliness, the location, friendly staff", "disliked": "— Lift problems, lack of safes"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed there for 6 nights from April 23rd to April 28. It is a new hotel, rooms are designed carefully. Our bathroom had only a shower, which was fine with us. The WC itself is in the same space but the door can close it leaving the sink and shower free for others to use. Really sophisticated. The room was small-medium in size. What I did not like at all is the there is no wardrobe, only a few open shelves. A desk with no drawer, and only 1 chair. Another chair would be great although the room is small.", "title": "Nice hotel, but...", "helpfulness": 2, "user": "shoshi", "date": "May 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "business": 3.0, "cleanliness": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15519894, "likes": {"liked": "— Location", "disliked": "— no closets"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Staff - young and nice, but when the hotel was full they did not cope so well. We had a problem and it was not dwelt properly.", "title": "Really great hotel", "helpfulness": 3, "user": "notakid", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15506373, "likes": {"liked": "— modern clean and cheap", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Breakfast - a small buffet with rolls, jams, cereals, salami and cheese and some other items. The same everyday. Thgey did not replentish items fast enough, and many times items were missing for over 20 minutes.", "title": "Non smoking heaven in Berlin", "helpfulness": 3, "user": "Laban1", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15368676, "likes": {"liked": "— New non smoking hotel, good location, easy transportation", "disliked": "— Disorganized breakfast"}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 13, "average": 74, "very good": 340, "terrible": 3, "excellent": 238}, "aka": "Holiday Inn Express Berlin City Centre-West Hotel Berlin", "slim_ranking": 0.154422788606, "description": "Berlin's first brand new entirely non smoking hotel opened in 2008! The brand new Holiday Inn Express Hotel Berlin City Centre West is located in the center of Berlin only a few steps away from the famous boulevard Kurfuerstendamm, the well-known department store KaDeWe, the Kaiser-Wilhelm-Memorial Church, Berlin Zoo, Potsdamer Platz and Charlottenburg Castle. The worldfamous Alexanderplatz in Berlin Mitte, the Berlin Jewish Museum, the Berlin Wall, the Brandburg Gate, Berlin Unter den Linden, Friedrichstrasse , and Check Point Charlie are all within easy access. The Holiday Inn Express Hotel Berlin City Centre West offers 158 non smoking luxurious en suite air-conditioned bedrooms, each with flat screen colour TV with a variety of channels, modem point, High Speed Wi-Fi Internet Connectivity, hairdryer and tea and coffee making facilities. The Holiday Inn Express Hotel Berlin City Centre West is only two minutes from the InterContinental Hotel which hosts major events throughout the year. The Holiday Inn Express Berlin Hotel City Centre West offers affordable on-site car parking with direct access to reception and high-speed Wireless Internet access throughout the entire hotel. Stay Smart, the Holiday Inn Express Hotel Berlin City Centre West is expecting you!"}