{"user_rating": 5.0, "review_count": 138, "name": "Holiday Guest House Bed & Breakfast", "reviews": [{"rating": 5.0, "title": "What every B&B should be, but so few are", "text": "Holiday House is what you wish every B&B would be, but so few are. This B&B is charming and very comfortable, but the icing on the cake are Bill and Michael, who run it. As soon as you arrive, you witness the love and attention they put into making this B&B, and your stay there, a great experience. The grounds surrounding the house are immaculately landscaped with beautiful flower beds and pots. The walk to the office leads you to the breakfast room, which is a glass-enclosed porch, is pretty and inviting and filled with natural light. This is the room where had great breakfast each day we were there. Bill is the primary cook, and served up four different and great hot breakfasts each of the four mornings we were there, ranging from blueberry pancakes with sausage to eggs Benedict. As someone who is not a big breakfast eater, but more of a bagel and coffee guy, there was not only lighter fruit and banana/coffee cake options for me, but Bill ended up buying bagels and peanut butter so that I could have my usual favorite breakfast while my wife enjoyed each of the hot full breakfasts each day.", "user": "sccarlin", "date": "June 8, 2013", "id": 163347329}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Our room was beautifully decorated and very comfortable. The first rule of any B&B should be tat the bed and the breakfast are good. Holiday House was outstanding on both counts. The large queen bed was firm and very comfortable, especially for a guy my height, 6'6\". There was flat screen TV, a separate day-bed area and fireplace. Since we came to Maine to get out of the heat, we were able to sleep with the windows open (screens in place of course). What a treat.", "title": "The Best of the Best!", "user": "honeybunch04", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162351141}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This whole experience was made so special because of Bill and Michael. They obviously love what they do, work very hard to make your stay a great experience and accomplish that goal. They were friendly, engaging and helpful, giving us all kinds of good ideas for things to do. We recommend anyone going to this area, even if you are not a B&B person, stay here and experience what a great B&B should be.", "title": "The best hospitality and breakfast!", "user": "fourbeck13", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161730323}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I have just returned from my third visit to the Holiday Guest House. Every visit is better than the last if that is possible. Michael & Bill are very welcoming and they make you feel right at home. Each room is beautifully decorated and impeccably maintained. The location is perfect for taking long walks on a beautiful beach which is very close! The breakfasts are out of this world. The special plate of the day (which varies and is a work of art) is supplemented by home made coffee cakes and breads as well as fresh fruit, coffee, tea and juice. When you have breakfast in the beautiful enclosed sun room and you look at the lovely garden you feel so relaxed! The home made cookies on the dining table in the afternoon are an added treat not to be missed. There is no other place like the Holiday Guest House and I hope to return there again and again! Michael and Bill are the perfect hosts.", "title": "Great Visit To Wells Beach, Maine", "user": "BobHudson34667", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161587867}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Last summer, we traveled to USA for 3 weeks, and we spent some days in Holiday Guest House last summer. Everything was perfect! The hospitality by the two owners was unbelievable! The house, the rooms are very romantic, very clean!", "title": "Wonderful stay!", "user": "foxglove56", "date": "May 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160933380}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Hosts Bill & Michael are the most wonderful inn keepers. Breakfast is phenomenal, rooms beautiful with all the appointments, and super clean. Have stayed before four years ago, and will continue to return. Outstanding! A+", "title": "Unbelievable!", "helpfulness": 1, "user": "Baer09", "date": "September 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140634587}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I can't begin to write how fabulous this bed and breakfast is! Michael and Bill make you feel like part of their family. I have just returned from my second trip in two months to Wells Me. After such a wonderful experience with my husband i decided to make a weekend excursion with my teenagers. The Holiday Guest House is beautifully decorated with tasteful antiques and themed guest rooms. They are all cozy and clean. The common rooms are warm and inviting complete with freshly bakes cookies to nibble on! After awakening to the sounds of birds quietly chirping and a gentle water fountain bubbling softly, breakfast is served on their spacious enclosed porch. Bill and Michael greet you with a warm smile and coffee brewing offering an array of \"to die for \" goodies including homemade coffee cake, breads and fruit in addition to a full hot breakfast. Bill makes the most delicious homefries on the planet! The Holiday Guest House is a true gem.", "title": "What a true gem", "helpfulness": 1, "user": "Judi S", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140515591}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Upon our arrival we were greeted warmly by our inn keepers, Michael and Bill, who made us feel completely at ease throughout our visit. The Inn itself, built in 1814, is elegantly and tastefully decorated with art and objects appropriate to a charming 19th century home. We slept in the Mariner room and enjoyed a wonderful night's rest. The morning breakfast, blueberry pancakes, sausage and fresh fruit, was delicious. We enjoyed our stay very much and hope to return in the not too distant future.", "title": "A welcoming home away from home", "user": "Mej_12", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140261015}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Holiday Guest House is warm and inviting, with lovely comfortable rooms and spectacular breakfasts. Michael & Bill are fantastic hosts and make you feel right at home. We will definitely be going back, perhaps next spring!", "title": "Wonderful Labor Day Weekend!", "user": "Emily M", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139697689}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We had such an enjoyable, relaxing stay at the B&B. Michael and Bill (owners) couldn't do enough for you. Making us feel like family was a bonus. They were both so accomadating and entertaining. The breakfast every morning was to die for. Every morning was a different menu of fresh fruit ,baked goods and pancakes ,eggs or french toast. The room was very comfortable & clean and had everything you needed.", "title": "\"So Welcoming & Relaxing\"", "user": "BoopdivaPoughquag_NY", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138020440}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I badly needed to get away this fall due to health issues that precluded us from taking any vacation prior to that time. Fortunately, after studying bread and breakfasts in southern Maine that would not be too great a distance from our home, we chose the Holiday Guest House in Wells. How fortunate we were with our selection. The hosts, Michael and Bill, were more than gracious; our room was lovely and very comfortable; and the breakfasts were excellent. We also fell madly in love with their dog, Snickers. We could not have enjoyed a better stay anywhere else. The Holiday Guest House is excellent in every way, and we feel fortunate to have spent time there.", "title": "A BEAUTIFUL VISIT", "user": "Charlotte E", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147822325}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "Char and Charles Edson", "title": "First time in Maine", "user": "Kathy B", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146797997}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I had a such a peaceful and relaxing stay at the inn the innkeepers Michael and Bill the rooms are absolutely spotless their dog snickers is an absolute doll the breakfasts are unbelievably delicious from eggs benedict to the fruited french toast can't wait to come back in the spring", "title": "Charm & Hospitality Abound", "user": "Don B", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143713841}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We have stayed at numerous B&B's on our New England adventure but none compare to the intimate charm and warmth offered by both the Holiday Guest House and our wonderful hosts, Michael & Bill. The quaintness of our room and the common areas are what anyone would expect when staying in a New England Bed & Breakfast. And, speaking of breakfast, it was of top culinary style and quality. Bill prepared eggs benedict perfectly; the hollindase sauce was to die for. As much as the accomodations speak for themeselves, it really is Bill and Michael's personal touch and attention to their guests (and, of course, Snickers, their exceptionally cute dachshound) that set this B&B above others. 5+ Stars.", "title": "It's like staying with old friends!", "user": "ClarMom", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142252395}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Excellent on all accounts. Hosts Bill & Michael were helpful, friendly, professional and perfect hosts! We stayed 5 nights and were never disappointed. Unbelievable breakfasts every morning with fresh baked coffee cakes and breads, mouthwatering blueberry pancakes, eggs benedict with fantastic homefries, waffles with homemade whipped cream!! Our room was very clean and comfortable. Fresh baked cookies every day in the dining room were irresistible. Thanks Bill & Michael for making our anniversary trip one we will never forget!!", "title": "A perfect B&B", "helpfulness": 2, "user": "Leslie M", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140634854}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Owners Michael and Bill made us feel very welcome and at home from the moment of our arrival. We loved the colonial atmosphere and the period furnishings were great. Our bed was extremely comfortable with two pillow options provided and everything seemed immaculately clean. Breakfast on the sun porch of blueberry pancakes, sausages, and fresh fruit was beautifully presented, and we thoroughly enjoyed listening to the water fountain while we ate and watching the birds come to the feeders right outside where they were placed amidst a lovely flower garden. Access to Ogunquit, restaurants, shopping and the beach were excellent and Michael and Bill were generous in their recommendations. In short, our stay offered all you would hope for in a B&B - we only wish it could have been longer!", "title": "A brief but wonderful stay", "user": "Mimmer2", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137920358}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My wife and I stayed at the Holiday Guest House on a weekend visit to the Wells area for a wedding. As we alked in we were greeted by Michael and bill,the owners, who were and remain the Gracious Owners. The inn is beautifully decorated on the first floor and our room was perfect. The breakfasts the next two mornings were delicious with fresh fruit, breads and waffles or eggs, depending on the day. Not being and egg-guy, they were kind enough to fix an alternative for me that was perfect. This is just a very enjoyable retreat where you can relax and take a break from the craziness of your daily life. We plan to return in the future.", "title": "A Wonderful Stay - Gracious Owners", "user": "nlbergie", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137734003}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We were welcomed like family to the B&B by Michael & Bill. They both immediately dropped everything to welcome us & help carry bags to our beautiful room. The chocolate chip cookies were to die for! They provided a great amount of information which was very helpful to first time visitors to the area. The decor was breathtaking. Beautiful gardens and landscaping. The breakfast was well above anything we ever expected. Absolutely delicious. Our only regret is that we couldn't stay longer. We hated to leave. We will definitely be returning in the near future. I would highly recommend their B&B to anyone. Another bonus was meeting Mr. Snickers (their Dacshund)who has quite a strong personality & was extremely friendly and entertaining. Michael & Bill were excellent hosts and very entertaining. It's obvious that they enjoy what their doing. We can't wait to return!", "title": "Last Minute Stop Over", "user": "Ruth M", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137575007}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I surprised my husband for his birthday by using our credit card points and taking him away to Maine for the night. We arrived and were greeted with wine, cheese and fresh baked chocolate chip cookies (a pregnant woman's wish). They then showed us around and made a dinner reservation for us at a local Italian place, allowing us to by pass the long wait at the restaurant and serving us a GREAT meal. My only regret was that we could stay only one night. Great hosts, great accommodations and great food! We would love to get back for another visit.", "title": "Excellent night away!", "user": "Christina F", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137189274}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "If you're looking for a colonial feel while vacationing in New England this is an excellent choice. Michael and Bill were fantastic hosts and supplied us with superb local information while adding more than a touch of humour. The decor was jaw dropping and the location superb. Our outdoor adventure was somewhat limited by an evening rainstorm, but in all honesty we didn't mind. It gave us more time to soak up the atmosphere of the room and the home. The breakfast was also to die for. Thank you gentlemen, we hope to be back some day!", "title": "Colonial escape!", "helpfulness": 1, "user": "Mike H", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137092677}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 138}, "aka": "Holiday Guest House Bed & Breakfast Wells, Maine", "slim_ranking": 0.2, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Enjoy your visit to Maine in a 19th century guest house full of tradition & elegance. Holiday Guest House, built in 1814, has a long distinguished history of offering travelers exceptional accommodations and convenience to all of southern Maine's attractions. All of our rooms are clean, spacious and offer Private Baths, a/c, CCTV, Ceiling Fans, Mini Fridge, Iron/Ironing Board, Luxurious Bedding and furnishings. Every morning you'll be served a full, home cooked, Delicious Breakfast in our breakfast porch. Whether your vacation includes lying on the beach, fishing, antiquing, restaurants, or night life. Holiday Guest House is centrally located to enjoy them all. We are a short walk or trolley ride to the beach, Perkins cove, and Ogunquit village."}