{"user_rating": 4.5, "review_count": 545, "name": "Hollmann Beletage", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "POSITIVE:", "title": "Nice but overrated and inflexible", "helpfulness": 1, "user": "dgor82", "date": "January 26, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150651923}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "- Nice design", "title": "nice but..", "user": "MirkaF", "date": "January 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 150537947}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "- Very nice staff", "title": "Really enjoyed this", "helpfulness": 3, "user": "EuroLondon", "date": "January 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150121800}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "- Individually prepared breakfast, delicious egg dishes", "title": "Very cool!", "helpfulness": 2, "user": "Cryte", "date": "January 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 149819406}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "- Perfect location", "title": "Great Boutique Hotel in a great location", "helpfulness": 2, "user": "shanno09", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 149057524}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Great location, great rooms, great staff and brilliant breakfast. Couples, singles and business people will love this hotel. I would definitely return here next time I am in Vienna. The modern decor and friendly staff make for a great stay.", "title": "Simply outstanding", "helpfulness": 1, "user": "PeterJamesL", "date": "February 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151993544}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Just returned from our 12 day stay at this glorious little gem. Really pleased on our hotel choice which can make or break any vacation. Let me start by saying that home away from home is a accurate description. The staff could not have been nicer and more helpful from reserving for dinners & lunches, Orchestra tickets, manicures, buckets of ice (we americans love our frozen water) right down to Andrea purchasing a hair flat iron/ curling Iron for me so I did not need to worry about bringing one from home. Every detail and request was met with a sincere desire to help us with whatever our needs were. All of the ladies and gentlemen that were attending the desk were simply lovely. Joseph the chef made us the most amazing surprises for breakfasts and little treats and even came to our room very early on the morning of our departure to bring us a nice picnic lunch for us to take with us. How thoughtful! The lovely girls in the dining would happily bring to our room wonderful coffee and croissants on the mornings that we just moving slow and not in need of a full breakfast. Housekeeping was very kind and patient on the days that we were slow on getting out for the day or days that we just stayed in to read and relax. With our stay be a long one we were guided on what would be the best room to suit us (#5) was perfect, nice view, very spacious, huge closets, separate couch area for my husband the night owl to read without disturbing my slumber. the only minor thing with that room that some may want to consider is that it is directly off of the living room lounge area and at some time in the morning you could hear the kitchen/dining going on. For us that location was not an issue and actually we found it very convenient to just open the door and hang our by the little fireplace and sip a nice drink from the honor bar and also to skip easily into the kitchen for that extra coffee serving or juice. Location, we walked everyday, everywhere and it was perfectly located for visiting all of the sights, restaurants, shopping all just outside the door. Directly across is a small grocer which was terrific for picking up snacks, wine ect. Value galore! We usually splurge on our trips and tend to go for 4 star plus hotels, this had the 5 star experience for us at 1/2 of what we normally spend. The interesting details in decor are fun,whimsical and very easy to feel comfortable and relax without the stuffy feeling that have had at other European hotels that we have stayed at. I read somewhere the towels are a little crunchy, I am all in favor of eco savings for quick dry towels and the nice robe and slippers made up for that silly little thing some may find less than perfect. Don't think twice if you enjoy boutique/funky hotels in fantastic location with just the perfect amount of twistedness that i find charming. thanks to all of you at the Hollmann Beletage for making our stay a very memorable one! We shall be back for sure!", "title": "Fantastic choice", "helpfulness": 3, "user": "Ellen H", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151636057}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Thank you Hollmann Bellage. All staff members were very attentive, friendly, smiling and helpful. The hotel had a very cozy, warm and welcoming feel. We felt at home and welcomed. Loved the hotel the location... in a non assuming but convenient part of the old city. It was so easy to get to everything. You helped make our first trip to beautiful Vienna even more amazing. Well done and keep up the great work.", "title": "Wonderful hotel - friendly, great value and well located", "helpfulness": 1, "user": "Seetheworld8_13", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151633999}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I had absolutely incredible time with my two sons then I travelled to Vienna and stayed in this remarkable hotel in December 2012! Surrounded by the historic buildings of Vienna's inner city, the Hollmann Beletage is a small boutique hotel offering modern convenience and elegance in an exceptionally central location!!! Everything sparkled there including smiling staff who was working there and the cleanliness of the hotel. Fantastic location, excellent service and the best room I have ever had! It was a huge, very posh, hight selling, beautiful queen's size bed with lots of soft cushions, fantastic bath and spa room and a useful kitchen!!! We didn't really use the kitchen, but it was nice to have a coffee in the room when we want it without needing to go out. We had a breakfast in our room. Two beautiful ladies, wearing national austrian dresses, brought it to us. We could choose everything we want. Everything was very fresh and testy and it was more than enough. I felt like a queen there! We could also use an ipad which was very useful for my boys and myself. I will highly recommend this hotel and the Luxury Suite! Many thanks for making my sons and me feel like royalty! Anya Switzerland", "title": "The best glamour Luxury Suite I have ever stayed!!!", "helpfulness": 1, "user": "Anya F", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151409509}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our family of 5 stayed here for 3 days over Christmas 2012 based on TA reviews. It was everything stated and more and certainly our favourite hotel on our 1 month European vacation. Andrea at Reception was the friendliest and nicest receptionist we have ever encountered.", "title": "Home away from home!", "helpfulness": 3, "user": "Melb5", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150995719}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "We stayed just one night in this boutique property. I got a \"Spa Suite\" which was about 95 square meters in floor area, complete with a private steam sauna! High ceilings, luxury accessories and toiletries, four poster bed, the list goes on ... Very importantly, the bed was firm and comfortable.", "title": "Excellent boutique hotel in the heart of Vienna", "helpfulness": 2, "user": "SingaporeGuy10", "date": "March 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155832415}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Location of the hotel is excellent - within the 1st district in the city centre.", "title": "Hotel with a heart", "helpfulness": 1, "user": "Fresiandaniels", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154733837}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The hotel staff are excellent and super friendly. Andrea and Alexander will make your stay as pleasant as possible.", "title": "Unique, comfortable, and one of a kind", "helpfulness": 2, "user": "Pysiu", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154078328}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Breakfast was a little spartan compared to some of the other hotels I have stayed in Vienna (eg Rathaus, Intercontinental and Le Meridien). However, their apple strudel and eggs were very tasty and well done.", "title": "my best birthday surprise", "helpfulness": 2, "user": "terike", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152053418}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I could make this easy for us all and say - just GO!", "title": "definitely no. 1 choice in Vienna", "helpfulness": 3, "user": "Hcslovanka1818", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152027043}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "A little quirky (bed in middle of the room) but it worked. Breakfasts superb. We stayed for 7 nights and this would definitely be my choice if I was to visit Vienna again. Location convenient but quiet on the whole. Things they could have done better: need real blackout blinds as there was restaurant with bright lights (on all night) immediately opposite and I don't much like sleeping with airline shades on; a large bottle of free water would have been appreciated as well as long flights dehydrate, though if you don't arrive on Sunday there is a very convenient and extensive SPAR just across the road. However very few hotels get both of these right.", "title": "Friendly, relaxing, an easy place to stay", "helpfulness": 2, "user": "mdot1", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149035691}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed here on New Year's Day for one night and wish it had been for longer. This is a beautful, modern boutique hotel. The room was superb with every convenience you could wish for. The complimentary refreshments (including sparkling wine) at 2pm were an added and much welcome bonus.", "title": "A beautiful boutique hotel", "helpfulness": 2, "user": "MaisieM1", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148998276}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband considers the breakfast to be worth the room rate alone!!", "title": "Amazing and incredibly home stay", "helpfulness": 1, "user": "SunmanRU", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148513433}, {"rating": 4.0, "title": "Modern in a classic place", "text": "Everything in hotel will help you to feel you comfortable and at home. For sure you will remember your stay here as it so comfortable. Hotel is so close to all interesting places of old town.", "helpfulness": 1, "user": "JGalviz", "date": "December 29, 2012", "id": 148260441}, {"rating": 4.0, "title": "Excellent breakfasts", "text": "And also tram stop to have a round tour of Vienna also 200 m away.", "user": "Mosquito Magnet T", "date": "December 22, 2012", "id": 147897394}], "location": {"country": "Austria", "continent": "Europe"}, "stars": 4, "variance": {"poor": 6, "average": 8, "very good": 102, "terrible": 3, "excellent": 426}, "aka": "Hollmann Beletage - Design & Boutique Hotel Vienna", "slim_ranking": 0.00544959128065, "description": "Boutique hotel, design refuge, living room for globetrotters and the pampered jetsetters: the Hollmann Beletage is all this and much more – a Viennese jewel in the truest sense of the word."}