{"user_rating": 4.0, "review_count": 1166, "name": "Hollywood Celebrity Hotel", "reviews": [{"rating": 4.0, "title": "Great location and a very nice hotel", "text": "We thought this hotel was really good value for money. The location of this hotel is brilliant, withing walking distance of all the main attactions including the Hollywood Bowl. The hotel was decorated to a high standard and the celebrity themes in the rooms were fun. We were upgraded when we arrived to a suite with 2 large rooms and a great kitchenette, probably the best room we stayed in during our 11 hotel west coast tour. We would definutly revisit this hotel as it was a great base to explore Hollywood. Also there was free parking included.", "user": "happymeghappy", "date": "November 8, 2006", "id": 6085713}, {"rating": 5.0, "title": "Sparkling clean hotel", "text": "This is a wonderful hotel! I stayed here, with my girlfriend, for one night in the beginning of October and was very impressed with the location, service, and cleanliness of the hotel. It is small, charming, and has character. WiFi, parking, and a limited continental breakfast (juice, coffee, tea, and breakfast breads) are included in the room rate. I will definitely be back to this hotel in the future and am recommending it to all my friends, acquaintances, and co-workers.", "user": "rbeeson", "date": "October 23, 2006", "id": 5985405}, {"rating": 4.0, "title": "good hotel but noisy", "text": "This is a good hotel, clean, big room, close to hollywood boulevard (1 mn walk ) and universal studios (5 mn with the subway), safe area, free parking, free breakfast (simple but with good muffins), nice restaurant nearby, almost perfect! The only problem was the noise inside the hotel, badly soundproofed.", "user": "chrystelle", "date": "October 17, 2006", "id": 5963583}, {"rating": 3.0, "title": "Excellent Location!!", "text": "Ask for a room upstairs.", "user": "maurice1123", "date": "October 16, 2006", "id": 5962564}, {"rating": 5.0, "title": "Great hotel", "text": "This a small clean hotel. Location is superb! if you want to experience Hollywood - walking disance to major attractions (Kodak theatre, walk of fame, restaurants, etc. and 5 minute car ride to Universal Studio. This is a small hotel, staff is pleasant and polite, rooms are cleaned.", "user": "PriyaSatish", "date": "October 14, 2006", "id": 5951305}, {"rating": 5.0, "title": "What a little gem!", "text": "This is a great place to stay!", "user": "AnnaLucy", "date": "August 18, 2006", "id": 5624913}, {"rating": 4.0, "title": "Such a brilliant location", "text": "This hotels location is fantastic, the staff are delightful and the rooms are superb. Need I say more?", "user": "anne2606", "date": "August 17, 2006", "id": 5619932}, {"rating": 5.0, "title": "Truly great place to stay!", "text": "Our two bedrooms suite with kitchenette was big and welcoming . The bathroom looked very worn but it was perfectly clean so we didn't really mind .", "user": "Henrik22", "date": "August 12, 2006", "id": 5602900}, {"rating": 2.0, "title": "Great price, close to stuff but a little spooky.", "text": "The man at front desk was really nice and helpful every time that we asked for information .", "user": "Talofa", "date": "August 8, 2006", "id": 5576071}, {"rating": 5.0, "title": "What a gem of a hotel", "text": "Breakfast was really bad : food consisted of three trays of unfrozen but still cold croissants, bagels and muffins . And be aware that breakfast is only served from 8a.m. onwards . At least theoretically, because on two out of the tree days that we spent here there was a note on the breakfast table in the morning to warn clients that breakfast would be at 8:10 . So if you plan to leave early or if you are awake with jetlag, forget about the hotel breakfast .", "user": "travkay", "date": "August 6, 2006", "id": 5562204}, {"rating": 3.0, "title": "Great location, good value - Irish couple", "text": "Stayed here @ start of 3 week tour of California/Nevada & New York following reviews on Tripadvisor. Great location, free parking available, though we didn't pick up our rental car til leaving LA. Good clean accommodation, complimentary breakfast but basis, bagels/muffins/crossants, need to bring back to your room (table & chairs provided & fridge) as no room to sit in lobby. Room a bit on dark side. Next door to Kodak Theatre, walk of fame etc.", "user": "jgoldenoldie", "date": "October 12, 2006", "id": 5945961}, {"rating": 4.0, "title": "great location", "text": "Location is perfect. In a quiet street just behind the Kodak theatre, Hollywood/Highland Mall and the metro station. Our room was an executive Queen and had plenty of room. The room was equiped with a fridge (not stocked) and microwave. Coffee was available at any time in the lobby. I would recommend this hotel for those wanting to be very close to the Hollywood sights and to train/bus if you don't have a car.", "user": "boxer_aussie", "date": "October 12, 2006", "id": 5944454}, {"rating": 5.0, "title": "Good reason for all these great reviews", "text": "Celebrity Hotel was brilliant. The rooms were huge (the bed was a kingsize!!) and had everything that we required – iron, hairdryers, fridge, plenty of towels, soap etc. The internet was free which was great as you could look up and book tours, attractions etc. The staff at the desk were lovely - cheerful, friendly and helpful. The breakfast every morning was great as was the constant supply of hot coffee. We had an issue with our toilet blocking and the staff were very apologetic about it and had maintenance there within 5 mins. The location couldn’t be better – you are on a quiet side street but you walk 50mtres to the back entrance of the mall which is on Hollywood Boulevard and has Kodak theatre, Chinese theatre, tour buses and heaps of restaurants/food outlets. The metro stop is also under this mall. When we checked out we asked if they could store our bags for the day as we weren't flying out of LA until 9pm - no problem. When returned to pick up our bags on the way to the airport they were even happy for us to grab a quick shower in the fitness room. By far the best accommodation on our entire trip (france, Portugal, spain, Amsterdam). Would definitely stay there again.", "user": "Waipa", "date": "October 11, 2006", "id": 5944074}, {"rating": 4.0, "title": "Just perfect", "text": "Nice, clean hotel in perfect location. Staff very polite, friendly, helpfull.We had everything we needed; hairdryer, iron, toiletries, breakfast and coffee.", "user": "pol006", "date": "October 8, 2006", "id": 5927292}, {"rating": 4.0, "title": "Close And Clean", "text": "Great place to stay to visit LA by day and grab some dinner close by without having to drive at night.", "user": "ROOMVITHAVIEW1", "date": "October 4, 2006", "id": 5908268}, {"rating": 1.0, "title": "A Good Experience Gone Bad.", "text": "I'd like to say that first impressions are important, and sadly the first impression at this Hotel was not as we might have hopped for. Upon arriving, at 10pm PST, my wife and I were informed that our room would be located directly adjacent to the entrance of the hotel. But we were assured that the sleeping quarters were near the back of the room and that the noise of people entering and exiting would hardly be heard if we noticed at all.", "user": "losbarbour", "date": "September 29, 2006", "id": 5890287}, {"rating": 5.0, "title": "A perfect find!", "text": "I could not help but notice that the door to our room was slightly blocked by the service door to an employee basement (service area). The clerk was very friendly, this did help. We entered the room; it was spacious, clean and sadly reeked of natural gas.", "user": "amy999", "date": "September 20, 2006", "id": 5818686}, {"rating": 4.0, "title": "The hotel was a great find", "text": "I am not a paranoid person, being a former employee of a restaurant that used natural gas I immediately knew the odor. My wife and I asked if we could have a new room. The clerk, who was very friendly, sadly informed us they were sold out for the night. After I informed him of our problem, he first attempted to turn the oven, off himself instead of calling someone in.", "user": "Dianne8868", "date": "September 8, 2006", "id": 5782269}, {"rating": 4.0, "title": "All you could need in a hotel", "text": "I had to inform him hours later that his plan did not work. The clerk said at that point that he would have maintenance look at in the morning. We shared an awkward moment of silence, then I asked if they had a sister hotel were we could stay instead. I was told there was, I was refunded for the night at this hotel and charged for the night at the sister motel which was located at the end of the same block. The entire exchange took until 1am. Both clerks at both Hotels were friendly but neither offered more than verbal compensation for my displacement or troubles. I was happy they were both sorry for my trouble, but I would rather have been sleeping rather then trying to work out how to solve their gas leak issues at 1am, and then trying to find a place for my wife and I to sleep for the night.", "user": "4MR", "date": "August 23, 2006", "id": 5701006}, {"rating": 5.0, "title": "Perfect Place to Stay!!!", "text": "We were actually quite lucky I knew of the problem, the dumfound clerk had no such experience with natural gas and had asked that we just sleep in the room anyway. Granted he suggested we leave a window open, and even that we put a fan near the window. But if we had done so we may have gotten deathly ill or worse. What I do know of natural gas is from Avista. Avista (a power company in Washington state) has told its customers that if you smell natural gas, GET OUT! And stay out until their technicians can look at the problem. Not go inside your house and sleep on it until maintenance can look at it in the morning, oh and put a fan in the window.", "user": "Rocker_rep", "date": "August 22, 2006", "id": 5688184}], "location": {}, "stars": 2, "variance": {"poor": 31, "average": 154, "very good": 528, "terrible": 26, "excellent": 427}, "aka": "Hollywood Celebrity Los Angeles", "slim_ranking": 0.0865384615385, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "The Hollywood Celebrity Hotel is a superior tourist class hotel located in the heart of downtown Hollywood, the entertainment capital and theatre district. The Hollywood Celebrity Hotel offers the glamour of the 1930s with the intimacy of a bed and breakfast inn. Guest rooms are dramatically decorated to reflect back on the celebrities of the 1930's featuring murals of some of the Hollywood greatest loved stars over the beds, and brightly colored furnishings. The hotel is minutes to fine dining, shopping and entertainment."}