{"user_rating": 2.5, "review_count": 78, "name": "Holloway Motel", "reviews": [{"rating": 3.0, "title": "WHAT'S ALL THE MADNESS ABOUT? OVERBLOWN NASTY REVIEWS?", "text": "We come from Palm Springs and stay at the Holloway at least once every two months and have been for the last 10 years.I can't believe some of the reviews! Wow what a bunch of unhappy, frustrated people. Then go stay at a five star place and see what you get. You probally won't be happy there either. Most of these review are way over blown. The Hollway is no where near as badd as some of the unhappy people claim. Its a clean, quiet, great location, great rate ,small MOTEL. From my observation, customers make their own problems. not paying for all the guests staying in a room, drunk, noisy , smoking in room etc. The management does not put up with any of the type of behavior.. I wonder what the agenda is from these writers? I believe these folks", "user": "happygolucky60", "date": "October 1, 2010", "id": 81763724}, {"rating": 1.0, "title": "WHAT A DUMP !!", "text": "have been told to leave etc for beings fools ie: smoking in room, partying, loud, to many in room and this is their way to get back. many people think, \"oh rent a motel room...let's party.\"...get kicked out...then write a nasty review. Hopefully these people will go else where and leave the place to us........happy trails, see y\"all", "user": "traveljunki039", "date": "September 13, 2010", "id": 79354267}, {"rating": 1.0, "title": "Bad Attitude", "text": "If you want to stay in the third ring of Hell this is the place. The staff are as NASTY as the rooms. If you use the bath or shower wear boots it's SOOO Gross Go to the Ramada down the street for just a bit more $$ you get a LOT more motel. I think the staff just got released form the nut house. Enjoy West Hollywood but not from this DUMP. Peace, Lloyd.", "user": "CaliGuy27", "date": "September 8, 2010", "id": 78852791}, {"rating": 2.0, "title": "very very basic", "text": "I recently put up a business associate at this hotel for over a week and it didn't work out. The phone in the room didn't work, the cleaning staff kept turning off the AC when the guest was at work (the guest kept returning to a muggy room), and several times this person's key didn't work at the end of a long work day. A knock on a clerk or maintenance person's door solved the problem a few times, but one night nobody answered and the business associate had to go stay with a local friend.", "user": "kentgear", "date": "September 8, 2010", "id": 78813100}, {"rating": 1.0, "title": "You get what you pay for", "text": "The owner/manager said he'd review the tape to see if that indeed happened and would credit one night if the tapes proved she tried to find somebody on property but couldn't. So, after check out, I called back and asked if he had reviewed the tape.", "user": "hotee", "date": "August 30, 2010", "id": 77428501}, {"rating": 1.0, "title": "please stay away from this place", "text": "I made a reservation for one room at this motel for one night.I got there that night and the office was close.I left the motel and i rent one room to an other hotel close to this one .When i receve my credit card statment i realize that i was charged $91 from Halloway motel for that night.When i called to talk to the manager to tell him that i did not stay at his place but i was charged for that night this guy asked me to call him back for him to verify .I called him back after one week and he started to yell at me, call me liar and when a told him that i am going to make a complain he threatening me saying that he is coming to my home town and KILL ME,that he knows my phone nr.and my address, he call me all kind of ,,names,, and he used all kind of realy bad language i can \"t even can tell you what was coming from his mouth .Believe this guy is a freak,very dangeros crazy and he should not be in this business.Please stay away from this place .My big mistake it was that i did not read the bad reviews before i call to make that reservation.I am happy that i did not stay there ,PLEASE STAY AWAY FROM THAT PLACE IT IS SCARY ......", "user": "ciprian s", "date": "August 18, 2011", "id": 116877998}, {"rating": 1.0, "title": "Better service from the homeless man on the corner", "text": "Stay here only if you want to be treated like a complete hassle, not a customer. After being called an \"ignorant moron\" by the manager after having to call her out on her SECOND over billing, we were hung up on. Who is in charge over there, I'm not sure anyone knows. I can just say this... This is the worst motel I've ever experienced. Talk about everyday being a bad day in that house of gloom! I thought this was Hollywood! You'd be better served to stab yourself continuously in the eye, less painful.", "user": "rachdean76", "date": "June 9, 2011", "id": 112504685}, {"rating": 3.0, "title": "Good clean comfortable room which met my needs", "text": "I stayed here while they were working on my place and was satisfied with the room which I found to be clean and with everything there in working order. The location is convenient and given the area, the price for what you get is fair (I paid $91.14 including all taxes for a single night's stay with two (2) guests).. Two of their rooms are studios with kitchenettes but I did not stay in one of these as my room was just a basic motel room. My only nits were that the floor of my 2nd floor room had creaky floorboards which meant that the occupant below may have heard me walking about. Secondly, their optional WI-FI Internet which you had to pay extra for was a tad on the slow side (and my room was by the office!). My third minor issue is that ,despite what the amenities page of their website states about offering a free complimentary continental Breakfast , - They do NOT!!! Other than that minor disappointment, I was okay with the place and wold recommend it for someone looking for a decent, basic safe, clean motel to sleep in a rather expensive area.", "user": "Chester_Paul_Sgroi", "date": "May 23, 2011", "id": 109438330}, {"rating": 1.0, "title": "Verbally attacked, insulted, over charged!!!! Stay away!!", "text": "We stayed here for a friends birthday. When we got to the room it was very shabby put we put that at the back of our minds because we were plannig on clubbing andbarely being in the room. We returned to the room early by west hollywood standards. Around 1 am I went outside to smoke a cigarette with my bf and the person in the next room came out. My bf asked how's your night going? The man replied great except the people in the next room are being louso im goof to I.h.o.p. to get something to eat and hopefully when I return things will be calmed down... I was shocked! I don't drink and am very repectful I was raised right so I can honestly say that noone was being loud. Everyone was actually watching a movie because we were just pooped from a night of dancing. So we went to bed. Around 7am we were awoken by someone entering the room it was the maid who then slammed the door without an apology. We went back to sleep. We got andgot dressed and. By 10:45 I was pulling up mypants on the phone with a friend. The scary manager person bursted into the room screaming get the Fu@k out. Check out is at 11!! I looked at myphone being to scared and shocked to be embarresed that I was half dressed.. neways I looked at my phone and said it was 10:45.. he replied I don't give a flying fu@k! It smells like weed im calling the cops! \"We don't smoke weed!\" We left and my friends credit card was charged for the original 80-90 dollars but then there was another charge for 120 dollars!! And today a week later my friend was charged another 80 dollars! He called to ask why. And the person said that a police report was filed sayingthat my boyfriend and I verbally assaulted the guest next door! Noone should e treated this way and all this beasts accusations are false and someone needs to take ation against this unprofessional motel/ manager. Help!!! Stay away from here!!", "user": "arane1307", "date": "May 18, 2011", "id": 108866734}, {"rating": 4.0, "title": "Good Value, Nice Room, Super Location", "text": "I think the rather tired \"Holloway Motel\" sign in front of the property doesn't do justice to the quality of the room you get. There was really nothing wrong with my room and for the price I paid I thought this was a great value. Parking is free. If you want to stay in West Hollywood without all the sham-glam of Sunset Boulevard and the plastic people who hang out at most of those places, this is a terrific and pragmatic choice.", "user": "DALBoston", "date": "December 30, 2010", "id": 91067152}, {"rating": 1.0, "title": "Awful, stay away from this dump!", "text": "Rude staff, no security, couple opened our door with a key to a different room and said sorry wrong room, complained to staff, couldn't care less. Just don't stay here, plenty of better places, a DUMP!", "user": "helenm2331", "date": "April 21, 2012", "id": 128257788}, {"rating": 1.0, "title": "WHAT A DUMP !!!!", "text": "If you want to stay in a sewer you have the perfect place. Insane Management, Rude, and not guest oriented. Room Smelled and had Bedbugs. If you shower wear your shoes. I have seen cleaner alleys. You might as well hand your money to a homeless person, at least they will not treat you like dirt. Be warned.. Jeff", "user": "traveljunki039", "date": "February 24, 2012", "id": 125131738}, {"rating": 1.0, "title": "Worse than terrible", "text": "Very simple STAY AWAY", "user": "G P", "date": "December 30, 2011", "id": 122294123}, {"rating": 3.0, "title": "Not Bad for the Price!", "text": "Filthy place, rude manager and staff and the smell. I wonder what died there.", "user": "Larry P", "date": "September 29, 2011", "id": 118763567}, {"rating": 1.0, "title": "DO NOT STAY HERE", "text": "Not worth my effects to say more TRUST ME STAY FAR FAR AWAY!!!!", "user": "faran_c", "date": "September 2, 2011", "id": 117591539}, {"rating": 1.0, "title": "DO NOT STAY AT THIS HOTEL", "text": "I made a reservation by telephone from Paris, France a month before going to Los Angeles. When i finnaly got there the manager cancelled my reservation. He is just a complete freak. Do not stay there if you want to be safe. I asked him to see a room before being charged on my credit card and he started acting crazy..asking me why i wanted to see the place...and that if i wanted to see the room he would canceled the reservation. and thats what he actually did...i then left and came back ten minutes later thinking that he would have changed his mind...but he acted even crazier...he is in deep psychological troubles and i would advise people NOT TO STAY there if they want to be safe... this guy is just a freak. i am glad i didnt stay at this motel", "user": "pico_italiano", "date": "August 19, 2010", "id": 75867209}, {"rating": 1.0, "title": "Do NOt STAY at the HOLLOWAY MOTEL", "text": "The Holloway Motel seemed to be a great deal-great location/good price. However, when I arrived(after being terrified by driving in LA), I was treated to a strange welcome by the desk clerk. I accidentally entered the parking lot by the exit and the clerk screamed at me like a person with psychotic anger. When I mentioned that his welcome was \"unorthodox\", he responded that he was going to cancel my reservation immediately. He claimed to be an \"owner\". I was shocked beyond belief. After he calmed down and I was apologetic(8pm at night, not wanting to lose the res.), he decided to let me stay and changed my rate to $60 (from $70). The room was clean, but the rugs were old as the hills. The air-conditioning did not work. Think of the comforts of home at the BATES MOTEL and you can picture this motel. The only problem is that it has an incredible location near La Sienaga and it was on Santa Monica Blvd. I wish that I had had a different experience. Frank Raffa (frankraffa@aol.com)", "user": "FRANKRAFFA", "date": "July 8, 2010", "id": 70213532}, {"rating": 3.0, "title": "Great Hotel!!! Horrid Service!!!", "text": "I used to LOVE staying at this hotel. I've been there at least three times in the last 6 months to visit a friend in the west hollywood area. The rooms are modest but cute, and its right int the middle of all the nightlife. For the most part the staff have been ok although never very friendly. However, at the end of the my last trip I was furious!!! I had gone and shared a room with a friend (one friend) and upon leaving my friend who lives in west hollywood came to take us to brunch, while he was waiting for me to open the door the manager made a rude remark that I wont repeat toward my friend. Then upon checking out he tried to charge me for having more than two people staying in the room when there wasn't. I completely understand he has a job to do and the right to ask questions, but he could be much more professional about the way he speaks to his guests, especially one who is there as often as I am. I'm really sad to say I don't think I will be going back to this hotel that I have stayed at many times and sent a lot of friends to on their trips to los angeles. I would rather pay a little bit more for a more professional staff.", "user": "19tazer89", "date": "April 5, 2010", "id": 60450863}, {"rating": 1.0, "title": "Downright frightening", "text": "The first clue should have been that, when you check in, the manager deals with you through a bullet-proof glass window as you stand, effectively, on the walkway (there is no \"lobby\"). But the location was within walking distance to family I was visiting, and the price was low, so I checked in. I didn't mind the \"exposure\" at first. All doors to rooms open to the exterior of the building (like any motel), on two levels. Since it's in the middle of the city, with homeless people sleeping on sidewalks nearby, some of the people outside your room in the middle of the night can be concerning. There's just a door and a window between you and them. The cloth curtain that separates you from them at night is so thin that people can easily see you in your room, through the cloth, if your lights are on at night (which is especially concerning if you're staying in a room on the street level). So, no \"reading in bed\" - - if you want privacy from the public, you have to be totally \"lights out!\" By the same token, during the daytime, I could have my curtain closed and still see (through the cloth) the cars parked outside my room. That night, all hell broke loose. The couple in the room above mine had some kind of a drunken or drugged-up rage around midnight, with the man screaming obscinities and threats at a woman, and the woman crying and obviously fearful. It eventually calmed down and I went to sleep, only to be awakened at 1:30 AM with someone pounding forcefully on their door (again, immediately above my room, which was on street level). The girl was then yelling for her male partner (the one who had been in the abusive rage) telling him not to open the door to whoever was doing the pounding. The pounding lead to talking through the door for awhile (at full voice, as if in the midde of the day), and then there was talking inside the room. No sound-proofing, obviously. There was no way anyone in nearby rooms could have slept through it. I guess we were all cowering in our rooms, hoping to be \"invisible.\" Meanwhile, where was management? Nowhere to be found. The bullet-proof glass window had a sign saying \"CLOSED.\" I know any hotel can have guests who turn out to be a big problem, but management should be the first to take action when this kind of thing happens. The first thing next morning, I checked out and moved to a regular hotel. I don't require \"luxury\" in a hotel . . . but peacefullness, and a feeling of basic safety, are pretty important.", "user": "traveler469", "date": "January 20, 2010", "id": 53909216}, {"rating": 3.0, "title": "Great location but no breakfast!", "text": "We stayed here as it was close to Barney's Beanery and other Jim Morrison attractions. Very limited car parks. I also booked at this motel as breakfast was included but the only thing we got was coffee! Location and price great other then that the service was fairly average.", "user": "KiwiKaren", "date": "August 31, 2009", "id": 39289974}], "location": {}, "variance": {"poor": 13, "average": 15, "very good": 10, "terrible": 31, "excellent": 9}, "aka": "Holloway Hotel", "slim_ranking": 0.941176470588, "detail_rating": {"service": 2.0, "cleanliness": 2.5, "value": 2.0, "sleep": 3.0, "rooms": 2.5, "location": 4.0}}