{"user_rating": 4.5, "review_count": 366, "name": "Holua Resort at The Mauna Loa Village", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Our second stay on the BI with now three condos, a hotel and a B&B the Holua Resort is still our favourite!!!", "title": "Great Again", "helpfulness": 13, "user": "LikenDSun", "date": "October 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3986044}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "There were four of us aged 35 (me), 38, 60, 58 and 2 and we had a 2 bdrm unit (#77). It was a different layout than last time (all one floor this time) with an ocean view. It was spacious except for the kitchen which was definitely made for one person. Each bedroom was large and had its own bathroom as well as a lanai (balcony) that stretched a good 40 feet from one bedroom, the living room and the other bedroom.", "title": "Spacious and Great Staff, but a little rusty", "helpfulness": 13, "user": "oregonian1", "date": "September 14, 2005", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3904127}, {"rating": 5.0, "title": "Highly Recommend Holua Resort - Beautiful Place!", "text": "The multiple small pools & hot tubs were great as was the Tuesday evening party (watch out for the mai tais they are potent). We had a car the whole time but still took the Alii shuttle once from the entrance of the resort into town. We did a snorkelling tour and walked to the pier to get on it. Played golf at the Kona Country club and were able to walk there also.....best of all none of the constant noise common to the condos further down Alii Drive.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "August 11, 2005", "id": 3755875}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The shopping centre was close as was access to highway 11 for destinations south such as the place of refuge, south point, green and black sand beaches, etc.", "title": "Great place to vacation...", "helpfulness": 18, "user": "kimmerz", "date": "August 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3749266}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Staff was very friendly and helpful with all requests. If I was to buy a timeshare in Hawaii this is the only one I would consider!!!", "title": "Well worth a visit (again and again and again)", "helpfulness": 11, "user": "DennySausage", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3673623}, {"rating": 4.0, "title": "Would return", "text": "Although our unit was at the very back of the property (facing a black construction sheet), and the farthest from the parking lot, we would still recommend this property for many reasons. We stayed in a one bedroom unit with our 2 kids and had plenty of room. The living room and bedroom are very roomy. The kitchen has everything that you need to cook meals. We used the stackable washer and dryer alot. That is something you are not going to get in most rentals. The grounds are beautiful, it is very quiet, and you feel like you have the pools to yourself. There is a computer near the front desk with free internet connection. The staff is very friendly and helpful.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 7, 2006", "id": 4950295}, {"rating": 2.0, "title": "Not my favorite....but still had a great time on the island.", "text": "The location of this property is superb. You can walk down to the area where you board many of the snorkeling cruises (Fair Winds). We ate at a few good restaurants we would recommend: Kona Inn, O's Bistro, and Keehi Cafe (very good). Enjoy!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4716562}, {"rating": 4.0, "title": "Very Nice", "text": "My husband and I own timeshare points with Shell Properities and must say I was somewhat disappointed. We stayed at the rost in February of 2006. The one bedroom unit that was appointed to us was a one bedroom, groung level unit that had a view of a black tarp hiding the construction going on 50 feet from our unit. This unit was the very last one; the furthest one away from parking area. My husband and I are active vacationers and we come and go throughout the day. The walk got a little old and the golf cart traffic was annoying after a while (going on all day long in the walking path to parking area), especially when no one ever offered to stop a give us a ride. The room was clean, the kitchen was well equipped, and spacious. The furniture in the living room was uncomfortable with the cushions on the chairs slipping out from under you. When we checked out, we accidently left out cellular phone chargers on the kitchen counter. I called the resort upon arriving home and asked them to check and see if housekeeping found items and ask them to call me back. As of this date, I have not received a call back from anyone. I will not stay at the resort again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 25, 2006", "id": 4386158}, {"rating": 4.0, "title": "Wonderful Christmas at Holua Resort", "text": "The room was nicely decorated and spacious. The grounds very lush and many pools to choose from. At the time we stayed, a complimentary pizza and mai ti party was held every monday down by the pool with free hula lessons, flower lei crafts, and a band. We really enjoyed our stay.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 4, 2006", "id": 4324482}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We stayed on the Big Island and own vacation time with Shell Vacations Club - the Holua Resort is one of their properties and we thought we'd give it a look, especially with all the other glowing reviews on TripAdvisor.", "title": "Wonderful in all ways", "helpfulness": 31, "user": "fraychel", "date": "March 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3301786}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 7, "average": 15, "very good": 79, "terrible": 3, "excellent": 262}, "aka": "Holua Resort At The Mauna Loa Village Hotel Kailua-Kona", "slim_ranking": 0.125, "description": "With a stunning coastal view of Keauhou Bay’s private harbor, the Holua Resort at Mauna Loa Village invites you to enjoy your perfect Hawaiian vacation. The Holua Resort offers 73 spacious, air-conditioned villas designed with a Hawaiian flair. Each comfortable villa offers a private lanai or patio with ocean, mountain or golf course view. Step outside your door and enjoy eight sparkling swimming pools and whirlpools, 11 world-class tennis courts, a fitness facility, and even on-site activities. When you’re ready to explore your spectacular surroundings, head out to sea for some of the best sport fishing in the Pacific. Surf crystalline tropical waters in the morning and snow-ski on breathtaking Mauna Kea in the afternoon. From fascinating sights and spectacular natural beauty to endless recreation, the best of the \"Big Island\" welcomes you Holua Resort at Mauna Loa Village for your next romantic getaway, family vacation or golf trip to Hawaii."}