{"user_rating": 4.5, "review_count": 150, "name": "Homewood Suites Atlanta NW-Kennesaw Town Ctr", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "this is a newer hotel and is well kept just stayed 1 night passing through to florida with hubby and granddaughter the pool area is really cute great for kids basketball and putt putt golf also there food typical homewood we like it nothing fancy but good staff were very nice from check in to food service would definately stay again", "title": "great stay", "user": "MichiganO", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62029241}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I had a reserved room at this Homewood Suites. When I arrived, they told me sorry, they were full, and sent me to the Hampton. Unless you want to arrive, expecting to get settled into a room, only to be herded to a cheaper hotel because they overbooked, DO NOT BOOK HERE!!! Neither management at the hotel nor the Hilton customer service number would even give me a voucher for a free night's future stay. VERY FRUSTRATING EXPERIENCE. I am one VERY unhappy customer.", "title": "Warning: Do not book a reservation here!", "helpfulness": 3, "user": "dmbcxer", "date": "March 16, 2010", "detail_rating": {"service": 1.0}, "id": 58752713}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I usually stay at Homewood when traveling with my Family. The rooms are spacious and I am glad to say that I haven't had a bad experience in one yet.", "title": "Excellent stay! Beautiful rooms! Great breakfast! Friendly staff!", "user": "Freddie529", "date": "January 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53978876}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "This homewood is no exception! in fact, I would say it is the nicest one I have stayed in yet. The staff was extremely helpful and friendly, the hotel looked like new. The room was gorgeous, extremely spacious and comfortable.", "title": "Very nice hotel in the ATL Metro area, I will stay again!", "user": "Pharmrep79", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 47582583}, {"rating": 5.0, "title": "GREAT EXPERIENCE!", "text": "I just signed a contract with a company in the area. I plan to make this homewood our hotel of choice while in the area.", "user": "BRoFlorida", "date": "July 20, 2009", "id": 35290405}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I suppose it is the location that makes this great suite hotel available at a bargain price. We were here for two wonderful nights and it was comfy enough to stay here until winter ends in Ohio.", "title": "Wow! what a deal for all this!", "user": "CSturgeo", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99170032}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "All I can see is look at the pictures. The location was great if you are traveling on I-75. Just try not to have to arrive on a Friday and have to drive through rysh-hour Atlanta to get here.", "title": "Beautiful facility", "user": "23806751475", "date": "January 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91635238}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We made a last minute reservation on the road and got a good price, so stayed at the Homewood. Very nice facility and suite style room. Staff seemed pre-occupied or didn't notice our arrival, not sure what happened there...took 5 minutes to get anyone's attention. Exercise room was nice. There was a laundry, but didn't use it. Wifi in room was fine. Breakfast was a bit better than the normal free breakfast. Location is great. Rght off I75, with plenty of shopping and restaurants nearby. I would stop again.", "title": "Soccer Trip Hotel", "helpfulness": 1, "user": "elcid89tn", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91290074}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "My 10 year-old daughter's soccer team stayed at this hotel for a tournament. The staff was extremely pleasent and helpful. Location was great. The complimentary breakfast was fresh. It was November, so we did not use the pool. Rooms were extremely clean and functional.", "title": "3rd stay--still great", "user": "BRoFlorida", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89573081}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "This is my 3rd stay at this hotel along with other family members in 3 rooms. We all love the staff and see the same faces for the last two years. The rooms are great as well as all the amenities & location, but the best part is always the staff in the breakfast/dinner area. They are so friendly & accommodating. I wish every hotel could be this friendly. It's the best experience always!!", "title": "Big let down", "helpfulness": 1, "user": "TroyGuy50", "date": "October 27, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 85086230}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This has got to be one of the best hotels Ive ever stayed in. It is extremely clean, the rooms are comfortable and has the most professional staff Ive ever encountered. My family and I have stayed here a couple of times and will do so again if I come back down this way. I actually felt welcome here unlike some other places I have been. What a refreshing change.", "title": "One of the best hotels Ive ever stayed in!", "user": "shaunwatt", "date": "July 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 69698517}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We are local to Atlanta and just needed to get away from home for the weekend. We didn't make a reservation - just drove to a few places in the mall area. We had simple requirements - outdoor pool, close to restaurants and under $100. Our expectations were exceeded exponentially upon check in at the Homewood Suites in Kennesaw. The lobby was beautiful, everything was sparkling clean, there was a full kitchen, full free breakfast and the rooms were professionally decorated. Did I mention the soft fuzzy blankets? The amenities exceeded most resorts we have traveled to with a half basketball court, putting green area and a spacious pool with plenty of sun and shade seating. Even Cam the maintenance tech who came to repair our remote control was a wonderful professional yet friendly personality. The truth to our happiness was in every single, simple detail of the grounds, structure, staff and service. Thank you Homewood Suites - well done!", "title": "Paid $10 than other hotel and received $50 more in value and service.", "user": "jennsimsdunn", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69575863}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Six of us stayed comfortably in our suite. The bedroom was very large, dual air conditioners were quiet and kept both rooms at the perfect level. The decor throughout the hotel and rooms was modern and appealing. The front desk was friendly and competent.", "title": "Totally relaxing", "user": "barkus1968", "date": "June 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68124863}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The location, parking and amenities were all great, but everything pales in comparison to outstanding service provided by the breakfast staff. The tables were cleaned quickly and expertly, the food was high quality for a complimentary breakfast, and the attendants were as friendly as they could be. I totally enjoyed out stay.", "title": "Upscale hotel", "user": "jvmay", "date": "June 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68023612}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This is more than an average hotel. We got the 2 queen beds and it had a little room and kitchenette. This was a pleasant surprise with a putting green, beautifully landscaped pool area and even a pool room! The breakfast was great and the staff really were working hard from what I could tell. We paid in advance online for an even greater deal! I will definatley look for a hotel like this the next time we go somewhere. My favorite part- the lounge chairs at the pool. SO comfortable. Not many of them but you could tell the hotel went the extra mile for a more upscale look/feel.", "title": "We love this hotel!", "user": "4kidsMomma", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66879416}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed one night on our way to Florida......Wow, Better then I expected!! The hotel is well kept up, rooms are clean, pool area is Very Nice, really enjoyed sitting out by the pool at night just taking it all in!!! People who worked their were very friendly and helpful! The hotel is located in a nice area, by shopping and plenty of food choices too. If in the area again this will be my First Choice! You don't need to think twice about staying here.", "title": "What a Lovely Place!", "user": "dragonflytoo", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83390100}, {"rating": 5.0, "title": "Homewood Suites is \"Home Sweet Home\"", "text": "We do alot of traveling with my son who plays travel baseball with his high school team. and I always opt to stay at Homewood Suites, because of its comfort and generous amenities. But this Homewood Suites was absolutely incredible! Not only was the place beautiful, the service was amazing, the staff cordial and the FREE breakfast food and \"welcome home\" dinner was awesome! They even serve all the beer and wine you can drink! They even discounted our room for one of the nights because they were having some issues with the cable that evening. The amenities are great - the pool, gym, billiard room, even the laundry facility. It is conveniently located to major highways and is surrounded by shops, restaurants and movie theaters. I will definitely stay here again when we return next July.", "user": "A TripAdvisor user", "date": "October 7, 2010", "id": 82531006}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Just a quick review to let others know what a wonderful place this is! As previously stated, it is extremely clean, the rooms are comfortable and has the most pleasant and professional staff I've ever encountered. The location could not be better....close to so many good restaurants and shopping! Will definately be back!", "title": "Great Hotel!", "user": "GA123", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79252840}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We all love staying at this hotel. It was very modern and most of all very clean.The pool was awesome and the kids love to play on the putting greens and basketball court. Everyone that worked at the hotel was always very nice, friedly and helpfull. I would highly recommend this hotel to anyone.", "title": "Wonderful place to stay", "user": "3littlepigs_5", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74425811}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The rooms very excellent and spacious. Kitchenette, coffee and bathroom all clean and so useful with small children. Breakfast served by the most hospitable employees that I have ever met. Such a great experience for my family. Laundry facilities that were so useful for my older son's dirty baseball uniforms and a workout room with all the amenities that you need.", "title": "Clean, roomy and great hospitality!", "user": "nhmomjcd", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 70551833}], "location": {"country": "United States", "city": "Kennesaw"}, "stars": 3, "variance": {"poor": 3, "average": 9, "very good": 34, "terrible": 2, "excellent": 102}, "aka": "Homewood Suites Atlanta Nw-Kennesaw Town Ctr Hotel Kennesaw", "slim_ranking": 0.0714285714286}