{"user_rating": 4.0, "review_count": 187, "name": "Homewood Suites by Hilton Raleigh Crabtree Valley", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We have stayed here before, which is why we keep coming back. The front desk staff are helpful, knowledgable and friendly. The room was clean, quiet and comfortable and the breakfast bar is complete. Another excellent stay for us. I would recommend this hotel to anyone.", "title": "this is as good as home or better!", "helpfulness": 1, "user": "Liz1953", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38376967}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This was our second stay at this hotel. The desk staff has been very friendly each visit. The staff in the breakfast area are nice and keep the foods hot and plentiful.", "title": "Great hotel - very clean and very friendly staff", "helpfulness": 1, "user": "wrobin", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37980604}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "The pool area is very nice. It had just rained and when it cleared we headed to the pool. There were not towels (brought in prior to rain?) - call the desk and someone brought a huge stack of towels for people to use. He then walked around and asked if anyone needed anything - rare \"extra step\" nowdays!", "title": "Great stay", "helpfulness": 1, "user": "mimitaylor", "date": "August 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37228793}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Rooms are very up-to-date - plush bedding and large flat panel TV's. Well equiped kitchen too!", "title": "Wonderful hotel and great location", "helpfulness": 1, "user": "Peg830", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36696634}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I booked my room via priceline hotel (just happened to get the same hotel two years in a row) at much more than 1/2 of published rate! Hotel was very quick to change my online reservation to confirm double beds!", "title": "A wonderful property", "helpfulness": 1, "user": "Iampinoy", "date": "July 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 35938489}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This is a great hotel. They are all suites and come equipped with fridge, stove, microwave, sink, cofee maker. They give you popcorn, coffee, tea, and condiments as well. The beds were decent, and the room was good sized. Two big flat screen t.v.'s, and lots of hangers-with ironing board and iron. The room had updated decor and nice comforters on the bed. The bathroom and shower is separate from the vanity and sink area.", "title": "Great Hotel", "helpfulness": 1, "user": "SPoe", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18240903, "likes": {"liked": "— It is across the street from Crabtree Mall which is great shopping.", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The pool is nice and big. It was so full of water, it was like an infinity pool. They have good, free breakfast every morning too. Yogurt, eggs, sausage, fruit, bagels, toast, muffins, danishes, juice, coffee, cereals, oatmeals. Lot of variety to be free. The windows in the room open up, but not all the way. It was nice to get some fresh air in the room. We had a room overlooking the pool and it was very nice. overall this is one of the nicer hotels to stay at. Oh, did I mention that the front desk was very nice and treated us like they wanted us there.", "title": "Great hotel", "helpfulness": 1, "user": "Brummy07", "date": "July 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18043150, "likes": {"liked": "— All of it", "disliked": "— First receptionist"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Great hotel set amidst trees. Crabtree Valley Mall is just down the road within walking distance. There is nothing else within this vicinity except the restaurant next door.", "title": "All set to move in here!", "helpfulness": 1, "user": "baystater", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17506265, "likes": {"liked": "— The room and the staff!", "disliked": "— not being able to stay longer."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The rooms are great, we had a balcony, just what you would expect from the Homewood Suites. The foyer, breakfast room etc. is beautiful and the outdoor pool and patio is lovely.", "title": "Ready to move in", "user": "ams54", "date": "June 12, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 16885090}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "When we arrived the receptionist was more interested in playing on the computer than attending to us, this I thought was very rude and not up to the 'Hilton' standard, everything we asked him seemed to inconvenience him. We poured ourselves a cup of coffee and went outside to enjoy the weather and 'cool off'. There was then a staff change-over and the afternoon/evening gentlemen were great they found the details of our room very quickly and were so efficient.", "title": "Great Place to Stay", "user": "2NC", "date": "May 5, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 15666130}, {"rating": 5.0, "stay_parameters": "Stayed February 2009", "text": "I stayed at this hotel last night with my brother and parents. We were in town for the farm show at the state fairgrounds. I booked it thru the hilton website using a AAA discount and choose the 2 bedroom 2 bathroom room. We had plenty of space and each bedroom had a 32\" lcd tv and so did the living room. We didn't use the full kitchen. The reception last night was good, Bud Light on tap and various wines. They were serving spaghetti for dinner but already planned to eat at PF Changs at Crabtree Valley Mall which was adjacent to the hotel. Make sure you get Colin to be your server. He was great and made us laugh often. I still can't get over the size of the gas fireplace in the lobby, it must have been 8 feet wide and 5 feet high. Breakfast was delicious. They served scrambled eggs, bacon, biscuits, gravy, belgian waffles (cook yourself), cereal, juices, coffee and yogurt. The front desk staff was friendly and so were the nice ladies clearing the dishes from our table as soon as we finished with them. $224 might have been a bit high for one night but felt we saved money by eating the free breakfast and enjoying the manager's reception last night. We will return to this hotel when we visit Raleigh in the future.", "title": "Great hotel!!", "helpfulness": 1, "user": "Skiing4Fun", "date": "February 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24325036, "likes": {"liked": "— Location to interstate, mall and restaurants at the mall.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I booked this hotel using reward points for New Years Eve outing with my wife. Check-in was very smooth, staff was friendly and the rooms are very mordern. There are flat panel tv's in living area and bedroom. The kitchen was well equiped and clean. The evening reception was average at best but hey it is included.", "title": "Very Nice & Comfortable", "helpfulness": 1, "user": "mel88hrman", "date": "January 8, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 23379701, "likes": {"liked": "— Location and up todate", "disliked": "— Noisey teens"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "There was a group of teenagers having a party around 2 AM. It was very loud but hotel took care of the issue and we slept comfortably.", "title": "great hotel, great location", "helpfulness": 2, "user": "vetjet", "date": "January 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23235299}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Stayed one night so we could rest from long road trip. The rooms are spacious and have a sofa bed, which helps when traveling with kids(we have 2) The hotel is new and it shows. The rooms are up to date, very clean and well appointed. The lobby is very inviting.Free hot breakfast is surprisingly good. It's across the crabtree valley mall (huge) so there are plenty of options very close. Highly recommend.", "title": "Great Service !", "user": "artieboy", "date": "October 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20934189}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Front desk was great! Well appointed rooms, and I was able to hook up my video camera to the Flat screen TV to view the shots I took for work.", "title": "We will be back!", "helpfulness": 1, "user": "robytoots", "date": "October 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20767480, "likes": {"liked": "— Comfotable and well appointed. We did not need to seek out anything from front desk.", "disliked": "— Hotel was tucked back behind mall and was hard to find."}}, {"rating": 3.0, "title": "Rough Arrival", "text": "The hotel was in a great location. Not the newest of Homewood Suites, but appeared in very good shape. Front desk clerk was not very friendly and they changed my rate at arrival. After driving 10 hours I really did not feeling like fighting or looking for a room elsewhere. Attitude by the clerk was take it or leave it. The room was very clean but outside in the hallway smelled like smoke. We were there for one night and just prayed it would not seep into our room. Thought they had gone smoke free. Location could not be beat with the mall across the street and its many restaurant options. Needless to say it was just an ok stay.", "user": "slpond", "date": "July 22, 2009", "id": 35451430}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "I read the reviews before I travelled to the Homewood. I read that several people were very satisfied by the hotel. I was so pleasantly surprised at the quality of this hotel. The service at this hotel was some of the best I have received at the many Hilton properties I have stayed at.", "title": "Very pleasant stay", "user": "Amanda B", "date": "May 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29533832}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Rooms are finished to a good standard and have everything that a trav eller could possibly need. I was very comfortable and enjoyed my stay.", "title": "Another good Homewood Suites", "helpfulness": 1, "user": "LOVINGTRAVEL40", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 27915292}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I come to Raleigh often from the UK and will definately stay at this hotel again. Sssh do not tell too many people or it will be full when I next need it!", "title": "Two thumbs up for this hotel.", "helpfulness": 1, "user": "freighterbum", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26723583}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Great location right behind Crabtree Valley Mall. Just drive down the street and you have all the stores and restaurants you'd ever want. Nice room, kichen, sleeper sofa.", "title": "Very accommodating", "user": "PremAuditor", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26431124}], "location": {"country": "United States", "city": "Raleigh"}, "stars": 3, "variance": {"poor": 10, "average": 24, "very good": 54, "terrible": 7, "excellent": 92}, "aka": "Homewood Suites By Hilton Raleigh Crabtree Valley Hotel", "slim_ranking": 0.325, "description": "Delight in our Crabtree Valley Raleigh hotel, comfortably situated within walking distance of Crabtree Valley Mall, minutes from downtown and right off I-40. The phenomenal Homewood Suites by Hilton® Raleigh-Crabtree Valley hotel is an incomparable Raleigh extended stay or vacation option. Conveniently located in the heart of the city, business travelers enjoy easy access to local businesses, corporations and institutions of higher learning. This all-suite property provides quality accommodations, perfect for anyone traveling to Raleigh for business or pleasure.Our spacious studio, one- and/or two-bedroom suites feature separate living and sleeping areas. Each has a fully-equipped kitchen with full-size refrigerator, microwave, 2-burner stove and dishwasher. You’ll find enough space for work, study or entertaining - plus all the comforts of home including two 32\" LCD/HDTVs, complimentary high-speed Internet access, and two phones with voice mail. Enjoy a complimentary Suite Start® hot breakfast seven days a week and a Welcome Home Reception® featuring a complimentary light meal and beverages Monday through Thursday evenings (local laws apply)."}