{"user_rating": 4.5, "review_count": 269, "name": "Home2 Suites by Hilton Nashville Vanderbilt", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Nice decor, great shuttle service within 3 miles. Overall helpful service. All workers would greet you in a friendly manner.", "title": "Overall Good", "user": "Cjhs20", "date": "June 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162617203}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Walls/doors are not that soundproof so Saturday night we heard a bunch of drunk kids super loud in the hallway multiple times but never did call front desk, who knows what they would have done. Other nights were better.", "title": "Nice, but not worth price...", "user": "Stacy S", "date": "May 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 162300703}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "$20 each night for parking is kind of lame to say the least, especially since they don't have a guard or anything to pay, just a covered garage. $10 would be more reasonable. Oh well.", "title": "Great hotel in Vandy Area", "user": "Jed M", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162382371}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I read LOTS of reviews before deciding on Home2 Suites Downtown. I guess I just expected a little more for the price. The room was nice and clean, but kind of small. The kitchenette was clean and had lots of glasses and flatware and even came with a dishwasher, but it wasn't really necessary. I think I could have done without all of those \"extras\" and been happier with a nice King sized bed and a little more floor space. Also, the bathroom was clean, with glass door shower, but again small. The soap and shampoo dispensers were a nice touch, and we did enjoy the shuttle service. The location was nice being within walking distance of several mid town bars, However, I would advise parking Downtown and taking the shuttle to and from. $20 parking fee is PER NIGHT which is not what I was told at check-in. That is crazy! At almost $500 for two nights total, it just wasn't worth it. Esp without daily maid service. Hilton Garden Inn next door was nicer and cheaper, with a much better breakfast.", "title": "Home 2Suites Nashville Hotel Review", "user": "Jim D", "date": "May 29, 2013", "detail_rating": {"service": 5.0}, "id": 162381407}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "If you get a chance to be in Nashville, this is the hotel you want to stay at! Great staff, great amenities and an overall great hotel! Largest jacuzzi in TN, free breakfast, and free shuttle make this a great deal as well.", "title": "Loved this place", "user": "krazykev", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162221389}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I enjoyed my stay here. Usually I stay at the HGI right behind it but tried Home2 since it was so close. The staff here is excellent and comfortably friendly. It seemed sincere which is rare in the hotel world. They appeared to even be happy to be at work. They were helpful and friendly and it never once felt forced. I left my favorite pair of shoes in the room and when I called they assisted me right away and sent them out FedEx. The amazing thing is that I called this hotel 3 times and each time someone picked up the phone! I didn't have to go through any sort of phone prompt and hit zero to finally reach someone. The room great and perfect for my business needs. There are plenty of plugs for charging things. This will probably be my new \"go to\" hotel for Nashville.", "title": "Friendly Fun Place", "user": "LizzChicago", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163167603}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "My daughter and I stayed here for 3 nights while visiting my older daughter who attends Vanderbilt. It is a really good option if you want a well priced alternative to the Loew's and Hutton hotels plus it has laundry facilities adjacent to the fitness center so that you can do that while you work out. Breakfast is included and was an exceptionally large range of choices and hot food and coffee. Well organized with an eating area. Rooms have kitchenettes and there is space to spread out so we did not feel we had to eat out all of the time. There is also a really nice pool and staff were very helpful and friendly.", "title": "Great facilities and staff", "user": "LondonKat77", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163040231}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "It'sa decent place to stay if you're looking for a studio suite for a slightly discounted price. However, for most extended stay purposed (professional), I'd highly recommend against. It's situated nicely in a fun part of town with many fun bars nearby, and thusly, its populated by loud and drunk people at all hours of the night.", "title": "Decent", "user": "Terran S", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 163042554}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I expected a newer hotel property to be really great, and I will say that the rooms were clean and the small kitchenette is a nice plus. However, parking and getting into the hotel is a royal pain in the a__! It took almost 10-min to get to my car.....the way you have to access the garage is crazy, walking a ways across & through the garage to an elevator from the lobby. Even with one roller bag an my briefcase it was a pain.....not to mention the night before I really got turned around (even with the signs they posted) as the HGI & Home2 share a garage. It also felt like this was a property being used by a lot of college-age kids either between apartments or something, a few 'groups' hanging around and it felt like a glorified dormitory.", "title": "Not what I expected, rooms clean but parking is a pain.....", "user": "hodels", "date": "June 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 162911201}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I checked out and went to an HGI near the airport for my 2nd night (off Elm Hill Pike) and was happier with that property. Rooms not as 'new' and no kitchenette, but easier in/out access and overall more for business travellers.", "title": "Great!!!!", "user": "Eser Y", "date": "June 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162690405}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "When we arrived, I noticed it was $20 to park at the hotel's deck, or there was free street parking within walking distance. One of the women in our party asked the front desk receptionist if the street was safe for parking, and she replied with an enthusiastic yes. Upon loading the car the next morning, I found my passenger side-view mirror smashed & turned in. This side of the car was not on the road, but rather the sidewalk. I also noticed several other cars with similar issues. So, someone walked by & decided to vandalize cars. When I spoke to the hotel manager, intending to ask for some tape, she immediately got defensive after I explained what happened. I was offended she would take it to that point, so I decided to mention that although I knew I parked at my own risk, it was a decision supported enthusiastically by a hotel employee. I would definitely not stay at this hotel again for the lack of management's concern for hotel guests.", "title": "Don't park on the street", "user": "Shannon C", "date": "May 28, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 162208306}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Other than that, the hotel facilities were fine. We had 3 adult females in a suite, and we were comfortable. The \"largest hot tub in Tennessee\" was overly chlorinated and only lukewarm.", "title": "The Dorm Room of my Past Dreams", "user": "Thomas M", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 161744324}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "This would have been great, say about 20 years years ago. The decor reminded me of a cross between lowend Ikea and Target. Don't get me wrong, I love Target. There is an interesting curtain in the center to provide privacy should someone want to sit on the couch and watch television with the roomate sleeping on the bed. The room is by no means spacious. I have been a Hilton HHonors member for years, and love the bedding. However, don't look for it here. It reminded me of a time I had the misfortune of staying at an Extended Stay America.", "title": "Weekend in Nashville", "user": "sunshinevt", "date": "May 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 161712397}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Lot's of empty wall shelves to store college decor and books for those on an extended stay. The room also has a full refrigorator and microwave, but no stove. Perfect for reheating take out pizza and a chilling a few cases of beer. As I said, where was this 20 years ago?", "title": "Enjoyed my stay", "user": "kajoy2", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161689321}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Breakfast was less than I have been accustomed to at Homewood Suites and Hampton Inns. Once again, you can relive that dormroom experience at the 15 foot group dinner table in the lobby. There are are some additional tables there if you can", "title": "Great hotel! Highly Recommend!", "user": "Kelly O", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161698410}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at Hilton's Home2 Suites in the Nashville/Vanderbilt area. We spent two nights, and booked the hotel primarily for the location and that it was a Hilton property. While I understand what Hilton is trying to do here (green lifestyle, hipster appeal) - it was \"not my cup of tea\" (as my mother would have us say when we didn't like something). The rooms were sparse, cheaply decorated in an IKEA /dorm room look. The bed was not queen size as stated (we sleep in a queen size bed at home). What really bothered me was the curtain that separated the couch area from the sleeping area - making it a suite. The same curtain appeared in front of the closet - instead of a door. The small kitchen area, complete with dishes and dishwasher was nice - but not something we needed. The large screen TV was nice. We were annoyed at the $20.00 fee to park, difficulty loading and unloading, with inadequate space to park your car to do so. Breakfast promptly ended at 9AM, which did not fit our schedule.", "title": "Not my cup of tea", "user": "Diane440", "date": "May 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 161184674}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "We have stayed numerous times at Cambria Suites - which I am going to guess is the look and feel of what Hilton Home2Suites is trying to emulate. Look at Cambria Suites closer and get some ideas of what can be done better. They have the modern, sparse, green look - but done in a much more appealing way. If this Home2Suites location does not work out, I am sure Vanderbilt would love this property for a dorm.", "title": "Feels like a modern, revamped version of Homewood Suites", "user": "Keystone_Traveler", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161151075}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "First time travelers to Nashville often prefer to stay in downtown Nashville (and understandably so). However, staying near Music Row and Vanderbilt Univ offers some good options, including this hotel. This new Hilton brand is very similar in spirit to the established Homewood Suites brand by Hilton. Home2 is an updated version based on its color schemes, furniture, and themes of sustainability and conservation seen in areas ranging from housekeeping to breakfast. I would even categorize the rooms as utilitarian or efficient. The room is shaped as a narrow rectangle; a curtain is available to separate the sleeping area from the \"sitting\" area. The window treatment just consisted of a white shade; no curtains. My third floor, rear facing room had an uninspirational view of the parking garage. Other aspects of the room were fine, including mattress comfort, lighting, lamp mounted outlets for iPad/computer charging, water pressure & temperature, and wall insulation (quiet). The lobby decor and breakfast area is \"modern.\" Food quality is probably better than what you would find at a Hampton Inn; not as extensive as an Embassy Suites. Located less than 5 minutes from the Demonbreun exit off I-40 on the west side of town. There is an attached parking garage where you can either valet or self-park (both costly fee). The hotel offers a 24 hour shuttle bus service to the center of town. There are plenty of restaurants and bars within easy walking distance of the hotel. A special acknowledgement to the staff working here; all who I met were very extremely polite, friendly, and helpful. It made a positive impression.", "title": "Great hotel, excellent staff", "user": "Carrie H", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161297201}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Couldn't have been happier with my four-night stay at this hotel. The room was great, but what really impressed was the friendliness and helpfulness of all the staff members. The complimentary shuttle service is also a great facility.", "title": "Nice Place", "user": "Kevin R", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161296767}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Price was jacked up due to Vanderbilt Graduation but I'd still stay there again. The place is kind of trendy and cool. It's in a great location for Vanderbilt and the West End. Climate control in the room was the only real problem we had.", "title": "A good choice", "user": "Rtmith", "date": "May 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161090115}], "location": {"country": "United States", "city": "Nashville"}, "stars": 2.5, "variance": {"poor": 8, "average": 23, "very good": 57, "terrible": 6, "excellent": 175}, "slim_ranking": 0.0608108108108, "description": "Welcome to Home2 Suites by Hilton® Nashville Vanderbilt. This convenient home away from home is ideal for budget-conscious business and leisure travelers in Nashville. Whether you're here for a short-term or extended stay, corporate housing or a visit to the local campus, Home2 Suites by Hilton® Nashville Vanderbilt is perfectly suited to your needs. Our contemporary hotel sets you mere minutes from popular ‘Music City’ attractions including the world famous, Country Music Hall of Fame and the Ryman Auditorium. You’re also within walking distance of the Parthenon, a full-scale replica of the original Athenian Greek Temple. Corporate travelers will appreciate our close proximity to local corporations, as well as both Belmont and Vanderbilt Universities.Relax in one of spacious studio or one-bedroom suites and feel at home. Every stylish suite within this Nashville Vanderbilt hotel features movable furniture, plenty of storage, living area with sofa bed and a fully equipped kitchen. Stay connected with free Wi-Fi and an iHome clock radio. Enjoy a free breakfast at our Inspired Table™. For your convenience, we also offer wireless printing from your laptop or smart phone. Pack the leash because Home2™ is your pet’s home too. Pick up snacks and travel essentials from HOME2 MKT®, our 24/7 on-site market, or put a new spin on multitasking at Spin2 Cycle, where you can run on a treadmill while you run a load of laundry."}