{"user_rating": 4.0, "review_count": 250, "name": "Homewood Suites by Hilton Boston", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Pros: Great layout for family of 4 to spread out, two tv's, separate bedroom, small eating area, large bathroom with neutragena toiltetries, kitchenette, and complimentary popcorn for basically the same price of regular room at surrounding hotels.", "title": "Good customer service", "user": "ttoo", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 102345291}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Pool was warm. Workout room was well maintained but a bit small.", "title": "Like home..", "user": "KadirPapatya", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100607225}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Breakfast was fabulous....well maintained, real plates and silverware, tables cleared and cleaned timely, the attendant was doing a great job. We weren't there during the week but I'd expect the included business dinners to be good and a real value if travelling with a family.", "title": "great value/great location", "user": "dconc74", "date": "March 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 100271562}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Customer service- Aplus for follow up. Mentioned a few issues we had with the room at checkout and hotel managment followed up with us after check out.", "title": "Very comfortable hotel with outstanding service", "user": "biztraveller5459", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99776392}, {"rating": 4.0, "stay_parameters": "Stayed February 2011", "text": "Cons: Our particular room wasn't cleaned to a standard I would have hoped but managment did seem to address this and I didn't notice any problems anywhere else in the hotel. Based on other reviews posted, perhaps this wasn't the norm. Location was a bit hard to figure out. We came from Salem and passed the hotel twice before figuring out how to actually get into the parking lot from surrounding freeways. Very busy area.", "title": "Decent stay", "user": "Valvelifter", "date": "February 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 97913248}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Spacious, clean room. Very friendly and accomidating workers! Great free breakfast", "title": "GREAT PLACE TO STAY--FRIENDLY WORKERS", "user": "LouMC66", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 97515999}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Let me share with you my very bad experience with a too noisy hotel and very bad service. Refrigerator is too noisy I put it off to try to sleep BUT the air-conditioning is too noisy that you cant sleep unless you are so tired as I was. The sofa-bed is only good to get backaches and fight with finding the sleeping.", "title": "HORRIBLE SERVICE", "user": "Fethig", "date": "November 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 88663947}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "I DONT RECOMMAND THIS HOTEL TO ANYBODY", "title": "Excellent service and value", "user": "BigFishDiveClub", "date": "November 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 88479881}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The front desk staff was excellent during our Thanksgiving week stay. The location was good that we were able to visit a different state each day of our stay. The internet, breakfast, free parking, gym and the pool were nice to have.", "title": "Warm and Friendly staff with an excellent Evening Reception and breakfast", "user": "Rita_C62", "date": "November 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 87631917}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "My husband and I enjoyed a wonderful few days in Boston. This was our 4th time back to this hotel", "title": "A home away from home", "user": "tjones700", "date": "October 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84568341}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My wife and I have just spent 3 weeks travelling New England and during this holiday have stayed at numerous hotels and motels. This was our last hotel before flying home. The staff could not have been more helpful. The room was spacious, clean, and everything you could want was provided. I have no hesitation in recommending this hotel and would certainly stay there again", "title": "Great place to stay", "user": "bobsuda", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 82615330}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We enjoyed our stay at Homewood . It is very convenient to Boston. We saved money on meals by taking advantage of the \"light\" dinners during the week nights which were filling and good quality. The daily hot breakfast is excellent and there was ample food even past the time the food area was to be closed. The food area was full each morning but had enough seating for all. The pool is small but our children enjoyed using it. Our fifth floor room faced south overlooking the Sonic on the adjacent property. We had only occasional street noise (loud car or two) until late evening and then enjoyed a good nights sleep in very comfortable beds. No problems with free Wifi service in our room. The small kitchen / fridge were convenient and well maintained. As noted in other reviews, the location is a bit tricky to navigate - you must enter the hotel from the northbound lane of Rt 1. Coming south on Rt 1, take the Salem St exit and turn around to Rt 1 north. We will be back to this hotel, really enjoyed our stay.", "title": "Great place to re-energize after Boston sightseeing", "user": "PeteInPoconos", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76374184}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Stayed here prior to going to a conference in downtown Boston (stayed in hotel downtown for several days after staying at this hotel). The good about this hotel: Location is EXCELLENT if you plan on visiting North of Boston....Salem; Gloucester; driving to Maine (which is a MUST....you are only 50 minutes away!). Breakfast is a GREAT value and was really good over the weekend (Memorial Day weekend). On Monday and Tuesday it was a very limited breakfast for some reason (no waffles and breakfast quesadillas...not the greatest). The indoor pool is small, but the kids didn't mind. One night, the hotel's air conditioning was out and the temp in our room was 81 degrees! When I discussed it with the front desk the next morning, they immediately & without hesitation informed me that I would not be charged for that night. The suites are quite large...showing a little age, spots in carpet, marks on wall. Bathroom is VERY big. One negative....the hotel was out of laundry detergent in the small \"store\" at the front desk and we needed to wash clothes in the hotel's laundry area on 2nd floor. Great place to stay with kids! Marriott Spring Hill Suites and Hampton Inn are on each side of the hotel. By the way...a GPS is a MUST if you plan to drive into downtown Boston!", "title": "Great Location & Good Service", "user": "FunFamily05", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66678429}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The best thing about a Homewood Suites is the TWO rooms you get, along with two TVs. (Currently their channel selection is minimal but they said they are changing that soon.) I would agree with others that the pool is quite small. A free \"dinner\" (chicken parm, salad and bread) and the free breakfast add to the value. Our room was perfectly clean unlike others' experiences. The Sonic right next door made the kids happy. Even though the location is odd, its easy to get to from Boston (Rte 1 N and turn right into the parking lot) and there is a jug-handle turn around just past the hotel so its easy to get turned around and head back into town. The internet is weak on the 4th floor as mentioned before.", "title": "Definately worth the detour from Boston", "user": "mickeykitty", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 62418239}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "I'm not one of those travelers who let the simplest things ruin their stay, but there were a series of small problems about this hotel which lead me to give it a very mediocre rating.", "title": "Average Stay With Minor Problems", "user": "shankwheat", "date": "April 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 62266315}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "We had 2 suites. One of the suites had some clothes under the sofa and under the bed from a previous guest. Chairs were stained. Carpet had burn marks and stains.", "title": "Not bad / Not good", "user": "rfmnj", "date": "April 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 60460286}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Breakfast was simple with very few choices.", "title": "Nice hotel, no surprises (good or bad)", "user": "AlbanyL", "date": "April 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 60365404}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The evening \"Welcome Home\" reception was described as \"a complimentary light meal and beverages\" and was actually a full meal (Lasagna, Garlic Bread and Salad, for example) and the beverages were actually fruit punch. The hotel appears to have a policy of allowing homeless people to enjoy the free meals.", "title": "Wow", "user": "littlefi1", "date": "November 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 49408597}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The internet access was VERY poor. Most evenings you could only get a signal in the lobby area.", "title": "Too expensive for what you get", "user": "PreciousWeasels", "date": "November 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 48499070}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The staff was cheerful, friendly and helpful.", "title": "Great", "user": "Budgettravel99", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48085613}], "location": {"country": "United States", "city": "Peabody"}, "stars": 3, "variance": {"poor": 15, "average": 29, "very good": 81, "terrible": 6, "excellent": 119}, "aka": "Homewood Suites By Hilton Boston-Peabody Hotel", "slim_ranking": 0.125, "description": "At Homewood suites by Hilton Boston-Peabody we offer the comforts of home at this all suites hotel. Centrally located in the heart of Boston's North Shore, you will be just 15 miles from Bostona Logan airport and near downtown Boston. During your visit at our extended stay hotel, visit nearby attractions like Faneuil Hall, downtown Boston, Fenway Park, the New England aquarium plust more!We also offer a hot full breakfast daily for all guests and evening dinner and drinks Monday-Thursday. Our suites feature fully equipped living rooms, free high-speed internet access, and a seperate living area. While here, take advantage of our fitness center and heated indoor pool."}