{"user_rating": 4.5, "review_count": 693, "name": "Homewood Suites Orlando-Nearest to Universal Studios", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I often stay at Homewood Suites, so was surprised that the room with the pull-out sofa at this location was so small. I don't recall ever staying at a Homewood with such a small living room; it was barely adequate for our 2 teenage kids and like a previous reviewer, we too had to move furniture from this room into the main bedroom. Kitchen space was also the smallest I'd seen at a Homewood. Other than that, the hotel was fine. Breakfast was ok, although they were very slow to replenish items, but it was fine. The room was clean, and even though our room faced the freeway it was very quiet. Location was good. Wireless internet service was free, fast and reliable. I've stayed at better suite hotels before in Orlando for this price, but they were not available when I was making reservations. If you plan to use the pull-out sofa at this location, be prepared for it to be a very tight squeeze.", "title": "Small room, but adequate", "helpfulness": 2, "user": "ats262m", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7293610, "likes": {"liked": "— Wireless internet, free cooked breakfast, seperate bedroom, 2 TV's, kitchen area", "disliked": "— small living room, breakfast items replenished very slowly"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We stayed at Homewood Suites with my 2 children, age 7 and 11. We booked a suite with 2 queen beds, the beds were very comfortable. My son slept on the sofa bed and found it to be more comfortable by putting the mattress on the floor, pretty typical for any sofa bed. The room was very clean and the kitchen accomadations exceeded my expectations with a full sized refrigerator and full sized dishwasher. There was plate settings for four, all very clean, along with basic sized pots and pans and cooking utensils. The breakfast was plentiful,my picky children had no trouble finding enough to fill them up. We only did the dinner once due to the timing, parks were open until 7 and the dinner was over at 7. The one time we did do it the food was plentiful and would definitely be enough to qualify as a dinner. \"House\" wine and beer were plentiful. We didn't use the shuttle service. Overall very pleased. Would highly recommend.", "title": "good price, good hotel", "helpfulness": 7, "user": "cooljul", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 7269265}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Homewood Suites are our all time favorite chain so we are familiar with the general structure and amenities of this hotel chain. I did not realize I had booked us at TA's Number One pick in Orlando until after I made my reservation. Perhaps that high rating created some unrealistic expectations in my mind. I certainly expected an experience at least as good as what I normally have in a Homewood Suites. Unfortunately I did not have it.", "title": "No. # 1? I think not!", "helpfulness": 15, "user": "Busy-retired", "date": "March 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7260247, "likes": {"liked": "— Seperate rooms with two TVs?", "disliked": "— Decor and overall condition of the room + bad breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "To begin our experience I was not able to book directly with the hotel property unless I wanted to pay an additional $50/night. I had to reserve on-line with the Hilton website to obtain a rate of $170, which is still expensive for our budget.", "title": "Great stay", "helpfulness": 7, "user": "redsox77", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 7219142}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Registration was painless if performed by an employee who was clearly indifferent to her assigned task. I had specifically requested a room on the inside of the building so that we did not hear traffic noise from I-4 outside our window. I even called earlier in the day to confirm that room assignment, and was assured there would be no problem. We were placed on the I-4 side of the building.", "title": "Great place, loved the stay!", "helpfulness": 6, "user": "Mike463502", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7218351, "likes": {"liked": "— Room size", "disliked": "— Ants in bathroom."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "This is without a doubt one of the best hotel experience I have ever had. The breakfast was excellent, staff helpful and friendly.", "title": "Great hotel", "helpfulness": 10, "user": "gingerbell", "date": "January 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6590358}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We only enjoyed the dinner one evening but it was good. The room was nice and very clean. The kids even enjoyed the pool in December.", "title": "Awesome!", "helpfulness": 10, "user": "ale1974", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6559848, "likes": {"liked": "— The room and the staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "My only complaints are I wish Wireless internet was available and the evening meal was served more often.", "title": "solid hotel, great stay", "helpfulness": 19, "user": "gillg", "date": "December 31, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6527919, "likes": {"liked": "— value for money", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Overall I really believe I got the best deal for what I paid. I plan on returning to orlando in a couple of years and will stay here again!!", "title": "Is it too good to be true?", "helpfulness": 22, "user": "alpenmicho", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6472882, "likes": {"liked": "— Spacious homey rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I spent my birthday there with my wife, new born son and parents. The room was super clean and super comfortable, the staff was really polite, the manager even gave me the nice surprise of putting happy birthdays balloons and a cake.", "title": "I love this place!", "helpfulness": 14, "user": "Cheschirecat", "date": "December 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6352986, "likes": {"liked": "— location, spaciousness and the price", "disliked": "— busy area"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Stayed at Homewood Suites for four nights at the beginning of November and quite simply could not give it a high enough recommendation for it's value for money, cleanliness, and location, if you are visiting Universal Studios it is just a leisurely 15 min walk. The suite we had was clean, well equiped and very comfortable. The breakfast was a great start to the day with a good variety available. The light evening buffet and free drinks, (red/ white wine and beer mon - thur evenings, 5 to 7pm) was a fantastic bonus-we used it every evening. All staff were extremely friendly and accomodating. Free internet access and gym. My only advice to anyone going there is take note of the following when trying to find it .Head for the Sheraton Tower as a landmark because Homewood is tucked away. Going up International Drive with wet n wild on your right go straight across Universal Bvld and access to Homewood will be about 200-300 yards or so on the left and it is tucked away so watch out, but it is well worth finding.", "title": "Don't hesitate booking this one!", "helpfulness": 20, "user": "iangoo", "date": "December 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6339124, "likes": {"liked": "— The value for money", "disliked": "— No negatives"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I stayed at the Homewood Suites by Hilton in November for several days and was Very Happy with the cleanliness of the hotel as well as all the amenities. Marie was a true help and the housekeeping staff was impeccable. However, The real cincher came on a night when I could not sleep and went down to the hotel shop to purchase a beverage and began talking with their midnight auditor. After 45 minutes of pleasant discussion I was given some real good advice that has ended up saving me a few grand. (thanks Robert) The trip was great and I really cannot see how it could have gone any better for me and my family. If you ever get there be sure to stop in and say hi to Rob for me on midnights. Thanks Homewood Suites!", "title": "What a wonderful stay", "helpfulness": 10, "user": "quipt59", "date": "December 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6336128, "likes": {"liked": "— Personnel", "disliked": "— Breakfast staff"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We stayed at this absolutely great property! The morning breakfast and dinner/reception in the evening are fantastic! The staff and accomodations are the best I have found in over 100 trips to Orlando! We really liked the location, the rooms and environment are quiet and spacious. You will find an upgraded alarm clock in room, 24 hour hotel maintenance on site, a great pool and internet center as well as a variety of guest services and restaurants as well as a great night life location (Howl at the Moon) nearby. Every spacious one and two bedroom suite features separate living and sleeping rooms, and a full size kitchen. All suites are large enough for work, relaxation or entertaining and feature comfortably sized floor plans. The suites feature a kitchen: Full size refrigerator and microwave, two-burner stove top, coffee maker and cooking utensils.", "title": "Best Hotel for Business Travelers", "helpfulness": 8, "user": "travelexpertallan", "date": "December 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6318207, "likes": {"liked": "— Space and Clean! Great food and reception!", "disliked": "— Hotel tends to fill up!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Separate living room with sofa bed, lounge chair and coffee table. All rooms have a 25” television with video cassette player", "title": "A true home from home", "helpfulness": 12, "user": "DiverDH", "date": "November 14, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 6124401, "likes": {"liked": "— Very relaxed feel to the place - nothing was too much trouble", "disliked": "— Air-com was either on or off - no fan speed adjustment possible"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Bathroom – Full bathtub/shower with separate vanity area", "title": "A Great Stay", "helpfulness": 21, "user": "Superman2k38", "date": "November 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6056689}, {"rating": 5.0, "title": "As GOOD as last years stay.", "text": "We stayed here again this year in March and it was a Great as last year. One mile from Universal Studio's so you can walk or take a FREE shuttle. I like this place because it is a Suite. You get a bedroom ( get two beds...the king bedrooms are much smaller)livingroom and full kitchen. You actually don't need the kitchen....They give you a complete Full hot breakfast buffet every morning...Bacon.sausage,eggs,potatoes,fruit,yogart,waffles and much more. It may vary a bit each day. BIG PLUS...they even have a light meal in the evenings Mon.-Thurs. including wine and beer. One night they had shepards pie,pineapple and ceaser salad. The next night they had cheese burgers,fruit and regular salad. Not bad for an evening meal. It's all included in the price of your room. Meals change nightly. They even put a meanu in your room. Last year we paid $154 a night and this year it was $124. You can't beat it. Clean, well located place. We wouldn't stay anywhere else when at Unniversal and you can always drive to Disney from there too. Next door a couple paid more than we did,not a suite and no food. Stay here instead. Read my last years review too. Nice pool and a small store area to buy food if you want. Safe area too. Happy traveling.", "helpfulness": 14, "user": "TheArtTeacher", "date": "March 16, 2007", "id": 7171435}, {"rating": 5.0, "title": "Made the whole trip!", "text": "We can not say enough about this place, from the front desk to the girls at the great food center to housekeeping to the maintenance, it was terrific. The staff were always helpful and friendly and happy. The rooms were terrific in size and very clean. The girls at the food counter did an awesome job at keeping the area clean and always full and, trust me they were always busy as it was so good people certainly used this savings alot. We always loved coming home to our room at the end of the day, and we always looked forward to a terrific breakfast. It was very close to international drive but we never heard a thing at all and we were concerned about this but it was never a problem. Again, trust this great site on the reviews, you will not be surprised that they are number one as they deserve it and they all do such a terrific job that they seem to do it effortessly. Thank you Homewood Suites for making our first holiday one that we will never forget.. Room 415, the end of Feb 2007", "helpfulness": 16, "user": "smithalberta", "date": "March 4, 2007", "id": 6909245}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "My wife and I stayed here on a recent business trip and we were very pleased. The breakfast was awesome and the welcome home reception/meal was a great added feature.", "title": "This place RULES!", "helpfulness": 11, "user": "dhansen", "date": "February 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6746757, "likes": {"liked": "— Free breakfast and lunch", "disliked": "— No King bed available even through we reserved it."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "We are going to Orlando for spring break with the kids will be staying here for the last two days. We are staying at the Royal Pacific the first four days only because of the fast pass room keys for the Universal Parks. Now if Homewood Suites would provide these then it would be a perfect world!", "title": "WOW!- Exceeded Expectation- (Free Food!)", "helpfulness": 29, "user": "Novaya", "date": "January 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6627685, "likes": {"liked": "— Free Food- Large Spacious Lovely Rooms!", "disliked": "— Everything was great- no complaints"}}, {"rating": 5.0, "title": "Excellent", "text": "We stayed 1 night in early Dec2006 and booked by phoning directly. The person we spoke to was clear and helpful and the reservations were made smoothly. We had a CAA discount rate of $125US/night. We were going to check in very early (9am) and they were so flexible that we were able to get into our room PLUS help ourselves to the breakfast buffet before we caught the free shuttle to Universal Studios. (as well as do some laundry!) Shuttles were very not that frequent, so we took the later morning one.", "helpfulness": 5, "user": "Honestopinion2", "date": "January 14, 2007", "id": 6594714}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 15, "average": 39, "very good": 227, "terrible": 7, "excellent": 405}, "aka": "Homewood Suites Orlando-Nearest To Universal Studios Hotel Orlando", "slim_ranking": 0.100303951368, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}