{"user_rating": 4.5, "review_count": 259, "name": "Homewood Suites Philadelphia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Are you looking for a great room and value in the City Avenue area in Philadelphia, PA, then you HAVE to stay at the Homewood Suites. The hotel staff is outstanding. You feel welcome, and they are eager to provide the best service they can. Traveling with others?, the hotel will negotiate a fair and and outstanding rate for your group.", "title": "Great Value", "user": "Daniel F", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177086694}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Staff is very friendly and helpful. Rooms are clean and well maintained. Meals are better then most hotel fair. I have stayed at this hotel many times and would recommend it to everyone. The only drawback is having to walk a block from the parking area after a long day.", "title": "Great place to stay!", "user": "Stephanie H", "date": "September 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176830318}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "This was my first experience with the Homewood Suites product. Upon entering the lobby on arrival I was immediately greeted by the front desk. The purpose of my stay was for business with Penn Medical Systems. Of the 8 days I was a resident with your property I was only able to accomplish 2 days of work. That being said my days started out with uncertainly and usually ended with frustration. However, every return I made to the property not only was I greeted by the front desk, but greeted by NAME and \"Welcomed Home\". In the morning I was also wished a good day, by name. For this traveler, that little touch of hospitality and friendliness was well received and appreciated. My only complaint was the valet parking. However, it was only a minor distraction because, in the end, I got my car and was dropped off at the HH Suite upon returning. Mr. McDevitt and his staff did a tremendous job at providing a warm, welcoming and professional atmosphere for my trip.", "title": "Welcome Home", "user": "Timothy M", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176560935}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Great Location for Business and extermely friendly Staff. I'm now writing additional bunk as Trip advisor requires a monmum of 200 characters... I beleive Trip advisor should be down graded for this requirement!! They Trip advisor suck and the Hotel is the Best!!", "title": "August stay", "user": "Guy F", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 175999641}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "my family and I stayed at the hotel over the labor day weekend and even with the hotel being sold out the desk staff was amazing. The desk went out of their way to make sure that every need of their guest were being ment from giving tourist info to arranging multiply taxis in what most would of been overwhelmed they didnt miss a beat. In was a pleasure to not only see an awesome staff but the managers were right there at the desk helping with whatever needed to be done. This is an A++ staff from the General Manager all the way Down. I cant wait to bring my family to this homewood again your are definetly our new home in philly!!", "title": "best desk staff ever", "helpfulness": 1, "user": "lydia c", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175673769}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Excellent accommodations and service The service was excellent from the time we checked until we left. The room was clean and the bed was very comfortable. The breakfast was a full, hot breakfast and the eating area was very nice.", "title": "Excellent", "user": "Liney G", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180657635}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The people here make traveling such a pleasurable experience! Each and every employee is cheerful, personable, helpful, willing to go beyond the basic job.... Location is outside the downtown area, but since my company is also, it's a perfect commute (<1/4 mile walk). Truly awesome!", "title": "Homewood Suites, City Ave, Philly is GREAT!", "user": "Eileen C", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180416390}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "My stay at the Homewood Suites by Hilton was surprisingly accommodating as I tried to book another hotel in Philly but was redirected here. I was very impressed with the service and accommodations and would recommend this extended stay hotel to anyone.", "title": "The Comforts of Home", "user": "Catherine C", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180416151}, {"rating": 4.0, "title": "Nice hotel", "text": "Hotel was very nice. Complimentary breakfast was outstanding! Staff not very helpful - kinda snobby. Location is not near any attractions - but short walking distance to bus stop if you don't want to drive into the city. $5.00 parking definitely a plus. Had a spectacular view! (We were on the 12th floor) Lounge was nice & food was good.", "user": "A TripAdvisor user", "date": "September 26, 2013", "id": 178908271}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We really enjoyed our stay here. The room was great and the employees were awesome. I left feeling very happy with our hotel choice. I left my hoodie in the lobby and it was mailed to me in days! The staff was very knowlegable with directions and were extremely accommodating.", "title": "Wonderful stay. Best front desk employees", "user": "Michelle C", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178664116}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Our family was in Philadelphia for a funeral this month and stayed one night at the Homewood Suites near City Avenue and I76. We have stayed at this propoerty before ( a few years ago ).The reservation was made just a few days before arrival and I reserved a king suite w/ a request for an upgrade to the one-bedroom at check-in.", "title": "Great rate and service", "user": "Farmerica", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 181819114}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The one-bedroom was great; a perfect amount of space for the kids. Our only complaint about the room was that it was next to the housekeeping room and we heard some loud laundry cycles right around bedtime through the walls.", "title": "Enjoyed our stay", "user": "NYBike", "date": "October 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181153252}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Breakfast is included at Homewood which worked out great for traveling with kids and having an early morning start to the day. It was not the best in the world, the meats were not tastey, but the cereals and breads and drinks were adequate.", "title": "Big Bang for Little Bucks", "user": "KaliaNicole", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 180878214}, {"rating": 2.0, "title": "A series of inconveniences", "text": "Lastly, my youngest daughter left her tennis shoes behind which we did not discover until late in the evening of the day we checked out. We called the hotel and while they werent able to locate them, they asked that we call back the next morning when a manager would be able to check into a secutiry room. Fortunately, we were in town a second night, but at a friend's house. It turned out housekeeping had stored the shoes in a secure room after cleaning our room and we were able to pick them up from the front desk later that morning.", "helpfulness": 1, "user": "David J", "date": "October 12, 2013", "id": 180751102}, {"rating": 5.0, "title": "Toni at the front desk was wonderful!", "text": "I would recommend Homewood for family stays.", "user": "A TripAdvisor user", "date": "October 12, 2013", "id": 180758766}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Rooms are spacious and has nice view if you get the corner rooms facing downtown. Kitchen, morning full buffet and evening welcome back foods are plus. Parking is 5$ per day but I was able to get parking on road free. I stayed for 3 weeks and over all it was very pleasant.", "title": "Excellent value for the money", "user": "Pramnath K", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178386926}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Beautiful hotel. My friend and I stayed here to run the Philadelphia Half Marathon. While a little out of the way from down town, it was beautiful and the staff were super friendly. We had a great time here.", "title": "Fantastic Hotel", "user": "NFGal", "date": "September 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178094868}, {"rating": 5.0, "title": "College Visit", "text": "Everything was excellent except the sofa bed in the suite. Daughter said that it was the most unfortable that she had ever tried to sleep on. It was likely the cheapest quality piece of furniture in the suite. I'd stay again. Just don't bother to unfold the sleeper sofa. Floor would be better.", "user": "A TripAdvisor user", "date": "September 20, 2013", "id": 177975417}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Hotel staff very friendly and helpful. We had room 1209 that was very large, comfortable and quiet looking towards the city centre. Breakfast was very nice and had good variety. The hotel provided, on request, an additional card to access indoor pool and fitness area which is in the Hilton Hotel which is attached. There is a coin operated laundry on 2nd floor. There is a shopping centre a short walk away.The only draw back for us was that we were tourists and did not have our own car. Not hotels fault but to travel in and out of tourist areas(historic areas of city) is a $25.00 taxi fare each way. Public transport not easy to access and felt bait isolated.", "title": "Good hotel need your own car", "user": "Piedpiper660", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 177538673}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "I stayed during the weekend of the Budweiser Made In America Festival. The staff was extremely friendly, and really wanted to ensure that I had a great stay not just in their hotel, but in the city of Philadelphia. They assisted me with securing reliable transportation, referred me to great restaurants (their services were unavailable during the weekend) and went above and beyond the call of duty to make sure that me and my friends were comfortable!", "title": "Outstanding Customer Service", "user": "Kenny J", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 176999466}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 3, "variance": {"poor": 11, "average": 17, "very good": 70, "terrible": 8, "excellent": 153}, "aka": "Homewood Suites Philadelphia - City Ave Hotel Philadelphia", "slim_ranking": 0.202380952381}