{"user_rating": 4.5, "review_count": 73, "name": "Homelea Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Our daughters treated us to a Room with a View, stay at a B & B for our wedding aniversary. We chose Homelea for the view of the Downs. Kingfisher was the room we chose, and we were not disapointed. Fiona and Mark made us feel at home and at ease. The room is large with a comfortable king size bed, and the en suite bathroom was bright, clean and well decorated. Then we steped out onto the balcony to admire our view.........", "title": "Aniversary treat. Pat and Derek", "helpfulness": 3, "user": "DerekO502", "date": "May 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130904781}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Breakfast had to be the full English fry up, but there was a good choice to satisfy all tastes. The Village of Chilham has the North Downs Way passing through it, a bonus if you enjoy walking. The picture postcard Village is a must to see. A perfect base for touring the area. The next time we must book the School room, now that is a Room with a View.", "title": "What a relief a nice place to stay!", "helpfulness": 4, "user": "1960Bill", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127615303}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Having pre booked in January the School Room we were aprehensive about staying because most previous reviews were all good and then reading the last two before we came were terrible. We enjoyed the welcoming family feeling and even felt on leaving that we had been friends for years. The room had wonderful views and furnishings and we even sat out on the balcony to get the early evening sun. The breakfast was amazing and one not to be missed. Will certainly come again.", "title": "Not suitable for people with disabilities", "user": "Anne_678", "date": "April 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 127537058}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Please be aware this hotel has a very steep staircase and also be aware that the Kingfisher Room toilet is next to the clear glass window which has a very short blind enabling anyone in the garden to have a clear view in as you do your business. Breakfast was very poor with thumb size sausages, burnt eggs and general poor cooking standards. The owner also hovered at the door to enforce the change from your shoes to indoor slippers at all times! At the £100 per night paid, it is not worth it! I chose this B&B following the other reviews and that it was given 5 stars. I must say I am unsure whether these reviews are genuine as they describe a place much different to the one I visited. Fiona was far from this polite person that others have described!", "title": "Don't stay there!!!", "helpfulness": 1, "user": "Tim K", "date": "April 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 127412036}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Booked here because of previous reviews BUT certainly utterly failed to meet those standards.", "title": "Overpriced!!!!", "user": "Jeanette0111", "date": "April 2, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 127138173}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "A lovely B&B. set just outside a beautiful village, that offers more than the average guest house. Breakfasts are plentiful and cooked to order with fresh produce supplied by the free range chickens and I would recommend you try the preserves. There are loveley views from the rear of the property. However the noise of the A28 at the front of the house was, in my view, quite noticeable. I appreciate this is out of Fiona's hands, and it is only now I realise how lightly I sleep. Rooms are individual, however we did not have the advertised bathrobes. Fiona is welcoming and has extensive knowledge of the area which she readily shares. There are plenty of walks in the area, much needed after breakfast. The local inns offer good food and if you like to live life on the edge then walk!!!! but do take a torch.", "title": "Excellent Kent Hospitality", "helpfulness": 1, "user": "exhaustedFareham", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117748916}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed for two nights in the Kingfisher room. Swam in the pool, visited the cute kittens and enjoyed our stay and breakfast very much. Look forward to visiting again when the School room is available. Jackie & Terry Patton", "title": "We loved it and we'll be back", "user": "Jackie P", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117737405}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The room was very comfortable and exceptionally clean. There was a slight noise from the road but other than that it was a very enjoyable stay.", "title": "Very friendly bed and breakfast", "user": "Sue502008", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117541110}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Thank you Fiona, a last minute short trip made exceptional by the comfort and friendliness of Homelea. Fabulous view from the \"schoolroom.\" Both rooms exceptionally clean and comfortable, excellent breakfast. 2 nights not enough. We intend to return!", "title": "2 nights not enough!", "user": "kateregan", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117149213}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The Regan family", "title": "A wonderful B&B for a relaxing stay", "user": "jude_nevett", "date": "July 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115580350}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We chose to stay here because of the leisure facilities only to find that they only heat the indoor pool in the summer. The owners sent us very rude emails and said that we were 'unsuitable'. You're not allowed to put your shoes on indoors and they are very nervous about anyone touching anything in case it breaks. They have a lot to learn about running B&Bs and I wouldn't recommend that anyone goes.", "title": "HOW RUDE?", "user": "HelenMC4", "date": "March 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 126377809}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife & I wanted a quiet relaxing weekend away in Canterbury, we found Homelea via trip advisor, and all the reviews we read live up to what we experienced, friendly, good service, we stayed in the School room which was a lovely comfortable clean room with beautiful views.", "title": "Relaxing, Quiet Break away, Brilliant!", "helpfulness": 1, "user": "Lyndsey T", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125691344}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "An all round good place to stay, we would highly recommend for anyone to stay there.", "title": "Fantastic weekend break", "helpfulness": 1, "user": "Karen735", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125236427}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "A smashing B&B just a few miles from Canterbury. The accommodation was lovely with a very comfortable king size bed in a very large bedroom overlooking the lake. Fiona made us very welcome sending up a tea tray with lovely hot cross buns. Fiona also reserved us a table in the local pub which I can thoroughly recommend . The breakfast was cooked fresh and plentiful.", "title": "Excellent choice for a weekend in beautiful Canturbury", "helpfulness": 1, "user": "Sarah W", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124831719}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "All in All one of the best B&Bs we have stayed in.", "title": "Homelea Bed and Breakfast", "user": "JohnBHooo", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119251916}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I travel to the Chilham area periodically for family reasons and I first stayed at Homelea about 6 years ago. Since then I've been back at least five more times and stayed in three of the four rooms available. They've all been very comfortable, clean and attractively decorated with extra amenities (drinks, DVD players, etc). The School Room is quite large and the others I've stayed in a have been much roomier than the normal hotel or B & B room I've encountered in the UK. While I'm not usually in the area as a tourist Homelea's location is quite good. It's not more than a ten or fifteen minute drive into Canterbury and Dover is not all that far away either. Fiona's breakfasts are great and she has never been anything other than warm, friendly and extremely helpful. At this point going to Homelea feels less like staying at a B & B than visiting a very hospitable friend.", "title": "Very comfortable", "helpfulness": 1, "user": "arcoonetoe", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139119535}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Homelea B&B was a really good experience. The landlord was extremely friendly and helpful. The Breakfast was really good and really ideal as its catered to stayers to whichever time they are use to getting up. The location of Homelea seems in the middle of nowhere but it was astonishing how close everything was to pubs, shops, restaurants and tourist attractions.. (10 mins drive) If you don't have a vehicle then travelling may be a bit difficult especially in the evening. The cathedral's in Canterbury is a must, unbelievable architect.", "title": "Very good B&B with local attractions close by", "helpfulness": 1, "user": "Lokz", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138589749}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Canterbury is a beautiful part of the country and would definitely recommend to all those who are looking for something quiet, relaxing and away from the hustle bustle.", "title": "Excellent", "helpfulness": 1, "user": "Emmyz7", "date": "August 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136812153}, {"rating": 5.0, "title": "Amazing place!!", "text": "Stayed here on 6 occasions over 3 years each for two weeks, during college course. Was perfect place to come back to in an evening, warm, clean and quiet for study and relaxing. Fiona was lovely. Can highly recommend.", "helpfulness": 2, "user": "MC1966Belgium", "date": "June 30, 2012", "id": 133082077}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We've stayed at Homelea B&B at least 5 times and every time the experience has been wonderful: Fiona and Mark are warm, down-to-earth and genuine hosts, they make us feel very welcome every time we stay, the rooms are spotless, the beds are very comfortable, the ensuite bathroom is spacious with the funkiest shower. The school room has a great view and waking up to the sound of the birds chirping and watching the chickens (the girls who very kindly later provide their eggs for a most delicious english breakfast cooked by the owner Fiona) roam around the fields is always a very pleasurable experience.", "title": "helped to make our anniversary a very special weekend", "helpfulness": 4, "user": "marc n", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130965657}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 3, "very good": 13, "terrible": 4, "excellent": 53}, "aka": "Homelea Bed And Breakfast Chilham, Kent", "slim_ranking": 0.6, "description": "Set within 6.5 acres, Homelea offers elegant rooms with open, scenic views,backing onto the River Stour and overlooking Chartham Lakes. 3 out of 4 rooms with private balconies overlooking beautiful open spaces. Rooms all individually decorated. Free Wi-Fi. Large safe off road car parking. Bike storage. Traditional full English breakfasts or continental are served daily on a large farmhouse table in the bright and airy dining room. A short stroll from the village of Chilham where two pubs, the white Horse & Woolpack and Shellie`s Tea Rooms serve food. 4 Miles drive from Canterbury, 1 hour from London. In an area of outstanding natural beauty.We are on main bus route. 10 mins walk to Chilham train station. free pick up from Chilham train station if required. Homelea a gem well worth discovering."}