{"user_rating": 4.5, "review_count": 217, "name": "Homewood Suites by Hilton Toronto Vaughan", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My family and I stayed at two different rooms in this hotel in August.", "title": "Terrific hotel close to a lot bu not the center", "user": "screenname060309", "date": "August 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 173095772}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The water in the pool was somewhat cold but clean. Breakfast was very good and with multiple choices. Rooms were very new with nice size kitchen. Rooms were very quiet and clean. Nice dinner for four weekdays. Free parking. Good internet. Close to Vaughan mills outlet (I think largest in Canada and lots of other stuff).", "title": "Great experience", "helpfulness": 1, "user": "Kevin N", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172612826}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "You need however a car to get to center of Toronto and takes about 30 minutes if it is not during rush hour, very nice staff.", "title": "Lacking cleanliness and attention to detail, disappointing.", "helpfulness": 3, "user": "bestfamilyadventures", "date": "August 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 172365602}, {"rating": 5.0, "title": "WONDERLAND JAUNT", "text": "The best size of indoor safe boxes where you can even put your computer etc inside.", "user": "A TripAdvisor user", "date": "August 15, 2013", "id": 172461797}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "My family and I had a great time and enjoyed our stay at the hotel. We took full advantage of all amenities. Food was excellent and staff was very professional and helpful. I would It is very close to all of the places that we wanted to go to (lego discovery center, Wonderland, and shopping) Being located right beside the highway made getting to places very easy. Also, with a Walmart extremely close by, made getting any odds and ends that we need that much easier.", "title": "Second time staying here was disappointing", "helpfulness": 2, "user": "DrChantler", "date": "August 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 171949662}, {"rating": 5.0, "title": "Superb hotel", "text": "We stayed in the two bedroom, two bathroom suite comfortably accommodated our family of four adults. Service from staff was welcoming and knowledgeable. Location is very convenient for any outing in the entire region. Would stay here again without hesitation", "user": "Hanny T", "date": "August 12, 2013", "id": 171911330}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "great staff, great food, clean and neat rooms. I travel 40 weeks a year and this is the place I look forward to be at. I live in and close to the best BBQ states in the US. With that being said one of the ladys said that the night meal was BBQ, I said to myself not me I'm in Canada. Turned out to be some of the best I have every had.", "title": "Solo", "user": "Jim S", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171422610}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "I stayed at this location this past weekend and overall it was a good stay. The breakfast was good and the bed was really comfy. The door to my room did stick a bit so sometimes when I thought it was closed it was not cause it stuck a bit. Also the bedroom wall I could hear my next door neighbour when the went to the bathroom but not too often. All in all an ok stay.", "title": "Decent stay", "user": "Naddy016", "date": "August 5, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 170965106}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "My whole experience at this hotel was amazing....from the moment I arrived, it was a positive service experience and a fantastic suite hotel. The hotel is clean, well appointed, and the included breakfast AND dinner was honestly a surprise. The rooms are fantastic, with Whirlpool appliances in the kitchenettes, and amazing amenities in the rooms. Very comfortable and uber clean, the hotel is an oasis. Heading to Vaughan, Vaughan Mills Mall (2 stops on the 400 away) or Canadas Wonderland? Consider this one!! It's great.", "title": "Fantastic hotel with amazing service for the price.", "user": "Tim W", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170368099}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Am writing this review a few months after visiting, but just wanted to say how well run this hotel is, what a treat the lovely linen is and how convenient to have a breakfast added in, nice touch.", "title": "Congratulation Bill Forest on running a great hotel", "user": "sanmerle", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169947064}, {"rating": 5.0, "title": "excellent hotel", "text": "we visited this hotel the week of July 7 and on the 8th Toronto had a huge rain fall that knocked the power out for 3 hours in this hotel but the staff came together and made the best of it for the guests that were in the hotel and were very helpful and accomodating", "user": "Joe D", "date": "July 15, 2013", "id": 167746038}, {"rating": 5.0, "title": "Beautiful Hotel. Quick to mall", "text": "We stayed here this past weekend. Staff was very friendly upon arrival. The room was very clean. Very close to Canada's Wonderland and Vaughn Mills mall. Breakfast was not diabetic friendly so my spouse had to eat elsewhere but me abs my two young kids enjoyed what the breakfast had to offer. We would definitely stay here again.", "user": "JasonandJennifer", "date": "July 7, 2013", "id": 166642182}, {"rating": 5.0, "title": "What a wonderful place to eat and sleep!", "text": "Stayed here for one night on May 29th 2013 prior to a full day visit to Canada's Wonderland which is just up the road 10 mins away.", "user": "Darlo44", "date": "July 7, 2013", "id": 166607169}, {"rating": 5.0, "title": "Great New Hotel", "text": "Paid CAD$165 incl tax for this room/suite - but worth every penny!", "user": "Maryla G", "date": "July 6, 2013", "id": 166566322}, {"rating": 5.0, "title": "Wedding in T.O.", "text": "As a Hilton Honors member I haven't actually stayed at a Homewood Suite before - but I will be again after this visit! The hotel is new, modern, clean and fresh and the staff are awesome at check in. Parking is free outside the hotel and there are plenty of spaces.", "user": "David M", "date": "July 5, 2013", "id": 166476579}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I was looking for a nice room with breakfast included close to Canada's Wonderland and boy, did we hit the jackpot! This place is incredible. Suite was nicely decorated and large - it had a nice, upgraded kitchen, sleeper sofa in main living area and the separate spacious bedroom had two queens and another TV! It was quiet (even though by the highway) and a short drive to Canada's Wonderland and the shopping mall. Both were minutes away. Bonus - we were there during the week and enjoyed free dinner, too! The kids enjoyed the pool; I enjoyed the friendly service and all the space in the room. The bathroom vanity area was not closed off from the bedroom area but that did not bother us. I will sum it up by saying this was our first experience at a Homewood Suites and because of it, we now search for one in every city we travel to. Thank you, Homewood Suites, for a great family stay!", "title": "Excellent! Loved it! The place to stay in Vaughan", "user": "LoriL3020", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168714357}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Homewood Suites is really raising the bar for all family hotels. We enjoyed an extended stay and found this hotel and location to be an outstanding value. The rooms were beautifully decorated and very comfortable which is worth stating but one expects that they would be in this competitive climate. Each room has a full kitchen which was extremely convenient over our weeklong stay, as was access to coffee and tea 24/7, and a warm, varied, and delicious breakfast every morning. We were pleasantly surprised that a warm meal was offered during the week. For a family of four what a great value. The pool was perfect for young children (not too deep) while parents enjoyed the adjoining hot tub, or a gym workout. I should also add the proximity to all the great shopping places in Vaughan, easy access to major highway to Downtown Toronto, free Wi-Fi and parking are all added bonuses.", "title": "The family hotel for an extended Toronto stay!", "helpfulness": 1, "user": "NorthernON", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168437663}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed 6 nights at the Homewood Suites in Vaughan and had a very nice stay. We had a 1 bedroom suite that provided a lot of living space, kitchen, and good sized bedroom. There was breakfast and dinners on most days which was a very nice feature. The location is pretty good....not walking distance to much other than Walmart, Lowes, and small take out places for food. A 5 minute drive got you Vaughan Mills mall, two large theatres, Colossus and AMC as well as Earls, Milestones, etc. There is also great thai place called Our Thai that we enjoyed. Would definitely stay again and we are in July 2014 for 4 nights.", "title": "Very comfortable and spacious", "user": "KelownaTravelingMan", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 168345376}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "For the past 3 years I have been staying in Vaughan at the Hilton Garden Inn. This time around I tried the Homewood Suites and was so pleasantly surprised by how great the place was! The room layout and facilities are far superior to the Garden Inn and at virtually the same price.", "title": "A home not a hotel", "user": "Jon W", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168133874}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I just returned from a five-night stay at the Homewood Suites. During our stay, Toronto was hit by a severe storm which knocked out power city-wide. I commend the hotel staff for handling the situation calmly and professionally.", "title": "Survived the Toronto Deluge with a wonderful stay at Homewood Suites!", "user": "ShellChelle901", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167625818}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 4, "average": 9, "very good": 41, "terrible": 2, "excellent": 161}, "aka": "Homewood Suites By Hilton Toronto Vaughan Hotel Vaughan", "slim_ranking": 0.166666666667, "description": "Whether you're staying with us for a few days or longer, we are committed to your comfort and convenience. All guests are invited to enjoy our daily Complimentary Suite Start Buffet Breakfast, as well as our Welcome Home evening reception presented from 5:30pm to 7:30pm Monday to Thursdays. The Homewood Suites by Hilton Toronto Vaughan offers the latest in all suites, residential-style accommodations and is the newest of the area's extended stay hotels. Our Hotel is close to Canada's Wonderland, Vaughan Mills Shopping Centre, Vaughan Sports Village, and IKEA. Our spacious studio, one and/or two-bedroom suites feature separate living and sleeping areas. Each has a fully-equipped kitchen with full-size refrigerator, microwave, two-burner stove and dishwasher. MAKE YOURSELF AT HOME!"}