{"user_rating": 4.5, "review_count": 70, "name": "Homewood Suites by Hilton Brownsville", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Family of 5 travelling to see relatives. Checkin was prompt and correct. Suite was okay. Some stains on floor. Foldout bed not very comfy but kids didn't complain. King size bed was nice. Did find human hair on the extra linens in the closet (for the sofa bed). Housekeeping tried to argue that they didn't see any. New linens were brought anyhow. Breakfast was VERY good and staff very friendly and helpful. Bathroom vents connect and a neighbor intermittantly smoked in theirs despite the hotel being nonsmoking. Front desk did try to take care of finding out who had been smoking but wasn't offered to change rooms. Didn't use the pool on site. Business lounge was nice but printer was out of ink. Some trash outside the hotel side doors took several days before being picked up.", "title": "Somewhat tired but okay.", "helpfulness": 1, "user": "leahschatz", "date": "August 12, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116640585}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Overall, not great, but not horrible. Would stay in Hampton Inn next time.", "title": "I was so impressed with the caring staff!", "user": "lisag767660927", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114918800}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "I recently traveled to Brownsville, TX on business. I booked the Homewood because I am familiar with the chain and know what to expect, clean, large room; free breakfast, internet, etc. On this last visit, I arrived late at night and realized I had forgotten my toiletry bag and had an early morning court hearing. I went down to the front desk to see if anywhere was close to purchase toiletries. The sweet lady at the front desk, Shelly, told me where to go and also offered to give me a ride, as my colleague had taken our work car. I am so grateful to her and touched by her kindness. I will not forget that personal touch she added to my stay and will return on my next visit to Brownsville.", "title": "BEST HOTEL IN TOWN", "user": "mjones1747", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114679935}, {"rating": 2.0, "title": "Smoky Rooms and Unhelpful Front Desk", "text": "I came to Brownsville texas on a business trip and stayed in Homewood suites. I have stayed in al major brand hotels around the country and this hotel is now on my favorites list. The rooms are very clean as is the rest of the hotel, and the staff made my stay trully enjoyable. The complementary breakfast and dinner are fantastic and the kitchen staff made it even more enjoyable. i highly recomend this hotel to anyone on business or with their family.", "user": "Hankhillpropane", "date": "June 15, 2011", "id": 113757921}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I would have enjoyed my stay at this particular Homewood Suites it had not been for the fact that I was put on a smoking floor and my room wreaked of smoke. The front desk evening clerk (some guy studying his law books) was inattentive and the only thing he could do was give me a dry mechanical apology and hang up the phone when I complained.", "title": "Nice Clean Hotel", "user": "Mrluthor", "date": "March 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 102098329}, {"rating": 5.0, "title": "Home Away From Home", "text": "I stayed at this hotel for over a month on buisness. The hotel staff were very helpful and friendly. I ate better at this hotel than I do at my own home. The meals were delicious, not just donuts and danishs, or hot dogs and burgers. I left feeling like a part of the family.", "user": "msbldubu", "date": "March 26, 2011", "id": 101639915}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "They welcomed my dogs with open arms, which is important to me because they are my family.", "title": "the best hotel in texas valley", "user": "cazadorbeltran", "date": "March 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100740723}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I would reccomend this place to anyone, and hope to come back again.", "title": "Excellent reviews were true.", "user": "chicasperditatas", "date": "March 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98957865}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "excelente attencion form the manager shradha sojitra for me and my family, as well as the dinning an cleaning personel, great rooms, the best hotel in this category in all the texas valley.", "title": "Great place.", "helpfulness": 1, "user": "fquinter", "date": "February 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 95325257}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Very good value hotel -- the room was a large suite with kitchenette and living room and was spotless. Hot tub outside was clean and nice after long day's drive. Very quiet inside hotel despite being close to highway.", "title": "All the comforts of home!", "user": "mandmleal", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 94199265}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We were in Brownsville for three weeks to adopt a child. The hotel was really nice, good food, good room. Every encounter we had with the staff was friendly and helpful. I can't say enough about how pleasant everyone was, and how accomodating. When it came time for us to leave, they even gave a little book and some rubber duckie toys to our new baby, which was just extra kindness.", "title": "Excellent Service", "helpfulness": 1, "user": "dedelaney", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87153867}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "They are our definite choice for our future trips to Brownsville.", "title": "Always enjoy my stay here", "helpfulness": 1, "user": "castrolucky7", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75508630}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I have stayed here for about a year now about twice a week. I like it better here than at home because there is happy hour at the hotel!", "title": "Wonderful Place to Stay", "user": "blopez", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52178069}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We stayed at this hotel during the week of Christmas. It was our first trip to Brownsville to visit my husband's family with our 8 month old son. They room was very clean. It had a stove, sink, and refrigerator. The staff was so friendly and helpful. The hotel offered free internet, hot breakfast, and dinner (M-T). I would highly recommend this hotel.", "title": "Nice Hotel - Good Beds - Quiet", "helpfulness": 1, "user": "pcsanity", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 42060041}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 1, "average": 7, "very good": 19, "terrible": 3, "excellent": 40}, "aka": "Hawthorn Suites Brownsville", "slim_ranking": 0.0769230769231, "description": "Homewood Suites by Hilton Brownsville hotel is a welcoming and colorful place for your short or extended stay in Brownsville, Texas. Located just off Texas Expressway 77/83, our hotel is directly opposite the Sunrise Mall and very close to Brownsville's biggest restaurant district. All guests can enjoy our free WiFi, complimentary hot full breakfast and evening dinner and drinks, served Monday through Thursday evenings (subject to state and local laws). Choose from a spacious studio with king-sized bed or a one or two-bedroom with separate living area. All suites include high-speed internet access, a full-sized sleeper sofa and 32-inch LCD flat screen TVs with premium cable and DVD players. Prepare your favorite home-cooked meal in the kitchen equipped with a full-sized refrigerator, microwave, dishwasher and utensils. We offer a complimentary grocery shopping service, and if you forget something, there’s a 24 hour onsite convenience store. Our hotel is perfect for both business and leisure travelers - Make Yourself at Home!"}