{"user_rating": 4.5, "review_count": 180, "name": "Homewood Suites by Hilton - Port St. Lucie-Tradition", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "This hotel experience was great - every member of their staff was courteous, dropped everything to assist you if you need assistance, the rooms were spotless and new. The Chef was great and if you needed more at dinner he would come running out of that kitchen to address your needs -they served two meals a day too most days -- i had ten days of a great experience. This place is really beautiful for families or couples. Everyone had a smile everywhere I looked from the cleaning crew to the kitchen to the front desk -- i had two dogs with me too and nobody gave me a hard time anywhere - i highly recommend this place.", "title": "THIS PLACE IS GREAT", "helpfulness": 1, "user": "josephinecarrion", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 104354970}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Hotel was very clean. Staff very helpful and friendly. Morning breakfast was enjoyable.", "title": "GREAT EXPERIENCE - CLEAN HOTEL, FRIENDLY STAFF", "user": "Steve317", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 102635192}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "In early March, my friends and I headed to Port St Lucie from the Northeast for a little golf getaway. Having lived in the Florida many years ago, I was looking forward to getting back to PGA Village golf complex. The Homewood Suites was a perfect choice, since it is only a 10 minute drive, located 2 exits south of the courses right off of I-95. Being this close to the course was great, because we could enjoy the complimentary breakfast served each morning, and still get to the course in time to get warmed up.", "title": "Great golf getaway!!", "user": "usdjjh", "date": "April 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102526939}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Our rooms were clean and comfortable, and the staff was very accommodating. Another great thing was that we were able to work with the hotel to book our golf times. This made things easier for me and involved a few less phone calls.", "title": "The Golden Boy of the family", "user": "caroleona", "date": "March 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 101198001}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The only bad thing was that we had to go home! Already planning and looking forward to next year.", "title": "wonderful experience, clean hotel and great staff", "user": "ddefranco", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101035864}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I picked this hotel because it was near to the hospital where my mother is on life support and we didn't have much time to do a search of the area. I stay at Hilton all of the time for Busness and Lesisure and this seemed like a good choice as I had no clue who would need to sleep with me at the hotel. Upon arriving in the hopsital I called hotel for late check in to be nice, and the lady who answered was very rude. When I asked if I could stay for a few more days, she said, they were sold out! I was like OKAY! Upon, arriving at the hotel that is west of I-95 not east. I had to wait almost 15 mins for someone to come to the front desk. So at about ten at night I finally get up to my room after a long day and the elevator floor is wet and I almost slipped, than I found out my room was right by the ice maker and elevator so all night I listen to that. IUpon taking a shower I found hair inside the shower (GROSS) The trash was never taken out. My list could go on. I did call Hilton and report the hotel so we will see what happens. The bottom line is I have to stay a week and won't be staying here. This hotel has made me rethink staying with Hilton. I just hope they make it right.", "title": "Wouldn't stay at again.", "helpfulness": 1, "user": "fosteringthefuture12", "date": "March 5, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 98997912}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Personnel helpful and friendly, facility bright and clean. Room very spacious and exceptionally well appointed. Breakfast and dinner free, what more could a person want?", "title": "Far exceeded my expectations.", "user": "CharlesAHI", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98497763}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I stayed at this Hotel for more than 2 months - the staff is outstanding, very helpful and friendly. I am a vegetarian and they made sure that there were enough variety for me at the breakfast. I went again in Novemver for a couple of weeks - its just a pleasure to stay there. It neat and clean, convenient location. There is mall which is a walking distance away, couple of gas stations near by, restrautants, Mal wart - very conveniently situated. Also the size of the rooms is incredible, also have a kitchen where u can cook.", "title": "Outstanding Service", "user": "RajGogia", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98082391}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Booked based upon excellent reviews on Trip Advisor. Tip: is in a new development so our GPS (program 2 yrs old) could not find it, but not a big deal. Manny, the manager and front desk staff, was very helpful and friendly at check in. King suite had nice kitchen area with two burner stove, micro and full size refrig, sink and dishwasher. Room looked clean and in order at beginning of night until we needed or went to use some features. There ended up being someone's used soap and shampoo still in the shower (yuck!), no clock radio in room, only one remote for two TV's, no iron or ironing board in room. I did notify front desk of all these situations. They offered to bring remote but we declined and used the one. They did promptly bring down an iron and board. We got by with clocks/alarms on our cell phones. Staff at front desk did not offer anything-discount, etc, for all the missing items/inconvenience. They had a free light supper meal which was alright and a free breakfast in the morning which was good. There is a large dining area to sit in. The main areas, lobby, dining area and halls were clean and nicely decorated. If we had not had so many problems would have been a good buy, but not considering that.", "title": "Beautiful newer hotel but had a few problems", "helpfulness": 2, "user": "wiscgrandma", "date": "February 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 96287688}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Second stay at this hotel. We had a one bedroom suite with a king bed. The one thing I", "title": "Nice modern rooms with Precor exercise room", "user": "KatNick007", "date": "February 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 95339473}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I booked this for a 5-day business trip because it was in a central location to all the places I needed to visit. I arrived late and asked to upgrade my \"studio\" suite to a one bedroom. Unfortunately, the hotel was booked with lots of high school groups and I was very apprehensive about how my stay would end up. To my surprise the \"studio\" was perfect. Plenty of room and the kitchen was quite separate with it's own little table. There was also a sitting area with a couch and the bathroom/dressing room area was roomy. I was on the first floor and there was never any noise which is surprising with the hotel being full. The hotel is located close to a couple of shopping centers with a Publix grocery store and also a big Target. There are restaurants nearby if you're interested. The only thing missing was any kind of \"pay per view\" movies. Since I was by myself on this trip, that would have been nice.", "title": "Pleasantly Surprised!", "helpfulness": 1, "user": "DFHS", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115423780}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We wanted a getaway for a long weekend. Beach destinations in season were too pricey. This place was perfect and despite its location there was LOTS to do! We had a great time and will return, soon! Superbly clean and comfy! Lots of good restaurants and places to shop.", "title": "Fun in the middle of nowhere!", "user": "travelzim2", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114734020}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Although Port St. Lucie isn't your typical tourist area, I was in town for my nephew's high school graduation & decided to stay at a hotel as opposed to staying with family. The hotel is centrally located in Port St. Lucie. It is a new property (as there is construction still taking place right next door) right off of I-95. A quiet, clean, friendly, perfectly located hotel. I would gladly stay at \"Home\" again!", "title": "Welcome Home", "helpfulness": 1, "user": "LaBeaches", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 113066474}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "This hotel was excellent and it was a perfect stay for the extended family on a vacation to attend my relative's wedding! It was the best few days I ever stayed at this hotel! My family and I were very grateful for my relative's gracious to voucher our stay! My teenage cousins loved there due to wifi, cable, pool, and the golf game, and especially sunny weather!", "title": "Family Wedding/Vacation", "helpfulness": 1, "user": "DoroteaKitty", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104800314}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "I was surprised to stay in a room that accommodates to Deaf guests (doorbell flasher, fire alarm flashing lights, and tv has closed captioned available). I highly recommend this hotel to Deaf people who plan to stop by in Port St. Lucie, FL. To Deaf peeps, you can request a room with accommodations and they will be happy to comply with your request.", "title": "Must See / Stay", "helpfulness": 2, "user": "Always_on_the_Road31", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104539092}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "All is perfect. The breakfast and the manager's lunch was great. The Tradition village with a lot of restaurants ans shops is at a walking distance.", "title": "Perfect", "user": "william1071", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100976002}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Stayed here with my family and friends while going to see a couple of Mets Spring training baseball games this weekend. The room was big, comfortable and so very clean. The bed was extremely comfortable and the kids were all HAPPY! The staff was so friendly and always ready to help. The breakfast in the morning was very nice, with fresh fruit, hot coffee, eggs, sausage, cereal, juice and an assortment of breads and bagels. We plan on making this our place for spring training....You will love it!!", "title": "Absolutely Wonderful!", "user": "TeresaC023", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100973509}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "great hotel. would stay again. kit at front desk was very helpful and nice. stayed in king size suite. very clean and comfortable. across the street from tradition. nice place to visit to eat and walk around lake. half hour to beach if travel is not during rush hour.", "title": "wonderful stay in port st. lucie", "helpfulness": 2, "user": "meryp89", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 100637649}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband & I stayed here for two nights in early March/11. The staff was outstanding. The room very clean. Breakfast a bit different than other hotels offering free breakfast in that they feature a different hot item(s) each day. They have all the usual cereal, fruit, yogurt, pastries too. The eating area was spotless and tables were cleaned frequently. In addition a simple dinner was also offered - usually salad and hot entree complete with free wine & beer.", "title": "Great Hotel, great value", "helpfulness": 1, "user": "3lutz", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100436548}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "We had a problem with our TV and the staff did there best to solve the problem, when it became apparent that they could not correct the problem during our stay and most rooms were booked we were more than fairly compensated for the inconvenience. The staff was simply outstanding and friendly. Great value. The hotel is very close to shopping, restaurants and a grocery store.", "title": "Mixed Review", "helpfulness": 1, "user": "mjbeckett", "date": "March 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 1.0}, "id": 100270551}], "location": {"country": "United States", "city": "Port Saint Lucie"}, "stars": 3, "variance": {"poor": 3, "average": 11, "very good": 24, "terrible": 2, "excellent": 140}, "aka": "Homewood Suites By Hilton - Port St. Lucie-Tradition Hotel Port Saint Lucie", "slim_ranking": 0.181818181818}