{"user_rating": 5.0, "review_count": 81, "name": "Homestead House Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We loved the Homestead House. It's in a small town that is close to everything you could want. Found an ice cream shop close by, Pizza up the street.", "title": "A Great Place to Stay! Comfortable and Homey with a Plus!", "user": "Debimlee", "date": "October 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21147056, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We stayed in the Speak Easy Room, which had a trap door in the floor that was used back in the day when it was a Speak Easy to stash guns and money.", "title": "Awesome, Affordable, Adorable Antique Bed and Breakfast!!", "user": "hapbot", "date": "September 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19839609, "likes": {"liked": "— the amazing room and bath"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The bed was so unique, the head board looked like a tall wing-backed sofa. We liked it so much, we found one similar for our bedroom back home. Very cozy and comfortable. Loved the decor of the whole place.", "title": "Lovely property, lovely people!", "user": "PiledHighandDeep", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17650177, "likes": {"liked": "— Spacious, modern, private bathrooms"}}, {"rating": 5.0, "title": "Charming B&B Near Great Restaurants", "text": "The bathroom was great, a long clawfoot tub with jets and a separate shower next to it.", "user": "ilovepittsburgh", "date": "April 13, 2008", "id": 15010614}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Had a great sleep, and breakfast was so worth getting up for. Deanna is a great cook, every thing was scrumptious. She is also very knowledgeable about the house and it's history, sharing pictures of it's renovation, which was quite a job. Well done!", "title": "Our Stay at Homestead", "user": "howeyd2Macomb", "date": "April 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 14708869, "likes": {"liked": "— Great Breakfast", "disliked": "— Too business like for us"}}, {"rating": 5.0, "title": "Stay here", "text": "My partner and I were given the gift of a night's stay at the Homestead House in Willoughby. It was an awesome experience. The house was beautiful, the rooms were large and comfortable and the breakfast was the best I've had at a B&B.", "helpfulness": 3, "user": "laladays", "date": "August 21, 2006", "id": 5631525}, {"rating": 5.0, "title": "Loved our stay at the Homestead House", "text": "We spent months planning the perfect wedding for bride and family who originated from Willoughby. All we needed was a great place for the out of town bridal party and family to stay and be together. After contacting Deanna Rowe and touring the Homestead House B&B, we agreed to rent the entire house for this big event. The B&B was a perfect location for our family with walking distance to the spa for our hair and manicures, rehersal dinner at \"Oliver Twists,\" everything we needed was provided to us at the Homestead House. Each room was exquisitely decorated with elegance, generously sized, and private baths. The bed was very comfortable and the rooms are very quiet. This was a real bonus due to our need for sleep. Deanna provided a beautiful breakfast considering our needs to keep a tight schedule for all our arrangements. Fred was never seen until it was time to leave, but I am sure he was always busy. The Homestead House was very clean and organized, with good parking and a great front porch with nice rocking chairs to relax and watch. Location was a very big factor when booking this B&B because the wedding was at the Catholic church about 1/2 mile away. Willoughby has always been our favorite city to live, and now to visit. Now that the wedding is over, I am looking forward to visiting the Homestead House B&B for a relaxing stay for my husband and I. Deanna and Fred, thank you so much for helping to make this very special event so memorable and perfect for my daughter and her husband, and us. You are the best. Bravo to you!", "helpfulness": 1, "user": "motherofthebride807", "date": "March 9, 2008", "id": 14172441}, {"rating": 5.0, "title": "Wonderful first B&B experience!", "text": "When visiting relatives in Willoughby we usually stay in a hotel but I was tired of staying in a cold business atmosphere with no warmth and stumbled upon Homestead House on this website. We sent a nearby relative to visited the B&B and she gave it rave reviews so we booked our very first B&B stay there and it was a great choice!", "helpfulness": 3, "user": "lilacbirman", "date": "September 1, 2007", "id": 8592823}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "First off, the innkeeper Deanna was very responsive to all my emails which was already a huge plus for me. Her breakfasts were served with coffee & orange juice and each day we were in for a delicious and filling treat!", "title": "Excellent!", "helpfulness": 2, "user": "swcaoh", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8505152, "likes": {"liked": "— Quality of Accomodations - Great Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We enjoyed sitting in the rocking chairs on the large front porch which was great for people watching while sipping on a \"cuppa joe\". We stayed in the Fine Arts room which has a lovely European four poster bed covered with beautiful bed linens. I felt like a princess sleeping in such luxury! There is a shower and a separate Jacuzzi-like tub which my husband totally enjoyed.", "title": "Darling bed & breakfast!", "helpfulness": 1, "user": "bedandbreakfastfans", "date": "August 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8401664, "likes": {"liked": "— Location (beautiful little town full of flowers), one-on-one service, quiet little home, and delicious breakfast!", "disliked": "— I can't think of anything I didn't like."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "I am a VERY light sleeper (even the ticking of a clock keeps me up at night) so I normally travel with a sound machine but forgot to bring it on this trip. Because the train passes within a mile of the home, I was awakened several times the first night but was surprised that the next two nights were pretty restful (must be the comfy bed). Other than that it was really peaceful and quite.", "title": "Friendly and welcoming at the Homestead", "helpfulness": 6, "user": "Grace_MacNeal", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5933310, "likes": {"liked": "— Comfortable bed and great clawfoot tub"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed here for the second time but choose the Sanctuary room this time just to try something different. (Our first was in the Fine Arts room which is lovely but not the best place if you want to read in your room because the lack of a reading lamp.) Anyway, the Sanctuary has a king bed and the window faces the building and parking lot next door. There's a vanity with a little lamp on it, and a love seat with a reading lamp...great for us because we a big time readers! There's a nice wardrobe and a large chest of drawers with a 20\" (my guesstimate) TV which was sufficient for us since we didn't really watch it all that much anyway.", "title": "Great Second Stay", "user": "lilacbirman13", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50925818}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The bathroom is a decent size, it has a shower with a large shower head plus a double headed body spray which is wonderful! We were very comfortable and happy in this room!", "title": "Darling", "user": "missisoda", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40707791}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Breakfast was excellent as usual and this time the B&B was booked for the first few days we were there and it was nice to meet the different people staying here.", "title": "Homestead House felt like home.", "user": "theyoung7", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34974785}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We enjoyed walking next door to Arabica to grab a cup of coffee and stroll down Erie Street. What's nice is the vendors pretty much know each other. I love that small town feel of this place!", "title": "Delightful, very accommodating and a GREAT Breakfast", "user": "mrsp678", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33587917}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Just as in last review a couple of year ago, I would highly recommend Homestead House B&B!", "title": "You MUST Stay at this Amazing B&B!!", "user": "CityGirl63", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29419328}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 80}, "aka": "Homestead House Bed & Breakfast Willoughby, Ohio", "slim_ranking": 1.0}