{"user_rating": 4.0, "review_count": 95, "name": "Homewood Suites by Hilton Columbus Hilliard", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "1.Whirlpool only just lukewarm. :-(", "title": "nightmare", "user": "ohiolady57", "date": "January 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 4373274}, {"rating": 5.0, "title": "Love Homewood Suites", "text": "2.Hotel claims to have high speed Internet....very very slow. Annoyingly slow.", "user": "A TripAdvisor user", "date": "January 10, 2005", "id": 2997339}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Rented a suite for child's birthday party sleepover. Could not believe how hard working the front desk guy was on evening of April 9th. He was constantly on the move, providing towels, picking up common areas, etc. Provided a dvd player for our use. We were pleasantly suprised at the cleanliness of the room and facilities. Only con was the slippery wet tile right outside the pool area.....suprised no one wiped out there.", "title": "Very accomodating", "user": "ttoo", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 103795797}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We stayed at this hotel after a day with the kids at COSI. We could have made the 2 hour trip back home, but wanted a weekend away that included allowing the kids to swim in the indoor pool. We had done this last year, and stayed at the Hampton Inn Polaris, but their queen suites were already booked. The Homewood Suites Hilliard was clean, the staff was friendly, the free breakfast was adequate, and our 2 bedroom king suite was a good value ($134). The only issue was the beds - they were so uncomfortable! - they were too soft, to the point where I felt like I was going to fall off the bed if I was near the edge. We have stayed at many Hampton Inns (a Hilton property like Homewood), and always find the beds to be extremely comfortable. Had the beds been comfortable, I would have rated this hotel \"Excellent\". Unfortunately, because of the beds, we will not go back.", "title": "Nice hotel, but the bed was extremely uncomfortable.", "user": "smudpu", "date": "February 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 97427165}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "I recently traveled with my boyfriend and a group of 4 friends (and my dog!) to Columbus to watch our Alma Mater play OSU. We rented 2 suites and could not have had a more pleasant stay!!", "title": "Great stay!!", "user": "polkadotqueen", "date": "November 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 87524731}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The suites were spacious and very clean. I cannot tell you how helpful it was to have a full refrigerator, microwave and stove top. It made cooking and storing tailgating food a breeze! Everyone at the front desk were so helpful and accommodating. They were quick and happy to give directions and taxi recommendations. The breakfast staff were friendly and the food was always stocked and fresh! We didn't use the indoor pool and jacuzzi, but although it was small, it looked like it would do the trick! It's not like people travel to Ohio to stay in a beach-like resort! ;)", "title": "My Home Away From Home!!!", "user": "PattiOMalley", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81321579}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "The beds were super comfy and our rooms were quiet. The staff was nice enough to accommodate our request to keep our two rooms fairly close to each other - def a bonus!! Not to mention, they are pet friendly, so I didn't have to leave my little guy at home.", "title": "Best customer service ever!", "user": "buckigirl15", "date": "August 16, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 75540653}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Hotel appeared nice when we walked in. Once in our room, we noticed there was no door knob on the bathroom door, just a big hole where someone sawed it out. Travelling with 2 young children, so the idea of a suite was perfect, however when we opened up the pull-out couch there were sheets already on it. It was pretty obvious they WERE NOT CLEAN, when we saw clothes all bunched up in the sheets. We tried calling the front desk to complain, and nobody answered (about 9:30pm). So we went down there, where we were handed new sheets, and told to put the old ones in the hallway. Yuck. Then, the girl at the front desk told us to \"make sure you tell the manager in the morning.\" Um, isn't that YOUR job? I was up all night wondering what else in our room was not clean. We will never stay at a Homewood Suites again.", "title": "Never Again.", "user": "lorose", "date": "July 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 73076825}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I drove 16+ hours to get to a family reunion. I chose Homewood Suites over several less expensive alternatives because I wanted the family to have a more \"upscale\" experience. I guess I forgot that sleeping was the key element to a hotel stay. The air compressor running constantly outside my room is so loud that I simply can't sleep. And of course the guests next store having a party in their room doesn't help. The front desk clerk said \"he'd look into it\", and he said that they frequently have guests who complain about the loud air conditioning. If you want to sleep during your stay, I can't say this is the best choice for you.", "title": "It's 3:00 in the morning at Homewood Suites - why aren't I asleep?", "user": "Tryingtosleep", "date": "July 24, 2010", "detail_rating": {"sleep": 1.0}, "id": 72106411}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I enjoy Homewood Suites hotels, and try to stay in them whenever I can. If I had not sampled so many in the brand, I might not have known that I was missing anything when I stayed at this hotel recently. While I found a few things below the bar set for Homewood, it was certainly not enough for me to rate the experience badly.", "title": "Got the job done.", "user": "lo_travels", "date": "June 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 67259394}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Our check in was fast and efficient, and the hotel was in a safe location. The room was clean, but showed its age in the carpet and wall conditions. I didn't find these things to be a problem, but they were evident enough to mention for picky travelers (I am not). As dinner is included, we headed down about half an hour after it began, and there was nothing much to be seen- the kitchen seemed to be understaffed, and the one lady working there was incredibly earnest and apologetic about the situation. We were content to sit and wait for the next batch, but I saw others grumbling about it.", "title": "Below my expectations", "user": "KYtransplant1975", "date": "March 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 59440186}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "We found the bed in the room to be very comfortable, and slept well as the hotel was very quiet. Breakfast was much better, nothing ran out and there was not the rush of people that had overrun the dinner service. The hotel is pet friendly, and has plenty of grass for dogs to relax on. I would recommend this hotel, it would be great for business travelers and families alike.", "title": "You be the judge", "user": "sponnusa", "date": "January 24, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54240784}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "My family stayed here for 2 nights in June of 2009 and thought it was wonderful. We had a 1 bedroom suite for a very reasonable rate. The room was very nice and the staff was friendly. The breakfast wasn't fantastic, but a good free breakfast ( better than danish and cereal).", "title": "Great Hotel", "user": "HRunyon", "date": "July 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36344334}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I cannot emphasize enough how CLEAN my room was.", "title": "A truly underwhelming experience - not worth the extra money!", "user": "hotelguest1Ohio", "date": "June 4, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 16684269, "likes": {"liked": "— There was more space here than the average hotel, it was clean and in a nice location.", "disliked": "— The breakfast, apathetic staff."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "My husband and I stayed here for a wedding recently, and, even with the wedding discount, it was still waaaay over priced for what you get! Aside from the extra room (hence the \"suite), with chintzy cupboards, I'm not sure what else you are really paying for. I wish I had read these reviews beforehand, because they were right on! The breakfast was terrible (they didn't even bother refilling the empty food trays), and very greasy. There are no vending machines, only a 'suite shop' (seriously) that stocks food and snacks to the left of the check in counter, and even then, you have to wait for someone to be available, in order to pay for your items. This includes a paper, since, apparently, $150 bucks a night on weekends won't get you a free newspaper. The staff is okay; a few were rude, especially when I went to check out. Apparently expecting someone to be nice (and, gosh, I don't know, maybe encourage their guests to return?) upon check out was expecting too much. I definitely will not be returning to the Homewood Suites.", "title": "Very Nice Hotel", "user": "wteare", "date": "February 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13677031, "likes": {"liked": "— Nice location, very clean and comfortable. Staff was very friendly.", "disliked": "— Decor was a little dated, and breakfast was really crowded."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007", "text": "We were a little concerned about this hotel after reading several reviews on various websites, but went ahead and stayed there anyway due to a variety of reasons. I'm glad we did.", "title": "So-So Homewood", "user": "carztraveler", "date": "August 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8434157}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The rooms were very nice and clean. (There was a crack in the bathroom vanity, but it didn't cause any problems.) The bed was comfortable and everything was clean.", "title": "Really, This is a Homewood Suites", "user": "drsmarty", "date": "July 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8262715, "likes": {"liked": "— Location", "disliked": "— Hotel is old."}}], "location": {"country": "United States", "city": "Hilliard"}, "stars": 3, "variance": {"poor": 3, "average": 12, "very good": 29, "terrible": 6, "excellent": 45}, "aka": "Homewood Suites By Hilton Columbus Hilliard Hotel Hilliard", "slim_ranking": 0.2, "description": "Make Yourself at Home! The Homewood Suites by Hilton® Columbus-Hilliard hotel offers upscale, all-suite accommodations located on the west side of Columbus in Hilliard, Ohio. Conveniently situated within range of great local dining establishments and retail outlets, our hotel is the ideal accommodations option for short and long term stays in Columbus. Guests will find a wide variety of tourist attractions and recreational activities in the area. Enjoy great entertainment, such as: Columbus Museum of Art, Columbus Zoo/Zoombezi Bay, Huntington Park, Franklin County Fairgrounds, Ohio Historical Center, Ohio State Fairgrounds and the German Village Society."}