{"user_rating": 4.0, "review_count": 251, "name": "Homewood Suites by Hilton Palm Desert", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband and I had been planning to stay at the Homewood Suites in La Quinta, but a few weeks before our trip, we got word that facility was closing and this hotel in Palm Desert would be accepting guests' reservations starting in mid-September.", "title": "Great new hotel, will be better when minor kinks are worked out", "helpfulness": 1, "user": "MGH_9", "date": "October 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 45742287}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We arrived at the Palm Desert hotel several hours before check-in time, but they were happy to accommodate us. We stayed in a king suite, and were probably the first guests to use the room. Everything was immaculate -- neat, clean, and comfortable, and well maintained by housekeeping during our stay. Because the place was new, we inevitably found a couple minor things that needed to be fixed/replaced -- e.g., a defective lamp. Any problem we found was resolved immediately.", "title": "Brand new hotel still working out the kinks", "helpfulness": 1, "user": "50_Star", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 2.0, "rooms": 5.0}, "id": 42179814}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We were looking forward to staying here having stayed almost everywhere in the Palm Desert/ La Quinta areas over the years. Last year we had stayed at the Homewood Suites in La Quinta (that property has closed) and had been turned off by the churlish, imperious attitude of the guy working the at the Front Desk. We couldn't believe our eyes when we saw the same clerk is now at the Palm Desert location! He just can't be bothered (or should I say that everything bothers HIM). This property is sparkling new, but right off busy Cook Street. We requested a room away from the noise. The clerk put us in a room facing construction! After jockeying around trying to find a room that seemed to suit HIM and not US, we were finally given a wonderful room which was quiet and spacious. However, the clerk told us that we'd have to move after a couple days because another guest was going to be arriving. This made no sense to us. There are about 4 floors of rooms there, and we were settled in. I'm a Hilton Honors member besides. We checked out early because of his ungracious attitude (albeit reluctantly) rather than change rooms and have to go through that all over again.. The rooms are wonderful and everything is clean and new. The kitchens are on the small side, though, compared to Residence Inns. There's not much by way of a view, and the hotel is in an area that will ultimately be a corporate park. But it's very convenient to freeways, stores and golf courses. We enjoyed our abbreviated stay and can only hope that the hotel hires some new front desk personnel who understand that the customer needs to be satisfied graciously.", "title": "New Property - Same Attitude", "user": "Criticaltraveller", "date": "January 15, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 53569698}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Newly built spacious hotel, typical of the ‘Homewood’ brand. The rooms are spacious, well fitted and include a small kitchen. We had a two bedroom, two bathroom, three TV suite that gave both parties privacy and a separate social area – excellent. We arrived at 4pm (the website advising check-in from 3pm) and had to wait 30min while a room was prepared, annoying after long flights and driving. The staff are OK but don’t seem too enamoured with having to work, so appear churlish, doing the minimum to get by.", "title": "Spacious Suites Off I10 Convenient For P Springs & Joshua Tree", "user": "Copyrightguilt", "date": "January 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 53014821}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I recommend you insist on the top-floor as the floors are based on wooden joists. If there are children in the room above and they are boisterous you will have a constant low thudding resonating in your room from above (I don’t blame them, I blame their parents) . Breakfast is 'patchy', varying in quality on different days, but remains better than budget hotels' continental breakfast.", "title": "What a delightful place to stay!", "helpfulness": 1, "user": "psimmo", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52378118}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Friendly staff, very clean, nicely furnished. The lobby/dining areas were warm and inviting. Wish we could have stayed longer.", "title": "Not Bad", "user": "mtn_guy_8", "date": "January 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52330462}, {"rating": 5.0, "stay_parameters": "Stayed November 2009", "text": "Our \"Welcome Home Reception\" (a light meal and beverages Monday through Thursday evenings) was stuffed shells and salad. At breakfast, the waffle maker was having issues, but I imagine they've fixed that by now.", "title": "No complaints - they did everything right", "helpfulness": 1, "user": "Dukekit", "date": "November 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50166900}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This Homewood Suite is the best we have ever stayed at. We have been to two others over past years in different states. First it is great staying in a new hotel. Everything is clean, bright and well kept up at this hotel..The \"kinks\", that were mentioned in earlier reviews were ironed out. Our computer and cell phone worked great at this Homewood Suites Hotel. The beds (we had two queen sized beds) were very comfortable. It was nice to have a kitchen. The price we got was very reasonable for what we were given. It was nice to have a real livingroom with a big flatscreen TV, as well as a separate bedroom with another flat screen T.V. We ate the \"light dinner\", which wasn't wonderful, but adequate. Breakfast was fine too. The dinning area is pleasant with TV's and a free newspaper. We felt welcomed and had notbig complaints.", "title": "Even Better than the previous reviews", "helpfulness": 2, "user": "justgazin", "date": "November 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 49092590}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "If I tried to find something not perfect here, I would say it is a 10 minute drive to most of the action on Hwy 111. If you wanted to hang around the hotel, there is only the swimming pool and gym to keep you busy. There are no surrounding places to walk to. The other small complaint I have is the sink is separate from the rest of the bathroom, and the sink area opens up to the bedroom, with no door. So, if someone gets up at night, they either have to turn on the light to wash their hands, or wash their hand in the dark to not disturb someone else sleeping.", "title": "Need a great suite? Look no further!", "helpfulness": 3, "user": "daijobu1", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 48858252}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "All in all, this is definitely a hotel we will return to.", "title": "Highly Reccomended!", "helpfulness": 1, "user": "Jimithing702LasVegas", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48838623}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "My fiance and I chose to stay here for one night (Sat. 11/7/09) somewhat as a fluke. We only ended up here because our \"go-to\" hotels were sold out since this was last minute. I had never stayed in a Homewood Suites before.", "title": "A Nice Getaway to the Desert", "helpfulness": 1, "user": "ricoba", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 47287187}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "As other reviews mentioned this is a brand new (as of Sept 09) location. Everything is in new condition. Very clean and neat! I was impressed upon walking into the lobby. Decorated in a modern motif with lots of bright colors accenting the subdued river rock pavers. The lobby has a nice sitting area which doubles as the dining area for the reception/breakfast. Hot tea/coffee was available in the buffet area when we arrived at 8PM. There was a small sundry adjacent to the reception desk with a modest supply of essentials should one have forgotten a toohbrush or a snack. Checking in was easy/smooth.", "title": "AT&T Dead Zone!", "user": "XYZ019", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46755578}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 12, "average": 36, "very good": 80, "terrible": 3, "excellent": 120}, "aka": "Homewood Suites By Hilton - Palm Desert Hotel", "slim_ranking": 0.227272727273, "description": "The Homewood Suites by Hilton® Palm Desert California is conveniently located off I-10, only 12 miles from Palm Springs, California and just 11 miles from Palm Springs International Airport. Our hotel has a beautiful and modern look that will appeal to all visitors. Enjoy our California sun by the pool, barbecue area, putting green, local park at 30 feet from the hotel or venture outward to all the outdoor and local activities."}