{"user_rating": 4.5, "review_count": 166, "name": "Homewood Suites Syracuse/Liverpool", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "From the moment I walked into the lobby I was greeted with a smile from two employees. They bent over backwards to assist me with anything I needed. I was upgraded to a suite due to the fact that I had a horrible experience and another Homewood suites in a different City. So yes this was a freebie BUT I would pay the going rate any time at this hotel. The room was fantastic. My boyfriend made the comment \"it feels a little like home\". The bed was so comfortable. For the first time in all my travels the cleaning people read the sign (Privacy/do not disturb) and never knocked on the door. So many times I have had cleaning people ignore it, knock or a couple of times walk right in. So if your looking for a nice, clean, comfortable place with great service this is it in syracuse.", "title": "A Stay With a Smile!", "user": "NYKlin", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127310480}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I cannot say enough about this hotel. I am here on business from March 20-23, 2012 and my stay has been oustanding!. Staying here is a no-brainer...beautiful room; clean very comfortable bed; flat screen tv with cable; full excellent breakfast; dinner, wine/beer and to top it off a staff (Richard and Sarah) that exceeds your every expectation. They aim to please and PLEASE they do! No wonder I keep coming back!", "title": "Homewood Sweets", "user": "dnatal", "date": "March 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126484088}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I had to share a room with a co-worker for an overnight in Syracuse. This Homewood Suites was the perfect place to stay. The front desk staff were very friendly and helpful. Our room was superb! We had a kitchen area, a living room/bedroom, then when you walked through the first part of the bathroom there was another bedroom! We were so excited to see that we actually had our own separate bedrooms. The bathroom was separated into two rooms, the first room was just the sink and the second room was the toilet and shower. This was nice because one of us could use the sink while the other person was showering. I discovered in the morning that we had two conditioners and no shampoo. I called the front desk and within minutes someone came to our room with shampoo. The breakfast was wonderful, with lots of options. The complimentary dinner was also excellent, after traveling it is always nice to just be able to eat at the hotel. Sadly this hotel does not have an indoor pool, just an outdoor pool which obviously was closed in the winter. I would definitely stay at this hotel again.", "title": "Very spacious rooms!", "user": "NyCricket", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124857455}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This was my first experience staying at a homewood inn. First impression was clean and cozy room. We both liked the fireplace and we relaxed in the living room nicely. The room itself was very nice and we felt as though we were home. Thats where it ends we had a major problem with our room in the morning and (Sarah) the assistant general manager said that she would refund us our points we used and here it is five days later and they still haven't been refunded. They are eager to take your money but not eager to give back. The breakfast was average(for Free). My wonderful boyfriend planned this great weekend getaway for us and it ended in DISASTER!", "title": "HOME AWAY FROM HOME, SO WE THOUGHT", "user": "sue k", "date": "February 2, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 124028693}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My husband,s our 2 small boy and myself stayed at the Homestead Suties for New Years Eve. First impression of the layout and buildings was great and it kept getting better from there. The main building/lodge was beautiful. So fresh, clean, and beautifully decorated in wilderness lodge decor. My 6 year old son thought we were back at the Disney Lodge in Florida! Check in was fast and Heather at the front desk was one of the nicest people I have encountered in a long time. We headed to our suite and wawe all were extremely happy. It was very clean, very new, and we were given a bottle of wine to celebrate my birthday that night! The complimentary breakfast in the hotel lodge was awesome! Everything from fruit to hot ham and eggs with waffles. I would highly reccomend the Homestead Suites. The staff is very friendly and my family definately felt at home Location is great, very easy to access anything in and around Syracuse. We will be back when we stay in this area!!!", "title": "Happy New Year!", "user": "summerfun01", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122742180}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The short version: With renovations completed, we now again highly recommend this hotel; it remains a very good choice for those staying in the area. The units are conveniently arranged, maintainence and housekeeping are very well done and the staff are consistently polite and try to be helpful, as I'd originally reported in my April 2008 review, \"Completely Satisfied\". It is an \"all-suite\" hotel in which the units are real suites, with two actual rooms separated by doors, as opposed to properties offering \"junior suites\" which are not really suites. Windows in bedrooms and living rooms are screened, open and close, and work well.", "title": "Update on a Very Good Choice", "user": "Rags2006", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 132238524}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The detailed version: About a year ago we'd revisited the Homewood Suites Syracuse/Liverpool, NY and I'd written a reconsideration of the property which was undergoing renovations. I wrote that I'd remove or revise that review when we'd stayed there again after the renovations were completed, and this is that update. The review I'd posted back in April of 2008 still largely applies, and our bottom line opinion is still that this Homewood Suites remains an excellent choice, but it's not flawless, so here are some observations:", "title": "Large, Comfortable Room, But Outdated", "helpfulness": 1, "user": "HaroldHecuba", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131053120}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Most of the rooms are non-smoking rooms; all in Building 2 are non-smoking, but there are six smoking rooms along one side of a corridor on the 3rd floor of Building 1, rooms 313, 315, 317, 319, 321 and 323. The corridor becomes quite smokey at times, and we cannot recommend the non-smoking rooms on the other side of the corridor. Fortunately, one of this hotel's good features is the working windows and a good HVAC system, so inside these rooms the smoking across (and in) the hall is not bothersome, but walking through that hall can be quite unpleasant for non-smokers.", "title": "Looking for an excuse to go back!", "user": "son24055", "date": "May 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130591422}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The recent renovations made the units fresher and more attractive, but some of the changes reflect \"form over substance\". None really detract very significantly from the utility of the rooms, but do seem like lost opportunities and can be minor inconveniences. An example: the new dark wood \"vanitory units\", which replace an older style countertop along a wall, are more attractive, but, being a couple of feet shorter than the old counters, leave less room on top and allow objects to falll off the ends. Another example, hair dryers attached to the wall may be out-of-date looking, but are convenient to use; after the renovations, hair dryers in cloth storage bags kept in the shelves under the vanitory units are not an eyesore, but are also less convenient to use. These sort of trade-offs are reflected in a number of other ways, too, one of which is the replacement of tub/shower combinations with large stall showers; fortunately, some rooms still have tubs, and can be requested; those travelling with young children, or just those who like a bath, should remember to request a unit with a tub/shower combination. (It's easy to shower in a tub, but not easy to bathe a small child in a stall shower!)", "title": "Homewood is Sweet", "user": "Deb G", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129267579}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "So, despite a number of small disappointments, this renovated Homewood Suites will remain our choice for accomodations in the Syracuse/Liverpool/North Syracuse area, where we visit at least once or twice a year, and not just because in the local climate real opening screened windows can be a real asset!", "title": "A very nice location with helpful staff!", "helpfulness": 1, "user": "Sydneycake", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127753214}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We arrived at just about 12:25 PM after a red eye flight and connecting flight from the far west. We just needed a place to sleep because I did not want to chance falling asleep on the two hour drive home from the Syracuse airport. Although our accessible room was not ready they asked the maids to make it up next and we were in the room by 1:00 PM. i thought that was very accommodating. The suite had a living room with a couch, table cooking facilities and a TV. The bedroom had two very comfortable beds. The bathroom was spotless.", "title": "Great place to Stay", "user": "MagillaLS", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120514446}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Homewood Suites feature a light evening meal Monday through Thursday. The schedule for the month is posted in the room. We had stuffed peppers, salad and cookies. Beer, wine and soft beverages are included. The stuffed peppers were tasty but certainly not of gourmet quality, nor was that expected. They seemed very similar to packaged frozen stuffed peppers we have occasionally eaten at home.", "title": "Not bad but could be better", "helpfulness": 1, "user": "Elffriend", "date": "October 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119075326}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "There is a hot breakfast provided in the morning. It was pretty typical of what one expects in a hot breakfast buffet.", "title": "Smoker's Hotel with bad hot breakfast", "helpfulness": 1, "user": "FortuneCat", "date": "September 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 5.0}, "id": 117586781}, {"rating": 2.0, "stay_parameters": "Stayed August 2011", "text": "In summary:: a clean comfortable room, a decent evening meal, friendly, efficient helpful staff", "title": "We have enjoyed Homewood Suites in the past but could not recommend this one.", "helpfulness": 1, "user": "FJEJ0308", "date": "August 28, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 117374793}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The only problem we had is that it was quite difficult to maneuver the wheelchair from the bedroom into the bathroom.", "title": "Outstanding accomodations and friendly service!", "user": "Claire M", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116767159}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Enjoyed our stay in our clean, comfortable, nicely decorated suite. It was like being in an upscale apartment with our own housekeeper! How can you beat that?", "title": "Like home, but better!", "user": "GneeRee", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116284264}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We got a really nice two bedroom suite for a good price. The staff have all been friendly and eager to help. The breakfast, included, was good. They have wonderful, decadent muffins available all day! Those are actually kind of dangerous. :-)", "title": "Great value - Great service", "user": "Bkryzan", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 115425409}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "Our three night stay for five of us (spouse, two kids and their grandmother) landed us here and our one bedroom suite with a full double bed in the living room, plus a pullout sofa and king in the separate bedroom was just what we needed.", "title": "Room configuration was just what we needed", "user": "noelk", "date": "July 16, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 115415827}, {"rating": 1.0, "stay_parameters": "Stayed May 2011", "text": "One frustration was when we arrived we learnt the gym was being repaired (they should have sent us an email or had a notice on their website when I booked the week before)...while inconvenient, they made arrangements for guests to use the facilities at the Ramada down the street, which we did, but opted to use the Ramada's indoor pool instead (a little chilly in mid June in central new York for an outdoor pool).", "title": "Bed bugs", "helpfulness": 1, "user": "BobBoz", "date": "July 3, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 114990676}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stayed there in late May for a graduation. Both my wife and I got bit by bed bugs. This an old hotel under renovation. I would not recommend this hotel.", "title": "Great Hotel with Great Service", "user": "smily21", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112978461}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 8, "average": 6, "very good": 41, "terrible": 2, "excellent": 109}, "aka": "Homewood Suites Syracuse/Liverpool Hotel Liverpool", "slim_ranking": 0.166666666667}