{"user_rating": 4.5, "review_count": 244, "name": "Homewood Suites by Hilton Anchorage", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Recently stayed one night in a one bedroom suite. Room was very comfortable. Breakfast was okay. Toaster kept blowing breaker and when asked if they had another one they said yes, but it is broken! Housekeeping starts early so put the sign on your door if you do not want to be distrurbed. Other than noises from the room upstairs it was quiet when the little ones went to bed. I think this would be great place to stay if you are visiting for any length of time.", "title": "Very Comfortable", "helpfulness": 3, "user": "AKfun", "date": "April 2, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 7269381, "likes": {"liked": "— Room layout and kitchen", "disliked": "— The fact there was a service man in my room when I checked in"}}, {"rating": 5.0, "title": "Everything it was cracked up to be!", "text": "Wife and I, former Anchorage residents, returned for a weekend in March to visit family and wrap up some loose ends from the move last year. We chose Homewood Suites based largely upon its top ranking on Tripadvisor. We were not disappointed, and would stay here again.", "helpfulness": 9, "user": "dave1013", "date": "March 11, 2007", "id": 7011457}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled solo", "text": "No need to rehash the accurate comments already posted, but here are my pros and cons from the visit:", "title": "Have stayed here over 3 times!!!", "helpfulness": 7, "user": "SmilingSandy", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6472885, "likes": {"liked": "— It was clean, it was restful and I love it there"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "PROS: The Homewood is the newest of the three Hilton properties here in the Midtown area. The usual retinue of \"support\" restaurants have popped up within easy walking distance. The newest is the Golden Corral Buffet, which always had a full parking lot and many customers inside. We never ate there, being lucky enough to have a car to get around to other favorite eating haunts. However, it appears you can't go wrong by having a meal there if you so choose. Within walking distance (approx. a half-mile to the north) is the number one sushi restaurant in Alaska, Peter's Sushi Spot, housed in a renovated Red Robin restaurant building.", "title": "\"Maid\" Our Vacation", "helpfulness": 5, "user": "Sooz123", "date": "December 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6318232}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The hotel was clean, the rooms were quiet, and the bed was comfortable. Housekeeping service was friendly and competent. Good shower. In-room internet service was free and fast, and you could go wired or wireless (there is a Cat 5 patch cord in the desk drawer if you want to go \"wired\" and don't have one with you). Breakfast was good and there was a full-time attendant on duty to bus your trays and see that the food got replenished when necessary. We missed the free evening offering on Thursday evening, but it is another option for weekday guests who don't have time to go our for dinner.", "title": "Beyond our expectations!", "helpfulness": 15, "user": "sandy31", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6015441, "likes": {"liked": "— The accommodations were great and the price was great", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "I am a former Priceline fan who was screwed (royally!) when I bid on a hotel in Anchorage and won a room at a place that was not mentioned or listed anywhere on the Priceline site (for good reason), Paying for a dump that was not even a shade as nice as the local hostel, I was as you can imagine, demoralized. I decided to book a \"decent\" hotel room. Using the reviews at this site I decided on Homewood Suites -- and WOW, am I glad I found this place!", "title": "I'm in love", "helpfulness": 19, "user": "Tat8er", "date": "September 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5822545, "likes": {"liked": "— Great suites, comprehensive shuttle service, warm staff.", "disliked": "— The taxidermied bears in the lobby were a turn-off."}}], "location": {"country": "United States", "city": "Anchorage"}, "stars": 3, "variance": {"poor": 6, "average": 15, "very good": 48, "terrible": 7, "excellent": 168}, "aka": "Homewood Suites By Hilton Anchorage Hotel", "slim_ranking": 0.0289855072464}