{"user_rating": 4.5, "review_count": 1659, "name": "Honua Kai Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I absolutely loved staying at the Honua Kai. I stayed in a 3BR unit from 5/15-5/19, and just about everything about the resort was top-notch. I've stayed in Wailea on Maui on previous trips, at both the Fairmont and the Four Seasons, and while those really set the standard for luxury accommodations, the Honua Kai was just as elegant and a lot more accessible.", "title": "Honua Kai is an amazing resort with service better than most.", "helpfulness": 8, "user": "thsieh74", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109723618}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "ACCOMMODATIONS:", "title": "Best Place we stayed on our honeymoon in Hawaii", "helpfulness": 3, "user": "Jetset101710", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109595897}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The rooms were spacious and very clean, and the master bathroom was huge! Having an extra large bath tub to bathe the kids in after a trip to the beach was great. I was traveling with another family, with a total of three kids under five, which made having a kitchen and an in-unit washer/dryer imperative. The kitchen was fully stocked with dishes, utensils, and cookware. The resort staff even included a welcome package with dish towels, laundry detergent and dishwashing liquid. The large lanai is a great place to eat breakfast, and we even cooked dinner one evening and ate it out on the lanai while watching the sunset over the ocean! Finally, the room was pretty high-tech, with individual room temperature settings, an iPod/iPhone dock that can pipe your music into any of the rooms, flat screen TVs, and a DVD/BluRay player. There are no desks, but the large dining room table or the bar area can be used easily for work. Wireless internet is available, and was included in the $25/night resort fee we paid.", "title": "After months of reading reviews, SO SO glad I picked Honua Kai!", "helpfulness": 11, "user": "rodafer", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109584150}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We had a partial ocean view that overlooked an empty lot, but also had a clear view of both the mountains and the ocean.", "title": "A great place with our 5 year old!", "helpfulness": 2, "user": "MommyK", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 109552664}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "RESORT:", "title": "Wonderful Stay for Families with Small Children", "helpfulness": 2, "user": "RobertMSeattle_WA", "date": "May 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109411438}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This is a very expenisive hotel, but worth the money. The style is very tropical, location is great. We had the suite which was really over the top, but very romantic. Try the little bar downstairs for some good drinks and some funny local bartenders!", "title": "If you are looking for style on Maui, this is the place", "helpfulness": 4, "user": "love2ski2008", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110625686}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "May is considered to be off season month, so it's not crowded. It is very clean, staff very friendly. Pools are amazing as well as the Ka'anapali beach. Location is great. Lahaina is 10 min from there. Duke's restaurant is one of the best in Maui. As croats we have been to most of the European and Canadian top resorts, but Honua Kai, Maui has been THE best vacation so far. Zoran, Biljana and Alexander", "title": "For families simply fenomenal!", "helpfulness": 2, "user": "ZokaMaui", "date": "May 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 110302424}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "We stayed in a 1br mtn view in the newer Konea tower. Very nice low key resort. We don't have kids but I think it caters to everyone but club/party folks. Staff were very helpful and friendly. Its worth considering if u want a stylish homey feel. I try to stay away from tourist traps so ask the bellboys where the locals eat!! One place u have to indulge is Ululani Shave Ice....nothing like it!!", "title": "Honua Kai", "helpfulness": 2, "user": "uonlylivonce", "date": "May 28, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 110267296}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Honua Kai exceeded our expectations. We loved the views from our 3-bed apartment, not only of the landscaped pools and gardens but of the ocean with Lanai and Molokai offshore. This encouraged us to relax on our lanai with breakfasts and lunches and occasional dinners prepared in the modern kitchen. We loved the quietness and spaciousness of Honua Kai. The layout of the grounds meant that one could find a peaceful pool spot. My granddaughter, 3, was wonderfully catered for with safe pool areas - and morning feeding of the carp. The steeply sloping beach with underwater rocks immediately in front of the Resort was suitable for snorkeling but not, unfortunately, for swimming or sandcastle-building. However a 5 or 10-minute walk along the beachfront takes you to stretches of kid-friendly and adult swimming beach shaded by trees. Dukes Restaurant on site is excellent.", "title": "Style and comfort", "helpfulness": 3, "user": "yogam", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110142700}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed at the Honua Kai Resort for a week from May 14th-21st in the Konea Tower. Our suite was a one bedroom mountain/resort view. We travel often and found the room to be perfect for our needs. It was clean, quiet, and very comfortable. The bed was outstanding! The rooms are well designed and you don't hear any noise from the other guest rooms. The lanai/deck was very large and we enjoyed seeing rainbows 3 days in a row over the mountains. My recommendation to other travelers: although there is a grocery store within walking distance (across the street) DON'T go there for larger purchases. The prices are too expensive ($7 box of cereal, $5 bag of regular Doritos, $9 for Planters Nuts). I suggest you drive 4.5miles back toward Lahaina to the Safeway grocery store. You'll find prices in line to what you will pay at home.", "title": "Relaxed atmosphere with top of line ammenities", "helpfulness": 3, "user": "SeattleTravelone", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109995541}, {"rating": 4.0, "stay_parameters": "Stayed December 2013", "text": "This is an especially great place to stay with children. Having said that, it's not so great for adults. I wouldn't even get in any of the pools! The pools, rooms, lobby, views, cleanliness, and open areas all make for great family fun. If you are traveling with children do not hesitate to stay here. However I advise you do your shopping at the new Times Market just in front of the second tower. It is better priced than Safeway and has everything. It's new, clean, the staff is friendly and helpful and they have everything. The little market inside Honua Kai is shockingly overpriced and some of the staff needs hospitality training making the Times Market look even better. Other than this minor glitch your family really will enjoy this resort.", "title": "2nd visit to Honua Kai", "helpfulness": 2, "user": "seetheworld2525", "date": "December 9, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 187181890}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The hotel/condo was beautiful. We had a two bedroom room on the fifth floor fully furnished, with a very modern updated kitchen with granite counter tops and modern appliances. The bedrooms were extremely comfortable with king size beds and large ensuite with shower and bath. There also was a large living room and a terrace of the living room and kitchen fully furnished. We had a view of the beach to the south and mountains to the east from our living room. The facility had multiple swimming pools with hot tubs, food and beverage service from the on site restaurant. The beach was adjacent to the pool area and was large for swimming and snorkeling. All in all it was a great six day stay we had at this facility. We would go again in a heart beat.", "title": "Great Condo/Hotel in Mauai", "helpfulness": 3, "user": "Ronald B", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186926233}, {"rating": 5.0, "title": "Beautiful property and absolutely perfect unit!!!!", "text": "This was our third trip trip to Maui and second stay at Honua Kai. The condo/resort was absolutely perfect. Entire compound was high end. The unit was over the top. We stayed in a two bedroom in the hokulani tower (H248), and would recommend the unit and location in a heartbeat. The unit was immaculate and had everything we needed. The view from the lanai was spectacular considering we were the second unit closest to the pools and the ocean. Can't wait until our next stay. Will definitely book the same unit.", "helpfulness": 5, "user": "Tracy K", "date": "December 1, 2013", "id": 186391479}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We rented a condo on the fifth floor with an ocean view and stayed for 10 days. We were extremely satisfied with our choice. Very convenient from Kahului airport, about a 40 minute scenic drive with no traffic. The Honua Kai complex is very clean; from the grounds, to the gym, the spa, the garage, the pools, Dukes restaurant on site...everything. The resort staff and concierge service were friendly and helpful and gave good recommendations on where to eat and things to eat. Very aloha spirit! I love how the doors to the lanai completely folded open letting in the breeze and just made the living area so much bigger! Best of all, nothing beats sitting on the lanai in the evenings with my loving husband and a drink going through the pictures from the days sightseeing events! There are grocery stores within walking distance of the resort if needed. This is a resort that is a must return.", "title": "Very satisfied with this choice", "helpfulness": 3, "user": "BettsnOscar", "date": "November 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186384355}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We rented a studio on the 9th floor via private owner - lovely room and the balcony view was fantastic. We are celebrating our 20th anniversary and spent Thanksgiving week at Honua Kai. There is a a great beach with good snorkeling right out front. Paddle boarding and kayaking for an additional fee, also scuba instruction. The pools are nice, and the cabanas and loungers surrounding them are comfy. There is a great coffee shop in the Hokulani Tower and Dukes restaurant never disappointed (we ate there 3 times). Also a spa, gym and great beach trail for running. You need never leave the property. Yes there are children as well as groups of friends, couples, and family reunions. Everyone is friendly and enjoying themselves - it's not noisy, it's lively and there are places you can go to for solitude as well.", "title": "A little bit of everything", "helpfulness": 4, "user": "GGOT", "date": "November 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 186358606}, {"rating": 4.0, "title": "Family of 4 - thanksgiving trip", "text": "We just returned from a week at the resort. It was a good experience. 2 young girls (in tens)", "user": "Danville_traveller", "date": "November 30, 2013", "id": 186345139}, {"rating": 5.0, "title": "Extremely clean and nice beach view", "text": "Plus:", "user": "Sarah B", "date": "November 29, 2013", "id": 186291180}, {"rating": 5.0, "title": "Our experience at Honua Kai", "text": "- Free parking, Pools were good, close to beach, options for smaller kids and adults to have fun. Suite style with kitchen, close to super market", "user": "Chargers88", "date": "November 29, 2013", "id": 186285892}, {"rating": 4.0, "title": "Lovely Maui vacation", "text": "Minus:", "user": "Joan M", "date": "November 29, 2013", "id": 186267743}, {"rating": 5.0, "title": "Perfect resort", "text": "- Even though we booked a ocean view room, we had a partial view and that too between buildings. If you are in the Konea tower, watch out. There are some basic amenities like complimentary coffee that was missing from the hotel.", "user": "SebBrandt", "date": "November 27, 2013", "id": 186053141}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "This is a newer resort with perfect location between kapalua and kaanapali. It seems quieter than kaanapali and Wailea and has full kitchens with outdoor grills. Pools are great for kids with one small sandy area and one small waterslide. A good value.", "title": "Laid back Maui resort perfect for families", "helpfulness": 2, "user": "Reddogmd", "date": "November 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 185975872}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The Honua Kai resort was an great place to stay. Our views from our 7th floor two bedroom condo were great. The amenities found in the room were excellent. It was truly an upscale condo with great views and a great location.", "title": "Great Place to Stay", "helpfulness": 2, "user": "Bill M", "date": "November 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 185843073}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The staff were excellent as well. Duke's restaurant............on site............was extremely convenient and provided really good food at reasonable prices for Hawaii.", "title": "Great for families", "helpfulness": 1, "user": "Sandy D", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185751418}, {"rating": 4.0, "title": "Couples Read this", "text": "Only wish was that the \"quiet pool\" had more lounge chairs. There were many children on site and it would have been nice to be able to get some sun at the quiet pool. Unfortuately, the limited lounges prevent this unless you got to it fairly early to get some seats.", "helpfulness": 7, "user": "Andy_PDX", "date": "November 23, 2013", "id": 185610345}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "When we go back to Maui we would definitely stay at Honua Kai again.", "title": "Very good resort", "helpfulness": 1, "user": "DSBNorthVancouver", "date": "November 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 185445681}, {"rating": 5.0, "title": "Why stay anywhere else?", "text": "Just finished up a week long stay at Honua Kai Resort and Spa, and we would go back in a heart beat. Our two bedroom two bath ocean view condo was top of the line, and the beds were so comfortable, the best we have slept on anywhere in the world! The grounds are beautiful, the staff very friendly, and great snorkeling off of the beach in front of the resort. It is relaxing and north of the rat race of some of the other resorts. The location was perfect for getting to golf, surf lessons and the zipline. The view from our deck was priceless. We utilized the Viking grills down by the pool , and a grocery store is across the street for any item you need. I would recommend this resort to anyone. Aloha!", "user": "Arsenalmom", "date": "May 22, 2011", "id": 109344132}, {"rating": 5.0, "title": "Was one of the best!", "text": "This resort was one of the best we have stayed in! We were very satisfied with the rooms, staff, pool (was a little small), beach & area. I read reviews before we booked the resort about how there was a bad smell. It is across the street from a dump or something but we didnt smell it at all. We smelled worse traveling around the island then at our hotel and our room was facing the street. It was not bad at all! Dukes is located right next to the pool area next to the beach, there food was great and it was nice having it so close! Rooms came stocked with everything you could need, plus there is a grocery store across the street:) Always had plenty of towels and the room was always cleaned and stocked. We had an amazing time and part of that is thanks to the resort! Also didnt hear any loud noises", "user": "camiehansen", "date": "May 20, 2011", "id": 109093162}, {"rating": 5.0, "title": "Great room, terrific and helpful staff, would recommend to everyone!", "text": "The beds were very comfortable, the room was nice and clean, kitchen was stocked with everything needed to cook, everyone was super helpful and nice. The restaurant at the resort was great. A mini-store on-site was handy, with yummy gelato and many other useful items. The views were very nice. Great location. Was also a little quieter than any resort off of Kaanapali Parkway. But was only a couple lights down the main road from the parkway to Honua Kai. Would recommend to anyone.", "user": "windnsea7", "date": "May 20, 2011", "id": 109021445}, {"rating": 5.0, "title": "Perfect accomodations", "text": "Stayed 9 nights during Easter break. Best condo resort on the island of Maui. Saved a lot money by cooking meals. Times supermarket is easy walking distance. Resort is well maintained. We were never hassled to purchase a condo.", "user": "DriverandMike", "date": "May 19, 2011", "id": 108999724}, {"rating": 4.0, "title": "Not a romantic getaway, but for families with little kids!", "text": "Rented 2 bedroom 2 bath condo through vbro.com. There are many to pick from on this website. Also less expensive than going through resort. We had a beautiful view of the mountains. I did not want to pay an extra $1000 for ocean view since activities and food is expensive on Maui. Parking is $10 a day underground.", "user": "CAfolks", "date": "May 17, 2011", "id": 108718625}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My wife and I have returned from a week stay ( May 27- June 3) at the Honua Kai in Maui. We usually travel to the Caribbean yearly so, this was our first trip to Hawaii. We are in our early 40s and have two children under 10 ( who did not join us for this vacation). We booked a package for a 1 bedroom unit with a mountain view.", "title": "A Great Maui Vacation", "helpfulness": 2, "user": "Farmerica", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 111472984}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our flight landed in Maui around 4:30pm and once we retrieved our bags and picked up a rental car, we were off to the resort. We did stop at the Costco near the airport for a few food and wine provisions, but in hindsight it wasn't necessary. It is about a 40 minute drive in moderate traffic to the resort. We were greeted by a valet who had our name on a list of arrivals for that day. He directed us to the Konea tower ( there are two tower developments) and we checked in quickly and without incident. They have car valet service at the resort, but the parking lot is less than 50 yards from the lobby entrance and we did not see the need for using it to go in and out. There is also an underground garage if you don't want your car sitting in the hot sun during the day.", "title": "Exceeded My Expectations", "helpfulness": 5, "user": "TeenyWahine", "date": "June 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 111215772}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Our room was on the 8th floor and appeared as advertised and described. The mountain view was spectacular every morning and evening. The ocean view would have been an substantial upgrade ( in price ) and we personally found looking out at the great mountainsides as beautiful as looking at the ocean may have been. We had a large kitchen with marble counter and new Bosch appliances. A comfortable living room and dining room area that locked out to a wide balcony with more tables and chairs for outdoor seating. The balcony side of the unit was floor-to-ceiling folding glass doors which we found a great feature to the room-particularly on those breezy maui mornings. The bedroom was also very comfortable, but the dresser drawers were a bit small and shallow. It was hard to put more than a few pieces of folded clothing in them. The bathroom was very big, double sink. large glass shower and a soaker tub with nice marble and tile. There is daily maid service and they did a very good job. But if it is more than two of you in the room, be mindful of the tiny kitchen trashcan. Ours was always in need of emptying and because there was no disposal in the sink, smelly food waste could linger in the kitchen easily.", "title": "Great", "helpfulness": 2, "user": "DecaturTraveler09", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110837789}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "On our first and last night's we ate at Duke's. This is the only restaurant on the property and tends to be busy. We had an hour wait the first night and on the last night sat in the bar area. It is not on the beach, but close enough to see sunset. The service is good, menu is pretty basic hawaiian bar food and they have live music. The Mahi sandwich really stands out, though.", "title": "AWESOME", "user": "leggett1942", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110824955}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The pool areas of the resort are fairly small ( compared to what we've seen at other resort hotel properties ) and they appear to be heavily slanted for children. They are not very deep and there are slides and wading/play areas. The layout of the grounds is nicely done and there appeared to be wait service during the daylight hours around the pool and there are gas grills for guests to cookout if they desire. The gym was a good size and had new equipment. There isn't much of a business center, but we did use it to print out boarding passes the day before departing. The resort view rooms face each other overlooking the interior grounds. It appeared that you would become very familiar with your adjacent neighbors as you would be looking directly into each others' rooms, so keep that in mind if you desire more privacy.", "title": "Excellent location, great vacation, couple of hiccups", "helpfulness": 2, "user": "MannyParz", "date": "May 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110737585}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We recently did a family trip to Honua Kai and could not have been happier! Everyone in our party (8 adults and 2 children) loved it. The rooms are gorgeous. (We had rented through Ka'anapali Beach Rentals - definitely recommend them!) We stayed in K818 which was perfect for us. Huge lanai and great mountain views with even a little bit of an ocean view. Other members in our group stayed in K405 which had a nice ocean view and was really shaded so the unit stayed cool even without the air conditioning. Unit K401 however was AMAZING. If you want to splurge on an ocean view then definitely get one of the units that directly face the ocean and that has a BBQ. Simply stunning!", "title": "Beautiful!", "helpfulness": 2, "user": "Janesse", "date": "December 15, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 187716237}, {"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The variety of pools at the resort was great - especially the shallow pool for our toddlers. Snorkeling off the ocean was a highlight for sure. We saw large turtles on multiple days and lots of beautiful fish. The coral starts really close to shore so it isn't the best area to play in the ocean with kids but there are spots farther down you can go to that are a lot sandier.", "title": "Disappointed", "helpfulness": 2, "user": "Mark T", "date": "December 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 187583842}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Having Dukes on site as well as the market made it easy to pick up drinks/snacks (Even though they are a little expensive) but that seems to be par for the course to Maui.", "title": "Location! Location!", "helpfulness": 3, "user": "Elisabeth Q", "date": "December 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187445674}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "I would recommend this place to anyone! It is truly a remarkable property.", "title": "Amazing condo resort!", "helpfulness": 3, "user": "IATraveler3614", "date": "December 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187398993}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We just spent 6 nights at the Honua Kai on our honeymoon and both left disappointed about the service and overall management of the resort.", "title": "Great Condo/Beautiful", "helpfulness": 3, "user": "KalenaJeanne", "date": "December 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187266736}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 31, "average": 97, "very good": 382, "terrible": 14, "excellent": 1135}, "aka": "Honua Kai Hotel Lahaina", "slim_ranking": 0.178571428571, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Situated on world-famous Kaanapali North Beach, Honua Kai provides an unparalleled level of service and all the amenities of a luxury resort with expansive one, two, and three bedroom suites. Perhaps the greatest luxury of all is simply the space to spread out. Inside, the feel is that of a luxury Maui vacation home, graciously furnished in exotic wood and polished granite, and tastefully equipped with top of the line appliances. The gourmet kitchens contain everything you need to make a fantastic meal. Or simply make reservations at one of our spectacular restaurants. This is the Hawaii vacation you have always imagined, exactly as you imagined it."}