{"user_rating": 3.5, "review_count": 326, "name": "Horseshoe Southern Indiana Casino Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Stayed here for two nights, nice clean rooms. Wireless internet for a fee. Housekeeping was very responsive to requests. We were there for a visit with family. Paula Deen buffet was good as are the other restaurants. Not a huge gambler but the casino was nice, and I didn't loose too much. LOL", "title": "Nice rooms", "helpfulness": 1, "user": "seethemoon", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150710339}, {"rating": 4.0, "title": "Nice enough stay:", "text": "Would stay here again.", "helpfulness": 1, "user": "Travhop", "date": "January 24, 2013", "id": 150536351}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I checked in with a room deal on Trip Reward Site. Stayed in January of this year. Very efficient check in. Room very nice and clean. Plenty of soaps, lotions, etc. Lots of towels. Coffee maker, plenty of coffee. In room safe, easy to use. It was cold but turned heat up and it was tolerable. Bed comfortable, but sheets did not fit tight, even though I requested clean sheets the next day-- still the same. BIG TV ! Customer service at desk in lobby answered my questions and where very polite. Food there was decent but expensive. JB's on 2nd floor of casino has good sandwiches. Paula Dean has good Seafood to my taste anyway. Lunch is cheaper there. A good stay but received a charge on bank statement when I got home. It was for bottles of water in the room that I did not drink. I called them and finally talked to a person named Sarah that assured me that it would be taken off bill. The bottles where almost $5.00 a piece. She said possibly they did not credit them to the last occupant in the room. So, don't drink the water-- unless you want to be charged high prices. Lol. All in all the visit was pleasant and a good respite. Thank you, Sarah!", "title": "Fun for an overnight stay", "helpfulness": 2, "user": "Deb J", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150255019}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed at Horseshoe for one night. I booked online and got a special of $59.99. The room was nothing special - just a typical hotel room. The valet was a very helpful and polite young man. The check-in personnel could use a little customer service training. I understand that they repeat the same thing over and over, however, not everyone is a repeat customer to your facility. When asked a question, please reply with more than a yes or no. The other hotel personnel we met always greeted us with a hello/can we help you. The walk over to the Casino/resturants is not bad at all. They do offer the moving sidewalks or a golf cart they continuously runs folks over. The casino is nothing great, but fun for a little entertainment. They offer a few shops and resturants, and you would need to drive into Louisville for additional entertainment, if you stayed for more than a couple of days. Overall, a good overnight getaway, if you live close.", "title": "Loved it - can't wait to go back.", "user": "ohappyday10", "date": "January 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 150016526}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Well, the thousand dollar slot win didn't hurt, but I already was impressed with the hotel. Comfy room, big flat screens, very clean. I would go back to the hotel even if there wasn't a casino attached.", "title": "Not for non-smokers", "user": "Tawanna T", "date": "January 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 149991541}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "Horseshoe southern Indiana is about 10 miles away from Louisville KY right on the banks of the river. Beautiful location with hills behind the property.", "title": "My favorite casino resort", "user": "kiratan", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145211994}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I am a regular visitor to this property and most of my visits are comped by the casino. The rooms are great, especially the ones with a Jacuzzi. The beds are extremely comfortable and is perfect after a 24 hour gambling session :)", "title": "Great Hotel, fantastic getaway", "helpfulness": 2, "user": "Chief2681", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 144937758}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The property has a great swimming pool, very good restaurants etc. I am a big fan of their Paula Deen buffet.", "title": "Clean, new, modern. Great accomodations", "user": "dizwiz24", "date": "October 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 143910098}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Always ask the front desk for a comped meal before you go to the restaurants. They might just write a comp ticket for you.", "title": "Clean, Adequate but lack of Staff Servicing Patrons", "helpfulness": 3, "user": "rtwrtwrtw", "date": "October 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 143698236}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "It may be in the middle of nowhere but the Horseshoe hotel in Elizabeth, IN is an amazing place to getaway, relax and unwind. The rooms are well maintained and the staff is fantastic. I haven't never had a bad experience in the four times that I have stayed there. It has some great resturants near the Casino and Paula Dean's Buffet is a fat man's dream. Even if you are travelling with Children there is enough seperation of from the hotel and casino that it is not a problem.", "title": "Room Okay but sink wouldn't drain", "user": "trouble38", "date": "October 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 143524518}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had a nice room equiped with a coffee maker but nothing to go with it. The room appeared to be clean and the room was very comfortable. We ordered room service for breakfast and when we moved the seats for breakfast we found some disgusting items housekeeping failed to take care of. We won't go back.", "title": "Housekeeping Should Try Harder!", "helpfulness": 1, "user": "mdq42", "date": "December 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 147459740}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I guess I was in a \"Comp\" room. It was very clean and cozy. The TV was as big as the bed. The only problem was that the A/C and Thermostat was right next to the window. (Which confused the thermostat) The \"In-take\" and vent was all together in the corner. No air flow what so ever. Staff was awesome and friendly.", "title": "Air Flow?", "helpfulness": 2, "user": "Greydog98", "date": "December 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 146858688}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Stayed at casino/hotel over this past weekend with my wife. Hotel rooms are large, clean with comfortable beds. casino is 4 levels with plenty of slot machines, table games. Blackjack tables were filled to capacity until 1 a.m. friday night. Nice variety of restaurants with 24 hour room service friday and saturday. Hotel is close enough to Louisville that driving to downtown is a snap. Will stay again.", "title": "Nice weekend escape", "user": "erhwil", "date": "December 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146714290}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I have traveled to this property several times to enjoy the resort and casino. This was my fifth trip and I drive 230 miles to get there. I arrived Sunday, November 18th around 1:45 pm. I was told there was a $10.00 early check-in fee if you check in before 3:00 pm. This was a new policy implemented on October 1. There was no mention of this when I made the reservation online on October 28. Nothing also on the reservation confirmation page. Other than this bump, the hotel room was clean and included a safe and a refrigerator separate from the mini-bar. The staff throughout the hotel and casino were all very nice and said Hi whenever you passed them. There are two restaurants besides the buffet. I have eaten at Legends twice and the meals were not that good. This time, I ate at Pearl, the Asian restaurant. The food was good. I paid $13 for cashew chicken.", "title": "Early Check-in fee", "helpfulness": 1, "user": "Tim266", "date": "November 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 146036529}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Visit the above property on October 25 and 26. My wife enjoyed the friendly staff we encountered at the Hotel and casino. This made the trip so much more enjoyable. The breakfast staff were very friendly and professional.", "title": "The staff at the Hotel and casino were wonderful", "user": "Buck1907", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145465230}, {"rating": 1.0, "title": "It stinks", "text": "If you are a non smoker stay away from this place. The hotel and Casino reek of smoke, never been in a place as bad as this. Seems like they have no ventilation . On to top of that they charge 10.95 per night per device for wifi. We could not get a data connection on our smart phones. They claim they do not block the signal, but soon as we got out of the hotel we got a connection. They refunded our money , but we would never go back. FYI been in Jersey casinos when they had smoking and in was never as bad as this place.", "helpfulness": 1, "user": "Oliver D", "date": "January 13, 2013", "id": 149586615}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We have stayed at this property twice in 30 days and found it to be really clean with large tv and small fridge. The beds were of good quality but towels were of very poor quality and (RUFF) The air flow from the furnace was really weak as noted by other guests on this site.The hotel was quiet considering it was attached to a casino and staff was very nice. Food choices were limited with long lines and a little pricey for the type of property.bring your own soda and snacks. We had chicken from Paula Deans carryout and it was very good.", "title": "Average room,super clean", "user": "lifeisshortOhio", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 148818862}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "EVERY YEAR,DERBY TIME!KENTUCKY IS WITHOUT CASINO'S-GOTA GO TO HORSESHOE-Been there 10 years in a row-we have our room on the 1st. floor-excellent but walk is the most difficult since nam-2 to 3 times a day-six trips!!!-book very early if you want a room--but our room is delightful-we are vip's there so we get some perks-hotel overlooks the mighty OHIO RIVER when in spring time can flood. Boat floors move up and down depends on river height-main hotel is stable always.3 restaurants of note,LEGENDS-crazy good food-BINIONS-dark,moody, romantic-PAULA DEANS BUFFETnot worth the price food stinks(sorry paula) charlie T.-P.S.-CASINO same old same old-seen one you have seen them all", "title": "LONG WALK -SHORT PAYOFF'S", "user": "PIGEARS", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148476602}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The rooms here are pretty nice and are worth the price, especially when the price is low from one of their special deals or a Total Rewards comp. The beds and furniture are comfortable, the amenities are nice, the TVs are big and flat, the bathrooms are roomy and well lit - all the stuff that makes a hotel room nice. We're just glad that they got rid of the \"you bump it, you buy it\" mini-bars in the rooms.", "title": "Nice Rooms", "user": "LouieBiz-com", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 148462356}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The indoor pool area is nice too, even if it is a little bit of a hassle to get to and may require multiple elevator rides. The pool itself is seldom busy and, while not huge, offers enough room to swim and play and have a good time. There is plenty of seating around the pool to sit and chat. The hot tub is nice too but the occasional \"mystery foam\" that develops while it's running can be a bit off putting.", "title": "Very Nice Accomodations", "helpfulness": 1, "user": "Johnny-Q2", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 148355246}], "location": {"country": "United States", "city": "Elizabeth"}, "stars": 3.5, "variance": {"poor": 36, "average": 69, "very good": 113, "terrible": 29, "excellent": 79}, "aka": "Horseshoe Southern Indiana Hotel Elizabeth", "slim_ranking": 1.0}