{"user_rating": 4.0, "review_count": 392, "name": "Horseshoe Casino and Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Stayed 3 nites this past weekend. Clean room, comfortable bed & deep soaking tub. Would def stay again. Casino did get somewhat crowded on Saturday nite but walked over to Roadhouse & could play with no problems.", "title": "Weekend stay", "user": "kftw", "date": "January 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 151107111}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We have been going to the Horseshoe at least once a month for the past year and it seems there is always some problem or other. We asked for a smoking room and when we got into the room there were no ashtrays. I called the front desk and they were going to send them right up. One hour later I went to the casino and brought two ashtrays back to the room. Upon arrival I called housekeeping and asked for two robes and after numerous calls we finally received them after two hours. On the plus side the beds are extremely comfortable but the pillows are horrible. It's a choice of sleeping on a mountain or sleeping on a pancake. By accident I dropped something behind the sofa and had occasion to move it. I wouldn't want to tell you what was behind there. I don't think they have been cleaned in forever. The second day of our stay we were leaving the room and the cleaning person was next door. I told her we were leaving and she could clean the room. We got back about 4 pm and the room still wasn't cleaned and there was no cleaning cart or cleaning person on the floor. The staff is extremely friendly and courteous. If you haven't had breakfast at JB's you need to do so. They give you more than enough and it is delicious. On the other hand the buffet leaves a lot to be desired. If possible don't miss Friday nights at the buffet, that is the only time the food is good especially if you like seafood. The buffet is a little pricey but well worth it. We will continue to go to the Horseshoe and just hope their housekeeping improves.", "title": "A little disappointing", "user": "Sally M", "date": "January 27, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 1.0}, "id": 150761742}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed there for 4 nights in Jan.Very nice Hotel and Casino.Rooms were beautiful and nice and clean.Staff was friendly and helpful.Beds were comfortable.Room has a refrigerator and coffee supplies.If I could find a fault it would be that the casino is very smokey and I could find no non smoking area.But overall a pleasant experience.", "title": "Woodeye", "helpfulness": 2, "user": "woodeye66", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150524636}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Apparently booked this room through Priceline...was not aware that I had done so, just pulled up a Horseshoe Casino browser and booked a room. Upon trying to check-in on 1/20/13, the concierge informed me they did not have a reservation for me...Sorry!! We left dazed and confused and I went to retrieve my laptop. Went to the Starbucks inside, paid nearly $12 for a Wi-Fi connection from Horeshoe to retrieve my confirmation number. Upon presenting my confirmation number, she said \"Well, you didn't tell me it was in your maiden name\". I preceeded to to tell her I didn't book the name in my maiden name and when you fill out your booking information and billing information, you use your current information. Patially to blame is Priceline, whom I have never used in my life, so be aware when booking through them or a general browser. I then asked the manager if we could get a comp for the ridiculous charge I just had to pay to retrieve the confirmation number or some other type of comp to which she replied, \"No, I can't help you...besides, you don't even have a players card here\". Well lady, I do have a player's card to any Harrah's property. I am going up to my room, taking a shower and I will NOT spend a dollar in this hotel for my stay. I will spend my hard-earned $$ at one of the other 3 establishments here that appreciate my business and don't belittle me. The room itself is average to good. The carpet needs replacing or cleaning as it is dirty in spots.", "title": "Poor Customer Service!", "user": "blondie37tn", "date": "January 20, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 150129820}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Stayed at the Horseshoe for 3 nights in December 2012 with my husband and mother-in-law . The hotel is beautiful. The rooms were clean. The bed was very comfortable. We both had king premium rooms (they are closer to the elevators). That worked out well because my mother-in-law uses a walker. The refrigerator in my room was noisy so my husband called for another one. Not a problem, a replacement was delivered within 15 minutes. The room had 2 flat screen TVs which I was able to hook up a HDMI cable and watch movies from my computer on the TV.", "title": "Great Time", "helpfulness": 4, "user": "bizzee1", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149542779}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "This was my first visit to Horseshoe in Tunica. Check-in was quick and efficient. Room was so far away from the elevator that I felt like I was in another state, even though I had asked for room close to elevator, due to physical limitations. Bellman/valet parking attendant was not nice - made for a sour note to begin my stay. Room was decent and clean. Like location, as it is in a cluster of other casinos. Restaurant choices were disappointing; wish there was a soup/salad bar/sandwich cafe. Will go elsewhere (probably Hollywood) next time.", "title": "OK, but probably won't be back", "helpfulness": 1, "user": "TexasTerry317", "date": "June 29, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 133069961}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "First time to Tunica MS. We were shocked that the casions are grouped so far away from each other in the middle of farm lands. I guess we were expecting alittle Vegas. ( Since we had just recently visited there in March). Hotel is clustered with the Roadhouse and Gold Strike conveniently snuggled between them. After driving 13 hours from San Antonio,Tx hotel staff graciously checked us in early. Our room was clean, bed was comfortable and plenty of towels in the restroom. Shower pressure and hot water were constant - no cold water in the morning when someone flushes. Only down fall of the room was the door stuck and made a loud \"slam\" noise when you closed it, even when you tried to be quiet at 3 am. Security and attendants were visible and courteous throughout hotel and casino. We ate at the buffet for lunch on both days and the menu did not change. Food was adequate.. However the grilled pork chop and egg drop soup were \"food network\" worth. Slots at the casino seemed tight but we had fun losing it. We will definitely chose this hotel again if we ever traveled this way in future.", "title": "Nice Hotel - Will Stay Again :)", "helpfulness": 1, "user": "cmartin12", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 132568347}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Our first visit to Tunica area and we booked our room at the Horseshoe online based on Trip Advisor comments. We requested a premium king non-smoking and that is exactly what we got, plus the friendly staff at check-in gave us a room on the 11th floor and asked if we preferred a room close or far from the elevator - we said just a few doors away from the elevator and she was able to accomodate that. The room was spacious, well appointed, very clean and smoke free (a must for me), and the bed was super comfortable. The bathroom was a good size and good water pressure in the shower, plenty of bath linens - not sure why the tv was mounted on the vanity counter instead of on the wall, but did enjoy having it while getting ready for the day. Two more large wall mounted tv's in the room, comfortable seating and desk area, a refrigerator, a safe, and large windows with a partial view of the river all made for a very pleasant experience. While we didn't win in the casino, we had fun trying - we would win enough to keep playing and playing but evenutally the odds caught up with us but no complaints here - we had a great time trying. We did see firsthand some very nice payouts on both high limits and dollars and quarters; the so called 'penny' slots were fun but never saw any big jackpots there. In my experience, the slots seemed to pay really well and frequently in the wee hours of the morning (like 2AM to 5AM - yep I pulled an all nighter in the casino); but not so much during the daytime - that's when I gave back all my winnings... The hotel staff and security were very friendly and helpful, drink servers were efficient, has a convenient parking garage. Just a couple minutes walk next door to Gold Strike Casino which we also enjoyed. Buffet was just adequate and kind of lackluster, but service was friendly. We ate most of our meals next door at Gold Strike. Ended up with both our hotel stay and buffet comp'd, so that was a bonus. Would stay here and play here again if we get back to this area.", "title": "Very pleasant first stay and would stay here again", "user": "pandg71", "date": "June 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132394327}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My mother and I stayed at the Horsehoe 6/15-6/17 for a Girl's Weekend. We opted for a Premium Double-Queen room and we were not disappointed! We requested a room above the 6th floor close to the elevator (due to my Mom recently having had knee surgery) and we were accomdated as requested. We were given room 814 overlooking the front of the property.", "title": "A GREAT stay at the Horseshoe Casino and Hotel!", "user": "Goodwin0904", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132252097}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The room was very spacious and well-appointed with two very comfortable queen-sized beds with nice white, crisp bedding and a plethora of pillows! The room had a refrigerator which camein handy to store bottles of water and the all-important cans of Red Bull.", "title": "Good choice if you are visiting Tunica", "user": "TennesseeWarren", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132181635}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My parents and I had a nice one-night comp stay at the Horseshoe in a Handicapped Accessible King room with 1 King bed and a sofa ... which to my surprise was not a sleeper sofa. Hotel wanted an extra fee for a foldup-type rollaway bed. Thought it was strange they would allow three adults to book into that room type. My dad decided to sleep on the sofa and forego the charge for the rollaway.", "title": "Nice room, nice stay, stop charging for internet!", "helpfulness": 3, "user": "Rae A", "date": "November 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 146403015}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We were on a high floor and were the first room from the elevators but heard no extra noises.", "title": "Great value", "helpfulness": 1, "user": "LauraDonovan", "date": "November 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 146391144}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Our HA bathroom was really large and spacious. I will admit it took me about ten minutes to figure out how to activate the shower. I finally found the teeny tiny little button directly under the water knob. Maybe it was just the placement of the knobs and HA hardware that made it so hard to see. But now you know, and maybe I've saved someone else the trouble of trying to find it! We did not have a roll-in shower, but the tub had had a lot of grab bars and had an extended back that you could sit on. The showerhead was also removable and height adjustable. It was actually a nice shower once I got it turned on!", "title": "Nasty Rooms", "helpfulness": 1, "user": "David E", "date": "November 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 2.0}, "id": 145518284}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I did have to do some work and decided against paying the $12 fee for \"24 hours\" of internet access. It's not 24 hours of internet access. Who uses 24 hours of it? You might use 2-4 hours at most. Hotels that charge for internet are a pet peeve of mine. I also had to use the phone for an 800-number call. There was a 50c hotel charge for that. The phone connection was terrible. I know that casino hotels are not designed for the business traveler, but sometimes it has to be done. I had almost no cell phone reception in our room, although it was fair in the hotel lobby.", "title": "Good selection if you are in Tunica", "helpfulness": 1, "user": "lla2882", "date": "November 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145462989}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I really appreciated the Starbucks in the lobby, and appreciated even more that I could use casino comps for my overpriced fancy beverages!", "title": "Vacation", "helpfulness": 1, "user": "Luckylady61", "date": "November 14, 2012", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "location": 3.0, "rooms": 2.0}, "id": 145411433}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The Horseshoe was a good place to stay. The rooms were large and clean, the staff was extrememly friendly and helpful and the food at the restaurants was very good. The casino was clean and the payouts were reasonable. Another plus was that on either side of the Horseshoe are two other casinos, which are just across service drives, so a quick walk to get there, so you got 3 casinos at one location. The only 3 negatives I encountered were: 1)our non-smoking room sometimes seemed to have a smoking odor to it (maybe coming from downstairs?) but it wasn't overwhelming. 2)it would be nice if they would put some umbrellas and tables out by the pool since there isnt much shade out there. 3) They need better signage out on the main road. The only sign out there was so small that we missed it, and we were looking for it. All in all, a good stay and i would recommend it to others.", "title": "Enjoyable casino vacation", "helpfulness": 1, "user": "cats119", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133898079}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We just came back from Tunica for the first time. Horseshoe Tunica is a beautiful hotel. Our room was fantastic. We weight outside the elevator but never heard any noise coming from the elevator. The bed was so comfortable we both slept like a baby. Very nice experience. Will definitely go back to Horseshoe if we make it back to Tunica.", "title": "Beautiful", "user": "travelqueenorking", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133542976}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Where do I begin......I thought I was booking at a great casino hotel. When we arrived at the hotel, I realized how wrong I was. At check-in, there was a woman who upgraded our room for free ( so I was like, heck yes), but after handing me the room keys, she says, \"The last person I upgraded a room for tipped me $20\".....whaaat? I didn't ask for the upgrade. I considered tipping her until I stayed in the room. My husband found a sanitary napkin wrapper on the floor by the bed, the A/C BARELY worked, the smell of smoke was overwhelming ( I was told we booked a non-smoking room, I was informed that there were NO NON-SMOKING rooms in the hotel), there was no sheet on the bed, just a blanket wrapped around the mattress (??), it took the TV 5 minutes to come on (I kid you not), the chairs at the table were broken, the bathroom was filthy and needed dusting badly. Needless to say, we checked out a night early. So, I thought the terrible experience at the hotel was past me until I checked my credit card statement and realized THEY CHARGED ME $58 THE DAY AFTER I CHECKED OUT! I called customer service (which are very nice people, by the way) and she asked if we checked out late? No, we checked early. The woman didn't know why someone charged me the extra money, but she fixed it, thankfully. Overall, I would visit the casino again, but I will NEVER stay at this hotel again.", "title": "TERRIBLE!", "helpfulness": 3, "user": "FMTeacher", "date": "July 3, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 133403817}, {"rating": 2.0, "stay_parameters": "Stayed July 2012", "text": "Ok i booked my room a month in advance which was a premium and whn i got here they didn't have it available so they gave me a deluxe room which WAS NOT wht i wanted i have been coming here for awhile now im not sure about coming bk", "title": "Check in time", "helpfulness": 2, "user": "Endia901", "date": "July 3, 2012", "detail_rating": {"cleanliness": 3.0}, "id": 133396523}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I made our first trip to Tunica 6/24/12 and stayed 4 nights at the Horseshoe. All of the staff are extremely nice and friendly here. The rooms are very nice, we had a queen deluxe room with two queen beds and a nice sofa and chair sitting area. Mattresses are the most comfortable we have ever slept on at a hotel! Stayed on 7th floor a few doors from elevator, no issues with noise at all. We are late risers, there was one day where we left the room about 11:30 am and it was not made up when we came back about 4 pm, but that wasn't enough of an issue for us to call the desk about it, we still had enough clean towels, etc. I know we usually missed the \"morning\" maid routine but the other days our room was taken care of by the time we returned later in the afternoon. Hotel is a nice location because it sits between the Roadhouse and Gold Strike casinos also, very easy to walk to, gives you more choices of places to play and to eat. The Horseshoe and the Roadhouse are Harrah's Total Rewards properties and are ridiculously easy to get comps at. We play slots and table games, not big spenders at all, but our room was comped all 4 nights and when we played blackjack ($5 at Horseshoe, $3 at Roadhouse) all you have to do is request food comps from the pit boss and they take care of you very well. For example, play blackjack for about 45 min to an hour and get 2 buffets at Horseshoe or $40-$50 credit at the diner at Roadhouse. The Roadhouse Diner restaurant doesn't look like much and wasn't very crowded at all, but the food was very good. The Horseshoe buffet is fine, about average for a buffet -- though the prime rib was very good. The Gold Strike is an MGM property, you need an MLife card to get comps there....they have a nice breakfast buffet. We only played slots there two different times, had enough to get a free breakfast buffet each on our last day. Also, an easy drive to Memphis (about 30-35 min), so we toured Graceland and went to the Peabody hotel to see the duck walk and also saw Beale Street but didn't want to hang out for 3-4 hours til nightfall when it really gets jumping. We will definitely come to Tunica again and would certainly stay at the Horseshoe. We didn't come home winners but we had a fun time trying!", "title": "Had a great time!", "helpfulness": 2, "user": "Cyndi B", "date": "July 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133143466}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My first experience with staying at the Horseshoe was just OK. The hotel lobby was beautiful. When you walk the hall to your room, you find stained carpet, carpet peeling up in several places and just an overall \"old\" look. Our room was clean however the bathroom was extremely small. The AC unit was loud and rattled but it worked to cool the room. The swimming pool was a disappointing as well. It was only 4 1/2 feet. On a positive note, the staff was courteous and helpful! We did enjoy visiting the Riverwalk area.", "title": "OK but could be better", "helpfulness": 1, "user": "Fdangulo", "date": "June 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 132094435}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed here for the first time on 6/12/2012, a Tuesday, so my review is not of a weekend or holiday visit. With that said the stay was B+/A- overall; My wife and I have been to most Casinos in Vegas on and off the strip as we have relatives there. I would equate the Horseshoe @ Tunica to a newer version of one of the Station Casinos, meaning the Casino is the attraction, not any sinking ships or exotic place themes.", "title": "Excellent Experience on the River", "helpfulness": 2, "user": "captmark10", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131998617}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Positives: You don't have to walk a mile through the casino to get to registration, it's right insde the door from the parking garage as are the elevators. There's a Starbucks right there as well for those addicted to such things. The single king non-smoking room was large, extremely clean, and stupidly cheap ($40 + $11 for 24 hours of fast Internet). The bed was comfortable, the TV a new 46\" HD. We called room service about the Internet and they answered immediately and were very helpful. If you've been to Vegas this is not always the case on weeknights, let alone weekends. The Casino itself was modern, clean, and had ample walking room between aisles. The modern slot machines with touch-screen drink service were fast and smart-C'mon Vegas get with it! We felt safe and secure-the staff and other patrons seemed to be vacationers passing through as well-there were no oxygen tanks or mountains of cigarette butts clogging the aisles like the off-strip Vegas haunts. Lastly the Horseshoe is grouped with 2 or three other Casinos in a complex-although we didn't check them out you could walk to any of them in under 10 minutes.", "title": "Best Hotel in Tunica", "helpfulness": 1, "user": "James J", "date": "June 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131920370}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The negatives: The walk to rooms from the elevators is a maze of turns and distance compared to Station Casinos... Our room had no \"view\", though others may have...The list of restaurants on sight is quite slim-their online listing doesn't match the info guide binder in the room, and our food at the burger place was only fair. The steakhouse menu was Bellagio priced-the filet was priced more than our room!", "title": "Large clean room - with a few problems", "helpfulness": 2, "user": "grannymaryp", "date": "June 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 131756283}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Overall we were pleasantly surprised-we were afraid in a $40 a night Casino in Mississippi we'd be in for an adventure of the wrong kind, but we would and will come back here again next time our travels take us to Memphis or even Nashville-it's not that far a drive.", "title": "Very Comfortable", "helpfulness": 2, "user": "MSSrcitizen", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131129641}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "It has been several years since I stayed here but the last time was right after they had renovated. They had added large plasma TV's, either memory foam or some type of extremely comfortable matresses and new carpet throughout. I was really impressed with the room. The doors are quiet, no oad banging in the middle of the night. The bathroom seemed to be very clean, as were the sheets. As for the gaming, it's about the same as anywhere else in Tunica. You win some. You lose some. The gaming floor is huge and the restaurants all seem to be pretty good. If you use your player card, you can usually get comped for the room if this is your first time going. Just play as much as you intend to, then ask the player's club host if you can be comped. I've never payed outright for a room here yet.", "title": "Slept wonderfully, all the amenities.", "helpfulness": 3, "user": "OleTravellinJacky", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149114275}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Wow...great price for a great room. The room was very clean and modern. The beds were very comfortable. There was a large flat screen TV mounted on the wall. Check in was a breeze. I can't wait to stay here again.", "title": "Great Hotel!", "helpfulness": 5, "user": "Piph-Daddy", "date": "January 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148597181}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I stayed there comp recently and was pleasantly surprised the rooms were spacious with 2 tvs and a couch and chair in the king. The bathtub would hold a family of 4 LOL. The only drawback was not enough tv channels but i can live with that. I cannot say that mych for the machines. Thewy were very tight but that doesnt reflect on the room.", "title": "Real nice rooms", "helpfulness": 1, "user": "ricky b", "date": "December 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148025510}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "\"Forget This Place\" unless you want a wonderful place to stay at an extremely attractive price on a weekday. Check the rate calendar during the slow season. This was our 3rd stay this year, but our first review. We enjoy the area, the relative convenience to Memphis, and the extremely good promotional deals. Weekends do not interest us, but weekdays are an outstanding value. Clean, attractive, spacious rooms, efficient check-in, polite and helpful staff, and a fun atmosphere make this a very good choice. It is ranked #2 in the area. The only way to improve would be to eliminate smoking in the casino and to offer free internet. Now I'm dreaming. (By the way, the #1 rated place is next door and has the same issues).", "title": "Absolutely Wonderful", "helpfulness": 2, "user": "ForgetThisPlace", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147004508}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "we spent three nights at this hotel.The rooms were great very well maintained and comfortable.Three televisions a large flat screened in the living room and even one in the bathroom.The staff were all very friendly and helpful.The only drawback was the buffet.the food was all overcooked and had little taste but the other restaurants in the area had good food.Tunica is fine if you golf and gamble but has no real interests for non golfers or gamblers.We would recommend this hotel to anyone traveling to Tunica", "title": "great hotel", "user": "fisherman65", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146484458}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Recently stayed 2 nights here and were happy we did. We primarily liked the location of the Horseshoe, in a cluster of 3 resorts: Horseshoe, Roadhouse and Gold Strike, so you could walk easily among them. For other Tunica resorts, you have to drive to get there. Our room was a very long walk from the elevator; it seemed like an addition was done later from an initial tower. Room was OK, furnished in dark tones and had no view, but clean and plenty of towels. Bed was OK, not super-comfortable. We had no luck in the casino. The pool was on the 2nd floor and was nothing special. The Village Buffet was cavernous and kind of depressing, but OK as far as buffet food goes. Stick to the bbq/southern items for better quality. There is a Starbucks in the lobby, which was convenient. Were bothered by smoke sometimes on the casino floor.", "title": "Convenient property for Tunica stay", "user": "steptravel", "date": "July 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 135334310}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We go to a lot of the Harrah's Properties but this was our first time staying here. We had a comped room through the Total Rewards Program. The valet was great and bellman was on top of it. Everyone that worked at the hotel and in the casino were incredibly nice and helpful with one exception. The employee at the check in desk was not very friendly. She didn't say welcome or hello and just looked at us when we walked up to the desk. She gave us a smoking room when we specifically requested non-smoking at booking over 8 months ago. She said that was all they had left. We checked in at 5pm on a Saturday. We got a double room overlooking the outdoor pool, specifically room 3198. Beds were very comfortable. Coffee maker, fridge and one flat screen TV. I played slots which were ok and my girlfriend played the table games. She did very well. Drinks are comped if you're playing. Don't forget to tip the servers, dealers and bellman.", "title": "Didn't get what we booked", "helpfulness": 2, "user": "jands4ever", "date": "July 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 135190278}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We travel to the Horseshoe 3 or 4 times a year and have never had anything but a great vacation. Check in is always easy and fast (our room is always ready), people that work at the property are very friendly, housekeeping is very good and the room is more than adaquate ( 3 televisions (including 1 in the bath), comfortable bed and comfortable furniture. If you play slots the casino has plenty for everyone and when we were there the slots were not tight--my wife and I actually came home with more money than we left home with. We live in Massachusetts and getting there is real easy--we fly into Memphis and from there we are only about 35 or 40 minutes away. You can rent a car or request a limo. Casino hosts are very friendly and helpful. I have read some reviews where people complain about little things but it is the bigger things that count and you will not find a major complaint from most people. I guess some people are very hard to please and will not be completely happy anywhere. If you are looking for a great casino experience I highly recommend the Horseshore in Tunica.", "title": "Once again--great", "helpfulness": 3, "user": "Masstravler_12", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134536486}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "-Chech in was a breeze. Our room was comped but we payed a little extra to upgrade to a premium room.It was well worth it; much nicer than the standard room our friends had. The room was on the eighth floor it had three tvs and a very comfy bed. The staff all took the time to say hello and were always looking to help. The food was just ok but i have never been to impressed with any of the resturants in tunica. We had lots of fun and luck this time. The only down side was mosquitos were all over the casino at night that aside we would stay again.", "title": "Great Stay", "helpfulness": 1, "user": "peter a", "date": "July 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134390326}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We booked two nights at the horseshoe, adjoining room 1115 and 1117 to be precise. The rooms were top quality, bedding was great, huge bathrooms with TV. Our king had 3 TVS. The other room was a Double both where clean and neat. The staff was awesome, we actually had a booking error we went a week early, however the desk hooked us up.", "title": "Great Room", "user": "Dave H", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134153438}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We usually stay at Harrah's but hate the shuttle so when we got comped a room here, we took advantage. Definitely more convenient and access to other casinos was a plus. My biggest issue is the video poker machines at the bars, all of them. It was hard to find one that was in good working order. Keys stuck, machines locked up(this happened right from the get-go),some wouldn't take the players card and others wouldn't accept bills. They all need to be replaced. Even the slot attendant complained about the condition of these machines. Oh yeah, the room....clean,nicely appointed, but the bathroom was way too small with little counter space. Surly gal at check-in too, which is just what I don't need after 8 hours on the road. I ran into the same problem at Harrah's on a different trip. Come on, what's a smile and pleasant greeting take!", "title": "Nice, but......", "user": "TechyD", "date": "November 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 144939075}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We live in Massachusetts and this is our 3rd trip to the Horseshoe this year. We fly into Memphis and from there it's just a short drive from there. The rooms in the Horseshoe are spacious and clean. In the room we had there were 2 televisions in the sitting area and sleeping area and 1 in the bathroom. The bed was very comfortable and housekeeping did a very good job everyday. Check in was fast and all the employees were very friendly--always a good morning, good afternoon, good evening or good luck. There is a Starbucks right were the elevators are. Since we live in Massachusetts we always stay 5 or 6 nights. As for the casino we find it to be very clean and player friendly. We only play slots so I can not comment on the table games. While we were there I saw may hand pays on all demoninations. We also go to Vegas a couple of times a year and the playtime at the Horseshoe beats Vegas. The buffet is good and Binions has some great steaks. Drink service is fast because you order right from the slot machine. If you are looking for a good paying and friendly casino don't be afraid to try the Horseshoe--once you go you will be back.", "title": "Another great experience", "helpfulness": 1, "user": "Masstravler_12", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144771427}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I stay at the Horseshoe at least once a month. In my experience they have the best paying slots in Tunica. The buffet has a wide variety of food of available. Binion's steakhouse and 8oz burger are great. The hotel rooms are clean but a bit dated for my taste.", "title": "Great experience at the 'Shoe", "user": "byrnsibd", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144617986}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Stayed for two nights. Received a premium room due to my diamond status. Room was clean, spacious and well laid out. Room had three tvs, including one in the bathroom, which was nice to have on while getting ready in the morning. Overall, I really liked this property. My only complaint was with the lack of soundproofing. I could hear everything going on in hallways. If you are a heavy sleeper, it probably wouldn't be a big deal. But if you are a light to medium sleeper, it could present a problem.", "title": "Very clean, spacious..just needs soundproofing", "user": "kimandtim", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 144422564}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed two nights here. Very happy with the room price. We took the upgrade on the king room. For the extra money it was well worth it. The hotel charges $12. Per night for WiFi which I hate. The air conditioner was very loud which was never addressed. When asked to comp the WiFi they refered to my players card. I am not a big gambler and dont believe in comps from playing because you are paying dearly. I guess my point is that they casino orientated and not hotel customer service orientated. All in all I would go back and stay here. Make sure you check out the blue and white resaurant 22miles away in Tunica and the Hollywood Cafe a couple of miles away. Both original local restaurants with good food outside of the casino setting.", "title": "Don't think you will be treated like a guest at a normal hotel", "user": "Tom F", "date": "October 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 143931481}], "location": {"country": "United States", "city": "Tunica"}, "stars": 3.5, "variance": {"poor": 41, "average": 63, "very good": 113, "terrible": 25, "excellent": 150}, "aka": "Horseshoe Hotel", "slim_ranking": 0.2, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}