{"user_rating": 4.0, "review_count": 416, "name": "Hospitality Suite Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "A large, older facility which is very well cared for. Staff very friendly, housekeeping excellent, grounds immaculate. Jr. Suite is a deal with kitchenette. Kitchen and furniture dated and worn but clean. Hotel seems to cater to older European (mainly English) bus tour groups. This is not a place for younger crowd. It's just across the freeway from Tempe so you will not really be in Scottsdale proper. It is not a \"resort\" as we are now accustomed to but in its heyday it probably qualified. Three heated pools, one small, very hot jacuzzi, two tennis courts, free internet access in lobby, free cocktails poolside in evening, cooked American breakfast in restaurant (show up early, seating is limited). Noise from streets an issue, rooms in building B are quietest. Stay away from rooms that front roads. As with many older places, sound proofing minimal. Get upper rooms,they have elevators to access them. Ground floor rooms will hear amplified plumbing sounds from room above you. Biggest negative for me was the nighttime room temperature. The entire complex gets airconditioning OR heat, but NOT BOTH at the same time. While I was there a cold front with very strong winds came in. The nighttime temperatures dropped dramatically, as they can in the spring in the desert. Unable to get any heat in my room, front desk told me they would have maintenance fix it in the morning. They even went through the charade of filling out a maintenance order form. There is no \"fix\"--you get either AC or heat, not both. During spring when the nighttime temps can plummet the room can be quite cold. Housekeeping came with four blankets (synthetic and not very warm) which somewhat helped. After repeated requests to have someone look at my heater Front Desk finally came clean with why I had no heat. They said other guests were complaining that it was too hot and hotel had turned off the whole heating system. Duh, 40 degrees is a heat wave for Europeans but not us. They promised to turn the heat on at 9:00 p.m. Of course, this did not happen. Regardless of how accommodating and friendly front desk staff are, to not have been forthright that they had no intention to deliver heat to my room was a significant negative. I travel out of state on business several weeks a month and it drives me nuts when hotel staff respond to concerns with less than truthful answers.", "title": "Clean but be aware of room temp issues", "helpfulness": 5, "user": "silverjym", "date": "April 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3370239}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "This hotel is a great value for being this close to downtown Old Scottsdale. We paid $89/night for two people which included breakfast and afternoon cocktails by the pool. The hotel is clean, the people are friendly, good location if you are sightseeing in the Phoenix area. The AC and Heat are controlled by a central unit....you do not have control in your room. If you are looking for an ice cold AC room...this is not it. The AC blower was noisy. If you are willing to put up with few quirky things like this....the price is right. Free internet terminal in the lobby.", "title": "Good Value, A Little Quirky", "helpfulness": 6, "user": "Spade22", "date": "April 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3349554}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "KS", "title": "Excellent value & Convenient Location", "helpfulness": 9, "user": "Flatlanders", "date": "April 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3346293}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "Located nowhere but close to whatever. 15 minutes from the airport, 20 minutes to Bank One Ballpark and 10 minutes from downtown Scottsdale. This is a clean, well managed, secure motel/resort offering a great value.", "title": "Great place ! Great staff", "helpfulness": 6, "user": "sja", "date": "December 30, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2964864}, {"rating": 5.0, "title": "great place to stay", "text": "This is a great place to stay. The rooms are comfortable and have everything needed. We have stayed in the studio apartment and in the one bed (separate sitting room) apartment. Both are serviced everyday if you choose the daily option. With a full breakfast included, together with an unbelievable free 90 min bar every night this place is incredible value. The grounds are well maintained and there are three nice pools to choose from with pool towels provided. Added to this there are a couple of tennis courts on site. The staff are really friendly and helpful and it has an owner who cares enough to visit at cocktail hour two/three times a week to chat with the guests over a drink to ensure everybody is having a good time. We are definitely going back !!", "user": "tennessee-jack", "date": "May 23, 2008", "id": 16342280}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "I stayed at the hotel, and enjoyed it very much. A free made to order breakfast in included in attion to drinks in the late afternoon.", "title": "Good Value for the money", "user": "irishaye", "date": "May 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0}, "id": 16323634, "likes": {"liked": "— The rooms and free internet", "disliked": "— all was great"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I would stay again at the Resort as it was a very pleasant experience.", "title": "Very Good Choice in Central Phoenix", "helpfulness": 1, "user": "UrbanManUSA", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15294060, "likes": {"liked": "— Value for money, free breakfast", "disliked": "— Nothing to mention"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Very good hotel in a nice central Phoenix location. The hotel has three buildings – A, B and C. Each building has its own pool. Building A is three stories, and is the only one with a hot tub, and it is in the Building A pool area that a nightly cocktail party is held (free booze from 5-6:30pm; they stop serving at 6:30). The nightly cocktail party is nice of them to do, however, discount booze in little plastic cups is a fair description. It’s nice to chat with other guests, but it’s not worth planning your day around it.", "title": "Nice stay for the price", "user": "TravelHappy66", "date": "April 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 14984021, "likes": {"liked": "— great room layout and cleanliness", "disliked": "— not many restaurants or shopping nearby"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "All rooms of Building A overlook the pool. The pool area of Building A is a beehive of activity, and thus generally noisy, from 8am through 11pm. They do allow guests to drink by the pool, as long as drinks are in non-glass containers. If the pool noise will bother you, I’d suggest you ask for a room in Building B or Building C. The pool areas of buildings B and C are much more subdued. Buildings B and C have some rooms that overlook tennis courts, these may be your best bet if you are seeking quiet. Buildings B and C are two stories and have no elevators, so if you stay in one of them on the upper floor, you will have to use stairs.", "title": "Nice Place in Scottsdale", "helpfulness": 1, "user": "MTNEXPLOR", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 14492167, "likes": {"liked": "— The cleanliness and quiet."}}, {"rating": 1.0, "title": "Management Rude", "text": "Had do not disturb sign on, maid kept knocking........they are doing remodel and very noisy and rude employees.....complained and management was not helpful at all basically said to bad..................Beds are very cheap and uncomfortable, sheets don't fit king bed????? REMEMBER YOU GET WHAT YOU PAY FOR................you do get a breakfast that was ok and drinks but you get get a six pack of beer for 5.99", "helpfulness": 1, "user": "Tempe_ArizonaMama2", "date": "August 26, 2008", "id": 19380687}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "VERY OLD AND SMELLY HOTEL", "title": "Funny, but sweet.", "user": "noredpen", "date": "July 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 17934514, "likes": {"liked": "— The pool & free breakfasts", "disliked": "— Needed balconies"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "This is a bit of a funny place, with members of our party having mixed experiences. The rooms have sitting areas, with sofa bed & kitchen, as well as a smallish twin bedroom, so would be good for a family. The pool was fabulous, once the main heat had gone out of the day. Why no parasols at loungers?", "title": "Very enjoyable stay-and a good value", "user": "RosefromWAstate", "date": "July 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17591931, "likes": {"liked": "— Location, suite amenities, breakfast and happy hour", "disliked": "— busy street with lots of construction-difficult to access the property sometimes"}}, {"rating": 5.0, "title": "JJ \"Cantina\" Joke Box?", "text": "A very generous breakfast was included, a bonus in the US. This was served in the attached cantina, where meals were available in the evening. Unfortunately, this also had a band, so those with rooms near the cantina had little sleep.", "user": "A TripAdvisor user", "date": "June 8, 2008", "id": 16761247}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "A great place for freebies, the hotel had a happy hour from 5.30 with FREE drinks, basically whatever you chose. Spritzers seem to be unknown in the US, though. We had to explain very time.", "title": "Excellent Low Priced and Free Booze!!", "helpfulness": 1, "user": "BisbeeTom", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16759903, "likes": {"liked": "— Free Booze!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Central to the trendy university area, historic Scottsdale, numerous spring training ballparks -- including the Cubs' Hohokam and the Angels' Tempe Diablo -- the airport, and within an easy drive of Taliesin, the location is great.", "title": "Quite a value", "helpfulness": 1, "user": "Firpo", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14310237, "likes": {"liked": "— Value and location", "disliked": "— beds were a little soft; but someone else might find them too firm"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We were on the third floor in a room facing the main pool area, with the suite's bedroom window facing the busy Scottsdale road, but the road noise was not a factor at night. There's also a decent Italian restaurant across the street, so if you're without a car for one night you have one easy dining option.", "title": "A great place", "helpfulness": 3, "user": "lscanada", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13272354, "likes": {"liked": "— Quiet, clean and friendly.", "disliked": "— Coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Three pools and a two-court, lighted tennis court, in addition to a free, 90-minute happy hour -- you've got to be kidding; what hotel does this for free for all guests of age these days? -- where you can mingle with the owners. The wireless Internet access added to the attributes of this highly affordable site.", "title": "Couple from Toronto loved it", "helpfulness": 3, "user": "PeterCToronto", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13260716, "likes": {"liked": "— Great value, lots of extras, quiet, slept well", "disliked": "— Having to leave"}}, {"rating": 4.0, "title": "Great value for money!", "text": "The rooms were clean and housekeeping attentive to requests.", "helpfulness": 5, "user": "jbulmer", "date": "January 28, 2008", "id": 13055826}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Probably because of a quirk with our registration that isn't worth detailing here, our key cards were rendered useless one day. The desk staff quickly jump-started the cards, but it was disconcerting that when I presented the card and told them our room number they did not ask me for my name. I could have obtained both the card and the room number in multiple ways without actually being a guest. However, this oversight is common at many hotels. If you're a bold thief, it's remarkably easy to enter a hotel room without being a guest or prying open a door.", "title": "Basic but worked for us", "helpfulness": 2, "user": "South dakota-914", "date": "January 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 13010934, "likes": {"liked": "— price", "disliked": "— needs some up-dating"}}, {"rating": 3.0, "title": "Clean Place", "text": "We stayed here for three nights in November, 2004. The price was great - but you get what you pay for. It was hard to get a good nights sleep because it is located on a very busy street and you had alot of traffic noise all night. Also the rooms were not very sound proof and could hear every time some one woud even walk past your door and hear the people partying late into the night by the pool. The cocktail party was great - you could have as many drinks as you wanted and the bartenders were very friendly. As for the breakfast - it was just okay - a very limited menu and the juice was definitely warm like someone had written. There was a great Italian restaurant right across the steet. The place was kept very clean. If you are on a low budget this works great. Next time I will pay a little more and go somewhere nicer.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 14, 2004", "id": 2824583}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "Hospitality suites is an inexpensive hotel. Above average because it is clean, friendly and provides breakfast and afternoon cocktails. The rooms are dated and the available space could be better utilized, but they are very clean and comfortable. The property is also very well kept. The location is great for Tempe and the University of Arizona and one of the Casino Arizona locations but just a bit far for Scottsdale sites. Overall an excellent value.", "title": "clean & cheap", "helpfulness": 6, "user": "cc41", "date": "September 26, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 2602347}, {"rating": 2.0, "stay_parameters": "Stayed September 2004", "text": "This is a very nice hotel with a great pool area and a very nice room. We stayed for 4 nights at the begining of September 04. The only problems we had with the hotel is that it is in the middle of nowhere, unless you like to look at car showrooms. If you dont have a car - and not everyone does - you really are stuck in the hotel and the hotel bar. The bar/restauant is very reasonable and has good quality food, although I would reccomend you stay away from the ham at breakfast time as it was always undercooked, and the orange juice was always warm. The room we had had a handy kitchen - but maybe somebody could explain why they give you a cooker but no pots??!!?? The bed was on the soft side and a couple of nights i slept on the sofa to get a better sleep. The staff were very helpful and offered the use of the shuttle bus when it wasnt being used for airport runs. There was also free internet access in the lobby which was really handy.", "title": "Not Bad", "helpfulness": 3, "user": "angeliad", "date": "September 25, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2600216}, {"rating": 4.0, "title": "Hasta la vista Arizona", "text": "October 2003 we stayed at the Hospitality Suite at the end of our tour of Arizona and found it very clean and friendly with great food. Our rooms were really well equipped and the staff were very helpfull. It was sad to say goodbye to Arizona but we had enjoyed our vacation and are looking forward to returning soon.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 27, 2004", "id": 2497653}, {"rating": 5.0, "title": "We felt like we were home", "text": "Regards John Lea & family UK.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 15, 2004", "id": 2449919}, {"rating": 5.0, "title": "Fantastic Scottsdale Experience", "text": "I came out here to scout for my family members stay in September for the Patriots game..WOW, what a great place, the amenities alone are enough to keep me here forever. They are going through a major renovation right now, which will only make this place better than it is now (which is Fantastic!!)", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2293481}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "this is an ok hotel for a couple of days stay. it is convenient for scottsdale. the rooms are fine but not great, we did not try out the pool but it looked ok. the staff are fine. you get breakfast thrown in and it was very nice. not much else to say it was pretty unremarkable but it suited for our time frame.", "title": "this is an ok hotel", "user": "moodycow", "date": "October 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 20665782}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Not having been in Phoenix I was not sure what I was getting into but I was pleasantly surprised to have a very nice clean room and I loved the free cocktail hour to get to meet the others staying there and the breakfast was as good as any you will get. Remember to tip the cocktail lady a buck a drink and also the ladies riunning around giving you the awesome breakfast. Great people and location. JJs is good for football and food.", "title": "Super hotel deal", "user": "wonderful58", "date": "September 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20489476, "likes": {"liked": "— The cleanliness and the value", "disliked": "— All was very good"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We were searching various destinations for a quick week get-away. We were looking at Playa del Carmen, but the storms were threatening that part of the world. After quite a few searches, we decided on Arizona. Only a two hour flight and the weather is dry and warm (read hot).", "title": "Comfortable, Clean and Friendly Staff", "helpfulness": 3, "user": "Son_of_a_Sailor_51", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 20315476, "likes": {"liked": "— The friendly staff, the cleanliness of the rooms, the small quaint pools and of course happy hour", "disliked": "— No complaints"}}, {"rating": 5.0, "title": "The BEST!", "text": "Using mostly Trip Advisor, we found this place. As usual, varied reviews, but having been in the airline business ( my wife still is) we have learned to read between the lines. And as several trip advisor members have stated, \"a vacation is what you make it\".", "user": "Bectora", "date": "September 3, 2008", "id": 19722226}, {"rating": 5.0, "title": "An Unknown Treasure", "text": "So here's our observations;", "helpfulness": 1, "user": "logansspace", "date": "August 27, 2008", "id": 19419711}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 30, "average": 55, "very good": 190, "terrible": 13, "excellent": 128}, "aka": "Hospitality Hotel", "slim_ranking": 0.594936708861, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "This charming hotel is located at the border of Scottsdale and Tempe. Providing guests with outstanding services and amenities - including a free happy hour each evening and, if you book directly with the hotel, a free cooked to order breakfast each morning! Each room is tucked away in a private courtyard setting amidst the tall palm trees and bougainvillea. The majority of rooms overlook crystal blue pools for guests' daytime and evening pleasure. Two room types, or suites are available. The Junior King offers a one room suite with a kitchenette, and the One Bedroom Suite offers either one queen bed, or 2 double beds, a pull-out-sofa and a separate living area and kitchen. The kitchens come fully equipped offering guests the opportunity for extended stay vacations. Nearby recreation makes this hotel a haven for the sports enthusiast. Featuring golf and tour services, several restaurants within walking distance, biking, hiking, and jogging trails all close access to hotel."}