{"user_rating": 4.5, "review_count": 674, "name": "Hospes Amerigo", "reviews": [{"rating": 5.0, "title": "Grand", "text": "Lovely hotel with large rooms. Loved the shower. Breakfast was really good, still miss the vanilla yoghurt with strawberrysauce. The pool was small and cold, if you really need a pool this isn`t the place.", "user": "jocmod", "date": "April 23, 2011", "id": 105173270}, {"rating": 4.0, "title": "As comfortable as home", "text": "I stayed at the “apartments” which is a short walk down the street from the hotel. Entry is gained through a locked door at street level which leads to a pretty, tiled foyer with stairs and an elevator. My only complaint here is that the street-level door is difficult to open from the inside. The door knob is small, hard to get a grip on, and the door itself is heavy. Anyone with arthritic hands be warned. My apartment was spacious, modern-looking, with a separate bedroom and living room, wood floors, and immaculately clean. The kitchenette area had a full-size refrigerator, stove and clothes washing machine. The bathroom had modern facilities, including a bidet, and a large shower with good water pressure. Additional perks were internet access, flat-screen TV, cable TV with some English-language channels, good lighting and a comfortable bed. The apartment had ceiling-high double doors leading to a small balcony and the bedroom had two large windows. Opening both, I could get a good cross-breeze. There was no view to speak of. The balcony overlooked a narrow alleyway and the bedroom windows faced someone else’s back porch where laundry was hung out to dry. Other than the problem with the street-level door, there were only two downsides: First, loud voices ALL night coming from revelers in the street. One night I heard a bottle breaking. Probably you’d get that anywhere downtown. In Spain, many people sleep in the afternoons and are up all night. Closing the bedroom door and ear plugs, which I brought, solved that problem. Second, don’t drive in Alicante! It’s a nightmare with one-way narrow streets that are unmarked and with no place to pull over. There’s no parking anywhere. The hotel has a very small, extremely tight underground parking garage at a steep price (I believe it was 25 euros per day), plus you have to reserve it in advance. If you opt for this, be sure your car is very very small! I parked my rental car in the garage the first night then returned it the next day. I decided it would be a lot less stressful (and cheaper) to rely on public transportation. Overall, I found the apartment extremely comfortable.", "user": "annnocella", "date": "April 22, 2011", "id": 105072697}, {"rating": 3.0, "title": "Nice hotel but dangerous bathrooms!", "text": "Stayed in this hotel on Saturday 9th April with a mate on a night out in Alicante! Reception area fantastic and efficient friendly check in. Very hard to find and intially I had emailed for directions to parking and am still awaiting the courtesy of a response. First room room was too dark with no natural light and we quickly asked to be moved which reception happily did. Our second room faced the road, was airy/bright and had a small balcony. We wanted to use the pool but was closed for a week with no advance notice. Bathrooms were very large but poorly designed. Our shower was over the bath and difficult to enter and leave due the full glass shower door......entry and exit very slippy. I slipped and fell hurting my back, foot and elbow. Would recommend for contortsionists!", "user": "Patchpup", "date": "April 17, 2011", "id": 104336874}, {"rating": 5.0, "title": "Probably the best thing in Alicante", "text": "I just spent a couple of days in Alicante on a business trip and was quite disappointed by the city. I would definitely rate the Hospes Amerigo the best thing in town.", "user": "nindo29", "date": "March 30, 2011", "id": 102213393}, {"rating": 5.0, "title": "Excellent hotel but not for a light sleeper", "text": "I had a very spacious room and never experience such a comfortable mattress and pillows before. It was really hard to get out of bed!", "user": "diorstone", "date": "March 11, 2011", "id": 99751534}, {"rating": 2.0, "title": "Spacious, clean apartment but remember your ear plugs", "text": "My mum and I stayed in one of the new apartments for 4 nights (Monday - Friday). Overall we were very disappointed by the level of service provided by this hotel and not sure how long it will be able to keep it's five star rating.", "user": "CLM78", "date": "May 15, 2011", "id": 108292936}, {"rating": 3.0, "title": "Not as good this time", "text": "On the positive side, the apartments are very spacious, clean and centrally located. A city centre location does mean however that you can expect a LOT of noise and this was certainly the case here. We were woken each morning by a street cleaner which starts at 6:45am. On Thursday night there was a lot of noise from rowdy groups standing in the square opposite shouting and singing. To make it worse, at the time of our stay there were public drilling works going on right outside the apartment. The noise was deafening and one day we couldn't get out of the main entrance because there was a large hole between the door and the pavement which we would have had to jump across. When we have previously stayed at hotels, we have been informed in advance of building works due to take place and offered a discount. Here, we were told that if we wanted to move to a less noisy room in the hotel, we would be charged extra!", "user": "GASUk", "date": "May 13, 2011", "id": 108068374}, {"rating": 2.0, "title": "Noisey and poor sewage system", "text": "The reception staff give the impression of simply not caring about the comfort of their guests and you feel as though you ought to be thanking them for allowing you to stay at 'the only five star hotel in Alicante'. We clearly requested one of their advertised twin rooms but got a double bed. We were told you could split the bed into two, but there was only one sheet and duvet. I had to ask 4 times before somebody finally came to assist. The complimentary toilettries consisted of shower gel and shampoo - not even a bar of soap! The advertised bathrobes, slippers, hair dryer were all absent from the room - on requesting them we were told 'guests like to bring their own!' You get a hairdryer and soap in a Travelodge so why they don't bother here smacks of laziness. There were only 4 coat hangers in the whole apartment, we requested more but they never turned up. The satellite TV didn't work, I reported it but nobody came to fix it. In the end I got fed up of asking.", "user": "badgb21", "date": "May 4, 2011", "id": 106826352}, {"rating": 4.0, "title": "Classy, refined & central location", "text": "Alicante is a wonderful city with plenty to see and do and some wonderful restaurants. There is a Tapas bar on the next street 'La Taberna Gourmet' which is amazing and where you do get exceptional service. I would definitely recommend a short break here, but if you are expecting five star service then this is not the hotel for you.", "user": "Babylon_Benidorm", "date": "April 26, 2011", "id": 105567710}, {"rating": 3.0, "title": "5 star???", "text": "Having stayed here before [and enjoyed it] we thought we would stay at the Amerigo again. This time we chose to stay in the Amerigo apartments. The aparments still benefit from full use of all the hotel facilities.", "user": "Elisabeth1973", "date": "April 24, 2011", "id": 105278850}, {"rating": 5.0, "title": "Just PERFECT !", "text": "An ideal location, a sumptuous buffet breakfast, staff very attentive and helpful, rooms simple and effective design, a completely renovated building decorated very Zen, an idyllic pool on the top floor with amazing views of the Castle Santa Barbara And, all at a value price!", "user": "CarpeDiem2991", "date": "January 26, 2011", "id": 94465934}, {"rating": 3.0, "title": "Return trip - not as good as first", "text": "what could we ask for more?", "user": "DLMCC", "date": "January 20, 2011", "id": 93884688}, {"rating": 3.0, "title": "Good Character Hotel, but service could be better, and it's noisy!", "text": "This is the third time, we will return soon, with great pleasure!", "user": "Deb-Mark", "date": "January 13, 2011", "id": 92811885}, {"rating": 4.0, "title": "Beautiful rooms. Just missing a few small details to make it perfect", "text": "W & Mc", "user": "MaroKat", "date": "January 4, 2011", "id": 91664528}, {"rating": 5.0, "title": "Perfect - Just at it says on the tin 5*", "text": "I first stayed in this hotel about three years ago and it was truly wonderful. This time it was pretty good but it looks and feels a little more jaded and tired than last time I was there. Little things like a few chipped tiles in the pool and the handle on the shower falling off are enough to take the edge off the top rating I gave it last time. The staff are still very pleasant and helpful though.", "user": "anthony1966", "date": "December 16, 2010", "id": 90034700}, {"rating": 4.0, "title": "Amerigo apartments - could do better", "text": "Stayed in one of the Amerigo apartments round the corner from the hotel.", "user": "jennykenny", "date": "December 14, 2010", "id": 89839575}, {"rating": 4.0, "title": "Great architecture, spacious room, close to beach", "text": "High ceilings, fully fitted kitchen, dining area, lovely comfy double bed, quiet, - in general a very good stay - Dec 2010. Staff very helpful and pleasant; very central - would defintely recommend.", "user": "Irelandlife", "date": "November 30, 2010", "id": 88676288}, {"rating": 2.0, "title": "POOR SERVICE... NOT 5 Star!", "text": "(Slightly concerned by the fact that the architect put the clothes hanger 7 foot above the floor - as an average female - 5'4\" had to leave all my clothes on chairs. - would like all hotel managers to stay at least one night in each room.)", "user": "mj2035", "date": "November 29, 2010", "id": 88539606}, {"rating": 3.0, "title": "try very hard", "text": "More bothered that the apartment wasn't as good as the hotel rooms i.e. no telephone, no bath (very small shower room), no safe (but you can leave things at reception) no hairdryer (but you can request one).", "user": "Jonathan N", "date": "November 27, 2010", "id": 88326743}, {"rating": 5.0, "title": "Great rooms, Great Staff, Fantastic Gin and Tonics", "text": "Was much more worried about the fact that there was no information as to what to do in case of fire. No instructions on the back of the door, the lift and stairwell were beside each other, no emergency lighting, no smoke/fire alarms. Any of these would be helpful.", "user": "tekn0w0mble", "date": "November 8, 2010", "id": 86354867}], "location": {}, "stars": 5, "variance": {"poor": 23, "average": 88, "very good": 206, "terrible": 13, "excellent": 344}, "aka": "Hospes Amerigo Alicante Hotel", "slim_ranking": 0.0217391304348, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}}