{"user_rating": 4.5, "review_count": 18, "name": "Hospedaje Los Jardines", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed here in February for 4 nights. This is a good budget option and the propery is safe and clean. The family that runs this is very nice and will provide you with breakfast for a fee if you arrange it the day before. We liked the fact that it felt like you were living with a family rather than staying in a hotel so that experience was nice. They even walked us to where you catch the bus to make sure we knew where to get on and off.", "title": "Good budget hostal", "user": "Blaxton", "date": "March 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 14097886}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "There is not a lot to do in Urubamba itself but it is a great place to stay and do daytrips from. We mostly took the local bus everywhere and it was fine.", "title": "A True Sanctuary", "user": "manifestangel", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8376127, "likes": {"liked": "— staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "After many, many hours of travel from New York to Peru, we decided to acclimitize in the Valley. We found this perfect hotel in Urubamba and decided to go for it, seeing as though the other reviewed accomodation in Urubamba is 5 times the price...It fit perfectly in with our plans. We spent 3 nights here, and loved it. A quiet, authentic experience with genuine hospitality. If you are looking for a place to RELAX and enjoy a private breakfast in a stunning garden with views of the Andes, this is the place for you! The family who runs the inn couldnt have been more accomodating and helpful. We loved conversing in Spanish with our host...He even walked us to the nearest bus stop to make sure we got on one headed to Cusco. All around, a fabulous experience for our first days in Peru.", "title": "Fantastic value", "helpfulness": 2, "user": "YvonneT", "date": "October 17, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5965984, "likes": {"liked": "— value for money", "disliked": "— the towels were a wee bit small"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "Staying a few days in Urubamba makes great sense if you are flying in from lower altitudes. As its a bit lower than Cusco it gives you a chance to get used to the altitude before attempting Machu Picchu or exploring Cusco.", "title": "Great Service for the Price", "helpfulness": 2, "user": "bdm123", "date": "September 12, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5795183}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We asked the owner Raul to arrange pickup at the airport in Cusco, and he met us there personally and showed us to a waiting taxi he had pre-paid for us! This was great given the reason we started out in Urubamba was the extreme elevation in Cusco leaves you fatigued by the time you have made it out of the baggage claim in the airport.", "title": "Great, friendly service-but careful on the steps", "user": "lunettes_noires", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 80542499}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Breakfast in the garden was a very relaxing way to start the day the next morning. There is not a whole lot to do in Urubamba proper, but Raul got us very nice rental bikes and a taxi up to the town of Maras where we headed off to visit the agricultural laboratory of Moray and the salt ponds below Maras, both of which were well worth the effort.", "title": "Great place, clean, quiet, spacious, good value", "helpfulness": 1, "user": "geoff724", "date": "July 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 70177658}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My only caution is that if you are staying in one of the upstairs rooms, be very careful on the stairs, as the treads are narrow and well-worn, and when wearing big, clunky hiking boots (such as I brought to do the Inca trail later on the trip), you may find that the smooth part in the middle of the sole of your boot is what contacts the stair tread and end up flat on your back (as I did the first time I descended). I think another guest did the same the next day as we heard an awful clatter and then her friend coming to help her up. Luckily I just bruised my elbow a bit, but it could be a very unpleasant way to start your trip!", "title": "Skip the stay in Cusco, go straigth to Urubamaba and stay at Los Jardines", "user": "EmmaQ11", "date": "January 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53057618}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "We stayed 3 nights. The room was very clean and the shower had hot water. We paid additional Soles to have breakfast in the garden each morning. The second floor room had big windows with a view of the flower filled garden. Everyone at the hospedaje was very nice from the children to the adults. The collectivos stop two blocks away and the bus station is within walking distance.", "title": "Great people, helpful and accomodating.", "user": "kezzac53", "date": "October 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 47059377}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Los Jardines is strategically located in a small city called Urubamba just between Cusco and Ollantaytambo, therefore allowing you to either go south and do all the sightseeing in Cusco (1hr 50min) passing first through Chinchero (1hr), popular because of its craft fair, or head west to Ollanta (45 min) and take one of the trains departing to Machupicchu without the rush of traveling all the way from Cusco or having to pay an overpriced stay in Ollantaytambo. The charge per night/ per room, not per person, in this hotel is just $24.00!", "title": "Awesome place, the nicest people - GO THERE!!!", "user": "Kate09", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25306882}], "location": {"country": "Peru", "region": "Cusco Region", "continent": "South America"}, "variance": {"poor": 0, "average": 2, "very good": 5, "terrible": 0, "excellent": 11}, "aka": "Hospedaje Los Jardines Peru/Urubamba, Sacred Valley", "slim_ranking": 0.391304347826, "description": "Located in Urubamba, in the heart of the Sacred Valley of the Incas, Hospedaje Los Jardines is a convenient place to stay while exploring the natural, historic and cultural wonders of the area. At over 500m less altitude than Cusco, it is more comfortable for visitors not acclimatized to high altitudes. We also offer Mountain Bike Tours and as an agent for Peru Rail we can organise train tickets to Machu Picchu for you."}