{"user_rating": 4.0, "review_count": 39, "name": "Hostal Santa Cruz", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I definitely recommend this place if you are on a budget and want a good, simple room with really great hosts. It is in an excellent location if you want to be in the tourist center of Madrid, right between Puerta del Sol and Plaza Mayor. The hostal is inexpensive, up to date, and spotless. The rooms have double pane windows which keep out most of the street noise (you ARE in the middle of a big city, after all), air conditioning, and a safe (costs 1 euro every time you use it). Wifi is free and my room had a strong signal. The hostal is in an older building so the room had only two extra electrical outlets - something to keep in mind if you travel with a lot of electronics. The bathroom was very small and tight, especially the toilet, which could be a problem for large people. This is a simple hostal, so no breakfast, but there is plenty of food all around.", "title": "Exceeded my expectations", "user": "Massimo1", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142575402}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "A friendly, cosy place in a family-run hotel, nice people, very careful, turning on the heat on cold rainy nights, I felt at home, poor internet but improving by the middle of my stay, sometimes few shampoo, or soap provided, I would recommend Hostel Santa Cruz for its view and location mostly,and for its tidiness, quietness and warmth, as well. I enjoyed my stay a lot", "title": "highly recommended place in the heart of old Madrid", "user": "Florinda O", "date": "October 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141928782}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Right in the center of town - just a few blocks from the Plaza Sol metro stop, this was a great jumping off point for all of our Madrid adventures. 3 of us stayed in a room with 3 twin beds. The room was tiny but we weren't paying much so we were fine with it.", "title": "Great location, Great value!", "user": "traveler_alb", "date": "October 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 141797302}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The main reason I am docking 1 star is the promise of internet that was really only available when we were sitting right by the door.", "title": "Close to attractions and metro", "user": "kart S", "date": "August 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137825469}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "On the plus side though, our neighbors were breaking the rules and smoking in their room (its supposed to be non smoking) and we could only smell it when we left our room. Our room was sealed enough that we couldn't smell it while in our room.", "title": "A basic room but a great location", "helpfulness": 1, "user": "smarin3", "date": "June 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132547784}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "variance": {"poor": 0, "average": 5, "very good": 21, "terrible": 0, "excellent": 13}, "slim_ranking": 0.155115511551}