{"user_rating": 3.0, "review_count": 18, "name": "Hostel Colonial Buenos Aires", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Conveniently located in the city center off Tucuman and Florida, however the more desirable areas to visit are Palermo and Recoleta. Stayed in a private (quadruple) room with a shared bathroom. Room was quite hot even in Autumn so it's likely scorching in Summer. The ceiling fan offered temperature relief but it squeaked so loud that it was hard to sleep. The hostel is noisy in the morning because the floors are all cement and there is no carpet to buffer the sound. The rooms have lockers which is a big perk because the door locks are a little old and wobbly (bring your own locks). The beds are average in comfort for a hostel, i.e. worn out but better than nothing. The shared bathroom was very clean. The shower stalls are a little on the small side and so are the toilet stalls. Didn't use the kitchen but a small one exists. Breakfast consists of cereal (if you eat early), medialunas, and tea. Lucas, one of the operators is very nice, speaks decent English and is available for help. There is a shared computer in the lobby with internet access, and one of the faster connections I've used.", "title": "Nice hostel, average location", "helpfulness": 1, "user": "LuvSLO", "date": "May 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 29159967}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "variance": {"poor": 2, "average": 4, "very good": 6, "terrible": 4, "excellent": 2}, "slim_ranking": 0.711171662125, "description": "Ten years. Thousands of passengers. Hundreds of friends still visit us.Travelers. People. Many stories to tell. When we opened Hostel Colonial had this idea: Let’s make a place run by backpackers for backpackersA simple housing where getting to rest after a busy day.Here the most important are the relationships between people.Backpackers for backpackers, this has always been our concept. Sorry by those who had other expectations, but has been well for ten years and well continue for another ten more.Thank you all.Regards"}