{"user_rating": 4.0, "review_count": 100, "name": "Hostal de la Barra", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "I didn't know it upon checking in, but apparently Hostel de la Barra has the same power as the Republic of Chile and the international financial system to set the exchange rate between US Dollars and Chilean Pesos. Yes, really. After being told that my dorm would cost $18 by the emotionless girl working at the reception desk, I proceeded to suggest I should pay about $8,500 Pesos given that, at the time, the current exchange rate between US Dollars and Chilean Pesos was approximately 1:473, a rate honored by other, honest accommodations in Chile. But, no, the stoic girl told me the accommodation would be $9,000 Pesos because, get this, the \"hostel's exchange rate\" is 1:500. I would add that she also refused to charge my credit card in US dollars -- only in Chilean Pesos -- indicating that indeed the hostel does enjoy setting its own rent-seeking exchange rate. Ok!? Well, rather than argue over a $1 and some change, I paid, but I did not appreciate exchange rate manipulation being used by this hostel to pocket some unearned change out of a guest's pocket. (Further, I would add that $18 -- well, $19 at the 'hostel's exchange rate' -- is the 'discount' rate at the moment and that dorms are normally priced at $25! An absolutely insane price, compared to other nicer accommodation in Bellavista, for this low-service hostel. Read on.)", "title": "Manipulate exchange rate; filthy men's bathroom", "user": "travelwiz13", "date": "May 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 160701524}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "This is a bare-bones hostel. 'Common space' consists of two picnic tables (yes, the hard wooden ones you would find in a city park) and some soft chairs down in the dingy basement kitchen. The minimal breakfast is served at one of the picnic tables.", "title": "cool visit to santiago!", "user": "Guille777", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 159209290}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Dorm rooms -- with eight beds -- have comfortable enough beds, but lots of street noise. Also, my dorm absolutely stunk. Why? Read on.", "title": "Best relation quality/price in Santiago.Very good Staff.", "user": "Vincentfigueroa", "date": "March 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156026707}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The men's bathroom was one of the most disgusting I encountered in a trip across South America -- the mold is so horrific above one of the showers that it leaves a disgusting stench throughout the second floor of the hostel, and, in particular, the dorm room where I stayed directly across from said bathroom. Also, the shower's water pressure was weak and hot water inconsistent.", "title": "Great Beds", "helpfulness": 1, "user": "CarolineTeh", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152486000}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Perhaps the only reason I didn't rate this hostel one star -- given the horrid sin of dishonesty with the exchange rate -- is that it is in a decent location by two metro stops and a decent-sized supermarket.", "title": "Nice staff, less comfort", "helpfulness": 1, "user": "Adri G", "date": "December 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 147388482}], "location": {"country": "Chile", "region": "Santiago Metropolitan Region", "continent": "South America", "city": "Santiago"}, "stars": 2.5, "variance": {"poor": 6, "average": 10, "very good": 28, "terrible": 3, "excellent": 53}, "slim_ranking": 0.160784313725, "description": "Small hostel in Santiago Chile, in Bellas Artes Lastarria neighborhood. Choosing a hostel in Santiago is not an easy task, the city is huge and there are many neighborhoods that \"seem\" well located but really they are not. Your days and nights will be spent mainly in Bellas Artes Lastarria because main tourist attractions, cultural centers and all the fun is around here. Our quality commitment is to offer the hostel in Santiago with the best location, in a spotless place and with friendly service. And now we also have the most beautiful tourist apartments and... in the same building than the hostel! We are waiting for you!"}