{"user_rating": 4.0, "review_count": 91, "name": "Hostal Sonchek", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "I'm surprised by some of the less than glowing reviews about this hostal -- for San Pedro this place represents exceptional value. Beds are comfortable and have clean linens and cosy blankets. Rooms are thoughtfully arranged with shelves and power strips so that more than one device can be charged. (It would be great, though, if the rooms had, at least, small lockers for passports, laptops and other personal belongings, although the reception will store your belongings if you ask.) Affordable and reliable laundry service. For the driest desert on Earth, solar showers are amazing -- plenty of hot water and pressure. Great location just a few minutes from the TurBus terminal and the center. I found staff friendly enough, but not super helpful with information about tours. Calm environment that attracts people more 25-35 and older. Also quite nice that they don't require a deposit to make a reservation via email (although it is important to confirm your reservation with a second email 24 hours before arrival.) Bottom line: if you're on a budget and looking for good value in San Pedro, Soncheck should probably be your first choice.", "title": "Excellent San Pedro budget choice!", "user": "travelwiz13", "date": "July 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166551589}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "In case you haven't figured this out already, San Pedro is extremely expensive. Finding a decent room under $30 is practically impossible but Sonchek fit the bill. It was a calm environment. Guests are talking lowly in all areas and management is understandable that a majority of their guests will wake up at 6am or earlier for their full day tours. The restaurant next door blasts music during the day though... The room was very cramped but we both fit fine, however, curtains are too thin- they do not block out the sun. The cats add a welcoming presence. Staff does not speak English and are as helpful as they feel they need to be. The shared bathrooms were an experience. They are cleaned almost constantly and each have a character to them. Took a bit to find which one was my favorite. Wifi was an issue. Had to keep restarting the router every time we wanted to get online and could only access from the courtyard- adobe walls are too thick. Also, keep your bags securely closed at all times. Because the room open to a garden, we found a couple of spiders hiding under our stuff- they were scary, not gonna lie.", "title": "An ideal compromise", "user": "travellerLP", "date": "May 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162054951}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Bottom line- comfortable, peaceful, secure environment just a 5 min walk to town on safe roads. If you feel like having a good time, we found the many establishments on the main street to be quite accommodating. You'll be able to live it up at the (overpriced) restaurants with the money you saved from staying in this hostel!", "title": "An Oasis of Calm", "user": "TellurideRichard", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 161169563}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "We stayed in a double room with shared bath. Clean, comfy with good beds and because of the layout of the hostal very little street noise. Friendly helpful staff that was present and interacting with guests.", "title": "Bed bugs, bed bugs, bed bugs!!! Avoid if you don't like bed bugs.", "helpfulness": 1, "user": "S J", "date": "May 14, 2013", "detail_rating": {"rooms": 1.0}, "id": 160633724}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "We took advantage of the shared kitchen which was a big hit. We also spent time in the hammocks, also a big hit. We really enjoyed the calm atmosphere, a break from hectic San Pedro.", "title": "Waw, perfect for the backpacker who wants some affordable quality", "user": "D_vid13", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158476187}], "location": {"country": "Chile", "region": "Atacama Region", "continent": "South America", "city": "San Pedro de Atacama"}, "variance": {"poor": 1, "average": 12, "very good": 48, "terrible": 5, "excellent": 25}, "aka": "Hostal Sonchek Hotel San Pedro De Atacama", "slim_ranking": 0.111111111111, "description": "A pleasant place in town center, clean, safe, quiet;family atmosphere.English and french spoken by the owner. Moderate prices,solar energy, ecological awarness. Stuff support 24 hrs. Green garden, Wi-Fi, restaurant, bike-rental.Welcome!"}