{"user_rating": 4.5, "review_count": 454, "name": "Hostal Venecia", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "I really love this place and I would recommend to anyone traveling to Valencia and looking to stay close to restaurants, bars and cultural sites such as the Cathedral, Lonja, and many lovely plazas. The hostal is only 1 metro station away from the airport and a few minutes walk to finally arrive to the hostal. Take the exit Xativa which takes about 30 minutes and walk towards plaza del ayuntamiento.", "title": "My13' summer scape", "user": "funtaina25", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171475434}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "I can only speak for the room I stayed which was 8B and it was very nice, and comfortable to sleep. The door completely blocked the noise and the window and/or curtain completely block the sun which is lovely to have but not when you sleeping and or to bed late. I had a great view to the Plaza and my own little balcony.", "title": "Great location- but disappointing service", "user": "Krisgreg1", "date": "August 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 171451063}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "They change your room every day and supply toileterres even a little tooth brush☺", "title": "Great hotel", "user": "mini_899", "date": "August 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171374588}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Everyone there was very friendly but at times you might have someone not so friendly or who does not like to give directions…", "title": "perfect place.good value", "user": "evoinel", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170843141}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Now, keep in mind this is not close to the beach area but even that again it is only a bus away which takes 30 minutes. Now, the beach in my opinion is ok, don’t expect clear water and white sand, or bathrooms available to change, just a little portable bathroom when in much need to go BUT OMG, the seafood was amazing. I had fresh fist 3 days in a row, the best I’ve ever had in a long while so it is worth the trip to the port/beach area.", "title": "Nice room, service and location", "user": "judy_mash", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168873503}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "This hostal is excellent, from lockers to store suitcases to perfect rooms with balconies...", "title": "a hidden gem", "helpfulness": 3, "user": "antzinpants", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180844315}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We arrived early and the front desk suggested to store luggage(1 euro) returned to you when you fetch your luggage. Travelling with my daughters total 4 persons, we booked a quad...this was great! stayed in room 8a room had full balcony, with a great view, 4 sets of toothbrushes and sundries, comfortable beds and wonderful front end staff. Can not say enough about this hostal, but excellent and. lose to old town. Bus to aquarium complex 2 blocks away", "title": "average services", "user": "wolverdave", "date": "October 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 180161091}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "hotel is well located in the centre of Valencia", "title": "Everything we wanted.", "helpfulness": 1, "user": "58Grace", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180027836}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "rooms are cramped", "title": "Excellent", "helpfulness": 3, "user": "Alison D", "date": "September 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179238252}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "lift was not working for a while", "title": "3 days of sun, sangria and football with good vfm accommodation", "user": "nic_diver", "date": "September 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 178674641}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We found out about this place from our taxi driver. First, it is in a Great central location, great prices, clean room that also had a mini balcony. Wow! They also have lockers for your luggage incase you had to leave it there. Not even the Hilton has that! Stay here. This place gives a great new meaning to hostels.", "title": "Not your typical Hostel", "helpfulness": 1, "user": "RoxyD141", "date": "September 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175627368}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Excellent hotel. Central and accommodates for one's needs. The staff are extremely helpful and speak English which unfortunately was necessary since the locals do not speak English. The hotel is close to the train and underground station, in fact you can reach it in a few minutes by foot. All the Valencian attractions are close by. The only fact that I did not like was that during our stay we were charged daily with different rates according to the availability of the hotel, unfortunately we were not advised beforehand with this system.", "title": "A perfect choice", "helpfulness": 1, "user": "smic2013", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174567384}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "I stayed in Hostal Venecia for four nights. I had a booking for the smallest room type (basic room). This was perfect for me; as I was walking around in the city all day, I only needed a (clean) place to sleep, a bathroom and some breakfast in the morning. There was also air conditioning in my room.", "title": "Great location and staff, but noisy room", "user": "ElisavH", "date": "August 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 174473093}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The location was great! Everything I wanted to see in Valencia was within walking distance from the hotel. Also, public transit is very close by, which is handy when you want to visit the beach which is a bit further away.", "title": "Great hotel right in the old city", "helpfulness": 1, "user": "redmum64", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174134533}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The staff was friendly and very helpful, and also spoke English quite well.", "title": "Excellent location and decent rooms", "helpfulness": 1, "user": "ShalIndia", "date": "August 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173762516}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "What a pleasant surprise. Right in the centre of Valencia, within walking distance from the hop-on hop-off buses and within three blocks from public parking, if you go by car. Old building full of character, with beautifully renovated and modernised rooms. Modern bathroom, spotlessly clean. Free WiFi. Efficient and friendly check-in and -out. Great place to stay with any number of good restaurants close by.", "title": "Very good stay in centre of Valencia", "user": "ltjvv", "date": "July 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167779267}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Stayed there for 4 nights recently. Very good standard for price. Room cleaners were superb, Reception staff all very polite and helpful, especially guy with ponytail. Located in old central area within easy reach of restaurants etc. Room located on 5th floor with views over square, no noise during normal sleeping hours. Breakfast worth having to start the day. Only minor complaint was shower pressure fluctuated. Only ten minute taxi ride to airport for very early morning flight. Taxis can be booked and paid for at reception, they give you a coupon to give to driver. If you visit Valencia on a limited budget then this is the hotel for you.", "title": "Excellent for price and location", "user": "Football_Mad_13", "date": "July 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167217054}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This place is such a find. It's close to the train station so you can get to it easily if you are arriving by train. The location of the hostal allows you to look directly out to the plaza and the double glass doors shut out noise. The balcony has easy seating. Room is perfectly modern and clean and bright. The breakfast was tops for the money; don't pass on it. From the location you can walk everywhere. Above all, the reception was excellent. Everyone who worked the desk was polite and friendly. They provided service that was above the average. We had just the basic room so the more expensive ones would be even better.", "title": "First class service", "helpfulness": 1, "user": "stopoverqueen", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166176582}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "It was through trip advisor reviews that made me decide to stay here. And I haven't been dissappointed ! The location is amazing, close to everything (we did our own walking tour and found we were no further then 10 minutes away from the major attractions), 5 minutes from the station, fabulous clean rooms ( though I would of liked one with a view ), we were allowed an early check in, breakfast was reasonable and quite suitable and so far fantastic service all for a great price. We were traveling with our two girls who are older and they both said they would stay here again, as did my husband", "title": "Excellent Value", "user": "Wheelfam", "date": "July 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 166043317}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Not many amenities in this hostal/hotel but for the money it's a bargain, situated as it is in the town hall square. Our room was quite plain but comfortable and clean; good ensuite bathroom and toiletries, though the shower was a bit feeble. We asked for a room at the front on a high floor so had a great view over the square and minimal traffic noise as the windows are triple-insulated. The location meant that the station and many places of interest were within easy walking distance; buses and a tourist office are available in the square. Wifi is free and the staff are friendly and helpful. We didn't have breakfast there as we preferred to go out to one of the many cafes nearby, especially in the cathedral square. Highly recommended for a few days stay in Valencia.", "title": "Good value in great location", "user": "Montylado", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 165531614}], "location": {"country": "Spain", "region": "Valencian Country", "continent": "Europe"}, "variance": {"poor": 6, "average": 36, "very good": 231, "terrible": 4, "excellent": 177}, "slim_ranking": 0.0594059405941}