{"user_rating": 2.5, "review_count": 243, "name": "Hotel Itineraires", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2007", "text": "I lead a school trip with EF TOURS who seem to use this hotel very frequently. To be fair to EF TOURS, I informed them several weeks ago of what I'm about to share with you. We arrived at the hotel which is an easy metro ride just outside of Paris. Upon arrival we were given our rooms which were decent and livable, 1 ½ to 2 star accommodations, not \"3 Star\" by any stretch of the imagination! The pictures on the website are not even of the hotel from the outside and I did not recognize any of the rooms pictured on the inside! The kids wanted to contact their parents, as did I to inform them of our safe arrival in Paris. The phones in the rooms are purely for show...they don’t work! Not even room to room calls can be made. The hotel has two pay phones in the basement that you have to spend money on to access your international phone card, which is not normal. The phone on the left was unreliable and worked only on occasion, which left one pay phone in the entire hotel for every guest in the hotel! I was originally confused as to why I had to pay to use a phone with a calling card and one staff member relayed to another staff member in French that I was a stupid American! There was one internet terminal which was out of order the whole entire time. There are no alarm clocks in the rooms so bring one with you! Everything is bare bones basic. I've had better living conditions in military barracks while serving in the U.S. Army! On the first night there my students got in an elevator to go to their 4th floor room. The elevator broke down and the students we stuck between floors for two hours! When the hotel staff was informed of our students stuck in the elevator they did not have a sense of urgency! Thirty minutes after they were first informed of students stuck in the elevator and an angry group leader on their hands at the front desk they finally said \"maybe someone will be able to come to help in an hour\". This was at 11:00 PM after traveling all day. They also denied food to my group of kids. When one of my students tried to get a second croissant at breakfast they yelled at him before I stepped in! The breakfast served was stale cornflakes, cold hard boiled eggs, hard bread, and vending machine coffee. The staff seemed more bothered and annoyed by our presence than welcoming. They only speak French or Spanish. If you speak English they will basically turn around and ignore you. Don’t expect that warm and fuzzy feeling at this hotel; you are nuisance not a guest!", "title": "Degrading, Rude, Arrogant, and Down Right Disrespectful!", "helpfulness": 3, "user": "NVOUS845", "date": "April 17, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 7379437, "likes": {"liked": "— Leaving!", "disliked": "— The staff!"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "This hotel is situated close to the railway station near La Defense, surrounded by office buildings. The rooms are small, old-fashioned, grubby, the beds are short etc. - a perfect place to get depressed!!! Didn't try the breakfast, they will charge 11 Euro extra and based on the impression of the room you are not motivated to test the cook's competence. Go get another hotel, you may pay more but you will definitely feel better!", "title": "not recommendable", "helpfulness": 3, "user": "cutugno", "date": "February 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6750684, "likes": {"liked": "— good question", "disliked": "— the room"}}, {"rating": 1.0, "title": "Dont go!!", "text": "I got back last night from a school trip and th e hotel was distgusting. The food was horrible and we had tyo live on chips and bread. They didnt clean the rooms and we found mould on a pillow and whilst we were out peoples suitcases had been gone through. The hotel staff at reception were rude and had a go at us when we accidently locked ourselves out of our room. The only area that was particularly clean was reception. They only had 1 internet service and 2 payphones that weren't always working. Also there ws only 1 escalator that wasnt always working so we had to bring suitcases there via the steps. No way on earth should this hotel be a three star and my advice for everyone is dont ever go to this hotel, people evn ended up sleeping in the bathtub because of how bad it was.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 25, 2006", "id": 5208964}, {"rating": 1.0, "stay_parameters": "Stayed March 2005", "text": "Stayed in this hotel with a school group tour. It seems to be this hotel's main source of income. The staff were rude and unhelpful, the rooms semi-clean, and pillows were missing which they refused to replace. When we finally shuffled pillows from room to room to accommodate this, they tried to charge us afterward for stealing pillows!", "title": "Appalling experience", "helpfulness": 8, "user": "PrairieVisions", "date": "October 3, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3984916}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe"}, "stars": 3, "variance": {"poor": 48, "average": 39, "very good": 68, "terrible": 71, "excellent": 16}, "aka": "Itineraires Hotel Nanterre", "slim_ranking": 1.0}