{"user_rating": 4.0, "review_count": 274, "name": "Hotel San Antonio el Real", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "After three noisy nights in Madrid we found our stay at the San Antonio Real to be peaceful and relaxing. This was my second stay here. A major appeal for this property is the easy parking. The tradeoff is that you must walk 10-15 minutes to reach the town center. Or you could use a taxi. Anyway, driving in the center of Segovia is only for locals or the fool hearty. Our beds were comfy and the breakfast was very good. We could have use better lighting for reading and the room temperature adjustments were a bit finicky but the service was terrific. Segovia is a great place to visit and I would choose the San Antonio el Real should I return.", "title": "A Relaxing & Peacefull Stay", "user": "highdesertbadger", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157942288}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed at this hotel on route to Almeria Region after our 24 hour boat crossing to Santander. It was a lovely clean hotel and the rooms were of a high standard. The actual hotel was close to the aqueduct which made wonderful walk first thing in the morning before our long drive through Spain. Our room was very modern with plenty of towels, soap, gels etc.... Beds were comfortable. Breakfast was help oneself and not bad. I would definitely stay here again if we had to drive through.", "title": "A beautiful hotel with great location", "user": "bronzekitten", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157892430}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The not so central location of this hotel is rewarded with a pleasant 10 minute walk alongside the magnificent aqueduct to the main square at the entrance to the old town. Rooms are perfectly adequate, a little small and somewhat simply furnished but clean, bathrooms have plenty of towels and amenities. Public spaces are limited; a pleasant bar area, restaurant and breakfast room. The outdoor courtyard looked very nice but was not in use during my winter stay. Excellent choice at breakfast and buffet constantly replenished. The staff are helpful, courteous and hard working, if not overworked. Only ever one person on reception and one person on duty at breakfast and in the bar, which when the hotel was busy was definately not enough and service did suffer as a result. All in all, good value for money and a perfectly acceptable place to stay for the price.", "title": "Good Value for Money & Excellent Breakfast Choice", "user": "Ian W", "date": "March 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 155717661}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed here for one night between Madrid and La Rioja. The hotel itself is in a good location for 10 minute walk access to the main plaza. The staff is pleasant and speak English well if that is important to you. We found the room to be adequate yet dated. Nothing wrong with the room or the hotel, just not a place you'd be dying to spend more time in your room. The breakfast on the other hand, was a pleasant (and included in the price) surprise! Highly recommend eating breakfast in!", "title": "Average place to stay in a GREAT city", "helpfulness": 1, "user": "eschuetz", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154685467}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "Considering that Segovia is NOT the most touristic spot, none of us are really expecting an amazing hotel! Though i dont think someone elses hair in the bathroom is acceptable!", "title": "Four stars? Please...", "user": "Sarjanobicha", "date": "October 24, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 143634962}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Wife and I and a relative couple stayed here for a night. It had free car parking on the hotel ground and that was very convenient. The receptionists were friendly and their English standard was good. The rooms were a bit on the compact side but being a converted monastery they had done a good job.They were clean. The courtyard setting was beautiful. WIFI worked fine.", "title": "Nice clean hotel with character but rather too far from town", "helpfulness": 1, "user": "SC168", "date": "June 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 132020652}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We walked from the hotel to the centre of town alongside the aqueduct and all the previous reviewers were right, one couldn't really get lost. The walk told 20 minutes and if you were not in a hurry it was a good walk. The Aqueduct and the cathedral were great sights. We drove round to the back of the Alcazar to view the whole place from a little distance and it was really great, especially in the late afternoon sunlight.", "title": "Wonderful hotel, just a bit of a walk to everything", "helpfulness": 1, "user": "kent1228", "date": "March 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "location": 3.0, "service": 5.0}, "id": 127030626}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We wanted to go into town to a recommended restaurant for dinner and were advised by the receptionist to drive and park the car in/nearer town. It proved to be just too difficult to do, the roads were just to narrow and there were not enough parking for cars. At the end we had to return to the hotel restaurant as it was getting late. The menu ther was quite restricted and service was slow but at the end it turned out to be an ok event, though rather expensive in our opinion.", "title": "Location, location, erm - not so much", "helpfulness": 2, "user": "AnthonyCG", "date": "February 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 124135881}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "If one prefers to have free parking and don't mind a bit of walking, then this hotel could be a good choice. I wont recommend the restaurant as it was too expensive for what it offered. But as parking was difficult in town, the decision becomes difficult after 1 round of walking to town for sightseeing!", "title": "wonderful property in a great city", "user": "IndyTravelingCouple", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123864617}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "My family stayed here in March. The rooms were great, the facility is top notch. Free parking for our car was nice. Excellent wi-fi for staying connected and uploading photos. The only item that may be a surprise is the walk to the town center. As a previous reviewer mentioned, you can't get lost, you just follow the aqueduct. The walk is a brisk 10 minutes to everything. Down hill into town, uphill back to the hotel. This wasn't a problem for us but could be to some.", "title": "Beautiful Out of Centre Hotel with Mediocre Service", "user": "FireflyJH", "date": "November 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120019211}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "by the pictures of the beautiful building. It is lovely but our room was small, no storage space and so dim we could not read. On arrival the only outside space, a lovely courtyard was out of bounds due to a pre-booked party. Same thing on our last night. We were so disappointed we did complain to reception but got the inevitable shrug of the shoulders. Breakfast was quite good. The hotel is also quite a walk into the centre, coming back is up hill so not suitable for the less energetic!", "title": "Do not be seduced.........", "user": "Bakerblog", "date": "October 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 143104402}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The hotel boasts a beautiful setting as part of a 15th century monastery. The design of the hotel blended very well with the ancient cloister. Rooms were very comfortable and staff most attentive. The food served in the restaurant is of very good quality and the breakfast was plentiful and varied. The location is very convenient since the Hotel is just beside the start of the Roman Aqueduct, at walking distance from the centre. Not to miss the Monastery of San Antonio el Real itself, which is beside the Hotel. One breathes history throughout the stay! All in all a very pleasant discovery.", "title": "Full comfort in a 15th century setting", "user": "babk", "date": "October 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142430105}, {"rating": 1.0, "stay_parameters": "Stayed September 2012", "text": "After our meal at the hotel we asked for a couple of glasses of wine but were told this was not possible as the bar was closed and they would not serve us. We could only get drinks from the mini bar which is poorly stocked if you don't want beer or spirits. The staff were very unhelpful and not what you expect in a 4 star hotel. We will not be staying here again", "title": "Disappointing", "helpfulness": 2, "user": "RozJones98", "date": "September 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 139692415}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The San Antonio El Real Hotel is a very pleasant, atmospheric, clean and comfortable hotel with many attributes not least of which were the very friendly and helpful staff. It is situated in a quiet area which is only a 10-15 walk from the old town centre, following the route of the Roman Aquaduct. Return however takes a little longer as it is quite a steep gradient unless you choose to meander back via the shops.", "title": "Excellent location", "helpfulness": 1, "user": "longhair9", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138573665}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Our room was small but clean and comfortable, quite sufficient for a short stay. The bathroom, although adequate, was very small, not a lot of room for maneouvre, but to be fair did have a full suite at the expense of space. I do not, however, want to sound negative, I am sure that larger rooms are available. The food was excellent and reasonably priced, breakfast was a buffet affair which was plentiful and varied. In the evening if you wish to dine outside you have to book at reception but there are also many restaurants in local proximity should you wish to avail yourself of them. There are plenty of free car parking spaces at the hotel, a small number of them under cover. We thoroughly enjoyed our stay at this hotel and would not hesitate to return.", "title": "First class service at the bar", "helpfulness": 2, "user": "BeatainOz", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 136435464}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We were worried that this hotel might be a bit far out of the city, but it wasn't. We walked in along the aquedact which provided shade and was also quite romantic. The Hotel is lovely. Our room was above the cloisters. Loved the window seat in the bedroom. A really relaxing hotel and a very comfortable bedroom. We booked breakfast which proved to be worthwhile as there didn't seem to be any cafes around the hotel. Very wide choice at breakfast. Free parking was also great.", "title": "wonderful", "user": "chad18", "date": "August 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136393737}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "the welcome part was very kind but it is an hotel with no manager every thing are sad ,economy of light every where,the quality of the services is very low and you are in the mercy of the waiters", "title": "bad choice a pity", "helpfulness": 1, "user": "jpo1952", "date": "August 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 135949730}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "the hotel have all the conditions to be good", "title": "\"very good hotel but irritating notices\"", "user": "ALMYRO_ONE", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133759234}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "the impressions are that they have no more money to maintain or no or bad general manager", "title": "Unique Experience!", "helpfulness": 2, "user": "Dax57", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133612795}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I must agree with most of the comments that have gone before, it's a great hotel, parking is very good and car was kept undercover, could have paid for garage space but in my opinion wasn't needed. Rooms are not parador size but never the less are adequate. The bed and the pillows were very comfortable, air con was fine. Bathroom had a really strong shower and water was as hot as you required. Telly provided english news channel, something you always think you need untill you find the Spannish equivolent to quizz show you have back home! One thing not so usual these days is paying 8€ for the safe in the wardrobe.", "title": "Delightful Hotel", "helpfulness": 1, "user": "LeahSpencer", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132184992}], "location": {"country": "Spain", "region": "Castile and Leon", "continent": "Europe"}, "stars": 4, "variance": {"poor": 11, "average": 35, "very good": 109, "terrible": 9, "excellent": 110}, "aka": "San Antonio El Real Hotel", "slim_ranking": 0.37037037037}