{"user_rating": 3.5, "review_count": 71, "name": "Hotel Red Lion", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "We stayed at the Dom U Cerveneho Lva this past May and absolutely loved it. Our room was one of the rooms displayed their web sites(----). We found our room to be very large, clean and neat -- plus, the bedroom had a view of the hills which was absolutely beautiful (especially at night when the tower was lit up). Even though there is no air conditioning (we were there during a very hot spell) it seemed as though the hotel's location (close to the top of a hill) provided many refreshing breezes. Not only were we right next to the castle, but we also had many wonderful eateries to choose from (and did I mention it's proximity to the Charles Bridge?). The only down-side of this hotel is that because it's up the hill a bit, it can be a tough climb; however, one suggestion is to take the trolley to the castle and then walk down to the hotel. The restaurant in the hotel is very nice and quite convenient. Also, if you're looking for a really great personal tour guide during your stay in Prague, contact Katarina Kruspanova Prague-perfect.cz).", "title": "It all depends on the room ....", "helpfulness": 10, "user": "CADreamin", "date": "July 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3722669}, {"rating": 4.0, "title": "Quiet and Historical", "text": "Did we love Prague? Oh yes! Would we stay at the Dom U Cerveneho Lva again? Definitely!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 23, 2005", "id": 3695675}, {"rating": 5.0, "title": "great location, great price", "text": "This hotel is in a lovely, quiet spot away from the hustle of Prague Centre. Definitely the place to stay for a quiet, peaceful trip (no stag or hen parties in evidence). Only down point about our stay was that on arriving late on our first night we were sent across the road from what I knew was the hotel I had booked to a different hotel. We were told we had to stay here and could not move. Given the late hour we reluctantly stayed in the other hotel and went across to the correct hotel the next morning. We were told \"Other hotel is the same as this one, you have to stay there.\" After a bit of a barney with the manager we were given a room in the Red Lion which was the one I had booked originally. On return I found the other hotel to be cheaper than the Red Lion which I had already paid for in advance. This experience left a sour taste with us for the trip, but made us very wary of being ripped off during the rest of the trip (and many people did try!) On the positive side, I would highly recommend a lovely medieval theme restaurant just down the road from Red Lion. It was really great, the best place we ate at all trip. They even served mead, and had lute music which was lovely!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 4, 2005", "id": 3251024}, {"rating": 5.0, "title": "The Best", "text": "Stayed 25-27 Dec 04. We were surprised how crowded Prague was x-mas day considering how deserted Germany was the day before. This hotel is in a great location right below Prague castle. There are plenty of shops, restaurants and pubs nearby in the castle quarter. Compared to the rest of Europe we found this hotel offered great value (3200 kc). Although we reserved a double we got upgraded to the top floor suite, with two bedrooms, and a great view of the street below. Room well appointed, spacious, even had wine glasses. Breakfast was good, with hot and cold choices. We reserved thru Athos.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 24, 2004", "id": 2597367}, {"rating": 5.0, "title": "Beautiful Red Lion", "text": "This hotel was the absolute best! The location was great, very picturesque, quiet, historical. We had a suite with 3 bedrooms, clean, beautiful, spacious after our tiny Paris room. Easy walking to the castle and the Charles bridge. If you are going to Prague, this is where to stay. The breakfast is included and was delicious. The staff friendly and helpful. They also have a car and driver available to pick you up at the airport or train station. Very nice and spoke excellent English.", "helpfulness": 8, "user": "phototripper", "date": "August 14, 2004", "id": 2449203}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My girlfriend and I stayed here last week for three nights and had a good stay. Though definitely not a 4 star hotel as they market themselves we weren't expecting it to be either. It is a charming hotel with a good location. The painted roof and old furniture are big pluses, the staff (of which most spoke decent english) were nice. On the minus-side is the pretty small breakfast.", "title": "Nice roof and good location", "user": "Gnopps", "date": "December 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 11669971, "likes": {"liked": "— The unique rooms", "disliked": "— The breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Nestled in the city of Prague, within walking distance of the Palace - the Red Lion Hotel - ROARS!", "title": "Red Lion - Roars!", "helpfulness": 3, "user": "Casa_Baskey", "date": "October 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10485567, "likes": {"liked": "— Beautiful, romantic room and location", "disliked": "— No elevator, not so friendly front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We were located on the top (3rd floor) of this quaint hotel with a spectacular view of the streets. NO elevator in this hotel, so if you have alot of luggage or cannot climb stairs, make sure you ask for the 1st level (steep stairs to the 3rd floor).", "title": "Almost Perfect!!", "user": "Y0lly", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8677890, "likes": {"liked": "— Friendly Staff & classic rooms", "disliked": "— No lift"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Room was huge, furniture nostalgic and romantic. Quiet area of Prague. Good brisk walk to the St.Charles Bridge - but worth it.", "title": "Great hotel!", "user": "ensorfamily", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8535732, "likes": {"liked": "— Beautiful furniture in the rooms", "disliked": "— There is a steep climb to reach the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Restaurant had traditional Czech food and was very good.", "title": "Great hotel", "user": "lizdublin", "date": "August 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8507555, "likes": {"liked": "— The room", "disliked": "— The noise"}}, {"rating": 2.0, "title": "There's always a 'but'..", "text": "We stayed there for 3 nights in December.Lovely building,close to the castle,but so loud at night that for 2 nights we couldn't sleep. Very friendly and efficient staff always eager to help..but the stairs are impossible. Renovated bathrooms..but strongly smells of sewage and there was no ( NO! ) water pressure and it was next to impossible to take a shower. I can continue along the same lines: very clean, good view from the windows facing Nerudova....you guessed it! BUT the back windows are looking on a blue tarp covering the missing roof Our general impression was that they are trying hard, but the outcome is slightly pathetic", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 23, 2004", "id": 1611471}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "There were 5 in our group. After reading some of the reviews on this site, we all asked for rooms to the front of the hotel - and got them ! All three rooms were beautiful, clean and maintained to a high standard. The decor was old and classic - absolutely nothing shabby in any of our rooms. The bathrooms were all cleaned every day and the hot water was plentiful. The breakfast gave choice to even the fussiest of diners - cereal, fruit, yogurt, pastries, bread, cheeses and cold meats.", "title": "A Wonderful Hotel away from the stag/hen nites", "helpfulness": 4, "user": "EandSNorthernIreland", "date": "April 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7367743, "likes": {"liked": "— Location/Views", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We loved the location. One of the earlier reviews said that it was about 20mins to the center ?!?....maybe on your hands and knees ......5 mins took us to Charles bridge and even less to the Castle. The hotel is on a steep hill and so may not be suitable for anyone with walking difficulties.", "title": "Superb location, charming room", "helpfulness": 5, "user": "chmod", "date": "November 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6157546, "likes": {"liked": "— the location, and the style of the room", "disliked": "— the tiny shower stall"}}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "If your thinking of booking this hotel - shop around. We got a better price than that advertised on the hotel website as we booked through a third party [--].", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 11, 2006", "id": 5049549}, {"rating": 4.0, "title": "Our rescuers!", "text": "Another tip - the exhange rate is much better over there so keep your Euro's and Sterling until you get to Prague and you'll be quids in !", "user": "A TripAdvisor user", "date": "April 15, 2006", "id": 4974792}, {"rating": 5.0, "title": "a little gem every year!", "text": "With so many hotels and lodgings from which to choose, I feel lucky to have selected Red Lion. I based the choice upon reviews on this site as well as after having studied the location on a map.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 2, 2006", "id": 4827938}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 4, "variance": {"poor": 9, "average": 12, "very good": 28, "terrible": 4, "excellent": 18}, "aka": "Red Lion Hotel Prague", "slim_ranking": 0.702823179792, "description": "Romantic hotel Red Lion is located in an historic burgher house from the 15th century in the very centre of Prague. It lies directly on the Royal Route, only 400 metres from the Prague Castle and 500 metres from the Charles Bridge. All rooms have an enchanting view of Petrin, the Royal Route and the roofs of Mala Strana (Lesser Side) underneath the Prague Castle. They are equipped with historical furniture. In some rooms you will find the original painted wooden ceilings dating back to the 17th century. Hotel guests can enjoy lunches in the hotel restaurant with remarkable renaissance ceilings. The restaurant serves traditional Czech as well as international cuisine. Breakfast is served in the form of rich hot buffet. The pub U Cerveneho Lva invites you for a glass of wine or Pilsner beer. Its centuries old stone walls provide cool refuge from the heat in the summer, which makes the pub a perfect oasis to relax in. The bar, which dates back to 1350, is located in a lime stone cellar with Gothic vaulted ceilings. It serves a variety of hot and cold drinks. The pleasant atmosphere of the hotel patio invites our guests to relax. A limited number of parking places is available directly in front of the hotel. You can use free Internet spot in the lobby."}