{"user_rating": 4.0, "review_count": 755, "name": "Hotel Mozart", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We just returned from Rome yesterday and know how the Trip Advisor helped in making our decision to stay at this lovely hotel. We were there for 3 nights and stayed in the Vivaldi Suites. There are two levels of suites so ours did not have a balcony or couch which others had listed. However, what it did have was a gorgeous bathroom with all modern and high end amenities. a notebook computer with free internet access, a very comfortable king sized bed, and a large flat screen tv (2 english channels - one CNN the other a movie channel). The long windows opened into the internal courtyard so the room was very quiet and we didnt hear all the sounds of the Via Del Corso.", "title": "Wonderful Place", "helpfulness": 4, "user": "Breezey", "date": "September 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3942363}, {"rating": 5.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "The Vivaldi Suites are very close to the main hotel (literally a minute walk) which has a wonderful roof top garden where we had drinks before dinner each night (the first night drinks were on the house). Breakfast was delivered to the room about 10 minutes after the call and the tray is beautifully presented with fruit (never saw such a large peach in my life), hard boiled eggs, meats, cheeses, yogurt, and wonderful breads and cookies. You can ask for cereal and eliminate of course those items that you dont want. And dont forget the cappucino!", "title": "A Solid Choice", "helpfulness": 5, "user": "AmoItalia", "date": "September 26, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3939920}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "The location of this hotel cannot be better. You are minutes to the Spanish Steps and very close to the Trevi Fountain and some wonderful restaurants.", "title": "Not as good as we expected.....", "helpfulness": 17, "user": "TrvlDva", "date": "September 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3937859}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Suggest that if someone recommends the Porto di Riappeti do not go! Specializing in seafood (they say it is fresh) we were very disappointed in the food (flavorless to bad) and the service (dont let the owner fool you, he does a great sales job but once he is gone the waiter is very unfriendly). On the other hand had a great meal at the Brasserie de la buvette on Via Vittoria (a block or two from the hotel) and another at a hotel recommended restaurants on Via Riappeti. We tried the much touted San Crispino Gelati near the Trevi Fountain and were disappointed. Much richer than other gelati that we enjoyed and much preferred the offerings at the Gelateria Bar across the street from the Trevi Fountain.", "title": "A little gem in the heart of Rome", "helpfulness": 3, "user": "Giannetta", "date": "September 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3926255}, {"rating": 3.0, "title": "pros and cons of hotel mozart", "text": "I would definitely stay at the Hotel Mozart when I return to Rome.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 20, 2005", "id": 3925191}, {"rating": 5.0, "title": "Loved the Vivaldi Suites @ Hotel Mozart", "text": "We had reservations at the Hotel Mozart and then after reading some the good reviews of the Vivaldi Suites at the Hotel, we upgraded before we left for Rome. It was a super room. The bathrooms were beautiful ( spa tubs), beautiful breakfast served in your room everyday. We did not see the regular rooms at the hotel (Vivadi suites are down the street a bit), but I am sure they were nice. Also, there is a rooftop wine/coffee place that was a great spot to be in the evening. The location is perfect! We walked everywhere. We definetly would stay there again.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "October 10, 2005", "id": 4005015}, {"rating": 2.0, "title": "The computer is a mess", "text": "9/13-16/05.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 10, 2005", "id": 4004950}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "After a careful check on the day itself (explicit written confirmation) we arrived around midnight and found out that there were no rooms for the five of us (2 superior doubles and 1 single) because \"the computer is a mess\". The owner arranged for another hotel and provided a room for three. A very disappointing start! The hotel is ok, staff is ok, we think the hotel is overpriced. We wouldn't recommend it.", "title": "Vivaldi Suites were very nice ... but", "helpfulness": 6, "user": "skay448", "date": "October 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4003989}, {"rating": 5.0, "title": "Best hotel of our trip to Italy", "text": "We really liked our room and the room service at Vivaldi Suites. We over looked Via del Corso so it was very noisy in the morning, starting at 7am. The hotel concierge were somewhat helpful but not high service. We thought that entering the Suites off the street was cool, but that the hallway and stairs (elevator was broken) could use some real cleaning in order to improve appearances. Once you entered the Suites themselves they were fabulous. We did not love the location as we spent most of our time walking someplace else, i.e. Trevi, Forum, Vatican, Farnese, Campo de Fiore. I would like to stay someplace further south next time,i.e. Farnese or Campo de Fiore areas. We loved Rome - would go back but maybe not to Hotel Mozart.", "helpfulness": 13, "user": "MicheleDinAZ", "date": "October 9, 2005", "id": 4002765}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "We stayed in the Vivaldi Suites for four nights at the start of September. This was our favorite hotel of our 12-day 11-night trip through Italy. The Vivaldi Suites are away from the main hotel, a short walk down the street in an apartment/condo type building. They are entered via two large wood doors between a couple of shops. It was neat - like we lived there!", "title": "Good location but the location isnt worth the headache", "helpfulness": 10, "user": "VACCATIONMAN", "date": "October 4, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 3988040}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "We stayed in one of the vivaldi lux suites and thought it was great! Big rooms, spa bath, stylish, quiet with double glazing, nice delivered breakfast, great location, v nice toilettries. Highly recommend. If i wld be picky, i wld say that the staff cld be a bit surly but i think that's just rome.", "title": "fantastic", "helpfulness": 1, "user": "CPThomas", "date": "May 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15946835}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Wld be especially good for a girls trip, i think, as you can get a 2 bedroom, 2 bath apt and it's right on the shopping street!", "title": "What a great location", "helpfulness": 1, "user": "alinaSP", "date": "May 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15722486, "likes": {"liked": "— location and our room facing the back, less noise"}}, {"rating": 4.0, "title": "Good Roman Hotel", "text": "After reading reviews on a number of different sites for more than 50 hotels in central Rome, we decided to book a room for three at Hotel Mozart. When you read so many reviews it gets very confusing, and you basically must make a decision on what is most important to you and your family. For a week-long visit to Rome location is everything. Hotel Mozart is situated 15 minutes from the Trevi Fountain, 5 minutes from the Spanish Steps, another five in the opposite direction is Piazza Popolo, 20 minutes away the Pantheon, 30 the Colosseum and the Roman Forum. Rooms were a good size, clean, great beds, brand-new marble bathrooms, better than we expected from a 3 star hotel. Another plus: the hotel offers a hearty breakfast not only the traditional cakes and pastries with coffee. We were given some great recommendations for dinner from the gentlemen working at the front desk, especially Claudio who sent us to a very nice tratoria in Trastevere. As one reviewer has mentioned, cars can not pull up in front of the hotel, but the walk from the main street Via del Corso, is less than a minute, and we never had to carry our bags, the bell-boy was always helpful and courteous. The taxi stand is 5 minutes from the hotel, and the closest bus stop only 2 minutes on Via del Corso. We had a great vacation in Rome and we look forward to coming back one day and staying at the Mozart again. The Romans are very polite and courteous and they expect the same of everyone else, and remembering that will make your experience in Rome even better.", "helpfulness": 1, "user": "TravellingFinn", "date": "April 28, 2008", "id": 15427215}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I had a long weekend holiday with wife and two friends. The Hotel is located very practically and is very clean and neat.", "title": "Loved it!", "user": "jen583", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14531273, "likes": {"liked": "— The value for money", "disliked": "— There was nothing we could fault it on"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The rooms are big enough even though the view wasn't the best from the first floor.", "title": "Loved the complimentary cocktail!", "helpfulness": 1, "user": "AHopeLeicestershire", "date": "March 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14448243, "likes": {"liked": "— Cocktails! Air conditioning", "disliked": "— Some noise from the street"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "We stayed in one of Hotel Mozart's Vivaldi Luxury Rooms and it was hands down the best hotel on our Italy trip. You first check in at the Hotel Mozart and a bellman escorts you on a short walk about a block away", "title": "When in Rome............Stay Here!", "helpfulness": 12, "user": "rhirsig", "date": "November 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4090600}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "from the Hotel down Via Del Corso (the city's chic and hip shopping street full of Rome's most fashionable stores) to a non-decsript street entrance into a building up several flights of stairs(the elevator was broken when we were there). Each floor has has only a few rooms with your own private housekeeper stationed there. The room was definately \"Luxury\" with a combination jacuzzi tub/jacuzzi shower, 42\" plasma tv, oversized king bed, and a laptop computer with free high speed internet access. Breakfast is included in the price and delivered directly to your room minutes after you place the order. The room was very quiet as it faced an inner courtyard. The staff was excellent and helpful. We received several diffrent restaurant recommendations from the front desk to local places with great food at reasonable prices. Also included is a free drink on the rooftop bar which has a great view of Rome. The hotel is perfectly located in the heart of the city. You can walk to almost anywhere or jump on the subway at the Spanish Steps only a few blocks away. You probably will rather walk or even take a taxi(reasonably priced) since the subway can be very crowded. Book directly with the hotel online to get a price which can't be beat for what you get.", "title": "Rome is amazing and this is a super place to stay", "helpfulness": 20, "user": "sweenoid", "date": "November 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4086261}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "I don't know why anyone would stay anywhere else in Rome.", "title": "Vivaldi Rooms Were Great", "helpfulness": 7, "user": "smy", "date": "November 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4085205}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "we always believe that a hotel is a base to explore from and it's a bonus if we look forward to returning to our vacation base , the highlight here is the City of Rome and The Vivaldi suites are an ideal base to explore this magnificent City.", "title": "Vivaldi at Mozart was OK", "helpfulness": 4, "user": "David H", "date": "October 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4069839}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "It was our second stay this year but this time we took 2 rooms as we were accompanied by our children , the rooms are large , the bathrooms super , we don't use minibars but if you do it's good value , we don't watch TV but the 42\" plasma TV does look very impressive!! , the room PC's were well received by the kids for e-mail and msn - personally I like to take a break from that on holiday!.", "title": "Go for the Hotel Mozart", "helpfulness": 6, "user": "KazzaLou", "date": "October 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4055467}, {"rating": 4.0, "stay_parameters": "Stayed September 2003", "text": "Location very near Spanish Steps and Spagna M station . Convenient location, but not a lot of good dining options nearby. Room stayed in (220) was comfortable, but on smaller side. Breakfast was a rich spread, including meat and cheese, good pastry and coffee, in addition to regular continental breakfast fare. Only downside to breakfast was no variety over the 3 days stayed there. Free web access from hotel was much appreciated.", "title": "Convenient Location", "helpfulness": 1, "user": "ImOut", "date": "March 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4586137}, {"rating": 5.0, "title": "Wonderful Hotel!!!", "text": "This was our second stay at this wonderful hotel and once again, it was truly memorable. The staff are friendly and helpful, the hotel is fantastic (we stayed in the Vivaldi luxury suites). An added feature is a laptop in the room so enables us to keep in touch with our friends back home.", "helpfulness": 1, "user": "juttifrutti_uk", "date": "March 5, 2006", "id": 4583672}, {"rating": 5.0, "title": "Brilliant!!!", "text": "Would recommend this hotel for it's location and comfort.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 9, 2006", "id": 4448481}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We stayed at The Hotel Mozart for 4 nights and found the hotel excellent. The staff were very friendly and could not do enough to help you. The room was clean and had the relevant facilities expected - hair dryer, mini bar, tv etc. The location of the hotel was brilliant, within walking distance of everything and situated down a side street so at night it was not noisy at all. I would recommend this hotel to anyone and would definately stay there again.", "title": "Vivaldi Luxury Rooms are Great", "helpfulness": 3, "user": "kaplanb1", "date": "December 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4309522}, {"rating": 4.0, "title": "Great stay but mixed feelings about whether it is worth the hype", "text": "We spent 2 nights at the Vivaldi Luxury Rooms just after Christmas. They are completely fantastic! Large comfortable beds. Impeccably clean. Modernly furnished, and a great location! The in-room breakfast is fantastic, and the jacuzzi and turkish sauna are a great way to end a long day of sightseeing!! There's no reason to stay anywhere else in Rome!!", "helpfulness": 8, "user": "London_bird", "date": "November 29, 2005", "id": 4153082}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "My two friends and I booked the Ripetta Suite apartment for 4 nights for a christmas city break in Rome. The location of the hotel/apartments is excellent. It is just off Via del Corso, near the Spanish steps. You did have a bit of a walk to get to the colosseum etc but to be fair, if you want to stay in a nice area of Rome you have to be prepared to walk! The walk was an easy walk and worth it to be in a nice area. Where ever you stay in Rome you have to walk to get everywhere.", "title": "Great for a city break", "helpfulness": 2, "user": "shakeysarah_1", "date": "December 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11944559, "likes": {"liked": "— good location and very nice apartment", "disliked": "— all the stairs!"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The apartment had a nice bathroom and bedroom with a double sofa bed. It was very comfortable and cosy. The kitchen was well equiped and the breakfast was generous so we made breakfast and a packed lunch every day! the apartment was cleaned everyday by cleaners (it was basically like staying in the hotel but with more independence!) there was two LCD TVs with sky and a dvd player. This was very useful as we unfortuantely discovered the night life in Rome was quite quiet compared to Britain!", "title": "it was okay...", "helpfulness": 2, "user": "geminigirl24", "date": "November 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10943415, "likes": {"liked": "— location", "disliked": "— service"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I would recommend this hotel to any of my friends and family. I would also recommend a guide book like Lonely Planet to guide you through Rome. This was useful at telling you nice places to go and places to avoid!", "title": "Loved Hotel Mozart", "helpfulness": 1, "user": "Auntnikki", "date": "September 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10006622, "likes": {"liked": "— rooms were clean"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Stayed at the hotel mozart nov 10 - 15. A car picked us up from the airport (arranged by the hotel) with no problem.", "title": "Great Hotel In One of the Best Areas of the City", "helpfulness": 3, "user": "WonderMan3", "date": "September 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8753827, "likes": {"liked": "— Location, guest room", "disliked": "— Service"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "A previous poster was right about the check-in - not overly friendly. usually i don't mind however after a long flight and in a foreign country, you want to feel welcomed at your hotel.", "title": "I recommend this hotel", "helpfulness": 1, "user": "kittywake", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8678881, "likes": {"liked": "— Convenient and Luxurious", "disliked": "— no wifi or internet access in our room"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Charming hotel on a quiet side street off of Via Corso and very close to the Spanish Steps. It is surrounded by many other 4 Stars that are a lot more expensive. My room was nice but on the small side; the small dressing area off the bathroom partly made up for this and the closet was a good size for two to unpack (often a problem in Europe). Room was extrememly quiet. Breakfast was excellent. Nice that they had 3 computers for guest use. Overall a very pleasant stay at a reeasonable price for what I got.", "title": "Nice 4 star hotel in a great location", "user": "gbs4", "date": "March 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14212323, "likes": {"liked": "— location, quiet"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We have just come back from a romantic trip to Rome. The Hotel Mozart was a lovely hotel with lots of charm in a perfect location just round the corner from the Spanish Steps and Metro station. We could walk to most attractions from there.", "title": "Charming Hotel", "helpfulness": 1, "user": "Sam55Essex", "date": "February 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13814302, "likes": {"liked": "— Location", "disliked": "— Computer advertised as having internet facility did not work for whole time we were there."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Getting around was easy. We bought a 3 day pass for Metro which also allowed us to use buses in that time.", "title": "What a find!!!!", "helpfulness": 1, "user": "Ali24", "date": "February 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13674034, "likes": {"liked": "— Fantastic location", "disliked": "— Nothing!"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Taxi's can only be got from Taxi ranks, but these are in all the popular spots. Rough guide cost wise : It cost us 8 euros from Spanish Steps to Termini Station. St Peters Square to Hotel was 12 Euros.", "title": "What a disappointment", "helpfulness": 3, "user": "juliensap", "date": "February 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 13444559}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Our room was clean with well equipped bathroom. a little small, but not enough to bother us. Room had kettle and vrious teas/coffee facilities. Also had a stocked mini bar, TV with Sky (some channels were able to be switched from Italian to English language-some not), DVD player and various toiletries.", "title": "Elite apartments are excellent for a family.", "helpfulness": 3, "user": "faroadviser", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13437912, "likes": {"liked": "— The relation quality / price", "disliked": "— Not having a lift."}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "I' ve booked 4 rooms for four nights, one single for me and 3 double rooms for my friends. I had been quite sure that the hotel would be a very good 4 star hotel, because of the comments i had read at various travelling sites. Unfortunately, that was not the case: first and foremost, my room (no 212) was stinking during the last three days of my stay. The sewage system/cesspool of the hotel was definitely the cause. The first night I' ve noticed the problem I didn't complain, since I thought to be just a bad coincidence. I was wrong! The odours were lingering in the air all the time since then, so I had to leave the window open. When I informed the receptionist (on the eve of my departure), he seemed to ignore the problem (nonetheless, I am sure that he was aware of it), but he was willing to give me another room for the last night. With regard to the (standard) double rooms, one was fairly good, but the rest were very small for a 4 star hotel and the bathrooms were extremely tiny. In fact, when we arrived at the hotel, two couples were so disappointed that they demanded another room. The receptionist was willing to find a solution and after two unsuccessful attempts, a superior appartment at an adjacent building was offered at the one couple without extra charge.", "title": "Overrated, too much ado over nothing", "helpfulness": 3, "user": "Vagabond_Ulysse", "date": "January 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 12978129, "likes": {"liked": "— ITS PERFECT LOCATION", "disliked": "— THE VERY SMALL ROOMS, VENTILATION SYSTEM/SEWAGE SYSTEM"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "To sum up, the pros are: perfect location (next to piazza di spagna), very helpful reception (always very willing to help and give useful hints & tips about the town), clean rooms. The cons: the sewage system (and/or the ventilation system) of the hotel, the size of the (standard) rooms and bathrooms, the breakfast (it would have been ok for a 3 star hotel not for a 4 star one). In other words, hotel mozart could be said to be a decent 3 star hotel at the heart of Rome.", "title": "Central but noisy", "helpfulness": 3, "user": "DesignerOslo", "date": "January 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 12799144, "likes": {"liked": "— Very central, nice area with luxurious shops-short walk to hotel russie with cool bar", "disliked": "— refurbishment and noise"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This hotel was recommended by a norwegian newpaper as a charming, central hotel i Rome.", "title": "Not so Roman Holiday", "helpfulness": 3, "user": "IndyCleanfreak", "date": "January 13, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 12587442}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The price is ok, so I booked it for a surprise trip for me and my other half.", "title": "Pleasantly Surprised", "helpfulness": 2, "user": "CTS29", "date": "January 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12321381}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We got a tiny doubbleroom with a nice bathrooms, and satelite tv.", "title": "Vivaldi Suites were great", "helpfulness": 2, "user": "mbspitale", "date": "January 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12295194}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 25, "average": 68, "very good": 296, "terrible": 17, "excellent": 349}, "aka": "Mozart Hotel Rome", "slim_ranking": 0.135433070866, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}