{"user_rating": 4.5, "review_count": 946, "name": "Hotel Re di Roma", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Lovely hotel - friendly and helpful staff, clean, ample continental breakfast. Couldn't have asked for more. Well placed close to metro, short hop into Rome. Staff were more than helpful. Free internet access. Room clean, good size bed, hair dryer, bar (only thing missing was a kettle for any 'british teapots' like me, but staff were happy to provide tea when we asked). We had lovely large patio area. Good choice at breakfast - cereal, toast, croissants, fruit salad, fresh fruit, yoghurts, fruit juice, tea, coffee, chocolate, etc. Would definitely stay here again.", "title": "Couldn't have asked for more - FAB hotel", "user": "LinCritter", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66355253}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I stayed at Hotel Re Di Roma for just one night, as we had to leave for a cruise early the next morning. We received the recommendation from our tour guide. The hotel is medium size, about 50 rooms but they were so warm and helpful it felt like a pensione. The place is impeccable, the breakfast adequate and the metro to take you in the center is only a 2 minute walk. I'd stay here again, just have to save up for a longer stay in Rome next time!", "title": "Loved everything about this hotel, even the area.", "user": "traveloretta", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 66310576}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Location - We looked on Google Maps Street View before arriving to the hotel so we knew where we were going - as the hotel has no sign. The hotel is near the Re Di Roma metro station so it's easy to get to and from downtown. It is a brisk 15-20 minute walk to the Colosseum. Hotel street is very quiet. Re Di Roma Plaza has pizzerias, pasta places, gelaterias, 3 grocery stores, shopping, etc. Nice community.", "title": "Cozy and Clean.", "helpfulness": 1, "user": "Ibideb", "date": "May 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 65972921}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Hotel - Super clean and modern. The front desk is small, lobby is big. There is a accessible computer in the bar area for guests with free internet. There is free internet in the rooms if you have a laptop of wireless devices. Free breakfast is great - cereal, pastries, espresso machine, fresh juice, meats and cheese, and yogurt. The front desk will hold your key so you don't have to. There are 4 stories, 1 small lift and stairs.", "title": "220 steps to metro - cheaper than staying right in the centre and you wont be disappointed", "helpfulness": 1, "user": "dan773", "date": "May 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 65747954}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Room - Clean. Bathroom has toilet and bidet. Shower is small. Didn't try the towel heater. TV is approximately 19\". There is a safe, refrigerator, armoire, free internet, SKY channels. Walls are paper thin - you can hear neighbors when they arrive, leave and if they speak loud. Not good for those who are light sleepers. Ok for those who can sleep regardless. Street the hotel is on is quiet though. Bed and pillows are comfortable - great rest after a day of walking.", "title": "Ideal base for sightseeing", "helpfulness": 1, "user": "davet42", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65716628}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "This was a good find..the price was right! There is nothing fancy about the hotel. It is small, but clean and a good base and in a good location for using the train to get around the city. The breakfast that is included is basic but sufficient. This was my first time traveling in Europe so I wasn't prepared for the lack of washcloths. If this is an issue for you, bring your own.", "title": "Good Inexpensive Hotel", "user": "MsGME", "date": "July 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71524521}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "For those first timers to Rome (like us), this was a good choice as a home base. We stayed 3 nights at the Re di Roma. The hotel was very clean, modern (contemporary design), and the service was always very helpful (I had a lost luggage with the airlines and the front desk made the calls for me to track the baggage and keep tabs on its arrival).", "title": "Perfect base to enjoy all that Rome has to offer", "helpfulness": 3, "user": "PaulGlobal16", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71443925}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The breakfast was solid, nice croissants, cappucino machine, cereals, cold cuts, fresh fruit, etc.", "title": "Best hotel I've stayed in . Perfect in every way. A real find.", "helpfulness": 1, "user": "Skybird66", "date": "July 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 70330956}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our room was spacious and the bed was big (two twins combined) and comfortable. We had a street side room on the 2nd floor, but the windows were well insulated and the curtains kept the light out of the room to the point where we slept in and didn't know what time it was. The walls contained noises for the most part, but we could hear people in the other rooms at times. Aside from that we always came back to a very clean room, and kudos to the housekeeper for organizing and packing all toiletries (my wife was impressed). The shower was smallish, but water pressure was great and really all that was needed.", "title": "Great Find, Would Stay Again", "user": "vlh528", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 70043157}, {"rating": 4.0, "title": "Stay here! You won't be disappointed", "text": "The location of the hotel was literally one block and a half from the Re di Roma Metro stop. You can ride the metro for 1 euro, if you are not familiar with the Rome Metro it is very easy to use. For a euro at the machine you get a metro card and that card is good for 75 minutes, so if you need to go from the orange line (A) to the blue line (B), it is not a problem. Or you can do a 1 day card (4 euros) or a 3 day card (11 euros). The metro basically takes you to the areas where all the top tourist attractions are (Colloseum, Vatican, Spagna steps & Trevi fountain, Piazza Nuvona) with some walking required.", "user": "Socalpam", "date": "July 6, 2010", "id": 69976442}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Location of hotel in a residential area, 100 meters from Metro station. Hotel very clean and modern, the staff very friendly and helpful. Rooms were cleaned everyday sometimes a little later than expected. Only a couple of stops from the main attractions on metro, (which was also good value at 11 euros for three days).", "title": "good value, location OK", "user": "silver28", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 69860958}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "the room is so clean which is the most important for us.very elegant with contemporary style.The beds are comfortable,the bathroom is sooo clean.staff are very helpful.they even help us find a very nice restaurant which is not expensive,and where the locals go!I really enjoyed the food.The hotel is also close to the malls and grocery,and to the train station.It is also about 20-30min-walk to the Coliseum.We walked back and forth which we didnt mind because we enjoyed walking.", "title": "great small hotel!", "user": "meganw2010", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68151237}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Recently stayed here for 4 nights on a trip to Rome with my boyfriend. Read the reviews on here first before booking and most of them can out to be true. Hotel was great condition and rooms were really nice. Actually bigger than I was expecting. The walls were a little thin however and we could here people coming and going outside our room as well as our neighbors talking next door. Since we weren't really in the room much, it wasn't a big deal to us. The free WiFi is nice and they have a bar near the lobby which also has internet access. Location was not the best as it is a metro ride away from all the sites. Luckily the metro was only a 5 minute walk. Overall, we were happy with the hotel choice and will probably return again. I highly recommend Pompii, a desert shop a block away from there. It is definitely a locals hang out and was swarming with people everynight. It has the BEST tiramisu I ever had as well as a ton of other sweet selections.", "title": "Cute hotel but alittle out of the way", "user": "Jennyz28", "date": "June 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 67087444}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed there for 5 nights in the beginning of May.", "title": "Great Hotel", "user": "odessa91", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 66758712}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "Clean with friendly staff. Night manager Julia is very helpful. Excellent location, just few minutes walk from Metro station Re Di Roma, and 5 minutes walk from local train station, to get there easy from airport ($7.50 Euro) or you can take shuttle bus for $15 Euro per person. Rooms are not big but modern, clean with refrigerator and mini bar. Free internet in room, with PC in lobby. Bar in lobby open late. Breakfast is good", "title": "Great stay", "user": "LumaBadran", "date": "June 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 66376006}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Location: Excellent. There is a metro stop a block away, you can take the metro to any attraction you need cheaply and easily (someone mentioned it is a bit of a walk, but how much closer can you get than 190m?!). Another reviewer commented that they felt the neighborhood was a little unsafe, I guess it depends on what you’re used to, but I found the neighborhood extremely safe and didn’t have any worries at all, and I’m a petite woman.", "title": "Great stay - highly recommend", "helpfulness": 1, "user": "nbologne", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74669041}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Room/amenities: Modern decor, satellite TV, spacious bathroom for European standards, clean, good breakfast", "title": "Will be back again!", "helpfulness": 1, "user": "Couple_from_Cypress", "date": "August 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 73933370}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Eating suggestions : cannot remember the names, but there is a gelato shop nearby that is open late that serves the best gelato I’ve had in all my travels, and there’s also place that sells pizza to go by weight (they’re both near the roundabout)", "title": "Nice rooms, clost to a metro station but street doesn't feel to safe", "user": "bhuchar", "date": "July 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 73175855}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "Overall: I would definitely stay here again, it much less expensive than the other hotels closer to the attractions (didn’t matter with the metro stop so close by), the rooms were great, and I found there were good eating options nearby since it’s in a more residential area and therefore doesn’t cater to tourists. Front desk staff was always very helpful with directions.", "title": "Great hotel, beautiful city, amazing holiday", "user": "mhobbsy", "date": "July 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 72759981}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Very nice and clean hotel. The staff are friendly. Although a bit far from the metro but wouldn't mind if you like walking. Breakfast was plentiful and very good and its included in the price!!! We will be back again to this hotel next time we come to Rome, Italy.", "title": "Nice staff at this very contemporary hotel", "user": "Paradisebound1", "date": "July 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71774648}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 4, "average": 40, "very good": 370, "terrible": 3, "excellent": 529}, "aka": "Re Di Roma Hotel", "slim_ranking": 0.0740157480315, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}