{"user_rating": 4.5, "review_count": 49, "name": "Hotel Thira and apartments", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed here for our summer vacation. We were only planning on staying in Fira for 3-4 nights, and we were planning on going to one of the towns by the beach for the rest of our vacation. We did not know what kind of hotels we wantet to stay at, so we only booked this for the first couple of nights. When we booked it, it said that it was only a 1-star hotel, so we felt we were taking a chance. But we figured it wouldn't matter, as long as it was clean.", "title": "Loved this hotel", "helpfulness": 1, "user": "Almsi", "date": "May 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 106955074}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Our flight landed in the middle of the night, at this point I had e-mailed with the son of the owner (I think), and had gotten av telephonenumber for the taxidriver to call, when we arrived. He talked to the owner, a tiny old lady, who got out of bed in the middle of the night, to let us check in.", "title": "Perfect", "helpfulness": 2, "user": "gianna2795", "date": "December 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 90992743}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "The rooms were a nice size, and it ws CLEAN. The balcony was also very nice. We didn't spend a lot of time at the hotel, but we fell in love with it. We rentet an ATV from the hotel owners son, Tony, downstairs. And used the ATV to get around the Island, to all the different beaches. When we got back in the evenings, the pool was perfect to cool down in. The pool area is a bit small, but if you're not a person that spends your whole vacation by the pool, its very nice. And very clean.", "title": "the hotel is excellent and the owners are very friendly.", "helpfulness": 1, "user": "marianaines", "date": "December 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 90218107}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The hotel is located very close to downtown fira, but away from all the fuzz. It's about a 5 minute walk to get to fira. We spent all our evenings here.", "title": "A good Fira hotel without caldera views", "helpfulness": 1, "user": "nessie27", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 83079890}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We enden up loving this hotel so much, that we booked it for the rest of our vacation (8 more days). Our last night on Santorini, they didn't have any rooms left, but they talked to the owner of a hotel right by, and we spent the last night there.", "title": "My own home in Santorini", "user": "Sardes", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73422931}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We stayed at Hotel Thira for 5 nights May 2010 and May is the beginning of the holiday season . The hotel is owned and run by a family. We were met at the airport by Antonis and welcomed by Maria on arrival. We had an apartment that was clean and comfortable with views over the island. Apartment was serviced daily. There is a pool at the hotel but it was not in use as the weather was still rather cool. The pool and surrounds looked nice though. Hotel Thira is well located just a few minutes walk from the centre of Fira in one direction (south) and then also a few minutes walk (north) to Firastefani and then about 500 metres further to Imerovigli, situated on the highest peak of the island. Antonis runs a car hire business right by the hotel and we hired a car from him at reasonable rates, for a day, and toured the island. My friends left before I did and were driven to the airport courtesy of the hotel. Then when I was due to leave Santorini my flight was cancelled due to the strikes in Athens and the family were so helpful in assisting me in getting a ferry to Athens. They even drove me to the port. Maybe the pick up/delivery to airport/port is not always available. You would need to check on this when booking. It was not peak season when we were there. From our experience we would have no hesitation in recommending Hotel Thira.", "title": "Recommend Hotel Thira comfortable, clean, good location, friendly owners.", "helpfulness": 1, "user": "VHEL", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 63841559}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "it is a family hotel, that is managed by the grandma (70 years old greek lady), she is nice but does not speak english. Her son has \"Tony rental car\" on the ground floor, and the main hotel receptionist is a 14 years old girl (Tony's daughter) that speaks poor english, and you have to deal with her in case of any question, restaurant recommendation, tips, payments, etc.", "title": "bad experience - horrible bathroom", "user": "MELROSE_BRAZIL", "date": "September 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 42582172}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Found this hotel a pleasant place to stay. It was spotlessly clean and even though I was on the ground floor in front of the pool, it was relatively quiet and quite private. It was walking distance to both Fira and Firostefani. There is a quiet backway to both areas which avoids the main busy road, which was pointed out by the owners at check- in. The pool area was a wonderful relief in the heat of the day and even though it doesn't have a great deal of space to relax, I did find that at times it was completely empty so was able to really enjoy it.", "title": "A comfortable and pleasant stay.", "user": "sia66", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117296183}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I would recommend this hotel but make sure to check if you have transfer/s included in your booking and check with the hotel that they will honour it.", "title": "2009 May. Best outside of the Caldera, Thira Santorini", "user": "CandcH", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116325617}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We loved this stay on Santorini. The room was compact but very comfortable and clean. The views were spectacular over the countryside to the sea and islands nearby. We hired a 'vespa' for two and we were much assisted by the family. They were most welcoming. We had warm greetings and lifts to all the ferry wharves. If we had asked the family would have collected us from the ferry after booking and disembarking but we hadn't thought to ask. However, the bus trip was very interesting from the wharf. It was just prior to the high season but brilliant. The pool was about to be filled for the hordes of travellers arriving for the Greek Island crazy summer season.", "title": "Very good stay", "helpfulness": 1, "user": "Tessadurian", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115757971}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Located at edge of Thira, short walk slightly uphill from town. Not far from Thira's shops. Breakfast was ok. Run by Tony, Antonio and family. Grandmother Maria Sr, daughther Maria Jr and family were oustanding in their hospitalty. The whole family very evidently look after their property with love and care. Tony runs the rental outfit downstairs- we rented a car from him and can recommend it. Bathroom is smallish but usable. Breakfast is greek style (basic), but served with love by Maria Sr.", "title": "good value for money, top view from the room, very clean!", "user": "Pier_and_Dolly", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 115365505}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Will stay here again if we ever get the chance to return!", "title": "Great location, building and service, really exemplary, thoroughly recommended!!", "helpfulness": 1, "user": "Steve L", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114852484}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Myself husband and 11 year old daughter stayed here for 5 nights 16th Aug - 21st Aug 2012. I had spoken to the hotel on email before we arrived and had found them very helpful , we decided on one of the apartments rather than the hotel as we wanted a little more space. We were collected from the port late evening and shown to our apartment , as it was dark we didn't get the full benefit until the next morning. We were on the ground floor and had a lovely yard area with seating and a sea view ( not caldera) the hotel owners were lovely and advised of the quickest route into Fira town and also information on nearby restaurants etc, we also hired a car from them for a few days at a good rate. The apartment was clean, simply decorated and equipped but we had everything we needed. It was more peaceful in the apartment , when we went up to the hotel to use the pool etc we did find the main road a little noisy. Lovely stay, charmings hosts.", "title": "Quiet ,charming apartment", "user": "spadge", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 138537605}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We loved our experience at Hotel Thira and Apartments. The hosts (Antonio and Antonia) were amazingly gracious and generous with their hospitality. My son turned 10 while we were on our holiday, and knowing this they made additional efforts to help us celebrate and make us feel welcome. We stayed in the adorable \"traditional home\" above the apartments (which is just across the street from the main hotel). We looked at the apartments themselves and can vouch that these are adorable as well. The sea views from the rooms were stunning, and the pool area and lovely rooftop patio at the hotel itself were both delightful. We were recovering from our long travel time from the US west coast, so we were in our room and/or making use of the hotel facilities more than we would be typical for us, and it was an absolutely lovely place to spend time and relax. We planned a two (maybe three) night stay, and stayed for five nights (and even then we were reluctant to leave)! We would definitely stay here again. The hosts are the kind of people you want to stay in touch with after your trip, as evidenced by the love notes and pictures posted in their office that have been sent to them from other happy guests. We did not just rent a room at Hotel Thira and apartments; we made new friends with our wonderful hosts and cannot wait until we are lucky enough to visit them again.", "title": "Amazing Home Away From Home. Beautiful. Clean. Hospitality Beyond Compare.", "helpfulness": 4, "user": "Dawn P", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133610526}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We did not stay in the hotel itself as it had not yet opened for the season. However we were able to spend a few days in one of the apartments run by the hotel which are a short walk away. Don't let this put you off. The apartment in which we stayed had two bedrooms, superb sea and island views (though not of the caldera itself), a kitchen, balcony and dining area and a sound system. It was a delight and it was servcied daily. Tony could not have been friendlier or more helpful, and his wife was just as helpful and friendly.", "title": "A home away from home", "helpfulness": 2, "user": "SAtraveller4", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131728288}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If you are looking for a base a few minutes walk from Fira then this is value for money and very pleasant indeed. Tony will point you in the direction of a superb local taverna a minute's walk away and rents out vespa's and quad bikes as well, which is very convenient.", "title": "A Home away from Home", "helpfulness": 4, "user": "westiemanor", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122629112}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "This was mid way through our holiday and we had know idea of the hotel or area. Maria sent a car to the airport and picked us up, and it was late as the plane was delayed so our driver had to wait for us, he was awesome, then when we arrive at the hotel Young Maria checked us in and showed us our room it was beautiful. She told us where we could get a good meal and it was a block up the street, a great restaurant with outstanding food and character, and not bad pricing. The next morning we woke to a beautiful day and discovered we had booked into one of the nicest places in Fira ( at least we think so ) and we were in the perfect place to walk into town and and stroll the streets of Fira and then come Home to the peace and quite of Hotel Thira and the Family that we call our own. You have everything here Pool, Car or Bike rental, food and most important great people looking after you.", "title": "Most relaxing week!", "user": "travelbugg1988", "date": "October 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119757297}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 1, "variance": {"poor": 3, "average": 1, "very good": 14, "terrible": 0, "excellent": 31}, "slim_ranking": 0.185328185328}