{"user_rating": 4.5, "review_count": 425, "name": "Hotel Reine Mathilde", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband and I loved our stay here. The hotel is charming. Lots of atmosphere. Room on the small side but very comfortable, imaculately clean, quiet, and the shower was fabulous. We ate many meals in the hotel and found them all excellent, service fast and friendly, and food delicious. We would definitely return if here again.", "title": "Very charming hotel", "user": "karen_phillip46", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65915661}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Visited Bayeux many times and every time I have stayed at this hotel. Great rooms and friendly staff and good food on top of all that. Plus its central location in Normandy makes it an ideal jumping off point for any number of day trips in the area. Could not recommend more.", "title": "Repeat visitor, looking forward to next stay", "user": "Jcollins2", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65426948}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We stayed two nights as a party of seven people (two grandmothers, three children ages 12, 9, and 6, my husband and me). The hotel staff were absolutely delightful, friendly, and helpful. The rooms were spotlessly clean. The food in the restaurant was delicious. We had no complaints of any kind - this hotel is perfect for all ages provided you can walk up a few stairs. We will stay here again without even considering any other hotels. Thank you for a wonderful visit to France and to Normandy!", "title": "Will stay here again without question or debate!", "user": "LPotter_10", "date": "May 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 65232409}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "My family of five stayed here for 2 nights as a base for DDay tour. We had rooms 16 & 17. They were both up 3 flights of narrow stairs and by themselves. They were attic dormers. One room had 1 double bed and the other had a double and single bed. Small adequate bathrooms with shower. The shower pressure in room 16 was poor but very good in room 17. The bathroom fixtures in Room 17 were updated. Breakfast was 7 or 8 euros per person and was nice cold buffet. Hotel has a restaurant but we did not have dinner there. We did have drinks and enjoyed people watching from their outdoor tables. Hotel is within walking distance to Bayeux Tapestry museum, downtown shopping and DDay battle bus tour pickup. Bayeux cathedral is just a block or two away also. Bayeux is a very nice town and I highly recommend basing your Normandy visit here. Parking was free on the street adjacent overnight until 9 am. There was a free car park a few blocks away. Wireless internet was free but very spotty in our rooms.", "title": "Quaint and unique in downtown Bayeux", "helpfulness": 1, "user": "empjm", "date": "May 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 65066118}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We did not stay at this hotel, but I want to compliment their restaurant because we ate there twice and thoroughly enjoyed both meals. The food was very tasty, there was good variety on the menu, and the service was pleasant and attentive. One of our meals was a lunch that we enjoyed outside on their patio -- what a great setting if the weather permits it!", "title": "Did Not Stay Here but Ate Here Twice and the Restaurant was Very Good", "user": "ATP1", "date": "May 23, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 65052888}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The only problem with this hotel is that there are no fans in the rooms, not even a cheap desk fan. We didn't encounter flies, but instead the kitchen exhaust fan, so the choice was be hot or smell of grease. I really can't understand why they don't provide fans given how warm the rooms are in summer. Also the wi-fi kept logging you out which was annoying.", "title": "I wanted to like it too!", "helpfulness": 1, "user": "bellmeister", "date": "July 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 70853583}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Loved Bayeux and Normandy in general, unfortunately found this hotel lacking in one fundamental aspect. Hey, I don't mind if a hotel doesn't have an elevator -- not afraid of a little exercise. There were 3 of us, so we had a \"triple\" room, of which there may be only one or two at this hotel, apparently. Anyway, top of the stairs for us, no problem, but it was really warm while we were there (23-25 degrees Celsius) and this hotel has no air conditioning. Given that (as we learn in Meteorology) hot air rises, and our room was on the top floor, it was downright hot in there. Again no problem, just open a window.......except that admits swarms of flies. So, your choices are a) sweltering hot room with no flies or b) relatively comfortable temperature in room, with plentiful flies. As flies go these were not particularly offensive, they did not seem to bite or crawl all over you, just hang around in varying numbers and be annoying. All it would take is 1) a screen for the window and 2) a fan, and this would be a comfortable room without winged fauna even on a hot day. Other than that, everything was fine. I suspect rooms one or two floors lower do not have similar temperature issues. As other reviewers have stated, the staff is friendly, adjoining restaurant is good, and the location is fantastic. We walked from the train station with luggage, it isn't very far. Had no problem with internet access. One heads up item, if you leave on the early morning train to Caen/Paris as we did, consider obtaining your tickets the day before. For no apparent reason the train station wasn't open when we arrived at 0615 (the sign said it should be open at that time), and we never were able to print our tickets. Boarded anyway and showed my receipt to the conductor who, I got the impression, had maybe seen this happen a time or two. Do try the Calvados when in Normandy -- if you are in any kind of pain, it won't last long.", "title": "Really wanted to like this hotel...", "user": "L_Sutton", "date": "July 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 69501748}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "This hotel's location was just fine, and it's adjoining restaurant was great. Price was OK, too -- and in line with the rest of Bayeux, I think.", "title": "Wi-fi troubles", "helpfulness": 1, "user": "NorthPotomac", "date": "June 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 68221893}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "But the hotel advertises free wi-fi, and they were \"out of passwords\" for my stay. Since there is no internet cafe in Bayeux, and since the only pub with free wi-fi was closed on a Sunday, I was out of luck when I really needed to communicate with my family at home. This is enough for me to reduce the hotel from 4 stars (which it would otherwise have obtained) to three. I might add that I speak perfect French, so there was no miscommunication here -- the manager was rather nonchalant about there not being internet until the next day (after my checkout time). I'll still recommend the hotel, but I'm not as enthusiastic as I otherwise might be.", "title": "Wonderful heart of Normandy stay", "user": "FrugalRedhead", "date": "June 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67283244}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The Hotel Mathilde was the perfect location for a stay in the heart of the old", "title": "Charming Hotel with good restaurant.", "helpfulness": 1, "user": "esp2068", "date": "June 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 67084109}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We stayed at this hotel for two nights. Location was perfect, literally 2 mins walk to the high street, tourist office etc. Rooms were a little on the small side but were more than adaquate for our needs. Breakfast was really good ( Buffet style ) all for 7 euros. Staff really helpfull.", "title": "Perfect little Hotel in a Perfect Location", "user": "tontotaylor", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62510040}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "One very small negative point -- No tea of coffee making facalities in the room. Seems to be the norm with France.", "title": "Loved this little Hotel", "user": "PastorAl S", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 57488324}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We were in Bayeux for a Battlebus tour and this hotel was one they recommended. It was great. The rooms are nice. The location is right near the Bayeux Tapestry. The breakfast was very good for the price. Spotlessly clean. The young man who runs the hotel spoke great English and was an absloute delight to deal with.", "title": "Ideal", "user": "winnerkev", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50484125}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Best of all, the price was lower than any other place we stayed on our trip (London, Normandy, Paris, Berlin). It's not fancy and does have some stairs.", "title": "Charming", "helpfulness": 1, "user": "mark_SydNSW", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48153279}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I do plan to go back to Normandy some day (too much to see in just one day) and I will certainly stay here.", "title": "Outstanding Hotel Experience", "user": "jharris003", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47435770}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "This is a small hotel with simple rooms that are very reasonably priced. The staff is incredibly hard working and pleasant. The breakfast buffet in the morning features boiled eggs, yogurt, cheese, croissants, French bread, fruit, juice, coffee, cereals, and hot chocolate for 7 euros. We enjoyed our stay here and would return. The staff all speaks excellent English and didn't mind our terrible attempts at French. We walked here from the train station (15 minutes) but a cab might be better for some. You can share a cab with up to 7 other people for the same rate as one person. This hotel is right next to the Hotel Churchill if you are looking to share a ride with others.", "title": "A great little hotel", "helpfulness": 1, "user": "joyann2", "date": "May 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 64927472}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "When booking our staying at Bayeux, our first choice of hotel had not rooms available and we got the indication of the Reine Mathilde. We were very anxious to check this hotel as all we knew were from the internet. Since the beginning when asking for information bay e-mail they were very kind and helpful. When we arrived the hotel on May 26th, 2009, we were very happy to be received by such some nice people. We checked in, climbed the stairs with our suitcases and got down for a lunch. Very nice meal! It is located across the street from the Post Office and the city Cathedral. The room was so cozy. Too bad we only stayed 02 nights. For sure the next time we visit Normandy, the Reine Mathilde Hotel will be our choice. We do recommend.", "title": "A great surprise.", "helpfulness": 1, "user": "Andyfg", "date": "May 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64818150}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "The location of this hotel could not have been better. Almost literally in the shadow of the cathedral and at the foot of the busy main street with dozens of little restaurants. I enjoyed lunch on the spacious, bright patio of the attached restaurant. The staff was very helpful although somewhat limited English for those travelers who do not have some basic French in their vocabularies. The room was small and basic, but fine for what I needed. Would have liked a hairdryer in the room, but no big deal. Also, if you're taking the Churchill Hotel shuttle to Mont Saint Michele, the hotels essentially share a parking lot, so it's about a 45 second walk.", "title": "Great location, experience", "user": "TavelingGirl_40", "date": "May 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63682137}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The hotel is also a fairly easy walk from the train station if you have a small rolling suitcase or backpack. About 10 minutes.", "title": "Unpretentious and friendly staff", "helpfulness": 1, "user": "PBMAthlone", "date": "May 1, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 62970805}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Also -- the Churchill shuttle was great for getting to Mont Saint Michele, though I would've liked another 30-60 minutes at the site.", "title": "Hotel Reine Mathilde is a good value and centrally located.", "user": "WFfan", "date": "April 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62734156}], "location": {"country": "France", "region": "Normandy", "continent": "Europe"}, "variance": {"poor": 6, "average": 36, "very good": 153, "terrible": 4, "excellent": 226}, "slim_ranking": 0.136363636364, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}