{"user_rating": 4.5, "review_count": 751, "name": "Hotel Villa Schuler", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This is simply a perfect hotel! The location, the rooms, the private sun terraces, the service, the amazing breakfast. My husband and I have just returned from spending one week at this hotel and there is nothing that I can fault. We found the hotel through the Taormina tourist board web site and it was luckiest find for us. Thank you also to all the wonderful staff at the hotel who were always so helpful and charming. We will be returning!", "title": "A perfect week at the Hotel Schuler in 'Taormina'", "helpfulness": 3, "user": "TinaBrighton", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14318851, "likes": {"liked": "— Our room with private sun terrace overlooking the ionian sea and mount etna!", "disliked": "— Nothing!"}}, {"rating": 4.0, "title": "Breakfast with Mt. Etna", "text": "The location of Villa Schuler is privileged. You have a fantastic view of both the coast and the Mt. Etna as I guess few hotels in Taormina. When we stayed the weather was great so we had breakfast everyday at the terrace where you have the Mt. Etna just in front of you! The breakfast is very good with options of bread, cheese, juices and seasonal fruits.", "helpfulness": 2, "user": "Viaje_Sempre", "date": "March 8, 2008", "id": 14145331}, {"rating": 5.0, "title": "Best Value in Taormina", "text": "The first two nights we stayed in a superior room with the same fantastic view and it is significant better than the standard one. Not only it's bigger but you have bath with jacuzzi.", "helpfulness": 6, "user": "scubas952", "date": "January 23, 2008", "id": 12925515}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The garden view room was quieter but smaller and darker.", "title": "Great Value", "helpfulness": 9, "user": "unlcemonty", "date": "November 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11095545, "likes": {"liked": "— views", "disliked": "— rooms slightly small"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The staff is very friendly and the owner quite helpful in giving tips of local attractions.", "title": "The best place to stay in Taormina", "helpfulness": 12, "user": "Rob1965", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10912889, "likes": {"liked": "— views", "disliked": "— Scrambled egg!"}}, {"rating": 4.0, "title": "Nice place", "text": "We were very happy with the choice of this hotel. We had no problems at all. Taormina is a very nice place and the views over the sea and mount Etna was fantastic. There is just one little thing I would like to mention, that is the breakfast staff were a bit cold and could have smiled a bit more.", "user": "LuxuryAdelaide", "date": "October 28, 2007", "id": 10389972}, {"rating": 5.0, "title": "Loved this place", "text": "Thanks for a nice stay.", "user": "Eliza1967", "date": "October 27, 2007", "id": 10378389}, {"rating": 5.0, "title": "A Truly Lovely Place", "text": "Loved this place – hotel very clean – upscale service. Breakfast on veranda was excellent with a view to die for. Location perfect for accessing main town and restaurants. For those who want to see Taormina – this is the place.", "user": "Annie060", "date": "October 24, 2007", "id": 10288973}, {"rating": 5.0, "title": "Fantastic location!!", "text": "We stayed in Taormina, Sicily, for several days in October at the end of an extended Sicily sojourn--we needed some time to totally relax and unwind. Taormina (out of season--very important) was the perfect place for us to do that, and the Hotel Villa Schuler was ideal for our purposes. We don't particularly like large, opulent hotels. Instead, we prefer smaller, boutique-type hotels that have local color and charm. The Hotel Villa Schuler was exactly the type of place we enjoy. It's small (21 rooms), impeccably clean and attractive, with fabulous views of both the Ionian Sea and Mount Etna. Our room was spacious, with many thoughtful extra touches, such as jacuzzi jets in the bathtub. There is a lovely garden as part of the hotel, which even has labels on all the exotic plants. The staff is superb. And the walk, via some steps and walkways, up to the main street of Taormina, was quick and easy. (This is important in Taormina, because it is a hill town, and many approaches to the center of town are very strenuous.) The guide books list the Hotel Villa Schuler in the \"moderate\" category. We had a room with a small balcony and a glorious sea view--definitely worth the extra money, we thought. The room was approximately $250 per night, not \"moderate\" by all standards, but considering the tourist popularity of Taormina, relatively reasonable. One can't go wrong at the Villa Schuler. Ann L. Tolstoy", "user": "operalover59", "date": "October 15, 2007", "id": 10082500}, {"rating": 2.0, "title": "Not Good", "text": "Spent 3 nights in a room with a lovely balcony overlooking the sea. The room was not huge, but it didn't feel cramped and had all we needed--not lavish furnishings, but we certainly didn't spend a lot of time there, and the view from our private balcony was fabulous. And what a great location, just a couple of minutes from the main street in town, with gorgeous gardens. The terrace where breakfast is served was a wonderful way to start the day, and the breakfast was the best we had on our entire trip. A recent poster complained that the gals at breakfast never smiled--well, the one we saw on several days was quite busy, but very pleasant to us and willing to listen patiently to my ordering in Italian, even though her English was undoubtedly better than my Italian! We found the staff very helpful with our questions, and they provided a great restaurant recommendation--suggesting that the one they mentioned was similar to the one I asked about, but more moderately priced. And I am so glad we reserved a space in the garage!! I would not have wanted to count on finding a public space. The garage was immaculate, as we saw when we accompanied a staffer to our car when we left, and he pulled it onto the street for us. We'd be happy to stay here again. We found the directions on the website very specific and helpful. All in all, considering how expensive Taormina is, we thought this a real value, and would happily recommend it.", "user": "snappy6592", "date": "October 5, 2007", "id": 10043283}, {"rating": 5.0, "title": "Worth staying just for the breakfasts !", "text": "We have just stayed at the Villa Schuler following very positive reviews from fellow TA correspondents. Hotel is in a brilliant cliff situation with views of the coast and of Mount Etna that match the anticipation of the traveller. Our superior sea view room was lovely as was the bathroom, only fault we could find was that we could not work the safe but that was a minor detail.", "user": "AndrewCov", "date": "November 11, 2007", "id": 10743818}, {"rating": 4.0, "title": "Spotless but more geared to Germans", "text": "Staff were uniformly helpful, particularly re the fact that the Via Roma was blocked due to road works and thus our arrival was delayed. We cannot understand why some correspondents were critical of the staff or of their language skills. they all speak excellent german, english and italian.", "user": "LimerickThistle", "date": "November 2, 2007", "id": 10533980}, {"rating": 4.0, "title": "very nice hotel", "text": "The real highlight is the breakfast - absolutely splendid and easily the finest we have enjoyed in Italy in many visits. It's glorious to sit on the outside terrace and have your specific breakfast brought to you in such fine style. Coffee, melons, breads, hams and salamis, eggs and fruits were terrific.", "user": "Tricia123", "date": "October 30, 2007", "id": 10456196}, {"rating": 5.0, "title": "Delightful stay with eruptions....", "text": "Another positive with this hotel is the garden which is very varied and interesting and just a stone's throw from the centre of the town. We utilised the hotel garage which worked well and is worth paying as parking in Taormina is nothing short of impossible.", "user": "3mmiler", "date": "October 29, 2007", "id": 10429498}, {"rating": 5.0, "title": "Mountainside jewel", "text": "One strange aspect of the hotel is their insistence on payment by cash or travellers cheque rather than credit/debit card.", "user": "kepuhikid", "date": "October 28, 2007", "id": 10400643}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We stayed at the Villa Schuler a couple of times over Easter. Both were spur ot the moment type things - I rang round a couple of other hotels but both times the people at the Villa Schuler got us a good price last minute, plus a 10% discount if you pay in cash. The first time I stayed there we were in room number 5 (I think!) which is worth requesting as it has two small balconies, one with a view of Etna, and the other over the sea. I think we paid about 150 Euros for the room for that night, and it was very good value. The rooms aren't luxurious, but very clean and with a flat screen TV, comfortable beds and plenty of storage. The bathroom seemed to be all new and immaculate. From our window in the other room (number 14) we had a view over the beautiful garden at the back of the hotel. Walk through the garden and you are in the middle of Taormina. The kids loved the turtles in the pond and the lemons on the trees. Breakfast was served on the terrace overlooking the sea and Etna - service was friendly and efficient and the food was great. If you don't miss room service, concierge or a stocked mini bar, the Villa Schuler offers everything else you need to make the most of Taormina.", "title": "Excellent hotel", "helpfulness": 2, "user": "RLJUk", "date": "May 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 15676948, "likes": {"liked": "— location, views from rooms, breakfast on the balcony, unpretentious efficient service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed in Villa Schuler for 4 nights in April 2008 and were, overall, very impressed. The hotel was spotless, and everything seemed to work perfectly. Our room wasn't overly big but an adequate size. Furnishings were rather sparse but perfectly nice and everything we needed was there. The bathroom seemed brand new and everything worked perfectly. The balcony was really small, room for two chairs and a stool serving as a table, but enough space for two people to sit.", "title": "Very happy with Villa Schuler", "helpfulness": 4, "user": "Mildred1", "date": "April 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15442685, "likes": {"liked": "— Clean, great location and views", "disliked": "— Wireless access EUR 5/30 min is a rip off"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The staff spoke very good English, including the drivers that transported us to and from the airport. They were very friendly and helpful. It is true that there is a certain German influence, such as the rye bread served at breakfast and quite a few German guests, but then again there are quite a few Germans in Taormina in general.", "title": "Oasis in Taormina", "helpfulness": 3, "user": "pauljudy", "date": "April 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15386499}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The gardens and terrace were truely lovely and we spent a lot of time reading at the terrace overlooking the sea. Breakfast was served at the terrace and it was very good. However, I must say that service although friendly was very slow and it took forever to order and get the food. I know you are meant to relax and take it easy on holiday, but I'd rather do it on a full stomach...", "title": "Why stay anywhere else", "helpfulness": 4, "user": "nicolo53", "date": "April 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14944466, "likes": {"liked": "— location", "disliked": "— no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "All in all we found it very enjoyable and it seemed good value.", "title": "this is true excellence", "helpfulness": 3, "user": "oldi48", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14733483, "likes": {"liked": "— the comfort and the personal attentionj", "disliked": "— absence of lounge"}}], "location": {"country": "Italy", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 11, "average": 17, "very good": 143, "terrible": 3, "excellent": 577}, "aka": "Schuler Hotel Taormina", "slim_ranking": 0.0697674418605, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Boutique Hotel di charme in una antica dimora del centro storico, immersa in un curatissimo parco con stupenda vista mare ed Etna. Giardini e terrazze, saloni, ascensore panoramico, giardino d’inverno, rooftop lounge&terrace, Wi-Fi gratis e navetta per le spiagge. Servizio 24 ore. Parcheggio e garage: una rarità per il centro storico di Taormina. 21 camere e 6 Junior Suites."}