{"user_rating": 3.5, "review_count": 782, "name": "Hotel Globales Costa Tropical", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "we have just arrived back from a weeks all inclusive an staying there.d i must say we had a great time. good food, good weather,lovely staff, we met some lovely people. its only 5 mins from airport in a taxi.the only bad thing for us was we couldnt stay longer ,and yes we are going back.", "title": "summer holidays", "helpfulness": 3, "user": "83minnie", "date": "December 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 147666477}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Just returned from a week (7th to 14th Dec) at this hotel with my family. We had a lovely time, the hotel was only about 20% occupied but that was good as it meant that there were never any queues for food/drink and there was always lots of sunbeds. (Although it is fully booked for xmas) We found the staff to be very friendly and hard working. The food was good, we have stayed in 3 star hotels before and this was so much better.lots of variety and very tasty.there is a microwave if you find the food isn't as hot as you would like but it is to be expected seeing as it is a buffet.the rooms were a little dated but spotless/very clean. There wasn't much in terms of entertainment but with having two small children that didn't bother us much. We found other guests on the holiday to be very friendly. The weather was really good too. Was strange sitting out in glorious sunshine knowing that Christmas Day was only a matter of days away!if you are looking for very reasonably priced and relaxing week in the sun then I really don't think you would be disappointed with what this has to offer", "title": "Excellent value for money", "helpfulness": 4, "user": "TheSmiths104", "date": "December 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 147567716}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "stayed 1st to 8th dec staff very good and helpful hotel and rooms very clean food ok if it was hot it would be very good you would have to be really fussy not to find something to eat.a point that some people might helpful the room safe is 35 euros which you get 10 euros back when you leave.pool and area around pool very clean and well kept lots of sunbeds enough for everyone i cant think of a bad thing to say about this hotel if the food was hot i would give this hotel 10out 10 in my eyes", "title": "spot on hotel", "helpfulness": 3, "user": "mickyd445", "date": "December 15, 2012", "detail_rating": {"value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147480123}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "have just returned from a 2 week cosmos/monarch holiday which we thoroughly enjoyed", "title": "shorten the winter", "helpfulness": 3, "user": "tripperWales", "date": "December 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 146563721}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Cons- food not hot {there was a microwave however}- nasty little plastic cups for all drinks", "title": "Costa tropical", "helpfulness": 2, "user": "2Malcolm", "date": "November 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 146322869}, {"rating": 3.0, "stay_parameters": "Stayed January 2013", "text": "Accommodation clean but tired, staff friendly and hard working but not enough of them, so you need to clean old dishes and reset tables yourself before dining. Towel brigade are our early and seem to have started a new trend, using sunbeds as wind shields, so on average each couple use 5 sunbeds. This is unsightly and unfair on others as a family of four we never found a full compliment of beds. Management turn a blind eye to this. Weather is superb and we are having fun. Food edible, we eat out at home regularly in restaurants and would rate the food here as cafe style and varied. This is not the kind of holiday for someone who appreciates finer things in life, we came away to relax, walk and enjoy the sun. Our needs were met good value for money.", "title": "Priced appropriately", "user": "H0lidaymakers", "date": "January 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 148889244}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "just come home today 4th jan 2013 had really good time hotel bit dated but clean, staff nice, but my god ive never tasted food so rank in my life it needs addressing or they going to be slated for it i never write reviews but this i feel is a must we went all inclusive but had no choice but to eat out everyday 4 adults n 2 teenagers carnt all be wrong the whole hotel was complaining about the standard of food, however we never complained to the staff as they did a good job all round just really understaffed for amount of guests", "title": "hotel and staff loverly food disgusting and cold", "helpfulness": 1, "user": "debnjo", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 148833700}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My wife and I booked this holiday before checking on any reviews on Tripadvisor which were all quite positive.", "title": "A Nice Break", "helpfulness": 1, "user": "Para888", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 148826434}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We went for a quick week hopefully of plenty of sun at the end of Nov 12.", "title": "Great Xmas Break", "helpfulness": 1, "user": "Sarah J", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 148506313}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "when we arrived the Receptionist was very helpful and courteous, our room was clean and well laid out for a aparthotel.", "title": "It does exactly what it says on the tin.", "helpfulness": 1, "user": "Napoleon_08", "date": "December 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 148434851}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Stayed AI for 3 nights, 2 adults, 14 year old and 3 year old.", "title": "Cheap and clean...", "user": "clairey20", "date": "January 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 149056347}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We didn't care that the hotel was in the middle of nowhere as just wanted a few days of sunshine (which we got!), but I would not recommend this hotel if you are planning on a longer stay.", "title": "very quiet", "user": "nicolajones1975", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 148999505}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "Staff are very pleasant, polite and do all they can to help which is great. Room was spacious enough and clean enough (I am very fussy when it comes to cleanliness). The put up bed provided for the adults was horrific - broken so we had to put the very thin bits of foam on the floor to save our backs. Not a massive problem as only for 3 nights but wouldn't have been impressed if we'd stayed longer.", "title": "Clean,no entertainment whatsoever and food was poor and cold,our two girls ate hardly anything for the 10 days we were there.", "helpfulness": 2, "user": "daz5800", "date": "January 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 148959452}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "Food was mediocre, any longer and we would have been fed up. Good salad selection and fruit available though. They are only catering for what they think Brits want...chips and no fresh veg!!", "title": "excellent value for the price paid so more than happy.", "user": "gerty35", "date": "January 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 148915719}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Pool was subzero but I suppose there's very little point in heating it for a few months in the winter. We didn't experience the entertainment as it probably wasn't our thing anyway!", "title": "fantastic holiday", "user": "michelle m", "date": "January 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148902089}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "just returned home after a two week A I stay, good size rooms and very clean,pool area lovely, food ok, but sometimes cold,although there is a microwave.calleta de fuste is a good 30min walk along the sea front, but there is a free bus, public bus or taxi £ 3.50 euroes,didnt like the plastic glases ok for around the pool, but not inside the hotel, the most dissapointing thing for us , no decent entertaintment in the hotel , and what entainment there was didnt start until late around 10 pm.there needs to be some good shows, at least 3/4 times a week. sharon & chris crewe.", "title": "nice hotel, pool, very freindly staff, no decent entainment", "helpfulness": 2, "user": "sharon k", "date": "December 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 148317857}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We had an excellent weeks stay at the beginning of December. The food was excellent - such a wide choice, it was great for everyone! There was five of us, ranging from 12 to 49 and we all loved it. The staff were SO friendly and helpful and the rooms and hotel were spotless! The activities laid on each day by the entertainment people were great and kept our 12 and 16 year old amused and busy. There were always plenty of sun loungers and the rest of the guests were generally very nice. Excellent position, just 5 mins taxi ride from the airport. Would definitely recommend this hotel and hopefully will be going back one day. Loved it! Thank you to all the hardworking staff, you made our holiday! Love to everyone we met from Sharp-shooting Connie and co.", "title": "Excellent, relaxing and very friendly!", "helpfulness": 2, "user": "NetCumbria", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148191017}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Just back from a weeks all inclusive break here (19th - 26th December), was a bit aprehensive after reading past reviews but we could not fault the place. Staff were extremely friendly and helpful. There was always something on the menu that we could eat and plenty of it. I think some peoples problem is that they pay little for a holiday but expect it to be ala carte. If you want fillet steaks et al, pay a lot more for your holiday and don't rubbish this extremely great place for others on a budget.", "title": "Excellent winter break", "helpfulness": 8, "user": "Ray C", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148148382}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "Just got back from a two week stay !! Just to clarify a few things hotel good , food good , staff lovely !! Entertainment never happened at all !!! It was a total shame as this was the only thing that let holiday down !! Also we cannot blame the only entertainment lad has he was on his own !! Our advice to management is to put more shows on , without bird shows so 70 s !! Also to get more staff to entertain !! That would be a big plus for visitors !! Noel and Liz Birmingham", "title": "Great hotel good food terrible entertainmentGood staff", "helpfulness": 1, "user": "Hulkgoro", "date": "December 27, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 148147323}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed from the 5th-12th Dec and we couldn't of asked for more. The staff are all so helpful, very hardworking and friendly. The food was brilliant, plenty of choice and delicious. The rooms are spacious and cleaned to a great standard, also the outdoor area and pool were cleaned almost everyday. Its about 5 minutes from the airport less than 10€ in a taxi and is a nice quiet location but only about 30 minute walk along the beautiful coast to Caleta de Fuste, where there are plenty of shops and bars, also chipmunks to feed on route. We went on the Oasis park trip which was wonderful, a full day and only 23€ each. We also went Horse riding, which for any horse lover, it was fantastic. Altogether we had a wonderful, relaxing holiday and will definitely go back there again.", "title": "Fantastic!!", "helpfulness": 3, "user": "Hayley9484", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147750351}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 2, "variance": {"poor": 81, "average": 214, "very good": 299, "terrible": 71, "excellent": 117}, "aka": "Apartamentos Globales Costa Tropical Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 3.0}, "description": "The Costa Tropical Apts, with its views of the coast, has 90 apartments all with pool view and 53 bungalows with a small garden area, balcony or terrace, living room, separate bedroom, fully equipped kitchen, and bathroom. The apartments surround a large swimming pool which is 65 metres long and a separate children’s pool. There is also a large roof terrace for sunbathing. The apartments are the perfect place where you can relax and enjoy all the facilities. The Costa Tropical Apts offers clients the opportunity to prepare meals in their apartment or enjoy the all inclusive buffet with cold and warm buffet meals."}