{"user_rating": 4.0, "review_count": 142, "name": "Hotel Cordelia", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "It is a reasonably priced hotel, with very cosy rooms and in a perfectly central location. The breakfast is overpriced for what it offers (16 euro/ person) and I find no reason one should choose to pay for it.", "title": "Very cosy little hotel", "user": "irz", "date": "December 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121310777}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Will definitely stay there again in the future.", "title": "A practical and confortable hotel near the department stores", "helpfulness": 1, "user": "Niuhiti", "date": "November 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121071421}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Good three stars hotel. 300 m roughly from the Printemps. Plentiful restaurants around. Metro very close. Rooms are spacious for Paris Standards. Free wifi but should be continous as asking the tickets for the access code was annoying each time", "title": "Just a cute little Hotel!", "helpfulness": 3, "user": "PLJensen", "date": "September 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118797425}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Loved it! Stayed for 3 nights. Perfect location, it was easy to get around on foot to everything and even the Metro and easy to find your way back. The rooms are small and quaint, very clean and so cute! The staff was helpful and the breakfast was pretty nice, included some little pancakes, assorted breads and croissants, jams, meats, cheeses and lots of coffee and tea. The rates are good from 98 - 135 euros a night. There is a busy little Brasserie across the street which we ate at a few times, very good. I will stay there again when I go back to Paris!", "title": "Not a bad hotel", "user": "KoshKoshka", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 118376742}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed in this hotel for 1 night and got a special rate on the hotel website - 103 euros per day including breakfast for 2 people. This is a good price for what you get. The room was fine, clean and with comfy bed, good shower. The hotel location is good for exploring Paris during the day as it is only 10 mins from Place de la Concorde, but in the evening it seems dead as all the expensive shops (which are everywhere in that area) are closed and we did not find many restaurants as in Marais for example (maybe we just went all the wrong ways, of course, I do not know). There are no food shops either if you need them. So this is a good choice for day exploring, but not for going out in the evening. Btw, if you buy a breakfast at the hotel it is 16 euros per person which is way overpriced. And it is a bit loud outside in the morning.", "title": "Delighted with the Cordelia", "user": "Smudgeroonie", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115750336}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "A good hotel, well located, clean, at a reasonable price. Next to the great Magazines, metro station and good restaurants.The atmosphere and decor of the lobby are very nice.", "title": "A nice place", "helpfulness": 1, "user": "soniaparlatore", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 114660087}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "A few negative things to report: the size of the elevator and the lack of attention from one of the attendants of the front desk. The price of breakfast is also overestimated.", "title": "Excellent hotel", "helpfulness": 1, "user": "ayvdm", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113170593}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband & I stayed at this hotel. It is a very good location in Paris, near the metro, near the starting point of the Hop-on Hop-off bus, near Printemps and Lafayette Galleries (shopping). The hotel is beautiful with fantastic staff especially the reception staff. Nothing is to much trouble for them. We will definitely stay there again. There is also a restaurant across the road from the hotel and a cafe for small purchases down the road.", "title": "I was totally disappointed", "helpfulness": 1, "user": "amerha", "date": "March 27, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 101750960}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The room was small, but it is probably typical for Paris. Across from the hotel there are two theaters, and the noise was unbearable at night. What disappoints me most is the fact that I was fooled. In fact, when I was checking out they told me that I used the mini bar and we were charged 35 euros extra. The fact is that we have not used the mini bar because inside was spoiled cheese and smell was unbearable.", "title": "Nice little parisian hotel among the bustling city!", "helpfulness": 1, "user": "Arielarafe", "date": "February 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 95397399}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I came here in July for business and vacation since I always love Paris (not particularly Parisian but Paris itself!) since it's like a living museum. Upon arriving into the hotel early in the morning, they were able to check me in which I was utterly surprised. The last 3 times I was in Paris in the morning at the hotels, the receptionist just told me to come back later without even checking if there is an available room to get in to. The main receptionist attitude is pretty cold when inquiring about the computer and the area and took me about 1 week for her to warm up to me and I just kept thinking my friend who spent a year in Paris told me the Parisians are just born with attitude and they just can't help it.", "title": "Great location but a few negative points", "helpfulness": 1, "user": "sibeal", "date": "August 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 74721920}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My partner booked a deluxe king size room at this hotel when our preferred one in the next street was full. The location is great, just steps from the Grands Magasins and the Madeleine. It's also close to Place Vendome for those with the wherewithal or just for window shopping! The room was on the corner at the front of the hotel with windows on 3 sides (it was an odd shape!) which made it very noisy in the morning with honking horns and a lot of traffic. The bed may have been king size but, in common with most Paris rooms, the room was not. Everything was pretty clean, but alas, no hospitality tray and only one glass in a room booked for two. We decided against breakfast at 15€ a head and had something in a cafe instead.", "title": "Great location", "helpfulness": 2, "user": "glasgowlass52", "date": "November 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 22134443, "likes": {"liked": "— The grest location.", "disliked": "— The noise in the morning - no danger of a lie-in here!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "There were no do not disturb signs and a member of staff entered our room whilst we were in. Not something I was that happy about - if they knocked it must have been extremely quietly.", "title": "Would stay again", "helpfulness": 2, "user": "mictara", "date": "April 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14959181, "likes": {"liked": "— The cleanliness of the hotel.", "disliked": "— Breakfast room a bit on the small side - not a big problem though"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Booked this hotel in view of its central location - 5-10 minutes walk from the Opera and the RoissyBus stop for CDG airport. The hotel was clean and comfortable. Ths staff were all very pleasant and courteous. The room was actually fairly spacious compared to many city hotel rooms and the ensuite was clean and modern. The breakfast was a simple buffet breakfast and was more than satisfactory. The breakfast room in the basement floor was small but we had no problem finding a table, although I suspect this could at times be a problem if too many guests turned up at once. Breakfast time however was spread over three and a half hours which is longer than many other hotels and allowed more guest flexibility. The hotel was in a quiet street and we felt perfectly safe returning to our hotel after dark. All in all we were glad we chose the Cordelia and we would definitely stay here again if visiting Paris in future.", "title": "Great location", "helpfulness": 2, "user": "glasgowlass52", "date": "January 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12374544, "likes": {"liked": "— The grest location.", "disliked": "— The noise in the morning - no danger of a lie-in here!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Cordelia was a nice hotel. Small but nicely decorated. My room wasn't so big but it was big enough. Bed was very comfortable. It was very clean. Breakfast was great. It was quite a good choice of food.", "title": "Great Location, Clean, Very friendly staff", "helpfulness": 2, "user": "davnz", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8505142, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "There was really nothing that could impress me so much, but I didn't want to be impressed by a hotel. The location was wonderful. Close to the Opera, shopping zone and Champes Eliseyes, Louvre and Concorde.", "title": "Nice central hotel", "helpfulness": 2, "user": "Nathalie D", "date": "August 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8380913}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Stay here if you want to but I recommend the Hotel Bedford. Very small everything, rooms, elevator, choice at bfast. . .front desk was inconsistent. some were great and other were just annoyed. :( One quoted me a room price to stay and xtra night and when I went to check out-- she charged me more and had the nerve to catch an attitude about it. $165 Euro before tax -- so NOT worth it!", "title": "Super Tiny Rooms. Terrible bfast-- overpriced (15 euro). Horrible Internet--wireless not reliable at all!!", "user": "Yalie97", "date": "July 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 69573881}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I won't ever stay there again, that's for sure.", "title": "Perfect little find in the heart of Paris", "user": "Beverly56_8", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68413634}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed in this hotel for the umpteenth time in May this year and it was, as always, wonderful. The Cordelia is a small hotel which has been refurbished over recent years, but it has always been our little gem. The rooms are nicely decorated, the bed is very large and comfortable and the bathroom is clean, small but perfectly adequate. We occasionally eat breakfast in the small room downstairs, but generally eat in local cafes which are cheaper. The staff at the Cordelia have always been helpful and pleasant and speak several languages, including English, fluently. The Cordelia is situated within walking distance of all the main attractions, including the famous departmental stores and therefore perfect for a walking holiday in Paris.", "title": "Nice...but very modest.", "user": "kdubya1976", "date": "June 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 66051487}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Great location in the 8th arrondisement! Could not have been better for quick Metro access or walking - especially for shopping around Madeline. However, the room was not just small, but terribly small. My husband made me forgo packing the shampoo because \"all hotels have shampoo...right\"? This one did not. Easily fixed. People at the front desk were lovely and very helpful. Really, my only compliant is just about the room and how very small and modestly appointed it was. I thought that the rooms were more the equivalent of an older Motel 6 in America where the doors open to the outside - maybe a Comfort Inn. Also, just know that the garbage truck comes by on this street every day at about 7am.", "title": "Quaint, comfortable, great location!", "helpfulness": 1, "user": "dodge4x4rules", "date": "October 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46049646}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Easy walking distance to Place de la Concorde, Champs Elysees, the Louvre. Just blocks to 2 metro stations that take you all over Paris for only 1.50 euro per trip! Great cafe across the street, grocer and wine shop half a block away. Also ATM is close. Staff is friendly and speak English very well. Wi-fi is free so you can keep up with friends and family if you are ever in your room! Street stays noisy until late and traffic starts early so don't expect to get a long night's sleep if you leave the windows open.", "title": "Cute hotel-great location", "helpfulness": 1, "user": "sandra99999", "date": "August 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36887403}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 4, "average": 33, "very good": 59, "terrible": 6, "excellent": 40}, "aka": "Cordelia Hotel Paris", "slim_ranking": 0.421081985499, "description": "The Holidays are coming ! The Cordelia team is pleased to inform you the refurbishment of all our rooms between the 1st of July 2013 and the end of March 2014. The Hotel Cordelia will remain open and we will do everyhting we can during this time to make your stay pleasant.From July to September, the 6th and 5th floor are closed. Also, noise pollution can be expected between 10 am to 5 pm and the air conditionning will be swiched off in all the hotel.It won't be long until we contact you and show you our new decor.We wish you a great holiday and see you soon!"}