{"user_rating": 4.0, "review_count": 1047, "name": "Hotel Continental Zurich - MGallery Collection", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "I arrived at this hotel late in the evening, with no booking, looking like a tramp after a few days skiing. The reception staff were nevertheless welcoming and gave me a double room for the price of single. After roughing it at a ski hostel, I needed someone comfortable, and this was a perfect choice. Totally agree with other reviewers about the bed - seriously comfo with loads of bedding. Room is standard 4* design and is quite small - more than big enough for me but for two would be a bit tight. However, dont let that put you off, this is a really nice hotel, especially for the money. The location is good, near the station and a short walk to everwhere. Free wireless (very fast).", "title": "Perfect", "user": "AllanBLondon", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55931319}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We stayed here for 2 nights during a trip to Switzerland. The location is good - less than 10 mins walking from the main train station. The rooms look like they have been recently refurbished and had lovely furnishings but were very small. We had a standard King-bed room - could be worth upgrading to a superior King room for a bit more room. Bathroom was fine, except again very small. Free wi-fi in the rooms was great.", "title": "Nice comfortable hotel but rooms are small", "helpfulness": 1, "user": "Satsar", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 54173657}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We had room service breakfast on the first morning - had to ring them in the morning to order as they did not collect the breakfast card from our door. Had breakfast in the restaurant on the 2nd morning which was adequate but expensive and not out best hotel breakfast in Switzerland. Did not have dinner in the restaurant as the old town is a 10 min walk away with plenty of restaurants to choose from.", "title": "Received a double upgrade on arrival! Very happy", "user": "Gresal", "date": "January 14, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53434100}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Staff were friendly and helpful but the person who brought my bag to our room broke the handle so not too happy about that as now we need to buy a new suitcase and it was an expensive suitcase. He claimed it was broken before we gave him the bag but we had just wheeled the bag from the train station to the hotel so know that it was not broken before then.", "title": "Beautifully clean hotel, perfect location.", "user": "WorksOnly2Travel", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 52632053}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We also stayed at Central Plaza whilst in Zurich - rooms are bigger there but not as modern as they are at Hotel Continental. Central Plaza has an even better location - very close to main train station and old town.", "title": "Comfortable and Accommodating", "user": "Chessi12", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51677711}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at this hotel after a 15 day river cruise. Unfortunately, the rainy weather of Europe caused almost everyone to become sick. We arrived in Zurich in pouring rain and drove right to the hotel based upon the maps provided. We were allowed to check in around noon which was a real advantage based on our condition. For a low fee we parked the car for the day and went to our room. The room was not large by American standards but was very clean and efficient. We spent nearly 24 hours in the room because of our illness and can say that without doubt it had the most comfortable bed we have ever slept in--Like sleeping on clouds. The hotel provided free wireless and many TV channels to pass the time. The location of the hotel is about 4 blocks from the beginiing of the pedestrian streets where the shops and restaurants are located. The hotel is on a hill but the walk is not hard. Normally we use the hotel as a base to explore a city but in this case it became a home. As such, it was very satisfactory and we would certainly stay there again if we return to Zurich.", "title": "Good Hotel and a Great Bed!", "helpfulness": 2, "user": "TheCooksSaltLakeCity", "date": "December 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 51129942}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed here for one night. The hotel is in a great location, approximately 7 min walk to the main train station. The staff were very helpful. The rooms are large and kept very clean. The beds were turned down with some very tasty swiss chocolates left on the pillow. Overall it was a very enjoyable stay and we would definitely recommend it.", "title": "Great Hotel in a good location.", "user": "emmacaDublin", "date": "December 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51100354}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "stayed here for 2 nights and had a wonderful stay. location is excellent. walking distance from train station. very friendly and helpfull staff in all areas. would stay here again when in zurich next time.", "title": "no complaints", "user": "dutchbuis", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51069364}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I was in zurich for two days of visits. I didn't know the lay out of the city that well but I'm very glad that I stayed this hotel. Great location, free internet and pretty good service for what we paid. While it doesn't have some of the amenities like a gym, for a business trip it was definitely worth it. Last time in Zurich, I had stayed at Park Hyatt, which is a great hotel. But for this time around, the location worked much better from the Continental (close to the central train station).", "title": "great location. definitely recommend", "user": "steve2sg", "date": "November 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 49403300}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "I booked one notch higher than the basic rate to guarantee a non-smoking room and was given a lovely large corner room away from any street noise--not that there is very much. Free internet, in-room coffee, mini-bar, generous and modern bathroom, and great bed. I paid about CHF 224 per night (equals almost exactly $224), which included the very good but somewhat pricey (CHF 32) breakfast. I would stay here again personally and would not hesitate to book a higher-end educational tour group into it.", "title": "Beautiful room, quiet, well priced", "user": "GeorgePortland_OR", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48693502}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed for 8 nights. Nice hotel. Based on the read in advance reviews we asked for the room facing the backyard side, otherwise there is a noise from the running tramways. Internet is free only if you have your notebook with you. If you use the hotel's computers you pay few bucks for 30 minutes. Shampoo, body wash, gel - first 2 days were ok. After that, the service brought the ones that had not the smell and quality we liked - so we did not use it. I do not know whether 2 franks per night is a too small tip or this was just a coincidence. Make sure you book it with the breakfast included, otherwise it will cost you about $32/per person every morning. We were booking several hotels for the trip and everywhere else the breakfast was included so we just missed it here. The hotel clerk said that we booked the hotel via Expedia, and that Expedia do not make deals with breakfast included. If this is correct (I did not bother to check), probably Expedia does it to have the lower prices than the competitors when you submit a search on the search engines to evaluate offers from few sites. The front desk crew was very helpful, friendly and professional. The only thing I would advise them: when they book taxi for the morning to airport, they should know which car came to pick up who. The taxi drivers do not necessarily know English, so whoever jumped into the car first won. And it will not be you if you wait your taxi in the lobby, unlike somebody who enjoys the rain or the sun outside. The things I listed above can be easily fixed, so I think that for us, who spent one day in Zurich and the remaining days traveled to other cities from the main station, it worked. We only spent nights in the hotel.", "title": "Well located for those who is based in Zurich, but travels every day to other places from Main train station.", "helpfulness": 1, "user": "AZSZ", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 44292589}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Dreadful breakfast. Just about everything tasted like it had been bought from a downmarket supermarket's economy range. The decor lacked any kind of style and was closer to what you'd expect in a nursing home than a modern hotel. If it was cheap then I'd say it was OK, but it's really not. The rooms were only partially serviced - the tea was not replenished. Terrible place. Try the Four Points if you want something a bit cheaper and much, much better", "title": "Everything's budget but the price", "helpfulness": 1, "user": "BigMikeC", "date": "September 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 43804596}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The hotel was ideal for us because it is a short (10 minute) walk to the main train station in Zurich. It is also a very quiet modern hotel with good, well equipped rooms. The price was also pretty good for central Zurich. I found the staff very helpful and friendly.", "title": "Conveniently located, modern, friendly", "user": "KeenHiker97", "date": "September 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 42167653}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My wife and I ended our 2-week Europe trip at this hotel and were quite disappointed with the overall experience. Its sad because the location is brilliant, but the hotel fails to live up to the basics of hospitality and service. I am a priority member for this chain of hotels, but that didnt mean anything.", "title": "Very Disappointed - Just not worth the price", "helpfulness": 1, "user": "RMJK", "date": "September 14, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 41512456}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "As I said, the location is perfect as it is a 5-minute walk from the rail station in a quite street with a tram stop just a minute away. The reception and front-desk was polite and helpful on their part. But thats where the good points end...", "title": "Good location with standard accomodation", "user": "HB71", "date": "September 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 40030515}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My boyfriend and I stayed at the Hotel Continental a few weeks ago while traveling through Switzerland on vacation. We stayed at four hotels during our trip and this was by far my favorite!", "title": "Great Value and Location! Would Absolutely Recommend.", "user": "bostonvianj", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48246020}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The room was small but comfortable with a great bed and modern fixtures. The bathroom was also a little small but clean and new. The staff was generally friendly, although the housekeepers were a bit rude when trying to clean our room. The breakfast was good!", "title": "Not happy for price paid", "helpfulness": 1, "user": "movin_around", "date": "October 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 46707848}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The hotel is located about five minutes (by foot) from the main train station and is easily walkable with luggage.", "title": "Once again, a very good hotel", "user": "BenjaB", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 46646294}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The hotel is located in a good area, close to the main station. Its a short walk to the Old town entrance as well.", "title": "Good location, reasonable accomodation", "user": "A320Dad", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0}, "id": 46439068}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Service was bad, the staff were knowledgeable but not really friendly. It's a good thing i was familiar with Zurich so i didn't need any real help.", "title": "Luxurious and comfortable", "user": "pmoor1", "date": "October 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46417352}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 20, "average": 112, "very good": 449, "terrible": 18, "excellent": 448}, "aka": "Continental Zurich Hotel", "slim_ranking": 0.161290322581, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Hotel Continental Zurich invites you to experience the Swiss style of living in downtown Zurich. Ideally located, 5 min. from the main station, the shopping district Bahnhofstrasse and a 15 min. drive from Zurich Airport. The unique combination of Swiss chalet-inspired décor with modern architecture offers contrast and balance typical of the city itself. The hotel embodies that which is expected of Swiss hospitality…understated elegance, comfort and well-being. A charming and elegant retreat"}