{"user_rating": 3.5, "review_count": 142, "name": "Hotel Regit", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Affordable, good value hotel with easy access by public transport both from the airport and into Venice itself (incl. night buses). Welcoming Italian staff, receptionist/owner? with enough English to make check in etc easy. Newly refurbished. Simple but everything very clean & functional. Incl. safe & fridge. Good quality simple breakfast with nice coffee! We'd use it again. Limited choice of restaurants/bars in area so we used Venice itself.", "title": "Really convenient location", "user": "optmaxLiverpool", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116474106}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "we arrived early - and the staff were kind enough to let us ear our food in their little patio which was very relaxful Our room was very clean, breakfast was very good staff were very helpful and answered all our questions great location to catch bus to Venice we had to pay for parking but it was a safe, secure site would stay again", "title": "great place", "helpfulness": 1, "user": "opth", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 114748865}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Spent 4 nights at the Hotel Regit. Hotel itself was clean and tidy. Staff were friendly. Breakfast was good. Booked late and were thus unable to find somewhere decent and affordable on Venice itself. This was a good alternative as the train station was less than 5 minutes walk and offered good links to Venice Santa Lucia and Treviso airport. Train was around 1 euro each journey and was very regular. Would recommend this hote/location to those unable to get a place on Venice.", "title": "Good alternative to staying on Venice itself.", "helpfulness": 2, "user": "CMc009", "date": "May 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 110707641}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "Everything in the room is new and very clean. The most important thing is that the climate controle is works perfectly (for hot summers) and the internet connection in our room was good (paid wifi). We booked a room for 3 persons and we got space for 4 persons. It was 1 bedspring for 2 persons and 1 sleepbank (but a luxerious one). Public transport to Venice is very convenient: 2 minutes walk to the bus stop and it takes only 10 minutes to get there. The man at the reception was very friendly and helpful! In my opinion, this hotel deserves more then only 3 stars! A++++++ hotel!", "title": "Best hotel in the area Venice for a real good price!", "user": "carmen_hk", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110349468}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I booked Hotel Regit for my second trip to Venice because my prefered hotel was too expensive this time, so as an alternative the price was resonable. I booked via booking.com, and paid 140 euros each for 2 rooms for 2 nights (1 double & 1 twin) and 170 euros for a triple - all rooms were inclusive of breakfast, and for 2 nights.", "title": "Adequate Hotel in convenient location", "helpfulness": 1, "user": "juejosh", "date": "July 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 69576627}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "We stayed at the Hotel Regit in Mestre this March, prior to departing for a trip around Croatia. This is the second time that we have stayed at the Regit.", "title": "convenience at a low cost", "user": "travelfreak53", "date": "November 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 49214901}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Our room was tiny, but clean and orderly. The bed was jammed up against the wall so when I had to get up in the middle of the night to go to the bathroom, I had to climb over my husband. The bathroom was tiny as well, with my knees hitting the shower when I sat on the toilet.", "title": "Stay Away!", "helpfulness": 3, "user": "Sanjeff", "date": "April 4, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0, "location": 2.0, "service": 1.0}, "id": 14800524, "likes": {"liked": "— n/a", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "That said, I will come back to the Regit because of its location, price and service.", "title": "A Good Deal", "helpfulness": 1, "user": "Icesave", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12413595, "likes": {"liked": "— The location, Service", "disliked": "— Nothing to date"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "The day we arrived was \"Ladies' Day\", so we were offered a complimentary champagne. Later we were given a bouquet of Mimosas, the flowers of Ladies' Day. The breakfast is served either in an outside garden patio or in the restaurant corner of the lobby. It is sufficient and nicely presented.", "title": "so-so", "helpfulness": 1, "user": "mlejoy", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 7779681}, {"rating": 3.0, "title": "Friendly staff, ok hotel", "text": "The first time we stayed there was in the middle of the summer. Upon our departure, we asked for some ice for our cooler. They filled it to the brim! We had ice for two days. Anyone who has traveled around Italy in the summer knows how hard it is to get an ice cube from the management of most hotels, so we were pleasantly surprised.", "helpfulness": 1, "user": "FitMom2", "date": "May 24, 2007", "id": 7684539}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Having arrived at 11:30 am we knew we were too early for check in. We asked the rather authoratative and cold chap on the desk if there was any way we could check in early, he explained that check in was 2pm. Now i was certainly not expecting us to check in at 11:30 but after a long journey from Ljubljana having woken at 6:30 I thought he may have been gracious enough to perhaps allow us to check in at 1pm; I asked him again and he insisted it was 2pm. After having left the hotel and rechecked our printed confirmation, it actually listed check in as being 1pm, if i had know this at the time i would have pushed it more. Having resigned ourselves to 2 and a half hours of killing time we decicded to head off into Mestre for a mooch. Firstly the guy on the desk asked us for our passports and would return these when we came back! this is 2012 and not 1978, and i thought this process of beaurocracy had long since passed, clearly not here! Welcome to Italy where officialdom still reigns supreme.", "title": "Average hotel with mediocre service", "helpfulness": 3, "user": "jimbojetset", "date": "June 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 131360593}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Our wander into tatty and run down Mestre was hardly a pleasant experience and i would not recommend any traveller to sample it's non-exixstent charms, think the Italian version of Slough..", "title": "Value for Money", "user": "Gandhe", "date": "May 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130996747}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Upon our return we checked into our room. The room was small but this was as expected though the layout was poorly thought out with an oversized bathroom in relation to the size of the bedroom. The dressing room mirror was poorly placed as was way too high, the lack of suitably placed power points also an annoyance. My girlfirend politely requested if we could move rooms, the guy said 'No'.", "title": "Perfect location, cheap and quite comfortable", "helpfulness": 1, "user": "Mintsage", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130923641}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Of the positives, the AC worked well pumping out nicely cool air, the bathrooms was actually nice with a decent enough shower; the fridge in the room was also a nice touch. The bed was very comfy and the room spotlessly cleann", "title": "Perfect Location.Service disapointing", "helpfulness": 5, "user": "N S", "date": "April 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 127319757}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I actually rated the breakfast with a tasty and adequate supply of nice foods (scrambled egg included) - what i did't rate was the overall rudeness and unfriendliness of the staff. The breakfast waitress in particular was particularly cold and unforgiving. Casting disapraging looks, her meely mouthedness and lack of warmth was unpleasant to say the least - smile love and the world smiles with you. Not too sure if the same said person was responsible for cleaning our rooms but whoever was they faniced a quick peep at my passport photo, now i knwo I am a bit of a hunk but after taking a look, the person responsible was a bit foolish in forgetting to put it back in it's wallet! - a little worrying if you ask me! The Asian guy staffed at night however as a really nice and friendly guy - more of the same and the hotel will improve.", "title": "Good location, near the train station", "helpfulness": 2, "user": "famileetravels3", "date": "January 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 122479214}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We arrived by train, and were able to walk from the train station to the hotel. Easy walk, easy to find. I was a bit put off by our 'welcome' but luckily it didn't set the tone for the rest of our stay. The owner seemed busy doing something else, while the Pakistani worker tried to converse in English and Italian with us though it was difficult for him not being his native language. We didn't appreciate that considering the owner spoke English and Italian, (our languages) and it would've been easy for him to jump in and help out.", "title": "Good Value & Convenient (for outside Venice)", "helpfulness": 1, "user": "Melissa P", "date": "December 19, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121872263}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Our room wasn't ready yet (though I am the one who discovered it - they were unaware, so upon entering it, it was messy) and the owner got very angry with the cleaning woman. She fixed it up within 15 min. or so, and from there things were fine. The owner acted like a jerk at first but we had no problems later.", "title": "Value for Money, Excellent Location, Decent Breakfast", "helpfulness": 1, "user": "henrylimsg", "date": "November 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120450210}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The room was clean and perfect when it was fixed. I never slept so well in a hotel - I was beyond comfortable here. :-)", "title": "good staff, good breakfast", "user": "VanValGal", "date": "October 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 119844157}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This place had breakfast though we arrived toward the end of it. I didn't get as much as I wanted because they weren't putting out more. My fault more so than theirs, but still.", "title": "Handy location for transfers", "user": "dimples09", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118174385}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We had to leave earlier than a bus runs to the airport, so we got a taxi which was very affordable - the airport is all of 15 min. away.", "title": "Very friendly Staff - Very Clean - Value for money", "user": "Angelique1976", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116603901}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 11, "average": 34, "very good": 66, "terrible": 3, "excellent": 28}, "aka": "Regit Hotel Venice", "slim_ranking": 0.484375}