{"user_rating": 4.5, "review_count": 1047, "name": "Hotel Britannique", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "When vacationing, I usually enjoy staying at a modern, large hotel with many ammenities. However, while planning a trip to Paris for my 25th wedding anniversary, I wanted a hotel that offered a central location which allowed getting to and from main attractions with ease. Having a few doubts, I reserved the Hotel Brittanique for six nights after reading the many fine reviews on this site. I am happy to say, I was quite pleased with the hotel and its staff. Travelling to Europe occassionally, I found the room size to be typical. Hotel was exceptionally clean and the staff was helpful. I found it odd that the front desk only supplies guests with one room key and that they request the key to be turned in at the front desk each time you leave the hotel. The front desk did mention that rooms were cleaned each day, but if you decide to sleep in and post a \"Do Not Disturb\" notice on your door, rooms probably would not be cleaned after 2pm. Imagine our surprise one day after sleeping in and not leaving the room until 3pm that upon return, our room was cleaned and fresh towels were provided--having not said anything to the staff of our late departure. That is the type of service this hotel provides. It is located extremely close to many restaurants, cafes, bars, metro and major sites. Yes, there was construction being done on the facade of the hotel, however, it did not pose a problem for us even though we had a room located in the front of the hotel with a balcony. Most days we were out of the hotel before the work began and had no problems with the work crew. I would certainly recommend this hotel to anyone and would stay again on my next visit to Paris.", "title": "Home Away From Home", "user": "chriscrossin", "date": "October 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143056393}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We were there for 6 nights and we really enjoyed our stay. The entire hotel exuded an old world Parisian Charm. The rooms were small, but well equipped and tastefully done. Compared to the room, the bathroom was relatively large in size. It also seemed to be newly renovated. The front desk was friendly and helpful through out our stay. The breakfast spread is decent, but you won't be missing much if you haven't opted for it. There are plenty of cafes around where you can get alot more value for the same price (of the breakfast). Finally, the location is great. Just off Rue De Rivoli and it's as central as it gets. Definitely worth a stay.", "title": "Beautiful place, excellent location", "user": "ibishnu", "date": "October 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142954659}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed here in August and couldn't say enough good things about this hotel. The location is excellent, service and staff were amazing and room was fantastic. Yes, the rooms are small by North American standards but not by European. Rooms were very well appointed with everything you need including safe, vanity and really comfortable beds with quality linen. There was even a bowl of fresh fruit upon arrival. You would be hard pressed to find a better location (Metro at end of the block, many restaurants, patisserie around the corner and easy walking distance to many points of interest). The location made it easy and convenient to pop back to the hotel to rest or pick things up during the day's excursions. Prior to my arrival I exchanged many emails with the hotel regarding my reservation and they responded promptly each time. Room had beautiful French doors which could be opened to allow fresh air but they did an excellent job of keeping noise out when closed. Nice breakfast selection each morning including pastries, bread, cheeses, yogurt, fruit, selection of fresh squeezed juices, eggs, etc. This was my third trip to Paris but won't be my last and Hotel Britannique is where I will be staying.", "title": "Wouldn't stay anywhere else!", "user": "Penny A", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142874955}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We really enjoyed our stay at Hotel Britannique. The rooms, although small like most hotels in Paris were very nice and very clean. The staff was great and the area is simply perfect. I wouldn't have changed a thing.", "title": "Charming Parisian Hotel in the Middle of Everything!", "user": "Janet K", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142832795}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The wifi isn't as good as some other hotels, but the building is old, so it's understandable.", "title": "Nice hotel, great location!", "user": "travelmomScottsdale", "date": "October 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142747389}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Charming hotel. Excellent location. Tiny rooms but well appointed. Hotel Staff were wonderful. Calm, relaxing atmosphere and a good breakfast also. We walked to EVERYTHING! Cafe Zimmer on the corner was a great spot for lunch. Metro on the street also. I would stay here again!!!", "title": "Charming, Hotel in an Excellent Location!", "user": "ntm4", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115734881}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Perfect location for all the key tourist sites. Less than one block from Metro for easy access. Hotel itself is cosy and intimate. Never had breakfast as there are loads of cafe's within 5 minutes walking distance.", "title": "Excellent spot, highly recommended", "user": "mb_private", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115699543}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "A wonderful find...based on everyone's comments from Trip Advisor. We could not have stayed in a more friendly, conveniently-located, and charming hotel. Wonderful and helpful staff, cozy, immaculate rooms and overall the best! Will definitely return!!", "title": "Magnifique!!", "helpfulness": 1, "user": "betsykNYC", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115694973}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I recently stayed at Hotel Britannique on a solo visit to Paris. Location, can't say enough. Two blocks from Louvre, walking distance to absolutely every other major attraction. The rooms were exactly as pictured on this website, cute and clean. I had a single, facing the river side and it was noisey until about 11 at night and then quited right down. Bathrooms were clean and well appointed, with lots of room for all of my \"girl stuff\". Staff were fantastic (all but one at check in) and spoke perfect english. I took the train from CDG, got off at the Les Halles station and only had to walk a few blocks to find the hotel.", "title": "Awesome choice, location and service", "helpfulness": 1, "user": "CanadianAlandLori", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115662778}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Suggestion. Buy a Paris Pass. For no other reason then it gets you past the line ups at all the major attractions. Every Museum / Gallery had what I would guess to have been a several hour line-up and with my Paris Pass I sailed right in. Ask someone official, showing them you pass and they will point you to the special entrance...it's not well marked. I also used my pass to hop on and off the \"hop on and off bus tour\" just to get around. If I was at the Champs Elysees and had sore feet, on the red bus I jumped and it took me almost right to my hotel (stopped at the Louvre of course).", "title": "A balcony with a view.", "user": "HMM2011", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115591217}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I have stayed at this hotel four times - twice for business and twice for vacation. In all cases the staff was friendly, helpful, spoke as much or as little English as you needed and ensured that each stay was comfortable and problem free. The rooms are quiet and comfortable, but be prepared for the relatively small size of both the rooms and the quite comfortable beds - but after all this is Paris and you should be wandering the streets more, and in your room less. These are small rooms in most cases with limited room for luggage. The closets are good sized and have shelves and a personal safe to make sure you can take care of all your belongings. The showers are good and the water temperature and water pressure are adequate. If your room faces the street, you have a classic view of a typical small Parisienne street scene - especially if you get one with a small balcony. If your room faces the \"courtyard\" you will find it incredibly quiet and conducive to terrific sleep. Either way I have never had a problem with noise. It is clear the ownership is paying attention to the quality of the rooms and public spaces. Each time I have noticed upgrades to furniture, televisions, plumbing and the cleanliness of the overall hotel. The breakfast served is quite good, and very complete, but I believe it is currently 14 euros per meal extra....just something to consider if you are trying to manage costs. On the backside of the hotel is a wonderful boulangerie that opens at 7am and has great baguettes and croissant. Around the corner is a small grocery store so you can get some basics if you want to stock your hotel room with some snacks. The Chatelet metro stop is literally all around you, with several entrances within 50 yards of the hotel,so getting anywhere on the metro is a snap. I will continue to use this hotel, assuming availability (only about 35-40 rooms in total) and look forward to future stays.", "title": "A perfect location for business or vacation - and a staff that makes your stay a pleasure", "user": "Mainekerner", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115051261}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Great location, very helpful staff, excellent room. This was the start of a long business/holiday family trip to France and it set the bar very high for the remainder of our time. It was an excellent introduction.", "title": "Fantastic. Can't wait to return.", "user": "BhmAL", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115045215}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "You cannot find a better location in this price range with such charming decor and friendly people at the desk! I've stayed here before and think this is the best place in this price range that I've stayed in over 30 years of travel to France. Also, the breakfast is excellent--buffet style in the manner that you would find in Vienna. I highly recommend it and my traveling colleagues were also completely satisfied.", "title": "OUTSTANDING HOTEL IN THIS PRICE RANGE", "user": "europetravelerUSA", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115031441}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "This friendly and comfortable hotel is ideally situated for visiting Notre Dame, the Left Bank and the Centre Pompidou. The staff are knowledgeable and welcoming, in English and French. The hotel serves a very good breakfast, and for all other meals there is a great choice of bars, cafes and restaurants in the immediate vicinity. The rooms are not large but provide everything that a visitor needs for comfort, convenience and a good night's sleep, including very efficient air conditioning.", "title": "Friendly, comfortable and ideally situated", "user": "amt55", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115028635}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Perfect location, close to everything and a major metro station. Staff was very helpful. Rooms are small but very comfortable. Loved it!", "title": "Great location, great hotel", "user": "nevers", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115028222}, {"rating": 4.0, "title": "First time", "text": "My husband and I stayed at the Hotel Britannique at the end of Nov. We made reservations directly with the hotel on-line.", "helpfulness": 9, "user": "letsgoFlorida", "date": "January 3, 2008", "id": 12302571}, {"rating": 5.0, "title": "Loved this hotel!", "text": "They responded to our questions in a timely manner and provided any extras we asked for. A great location to all major tourist areas and one street over from the river. The staff spoke English and did not make us feel bad about our poor French attempts. Do not expect American size rooms although we did get a queen bed which was roomy enough for our kingsize taste. Nicely decorated with clean up to date bath. The elevator holds one person with a bag or two. We would stay there again.", "helpfulness": 6, "user": "daldevdan", "date": "December 20, 2007", "id": 11710396}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I just arrived back from a week in Paris. I chose this hotel because it looked so cozy and comfortable. I was not disappointed. I stayed in a single room on the 6th floor that was kept immaculately clean. The staff was attentive and friendly. The breakfast was included in my winter rate and I found it delicious.", "title": "Merveilleux!", "helpfulness": 7, "user": "CDNeh", "date": "December 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11536540, "likes": {"liked": "— Charming small hotel in a great location."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The location of this hotel is also a big plus. They are within minutes of Notre Dame and the Latin Quarter. The metro is right around the corner.", "title": "I wish I had been able to sleep", "helpfulness": 4, "user": "paulthomas70", "date": "December 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 11409328, "likes": {"liked": "— location", "disliked": "— couldn't sleep"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Without a doubt I would stay here again.", "title": "Lovely if you dont mind being up close and personal!!", "helpfulness": 4, "user": "overseassoon", "date": "December 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 11276390, "likes": {"liked": "— Location", "disliked": "— facilities, comfort"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Great for the eastern side of the city, metro (Chatelet), river and local cultural heritage - including local garden and pet shops which we were surprised to find sell real puppies and kittens. Not sure if that was a good or bad thing. Well furnished room with kettle and hair drier (so don't add weight by bringing your own). Very tiny lift unsuitable for wheelchair (mind you, Paris is unsuitable for wheelchairs; nearly every cafe and restaurant loo is down steep narrow stairs to the basement). Breakfast provides lots of choice and there's a comfy / cosy lounge to read the free newspaper before setting out.", "title": "Perfect location", "helpfulness": 1, "user": "Fivecorners", "date": "October 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142697922}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Tip - buy your own Coke and fridge essentials from the near-by supermarket. Hotel prices a bit steep.", "title": "Not a great experience...", "helpfulness": 2, "user": "Lauren T", "date": "October 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 142685203}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "My fiance (boyfriend when we checked in...fiance when we checked out!) and I went to Europe and stayed in Paris for 4 nights at Hotel Britannique. I was trying to find the perfect hotel because this was his first time in Paris and I had talked it up so much and I wanted everything to be perfect so I spent hours looking for a good hotel and this hotel got great reviews- I'm not sure why because usually trip advisor is right on. The rooms and bathrooms are really small- even for Paris standards. We were told by email prior to our stay that there was to be rennovations on the hotel and we could opt out but after so much searching we decided to stay because they said the rennovations wouldn't begin until 9am, but they began between 8:15am-8:30am, definitely not later than 8:30am ruining any chance of sleeping in. We were niave in thinking that it wouldn't be too bad so if you're staying here during the rennovations I do advise you of our mistake- it's BAD!!! It sounded like they were hammering on our heads and they were directly outside our window- but it was our fault for assuming that it couldn't be that bad or they wouldn't have still had the rooms available to stay in- don't make the same assumption that we did! We were so tired from being woken up so early that we would do our sight seeing during the day and get in after 5pm when the construction work was done and then we'd take a nap and then at night couldn't fall asleep until really late and this was the cycle our whole time there. Also, and this really upset us- the construction crew came in our rooms!!!! My shoes were lined up by the door and they were all dusty with saw dust and the window was a crack open so we know they were in there because it was shut tight when we left for lunch- on our first day there we checked in and then had lunch at the Zimmer Cafe which is across the street and is awesome and then came back to the room and noticed that they had been in our room and we immediately notified the front desk and brought down some of my shoes that were covered in saw dust and they said they'd tell the manager and tried to blame the maids, but I don't know why the maids would open the balcony door when we were told that no one was allowed to open the balcony door as the construction was practically on our balcony and our room was already clean anyway because we just checked in. My boyfriend was planning to propose on another night during our 4 night stay but because of this he was forced to propose that first night because he was nervous to hide the ring in our room since construction workers were coming into our room!!! and he couldn't put the ring in the safe because I would notice. The proposal was still amazing but I know he was a little upset with this. Also, the wi fi was down for three of four nights and because of it we were unable to plan a day trip because we were waiting on one or two days before to see if we were up for it and then we couldn't get on our computer because the wi fi was down and the computer at the hotel always had a wait since no one could use their wi fi. The hotel staff was nice but there are many hotels with nice staff and they weren't exceptionally helpful. The hotel is in a good location but really you can take the metro anywhere and we just took cabs at night so it didn't really matter. I'm bummed that I didn't listen to my fiance and get a hotel by the Eiffel Tower because while it's a little out of the way of everything you can get many hotels with great views of the Eiffel Tower, much cheaper than this hotel with much bigger rooms (I've stayed in this section many times before and thought it would be better to stay by the Louvre this time but the grass is not always greener!) and nice and helpful staff and you just take the metro and cabs at night if you want. I would never stay here again but I'm happy that we were able to make the best of it and our hotel in Germany by far made up for this.", "title": "Excellent location and very comfortable", "helpfulness": 1, "user": "badger36", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142531611}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This hotel is an excellent find in Paris. The location is absolutely excellent. I had a meeting at the Centre Pompidou and it was literally a 5 minute walk. The River Seine and Notre Dame is even closer. The neighbourhood is excellent for sightseeing and lots of bars and restaurants within the immediate neighbourhood - whilst the hotel is in a relatively quiet location.", "title": "Fantastic hotel for Paris sightseeing- small but perfectly formed", "user": "Priestleysrus", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142423726}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "It is a small boutique hotel with great character and old-world charm. The front desk staff who initially greet you are extremely friendly and made me feel at home right away. I had a reserved a single room, but was pleasantly surprised by the size of the room; including a very comfortable double bed. The single room I had was on the top floor. The bathroom was a good size and thankfully the shower was large for a single room.", "title": "Quaint with great location", "user": "Burg3186", "date": "October 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 142263117}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Nice room. Perfect location with walking distance to Notre Dame.. Friendly staff, clean and quiet. Nice breakfast too.", "title": "Just perfect.", "user": "Ciccigoteborg", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115018045}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "I´ll be back as soon as I can..", "title": "Good as expected", "user": "aussie5514", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114972543}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Reviews lived up to my expectations of this hotel. Excellent location in a quiet street. Walking distance to many attractions. Staff polite and friendly. Only comment is that it appears that they will not let you into your room before the checkin time but you can store luggage. It may be that rooms are not ready but at other hotels I have often been allowed into the room early if it is ready. Not a big deal though.", "title": "Perfect, quiet and location!", "helpfulness": 1, "user": "KinRMCA", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114876204}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "After a short stay at HB last fall, my wife and I were able to spend 8 nights there just recently. As everyone points out, the location is optimal, the rooms clean and nice (and large enough) and the staff excellent and helpful. Returning to the hotel each night after long days of walking, shopping and seeing the sites felt like coming home.", "title": "Great Hotel & Staff!!", "helpfulness": 1, "user": "GothicTraveler", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 114871222}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "The staff was helpful throughout the trip, helping us with restaraunt suggestions and making the arrangements for our trip back to CDG. Would recommend highly.", "title": "Great Hotel, Great Location", "helpfulness": 1, "user": "aahaddon", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114738379}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My wife and I recently spent six nights at the Hotel Britannique. We chose the hotel mainly for it's great location and reasonable room prices.", "title": "Great location", "helpfulness": 4, "user": "jab31151", "date": "March 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14576191, "likes": {"liked": "— the location and charm of the hotel", "disliked": "— one night of noise"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "As stated in previous reviews, the location is excellent. Many sights are within easy walking distance and the nearby Chatalet metro/RER station will get you anywhere you want to go if you don't feel like walking. There are many places to eat nearby so you won't have to hunt for dinner.", "title": "Highly recommend!", "helpfulness": 5, "user": "DublinLove2travel", "date": "March 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14516081}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The hotel staff is wonderful. Everyone at the front desk spoke English and they were patient enough to listen to my poor French.", "title": "Wonderful Gem in the Heart of Paris", "helpfulness": 5, "user": "slglenn", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14506724, "likes": {"liked": "— The Location", "disliked": "— The stairs"}}, {"rating": 4.0, "title": "Excellent", "text": "We had a room with a king bed. All the king bedrooms face the rear of the building, so there was no view, but the room itself, although small, was nicely appointed. The bed was very comfortable. The bathroom was good sized and perfectly clean. There was plenty of hot water every morning.", "helpfulness": 4, "user": "carbonsa", "date": "March 16, 2008", "id": 14319900}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "One night we experienced noise from the room next door. The people staying there stayed up late, talking loudly. Several reviews have commented on noise being a problem. Depending on who your neighbors are I can see what they mean. Since we had no problem the other five nights we were there I would not consider this a big deal.", "title": "Fantastique Brittanique!", "helpfulness": 12, "user": "LorraineKoertzen", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12566281, "likes": {"liked": "— Clean, Friendly and decor was beautiful", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "A secret gem right inthe heart of the city and next to the Metro (40 minutes direct from Charles De Gaulle airport). Perfect room: small but everything in place; air-con, heavy drapes, French furnishing, small fridge, modern & clean bathroom, power-shower, comfortable matress. Best rooms face the street at the front, rear face offices! But whichever room, it's quiet. Welcoming and cosy breakfast room with very fresh continental breakfast and wonderful coffee. Receptionists extremely friendly. Spotlessly clean hotel throughout. Top of my list for a relaxed & comfortable Parisian hotel.", "title": "Charming Comfort", "helpfulness": 6, "user": "Jennergy", "date": "October 24, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 10277746, "likes": {"liked": "— Traditional French style with moodern amenities.", "disliked": "— Our view at the back of the hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Hotel Britannique was amazing. It's clean, immaculate, quiet, and comfortable. Our room was small by American standards, however, it was big enough for two people, and I believe it was big for a Paris hotel. Our room was at the top-most floor, with a small balcony that faced the street. The bathroom was spotless and in superb condition.", "title": "Loved the Britannique", "helpfulness": 6, "user": "Ahmads", "date": "October 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10251314, "likes": {"liked": "— Immaculate condition and location", "disliked": "— elevator can only fit 2 people with some luggage"}}, {"rating": 5.0, "title": "Very nice", "text": "The location of the hotel is perfect. It's only a 5 min walk to Notre-Dame; 12 min walk to the Louvre; and less than 1 min to the River Seine. Right across the street from the hotel is the way to one of the Metero (subway) stations-\"Chatelet\". My husband and I spend four days in Paris, and by the second day were using the Metero to get arround. We even took the Metero to Versailles (making one metero station change) to see the famous palace. It is also surrounded by lots of cafes that are open late in the evening.", "helpfulness": 6, "user": "Ocelottravel", "date": "October 17, 2007", "id": 10093674}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The staff was very helpful. There is one person in particular who wasn't too friendly, however the rest were very pleasant. It's a small quite hotel with lots of charm. One staff member (an older gentlemen who mostly worked in the evenings) in particular was extremely helpful. He spoke excellent English, and helped us identify metero stops, and gave us tips on how to read the Metero map, etc. Our last day in Paris, we checked out early in the morning and left our luggage at the hotel until the evening.", "title": "Wonderful location", "helpfulness": 3, "user": "Diane33", "date": "September 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8724624, "likes": {"liked": "— Hotel was clean. Location was excellent"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I booked the room using the hotel's own website, and got a great rate. Do try their website first when you are booking a room. The hotel is a good 30-40 min drive from the airport.", "title": "Fabulous position", "helpfulness": 5, "user": "UkYoungretired", "date": "September 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8708344, "likes": {"liked": "— Cleaniliness. Bit different. Superb position for the money", "disliked": "— Street a bit noisy. Ground floor room dark."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The hotel is just off a major square, but on a relatively quiet street. Loved the little bakery around the corner. Within a block of the Seine and an easy walk to the Louvre or Notre Dame. In fact, we only used a taxi for the Eiffel Tower...walked to everything else. The rooms were nice, but a bit small. However well appointed and very clean. Cozy living room and pleasant breakfast area...all in all, a great pick for a good price.", "title": "Wonderful location...walking distance to major sites in Paris.", "user": "mbanga", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115539202}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "A friend and I stayed here last week and it was perfect for us! We especially enjoyed how close it was to everything without being 'too close'. It's in the Chatelet area which couldn't be more central. 5 min (max) walk to Notre Dame, the river, all major train and subway lines, shopping on Rue Rivolli, the Louvre etc. I have stayed in Paris before and this was far better value for the money. We paid 230Euro per night for a good sized room with two twin beds. It wasn't huge but enough closet space and room for all our stuff. The bathroom was quite generously appointed and the whole place was very clean and fresh. The staff are very attentive and helpful. The breakfast was 14Euro each per day so we skipped it and had breakfast at a great little Boulangerie about 40 steps outside the hotel. The free WiFi was good and the TV had decent channels. It was quiet at night and the room, despite facing a courtyard had a lot of light.", "title": "Perfect in every way", "helpfulness": 1, "user": "torontoana", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115304084}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The beds are comfortable, and the location is quiet while convenient, especially to the louvre. The staff was competent and helpful. The room we had was small, but others were smaller. Still, we slept with the windows open in a very busy part of Paris and were never disturbed.", "title": "Clean, nice, quiet", "user": "001Slo", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115275504}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Chosen because of prior TA reviews, Hotel Brittanque does not disappoint. We were first timers to Paris, so to be a block from the Seine, two blocks to Notre Dame and close to the Pont Neuf was perfect for us. We did choose a larger king room, beautiful furnishings and wonderful large, spotless bath. Lovely to have fresh, delicious fruit when we arrived. Gorgeous common lounge room, with a free computer for guest use. I particularly would acknowledge the front desk staff who answered every question, gave us great ideas and were always cheerful and tolerant of my French. We never strayed far for an evening meal - the streets bordering Ave Victoria have delicious offerings, and the boulangerie around the corner is a must. Thank you all for a truly wonderful experience.", "title": "Perfect location in the 1st.", "user": "oliverandharry", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115183242}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Hospitality of the front desk staff was excellent. A young man worked with me for a time to get my ipad online. The room, although small, represented good value for the money. Decor is charming. Bathroom updated.Loved the room darkening shades and the terry cloth robes. Enjoyed breakfast in the cozy breakfast room. Enjoyed sitting in the British style parlour room. Location is ideal-walking distance from Louvre, Notre Dame, Musee d'Orsay, etc.", "title": "Great location, great price for a Paris hotel", "user": "Angel9096", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115057651}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our group of two couples recently stayed at the Hotel Britannique for 3 nights at the beginning of a two week trip to France and Italy. The hotel let us know well in advance that they were undergoing a renovation to their facade. We were offered a 10% discount or we could have cancelled the reservation and gone elsewhere. Though our rooms did face the street and the view was completely blocked, we didn't mind at all. The hotel is quaint and the employees all spoke very good English. The rooms were well maintained and comfortable. Each room was slightly different from the other. Our room was fairly small but had a large bath. Our friends room was bigger, but had a smaller bath. The staff was quite helpful to us in making reservations and suggesting things to do. They reserved a car for us upon our arrival at CDG and for our flight to Venice from Orly. I would not hesitate to stay here again. The location was fantastic. We walked to the Louvre, Notre Dame, and the Seine River. The surroundings were very nice and we felt very safe and secure no matter what time of the day or night.", "title": "Nice hotel, Great location", "user": "swatts1", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143550463}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Very well situated for most visitors to Paris, almost on top of métro hub Châtelet, this hôtel gives excellent service, in a cozy British style decor. Prices are modest according to Paris standards, in relation to what you get, Rooms vary in size and layout, most are relatively small, but that should be expected at this price level. Comfortable lobby. Good full breakfast. We are returning guests since our first stay three years back, after having tried various 3-5 star hôtels in Paris for many years. This one is clearly at the top level among the 3 star hotels that we have experienced.", "title": "Very good value for money", "helpfulness": 1, "user": "Johan M", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143508836}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We arrived in Paris on a Friday ready to explore the Loire Valley Chateaux. But first we were going to stay in Paris for two days before picking up our rental car at the Orly Airport and heading south. We had a reservation at the Hotel Britannique located on the right bank of the Seine in an area called Chatelet within an easy 12-15 walk to the Notre Dame Cathedral. The location also provided us with easy access to many shops and cafes that are within a 2-5 minute walk from the hotel.", "title": "Great Location - Right Bank of the Seine", "user": "jhtaylor46", "date": "October 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143384371}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The hotel’s façade was undergoing significant maintenance and was covered by scaffolding and a protective covering which totally hid the outer shell of the front of the hotel except for the floor at street level. We were made aware of this prior to check-in and decided to stay anyway due to the terrific location. Our junior suite was on the third floor and was facing the front of the hotel and I’m sure that it normally had a terrific view of the small street and cafes in front of the hotel but with the scaffolding and cover in place our view was totally blocked. On the good side, we were given a discount due to the inconvenience of this situation. The room had two very tall windows (almost floor to ceiling) that opened to the street below. But let us not forget the view was totally blocked due the ongoing maintenance however; one can dream. The good thing is that there was no work being conducted while we were in the room and the room was relatively quiet. The room was clean and the furnishings were well maintained and the bed was comfortable but then I was so tired from our long trip that I could have fallen asleep on a clothesline.", "title": "G & A Bolitho Australia", "user": "Anne B", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143318372}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I would not have a problem recommending this hotel to anyone but there are so many hotels in Paris and you should do your own research to decide in which area of Paris that you would like to stay and how much money that you are willing to spend for a room.", "title": "Best value and location", "user": "bsutera", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143264405}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "I enjoyed my four-night stay at this small hotel a couple of blocks away from the Seine. Although my room was quite small (and so was the elevator), it was quite comfortable. I also enjoyed hanging out in the comfortable lobby a few steps below the reception area. The staff was cordial and helpful and the first-arrondisement location was a plus.", "title": "Outstanding Staff", "helpfulness": 5, "user": "tbill817", "date": "November 30, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 11172271, "likes": {"liked": "— Clean and comfortable", "disliked": "— Size of room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We recently stayed at the Britanique for a long weekend.", "title": "Simply perfect Paris", "helpfulness": 7, "user": "CommonPeople-uk", "date": "November 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11094364, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "It is absolutely outstanding. We travelled to Paris by Eurostar and got a taxi from Gare du Nord to the hotel, which was a bare 10 minutes away just a 7 euros ride.", "title": "Great Hotel, but.......", "helpfulness": 4, "user": "Ringp", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11055021, "likes": {"liked": "— location, friendly and helpful staff, decoartion, cleanliness", "disliked": "— noise from neighboring rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "The hotel is very stylish and yet also very traditional, our room as expected was small, but well presented and more than adequate for our needs, plus the bathroom was truly excellent, spotlessly clean, lovely toiletries and fluffy robes. Also the bedding was changed daily- amazing.", "title": "Perfect Hotel in Paris", "helpfulness": 7, "user": "BJL", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10918273, "likes": {"liked": "— Everything", "disliked": "— That I couldn't stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The main selling point of this hotel is the unbelievbale location for the price, literally 5 mintues from the Seine. We had bought our walking shoes with us and we were able to walk from Notre Dame along the Seine taking in the Louvre and the Eiffel Tower right up the Champs Elyesee to the Arc de Triomph.", "title": "Fabulous location", "helpfulness": 8, "user": "thewildboo", "date": "November 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10741483, "likes": {"liked": "— The central location", "disliked": "— Overpriced breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I've had the most romantic stay at the Hotel Britannique for a very special occasion. My boyfriend proposed to me and the hotel made our time in Paris even more beautiful.", "title": "Most beautiful Hotel and outstanding hotel staff", "user": "Maria E", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143260302}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The way they treat their quests is lovely and everyone is so extraordinary kind.", "title": "A very pleasant stay in Paris", "user": "orkdldy", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143235026}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The rooms are pretty. You have all you need: A big cosy bed, international TV, a minibar and a nice bathroom. The furniture is very classy. If you travel as a couple this is the best hotel you can pick because it's super romantic.", "title": "Cheers to Hotel Britannique", "user": "Addy5", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143195199}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The fact that this hotel is quite small and exclusive the staff knows you by name very quick which makes you feel very welcomed and special. If you need help with anything whiles your stay they will immediately do anything they can. When we arrived we had personalized welcome card in our room and I even got a birthday card while we stayed there over my birthday. It's these little things that make you want to come back. I highly recommend this place to everyone. You wont't be disappointed.", "title": "Lovely quaint hotel, not during construction though", "user": "TinaB333", "date": "October 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 143151474}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We're just back from a three night stay and I was very pleased! The location is excellent – right across the Seine from the Ile de la Cite and the Latin Quarter and near to the metro (look for the rue de Lavandieres sortie at the Chatelet stop)", "title": "hotel review very pleasant experience", "user": "Ellen G", "date": "October 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143119088}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 15, "average": 39, "very good": 305, "terrible": 4, "excellent": 684}, "slim_ranking": 0.0184049079755, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}