{"user_rating": 4.5, "review_count": 32, "name": "Hotel Seiwald", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The owners and staff of this hotel are simply wonderful, they were kind and so accommodating; they truly understand customer service. Our room was comfortable and immaculate. We loved having the toilet separate from the shower, though it did take some getting used to having to go back to the shower area to use the sink to wash our hands. The hotel had plenty of parking, was walking distance to our ski school, several equipment rental shops, and the slopes. The pool, which had a lovely Greek grotto feel to it, was a great diversion on the one rainy day we experienced. Our tour company had twice per day office hours within the hotel which made planning our days easy and convenient.", "title": "Everything was great....except the food", "helpfulness": 2, "user": "tshellthom", "date": "January 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93223858}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The only downside to our hotel stay, and sadly it was a big one for us because we love eating and board was included in the cost of our room, was the food. The breakfast menu was fairly standard, with little to no variety whatsoever. The dinner menu consisted primarily of pork or fish. This is not necessarily a bad thing, except that the hotel's Chef consistently executed those meat dishes poorly. Despite dish concepts that sounded delicious on paper the Chef always managed to overcook the pork and failed to season the fish dishes. I sent my entrées back to the kitchen practically untouched on three of the five nights we ate at the hotel, and on our last evening we opted to eat at a restaurant away from the hotel. Several of the Chef's dessert concoctions were also questionable, so we very much appreciated having the ice cream bar available on those evenings. To his credit the Chef did put out a good duck dish one evening.", "title": "Can`t wait to go back", "helpfulness": 2, "user": "WLRoos", "date": "January 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 92685790}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "From the personal service to the great spacious suite, the good food and all the hotel exstras, everything was great. The location is fantastic. Although we never go to the same place twice here we shall make an exception. Thank you again to Mr Seiwald and staff", "title": "Beautiful hotel", "helpfulness": 2, "user": "Elswo1", "date": "September 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 81343819}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "I was really impressed with this hotel. My room was spacious, the staff were so accommodating and the food was first class (though I wish there had more more to the main course, like veggies!) It was quite central to our tour (the sound of music) and would be a good place for skiiers. But if you're looking for a central location with shops, then look again! It overlooks beautiful scenery and theres bus stops near by. The staff were very helpful, offering us breakfast on our arrival and dinner before our (late) departure. They even let us stay in our rooms til 5.30pm. The hotel overall is grand and spacious, with a beautiful pool and large gym. I would definitely stay here again", "title": "HOTEL SEIWALD HAS EXCELLENT FACILITIES, IS VERY COMFORTABLE AND WELL SITUATED", "helpfulness": 2, "user": "annie53England", "date": "February 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56073575}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "This hotel is situated near to the relatively small skiing area in Kirchdorf but there is access to the ski bus in nearby areas. The staff are helpful and friendly , rooms very comfortable and warm and the hotel has some of the best facilities for sport that I have seen in a medium sized hotel. The hotel exceeded our expectations from brochures and other reviews.", "title": "great family ski holiday", "helpfulness": 1, "user": "je_graham", "date": "February 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 55034438}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We are currently 7 of us staying at the Seiwald hotel, Kirchdorf, in Austria. The rooms are clean and of average comfort, although in need of serious remodeling: the windows are not sealed and a constant freezing draft oozes through the cracks, at least in all 4 rooms we are renting. Also, the upholstery is stained and worn out.", "title": "Nicely located, but poor food and comfort", "user": "Raja E", "date": "January 6, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 52737920}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We have now stayed at the Seiwald over 7 successive visits to Kirchdorf and it would be fair to say the hotel is undergoing a slow transformation into the 21st century. True,there are faults. The wiring on the switch is dangerous and unacceptible but some of the other issues raised vary from important to petty. There is a draught through some of the windows but the rooms are warm (we have stayed on every floor). The TV's are not the most modern, some of the tiles are cracked and some of the furnishings need replacing. None of this affected my stay. We find the hotel acceptible. The food (on the whole) is good - although it WAS better in 2009 when it was excellent. The manager is certainly not dishonest nor in my opinion rude. Indeed the family Seiwald and their staff are very accomodating with many staff retained year on year. The sports facility over the road is first class as are the swimming pool, sauna and steam room on the lower floor. The bar and restaurant will be refurbished when the renovation takes place in the summer of 2010. I have to say we WERE dissapointed that the renovations had not been completed as planned in 2009 but in the current economic climate the delay is perhaps understandable.", "title": "Value for money", "helpfulness": 1, "user": "bradthebrewer", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 54989631}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "As to the comment about the stables and manure... they are there, but well over 100 meters away and certainly not an issue. Try to keep criticism within the bounds of credibility eh?", "title": "perfect family hotel", "user": "SarahW35", "date": "January 31, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 54826462}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Second visit to Siewald Hotel. Very quiet and relaxing traditional hotel 5mins walk to ski school and ski buses to many other ski areas. Staff lovely and very helpful, great food with waitress service every evening. drinks very reasonable priced. wonderful pool for kids to swim while parents relaxed in sunbeds or in sauna / steam room. definately book again for next year!!!!! looking forward to proposed refurbishment !!!", "title": "Wonderful family run hotel-Definetly worth a visit!", "helpfulness": 1, "user": "gnftr66", "date": "January 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54669022}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Sarah Williams Somerset", "title": "What a Dump", "helpfulness": 2, "user": "DarlingtonDave_10", "date": "January 17, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 53691303}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We stayed at the Hotel Seiwald Jan 16-23. We booked our trip through Tyrolian Tours, which I would highly recommend. We stayed in rooms 302&303 as we are a family of 5. The rooms were quite large and comfortable, but a little dated. However, I wouldn't worry about that as the hotel is about to undergo a major renovation to be completed by this summer. I am sure the renovations will make this hotel even more comfortable and attractive.", "title": "THE WORST HOTEL EVER !!!!!", "helpfulness": 1, "user": "SouthportSpark", "date": "January 16, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 53606441}], "location": {"country": "Austria", "region": "Austrian Alps", "continent": "Europe"}, "stars": 4, "variance": {"poor": 0, "average": 2, "very good": 10, "terrible": 2, "excellent": 18}, "slim_ranking": 0.0833333333333}