{"user_rating": 4.5, "review_count": 636, "name": "Hotel Duquesa de Cardona", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "In the heat of Barcelona and the noise of the bustling city, this lovely little hotel was pure heaven, set right on the front of Port Vell, only 10 minutes from the beach, Las Ramblas and the Barri Gottic district, you really couldn't wish for a better location.", "title": "Barcelona Gem", "helpfulness": 2, "user": "Anna1410", "date": "August 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5625679, "likes": {"liked": "— Friendliness", "disliked": "— Outside Noise (Not Soundproofed)"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This is an amazing hotel in the centre of Barcelona. It is on the edge of the old town and has an amazing terrace with a great view over the marina and port. The pool is rather small a bit like a large bath rather than a swimming pool, but there are tables and chairs together with loungers, although as it was November we did not use them.", "title": "A wonderful hotel", "helpfulness": 2, "user": "hywel", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6082634, "likes": {"liked": "— The great location and friendly staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The rooms are a good size and air conditioned if it gets too hot. We were lucky to have a room with a view over the Passeig de Colom, which we did not find too noisy unlike some other reviewers. The en suite bathrooms are large and the shower was very good.", "title": "Chicagoans happy w/Duquesa", "user": "Chicagobdaygal", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5974958, "likes": {"liked": "— Promt service", "disliked": "— Lack of closet space and shower head"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The breakfast was included in our room booking (14 Euros usually) and was a continental buffet style. We thought that it was a good selection with cold meats, cheeses, bread, fresh fruit, freshly squeezed fruit juices, various pastries and some traditional Spanish touches as well.", "title": "Enjoyable stay.", "helpfulness": 2, "user": "Kayla_0001", "date": "October 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5967806, "likes": {"liked": "— Cleanliness", "disliked": "— Television"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The best feature however was the friendly staff. They could not do enough for you. An another touch that was a first for us was a card that they sent round the night before telling you what the weather forecast for the next day was meant to be, tehy even gave you a choice of air freshener that the housekeeping staff could offer.", "title": "Mixed experience if you are American.", "helpfulness": 3, "user": "Count of Monte Crisco", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 5960061, "likes": {"liked": "— Great location and bathroom.", "disliked": "— Noisy and small."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We have already recommended this hotel several times and have only been back two days!", "title": "Not as good as we hoped", "helpfulness": 3, "user": "Audri", "date": "September 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5763191, "likes": {"liked": "— The location", "disliked": "— The communal facilities"}}, {"rating": 5.0, "title": "Wonderful hotel with wonderful staff", "text": "My husband and I have just returned from Barcelona after staying at this hotel for 4 nights. On arrival at the hotel our room (number 43 following recommendations on this site) was not ready as we had arrived early. The receptionist was incredibly helpful and friendly and arranged for Mario (concierge) to place our bags in storage until our room was ready. The receptionist then asked if we would like to have a coffee at the hotel or if we would like to take a wander. After deciding the latter he then gave us a map and showed us where we could get a coffee locally and also pointed out some of the other sights within close proximity. On return to the hotel we were taken to our room by Mario who carried our bags and when we entered the room found that there were flowers and chocolates waiting (arranged by my husband and the travel agent) and a bottle of wine courtesy of our travel agent. I have since found out that this was very difficult to organise but the hotel did all they could to help. On our first night 2 cards were put through our door; 1 with a Good Night note and a weather forecast for the following day and 1 with a menu for you to select a fragrance for your room the following day! Oh and 2 chocolates as well! They even have a pillow menu by the bed where you can choose your type of pillow. Everything else about the hotel was wonderful, a great selection at breakfast and everything was replenished regularly (contrary to other reviews on this site), rooms were clean and stylishly decorated. The hotel is well positioned for everything in the city if you want to escape the hustle and bustle. Numerous restaurants are well witihin a short walking distance. The hotel does reccomend one restaurant", "helpfulness": 6, "user": "Supercalfragalistic", "date": "February 12, 2007", "id": 6781783}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "'Agut' which we did not like and would favour El Salon much more highly. Also there is a great tapas bar just round the corner for lunch called Carabello offers 'Champagn' (Cava) and Tapas stood up at the bar like the locals. Plates of succulent Octopus in paprika and fried pimientos (peppers) and 5 glasses of cava came to only 15 euros! One thing worth noting is that the drinks on La Ramblas are very expensive - be warned!!", "title": "Excellent location", "helpfulness": 5, "user": "rhldevon", "date": "February 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6781750, "likes": {"liked": "— Location", "disliked": "— Traffic noise"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "On our last day Mario again looked after our bags whilst we ambled around the city and then on our return waited outside for us to hail a taxi to take us to the airport. I would recommend this hotel to anyone! Not sure if room 43 is any better than any other but definately ask for a Harbour Room view. On the first floor you get a larger balcony but you are closer to street level and as such may be subject to higher noise levels. Overall, a wonderful experience that even the most discerning of traveller will struggle to criticise.", "title": "Fabulous", "helpfulness": 1, "user": "mn3", "date": "December 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6470348}, {"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "The Hotel Duquesa de Cardona is a C19 building on the palm-fronted waterfront boulevard overlooking the yacht marina near the heart of the Gothic centre of Barcelona. Well situated near the port , but on a busy road with some noise from the traffic.", "title": "Fantastic Staff, Great Location", "user": "ejan", "date": "December 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6348746}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Our room was on the front with a balcony overlooking the marina. It was quite small but comfortable and well appointed.", "title": "great stay in duquesa de cardona", "user": "holidayreviews", "date": "November 26, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6175557, "likes": {"liked": "— view from room", "disliked": "— nothing"}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 17, "average": 36, "very good": 211, "terrible": 11, "excellent": 361}, "aka": "Duquesa De Cardona Barcelona", "slim_ranking": 0.0325047801147, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Exclusive boutique historic hotel in front of the port of Barcelona, and just 3 minutes walk to Ramblas, Gothic quarter. Unbeatable location for visitors interested on the heart of the historic center and cruise passengers .On the sixth floor Hotel Duquesa de Cardona Barcelona offers an unforgetable view over the harbour of the city, with a plunge pool, asolarium and a all year open-air cocktail .The buffet breakfast restaurant on the ground floor is the former entrance of this palace of the 19th century , and introduce us to the fantastic history of this mediterranean city."}