{"user_rating": 2.5, "review_count": 200, "name": "Hotel Palacio Valderrabanos", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed at the Palacio Valderrabanos for several nights and had a very pleasant experience. The room was large, clean and comfortable with a minibar. The staff was very pleasant and exceptionally friendly. Breakfast was good and wife raved about the coffee. The hotel's location right across the from the cathedral and near one of the access stairs for walking the walls was also great. In a more general sense not only did we like Avila, but we found the town to be a good central location for day trips to Segovia, Salamanca and other sights in the region. The Palacio became a great base camp after long days driving and touring. Some have commented on the state of the decor. We found the hotel quite nice, they were in the process of repainting the lobby and halls while we were there. The only issue we encountered as summer visitors was the air conditioning in our room. At full blast you could almost feel a slight breeze of air that was marginally cooler than the rest of the room. While the staff couldn't do anything about the AC itself they did provide us with a fan that made the room acceptable. The hotel also has only very limited parking in a sort of stable like area at the back. Nice and secure behind a locked gate (you get the key at the front desk), but tight spaces and only a few available on a first come first served basis (though once you've got a space, it's yours for the rest of your stay so you don't have to worry about hitting the road and not having any place to come back to). Also the narrow maze of streets in the walled part of town can be a bit confusing the first time you try to drive to the hotel. One missed turn and we got a bit lost. Fortunately, the old town is relatively small so it wasn't too hard to go outside the walls and then drive back in again and find our way. A hint is check the Do Not Enter street signs for exceptions for residents and hotel guests. There is an underground pay lot just outside the city walls that's only a short walk from the hotel if the hotel's parking is full.", "title": "An enjoyable stay", "helpfulness": 2, "user": "arcoonetoe", "date": "September 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5763922, "likes": {"liked": "— Location, pleasant staff", "disliked": "— Air conditioning"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "Overall it was an enjoyable stay and we'd happily stay there again.", "title": "Wonderful location but ...", "helpfulness": 4, "user": "Travel organiser", "date": "April 21, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "service": 3.0}, "id": 4993945}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "the faded grandeur mentioned in other reviews is now downright shabby and all the rooms have a neglected air. There was a smell of bad drains filling our room and this was not rectified up to the time of leaving. Air conditioning was poor and when the window was opened to let in air we discovered that our rooms were above the main air conditioning unit which was very noisy. Staff service was adequate. Restaurant was empty, but quite good value if you stuck to the menu del dia. Would love to stay there again - after it has undergone a much needed refurbishment. Avila, however, is perfect!", "title": "Great location, good value", "helpfulness": 3, "user": "lgalvin", "date": "February 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4469423}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "The hotel is right next to the cathedral, the location could not be better. The front desk staff were friendly and helpful. The decor is amusing, with suits of armor. The room was clean, comfortable, quiet. The marble bathroom was very nice, with a hair dryer. The balcony was spacious. A minibar choice was non-alcohol beer, a good variety.", "title": "Below expectations", "helpfulness": 4, "user": "aussieblues", "date": "July 9, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 3650652}, {"rating": 4.0, "title": "Faded grandeur", "text": "This hotel was disappointing for us given the high popularity rating on Tripadvisor. The rooms were dark and looked like they really needed some renovation. If you are driving, do phone ahead to book a car park lot. We didn't and the staff was rude and didn't even bother to give us proper instructions on where to park our car to unload our luggage. The hairdryer looked really pathetic too. The only good thing about this hotel is its location which is right outside the catedral. I wouldn't recommend staying at this hotel despite the location. There are other hotels nearby which looked better.", "helpfulness": 3, "user": "VisitorsfromYork", "date": "April 18, 2005", "id": 3372956}], "location": {"country": "Spain", "region": "Castile and Leon", "continent": "Europe"}, "stars": 4, "variance": {"poor": 46, "average": 44, "very good": 49, "terrible": 47, "excellent": 14}, "aka": "Palacio Valderrabanos Avila", "slim_ranking": 0.766666666667, "description": "Historical palace from XIV century; converted to a cozy, modern hotel maintaining its historical heritage in decoration/ambiance."}