{"user_rating": 4.5, "review_count": 293, "name": "Hotel Welcome", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We loved staying here & would definitely recommend this town & hotel to anyone who was interested in the French Riviera. It is perfectly located, a 10 minute train ride to Nice, a bit longer train ride to Monaco. We had a great meal at a local restaurant 1 night, and got food at the outdoor market in Nice the 2nd day which we ate on our balcony while watching the activity below. It was perfect.", "title": "Small French Riviera", "helpfulness": 2, "user": "EmilyBill", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129893167}, {"rating": 5.0, "title": "Best view ever. Every room!", "text": "This is mt second night here... Oh my goodness... What an absolutely beautiful little village on the side do a hill... Room 55!!! Overlooks the harbor. I am listening to the sound of the water lapping alongside the sailboats. Today climbed the steps and took pictures of all the interesting doors along the tiny streets... More beautiful than I imagined. PACK LIGHT... The walk uphill from the train station is a killer with heavy luggage. Mine is about 40 lbs total and it was hard!!!", "helpfulness": 2, "user": "bfrancisdesign", "date": "April 27, 2012", "id": 128945227}, {"rating": 4.0, "title": "Best location, best hotel", "text": "this is the place to stay. Recommended by Rick Steve's consultant. Absolutely worth the expense! bed is FABULOUS. Magnifying mirror. fresh linens. view. View. view!!!!", "helpfulness": 2, "user": "Steve B", "date": "April 19, 2012", "id": 128149433}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed one night after stumbling across this hotel. Awesome waterfront location, surrounded by small restaurants and shops keeping within the character of the village. Hotel offered very professional service, multi lingual professional and helpful staff, rooms have fantastic views over the harbour. Rooms are small which reflects the age of the hotel but fairly well appointed. Airconditioning didn't appear to be effective but fully opening balcony windows alleviated that problem but could be an issue in summer.", "title": "Perfect hotel on perfect french harbor", "helpfulness": 2, "user": "mbsplaine", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127546272}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Villefranche- sur- mer is a terrific small town just east of Nice. The haborside in the lower town is picture perfect. The Hotel Welcome with its rooms overlooking the quai are comfortable, light airy, fairly large with balconies for reading, sunning, drinking coffee or just watching the ever changing harbor scene. The staff is bilingual and professional. Excellent restaurants and cafes just outside the front door yet no late night noise other than the lapping of the waves. Stay there and take the bus into Nice (10-15 minutes) avoiding the bustle and hustle of Nice.", "title": "Dreams are made of this!", "helpfulness": 2, "user": "BIGDAYOUT_11", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126768724}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "I recently stayed at the Welcome with my mum for a fw days following some surgery to recouperate. Mum had been to the area a couple of weeks before and thought it cute....I originally booked one superior twin room for us both but on arrival had to change this to two rooms since they were rather small. Thankfully Olivier the hotel manager gave us a pretty decent discount on the two rooms so it didn't hurt the pocket quite as much as we thought.", "title": "Great base for a short stay", "helpfulness": 1, "user": "mrjohnsondog", "date": "October 21, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 21060172, "likes": {"liked": "— location", "disliked": "— being charged extra for breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Rooms;", "title": "Felt very welcomed by Hotel Welcome", "user": "prestonk", "date": "October 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20919669, "likes": {"liked": "— The nice rooms and the town itself", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Small, clean and as you'd expect for 3star France but the front facing aspect is really lovely. Nothing quite compares to watching a sunrise / sunset whilst sipping coffee/wine; we had rooms 23 and 44.", "title": "Loved the Hotel Welcome", "helpfulness": 1, "user": "Ozduo", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20681660, "likes": {"liked": "— The balcony overlooking the bay", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Breakfast", "title": "Superb location, good hotel", "user": "Berry J", "date": "October 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 20679693, "likes": {"liked": "— The views.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "What a shame they have to charge extra for this and not just include it in the price of the stay since everybody seems to go to the little restaurant up the road (100 yards left out of the hotel) for a French breakfast for 6euros....). The breakfast in the Welcome was in fact very good for 13euros extra each but still....they'd be better including this and creating a better morning feel instead of everybody leaving the breakfast room en-masse to avoid the overcharging", "title": "Loved this Hotel", "user": "trishNJ", "date": "September 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20424446, "likes": {"liked": "— location", "disliked": "— the unfortunate construction."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The hotel welcome sits right on the water's edge in Villefranche-sur-Mer. Although I do not know what year it was built, it's part of the vielle ville, the old city, and it has been part of the old city for decades. The hotel has charm and the location is perfect. My room was small, but very comfortable, with a fantastic view and balcony. The bed was wonderful. The service was outstanding, and although I initially thought it was a bit expensive, I believe it had excellent value. I would stay there again in a heartbeat. It's easy to walk anywhere in VilleFranche from the Hotel Welcome. I look forward to returning again the next time I'm visiting the Cote d'Azur.", "title": "Delightful with extraordinary views", "helpfulness": 1, "user": "ORTinaB", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132984592}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This hotel has great service and top notch location. However, it is a bit pricey for what it is. Also, if you drive, be prepared to dish out a great deal for parking in this town.", "title": "Pricey, but good location", "helpfulness": 1, "user": "johannam_collier", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 132443914}, {"rating": 5.0, "title": "Best place to stay for visits to Nice or Monaco", "text": "I have attended a conference in Nice in June every couple of years for the past 20 years. A few years ago I started trying accommodation in places outside Nice cheaper motivated by price and surroundings. This time I found the perfect place – Welcome hotel in Villefranche. It takes less than 25 minutes to get to the Acropolis convention centre from this hotel walking and using the train. All rooms have a spectacular view over the harbour. The staff were wonderful in every way, the bed was comfortable, and the pillows were much better than the average French hotel. Hotel is very quiet and sitting on the balcony and watching the sun rise in the morning was fantastic. The village has several reasonable restaurants and the accessibility to Monte Carlo is brilliant. I did not try breakfast. Thoroughly recommend it – the best accommodation I have found for attending a conference at the Acropolis.", "helpfulness": 3, "user": "mjedavis", "date": "June 15, 2012", "id": 132029000}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel is an institution in Villefranche – the list of celebrities who have frequented this unassuming little hotel over the years is long and impressive. What’s so appealing about this place is that it's NOT a ‘designer’ hotel or part of a chain, which invariably are completely devoid of personality. The location couldn’t be better - right on the waters edge; the rooms themselves are pleasant and the views of course, extraordinary. What else we love - the warm and ‘welcoming’ staff. One of our favourite spots in all of Villefranche is the hotel’s wonderful bar. We have enjoyed many an evening sipping an excellent glass of wine and watching the world go by. Whether indoors or out, it is the best place in Villefranche to sit and enjoy a drink. The bar is run by the extremely stylish Dominic – always elegant, always charming. Dominic sets the tone; his team are equally outstanding – Laetitia and Amandine – as lovely as their names suggest. Service with personality is not always served up well in the South of France – but here at the ‘Welcome’ you will get it in spades – see for yourself.", "title": "Service with personality & always a warm 'welcome'", "helpfulness": 5, "user": "SebastianFleming", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131815119}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Great choice and would stay here again - easily accessible to Nice (and you can drive or take a train to Monaco). It was easy to book; you pay half in advance and the remainder when you depart. The room we chose had a balcony; the room was small, but we didn't stay there but to sleep. There is a nice lounge area (in the bar section) with windows overlooking the water. Here, the waiters and waitresses are wonderful - very attentive and personable. You will learn their names; I'm so upset with myself not not writing them down because I wanted to mention them on Trip Advisor!!! (If you rent a car, parking is a slight issue. But, there is a paid area down the street that we located that is doable for about 29 euro per day.)", "title": "Nice hotel, great view, great service in the bar", "helpfulness": 2, "user": "LSUProfandFan", "date": "June 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131703732}, {"rating": 5.0, "title": "Decent people", "text": "Unfortunately I had to cancel my reservation. The full amount was credited without any discussion. Kuddos. I'll be back.", "helpfulness": 4, "user": "JosBurger", "date": "July 17, 2012", "id": 134599179}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This hotel is very special. It is located right on the waterfront in the quaint village of Villefranche-sur-Mer. Your room has a view over the beautiful harbour and on to Cap Ferrat where you can watch the luxury yachts sail in or the latest group from the multiple cruise ships temporarily moored in the harbour. As well you can look down on the busy street life around the many restaurants along the waterfront.", "title": "Idyllic Location - Wonderful Experience", "helpfulness": 2, "user": "David H", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134198008}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "For us as a family of 4 travelling it was expensive as they have no family rooms but we did get a 15% discount for being a family in 2 rooms. It was no doubt absolutely worth the expense.", "title": "VilleFranche Relaxation", "user": "Trailfindme", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134170166}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The rooms reflect the history and age of this great hotel but have been updated to provide modern amenities, certainly nothing like the homogenised product found in most chain hotels around the world. My one gripe was that in end rooms we had i intermittent free wi fi which is simply a product of signa strength at one end of the building. I suppose in a beautiful spot such as this I should really consider that as a blessing because you should simply relax and enjoy what is in front of you.", "title": "Its all about the views and balcony - they are spectacular", "helpfulness": 2, "user": "julesabc", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133997202}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "One high point is the staff who are life time locals who provide a formal but excellent service, they actually remember your name and greet you or farewell you each time you enter the building. In addition they were always helpful in guiding us on activities places to eat etc.", "title": "A gem on the Riviera", "helpfulness": 3, "user": "Travelster021", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133015089}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We loved the view from our balcony and the hotel was really nice too. What made it more special was the wonderful staff. Bruno was very helpful and friendly and so were the two ladies at the front desk. They helped us get everything we needed to make our holiday a really memorable one. We would recommend this hotel in a heartbeat.", "title": "A wonderful experience at the Hotel Welcome", "user": "NJtraveller66", "date": "August 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19066619, "likes": {"liked": "— view and friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "A really good experience. Just as you would want it to be. Charming staff and great service. We stayed in May but back in July with family for a beach holiday staying elsewhere self catering.", "title": "A Great Hotel", "helpfulness": 1, "user": "SirGeorge61", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18390978}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "A few tips about Villefranche. Beaches and town get very crowded when the cruise ships arrive which is most days. The restaurants need to be treated with caution as many exist just to pick uo the undiscriminating Cruise trade. All time low - the Loco Loco which serves insultingly poor food and to be avoided at all costs. At the other end of the scale La Serre which is friendly and probably the best value in town. Cosmo bar is bustling and serves good food in a great location at reasonable prices.", "title": "Hotel Welcome Nice but Better Value available elsewhere.", "helpfulness": 3, "user": "Fusionco", "date": "July 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 18118984}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "All shops in Villefranche are very expensive including the various food shops but this is about par for the area. The market on Saturday is quite scanty with very little food available and more expensive than the shops.", "title": "Lovely Hotel with Splendid Location", "user": "Lulusmum", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17125369, "likes": {"liked": "— The views and the staff. The room was a good size.", "disliked": "— The noise from the building works across the street."}}, {"rating": 5.0, "title": "Beautiful Villefranch sur mer", "text": "Conclusion: A beautiful little town trying to cope with the onslaught of cruise tourism.", "helpfulness": 2, "user": "juliaSanAntonioTx", "date": "May 15, 2008", "id": 16055983}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We carefully picked this hotel because of the picturesque town and the hotel location, we were not disappointed. The room was everything we wanted, large, clean, tidy and comfortable. Our large balcony enjoyed a view over the ever busy harbour, never a dull moment. The whole hotel was clean and well looked after. The staff were very knowledgeable, helpful and courteous. A simple breakfast is served on the covered terrace in the front of the hotel until 10.15. Sadly the bar is not open during the day at all, but opens late afternoon until late. Loads of restaurants of different sorts and price ranges to choose from nearby.", "title": "Brilliant", "helpfulness": 2, "user": "peebee43", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20370778, "likes": {"liked": "— Location, Location, Location", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The railway to Nice or Monaco is a 10 min stroll away along the quay or there is a small bus up the hill to Nice, just 1Euro", "title": "hotel", "helpfulness": 1, "user": "Irina_08", "date": "September 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 20340442}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This hotel with good location but overrate.", "title": "Very Happy with Hotel Welcome", "user": "TorontoVacationLover", "date": "September 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20246807, "likes": {"liked": "— Location and extremely friendly staff", "disliked": "— Limited closet space"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "And we had a very stange and situation Saturday night.", "title": "Good Quality Hotel", "user": "Relton14", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 19766178}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "We had a reservation already paid but we couldn't receive our room during 2 days without extra charges. This situation could mar our pleasure to stay at that great place with exelent beaches.", "title": "Perfect location", "user": "rosysbird", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 19433834, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Wonderful location on the beach front and very helpful staff. Did not eat here so cannot comment on the food. Main issue is security, our room safe was broken and one morning we walked into the concierge got our key from the pigeon hole( no staff present) and got into our room with no one checking on us. The room key is very heavy and so deters from carrying it around.( has like a lead weight attached to it).", "title": "Great location but security poor", "helpfulness": 1, "user": "Andrewb000", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131454920}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Hotel staff very welcoming and helpful 10/10, breakfast was okay, limited selection of pastries. Great view from our room over the harbour if a little small to what we are used to for this sort of money.", "title": "Great experience", "helpfulness": 1, "user": "David P", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 131220744}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We have stayed twice at this hotel and loved it both times. It is located in the most wonderful position in Villefranche, right on the sea front with balconies overlooking the harbour. Very romantic, and with a whole stretch of wonderful seafood etc restaurants right next door. Management will do their best to make your stay a good one, for example on our second visit by looking up the room we had the year before and allocating that to us. Breakfast is lovely, with the usual continental offerings to be taken sitting at tables almost on the harbour front outside. V good armagnacs for the evening!", "title": "Favourite place to stay on Riviera", "helpfulness": 2, "user": "mjt54", "date": "May 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130903384}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Juat returned. Loved it. The rooms are lovely with balconies overlooking harbor. I hope to return. Would recommend this hotel. Had dinner at cosmos next door which was fantastic. Try the veggie appetizer (tomatoes, mozzarella, artichoke ect..) there is a little bakery on the street behind the hotel. Pastries, bread great prices and heavenly. There is also a little grocery store in that same street near the bakery. Recommend buying pastries, bread and wine and enjoying these on your balcony. Saves some money and is so tasty!", "title": "Beautiful romantic hotel in quiet village", "helpfulness": 3, "user": "charlestonmel", "date": "May 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130105833}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Wow, we really had the perfect spot for an amazing stay on the French Riveria! This charming hotel was perfectly situated between Monaco and Nice, terrific staff, great breakfast in the morning on the balcony, visited by a morning dove nibbling on our croissant, a wine bar in the evening, full of charm and a great spot for harbor view and people watching. Our room was very comfortable, a comfortable bed, perfect terry robe for balcony wear, we couldn't have asked for anything more, a real gem! We took way too many photographs!", "title": "Perfect view, perfect location overlooking the harbor", "helpfulness": 2, "user": "Maryrichard", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130014162}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife and I have just returned from a short break at the Welcome which was a fantastic experience. The Hotel has a fantastic location and our room on the 3rd floor had 2 balconies one to the side and one overlooking the sea at the front. The front desk lady receptionist was very friendly and the 2 guys in the \"wine pier\" at the Hotel were first class and great fun!", "title": "Hotel Welcome is just that!", "helpfulness": 2, "user": "kdp", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 15697469, "likes": {"liked": "— Location, rooms, friendly staff, views and wine pier.", "disliked": "— having to leave!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Breakfast on the balcony as the sun rose was a highlight as was a bottle of Provence Rose before dinner on the balcony watching the fishing boats and life in general from this great vantage point.", "title": "Welcomed in quiet town in late September", "helpfulness": 1, "user": "bluejoy", "date": "April 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15086090, "likes": {"liked": "— Location, view, quiet room and town was charming", "disliked": "— Nothing - weather & trains are not in control of the hotel and its staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We have stayed in some great Hotels before but this has to be our favourite to date. Can also recommend Michels restaurant on the sqaure which we have eat at before which was very good and good value.", "title": "Wow! Absolutely wonderful!", "helpfulness": 3, "user": "Southern_Land_Shark", "date": "April 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15032617, "likes": {"liked": "— Of course the view from the room ... also, the staff were very helpful", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "Villefranche is also a great venue and very unspolit compared with other such ideal locations in the Med from our experience.", "title": "Wonderful hotel, great location!", "user": "miller041", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14149913}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Keith and Jane Pooley", "title": "The best place to stay in Villefranche-Sur-Mer", "helpfulness": 3, "user": "jvtravelerParis", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11925864, "likes": {"liked": "— Location and quality of service", "disliked": "— Lack of WiFi, pricey breakfast / bar"}}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 4, "variance": {"poor": 5, "average": 21, "very good": 82, "terrible": 2, "excellent": 183}, "aka": "Welcome Hotel Villefranche Sur Mer", "slim_ranking": 0.769230769231, "description": "Ideally located between nice and monte carlo, its 35 air-conditioned rooms overlooking the bay and cap ferrat since december 2002, all our rooms or suites have a balcony with sea view. They are equipped with a safe, a tv, a minibar, a hairdryer, direct dial telephone and free wireless access (beach towels on request)."}