{"user_rating": 3.5, "review_count": 514, "name": "Hotel Valadier", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2011", "text": "Recently spent 5 nights here and overall liked the property. The look of the commons areas was very sleek and Art Deco. It was not a bargain stay, but I think their prices fluctuate wildly depending on season, and the rates do include complete breakfast. Breakfast included cappuccino (or whatever coffee you want), canned-style fruit, several fruit juices, few fresh fruits, couple dry cereals, scrambled eggs, scary bacon, hot-dog-like sausages, fresh pastries/donuts, cold cuts/cheese and rolls, yogurt. So fill up on breakfast for your Rome trekking. Our room for 2 was very small, but expected for Europe. The 2 twin beds were pushed together, but made up separately. Window overlooking the \"alley\" (street) the hotel is located on so could gauge weather before leaving. My first shower there, the water was barely warm. Told the front desk and we didn't have that problem again. Our sink had a drainage problem but we made our own solution. The toilet had problems fully flushing, which caused a slight odor. Nice full wardrobe to store clothes/shoes. Confusing SkyTV system, which didn't have great news channels and was difficult to navigate. Didn't find that many affordable restaurants nearby, at least not as many as Piazza Navona area, where I would stay next time. This hotel located right at Piazza Popolo, and walking distance to Trevi, 7 min to Spanish Steps, can walk to lots else too, depending on how much you like to walk. Room was nice and warm which was great since weather was cold during our visit.", "title": "Nice hotel in good location with good breakfast", "helpfulness": 1, "user": "steptravel", "date": "March 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 98659917}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The hotel was very nice. It was not that long of a walk from the Colosseum, the Vatican, this hotel was also by a street that had a ton of shopping by it that wasn't badly priced. It was also located by a good bit of restaurants. If you want to see all the main historical things like the castle, the Vatican, the Colosseum, the Trevi Fountain, the Basilica, the Sistine Chapel, this was a nice hotel to stay at, a good location. The staff was pretty friendly as well, and the rooms were clean. They were on the small side as well as the bathroom but thats to be expected in Europe.", "title": "Very nice hotel.", "user": "K_Turner217", "date": "January 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 94893567}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Through the North End of Rome we had the pleasure of staying at this beautiful establishment. I would personally like to thank all the hotel staff and workers for their amazing service while my wife and I spent Christmas there from San Diego, CA.", "title": "Perfect Roman Hotel. Great Location, Great Service, and Fun Lobby Bar.", "user": "Chic2SD", "date": "December 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91182488}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We walked in and were quickly greeted with bag service, bonus right there! Juliette who checked us in, was a great help for us throughout our trip as well. Tucked between two main streets and a huge Piazza was our hotel.", "title": "Great location, clean and modern but still with charm", "helpfulness": 1, "user": "BigCityTraveler", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 89120516}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Sidenote: the best pizza and pasta place we had in Roma was right next to this hotel. We shared a slice on Christmas Eve with Alec Baldwin there. Also, went back again and had some amazing Tortellini. At this point I will let you find your own Pizzeria. But if you want to take my word on this: Head to Babuino, take a right, and it's the first pizzeria on the right. I believe next to an art Studio. About 50 steps from the front.", "title": "First Time in Rome", "user": "nephwop", "date": "November 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 88620375}, {"rating": 3.0, "title": "Could be better", "text": "Nice location on the northern piece of Rome. I was about a half hour walk to the coloseum, 20 minutes to the Trevi Fountain. (for mid 20 year olds). SMALL rooms, even for Rome. Hotel needed an update, ie new beds (those were HARD AS A ROCK) and updated decor. Bathroom was actually large compared to the rest of the room. Full size shower. Small restaurante / lounge on premises.", "user": "LeanneM2", "date": "June 17, 2010", "id": 67844827}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "After a snafu at check-in, which was fixed immediately, we had a lovely stay. We asked for a room change after the first night due to street noise and very loud amorous neighbors; rooms are not very sound proof. Next room was perfect! Conveniently located within walk of most places. We did not take a cab or bus while in Rome - took hotel car to airport. Lots of great places to eat on Della Croce (up Del Corso about 8 blocks or so on left). We will definitely go back to Rome! A wonderful city full of history, great food and great shopping.", "title": "Nice Hotel", "helpfulness": 1, "user": "Virginia20170", "date": "June 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 66766372}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Overall a very good hotel.", "title": "Impressive hotel with ideal location. Highly recommended.", "user": "sunbl0ck", "date": "May 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65241971}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Very near the piazza di Popolo and the Flaminio metro station.", "title": "You dont always get what you pay for...but hey ! That's Rome !!", "helpfulness": 1, "user": "Nick05", "date": "May 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 64107056}, {"rating": 4.0, "title": "Hi Res Restaurant was Good", "text": "Clean, with impressive luxurious design. Marble everywhere.", "user": "NJ-Eric", "date": "May 13, 2010", "id": 64045575}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "It was a compact room (slightly masculine) but was clean and modern.", "title": "Great Location", "user": "Khayalake", "date": "August 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 74499296}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The restaurant is worth eating at, even at the price, although I was dissapointed with a €15 cocktail that was served with a slightly dishevelled strawberry on the rim as garnish. Sorry, but I'm a stickler for the \"nice touch\" when paying that for a drink after a days worth of walking! Food was great. Our 5th floor room was slightly noisy as well as we were directly below the terrace restaurant, lots of sliding chairs etc. I would go here again, purely for simplicity and location's sake. It's in a great area of Rome.", "title": "Great for 3", "user": "PAG89", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 72206138}, {"rating": 4.0, "title": "HI-Res roof top restaurant well equipped for rain!", "text": "Had a triple and our teen had her own enclave room...really great for some peace and quiet, great location near metro, shopping...staff very accomodating...lots of mirrors which is a big over the top but overall great value and great place. The air conditioner was not too cool but tolerable", "user": "pindawal", "date": "June 30, 2010", "id": 69203673}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "Large roof top restaurant with a retractable roof which we needed because of rain. There is nothing notable to the view except for other roof top restaurants, homes and domes so if you are looking for a restaurant with views of something specific then there are better choices out there. Wait staff was attentive, good wine menu and English menus. The mango/apple/walnut salad came with no dressing. The crispy wonton chicken salad was delicious. The waiter graciouly returned our Danish prime beef for more cooking and the mussels and the sea bream were excellent. Unfortunately, all the pasta dishes included some kind of fish.", "title": "Good location, okay hotel", "user": "Sunny77777", "date": "June 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 68488983}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The Valadier hotel is in a great spot in central Rome - a short walk to the Spanish steps and Trevei fountain. It's surrounded, as one would expect in the area, by a multitude of restaurants and shops. However, I had been expecting a bit more.", "title": "Hotel Valadier is the perfect location for access to everything", "user": "coupleanddaughter", "date": "June 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 67905985}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Very chic hotel ,beautiful décor ,beautiful rooms ,comfortable beds ,nice atmosphere and very clean.Granite and marble everywhere ,I would rate this hotel luxurious.Central location.My husband and I went twice to the Hi-Res restaurant it's a bit pricey but it's worth every penny,the food is exquisite ,very refined.I recommend it.If you want to have some thing reasonable and and excellent food you can go to Brillo Parlante it's just next door.if i return to Rome again ,i will return to this hotel.", "title": "Exeptionel", "user": "natasha47", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85403408}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This Hotel was absolutely awful, the rooms we were given were tiny, one room was on the ground floor and the window looked out onto the pavement. The showers were disgusting, old, dirty, and tiny. The bedrooms ceilings have mirrors which makes you feel as if you are in a pornographic movie . The lounge, was dark and dingy and we all felt quiet depressed sitting in it, Apart from the position , which is good for central Rome, I would not recommend thus hotel to anyone.", "title": "absolutely awful", "helpfulness": 1, "user": "lolberg", "date": "October 6, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 82260093}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The location is great and the staff was friendly, but I've never been in a hotel with that much noise. Plus, the room we had was just big enough to fit the bed. I've seen bigger rooms on cruise ships. The 70's porn decor was very interesting though. I've never slept in a room with mirrors on all 4 walls and 1 on the ceiling. Not worth the price at all. The bar on the rooftop has a great view, but be prepared to pay double the price for your drinks.", "title": "The most noise I've ever heard in a hotel", "helpfulness": 1, "user": "bginty", "date": "September 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 81609106}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I travelled with my sister and adult nephew. We had booked a triple room and we found that the room was a small apartmente where I could sleep with my nephew and my sister in the other room.", "title": "Over my expectations", "user": "AriBsAs", "date": "September 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79638720}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Yes, the space is very small but enough for Rome and where you only will sleep in such an amazing city. The beds are comfortable. Our room was quiet, in the 5th floor and full of light. Breakfast is superb, Didn't even have to have lunch!", "title": "Great location, but rooms are small, dark and noisy", "user": "iTraveling", "date": "September 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 79295702}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 50, "average": 75, "very good": 194, "terrible": 38, "excellent": 157}, "aka": "Valadier Hotel Rome", "slim_ranking": 0.255520504732, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "Set in the historic heart of Rome, behind Piazza del Popolo and at a stone's throw from Piazza di Spagna, the Hotel Valadier is a charming intimate and refined 4-star hotel. The Hotel occupies an ancient Roman palazzo and has undergone recent major refurbishment to provide all the facilities you would expect to find in a modern hotel, albeit not at the expense of its character and period features."}