{"user_rating": 5.0, "review_count": 328, "name": "Hotel Gletschergarten", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This is a totally charming hotel in a beautiful Swiss mountain town. The hotel is great, the room was large, and our balcony had a picture perfect view of the snow capped Eiger Mountain. To make it even better, the family (the fourth generation) were very friendly and helpful. An excellent place to stay, and a great restaurant as well.", "title": "Excellent Hotel, Great People", "user": "Mondak", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8661307, "likes": {"liked": "— The people running it (and of course the view and location)", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We've stayed at the Hotel Gletschergarten twice in the last 8 years and it has lost none of its charm. The rooms are very tasteful and spacious, beds are comfortable, bathrooms completely modern and well-maintained, and the views from the balcony are worth the cost of the room. Also, the staff and owners are always courteous and helpful. The location is toward the end of the hotel/main street area in town which is a blessing. You don't get all of the commotion of staying closer in, yet it's easily close enough to walk anywhere in town. Check out the bakery across the street if you're looking for a cheaper lunch or some nice snacks. All in all, a great place to stay if you don't want to feel like you're in the heart of the commotion but want to have access to everything in town.", "title": "Stayed twice in last 8 years - still wonderful!", "helpfulness": 2, "user": "MountainLoversCt", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8505591, "likes": {"liked": "— Views, quality and spaciousness of room, friendliness of staff.", "disliked": "— If it matters - you have to pay for internet service."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We absolutely loved this charming hotel. The views of the mountains are fantastic. The owners who run the hotel are very nice and helpful. The food and decor was fabulous.We hope to go their again. The city is charming and the food was very good.", "title": "Charming Stay", "helpfulness": 1, "user": "cathyhrb", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8383404, "likes": {"liked": "— swiss chalet and scenery", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "This is a very nice family run traditional Swiss Chalet Hotel. The owner was very helpful, the rooms were spacious and clean, and the location is beautifully set at the foot of the mountains right on the edge of the little town, but not too far out for convenience. We had two rooms for two nights, and enjoyed it tremendously! We would stay here again!", "title": "Traditional Family Swiss Hotel", "helpfulness": 1, "user": "thehappytraveler44", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8014842}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 6, "very good": 45, "terrible": 0, "excellent": 274}, "aka": "Gletschergarten Hotel Grindelwald", "slim_ranking": 0.0243902439024}