{"user_rating": 4.5, "review_count": 99, "name": "Hotel Paraiso del Mar", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Stayed four nights at the hotel, a beautiful old villa converted into a hotel, magnificent sea-view, hosts very friendly and helpful. Actually don't want too much advertisement, as bookings are good and high chance that fully booked when I want to return (definitely look forward to next stay).", "title": "Beautiful Villa with Sea-view converted into Hotel", "helpfulness": 1, "user": "Frequentvoyager", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155494302}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed here for ten days in September in a suite with wonderful views over the gardens to the sea below.", "title": "Excellent place to chill out.", "helpfulness": 2, "user": "Bollybat", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152471623}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Breakfast on the terrace was fine, plenty of fruit, yoghurt and the like.", "title": "Disappointing", "user": "Jane A", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 152326715}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The rooms were very spacious and the hotel was spotlessly clean throughout.", "title": "Still the best location", "helpfulness": 2, "user": "ma s", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152160604}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I would have given this five stars but it is a little tired in places and at 1700 euros for ten days B&B needs a bit of TLC.", "title": "A little gem", "helpfulness": 3, "user": "LincolnshireNed", "date": "September 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141439242}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed here for two nights in August and we are so happy we booked it.It's a boutique hotel and on arrival we were greeted by Enrique the owner who gave us a guided tour of the hotel. He was absolutely wonderful and really hospitable. It's so nice to see such passion for your own establishment and we raved about the hotel to friends and family. We couldn't ask for a better level of customer service from himself and all of the staff at the hotel. We stayed in a suite, room 109 and it was fab with a roof terrace that had amazing views of the coastline and our own place to chill out. It also had a jacuzzi bath in the bathroom and rooftop shower, so you can leave your modesty at home but that's what makes Spain :) There are steps down to Burianna directly from the hotel too. I was getting married in Nerja and had a hair and make up trial on Saturday morning and they let me use their facilities downstairs for it even after check out time. They also presented us with a bottle of champers when we were leaving to check into our apartment for the rest of the week. We almost wished we had just stayed here for the whole duration of the trip. Fantastic hotel and excellent staff. We will certainly stay here again when we go back to Nerja.", "title": "'Mi Casa Su Casa'", "helpfulness": 2, "user": "Irishcalini", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117351442}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Stayed here for 4 nights in Early July. The hotel looks like it was origionally 3 individual villas that have been joined into one hotel. When booking via the internet we found the owners very helpful and this was carried on into our stay. Upon arrival he were greeted by the owner who proudly gave us a tour of the hotel and showed us to our room. We had a sea view room on the upper floor, no 208, The room consisted of 2 seperate rooms, one room housed a setee, coffee table, fridge dressing table and a tv which didn't work. The front room which had a superb sea view had ample wardrobe space, a safe, double bed and a very large tv. The room led out to a large balcony which was shared with the next door room. The bathroom included a large air bath. The hotel grounds are very nice and feature a small pool, jacuzzi and a nice garden which has some sunbeds.There is a long flight of steps down to the beach which features numerous terraces with sun beds and ornamental pools and a fountain and provide quiet private relaxation areas. The hotel is rather dated in many areas but this doesn't distract from the overall enjoyment. Breakfast is a delight and features an extensive buffet which is enjoyed on the outside terrace. The position of the hotel is superb, be sure to get a seaview room as these enjoy fantastic views of the beach far below and the coastline. From the jotel it is a ten minute stroll into the main square. The enjoyed a very enjoyable stay and will cetainly return, it is more like staying in your own villa than a hotel", "title": "Lovely hotel in Superb position", "helpfulness": 1, "user": "Theworldfromskipton", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117315447}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Our only regret is that we had just one night here during our three-week whirlwind across Spain.", "title": "Superb experience", "helpfulness": 2, "user": "Meemschirk", "date": "July 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115191366}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The setting was idyllic: on a cliff next to the Parador overlooking the sea, with multiple terraces and a stairway to the beach. There's a small pool to cool off, a hot tub and numerous beach chairs, sun umbrellas and showers.", "title": "Wonderful view of the Costa Del Sol", "helpfulness": 1, "user": "Kwanyen", "date": "April 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 104700492}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The hosts were warm and helpful, inviting us to stay on the property long after we had checked out because \"you are our guests.\" Breakfast was robust with plentiful fresh fruit, drinks and the usual mix of eggs and ham and croissants.", "title": "Perfect for relaxing", "helpfulness": 1, "user": "erku", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101078973}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My wife and I have just been back for the second time – the first time we have used the same place for a repeat visit. Nerja is a wonderful seaside town with an old town area and a famous beach (check out Ayo’s restaurant for amazing paella). This hotel sits on a cliff directly above the beach and is only 5 min walk from the town centre and about 15 min walk from the Alsa bus stop (easier to get a taxi) to reach Malaga. We actually used a private pickup service (Nerja Transfers) from the airport to the hotel (69 euros) and were taken over in a very plush Audi A8! The staff at the hotel are very friendly and welcoming. On this occasion we stayed in the “Penthouse” suite or Attico in Spanish. This occupies the top floor of the hotel and is huge! There are two large seating areas, a kitchen, dining area, two double rooms and a twin room (all with air con, doubles with flatscreen TV) and two bathrooms. The one with the bath has the better shower, the other bathroom for some reason was a bit smelly and could probably benefit from a plug-in air freshener – but this is fairly picky. The really amazing feature is the location, with huge windows facing out from the living room looking down over the hotel, the beach and brilliant views of the sea and mountains. There is a private terrace (same view) with sun beds and a dining table and retractable awnings for shade. The flatscreen Sony TV in the living room (with PC plug in point if you bring your own laptop to watch DVDs) has many English and German channels. The breakfast is decent with good choice. There is a nice pool and plenty of sunbeds scattered around the gardens, patios and also on the terraces that are spread down the cliff along the steps to the beach (private gate access). On the Monday, the hotel puts on a free barbecue with stacks of wonderful food and also free beer, wine and spirits – there is usually some singing and merry making to finish the evening off. On leaving, the hotel gave us a gift as thanks for staying there. This hotel isn’t plush and modern as you see in so many modern (and fairly sterile) hotels, but it is clean, comfortable and has character. All in all, a fabulous hotel!", "title": "Superb location and views", "helpfulness": 2, "user": "Robert J", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140608703}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We could not have wanted better service; all the staff were so friendly and kind. The hotel is charming; the view from the breakfast terrace is amazing. Easy access to both the beach and to the town for evening dinner. Transfers from the airport arranged by the hotel. Good value for money. Would definitely return.", "title": "Kind and friendly", "helpfulness": 2, "user": "Ninjaree", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140513797}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We were booking a return trip to Nerja - beautiful town, loads of character, lively without being too crowded. Burriana beach is fantastic, very clean and always able to find a good spot.", "title": "What a find!", "helpfulness": 2, "user": "Kram3", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138890857}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This hotel combines both aspects due to its fabulous location - high above the beach and only 5 minutes walk into town. I picked it with the help of Tripadvisor and am only surprised it isn't even higher in the ratings. A more relaxing spot would be so hard to find. The set up is two villas which contain suites of varying sizes and all completely different in character - no chain-hotel feel here. Our suite had two rooms and balcony, from which you could see for miles over sea and mountains. The room was spotless and cleaned everyday. The staff were lovely, so laid back but totally helpful and professional.", "title": "On the beach cliff side", "helpfulness": 4, "user": "DYK", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 132942210}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Breakfast included a cooked option every day along with an extensive continental selection. On the Saturday night of our stay, the owners hosted a barbeque - all food (steak included) and drink was complimentary - \"tonight you are my guests\" - and was topped off by music and singing, a great night. The guests were from all parts of Europe during our week - I didn't see or hear any complaints.", "title": "A piece of Heaven", "helpfulness": 1, "user": "noeleentherese", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131849420}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I can't compliment this hotel, the management and staff highly enough. Excellently run small hotel overlooking the beach from a high panoramic viewpoint. Wonderfully relaxed and charming setting. Very good value for money with good breakfast, everything a family would want. We took our 2 young daughters 8 and 6 and they were in their element playing in the pool and Jacuzzi, always within our eyesight. The best part of the weekend was the host inviting all us guests to a Saturday night barbeque on the hotel's terrace. Great barby food and drink, all expertly and elegantly overseen by the host itself. In Nerja, we wouldn't stay anywhere else and look forward to returning.", "title": "weekend getaway!", "helpfulness": 1, "user": "Gary665", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130731911}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We have stayed at the Paraiso del Mar 3 times over the last 2 years and loved it every time, from the very warm welcome to the beautiful setting over the sea this place is paradise to us. The pool is a perfect size for our kids, one of whom learned to swim here ! The rooms are mixed, some bigger than others, we have splashed out the last two trips on a suite and it was well worth it, stunning sea views and the sound of waves crashing on the shore at night time. The staff can not do enough to make your holiday as relaxing as possible, they are friendly and helpful at all times and speak several languages between them. Ideally positioned in Nerja for all the local attractions and bus routes, just a very short walk to town and down the steps to the beach...can't wait to go back !! :)", "title": "Top place to stay", "helpfulness": 7, "user": "hellyandtom", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120698572}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Having read the reviews and being in need of a little R & R, we drove to Nerja and stayed at this hotel. It was disappointing and average. The worst was our arrival when the person who met us took nearly an hour to show us to our room - we had to be taken all over the hotel including the garage with many anecdotes all of which would have been interesting in a different context - all we wanted was to relax in our room, take a shower and change after our journey. The room was shabby, the bed was narrow (but comfortable), the bathroom ridiculously large and badly designed. The breakfast, which our gatekeeper had told us was extraordinary, turned out to be very ordinary and we went out to a local cafe. This is probably a great place for families who want a beach holiday but certainly not for a couple seeking a quiet comfortable interlude.", "title": "Disappointing and average", "helpfulness": 2, "user": "dibeach", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119940119}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed at this hotel for a week after making a last minute booking. This meant that we had to change rooms twice, however this was perfectly acceptable in view of the last minute booking.", "title": "Friendly Family Run Hotel", "helpfulness": 1, "user": "ronax57", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119179663}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is a friendly family run hotel. The owners and staff went out of their way to make our stay a pleasant one. The decor of some parts of the hotel is in need of updating, but is spotlessly clean and cared for.", "title": "Not boutique and very average", "helpfulness": 4, "user": "MrMag", "date": "September 18, 2011", "detail_rating": {"value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 118277223}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 2, "average": 8, "very good": 24, "terrible": 2, "excellent": 63}, "aka": "Paraiso Del Mar Nerja", "slim_ranking": 0.157894736842, "description": "The Hotel Paraiso del Mar combines a breathtaking view of the Costa Del Sol with a cozy atmosphere that makes you feel as if you were in your own mansion."}