{"user_rating": 4.5, "review_count": 324, "name": "Hotel Darussaade Istanbul", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This is a warm and cozy hotel. What we like most about the hotel is the location, within walking distance to the Blue Mosque and other attractions. The room is small but cozy and equipped. We got a room on the third floor, so the view was nice (sea view). The only comment is for the lack of elevator (esp. for the luggages). Nevertheless, you can ask the hotel staff to help you. The staff are very friendly and helpful esp. a staff called Omer. There's a reasonable priced convenient store right opposite of the hotel too. It's definitely a nice place to stay if you want to be closer to main attractions...a nice place to rest after a long day exploring the magnificent Istanbul.", "title": "Warm and cozy place", "user": "Jakky_P", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 104367549}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "This is a hotel you'll wish to come back to! The staff is extremely serviceminded and friendly. The rooms are delicate, and they serve a healty and good breakfast. The hotel is located near by the blue mosque and the topcapi palace as well as plenty of good restaurants.", "title": "Serviceminded and friendly staff", "user": "ElisabetNorway", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103580406}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We had a great time in Istanbul!", "title": "Highly recommend", "user": "Ali1962son", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102787404}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This was the 3rd time we had booked to go to Istanbul and for various reasons had to cancel. I rang the hotel to book a private transfer, which I would recommend as the queue for taxis at the airport was very long and it was great to be shown to a very nice car and not having to explain where we wanted to go.The hotel were very helpful and emailed me to confirm the transfer straight away. We were really happy with the location and the hotel was charming, tastefully decorated to a very high standard. The staff were so pleasant and helpful with recommendations, nothing was too much trouble. Breakfast was a huge feast and set us up for the day. I would love to go back to Istanbul and would definitely stay at the Darussaade again.", "title": "The most wonderful staff and the greatest location for tourists!", "helpfulness": 1, "user": "triple_s_11", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 102024539}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband and I stayed at this cute little hotel for a week. The staff was nothing but helpful, polite, and super sweet every single day. They really made our stay more pleasant. I can basically echo the same sentiments as all the other reviews: great location for seeing the sights, small but comfortable rooms, very small bathrooms, good breakfast, etc, etc… But, what I was most appreciative was the accommodating staff. We had an issue with our room one night. A strange and unpleasant odor filled our room at around 1am. The gentleman at the desk immediately got us another room to sleep in (we didn’t have to move our stuff) and called someone to fix the problem the next morning. Unfortunately, they needed to do a bit more extensive work to fix the problem so, the staff moved all of our belongings for us into another room. They were so helpful and quick to resolve the problem! Because of the inconvenience they paid for our taxi ride to the airport which was very kind of them. All in all a great stay!", "title": "Excelent Location", "user": "Frequenttraveler031", "date": "March 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 101983945}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Sultanahmet is perfect location for staying in Istanbul and Darussade Otel is the perfect hotel. Rebuilt into it's original Ottoman style, the hotel had a very homely feel.", "title": "The staff make this hotel special", "user": "BenDebHannifin", "date": "March 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101640908}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I think that was because of the staff. They were incredibly friendly and so helpful....they had a gift at making you feel special.", "title": "A pearl in Sultanahmet", "user": "haydar190479", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101205435}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "The rooms are not massive, but given the style that's not a concern.", "title": "Great hotel, great service!", "user": "Alecko", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100104996}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We stayed here for 5 days. Some of us have been in istanbul before, but this is the best hotel we have stayed in no doubt. The breakfast was great, they had different types of homemade \"Börek\" etc. everyday. The staff had the smile on the face everytime 24/7. The rooms was nice and clean. The receptionists know istanbul well, and they can help you with everything you need. thanks to everybody from we will be back in sept/oct.", "title": "Much more than I can Imagine, feels like HOME", "user": "shermanlo", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98187752}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Hersey icin Tesekkürler", "title": "Five star experience at 4 star prices", "user": "capote66", "date": "February 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 97232379}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Let me just start by saying thanks to ALL the staff at Darussaade - you made our stay perfect.", "title": "Incredible service", "helpfulness": 1, "user": "Dazzler-TA", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 107859292}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "After booking a week in Turkey for the F1 Grand Prix, we needed somewhere to stay close to Sultanahmet, close to transport links and somewhere comfortable. Hotel Darussaade ticks all the boxes, and the service is second to none. We have been lucky enough to stay at some really good hotels, but we have never had such good service from ANY location.", "title": "Very nice, classic Ottoman hotel. Good choice!", "helpfulness": 1, "user": "Michiel61", "date": "May 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 107212150}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We arrived and had an issue with our accommodation. The front desk staff, including the night shift, were all aware of the issue and it was resolved the very next day. This went a long way to ensuring we had a brilliant holiday, and for that I am incredibly grateful.", "title": "A great small hotel with genuine Turkish hospitality, strategic location and superb food!", "helpfulness": 1, "user": "Khairunnisa", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 105632932}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "A few notes:", "title": "Lovely hotel, great staff", "user": "Nordkvinnen", "date": "April 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 104889473}, {"rating": 5.0, "title": "Excellent, lives up to expectations", "text": "1. the aircon changes to heating at night, and this changeover is controlled by reception. You still have the ability to turn on and off, set the temp and fan, but at night it will blow warm 18c air instead of cold (AC) 18c air.", "user": "NairobiCobra", "date": "April 21, 2011", "id": 104866606}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I'm travelling a lot, especially around Europe, both for business and vacation. Darussaade is the best hotel that I have stayed not only in Istanbul, whole around Europe. The rooms are new and very clean, you feel as if you are the first guests. Although the location is downtown in the old city, the building itself is renovated with very nice decoration, and so makes you feel both in new and historical place. Breakfast is cool. Sometimes the friendly stuff makes little surprises like serving some cherry wine which is delicious. A young family is managing the hotel, they take care of each guest very closely; they became our friends in the fist day and were always helpful during our entire trip. If you prefer boutique hotels with best locations, I strongly recommend this one for İstanbul", "title": "The best hotel that I have ever stayed in all Europe", "user": "sinzmu", "date": "February 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 96559374}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "The hotel is great. Nice architecture + interior. Its just as if you are at home. The people in the hotel are very friendly and helpful espesially Cagatay. He helped me in every single thing I was planning to do. Even he helped me mark my map with around 30 loctions to visit.", "title": "It is just perfect!!!", "user": "sultan89", "date": "February 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 96065050}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Finally, I would like to thank everyone in this hotel.", "title": "Wonderfully-staffed hotel, well placed for sightseeing", "user": "PirkkaLahtinen", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93722347}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The hotel is clean and well decorated. It is perfectly situated: close enough to sights and restaurants, but away from the bustle. The staff are just fantastic; friendly, helpful and efficient. As a previous reviewer also said, they were great at tracking down missing luggage via the airport and getting it delivered. Also helped with sightseeing advice, ironing... and tea on a chilly day :-)", "title": "A wonderful hotel with kind and professional staff, comfortable rooms and a great breakfast!", "user": "Yolculuk75", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93635207}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Would definitely return to the Darussaade for another stay.", "title": "The best, most attentive service ever. Tesekkurler", "user": "RedDawn999", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93618346}], "location": {"country": "Turkey", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 3, "average": 12, "very good": 84, "terrible": 2, "excellent": 223}, "aka": "Darussaade Hotel Istanbul", "slim_ranking": 0.0742459396752, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Darussaade Istanbul is one of the protected examples of Ottoman civil architecture dating from 19. century. The wooden mansion, which is restored by sticking to its original, is decorated with elaborately so as to reflect the spirit of the period it belongs to. Darussaade Istanbul, which is in the middle of many unique structures belonging to Byzantine, Roman and Ottoman Empires, provides opportunity to explore this magical city with its perfect position within walking distance!"}