{"user_rating": 4.5, "review_count": 401, "name": "Hotel Cortina", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here on the recommendation of another hotel in the area that was full. Great location (by the train station), quiet, clean, and wonderful breakfast. The staff was always helpful and gave us good tips. We were very impressed with the owner, Angelo, who knows everything about Rome. He was so helpful. The location is perfect - a nice walk to the Colosseum but close to the Metro. Can't say enough about how lovely the Hotel Cortina is and we will stay there again on our next trip to Rome.", "title": "WONDERFUL! Would Return!", "helpfulness": 2, "user": "scbean", "date": "June 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112428200}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "During March break one week in Canada ,so we decide go to shopping to Italyl, My husband, son and I stayed for 4 nights at the Hotel Cortina and cannot say enough about how lovely it is. The staff is very warm and helpful , especially Kids walk tried and easily go back to hotel without any trouble, as well as the Manager Angelo and staff always showing warm and striaght from the heart service to every customer . .. The street, Nazionale, is loaded with shops, restraurants , and bars.. bus stop in front of the hotel......good location and price reasonable.. i love this hotel and will come again this summer ...", "title": "EXCELLENT /COMFORTABLE HOTEL", "helpfulness": 2, "user": "bc128317", "date": "May 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107485576}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Nice hotel . Good location. Friendly reception. Nice breadfast", "title": "Happy Trip", "user": "tripitaly11hongkong", "date": "May 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 107321459}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Cosy, hotel in the centre of Rome, not far from all sightseeing attractions, polite staff, fantastic coffee in the morning...However rooms are relatively small (single room) ...", "title": "Nice & cosy", "helpfulness": 1, "user": "MaureenRiga_Latvia", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 106773224}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "For our first trip to Rome and Italy itself, my wife and I did tons of research to try to pick the right hotels. Hotel Cortina proved our research was worth it. Not knowing what to expect, Cortina exceeded our expectations. The price was right, the location was perfect, the rooms were cozy and clean, and the staff was excellent. We will be staying here upon our return to Rome. Highly recommended!", "title": "Perfect Stay", "helpfulness": 2, "user": "mookie86", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 103887059}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I really enjoyed my stay at the Cortina Hotel. I loved the walking distance from most major tourist attractions in Rome! The staff was friendly, willing to help at anytime. They even helped me book a tour to Pompeii, which made things a lot more easier for me. The room was comfortable and clean. The “Colazzione” was good. Nice hotel to stay in overall.", "title": "Nice hotel to stay, we want to came back!", "user": "Gore68", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117872243}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "I stayed here a couple days before the cruise I went on. I couldn't be more happy with this place. The location was perfect for the rate they charged. You were 5 minutes from the Repubblica metro stop. Via Nazionale was a nice area with all the shops. The staff was amazing, they were all English speaking, and told you the best places to go for dinner, money exchange, and sites. If I ever go back to Rome I would definitely stay here again.", "title": "Great hotel in a great location", "user": "Shawn H", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117833826}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed here for two nights while traveling through Rome further up north.", "title": "Great Staff, Small Rooms good for a short stay.", "user": "Shaunz", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 117335475}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Location: Via Nazionale is a great street with many shops and a couple of bars. Hotel Is one stop away from Roma Termini on the metro. Vatican Is further down the same train line (about 10minutes) or within a leisurely walking distance if you have the time. The colesseum and ancient center is also very close.", "title": "Functional hotel, reasonable price, good location.", "user": "RogueCat", "date": "August 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 117301458}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Staff: fantastic, being such a small hotel (16 rooms?) we delt only eith two gentleman, both were friendly and helpful.", "title": "Very enjoyable stay", "user": "LACalgal", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117245264}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed here with friends for one night in July at the end of our Europe trip.", "title": "Great Location, Good Rooms, Average breakfast. Location Wins it!", "helpfulness": 1, "user": "zedmeister", "date": "August 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116234058}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Having been to Rome before and our friends not having been to Rome, we wanted to book somewhere reasonably priced as we were only going to be in the room for about 12 hours and we really wanted somewhere that was in a good location so we could give our friends a quick taste of Rome before we headed home. Great Shops and restaurants in the vicinity.", "title": "Wonderful stay", "user": "violinpower", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116024804}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This place ticked all the boxes.", "title": "Nice Location in Rome", "user": "LBBPhiladelphia", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115931090}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The location is the best feature of this hotel. It is walking distance to the Colleseum, Trevi, Piazza Navona and and anywhere in between.", "title": "Good value, helpful staff", "helpfulness": 1, "user": "rhip", "date": "July 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 115507792}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel is on the first floor of an apartment building but has huge doors with cameras and a buzzer to get you in, so it is both secure and convenient as there is a lift (only one person and cases can fit in it) so it was nice not to have to drag the cases up the stairs.", "title": "great value, great location", "helpfulness": 5, "user": "roamfamily", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115283303}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The two of us stayed here Nov7-17 '06 and really could not have been more pleased with the location of the hotel(over an Irish pub) and the centrality(two blocks from Republica metro) on Via Nationale, thru the wonderfu old door and up the stairs. The room was fairly small but the bath was great as well as a truly comfortable large bed. Three days in the hotel and then we moved to their apartment around the corner. Now that was excellent, a large two bedroom, two bath, kitchen and livingroom with over 600 channels on the tv if you can figure it out. Load up on refreshments to put in the frig, meaning beer and wine and save a few euros. A microwave to warm your pizza too. Florian and Angelo were great help with almost any info you'd require. The breakfast is fair so you can either save a couple of euros with them or explore any number of places out on the throughfare. The side streets have any number of good restaurants but I highly recommend #16 via del Boschette, Vecchicco Trattoria(spelling?), just plain great and lots of wine to choose from. Anyhow, a great reasonably priced friendly hotel, well located and comfortable.", "title": "Great little place and wonderful location too", "helpfulness": 9, "user": "Travellcat", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6333460, "likes": {"liked": "— The comfortable rooms and the apartment option", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Very enjoyable stay", "text": "We were upgraded to the apartment around the corner from the hotel. The photos on the website do not do it justice. Its a beautiful large apartment with 2 bedrooms/bathrooms, we even stayed in one night and cooked our own meal which was really nice. It is on a very quite street so we heard no noise at night and it was beside an Irish bar so we didn't have far to go for a few drinks. We were in walking distance to most of the sites, and nearly all the buses stop on via Nazionale. Breakfast was good, selection of cheeses, meats, cereal, juice,bread and fruit and unlimited tea/cappucinos. I would highly recommend this hotel and its staff and would definately stay here again.", "helpfulness": 9, "user": "LovesTravlling", "date": "December 4, 2006", "id": 6325574}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "I stayed at the apartment offered by Angelo in the street around the corner to the hotel - Via Napoli. It was beautiful! It had recently been renovated and was very clean. I stayed there with my parents and my husband joined us later. There were two bedrooms each with their own bathroom, kitchen and living room. Angelo was very helpful and provided us with a map and some tips. We used the hotel's pick up service from the airport (for an extra EUR 55) and since I was with my parents (60 years old) it was definitely worth every penny. The first night we arrived the taxi driver gave us a nice tour of rome on the way to the hotel. I would definitely stay here again.", "title": "Beautiful Apartment!", "helpfulness": 5, "user": "hoosiers2001", "date": "December 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6313080, "likes": {"liked": "— friendliness of staff, modern apartment", "disliked": "— go for the apartment!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Fourteen rooms on the second floor of an old building. Rooms are clean, pleasant and even with a certain simple elegance. Breakfast fine. Outstanding service from all the people on duty -- even downloaded sections from guidebooks on places we wanted to visit. Although on a busy street the double-glazed windows assured quiet.", "title": "Excellent service & location", "helpfulness": 14, "user": "macmungo", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6174280, "likes": {"liked": "— excellent desk service. simple but very convenient rooms", "disliked": "— good deal"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We recently returned from a trip to Italy and our last stop was four nights in Rome. I'd read about Hotel Cortina on TripAdvisor.com and chose it because it was in a good price range for us and had high recommendations in TripAdvisor. We were extremely pleased with what we found. The hotel itself is on a busy street about a 10 min at most walk from the main Train Station which was convenient for us because we didn't want to do a taxi and could walk there. Even though located on a busy street, our room was extremely quiet and we heard no street noise or noice from any other room - it was very quiet. The room was spotlessly clean and the bathroom was of a very nice size. The bathtub/shower is quite high and a bit hard to step up into and out of, but that wasn't a problem for us. You need to buzz in at the street level to have them let you in and I was a little concerned about that prior to going on our trip because some other travelers found that to be inconvenient, but we found just the opposite. We were let in immediately, and it made me feel very safe to have that extra measure of locked door. The staff was helpful in suggesting dinner and the breakfast was wonderful: pretty little setting and white linens with great cappuchino, fresh hard rolls and italian salami and with a couple different cheeses, along with cereal, apples, fresh juices, yogurts, and pastry. It was a great way to start the day of managing to get around the city. The staff who greeted us spoke very good english and that was a very nice little bonus for us. We used the bus that went right by the front doors to get to the Vatican and used the subway that was about a block away to get to the Colliseum area, but we had no trouble walking back from either of them as it is probably a couple miles to walk it - but not a problem for us. We were ever watchful for pickpockets and had no problems at all on the public transportation. Without a doubt if we ever returned to Venice, we wouldn't even look for any other place to stay.", "title": "The Hotel Cortina was a Great Place to Stay", "helpfulness": 7, "user": "SoapQueen", "date": "November 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6172051, "likes": {"liked": "— Cleanliness, central location, staff who speaks good english, great breakfast", "disliked": "— Nothing - we liked this location very much"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "All the staff were fantastic and extremely helpful, especially with helping me track and get my luggage which was delayed for a few days. The room I stayed in was very comfortable, a good size for a single room, has a mini-bar and was always clean. Breakfast was as expected; there was a variety of items offered and served fresh daily. The breakfast room is small and so conversation with other guests is very easy which was extra nice for me as a solo traveler. The location was perfect for good transportation or walking, lots of restaurants nearby and anything else you might need is easily accessible including a little kiosk nearby that sells metro passes, Roma Pass, calling cards, etc. I stayed here 9 nights and always choose small hotels when I travel to Europe. All the hotels I've stayed in have been great, but this one is by far the best. I highly recommend it.", "title": "Fantastic staff, great hotel, great location", "helpfulness": 2, "user": "franb2", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120017036}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Great hotel that we found in Rome from Trip Advisor.", "title": "This hotel was a real find - wouldn't stay anywhere else in Rome", "helpfulness": 1, "user": "SPGEdinburgh", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119892874}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "We were family with 2 teenage children and the family room sleeping 4 that they had was ideal for us. This hotel has a great location just down from the road from Republicca subway station and the open top bus tours that you can get off and on at any stop so it was really convenient. It is also in walking distance of the Colosseum/Pantheon/Trevi Fountain although we only once walked back as a holiday in Rome involves a lot of walking (and queuing if you don't prebook on the internet which is essential for the Colosseum and Vatican).The hotel doesn't look much from the outside but once you get through the outside door and up the stairs, it is very nice and great value for money. Breakfast is buffet style/help yourself and the room was fine - you don't really want to eat in your hotel in Rome as there are so many great restaurants to try. We particularly liked Gusto and also the Pizzeria da Ricci - the latter is just down the road from the hotel in Via Genova (right at the end in the corner - watch you don't miss it) and sells really good pizzas and also draught Peroni in litre glasses ! Should also mention that the owner of the hotel was extremely helpful and spoke English perfectly - the Colosseum was closed due to flooding on the day that we had tickets but he phoned and sorted it out so that we were able to go back and use our tickets the next day when it had reopened. We had a great time in Rome which is a superb place to go for a long weekend as there is so much to see - and this hotel is the place to stay if you don't want to spend a fortune but want to stay somewhere central.", "title": "Great Hotel, Great Location", "user": "Maria G", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119373152}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Just recently got back from a trip to Europe. Spent a few days in Rome, at the Cortina Hotel. Excellent location, nice staff, and clean rooms. Walking distance to the Fontana Di Trevi, as long as other historical attractions Rome’s historical center. Very pleased with the overall service of the hotel.", "title": "Great location and staff", "user": "Mark C", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119296012}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This is a small, basic hotel which somehow manages to be much more. This is primarily because of the excellent staff and the superb location. The staff could not seem to do enough for you. They were very giving with their time, whether you needed directions, reservations, or even a cup of espresso or tea. I could not ask for better service. The location is very central. We stayed there twice, on either end of our tour around Italy. Don't be discouraged by the entrance. It is very low-key to say the least. Once you get up to the 1st floor (that would be the 2nd floor for us North Americans) it is all very pleasant.", "title": "Excellent Customer Service", "helpfulness": 1, "user": "anjilbabi", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119290733}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "We recently had a very enjoyable stay at Hotel Cortina near the Termini. We had a cozy double room which was clean and nicely furnished. Booking directly through the hotel's website was very easy. We were able to walk to/from the Termini with carry-on rolling luggage in about 15 minutes. The hotel felt safe even though it is on a busy street because of the huge door that you had to buzz to get in.", "title": "Nice accomodations at Hotel Cortina", "helpfulness": 9, "user": "sarah4nil", "date": "May 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7646158}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "It is in a great location - only 5 minutes to the Metro station. The staff was quite courteous and professional. The breakfast was very good, with fresh rolls, ham, salami and cheese, pastries, cereal, orange & grapefruit juice, yogurt, cookies, fresh fruit , coffee/espresso and a dessert-like cake/torte.", "title": "Great Hotel near Train Station", "helpfulness": 9, "user": "Becky M", "date": "March 20, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 7193844, "likes": {"liked": "— Spaciousness of the apartment"}}, {"rating": 4.0, "title": "wonderful hotel", "text": "We would definitely stay there again if we ever return to Rome.", "helpfulness": 10, "user": "molly100", "date": "January 24, 2007", "id": 6687714}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My 3 sisters and I stayed in the apartment adjoining the hotel. The apartment was large and clean. The two bathrooms were also modern and nicely appointed. A driver picked us up at the airport on time, and we were met at the apartment by helpful, friendly staff. There's an Irish Pub next door, and we enjoyed being able to enjoy a cocktail so close to the hotel. We would certainly stay here again and highly recommend the apartment to others.", "title": "It's the little things that make all the difference", "helpfulness": 7, "user": "dingoQueensland", "date": "January 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6604238, "likes": {"liked": "— The friendly staff", "disliked": "— The heating was up too high"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006", "text": "beautiful old building, great room, very clean, friendly english - speaking staff, walking distance to all sites (trevi -10 mins), highly recommended, mary & john - limerick, ireland (jan '07)", "title": "Smallish room, too hot, but friendly service and good location", "helpfulness": 14, "user": "brucej", "date": "December 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6359625}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We only stayed one night as a stop over before our flight home. Wish we had stayed there while in Rome earlier in the week. Well air conditioned, hardwood floors, bathtub and shower, lovely comfy pillows! Pleasant breakfast with good coffee. Staff was so welcoming and made sure every detail was perfect including calling our taxi the morning we left and making sure we were satisfied with our experience. Very reasonably priced E129 for two of us with king sized bed and a twin bed including breakfast. Located on Via Nazionale about two blocks from Piazza Republica, a metro stop and taxi stand. Great restaurant nearby, Target, not cheap but absolutely wonderful food and welcoming staff.", "title": "Classy comfort, delightful staff", "helpfulness": 2, "user": "artyheart", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115054232}, {"rating": 5.0, "title": "Great services and good located!", "text": "This was our first time to Rome. We stayed for 4 nights, Mr. Angelo was very helpful and friendly. The room is clean and the buffet breakfast has a big variety and offers great quality food. The hotel is located at the very heart of the centre. Just a few minutes from the metro. The hotel breaths a warm atmosphere and made us feel home. We will surely come back again and will recommend this to our friends.", "helpfulness": 2, "user": "Rikalmere", "date": "July 3, 2011", "id": 114993188}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Easy to find, right on a road serviced by lots of buses and a 2 min walk to the metro. Friendly staff and adequate breakfast, room was cool and comfortable, and as I was facing the inside was very quiet. Thankyou so much for an easy stay!", "title": "Lovely bolt-hole for single female traveller", "helpfulness": 3, "user": "drellieboots", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114942340}, {"rating": 5.0, "title": "Always my \"go-to\" hotel when in Rome", "text": "Hotel Cortina was brought to my attention a few years ago by Rick Steves. After trying it once, I now use it as my home base whenever in Rome. It's an elegant, quaint and spotless hotel located on Via Nazionale. Easy to walk to sights, and cabs right outside if needed. I love the fact it is more of a boutique hotel, as you feel special and pampered. Great staff....professional and accommodating.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 21, 2011", "id": 114591471}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "We stayed in the hotel for 2 days in June 2011.", "title": "Convenient location, good services, value for $$!!", "helpfulness": 1, "user": "joelletan", "date": "June 11, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 112688929}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "We visited Rome during the last European Winter. We did a lot of Italy by rail and found the Hotel's location excellent being only 10 minutes walk (with luggage) from the main rail station. The rooms were small but very clean and the staff very friendly and helpful. The location also put us within easy walking distance to many attractions. If you are feeling a bit leg sore the Republica underground rail station is just around the corner.", "title": "Great location.", "helpfulness": 9, "user": "Zahary", "date": "September 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5883622, "likes": {"liked": "— Location", "disliked": "— Have a good pair of walking shoes."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Staff at Hotel Cortina were great - really helpful during booking of accommodation. As there were 4 of us (2 couples), we were offered a 2-bed, 2-bath apartment just round the corner from the hotel for Euro195 per night (including breakfast back at the hotel each morning which consisted of ham/cheese, rolls, pastries, tea/coffee, fruit). They also arranged a return private transfer from Ciampino airport (at Euro55 each way). Apartment on 4th floor, just round the corner from the busy Via Nazionale. Found it to be spacious, well furnished/decorated and quiet, away from traffic noise. Air-con a bonus! Beds really comfortable too!!", "title": "Great Hotel Cortina 2-bed Apartment", "helpfulness": 10, "user": "Travel-taker", "date": "September 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5769979, "likes": {"liked": "— Good, clean and spacious - didn't feel like there were 4 of us sharing."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Found everywhere in Rome easy enough to walk to, with the help of a good map, with the exception of the Vatican which we got a bus to (Termini station close by) - the hotel will advise you of which bus. Just wear comfortable shoes for the uneven pavements and cobblestones. Went at the end of August, found some places to be closed but most were re-opening (August is shut-down/holiday season). Lunch was often a panini, which we all enjoyed, but evening meals were more hit-and-miss - rarely were all our meals served together and quality wasn't always what we expected.", "title": "A little Gem in the centre of Rome", "helpfulness": 12, "user": "rach9677", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5767575, "likes": {"liked": "— Close to city centre"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "On the downside, my purse was snatched on our last day while shopping on Via Cavour where it was really busy. Noticed that, in a split second, someone had unzipped my bag (which was in front of me!) and pulled out my purse! I'm always really careful so felt very shocked and saddened to have this happen. Hotel were helpful when we got back and had the phone numbers to cancel credit cards - apparently it has been happening a lot lately. (Sadly we didn't find the police as helpful.)", "title": "Fantastic Hotel, wonderful staff.", "helpfulness": 12, "user": "pammiejean2", "date": "August 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5606687, "likes": {"liked": "— The cleanliness. The friendlinesshelpfulness of all the staff.", "disliked": "— Size of the shower cubicle"}}, {"rating": 5.0, "title": "Fabulous Hotel Cortina Apartment", "text": "All in all, we would highly recommend the apartment offered by Hotel Cortina.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 15, 2006", "id": 5468580}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I was there with my wife and son end of Feb early March for some days and had a real good deal for a double room incl breakfast.", "title": "Good located for a city trip for a cheap price", "helpfulness": 1, "user": "Sentosa69", "date": "March 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 102210150}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "4 nigths just 274 Euros for all of us. In the end I paid 366 Euros as they have given us a three bed room. I did not insist on my reservation as it was more convenient two have a 3rd bed for our 9 year old one.", "title": "Do not hesitate to stay", "helpfulness": 1, "user": "oldsailor62", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 101982662}, {"rating": 5.0, "title": "Excellent choice", "text": "The Cortina is located on Via Nazionale close to Termini hence ideally located for sightseeing and we did it all by walking around.", "helpfulness": 2, "user": "paulsen02", "date": "March 28, 2011", "id": 101966145}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "The hotel itself is located on the 1st floor in an old building complex and hard to find if you go there the first time. The staff is extraordinary friendly and helpful. Breakfast really good for three Stars, but after 4 days you are saturated as it is always the same.", "title": "Hotel Cortina Roma is the place to stay when in Rome!", "helpfulness": 2, "user": "TidwellTravel", "date": "March 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101615075}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Big disadvantage is that directly beneath is an Irish pub.", "title": "All basics you need in Rome", "helpfulness": 2, "user": "SamTang", "date": "March 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101205613}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My partner & I stayed here for the last 3 nights just gone & can't speak highly enough of Hotel Cortina. It's great value for money noting the central location. The staff were helpful & made us feel very welcome. I found the room & hotel itself to be very clean & our linen seemed to be changed each day. The breakfast is a simple but fresh with mostly pastries & cereals. Even though the hotel is on a busy street our room was one of the quietest I have ever stayed in. We also loved that we could walk easily to all the main sites (although we caught a bus from across the road to the Vatican).", "title": "Full of character & great value for money", "helpfulness": 1, "user": "Brissie_Girl00", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119258417}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Hotel Cortina is not a 5 star hotel, but for the price & location it's certainly a great find. It had a lovely boutique feel & spanned the floor of a lovely old building. I would", "title": "Excellent Hotel! Staff and location are great!", "user": "MaryBCopenhagen", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118621918}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "highly recommend this hotel to all my friends & will definitely stay here again.", "title": "Excellent", "user": "annettemg", "date": "September 17, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118237363}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The Hotel Cortina is a small hotel (14 rooms) in Via Nazionale, 5 minutes walk from Piazza da Republica and the metro station Republica, and close to several bus stops (very central).", "title": "COLAZZIONE", "helpfulness": 4, "user": "victor17255100", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 118086465}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The hotel is located in one floor of an old Italian building, and street entrance may seem weird, as it is only a tall wood door. But don't get intimidated by the looks downstairs. Reaching the hotel on 1st floor by an old style elevator, the cosy hotel is very nice, well kept and decorated. Rooms are a bit small, but very clean, with good isolated windows, a spacious bathroom, air-con. and free wi-fi. Breakfast is also good (though repetitive) in a cosy little room.", "title": "We loved it, our 2nd trip back and would definitely return!", "user": "WendyBNY", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117907472}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I stayed for one night, we found it an easy 15 minute walking distance from the termini train station and also close to a metro stop. The rooms were average compared to others we stayed at during our tour of Italy and due to a early morning tour did not get to try the breakfast", "title": "Great Location", "user": "RobertAustralia", "date": "November 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120973048}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel is located on the 2nd floor of a building which is on one of the main drags in Rome. It is in a very good location, within walking distance of most sites and very close to the train station. Since our room was on the inside, there was no noise. The room was clean but not very big. The staff was friendly enough. You had to be in the lobby with your computer to get the internet.", "title": "Nice but small", "user": "BruceCPA", "date": "November 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 120878085}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed here on recommendation from the hotel we had previously booked. Since we changed our itinerary and spend two more days in Rome, we got this hotel as it was only a couple of blocks from the Aberdeen which had bigger rooms and cost less. But the Cortina was fine in a pinch. We did have trouble with the toilet flushing but the staff corrected the problem.", "title": "Place to be when in Rome", "user": "Brisban3Boy", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120518231}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We had a great stay at Hotel Cortina", "title": "We picked a real winner with this one - what a find!", "helpfulness": 2, "user": "Suzy P", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120349860}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The Hotel is very central to all the main site seeing placed in Rome and the train station, apart from having to take a bus to the Vatican City, you just need your walking boots on to get to all other sites.", "title": "Nice small hotel", "helpfulness": 2, "user": "EKAUS", "date": "November 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120060238}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "What everyone says is true....", "title": "Enjoyable stay, but wouldn't stay there again", "helpfulness": 10, "user": "rochelle.alexis", "date": "November 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 6164582, "likes": {"liked": "— Hotel Staff", "disliked": "— Blankets, breakfast"}}, {"rating": 5.0, "title": "perfect", "text": "By the looks of the front of the building and door, we didn't know what we were getting into when we had to buzz to get in and barely fit in the elevator with our luggage.", "helpfulness": 11, "user": "iloveeuropetoomuch", "date": "November 13, 2006", "id": 6113158}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "But, that all was erased when we walked into the hotel, where the man who checked us in was wonderful!! Before we could ask the questions, he had a map out, telling us where we could eat dinner and where we could walk that day. He was the nicest man that we had ever met while checking into the hotel.", "title": "Happy with our stay", "helpfulness": 7, "user": "krissypoo", "date": "November 7, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 3.0, "value": 4.0, "rooms": 3.0}, "id": 6083864, "likes": {"liked": "— price, helpful staff, cleanliness, sufficient breakfast", "disliked": "— location isn't the best, no clocks/alarm clocks in room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Everything else was OK. The blankets on the bed grossed me out so I slept with a sheet. The mini-fridge was great because we could store our on water and wine there.", "title": "Little Gem!!!!", "helpfulness": 10, "user": "rushydc", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 6029718, "likes": {"liked": "— VERY CLEAN"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The breakfast was OK. Corn-flakes and rice-krispes, bread, some sweet breads, cheese and yogurt. No hot food.", "title": "You will not be disappointed", "helpfulness": 12, "user": "Docalla", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5931051, "likes": {"liked": "— hotel staff and location"}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 9, "average": 27, "very good": 110, "terrible": 2, "excellent": 253}, "aka": "Cortina Hotel Rome", "slim_ranking": 0.0654574132492, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}