{"user_rating": 4.0, "review_count": 644, "name": "Hotel Clarendon", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "i stayed in the hotel for a few days and i love this hotel. this is an art deco architecture hotel and when you walk the hall you can just make a travel in history", "title": "charming and good places", "user": "Chouchout1er", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180248984}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "the rooms are maybe a little small but the bed is really comfortable, the bathroom is very beautiful. the hotel stand in the heart of the old town. every week end there is jazz concerts.", "title": "A great Location", "helpfulness": 1, "user": "NormaKitchener", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179868619}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "i really like the hotel and i hope i will come back soon", "title": "Location, location, location", "user": "John K", "date": "October 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 179698023}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We found the staff to be extremely helpful and very pleasant at all times. The room was not large but the king sized bed was comfortable and a blanket was in the room, which we appreciated as we do not find a duvet pleasant for sleeping. Our two windows looked toward the Chateau Frontenac which was glowing at night. Being in the heart of Old Quebec is fabulous! We could easily walk to most attractions. The tourist information centre is just a couple blocks away. Breakfast was well worth the price with good selection and quality to start us off on our busy day.", "title": "A well located gem", "user": "RodT1957", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179231922}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The location of the Hotel Claredon is situated in the heart of Quebec old town and eleven of the seven hundred plus restaurants are within 200 metres of the lobby doors. There is major contruction going on just across the street which appears to be ongoing. Our taxi from the station decided to drive up the detour the wrong way but the bellboy came out of nowhere to greet us and take our luggage. Our check in was delayed as they wanted to find us a room away from the front of the building and away from the noise of contruction. Our room was small and looking a bit tired but adequate for our 3 night stay. The concierge and front desk staff were very good and went out of their way to help. We found the the facilities of the hotel pricey compared to other establishments within a short walk and there is a cover charge to listen to the jazz. The Hotel Clarendon is the oldest hotel in Quebec old town and a premium is being charged for location.", "title": "A disappointing experience", "user": "Patricia I", "date": "September 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 179002042}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "We stayed here for a conference recently. I had no issue with the service overall, staff seems friendly enough. The location is great if you are here as tourist and want to enjoy what the old town offers. This hotel fits right in with its historic and cozy decor.", "title": "Room quality varies", "helpfulness": 1, "user": "AKLVancouver_Canada_", "date": "October 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 182562310}, {"rating": 1.0, "title": "check in", "text": "However, the down side is that it lacks the amenities that modern chain hotels offer. There's no gym or pool in this hotel. With all the delicious cuisine offered around town, the only option is to running, which I guess is not a bad idea if the weather permits. Also, I was very lucky to be upgraded to a superior room, so no complaint from me. But my colleague's room was so small that there is not even a closet in the room.", "user": "R52B", "date": "October 26, 2013", "id": 182484587}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "I set waiting in the lobby for over 3 hours while guests after guests arriving after me received their rooms. The people we were traveling with received their room at 10:30 in the morning. Our reservations where made at the same time over two months ago, 8-17-2013. By the way I am sitting in the lobby using their computer and still waiting. It is now 3:50PM and was just told the room is still not ready.", "title": "great place for a pre-cruise", "helpfulness": 1, "user": "130Tam", "date": "October 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182172337}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We drove 4 hours from Lincoln, White Mountain New hampshire to Quebec. Our first reaction to old town Quebec was: WOW. What a charming place. Our hotel Clarendon is right at the heart of the old city. We just parked our car in front and walked in to check in. It was 1pm and our room was ready. The elevator is so small and took a while before we could get in. We booked superior two queen beds room on 5th floor and the room is roomy with two gorgeous window overlooks to a church and a few beautiful narrow streets (with cobble stones). The staffs there were so friendly and helpful. We paid $25 Canadian dollars for vallet parking which is a little stiff but I guess the way it is.", "title": "We had a great time!", "user": "FloBear2013", "date": "October 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182148957}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "After a quick rest we walked around town. Local people are so friendly. The old town is so elegant and we fell in love with it right away. We got back to the hotel to get the car. Within 5 minutes the car arrived right in the front of the hotel. We were on our way to see the Chute Montmorency Fall. The fall didn't impress me that much. We wanted to get back to the old town to explore more.", "title": "room with a view", "user": "Glebegirl", "date": "October 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181387509}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The Clarendon reminded us of the European hotels we enjoyed. It's old, but inviting...with a lovely lobby and lounge/bar. The bedroom was small, but clean...the beds very comfortable.", "title": "A European touch", "user": "foodhoundBurbank_Ca", "date": "October 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181305090}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This hotel is smack in the middle of old town and a wonderful assortment of boutiques and restaurants. Service in the lounge and dining room was slow, perhaps due to short-staffing.", "title": "A touch of class", "user": "Claire H", "date": "October 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181177896}, {"rating": 4.0, "stay_parameters": "Stayed October 2013", "text": "But the servers were friendly.", "title": "Great location less than excellent service", "user": "94Ange", "date": "October 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 181030177}, {"rating": 4.0, "title": "Historic Hotel", "text": "Having read some rather negative reviews of this hotel and feeling somewhat apprehensive, we were pleasantly surprised. We had read reports of surly staff, dirty bathrooms with hair left on the floor, tiny bedrooms with not enough room to swing a cat.... We were met by a lovely, friendly and helpful guy on reception and although the room was smaller than some of the bedrooms we had on our trip, it was clean, very comfortable and perfectly adequate. It is in a really convenient and historic location with easy access to many restaurants close by. On the morning of our departure there were a lot of other guests who were off to join a cruise ship so there was a long queue for breakfast and in addition, the restaurant was short-staffed, which slowed things up further. Our waiter, although obviously overstretched, was polite and did his best to deal with our requests.", "user": "Asim O", "date": "October 13, 2013", "id": 180826593}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This is a hotel full of character and we would certainly like to return sometime.", "title": "3 Wonderful Nights at the Hotel Clatendon", "helpfulness": 1, "user": "EiniDB", "date": "October 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 180690188}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Being my first time in Quebec City, I took a chance when choosing this hotel as I got a good price thru booking.com. LOVED this place. As a solo female traveler, it certainly exceeded my expectations. Although I spoke little to no french, the mostly young, good looking front desk and concierge staff were very friendly, polite, professional and accommodating. I really lucked out as this hotel is situated smack in the middle of Old Quebec in Upper Town....minutes from the funicular and St. Jean and St. Louis streets. The lobby was pretty and inviting. I hope the owner realizes what a gem he has with Jonathan, who went out of his way to help me many times, even after his shift was done. Similarly, Julian and the concierge staff were also very helpful and friendly. My 2nd flr. room was clean, quaint and a perfect size for a solo traveler like myself, with two large windows looking out. ( It's a shame the view was of construction; hopefully that will be gone soon.) The only con I have is the mattress was FIRM and I'm used a pillow top. Otherwise, would highly recommend this hotel.", "title": "Spot on....and then some", "user": "MarcyB1955", "date": "September 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 178893396}, {"rating": 2.0, "stay_parameters": "Stayed September 2013", "text": "They didn't took reservation confirmed by e-mail, on proper dates, first arriving, no room, than after waiting for ages, they sent to room not cleaned. This was arrival of brides's father to wedding...", "title": "Awful : never been so disappointed", "helpfulness": 1, "user": "CastonguayM", "date": "September 27, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 178885972}, {"rating": 2.0, "title": "Disapointing stay", "text": "Positives are location, comfy beds and helpful reception staff", "user": "David W", "date": "September 25, 2013", "id": 178636433}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Negatives are very small and cramped rooms (I broke a toenail trying to get to toilet in night and my wife banged her shin on protruding metal under bed on first day), waste bins are not emptied, card lock on door traps fingers, they did not replenish toiletries daily, only one lift which is used by clients and service staff, slow and non existent service at breakfast on two out of three days", "title": "Excellent stay", "user": "AnneMarieTynan", "date": "September 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178558673}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I spent five nights at the Clarendon Hotel in Old Quebec City. I had a delightful stay. My room was so comfortable -- yes a bit on the small side but quaint and very clean. It was not noisy neither from outside nor inside the hotel. I loved the art deco features of the hotel including the old world charm of the place. I would definitely return and strongly recommend it for any traveller wishing for a real Quebec City experience. The staff were friendly and very helpful too.", "title": "Old world charm with modern amenities", "user": "MarilynWicking", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178347898}], "location": {"country": "Canada", "city": "Quebec City"}, "stars": 3.5, "variance": {"poor": 47, "average": 114, "very good": 280, "terrible": 23, "excellent": 180}, "aka": "Clarendon Hotel Quebec City", "slim_ranking": 0.448979591837, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}}