{"user_rating": 4.5, "review_count": 1116, "name": "Hotel Perseo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We (4 of us) stayed at this wonderful hotel from 3 to 6th July 2007 - as far as we are concerned, it cannot be faulted! Tripadvisor has served us well yet again :-)", "title": "Wonderful Hotel", "user": "Tickentash", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8219421, "likes": {"liked": "— Location", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Louise, the Kiwi-Aussie owner, is a brilliant hostess, and her staff were just as wonderful. The rooms were light and airy, with icy-cold airconditioning (which was appreciated after a day walking around in the heat!). The bed was comfortable and the shower hot. Whilst the rooms are quite small, they are beautifully finished and very clean. Breakfast and \"Happy Drinks\" were well above our expectations - delicious bread and hot chocolate, and a pre-dinner wine each night was a real treat.", "title": "Fantastic Location", "user": "BackTooSoon", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8218769, "likes": {"liked": "— The location was terrific.", "disliked": "— Sometimes the elevator was not working."}}, {"rating": 4.0, "title": "Very convenient for Florence weekend", "text": "Another huge plus for the hotel is the location - 3 minutes to the Duomo, and 10 minutes to anything you could hope to get to. Getting to pop \"home\" during the middle of the day for a quick recharge was fantastic, and meant that we had more energy to keep sightseeing!!", "helpfulness": 2, "user": "PHILIPMARSHALL", "date": "July 22, 2007", "id": 8216828}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Thank you to Louise and her staff for making our first (but not last) trip to Florence so enjoyable.", "title": "Enjoyed our Stay at Perseo", "user": "B_in_Ottawa", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8206832, "likes": {"liked": "— Modern decor, spacious room, excellent location, friendly staff", "disliked": "— Lack of water pressure in the shower"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We booked this hotel because of its location and proximity to the tourist areas, and we were not disappointed. When you walk out of the building and look to your right, the Duomo is right there.", "title": "Cozy, Well located", "user": "Travel_Girl_52", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8204095}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Location fantastic, rooms great, very clean, excellent service with nothing being too much trouble, restaurants recommended were exactly what we were looking for, prebooking service for museums and galleries available and very reasonably priced.", "title": "Fantastic Hotel", "helpfulness": 6, "user": "Zacs", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13092722, "likes": {"liked": "— location,service, cleanliness,value", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008", "text": "All in all a wonderful place to stay in Florence.", "title": "Fabulously friendly", "helpfulness": 5, "user": "willreturn52", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13079139, "likes": {"liked": "— Friendliness and location", "disliked": "— Entrance to the hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My sister and I stayed at Il Perseo for 5 nights from the 9th of January. I had fortunately read the reviews on Tripadvisor so knew that the entrance to gain access to the hotel was not very well signed or attractive but that once you got to the thrid floor all would be well. My sister's reaction to the entrance was classic as I forgot to tell her but she was reassured when we go to the front desk!!!!! Il Pereo is fantastically located, exit the building, turn right and you can see the Duomo, and to reach it takes less than a couple of minutes, absolutely fantastic. The hotel itself is informal, nicely minimalistically decorated, very clean and while the bathroom was small it's not like you spend a large amount of time in one. If you are in Florence and want to spend lots of time in a bathroom then stop wasting your time and just go home. The beds were comfortable but the pillows a bit hard but that is just a personal thing. Breakfast was simple but good and the happy hour a nice way to end the day, before heading out for dinner later. We could buy large bottles of water at a very cheap price and fill the smaller ones we used during the day and you could get a good coffee and tea any time. The staff especially Lara were fantastic. They were helpful, with tips about restaurants, how to get to where you wanted to go, what to see or assisting with booking side trips. I would recommend this hotel. It is not luxurious nor is it a bland, everything is exactly the same as you find with chain hotels. It is good value, personal and friendly with a location you cannot really beat. Try it, I am sure you will like it.", "title": "Outstanding value", "helpfulness": 5, "user": "pandj78", "date": "January 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12980728, "likes": {"liked": "— Overdelivers in terms of value for money"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We were extremely impressed with this hotel both for quality and value for money. The recently-refurbished rooms are excellent (great bathroom), the location is fantastic and the staff are delightful - Laura in particular gave us great advice for making the most of our three days in Firenze. Breakfast was a cut above the usual mid-range hotel breakfast in Italy and the free 'happy hour' drink in the evenings was much appreciated!", "title": "Hidden Gem", "helpfulness": 4, "user": "travelenthusiast070", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12915884, "likes": {"liked": "— Location, host, quiet", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I'd definitely recommend this to anyone visiting Florence, whether for a first visit or returning.", "title": "Fantastic location, loved Il Perseo", "helpfulness": 3, "user": "julesy", "date": "January 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12513694, "likes": {"liked": "— Proximity to EVERYTHING, quiet clean room, the wonderful Laura!"}}, {"rating": 5.0, "title": "Great hotel, lovely staff, very convenient to all attractions", "text": "I recently spent the weekend in Florence with my wife. We chose the hotel as we always do, based on tripadvisor comments. Overall the experience was a positive one and I'd certainly recommend the hotel. In summary:", "user": "senoritasd", "date": "July 20, 2007", "id": 8203982}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "This well maintained hotel is well positioned near the duomo, and a short walk from Florence SMN train station (the main station for Florence). The rooms are spotless and quiet and well proportioned, and the staff very helpful. We had excellent restaurant recommendations and they very kindly made some last minute museum ticket bookings for us as well (you really don't want to queue at the Uffizi or Accademia).", "title": "Great little hotel", "user": "JimCooper", "date": "October 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21402446}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "For me, the only downside was that their coffee was a little watery, but my dad, who prefers a weak flat white made with instant coffee (his taste in coffee is truly awful), thought it was the best he had in Italy :-) The bar also offers very good value drinks.", "title": "Go to Il Perseo while you can still get in!", "user": "mermaid331", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21388783, "likes": {"liked": "— The people who worked there.", "disliked": "— Breakfast could have been better, but that's true of most Italian hotels."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The internet access was also very good, and free!", "title": "So Ideal It's Crazy", "helpfulness": 3, "user": "ladyinthestreet", "date": "October 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21216145, "likes": {"liked": "— The staff, the location, discount with cash payment", "disliked": "— the cot, no internet in rooms, wifi dodgy in lobby"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I wouldn't hesitate to recommend it to anyone visiting Florence.", "title": "Enjoyed our stay", "user": "Kellydiersing", "date": "October 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21153688, "likes": {"liked": "— The staff and communication through email", "disliked": "— Nothing, we were very satisfied"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "It is against my best interests to write a review about Il Perseo, as I'm afraid they'll get even more well-known and ordinary people won't be able to get a room!", "title": "A lovely stay", "user": "Kavzchat", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 21105187, "likes": {"liked": "— the location"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "I had actually booked a different hotel, but they cancelled on me a couple of days before my trip, and I was fortunate to be able to book Perseo after reading the \"Let's go\" tourbook and from the trip advisor reviews. I can't tell you how glad I was that the other hotel cancelled on me. The first thing after I booked the hotel, the owner emailed me asking me if I wanted to get a reservation for Uffizi and Accademia. For a small fee (that goes directly to the museums), it saved me hours of waiting in line for the ticket, so it was totally worth it. The hotel is probably a 5-10 min walk from the train station, and a stone's throw away from the Duomo. It's situated kinda in between the Accademia and the Uffizi, so all the major sights were within walking distance. When I got in, the owner personally showed me to my room. She spoke perfect English (I think she's English!) which helped tremendously in the communication. It was spacious and very clean and modern. The bathroom was a bit small, but you are not in Florence to spend time in the bathroom. It was clean and the water pressure and temperature was perfect. There's free internet as well. Free breakfast is ok, but I am not very demanding on the quantity as long as the quality is good. The owner also helped me book a trip to the outlet mall, which was fantastic and better than the ones I have been to in UK and France. Checkin & Checkout were quick and easy. My room faced the street, but the windows are sound proof that I didn't hear anything. All in all, a great stay because of the excellent customer service, the location, and the cleanliness of the room. Did I mention it's not expensive either? Would recommend anyone to stay there.", "title": "Fantastic. Most enjoyable stay during the 5 city trip to Europe", "helpfulness": 2, "user": "int_travelbug", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8123018}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Pros:", "title": "Great location", "helpfulness": 1, "user": "AVBB", "date": "July 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8108960}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "- great location, near train station, in the middle of the city and all tourist sites are easily accessible on foot", "title": "Excellent Hotel!", "helpfulness": 2, "user": "dbq303", "date": "July 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8086448, "likes": {"liked": "— clean, great location"}}, {"rating": 5.0, "title": "Wonderful experience", "text": "- felt safe, as hotel is on major road leading to Duomo", "helpfulness": 1, "user": "irishred_mk", "date": "July 8, 2007", "id": 8076382}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "- clean and modern rooms", "title": "Not a 3 star - more a 1 star", "helpfulness": 1, "user": "Trojan88", "date": "July 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 8075317, "likes": {"liked": "— Location", "disliked": "— 3 star expectation but a 1 star hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We are a British couple in our mid thirties who like to travel independently, getting good value as much as possible!", "title": "excellent 4 nights with Siena/Chianti tour included", "helpfulness": 1, "user": "acbw_8", "date": "November 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21820985, "likes": {"liked": "— Friendliness, trip to Siena", "disliked": "— gurgling plumbling!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We have just had a brilliant stay of 4 nights at Hotel Perseo and thought it was good value for money. We found it to be very central, clean and extremely friendly. I had actually booked Alloro B&b but they messed up my booking (ie. not booked us in, despite a few emails and booking in July) and I found Perseo on Tripadvisor a day before we were due to leave for Italy. The reviews were good and as we were going for 4 nights we were entitled to the free Chianti country/Siena tour by booking directly through their website. We were going to go to Siena by bus on the Monday anyway so this was a bonus. They responded very quickly with the confirmation, so I was relieved.", "title": "Oasis of Friendly calm in a busy city", "helpfulness": 1, "user": "WYSIWYG08", "date": "November 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21786070, "likes": {"liked": "— room quality", "disliked": "— access"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Finding Perseo: Walking took 5 mins from the bus station (we got the bus from Pisa). It may be number 1 Via de Cerretani but that doesn't mean it's at the end of the block due to the eccentric Italian numbering system. The actual location is next to Accessorize and opposite the junction with Via Fernando Zannetti. Look for the big open door with Hotel Perseo above it in big letters. There is a lift shaft within, which you just get into and press the button for the 3rd floor. Once on the 3rd floor you'll see the reception area. We had no problem with the plain ground level entrance - it wasn't seedy as some reviewers have said, but simply a doorway.", "title": "Great hotel in Florence", "helpfulness": 1, "user": "Victoriabird84", "date": "November 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21673883, "likes": {"liked": "— Friendly staff and great location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Rooms: The hotel was renovated in 2006 and the general feel is clean and modern. Extremely clean room. Comfortable bed with duvet and good quality cotton bedlinen. Not much of a view but not a problem. TV with BBC world news and CNN, air con, tiled floor, shower cubicle (water was hotter some days than others), hairdryer and magnifying mirror in the bathroom. Toiletries sachets and drinking glasses disposable plastic. The water tank/plumbing was rumbling away a bit on a few nights (possibly typically Italian?) but I slept through it most of the time (chianti helped!)", "title": "Excellent Location, Outstanding Hospitality", "helpfulness": 1, "user": "ncs1010", "date": "November 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21562704, "likes": {"liked": "— Location, Quality and Price"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Happy Drink! between 6 and 8pm every night you can sit in the communal areas and drink a free glass of red or white wine and fill up a plate with crisps and other nibbles. Really good idea - we thought this contributed to the general friendliness very well.", "title": "Friendly helpful management", "helpfulness": 1, "user": "AnnieDardago_Italy", "date": "November 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21561246, "likes": {"liked": "— management and location", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great hotel", "text": "We stayed as a family at this hotel after Christmas 2006. The hotel has an excellent location, it's very central and only a quick walk from the station. The owners/management are on hand for advice and help. The family room (one large double) and two twin beds was modern, clean, quiet and tastefully decorated. The breakfast was tasty, fresh and healthy. We enjoyed staying here and would definitely return there if visiting Florence again. I have recommended this hotel to friends. It's good value for money, small boutique style, bright , clean and comfortable.", "helpfulness": 2, "user": "smhYork", "date": "January 11, 2007", "id": 6574904}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Travelled to Florence and stayed at Il Perseo for a night in November 2008. The booking process was convenient and the response to inquiries was prompt and helpful.", "title": "Hotel il Perseo - a great stay in the heart of Firenze", "user": "anjouanjou", "date": "November 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22069510, "likes": {"liked": "— Location: sublime", "disliked": "— Beds: could be better"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "On arrival, the staff were very friendly and spoke English well. Everyone was very helpful, and the owners are charming. The hotel's proximity to the Firenze SMN station as well as its location down the street from the Duomo is great.", "title": "Loved the hotel. Clean, large rooms with excellent view of Duomo!", "user": "AnnaLiew", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21990649, "likes": {"liked": "— Cleanliness, location and service", "disliked": "— Can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Our room was good - a couple problems (beds weren't great; the heater was overheating the room), however, the room was very clean, the bathroom was great, and it was spacious by Italian standards (though not by North American standards). Nicely, simply decorated. I forgot my internet cable (there's wired high-speed in the rooms) but the staff kindly supplied me with one.", "title": "Wonderful Welcome", "user": "bonvoyageNC", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21984806, "likes": {"liked": "— Location, staff and completely non-smoking hotel", "disliked": "— Small elevator"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The breakfast was excellent and the morning cappuccino a fantastic touch. Do yourself a favour and stick to espresso-based drinks and forget about the American-style coffee. The hotel also provides a happy hour from 6-8 pm every night, with snacks and a glass of wine, which was quite good!", "title": "Fabulous Authentic Italian Hotel", "user": "cmsvt97", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21977175, "likes": {"liked": "— Location!", "disliked": "— nothing -- everything was great!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "On checking out, we needed to leave our bags for a few more hours of shopping in the city. The owner was kind enough to store our bags securely.", "title": "Great location, friendly staff!", "user": "belfebe", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21937282, "likes": {"liked": "— Location, location, location . . .", "disliked": "— I can't think of anything."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We stayed 3 nights in Hotel Perseo in a quad room. The room was comfortable, very modern and clean. The bathroom was clean. The hotel is in the center of Florence, in walking distance to everything. The rate included breakfast and free internet in the lobby. I booked this hotel based on the tripadvisor reviews. I was not disappointed. I read about Laura and everyone was right, she is a great asset to the hotel. She is very helpful and friendly. She made you feel at home. The hotel does have a small elevator. Overall it is a great hotel and very comfortable. I would recommend this hotel to anyone wanting to be in the center of Florence.", "title": "Loved the Hotel Perseo", "user": "MacFamily35", "date": "July 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8182163, "likes": {"liked": "— Cleanliness, friendliness, location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My family and I (five of us) stayed in three rooms at the Hotel Il Perseo from July 1 to the 7th and really enjoyed our stay in Florence. I had researched the hotels in Florence on Trip Advisor and found the reviews very positive. The rooms are comfortable, fully air conditioned, and very, very convenient to all of the museums and sights in Florence. It's easy to pop back into the hotel to rest a bit before venturing further. Florence is definitely a walking city and easy to get almost everywhere.", "title": "A great small hotel in a wonderful city!", "helpfulness": 1, "user": "Ahji", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8135792, "likes": {"liked": "— comfortable, airconditioned, convenient to everything", "disliked": "— nothing"}}, {"rating": 5.0, "title": "We wouldn't consider staying anywhere else!", "text": "The breakfast was good---wonderful rolls and coffee (in fact, some of the best coffee I've had); and the \"happy drink\" time in the evening was a great way to wind down before searching for a restaurant for dinner.", "helpfulness": 1, "user": "Sydney072007", "date": "July 17, 2007", "id": 8131528}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "The elevator is a quick way to get up to the 3rd and 4th floors where our rooms were located, but my son and daughter regularly climbed the stairs each time!! We will definitely stay in the Hotel Perseo again when returning to Florence!", "title": "Fully recommend", "helpfulness": 1, "user": "anuja", "date": "July 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8125736, "likes": {"liked": "— location, fresh rooms"}}, {"rating": 4.0, "title": "Great little budget hotel in the heart of Florence.", "text": "We stayed at Il Perseo for three nights last August and it was really good. The hotel is pretty basic (a 3rd floor) but immaculately clean and the rooms are very nice and well kept. Considering we were at the very heart of Florence (a 20 seconds walk to the Duomo, literally) I could say the price was really reasonable (and as we were spending 3 nights there we had a discount rate). The staff was really nice and helpful and they offer a free glass of wine between 6 and 7 or 8, I can’t remember exactly. There’s no problem if you are arriving by car. Ask at reception and they’ll arrange a parking solution for you. There’s a private parking nearby and they come and collect the car and they bring it back when you’re leaving. It’s rather expensive, though, 24 euros a day, but you don’t really have much choice.", "user": "Blixen_78", "date": "October 20, 2008", "id": 21031913}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The only but is that the breakfast room is very small and it gets crowded in the morning so you’ll probably have to wait for other people to finish their breakfast before you can have a seat.", "title": "great place", "user": "OmanTom", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20982696, "likes": {"liked": "— great staff - mr tani was very helpful", "disliked": "— poor views"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "had a great stay at the hotel, super handy location and charming staff. the place was really smart and the delicious breakfast as well as a glass of wine in the evening - both included in the price - were a bonus.", "title": "Nice people, nice location, nice hotel", "user": "SergeiN", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20638151, "likes": {"liked": "— The personnel", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "we had to hang around florence a few hours after checkout and the staff offered for us to chill out in the lounge if we needed. would definitely come back!", "title": "STILL GOOD HOTEL", "user": "loverofmilan", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 20628962, "likes": {"liked": "— Location, friendly Owners and staff", "disliked": "— No minibar"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "tom", "title": "A Pleasant Experience", "user": "Netoy", "date": "September 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20485439, "likes": {"liked": "— The staff", "disliked": "— The lift which only accomodates 2 people at a time."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The staff was extremely friendly and efficient. They booked museum tickets for us, and gave great restaurant recommendations. Each evening they had \"Happy Drink\" which was a lovely little wine and snack time to gather with our friends (we were traveling with another couple) before heading out for dinner. It was a nice touch.", "title": "Loved the View", "user": "Phantom23", "date": "November 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21557096, "likes": {"liked": "— The view from our room", "disliked": "— Climbing the stairs when the lift was broken"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Breakfast was perfectly lovely each morning with a nice selection of breads/pastries, yogurts, fruits, cereals, meats/cheeses, and wonderful coffee/espresso/cappucino. A few mornings we had to wait for a table, but it was never more than 5 minutes.", "title": "so close to everything", "helpfulness": 1, "user": "dunk1980", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21534249, "likes": {"liked": "— everything!", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I had read on other Trip Advisor reviews that the 4 flights of stairs to access the lobby were a problem, but Hotel Perseo has a small elevator, so if stairs are a problem, you can always use the elevator.", "title": "Excellent Value", "user": "slowtraveller0057", "date": "November 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21455479}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This hotel is great. It's location is amazing, the owners and staff are extremely friendly and the room and breakfast were fab. The owner was very helpful with directions and staff recommended us places to eat. I would definitely use this hotel again.", "title": "Fantastic hotel & location", "user": "wise1021", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14596306, "likes": {"liked": "— Location and friendliness", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My husband and I had a wonderful stay at the Il Perseo! Louise went out of her way to help me out at the Pharmacy when I got ill on the trip. Without her help I don't know what I would've done. She saved my vacation. The hotel is in a great location right by the Duomo. Good restaurants nearby. The room was spacious and clean. The bathroom was big by European standards. Breakfast was great. Lots of fresh fruit and great cappaucinos. I would definately recommend this to anyone looking for a nice hotel in Florence.", "title": "Wonderful stay at the Il Perseo!", "user": "asiadoll-phoenix", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14079205}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "This place is amazing! The location is extremely close to the Duomo, which is the center of Florence.", "title": "Can't say enough good things.....", "helpfulness": 1, "user": "Giotravels", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13986952, "likes": {"liked": "— everyhing!", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Beginning with check-in, we were more than pleased with our accomodations. Our room was a triple, with a king size bed and a semi-private alcove for our son in a single bed. His space had a window with a beautiful view of the Duomo. The bathroom was very spacious with a huge step in shower. The room was cleaned daily with fresh towels provided and absolutely immaculate at all times.", "title": "Great Experience - All Around!", "helpfulness": 1, "user": "nottarockstar", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13686902, "likes": {"liked": "— Staff and Location!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The breakfast was great, with yogurt, fresh fruit, cereal and warm rolls and croissants. The cappuchinos were amazing! Best in Florence. \"Happy drink\" began at 6pm, and we found ourselves looking forward to going back, resting and going to Happy Drink! We met the nicest people from all over the world there. First glass of wine is free and a minimal charge for subsequent drinks.", "title": "Exceptional Family run Hotel", "helpfulness": 5, "user": "pembrokeMalta", "date": "February 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13453221, "likes": {"liked": "— Hospitality", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We liked everything about this hotel. The location -- just 1 block from the Duomo -- is unbeatable. The staff was friendly and helpful, particularly with advance reservations. The rooms were modern, clean and fairly roomy by European standards. Breakfast was simple but good. We enjoyed the complimentary glass of wine each afternoon, too.", "title": "Great hotel; great location", "user": "mjbernard", "date": "November 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21919817, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I'll keep it short because the other reviews have it right.", "title": "I can't disagree -- an excellent hotel", "user": "pgseee", "date": "November 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21828562, "likes": {"liked": "— The friendly, helpful staff -- but, really, everything was great.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "This hotel was in a great location - very close to the Duomo and not far from the Santa Maria Novella train station. The staff were very friendly (and all of them I encountered spoke English, which was great as my Italian is almost non-existent). I felt it was a real bargain as well. I would definitely stay there again!", "title": "Location and Staff", "user": "Arienne M", "date": "May 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130695030}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed in a family room with a double and two single beds (and a cot) for 3 nights. It's a big room, not divided, nice and clean. The staff is friendly and helpful. It's in a great location, in a shopping area, 10-15 min walk from the train station (be very careful with pickpockets!!), Galleria dell' Academia, Piazza della Signoria, a block from Duomo. Breakfast is good, choice of bread, fruits, cereal, yogurt, etc. Excellent coffee!! The only thing I wasn't expecting is to be awaken up around 11pm by a very loud music just outside my window. It's a club or something next to the hotel, good it ended up by midnight. Besides that, everything was fine. I'll definitely stay here again!", "title": "Perfect location", "user": "Sisi Y", "date": "May 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 130529482}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My father and I stayed in this hotel for four nights during our recent trip to Florence. The hotel is very nice, in a great location, and the staff is very pleasant. They provide a very nice breakfast in the morning with great cappuccino. We really enjoyed ourselves!", "title": "Nice hotel in great location", "user": "cbvolle", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130358001}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed here for a few days to attend a family wedding. The hotel is very close to the Duomo (about 1 block away) that it would also be ideal for a visit to \"see the sights\" - and Florence has them by the bucket load. If your Italian is not \"molto bene\" then you will find excellent English spoken here by the very friendly and helpful staff - but do make the effort for at least a few words and phrases.", "title": "A real bargain in the heart of Florence", "user": "WBT", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130285055}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The rooms are well furnished, clean and comfortable and if you sit in your room with the window open you will hear all the atmospheric sounds of the city - bells, swifts. once you close the windows, it is more than quiet enough to sleep.", "title": "Good hotel", "user": "DrCorona", "date": "May 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130229999}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "Unbeatable location: The hotel was within sight of the Duomo and walking distance of all the major sites. It was a ten minute walk from the main train station in Florence.", "title": "Unbeatable location, very clean, nice breakfast!", "user": "Delphia2001", "date": "June 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 131124033}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The hotel: very friendly staff. The rooms were very clean and quiet. We didn't have too much of a view, but they do have views of the Duomo available (but how much do you really look out you're hotel window). The shower was a bit on the smaller side. The beds were quite comfy.", "title": "Good value for great location", "user": "Erik M", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130971300}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The breakfast: breakfast was included and was served in a very cute little room. It did tend to get quite busy later in the morning, so if you are in a hurry in the morning you should go earlier. They serve you coffee or tea while you wait for a table to become available (they make a great cappuccino!)", "title": "Good Location, Comfortable Rooms & Kind Helpful Staff", "user": "superjem", "date": "May 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 130888740}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Overall I found this hotel a very comfortable place to stay!", "title": "Great location, welcoming staff", "user": "jen02218", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130755837}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Duomo is just around the corner. Helpful staff wrt trains, restaurants, sightseeing... etc.. Rooms are clean (we had a room with a new bathroom) and comfortable. Very good value for 3 star hotel.", "title": "overpriced hotel", "user": "tatiani_12", "date": "May 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 130753625}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The location is perfect, between the train station and very close to the main attractions. The staff was very kind and gave us a lot of help with restaurants to go. When we arrived they put us on a better room, big and with very nice, with a view to some bells. The breakfast was very good. We couldn't choose a better place to stay in Florence.", "title": "Great found!", "user": "Ali.Ale", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132374912}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "M husband, teenage daughter, and I stayed at Hotel Perseo from June 6 to June 11, and it was the perfect place to stay. We would definitely stay there again next time that we visit Florence!", "title": "A wonderful hotel, the perfect place to stay in Florence!", "helpfulness": 1, "user": "Michele K", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132145337}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We were greeted at reception by Louise, the owner, a friendly, funny, and gracious woman who set the wonderful tone for a terrific stay. All of the staff were friendly and helpful as well.", "title": "Hotel Perseo has the Perfect Location and Staff", "helpfulness": 2, "user": "Timothy W", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131825587}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The location is brilliant and so central to all major attractions - we walked a lot, all day, and the hotel was the perfect starting point for our excursions. As well, it is a very short walk from the train station, and when you walk out of the hotel, you are basically facing the Duomo.", "title": "Nice, Clean hotel in great location", "user": "Kara S", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131702774}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The rooms were spacious, clean, and bright, and incredibly comfortable. Ours was on the corner with great views that looked out onto the street, as well as to the church bells of the Santa Maria Maggiore. I really miss hearing the beautiful bells ringing throughout Florence!", "title": "Hotel Perseo is home away from home", "user": "Maria L", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131683064}, {"rating": 5.0, "title": "BEST OF FLORENCE", "text": "- very friendly staff", "helpfulness": 2, "user": "woman-tripper", "date": "July 6, 2007", "id": 8066499}, {"rating": 5.0, "title": "Great location and hospitality", "text": "Wonderful place to stay. Felt welcomed immediately. The room was roomy, clean and had everything we wanted, including an in-room safe. Great breakfast and a free drink at happy hour after a day of touring. Right in the center of things. Couldn't have asked for a better place.", "helpfulness": 1, "user": "mnscumaven", "date": "May 5, 2008", "id": 15689984}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Have just returned from a five day visit with a friend. I cannot fault this hotel. It's location was ideal, being a few minutes walk from the Stazione and just steps from the Duomo. It was immaculate, beautifully appointed with good quality fittings and unfailingly clean. The breakfast was wonderful, fresh meat, cheese and crusty rolls with all the usual trimmings. The staff were brilliant. All were friendly, helpful and genuinely nice people. I have brought lots of their cards home to tell all my friends ! I will certainly return there.", "title": "Perseo is great", "helpfulness": 1, "user": "somersetrubix", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15443301, "likes": {"liked": "— good taste, quality, cleanliness.", "disliked": "— no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The entrance to the building was not particularly inviting, but when you reach the 3rd floor and enter the stunningly bright entrance of this little gem, you find a great little hotel. I found it by accident and loved it. Our room was spacious, modern and quite luxurious for the price...I have stayed many times in Florence and found hotels that seemed OK on their websites to neglected and overpriced. Amazing value i think for the rating. At Perseo, attention to details made our stay a pleasant time. And it was so central and easy to get to from the station, but away from the market and seedy areas. And you can see the Duomo from there. Definitely will stay there again on my annual visit. My partner agrees and he is a fussy guy who basically hates most places he stays!", "title": "An oasis in Florence", "helpfulness": 1, "user": "Balmaintravels", "date": "April 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15425650, "likes": {"liked": "— The wonderful comfy bed and delicious decor", "disliked": "— The building entrance is a bit sad."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The hotel is strategically located, nearby Duomo, clean, and modern. The service is great, the staff (Tani, Badr, Laura, and Nick) and the host (Louise) are super friendly and attentive. They pre-booked museum entries, recommended good places to eat, and also recommended good ice cream places.", "title": "Enjoyable stay", "helpfulness": 1, "user": "qxl", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15407842, "likes": {"liked": "— The location, the staff", "disliked": "— the unstable hot water"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The rooms, I stayed both in single room (8 nights) and double room (2 nights), are updated and quiet. The Internet is a big plus, and the happy hour with free two glasses of wine is another additional big plus.", "title": "Great service, great price, great location", "user": "mlthele", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15269015, "likes": {"liked": "— Location", "disliked": "— The Euro exchange rate"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This hotel went above our expectations. Though it was nothing fancy, the room was a good size, comfortable and clean; with great air conditioning, a couch and armoire. The location could not have been better. It was just a short walk from train station, and a block or two from the duomo. The complimentary breakfast was hands down the best we had any hotel.", "title": "Location, value, and breakfast", "user": "Kelly B", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131676480}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Would definitely stay again.", "title": "It's all about balance", "helpfulness": 1, "user": "Scott O", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131519679}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Thanks to other reviewers, this hotel was pretty much what we expected.", "title": "Location is brilliant!", "helpfulness": 2, "user": "CelineBrussels", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131459203}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Pros:", "title": "Our first trip to Florence.", "helpfulness": 1, "user": "Peter O", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131449485}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "The location is great - easy walk anywhere", "title": "Location, location, location", "helpfulness": 2, "user": "KathyNZ", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131293819}, {"rating": 4.0, "title": "Great Hotel, Great Location", "text": "I used the Rough Guide for this hotel. I don't agree with their rating of a 1-star. This is at least a 2 to 3 star. The hotel was newly renovated, so that may be the issue. It is extremely clean, and very comfortable and very very reasonable. I had a room with a double bed, with a second bed, so 3 could stay very comfortably, and a very clean bathroom with shower. The location couldn't be better. Look left, the train station, look right, the Duomo. Very close to the nightlife. The hotel owners were a great resource for day trips and any other infomation. I highly recommend this hotel.", "helpfulness": 2, "user": "Dillia", "date": "July 5, 2007", "id": 8062072}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Just so you know. I usually stay in 4 and 5 star hotels for work, so I am well versed in hotels. For the location, cleanliness and friendly service, you couldn't ask for better. I loved it!", "title": "Wonderful Experience", "helpfulness": 1, "user": "LBHouston", "date": "July 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8040532, "likes": {"liked": "— cleanliness and location", "disliked": "— no negatives"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We recently stayed in Hotel Perseo. Our room and bathroom (recently renovated) were spotless and comfortable. Just a block from the Duomo and within easy walking distance of other major sights, The Perseo 's convenient location made it easy to return to our room for a quick bathroom break or a short rest. The quiet, air conditioned room was always a welcome retreat at the end of the day. All the staff at the hotel were extremely friendly and very helpful. They made reservaions for museums, recommended restaurants, gave directions, and made sure we had a taxi for an early morning flight. We highly recommend the Perseo and will definitely stay there again when we visit Florence.", "title": "Loved the Perseo", "helpfulness": 1, "user": "number1ema", "date": "July 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8038519, "likes": {"liked": "— the location, cleanliness", "disliked": "— you need to take a lift to the lobby"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "L&B Houston", "title": "Interesting Hotel Perseo", "helpfulness": 8, "user": "AFBT", "date": "July 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8035928, "likes": {"liked": "— Louise", "disliked": "— All of the stairs or elevators to reach reception."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Our experience at the Hotel Perseo was a warm and welcoming one. It is nicely located and the rooms are clean and cozy. Most importantly, the service was extremely accomodating. Everyone at the desk, particularly Laura worked hard to make our stay a wonderful one. When we encountered some difficulties with our flight back to the US, Laura spent over an hour making calls on our behalf to make things right for us. We will always be appreciative to her and to everyone at the Hotel Perseo for their warmth, kindness and helpfulness.", "title": "Great Hotel Very Friendly And Helpful", "helpfulness": 1, "user": "ladybug52", "date": "July 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8034935, "likes": {"liked": "— The Local And The Staff", "disliked": "— Nothing wrong."}}, {"rating": 5.0, "title": "Perseo, we love you!", "text": "we got the suite room which was fantastic! once in the room there was the welcome champagne and a box of chocolates... something i wou;d not really expect considering that the hotel does not charge so high.", "user": "CanuckVoyagers", "date": "November 1, 2008", "id": 21453282}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "as a whole, our stay in florence was great. very, very relaxing.", "title": "sick in florence", "user": "ChiLiz", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21450810, "likes": {"liked": "— the staff", "disliked": "— the hotel was on the forth floor of a building /hard to find"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "This hotel is a plum! From the street entrance you wouldn't", "title": "A Secret Place in Florence!", "user": "una1sorella", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15004434, "likes": {"liked": "— Everything!", "disliked": "— The secret inside..."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "realize the delightful atmosphere inside and up the lift/stairway to the third floor.", "title": "Great location!", "user": "Liz451", "date": "April 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14969094, "likes": {"liked": "— Location, quality of room, value, food, etc!", "disliked": "— When coming back at night the stairway couldve been better lit"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The staff and owners were exceptional hosts.", "title": "Wonderful location", "user": "ch65", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14867890, "likes": {"liked": "— The location and amazing staff", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Highly recommended", "text": "The triple room we occupied was more spacious than many,", "user": "DanManFlorence", "date": "April 1, 2008", "id": 14715545}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "has an updated bathroom, wireless internet connection, and flat panel TV (if you have time to spend in a room in such a glorious historical city). We heard no street noise and all slept well.", "title": "Great Place to Sleep in a Fantastic Location", "user": "pepponde05", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14622728, "likes": {"liked": "— The Staff", "disliked": "— The Bathroom Amenities"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Stayed at the Perseo for two nights with my mum and it was great. Really central - 5 mins walk from the train station and 2 mins from the Duomo.", "title": "Brilliant hotel, lovely staff", "user": "PwincessLisa21", "date": "December 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22604736, "likes": {"liked": "— Location and the staff", "disliked": "— Nothing - wish we'd been staying longer!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The staff were all really lovely - sorted us out with bus tickets, restaurants etc and were just so friendly and helpful.", "title": "Unique Hotel", "user": "MininaMedellin", "date": "December 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22559302, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "The room was really quite big and the bathroom was new - everything was spotlessly clean.", "title": "Spectacular Value In The Heart of Florance", "user": "windycitytraveler57", "date": "December 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22480868, "likes": {"liked": "— Location", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Breakfast was good, standard continental - breads, cheeses, meats etc - but really fresh.", "title": "Great Hotel, Great Location", "helpfulness": 1, "user": "wine4et", "date": "November 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22288553, "likes": {"liked": "— Location", "disliked": "— none"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I spent ages looking for a Florence hotel and was delighted with my final decision, much better location and price than others I'd considered.", "title": "Fantastic hotel", "user": "fmDafna", "date": "November 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22251897, "likes": {"liked": "— They didn't have wireless internet access in the room, but they did give us a cable to connect to the wired internet. The cable was a little too short, but it was ok."}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 9, "average": 49, "very good": 372, "terrible": 5, "excellent": 681}, "aka": "Il Perseo Hotel", "slim_ranking": 0.0934782608696, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Completely renovated in 2006, Hotel Perseo offers large comfortable rooms full of natural light, many with spectacular views of classic Florentine landmarks. A superbly central location and friendly welcoming atmosphere combined with a stylish designer decor make Hotel Perseo a perfect place to stay when visiting Florence."}