{"user_rating": 4.5, "review_count": 400, "name": "Hotel Hassler", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The location of the hotel is exceptional but the staff at the reception, concierge, and restaurants were seemingly too tired from the summer influx of tourists to be helpful or warm. The hotel was exceptionally expensive ($800 a day) without the corresponding warmth one might expect at that cost. Our room, while on the piazza overlooking the Spanish Steps, was noisy and small. Perhaps the best time to travel is not October but February - when they have forgotten the challenges of too many tourists. We didn't like the crowds either!", "title": "Too much for too little", "helpfulness": 10, "user": "Rose77777", "date": "October 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 142249213}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Roberta and Fabiana took care of the reservation. It's prepaid for 4 nights. Gary and I was in room 508 from 8/31-9/4.", "title": "Not too bad", "helpfulness": 1, "user": "SL65-Cora", "date": "September 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141577395}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "From SFO to Rome connecting via Luthansa in Frankfurt. Luthansa was on strike (what are the odds) so we did not arrive I Rome until 9/01 noon. Hassler could not refund the room rate to me. I understand the policy but was not please. We did not arrive at the hotel until 4pm because our luggages did not arrive with our flight so we have to waited for them at the airport. Anway, when we checked in, we looked terrible.", "title": "Stay here only if you are rich AND famous!", "helpfulness": 11, "user": "LeeCK", "date": "September 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141331739}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "OK. Hotel itself. Room is nice. A bit small but we understand we are in Rome. we knew we are not spending much time in the room/hotel so we did not get a suite. Comfy bed. Black and white theme. Crown molding is pretty. His/her closet is a plus. The shower is small but works. AC works great. What a view outside the window. You can clearly see the Vantican! Sound proof is pretty good especailly the room is very close to the Spandish steps.", "title": "Wonderful Hassler", "helpfulness": 1, "user": "BangkokBill786", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141259805}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Breakfast was great. Best smoke salmon I had - not fishy, no skin, firm, oily/melt in your mouth, no fat, rich and tasty. Piano player is delightful. Drinking Cognac at night int he lobby is wonderful.", "title": "Wedding reception ...", "helpfulness": 1, "user": "amt14", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141122206}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Pros: Check-in was well-organized and timely, I was led up to the room and given a tour of the premises by a staff member. Room was clean with all of the basic amenities. House cleaning was perfect. The location is almost impossible to beat: at the top of the Spanish Steps with a Metro station (and an elevator!) minutes away. Dining was excellent; the breakfast buffet was lavish, Salone Eva had a great menu, and Imago was magnificent (see separate review). Service from the concierge, porters, doormen, etc. was overall prompt and courteous: in short what I would expect from a hotel of this caliber.", "title": "Classic luxury hotel with service to match.", "helpfulness": 2, "user": "midway42", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143733547}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Cons: Tough to come up with many…. I had some minor problems with the TV menu in my room (I’m usually used to a printed dossier that describes the hotel’s services) but that’s about it.", "title": "Perfection!", "helpfulness": 1, "user": "michaelaurasmom", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143544112}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Summary: A traditional luxury hotel in the mold of The National in Moscow or the Grand Bretagne in Athens. I would definitely stay here again and am looking forward to a future visit in the years to come. Those looking for a modern ultra-luxe (spa, pool, faux golden lions, etc.) experience may be disappointed but should stay at the Hilton Cavalieri anyways! If The Hassler is good enough for Audrey Hepburn it’s good enough for me. Thumbs up.", "title": "Literally right at the top of the Spanish Steps", "helpfulness": 1, "user": "lor13149", "date": "October 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 143263483}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "From the moment we arrived, our two night stay at the Hassler could not have been better! We celebrated our 15th wedding anniversary in the Imago Restaurant on the top floor and the service, food and ambience could not have been better!", "title": "As Expected!", "helpfulness": 2, "user": "mattjb24", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143153441}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Walk out the hotel door, down the steps to one of the many shopping areas. It is a perfect location. This hotel has an old world charm. The staff was wonderful and helpful. The room was clean which is one of the things that is most important to me. The bathroom and closet were quite large, nice if there is more than one person in the room. The room service was ok. I arrived in Rome on my first night of my European vacation so needless to say I was exhausted and just wanted someone to bring me dinner. I thought that since I was in Italy the pasta would be amazing. Not so much for the room service pasta that I ordered. It wasn't bad, but just ok. I did however enjoy the breakfast buffet. I would recommend this hotel is nothing else to get a great workout in the morning.", "title": "Great experience--except for concierge", "helpfulness": 2, "user": "Susan M", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143068608}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I have stayed at the Hassler twice and had very good experiences both times. There is great variation in style, size and location of the rooms, however, even rooms in roughly the same price range, so it is important to let them know in advance what you want your experience to be. Whether you like gracious olde world interiors, or sleek Italian design .... I have stayed in both at the Hassler. And breakfast or cocktails on the patio is a real delight.", "title": "Hassler", "helpfulness": 1, "user": "AYellowWood", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141049350}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The hotel is in a terrific and convenient location.....the room was adequate.....there is simply something missing....there just isn't an atmosphere of any kind at the hotel.....the lobby is a bit dreary....the garden seems lacking....there is a wonderful view from an outside terrace on one of the upper floors....would make sense to have a bar and service at this location in order to perhaps have one area in the hotel that would be lovely to have a drink in the early evening.", "title": "Location but....", "helpfulness": 2, "user": "sdwgns", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141040708}, {"rating": 2.0, "title": "Annoyed", "text": "I have already in the past given my review for the hassler and it was always positive...but frankly i am very disappointed with my visit this month. I come to rome for various reasons but i stay at the hassler for various personal reasons. Ttis time i arrived and i was asked to go stay at another hotel nearby since some sort of diplomat did not want to free up my room. Now this is ridiculous....that i have to change hotels...it totally ruined my weekend. I tried to make the best of it for my sake and agreed in the end to make the rmove. They were very apologetic and offered an upgrade but frankly, that was no way enough. I went to the other hotel and there was definitely a huge difference in atmosphere etc and it really seemed like a hilton hotel room....terrible carpet...it ruined my whole romantic weekend....i frankly feel this is not the way to handle guests and am very disappointed....am not sure now in the future if i would want to go back to the hassler...i like to use the same hotels in the various cities i travel to since i travel a lot for work and this makes me feel bit at home...but hassler definitely did not make me feel at home this time so maybe its time for a change, where a hotel cares about its regular customers...am still in rome, leaving tomorrow thank god....che sara ' sara' ....", "helpfulness": 6, "user": "Mai2013", "date": "September 22, 2012", "id": 140949201}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed at the Hassler mainly due to the location, but the quality of the stay far exceeded my expectations. My party had 2 rooms, both very different, but both stunning. The staff were very attentive and their attention to detail was awesome, I never had to open a door, they seem to know what you want before you ask. To me, the Hassler Hotel is the ideal place to stay when visiting Rome, right at the top of the Spanish steps, walking distance to the Trevi Fountain and very close to the Via , what more could you want.", "title": "Stunning hotel matches location", "helpfulness": 3, "user": "GixxerNZ", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140674162}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My room faced a courtyard and was very quiet, while other rooms had lovely views over the Spanish Steps. The rooms were cleaned very well and quickly at least twice daily.", "title": "Great city hotel", "helpfulness": 1, "user": "tomtx45", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140360391}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We went to Rome in October, and decided to stay at the Hassler, where we spent almost two weeks to celebrate our anniversary. From the moment we checked in, everything exceeded our expectations. Check-in was not only easy but personal. We were led to our room, which was beautifully and romantically appointed, with a view to the church next door. Exactly what we had hoped for on this trip! A series of welcome gifts from the management awaited us, and this touched our hearts (and brought tears to my eyes). As we explored our large room, its wood carvings and gorgeous furnishings, we also noted that it had every modern amenity quietly tucked away in small corners -- warm, fluffy bathrobes awaited us in the self-lit closet. Every light in the room, from the central chandelier to the lamp lighting the landscape painting, had a dimmer, adding to the romantic atmosphere. And the discreet (thank goodness) flat-screen television set allowed us to watch news from everywhere imaginable -- from Italy to Spain, CNN to BBC, France 24 to Germany.", "title": "Perfection achieved in the loveliest city in the world", "helpfulness": 1, "user": "ysolde", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146132086}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Other posters have spoken of the bathroom, but I have to say, WOW! It, in itself, was an amazing place. A huge jacuzzi tub, separate shower, separate toilet with bidet (married couples, in particular, will appreciate this separate toilet feature, I think ;0)), and a double sink. Add to that the house brand Amor Vero products provided (this scent will forever remind me of Rome, and, if you have a chance, purchase the fragrance; yes, it is that wonderful), and there were mornings I never wanted to leave the shower, evenings I could have stayed in the bathtub until my skin pruned.", "title": "Heaven", "helpfulness": 2, "user": "beetsWashingtonDc", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145674763}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Morning breakfasts were a delight, with a wonderful choice of eggs and every conceivable pastry (as well as many I had never conceived of, but crave to this day), all served by a staff that remembered us each day, our names, beverage preferences, seat preferences, everything.", "title": "nice BUT not recommended", "helpfulness": 2, "user": "yoavberenson", "date": "November 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 144904911}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I don't know if it's the time of year and the people who go to Rome in October, but the Hassler felt a little like something out of an Agatha Christie novel, in the best sense. We saw many of the same guests from breakfast at dinner at Salon Eva in the evenings, leading to chats about where to go, what to see, and a sense of community that large, impersonal hotels simply lack.", "title": "French luxury in the Eternal City", "helpfulness": 3, "user": "BillScurry", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144630317}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This leads me to another thing: the food! We ate at Imago, which has some of the best food in the world (not an exaggeration), served in a place with one of the best views of Rome. I had never enjoyed a meal like this in my life, and highly recommend Imago to anyone and everyone going to Rome, wherever they are staying.", "title": "Best Hotel in Rome", "helpfulness": 1, "user": "barb91", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144620940}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 5, "variance": {"poor": 17, "average": 26, "very good": 67, "terrible": 16, "excellent": 274}, "aka": "Hassler Hotel Rome", "slim_ranking": 0.0732283464567, "description": "Hassler Roma is the legendary five star Rome luxury hotel at the top of the Spanish Steps, residence of choice for a memorable experience in the Eternal City. In the heart of the city’s historic center, the Hassler is one of the best hotels in Rome, minutes from Via Condotti as well as important monuments and landmarks, including the Pantheon, St. Peter’s Basilica, the Coliseum, the Villa Borghese gardens and The Trevi Fountain. Owned by President and Managing Director Roberto E. Wirth, fifth generation of a famous Swiss dynasty of hoteliers, the Hassler Roma hotel offers 95 unique rooms and suites. Magnificent dining options within the hotel include the Michelin-starred Imàgo, the Salone Eva and Palm Court Restaurants and Hassler Bar, and Il Palazzetto Restaurant & Wine Bar nearby. Elegance, style, the highest quality service and discretion have made the Hassler Roma the very symbol of international hospitality."}