{"user_rating": 5.0, "review_count": 2315, "name": "Hotel Palazzo Zichy", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "The moment I am writing this I am staying at the hotel, so these are totally fresh impressions. First off the location: very well situated, within walking distance of the centre, in a calm area. The building itself is nicely renovated, with good taste, the decoration of the rooms also hits the perfect balance beween elegance and comfort. The staff is extremely friendly and helpful, but in a natural kind of way. the rooms are kept perfectly clean, and as far as i could understand there is good communication between the cleaning personnel and the supervisors. One minor issue is that the breakfast area could be a bit larger to accomodate the hungry crowd, but this does not mean you have to wait to get a table. to resume: i highly recommend this hotel. Btw: upoarrival My booking was upgraded to a larger room courtesy of the hotel.", "title": "just the perfect stay", "user": "lacika34", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78079468}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "A little maway from the centre but has reached a very high standard. To be adversely critical, the television screen in our room is on the small side! Everything else is fine.", "title": "Excellent", "user": "Inspector1", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77550909}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Lots of interesting restaurants in Raday Ut. Turn left from hotel, walk straight on for perhaps half a mile and then, having reached Raday Ut, turn right. We found the Lizard Etterem some 300 yards on the right hand side of the road to be exceptional. It's not yet on Trip Advisor but it will be!", "title": "Could it be better ? Absolutely superb ...", "user": "caroldunk", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77541688}, {"rating": 5.0, "title": "Stay at this hotel when in Budapest!", "text": "From start to finish, absolutely spot on. Rang from train and before I could finish, a taxi had been arranged and met us off train. Service was friendly, understated and not overbearing. Room was modern, plush and very large with all mod cons. Location was excellent in middle of downtown Budapest but not too near the hustle and bustle of the shops. Breakfast - superb anmd wide ranging choice. Only downside - the flowers were not real - hopefully next time I visit they will have put that right !", "user": "GatronomicDelight", "date": "August 21, 2010", "id": 76201100}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This lovely, modern hotel is tucked away off the beaten track and yet easily accessed via a metro stop only a 5 to 10 min walk away. A new hotel with beautiful reception area, excellent breakfast (included in room cost), internet access, and quiet comfortable rooms. The service was outstanding throughout. I would say that the staff were some of the most professional, friendly and helpful hotel employees that I have ever had the pleasure of dealing with. Breakfast was wonderful and the added value of a lounge and sitting area with free coffee/tea and water throughout the daytime was wonderful. All of this for a rate of 69 Euro!", "title": "Incredible beds!", "user": "Mike G", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76089176}, {"rating": 5.0, "title": "Does not flatter to deceive", "text": "We chose the Palazzo Zichy for a 3 night stop in Budapest of three nights to celebrate my wife's 50th birthday. Getting to the hotel from the airport was a very easy process just requiring a single transfer ticket purchased at the airport for around £1.50 each and then the 200E bus to the metro (last stop) on metro 8th stop with a five minute walk at the other end to the hotel. The hotel is in a nice square adjacent to a church. Outside of the hotel doesn't look particularly imposing once through the door is it is quite a nice building and well refurbished very high standards. The reception staff are pleasant and speak very good English deal with any requirements you may have. As previously stated there is coffee available until 5 PM. We had a superior room which although it wasn't huge was very nice and tastefully furnished very modern and had all the amenities you could ever require with a very nice bathroom and a view from the window into the square. The hotel provided a fruit bowl for my wife for her 50th birthday which was a nice touch. We thought the breakfast that was included with our room rate was excellent and very well serviced by staff. We thoroughly enjoyed our three days in Budapest thought it was a very beautiful city with magnificent buildings I would highly recommend the hop on hop off bus pass two routes and a boat trip over two days for only £14 the tickets are available from the hotel reception. Finally it must be said there are plenty of drinking and eating options in the vicinity of the Hotel with Raday Utca one of the better ones and the prices are very reasonable however we did find it extremely quiet at night.", "helpfulness": 2, "user": "allyboy", "date": "December 7, 2013", "id": 186971420}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Didn't know what to expect when we booked. Hotel seemed non descript from outside pictures and strangely unreal from inside ones. Well what can we say. Sheer delightful designer luxury. Probably one of the best hotels I have ever stayed in. It's close to the city centre which is also beautiful in its own right. Bedrooms have probably the most comfortable beds ever. Only critical of tv with limited channels. Bar area intimate and elegant, great staff. Receptionists were first class! Breakfasts had plenty of choice. Such good value. We will be back", "title": "Wow what a find!", "helpfulness": 2, "user": "Saffron0", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186934325}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "Great location one block from public transportation. The staff were extremely accommodating. Free coffee and water. Spacious and modern bathroom with a bidet. The reception area was very grand, 5 star hotel vibe", "title": "Beautiful hotel", "user": "Jackie2070", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 186906996}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Enjoyed a four night stay here in November 2013. This hotel was the prefect choice for a city break. Everything was prefect, room & food, breakfast & free coffee dock, and each and every member of the staff ensured our stay was prefect from receptionist to barman, chamber maid to waitress. I couldn't recommend this hotel highly enough. Great Location too! Thanks Judit and all your team!", "title": "Prefection!", "helpfulness": 1, "user": "Liz Q", "date": "December 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186860730}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Couldn't really fault this spotlessly clean hotel. The staff are the core gem of the establishment unothing was too much trouble for them. Rooms are beautifully designed, particularly liked the dressing room area. Lighting was perfectly adequate-recent review writers had me worried regarding the lack of light to read by-they should have gone to Specsavers! I would have no hesitation recommending this hotel to friends.", "title": "1st visit to Budapest", "user": "Alison G", "date": "December 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 186780315}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled solo", "text": "I needed an extra night in Budapest because of a schedule change on my Lufthansa flight. I selected the Palazzo Zichy because of the excellent reviews on TripAdvisor and Expedia.", "title": "Sleek, modern and ultra-professional.", "helpfulness": 2, "user": "Kathleen1819", "date": "December 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187275089}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Oh my, what a wonderful hotel!", "title": "Nothing special", "helpfulness": 1, "user": "Heut", "date": "December 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 187260517}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Sleek, modern and impeccably spotless.", "title": "30th Anniversary city break", "user": "Ian M", "date": "December 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187237988}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Check-in was smooth and seamless. I was early and I only had to wait about 10-15 minutes for my room. The professional front desk staff kept me up to date on when my room would be ready.", "title": "GREAT HOTEL IN GREAT CITY", "helpfulness": 4, "user": "MattFreind", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187180705}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "But the real treat was seeing the room itself. The room was sleek and modern. The best part is the fact that there is no carpeting in the room. For those who suffer from allergies it is very important. (Because there is no carpeting, noise might be travel a little more. Ladies, there is no reason to tromp around in high heels especially since the hotel provides slippers.) There was an incredible amount of closest/cupboard space to store everything. Housekeeping staff was excellent. Room safe could hold a full size laptop. The bed was incredible - great pillows and high quality linens. If I didn't have to leave the hotel to fly back to the States, I might still be in it.", "title": "Nice base for exploring Budapest", "helpfulness": 1, "user": "Justin_Scotland", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 187168550}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "It's ranked so high for a reason. Very stylish and well-designed hotel. Clean and beautiful. Quiet area.", "title": "Don't hesitate", "helpfulness": 1, "user": "Nick J", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 186538398}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Location: A few minutes' walk to metro and busy downtown area. Several bars and restaurants in the area.", "title": "One more voice of prais", "helpfulness": 3, "user": "SergiusT", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186519806}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Breakfast: Fantastic. Lots of options and all high-quality.", "title": "Superb hotel and great value for money", "helpfulness": 3, "user": "Simon C", "date": "November 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186306824}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Room: Comfortable. Nice view of the church down the street. Beautiful bathroom with bidet!", "title": "Innovative design and chic decor", "helpfulness": 3, "user": "DaisyClover", "date": "November 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 186231684}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Staff: Friendly and helpful", "title": "Excellent Hotel in top location", "helpfulness": 3, "user": "RROesch", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186194909}, {"rating": 5.0, "title": "Simply perfect!", "text": "If you get the opportunity to stay here then you must.", "user": "Taistealai17", "date": "August 18, 2010", "id": 75753639}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Rightfully ranked best hotel in Budapest - staff are so friendly and represent this hotel wonderfully/ The rooms and amenities are perfect and the location is just great as you are not stuck in the middle of the tourist hub, but it isnt too far from there either for sightseeing. There are plenty of local bars and restaurants nearby to enjoy too.", "title": "Whatever I needed they provided me with that!", "user": "Stefanzett", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75570168}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Everything was top of the line. The reception was great. One of the staff even followed med to the bank, for helping me with my erronds. When I asked for a massage (my legs was suffering from WC in double Ironman) they called a masseur instantly. The room was a dream and the bathroom was Royal. Breakfast and you got everything you would wish for. I will go there everytime I'm at Budapest. My partner asked me if we could move to the hotel.", "title": "Amazing boutique hotel!", "user": "Hypnos", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75476752}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This is a really good hotel, and certainly deserves its top spot in TripAdvisor. The hotel has been done in style, and it is an example for others to follow.", "title": "Fantastic hotel - it's #1 for a reason", "helpfulness": 1, "user": "noskcaJ-nevetS", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 75335521}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel building itself is a very stylish refurbished building. It is located quite centrally - on the right side of an otherwise not so nice district of Budapest. As soon as you go in you see grandeur and discreet charm. Check-in area looks great, and is done speedily and with great service. The rooms are fantastic - huge bed, spacious, stylish bathroom, and given that our room was facing the courtyard, really silent. Huge, comfortable bed, Free, fast internet, good TV choice, well furnished mini-bar, huge modern shower, these are some of the nice room appointments that delighted us - and on top of that, a really nice crib was provided for our baby.", "title": "Consider staying here while in Budapest", "user": "wheresh0uldweg0next", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74386580}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed here for three nights mainly based on the good past reviews - and weren't disappointed. I'm just sorry there isn't one of this hotel in every city we visit. The interior of the hotel is very modern but still manages to blend with the palazzo building. We had an oversized double room with ultra modern wet room (shower didn't want to get out of) with good quality toiletries and thick towels. Our bed was huge and would probably have asked for softer pillows had we been staying longer, but they were ok for a couple of nights.", "title": "Fantastic hotel", "helpfulness": 1, "user": "nottsgirl487", "date": "December 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 186774756}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "The breakfast food choice was extensive and good quality (fresh fruits, smoked salmon). I don't eat meat but had no problem finding plenty to eat. There was something for everyone - they even had large range of herbal and green teas.", "title": "Lovely hotel in central location", "helpfulness": 1, "user": "DLMCC", "date": "December 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186758515}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "After a day of walking and exploring the city, it was great to sit in the bar area for complimentary hot drinks, mineral water and snacks.", "title": "Little Gem", "user": "trents", "date": "December 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186705634}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The location is just on the outskirts of the city centre and we walked everywhere apart from our last day when we used the Metro to get to the baths because of time limits. The Metro stop is about a five minute walk away and town centre, approx 15 -20 minutes. You can buy single journey tickets from the hotel reception.", "title": "The best", "helpfulness": 1, "user": "SophieDinant", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186568972}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The hotel staff are exceptionally helpful and the whole of the hotel is spotlessly clean.", "title": "Excellent hotel in convenient area", "helpfulness": 2, "user": "minianni", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 186542971}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Having read previous reviews about the hotel, decided to book for our stay to attend the Grand Prix , we were not disappointment & the reviews very accurate. Palazzo Zichy is a great hotel - approx 10 min walk to the Danube, close to the metro. There were plenty of bars nearby, Raday Street being only 15mins walk & worth a visit for a good selection of restaurants. We were allocated a great room with walk in wardrobe & lovely bathroom with housekeeping standards being extremely high - everything was immaculate. The air con was great seemed to still run even when removing your keycard which was a plus after a day sightseeing in the summer heat. Breakfast was great, plently of choice with fresh fruit salad, pastries etc. The staff here are fantastic, nothing too much trouble and always greeted with a smile. Loved Budapest & would recommend this hotel to anyone looking to explore the city.", "title": "Superb Hotel, couldn't fault it......", "user": "dbriggs2010", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 74036046}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Great hotel - around 10 minutes walk to the river and close to tube stations - seems like a locals area with really nice bars nearby. The concierge service at the hotel is excellent (including the online version they have for before you arrive), with all the staff being extremely knowledgeable. Lovely rooms - small but extremely clean, with very powerful air con which is essential if you are there in the summer. Fantastic breakfasts - really good buffet with loads of choices and plentiful supply. Free mineral water, tea and coffee all day (until 5pm I think). Free wifi throughout the hotel. If you want thick towels, room service and grade a toiletries then you won't get them here, but everything you do get is fine, and it is excellent value for money. I really highly recommend the hotel - I would not hesitate to stay there again.", "title": "Fantastic, clean, great service - highly recommend", "helpfulness": 1, "user": "Knattster", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73266169}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "We stayed here for 7 nights in July. We had high expectations of this hotel from the reviews and were not disappointed. The room was large and stylish, the breakfast buffet was sumptuous, and all the staff - front desk, kitchen and house-cleaning - were very helpful. The location is good: on a small square in a residential area (a local folk music ensemble was performing there the Saturday afternoon we arrived), with lots of local open-air bars & cafes nearby and a 10 min walk away from Raday Utca, Vaci Utca & the Market. It's veryclose to the tram-line (along Ulloi ut i think). Very useful to have free wi-fi in the room, and also free espresso/mineral water/snacks in the lobby bar during the day.", "title": "Excellent hotel", "helpfulness": 1, "user": "nairgn", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73214239}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "Stayed only one night at the Palazzo Zichy before joining a riverboat cruise on the Danube. I was traveling with my parents. It was clean, beautifully furnished, rooms, bedding, bathrooms all comfortable, beautiful. Staff couldn't do enough -- both before and during stay. Prices reasonable. Location very good for adventuring about the city. I'd stay there again and would highly recommend it.", "title": "Amazing Hotel in Budapest", "helpfulness": 1, "user": "araliciar", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72926706}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Excellent clean room and hotel. Personnel very helpful. Breakfast great. Internet,Coffee, tea and water during daytime a PLUS.Would stay there again and can recommend the hotel", "title": "Superb", "user": "PretoriaRSAHeinrich", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72714851}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Great design of rooms and whole hotel; very helpful and friendly service employees; great breakfast with huge choice; good location of the hotel to explore the Pest part of Budapest on foot.", "title": "Exceeds expectation", "user": "spacemanuela", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72683325}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had a very pleasant stay at this stylish and trendy, yet unsnobbish hotel. The building is beautiful, rooms spacious, beds comfortable and the service is outstanding. The hotel has a very good eye for details, with free wifi, chocolate offered upon arrival, mirrors that do not steam up and complimentary coffee and tea. The location is perfect in a quiet street, near to cosy restaurants and 10 minutes walk to the centre of Pest.", "title": "Very pleasant stay!", "helpfulness": 1, "user": "AmsterdamOyster", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72680817}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "We would not hesitate about staying here at our next trip to Budapest!", "title": "one of the best boutique hotels ever!", "helpfulness": 1, "user": "bklynrocks", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72653090}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My friends and I LOVED Hotel Palazzo Zichy. The rooms were great, the breakfast amazing, walking distance to everything, and best of all....THE AMAZING SERVICE! I loved the staff. Not only were they so helpful and friendly, but they were actually very interesting and fun to get to know. The cute, young bartender was great. The other cute guys at the front desk were superb. (I'm partial to the cute guys, ha!) They even tried tracking down a cab driver who ripped me off. Btw, ALWAYS CALL CABS IN BUDAPEST! Don't worry, it wasn't a big deal, I just argued with the cab driver and didn't give him all the money he wanted. Anyway, stay at HPZ, it was great. Note to the hotel, please please keep your rates where they are, don't raise them too much! I paid 99 Euros for 2 nights (weekends) and negotiated 69 Euros for the other 2 nights. They were nicely flexible and cut me this deal. Breakfast buffet alone would have probably cost at least 10 Euros elsewhere, it was so good!", "title": "Very pretty hotel but strange location and TERRIBLE beds", "helpfulness": 3, "user": "Travellingmaestra", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 2.0}, "id": 72290464}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We were really impressed with the decor of the hotel. It was very beautiful. But the room was average to small and the bed was so hard I only slept a couple of hours. The location was odd-- on a residential street a few blocks from public transportation. Maybe we were slightly biased because we had just stayed in a 5 star in a nice location the 4 nights prior to our stay here, but Hotel Palazzo Zichy was a disappointment. We honestly would have been perfectly fine with the location and room size if the bed had been more comfortable. The staff however was very nice and helpful and the breakfast was fine.", "title": "We enjoyed our stay and would come back again", "helpfulness": 1, "user": "Derek-Barnsley", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71939735}], "location": {"country": "Hungary", "region": "Central Hungary", "continent": "Europe", "city": "Budapest"}, "stars": 4, "variance": {"poor": 6, "average": 48, "very good": 352, "terrible": 2, "excellent": 1907}, "aka": "Palazzo Zichy Hotel", "slim_ranking": 0.0059880239521, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The place where history meets present! Stay in a historical palace that was originally constructed in the 19th century and served as the residence of a Hungarian noble, Count Nandor Zichy. Located in downtown Budapest in the historical Palace quarter. Our guests will enjoy a state-of-the-art guestroom with a flat panel television, and complimentary high-speed Internet. The 80-room hotel features many free services: lounge with free water and coffee, Internet-access, @-room with 6 workstations and fitness center."}