{"user_rating": 4.5, "review_count": 183, "name": "Hotel Marina Copan", "reviews": [{"rating": 5.0, "title": "Wonderful Stay!", "text": "Had the pleasure of staying at Hotel Marina Copan on our last day before heading back to the states and it was a welcome treat after a week of digging trenches in Santa Rosa. The hotel is beautiful and the best super comfy. The staff is very nice and accommodating. The girl at the gift shop was great not to mention what a cute town it is for shopping especially. We didn't venture out for dinner instead had guacamole and chips and the bar and it was very yum. By the way, the prices in the gift shop were surprisingly great considering it was the hotel's gift shop. Really wish we would have had more time for shopping.", "helpfulness": 2, "user": "MJ24", "date": "October 13, 2012", "id": 142749996}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "All in all a great town with friendly people. And of course not to miss the ruins while you are here cause they are great too. Oh and by the way, prices for some of the souvenirs at the ruins are great. Don't make the mistake we did thinking the prices would be cheaper in town because for masks and ceramic pieces, the ruins is the place to get them.", "title": "Adequate hotel", "user": "JamesOwen", "date": "September 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 141694134}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I'd definitely recommend this hotel and town if you are ever in this area in Honduras.", "title": "Quick Getaway...", "user": "epcotgal", "date": "September 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139749075}, {"rating": 5.0, "title": "Excellent!", "text": "One night stay to see the ruins. Central hotel, convenient location, near centre and ruins. Safe area. Basic room, nice communal area and pool. Didn't eat there but restaurant looked nice. Check out mary's restaurant round the corner, great pupusas at a good price.", "user": "Maria E", "date": "July 23, 2012", "id": 135147029}, {"rating": 2.0, "stay_parameters": "Stayed July 2012", "text": "My boyfriend and I visited this beautiful resort in August 2009. He had been here before I had not. It was so tropical. The staff were all very helpful and courteous. The pool was a bit cool at first when we jumped in but eventually warmed up when we went for a swim at night. The hot tub felt amazing. There was fresh tropical frut in our room upon arrival. It took us a while to figure out the AC unit, using a remote control, but eventually figured it out. Would definitely stay again and ina great location near the center of the town.", "title": "Not for young people.", "user": "AllanSM", "date": "July 16, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 134534715}, {"rating": 4.0, "title": "Quite nice hotel, quite close to Copan", "text": "We stayed for two nights at the Hotel Marina in Copan. Because the original hotel was built for the archaeologists who were excavating the Mayan ruins at Copan, this is hotel is ideally located for tourists who wish to see the famous ruins.", "helpfulness": 1, "user": "Enyedy00", "date": "March 24, 2012", "id": 126571034}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Our stay was part of a guided tour across the Mayan sites as part of a 2012 \"Jungle Kingdoms of the Maya\" - we visited ruins in Mexico and Guatemala, and stayed in various lodgings along the way - and the Hotel Marina in Copan was certainly the nicest of the lot. It seemed quite luxurious compared to some of the more limited places we stayed earlier in the trip. For example, there was abundant water pressure and ample hot water! Nice! The rooms were clean and well lit! Beautiful flowers accenuate the grounds. An all-around excellent place to stay.", "title": "A lovely hotel In Copan", "helpfulness": 1, "user": "cbegley54", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126178615}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The only reason I don't give this hotel a full five star rating is that our room was on the first floor, and we could hear a lot of traffic outside the window.", "title": "Beautiful hotel", "user": "MarieMpls", "date": "March 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125611295}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "During a recent trip to Honduras we stayed at this lovely hotel in Copan Ruinas. Located in the center of town it was an ideal place for visiting many of the areas attractions. If you arrive by car there is secure parking provided by the hotel at no cost. As it turned out our waiter in the restaurant also provided guide services when not working or arranged for tours through friends when not available. The food and service was everything one would hope for and the small gift shop had a wide range of offerings of local items. The Copan ruins were within walking distance from the hotel but prices being as they are here a taxi ride was also very reasonable.", "title": "A delightful hotel in the center of a charming town", "helpfulness": 1, "user": "IanWriter", "date": "March 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 125508695}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We loved our room at Hotel Marina. The bathroom was amazing with a jacuzzi tub, stone tiles and huge shower. Our room was on the second floor with a balcony overlooking the garden, where we could enjoy a cup of coffee and our lunch. The pool and hot tub were very nice as well.", "title": "Best hotel on our trip", "user": "ljb2Canada", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124728294}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I really enjoyed this hotel. Although it was quite busy and has a number of rooms, it still managed to feel small and friendly with a great atmosphere. Our room was clean, comfortable beds, brilliant shower and a small balcony which overlooked a small courtyard with a lovely view beyond.", "title": "Near Copan Ruins and The Square", "helpfulness": 1, "user": "Indira", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134220421}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "There's also a swimming pool which is good to come home to after wandering around the ruins.", "title": "Jungle Oasis", "user": "Ginger H", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134127429}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Breakfast was buffet style - very good and staff are on hand to deal and respond to any queries.", "title": "Superb Mayan Adventure", "helpfulness": 1, "user": "WellingtonPhoto", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133769984}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The hotel is in an excellent location as it's very near the Copan Ruins which obviously is the main attraction. However, I loved the fact that it was close to the Square and we often went down there to sit on the wall and just relax. Local families seem to use the Square to meet, maybe have a snack with children playing games and generally lots going on,", "title": "Nice hotel near the Copan Ruins", "helpfulness": 1, "user": "CuriousMiTraveler", "date": "June 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131213121}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "I enjoyed our stay at this hotel and would very happily return.", "title": "Lovely hotel, but would prefer it to be more clean", "user": "Ani M", "date": "May 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130837021}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed three nights at this beautiful hotel in mid-December of 2011 and didn't want to leave. A gigantic room with beautiful bath, dining area and mini-kitchen. Walking out of the room is like walking into a terrarium. Beautiful flowering plants and tropical foliage. A multitude of private spaces. Even a few turtles wandering around in their private garden. Great pool. Nice restaurant, although a bit \"stuffy\". Great service. A few steps from the square in Copan Ruinas. agreat place to stay if visiting the Mayan ruins at Copan.", "title": "I'd Like to Live at this Hotel!", "user": "lmfertal", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130127464}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "This was my wife's and my second visit to Marina Copan, the former in December 2008. It is an excellent hotel, comfortable and welcoming. An unusual benefit was free WiFi in all rooms. It is a half-block from the central plaza, thus providing immediate contact with many others, with a liquor store on the far side of the plaza. The little central plaza inside the hotel has a nice small pool and other sections between rooms were filled with comfortable and pretty gardens. The bar is small but friendly; the restaurant is a little erratic was enjoyable. Parking out front is highly temporary, but somehow everybody in town makes it work. The hotel staff makes everything work well, and fix it quickly it there is need.", "title": "Best Hotel in Copan Ruinas", "user": "Dunsmurian", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129202736}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "We just returned from 5 days in Copan, and I can't say enough about this amazing hotel. It's quite large, so there are many rooms to choose from and many options depending on the size of your party. Also, there are quite a few little quiet places to relax throughout the hotel, most are located in beautiful gardens. I had to do some studying, and found a lovely little outdoor/indoor living room with a sofa next to some fountains where I camped out for the afternoon--Perfect. It has a really lovely pool, although during semana santa it was packed with kids. Despite it being full, we found a few hours in the afternoon where it was empty and we could enjoy it ourselves. There is also a hidden little hot tub that is super romantic.", "title": "Hand's Down--Best option in Copan", "user": "travelerparker", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127615447}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The rooms are beautiful--wood beams, nice finishes. The beds have feather tops, so they are squishy and soft. There are flat screen TVs, wireless internet, microwave and a fridge in each room, so bring some snacks. The room we rented had a separate bath (with a jacuzzi tub) and a shower. We never ran out of hot water, another plus. Also, each day they provided two bottles of water and coffee for the room.", "title": "Comfortable and Interesting", "helpfulness": 2, "user": "mikeyHongKong", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127110447}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "In addition to the great space and comfort, the service was exceptional. Whatever we wanted, they brought to the room in under 3 minutes. Despite the place being at full capacity, we never felt it. The breakfast buffet was delicious, and we always found space at a table or in the bar if we wanted to relax.", "title": "Comfortable stay - great location", "helpfulness": 1, "user": "Starviagera", "date": "March 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126704652}], "location": {"country": "Honduras", "region": "Copan Department", "continent": "Central America", "city": "Copan"}, "stars": 3, "variance": {"poor": 3, "average": 12, "very good": 68, "terrible": 1, "excellent": 99}, "slim_ranking": 0.25, "description": "Today, a modern hotel that jealously guards the town’s colonial architectural heritage, the Marina Copan is the most comfortable and convenient base for exploring the fascinating Maya World, as well as the diverse natural landscape, that the ancient ones left behind."}