{"user_rating": 4.5, "review_count": 208, "name": "Hotel St. Georg", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed here on 5th June to 15th June it was really good, the food was excellent with a very ample buffet breakfast and always 5 courses in the evening and we never had the same thing twice. The staff in the were always friendly and helpful and they do a packed lunch which is free", "title": "10 Lovely days at this hotel", "helpfulness": 2, "user": "DevonOscar", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164114442}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "and comes in handy if your walking in the mountains.The room wasnt huge but always very clean with a bath and shower, we had room 210 which has a balcony at the front there is a stream which some reviews have said was too noisey we didnt find it a problem. Our flight home was early and so Carl the waiter said he would get us a thermos for making a cup of tea before we left he also packed us some cheese rolls for the journey. He is a big guy but very sweet and nothing is too much trouble for him.This was a much needed holiday and it certainly ticked all the boxes for us.", "title": "Great Hotel", "helpfulness": 1, "user": "travelmum1", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163907684}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Stayed at the St Georg for a week recently and found it a very good Hotel. The staff and family who run it were all very friendly and helpful and the Hotel is very welcoming and cosy. We had 2 rooms for our family, ours had a balcony overlooking the front and our son had a room overlooking the steep hill at the back. Both were very comfortable (fantastic comfortable beds) and a really good size.The bathrooms looked very new and the showers were very powerful (and yes ladies there is a hairdryer at the mirror and a plug for your straighteners!). The standard of cleanliness is fantastic and each day by the time we had returned from breakfast our rooms had been cleaned and were spotless.We arrived the day before the floods and landslides and the next day the main street outside was like a raging torrent so most people stayed in for the day. There was a lot of disruption locally with very bad landslides and one area close by was declared a disaster zone which was awful for the people living there. Some of the railway lines were washed away on the route to Salzburg and the line was closed while we were there. Also a lot of roads were blocked for a couple of days.", "title": "Fantastic food", "user": "FearandLoathing48", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 156975474}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The food is great as a lot of people have mentioned but 5 courses every night was just too much for me personally! The breakfasts were good too but would have been good to have more croissants in the morning.", "title": "2nd visit and the same high standard.", "helpfulness": 2, "user": "Nigel R", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155873048}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Great location as it is in a lovely peaceful part of town but is so handy for walking down the hill into town.", "title": "Hotel Georg........for a wonderful holiday.", "helpfulness": 1, "user": "Pat O", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155652497}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Very friendly with good food. Quiet. Wierd Austrian twin beds that are neither a double or two single beds! Take your own kettle. Possible to ski to it from blue 16 - take the path when you see the church. All in all a good venue.", "title": "Nice place", "helpfulness": 2, "user": "ianandsuepedley", "date": "March 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 155246101}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This is a very pleasant and well run hotel with friendly efficient staff and owners. Good sauna and steam room facilities in afternoon and early evening when you need them! Warm indoor pool available all day - also good relaxing therapy! Reasonable choie at breakfast - take advantage of fresh cooked omelette at the serving station in the dining room. Very good choice and variety for evening meals - different each evening. Pleasant bar open from mid-day until midnight for apre ski or later evening relax & drink. From hotel a very easy short downhill stroll to main ski lift - the 'city express' - hotel has a mini bus as well but hardly worth getting it as so close ! Hotel has a ski & boot room that also gives late night access with your room key. If you hire skis from Intersport at the ski lift you can take advantage of free overnight ski storage to save you lugging them back to hotel. Walk into town downhill and again a very easy 5 minute stroll - good night life and bars all over the town - take your pick ! Local church of St. Hippolyte worth a visit and doesn't take much time. Good bus and train services to other local resorts. Channels 9 & 10 on local TV give live ski info and live pictures of resort slopes lifts and conditions.", "title": "St Georg ski hotel & holiday zell am see", "helpfulness": 1, "user": "johnkj", "date": "March 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155109928}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Just it was a lovly holiday at the st georg it always had good cleners to tidy up and the staff were really nice.i give it a 5 well done can not wait to stay again it is brillif u go u will have a great time and the river is really amuzing outside.we did not want to come with our family we wanted to stay,:):):)!!!!!!?????_", "title": "Brilliant", "user": "ririiie", "date": "March 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155103076}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Have just returned from our annual weeks skiing holiday in Austria. We come here each year and the Sauper family look after us brilliantly. The food is amazing and we request the same room each year and are never disappointed. Herr Sauper each morning takes us to the lifts and we can ski with no hassle of waiting for buses with all your ski equipment. Its ideally located for the town and the slopes and we love Zell for the skiing and will ski no where else. Our daughter has learned here and skiing as a family is great on uncrowded slopes - we go 1st week in March and rarely queue at the lifts. Its always clean and the staff are attentive - its great being served by Elvis in the restaurant - he's definitely not left the building!! Will be returning next year and will go no where else - who can have suckling pig on the farmers buffet and not feel spolied! A great find.", "title": "A perfect holiday", "helpfulness": 2, "user": "rob s", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154549867}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We have just returned back from a weeks ski-ing holiday and we stayed in Hotel St Georg with my husband and 2 children aged 10 & 14. We had a excellent stay the rooms was satisfactory and very clean with maid service everyday. The restaurant was of a very high standard Breakfast great choice and fresh, Apres ski snack 3pm - 5pm ranging from cakes, soup etc. Evening meal got a 4 course meal, 2 starters, salad buffet then choice of 3 meals meat, veggie, fish and Dessert.(In candlelight too which made it even better.) There is also a nice bar to chill out in after a hard day on the slopes.(as if you go into town on eve can tend to be to rowdy if got kids, ideal if not) Kids loved the pool great place to relax with a book while they had a good swim. To be honest have not got anything bad to say about this hotel as you can see they try very hard to make your stay as pleasant as poosible. You also get a news letter every morning at breakfast letting you know whats going on that day which was an excellent idea. The hotel is in a great location to ski slopes 5 min walk and to town centre of Zell am see 10 mins. All staff are pleasant enough and was only to happy to give you information or help if needed. Definately would go back to this hotel again if decided to travel to this part of Ausria again.", "title": "Hotel St Georg", "helpfulness": 4, "user": "Jewels10Rotherham", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 153721622}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed at the Hotel St George over New Year with two families. We quite deliberately chose Austria and Zell Am See in particular for its picturesque location. The town and lake did not disappoint. The skiing is intermediate not advanced but with two families was perfect. The hotel was lovely, the family are very hands on and it made it a very relaxed homey environment. I often find with non-chain hotels there are extremes with the very good being outstanding and the poor, very poor. In fairness, there wasn't anything that was very poor but hopefully you understand the point I'm making, independent hotels often lack the consistency of large chains but delight in other ways. So, if you enjoy food this is a good hotel for you - it's traditional Austrian and you need to embrace that. There were choices of main course each evening over the 5 courses, a fantastic breakfast buffet and a slightly alternative afternoon food option, ranging from tradition tea and cake through to Austrian bolied sausages and rolls!!! Ambience of the hotel was lovely as well as the lovely restaurant there was an intimate lounge and bar area. The wine list is interesting with a number of Austrian wine options which the hotel were obviously proud of - my wife had a glass of white one evening and it was actually quite pleasant. The rooms were, just, ok, functional and given the cost of our holiday a little disappointing but only because the look and feel when we arrived at the hotel promised more. All was clean and comfortable but it just didn't wow us. Would we stay again? Yes we would actually.", "title": "Home spun family run", "helpfulness": 1, "user": "Trowster67", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 152192765}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Well been to the St Georg with herr and Frau sauper and team for 4 years now! Full cooked and cold brekkie and a 5 course evening meal with 3 main course choices as standard... Inc, as always 2 special evening meals during the week. Great wine tasting with herr Elvis. I've stayed during the winter and driven down from england to the hotel in summer, everything from fam. Sauper is perfection. Skiing in zell is good for a week or two, for the latter been to visit a friend. The hotel is so close to the city express gondola but the hotel gives a courtesy bus to the trassxpress every half hour. I would say the only problem I have found recently in Austria (not the hotel) is the influx of Russian tourists who believe they can not be heard! I.e they're loud, slamming doors and seem very rude not in this hotel but everywhere I've been... Hotel st Georg is great value and great location in winter and summer for all! Thank you for great memories fam. Sauper, Mark.", "title": "Five times in this hotel now :))))", "user": "Mark L", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152063789}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This was our third stay at the St. Georg and was absolutely perfect again. A lovely warm cosy hotel and the staff and family Sauper are most welcoming. We have definately found a superb hotel and would always stay here when visiting Zell am See. The food was excellent once again and we always looked forward to the afternoon snacks after skiing.followed by a delicious evening meal. We have found a real gem of a hotel and will certainly return again and again. We love it!", "title": "Another wonderful stay at the St. Georg", "helpfulness": 1, "user": "benYorkshire", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151373074}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We celebrated my 60th birthday here with our family. The staff went out of their way to make the ocasion special including a cake on the last night.", "title": "Wonderful", "user": "revstephvdt", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151104511}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Our room was so comfortable with a stunning view. The food was incredible. The family did energetic things while I rested . The bar was comfortable and the afternoon snacks deliciously welcome.", "title": "Wow!!! Please Keep this one Secret!!", "helpfulness": 1, "user": "JJTKVDT", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150960213}, {"rating": 3.0, "stay_parameters": "Stayed February 2013", "text": "I was expecting the hotel to be excellent but it was merely good.", "title": "Not as fab as I expected", "user": "Starshaped", "date": "March 2, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 153510845}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The positives:", "title": "Tired hotel needing tlc", "helpfulness": 3, "user": "captainblueblood", "date": "February 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 153079283}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Location is lovely. Short walk from town so it's both convenient and peaceful.", "title": "Near perfect !", "helpfulness": 1, "user": "Phil10127", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152929066}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The courtesy bus to one of the lifts is fab. You can walk to one ski lift also.", "title": "Comfortable friendly hotel", "user": "BillHollowday", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152926443}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Some of the staff are lovely including the owners and the restaurant waitresses.", "title": "Needs updating", "helpfulness": 1, "user": "wally h", "date": "February 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 152602303}], "location": {"country": "Austria", "region": "Austrian Alps", "continent": "Europe", "city": "Zell am See"}, "stars": 4, "variance": {"poor": 6, "average": 10, "very good": 30, "terrible": 3, "excellent": 159}, "aka": "Hotel St Georg", "slim_ranking": 0.127659574468, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Hotel St. Georg - the elegant country hotel in Zell am See. We are certain that you will feel very much at home in our hotel, which is run by our family Sauper. The cable car City Express is only a few meters away from us - also the Schmittenhöhebahn is nearby - Golf: 30 % reduction on green fees, alpine skiing resort, Zeller lake, walking map, birdwatching-specialist."}