{"user_rating": 4.5, "review_count": 390, "name": "Hotel Hessischer Hof", "reviews": [{"rating": 3.0, "title": "Disappointed", "text": "This hotel is a member of The leading hotels of the world and the first thing I noticed was the dirty carpet in the lobby are, near the lifts. I mean really dirty.", "helpfulness": 6, "user": "nireno", "date": "November 3, 2004", "id": 2804694}, {"rating": 5.0, "title": "Luxurious Hotel", "text": "The reception area is small and the still use keys, not swipe cards to open the room door.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 26, 2004", "id": 2602065}, {"rating": 5.0, "title": "Lavish hotel with a plain facade", "text": "The rooms are good size and mini bar is complimentary. The restaurant is very good. Last day of our stay our check out was at 2pm. We went out to do some shopping and when we returned to the hotel room, the maid already took the sheets off the bed and threw them on my suitcase. He was cleaning the bathroom when I told him that we haven't checked out yet.His response was that it's ok, we can continue packing. I was really upset, went down to the reception and they called him out the room. I never had that shower that I was going to but I got an apology from the reception.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 18, 2003", "id": 858312}], "location": {"country": "Germany", "continent": "Europe", "city": "Frankfurt"}, "stars": 5, "variance": {"poor": 14, "average": 16, "very good": 68, "terrible": 8, "excellent": 284}, "aka": "Hessischer Hof Frankfurt", "slim_ranking": 0.011320754717, "description": "The Hotel Hessischer Hof, is the only privately owned 5 star accommodation in Frankfurt. Enjoy the comfort of a traditional luxury hotel, incomparable service and personal hospitality.The only hotel in Frankfurt that offers an extraordinary value included in the room rates: WiFi, Minibar, pay-tv, daily hospitality suite with free welcome drink and snacks from 6 pm to 8 pm as well as shoe shine service and fresh fruits in room. Enjoy the comfort of a traditional hotel with exceptional service."}