{"user_rating": 1.5, "review_count": 13, "name": "Hotel Santa Marta", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "THIS IS THE lWORST HOTEL I EVER STAYED AT!!!! We saw the reviews in Rick Steves and Frommers and booked based on the reasonable price - this turned out to be the worst mistake ever. I cannot describe how disgusting this room was...There walls were filthy and actually seemed to have footprints on them, the built in wooden furniture was rotted and decaying, the sheets were stained and full of suspicious holes (as if insects had eaten through them). The final straw was that the air conditioning in our room was not working and the weather was close to 40 degrees celcius. When we politely asked for another room, we were told that the hotel was full and none was available. This seemed suspicious as we saw no other guests and all of the room keys were still behind the reception. We left and booked another hotel for the same price, only to find out that they still charged us for the night's stay. I think this was extremely unreasonable considering they could not provide a room with air conditioning as promised - they did not live up to their end of the bargain and then unfairly charged us for the night. OVERALL, we travelled for 6 weeks in Europe and this was the ONLY hotel that I hated. Customer service is atrocious, the rooms are revolting. Do yourself a favour and stay elsewhere!!!!!", "title": "Disgusting!", "helpfulness": 2, "user": "honeymoongalore", "date": "August 11, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 18844901, "likes": {"liked": "— NOTHING", "disliked": "— EVERYTHING"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Small depressing room without window, unfriendly staff. I would have accepted the low standard for half the price I paid.", "title": "good location, bad accommodation", "helpfulness": 2, "user": "PaolaPRome", "date": "June 27, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 17274322, "likes": {"liked": "— location", "disliked": "— room"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I found this hotel in Rick Steves' 2008 Italy guide. He had discribed it as fresh tranquil, basic rooms. The room was anything but fresh. The Hotel had raised its price from €140 to €210, with the cash discount, since Rick Steves' review. We had reservations for 3 nights and the hotel required “payment upon arrival”. We paid for our 3 nights, over $1,000, and went to the room. It had a bad odor of a dirty dish rag, it had dingy sheets, mold in the bathroom, & garbage stacked up outside our window. The toilet made a loud screeching groan when flushed and the tank leaked. I tried spraying Frebreeze in the room without any improvement. We tried to stick it out (for 6 hours) & then a spider crawled across my foot--this was not exactly what I expected for a room that was over $300/night. I told the attendant our issues with the room & after calling her supervisor she refused to return any of our money for any of the 3 nights (over $1,000) that we had paid for. We left anyway and stayed at the sparkling clean, professional & friendly--Hotel Spadari--just a few blocks away. The cost was €2.00 less per night than at Hotel Santa Marta! I've been using Rick Steves' guides for 18 years & have always had good to great experiences. This is the first time that I felt totally ripped off!", "title": "Worst Hotel Experience Ever", "helpfulness": 2, "user": "jmanchester03", "date": "June 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 16549095, "likes": {"liked": "— Smelled, didn't look clean, over priced"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "Hotels in Milan are all over priced. The low end starts just under 100 Euros. If there is an event in town, prices and availability get worse. This hotel was recommended in two travel books. I booked a single room for 100 Euros during the weekend of the Grand Prix. Some of the single rooms in this hotel are in the middle, with only transent window going out to the hall. Decore is basic. But, the rooms are clean, A/C works. Hotel is a 10 minute walk to the Duomo and Galleria. If you are on a budget and must stay in Milan, this place will be OK.. just nothing outrageous.", "title": "Decent for the location", "helpfulness": 2, "user": "ravenspirit", "date": "September 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8841586, "likes": {"liked": "— Price", "disliked": "— No windows to outside"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "Location for this place is wonderful, however that was the only redemming factor at this hotel. I read in a few guidebooks that this was a spacious hotel, it is not, at least our room wasn't. I had to jump over the bed from myside of the bed in order to use the bathoom, but that wasn't the problem with the hotel. The room was very very sterile, yellow walls and green tile floors lit up with a flourecent light in the ceiling. The worst part, however, was the smoke. We couldn't figure out where it came from, we realized it came from the staff even though there was a no-smoking sign throughout this hotel.", "title": "Do not stay here!!", "helpfulness": 10, "user": "chrisbiv", "date": "February 27, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4559615}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe", "city": "Milan"}, "variance": {"poor": 1, "average": 3, "very good": 0, "terrible": 9, "excellent": 0}, "aka": "Santa Marta Hotel", "slim_ranking": 0.859770114943}