{"user_rating": 4.5, "review_count": 694, "name": "Hotel du Vin at One Devonshire Gardens", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed there for one night and regularly use high quality hotels across the UK. This is the first time we've stayed at a Hotel Du Vin. The staff were really helpful and so pleasant, all appeared to be well trained and were constantly checking that our needs were being catered for. The food was very good and the range of wine impressive. The superior room was luxurious and I enjoyed watching the wall mounted TV whilst in the deep tub. The paint around the windows could be refreshed. Overall we have often paid more in leading hotels for a far less luxurious and enjoyable holiday and we will return.", "title": "Luxury at reasonable rates", "user": "Mary B", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159801628}, {"rating": 3.0, "title": "Passed its prime", "text": "As part of a long weekend in Scotland my wife and I stayed for one night at Hotel du Vin, Glasgow. On reading the Trip Advisor reviews we were hopeful of a very comfortable stay.", "helpfulness": 1, "user": "Edmund U", "date": "May 5, 2013", "id": 159707212}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Things we liked:", "title": "Special Occasion, Special Hotel", "helpfulness": 1, "user": "Louise B", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159190276}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "- easy parking", "title": "Excellent", "user": "Hans Henrik D", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159071965}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "- staff very friendly and helpful", "title": "Reliably smart", "user": "lyfliyfhv", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 158925689}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "As Yorkshireman who thinks that £100 per night for B&B is extravagant I am probably not well qualified to review this hotel, but we had a rather pleasant weekend there anyway.", "title": "Luxurious and comforable - a real treat", "user": "RP-HebdenBridge", "date": "April 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 158827634}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "On arrival we were greeted by the friendly and helpful be-kilted David who couldn't have done any more for us, taking the bags, showing us round our room and telling us about the place. By contrast the service in the bistro (especially at breakfast) was lacklustre and we found ourselves waiting for service, being offered food which should have been for other tables.", "title": "Never disappoints!", "user": "Patrick H", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158637114}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "At a whopping £140+ for the room and £17.50 each for breakfast I feel the prices are eyewatering, but then to be charged £7.90 for 2 cups of tea after the evening meal - and then find a 10% \"service charge\" added on top when we checked out the next day (this when we'd had to sign the chit for the teas before they'd even arrived) is really taking the proverbial! We wished we'd gone back to our room and made the teas ourselves.", "title": "What all the fuss was about!", "helpfulness": 1, "user": "scottbor", "date": "April 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 158506813}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Mind you it is a really interesting place to stay with a special feeling about it - and once again thanks to David for making it so memorable.", "title": "Perfect getaway", "user": "falkirktravellers", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158262179}, {"rating": 4.0, "title": "Lovely lunch but you don't expect mucky seats", "text": "Have been fortunate enough to stay at this wonderful hotel on about 15 occasions, and it never, ever disappoints. A true test is that many of the staff that were there years ago still are there, and they greet us like long lost friends every time we arrive.", "user": "Fi M", "date": "April 16, 2013", "id": 157968147}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Its all about expectations and anticipation. We arrived tired and maybe slightly grumpy. My expectation: we would be greeted with a welcome and a smile and helped with bags up the hotel steps. The reality - we struggled up the steps and found a slightly harassed looking receptionist on the phone, too busy to acknowledge our arrival. Quickly rescued by a wonderful chap in a kilt who should be running the place. Room wonderful, spacious, excellent facilities. Dinner superb. Request for tea and cake seemed to be too complicated. Breakfast atmosphere that awful hushed tone where you daren't speak. Scrambled eggs disappointing.", "title": "Much was wonderful but some things could be better", "helpfulness": 1, "user": "PAH2008", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 157866117}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I like this hotel. It's got understand class written all over it. It's one of those places to chill out in rather than party hard.", "title": "Classy hotel", "user": "josefk68", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157822398}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Check-in and porterage to our room was efficient. Room was huge and bathroom massive (mind you the prize for the biggest bathroom still goes to the Fullerton in Singapore) and both were well fitted out.", "title": "Wonderful!!", "helpfulness": 1, "user": "magsy123", "date": "April 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 157480997}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Bottle of bubbly was chilled and ready to go.", "title": "Classy", "helpfulness": 1, "user": "Zabza29", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157238034}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Dinner and breakfast were very good.", "title": "Luxury and Opulence shame about the slow service", "helpfulness": 1, "user": "Maindip", "date": "April 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156975652}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "This is by far the best hotel in Glasgow. Situated in a smart end of the city, you are not on top of shops and restaurants - but all are close by and the neighbourhood is lovely a quiet. The hotel is a collection of traditional townhouses, ensuring that it oozes character and style. Rooms are spacious, well designed and ours had a quirky feature of a glass door that opened next to the bath tub to allow someone to soak whist still feeling part of the room. There was also a fabulous walk in shower. The room offered a Nespresso Machine, complimentary WiFi and was very comfortable. Staff are super friendly and helpful throughout. The restaurant offers good cuisine (but I felt it was a little fussy) and there is a pleasant lounge bar. Parking is free and they also accept dogs (with a basket and bowl in your room as part of making everyone feel welcome). A great hotel.", "title": "Great hospitality", "user": "Globaladventure", "date": "May 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160258254}, {"rating": 4.0, "title": "Luxurious!", "text": "Having stayed at the Cheltenham and Edinburgh branches, I must admit that this is truly special. Situated in Glasgow's affluent West End, it's a 15min walk from Ashton Lane's bars and pubs. The room we stayed in was a club double which is only one up from their standard. It was luxurious, very roomy with a separate dressing / bag area which led onto a grand bathroom. In terms of swanky hotel rooms....this is definitely up there with the rest. From what I hear- they \"don't do small rooms\". The staff were VERY friendly and made us feel really welcome. The only downside was that we only had 1 night stop over in Glasgow. Definitely need to go back!", "user": "vicky d", "date": "May 9, 2013", "id": 160168505}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We have just had another wonderful stay at Glasgow Du Vin: where do i begin to describe the elements that make a stay here so great? well firstly the building: a beautiful victorian house with amazing staircases topped by original, stunning stained glass windows: large high ceilinged rooms with original features such as cornices,fireplaces large wooden doors:en-suite bathrooms equipped to a very high modern standard, many with roll top baths and walk in monsoon showers. High quality little extras abound, from high magnification mirrors by the washbasin to an excellent sound system for your music. Each room is interesting and different. Next,the staff who cannot do enough to make sure your stay is perfect: from the lovely welcome by David in his full highland dress, the bags brought to the room from the car and as far as possible your every wish is granted! - if you have any requests or concerns they only need to be mentioned and they will be responded to in a professional and pleasant manner. I am very fussy and like to choose my dining table and even have a choice of bedrooms. we all have our own specific wants, preferences and needs and in my experience once these are expressed they will be met. A stay at Du Vin isn't cheap, but it's such a superb treat- we always try to stay once a year when passing through Glasgow on our way to the west coast. I love this part of Glasgow too, near enough the city but not in it: just round the corner from the interesting Hyndland area shops and cafes .......and much much more to do and see if you can bear to leave the luxurious surroundings of the hotel!", "title": "Still the most wonderful hotel! Where Victorian architectural beauty mingles with the best modern fixtures and fittings", "user": "meg100", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160035381}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed here before heading off to a cottage in the Highlands for a break. It proved to be a really good choice. The building is in a very good setting close enough to the centre of Glasgow for access but far enough away to be relaxing. We found all of the staff to be welcoming and highly professional. Our room was excellent and the food very good. They also have a very comfortable, clubby bar for drinks and a fantastic range of whiskies which they are happy to guide you through (which they do knowledgeably). This is part of a chain and you have the occasional reminder of that. But I found it to be very good value for money and an enjoyable experience.", "title": "Lovely setting, very good service", "user": "robiati", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159881932}, {"rating": 3.0, "title": "Good but not all its cracked up to be.", "text": "Considering they claim to be a four star hotel I was disappointed with a number of issues during our stay. They did offer a discount on the bill when I told discussed them on checking out, which I accepted. The food was well presented, different but pricey for what you get. The room allocated on arrival hadn't been cleaned, we were charged for a bottle of wine we never ordered, during the meal at least two other parties also queried items charged with the waiting staff, not what you expect from this standard of hotel. Would I return, probably not.", "helpfulness": 1, "user": "Aberdeenvoyager", "date": "May 6, 2013", "id": 159815837}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Glasgow"}, "stars": 4, "variance": {"poor": 23, "average": 45, "very good": 132, "terrible": 3, "excellent": 491}, "aka": "Hotel Du Vin At 1 Devonshire Gardens", "slim_ranking": 0.0574712643678, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}