{"user_rating": 4.0, "review_count": 595, "name": "Hotel V Frederiksplein", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "i stayed here and really enjoyed it. The only bug bear was the continental breakfast which i did know about before hand but really would have preferred something more to my taste. However despite this I loved the hotel staff were lovely and very accommodating and there were tea and coffee available on request 24/7. It was quite noisy as we had a room at the front of the hotel but you don't go to Amsterdam to sleep!!! Lovely hotel very clean modern, not a family hotel more for couples and friends. this was great value for money as it was close to Dam and red light district but not to close. Definitely recommend it!!", "title": "home from home", "helpfulness": 1, "user": "sedwar", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 131877905}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Spent three nights with friends based on their recommendation of Hotel V and left feeling content. The young vibe to the place and great common area were the highlights, especially the fireplace where a last night drink was a must! Averagely priced, medium sized rooms and good service made our stay enjoyable. A good location with direct access to the tram line. All around recommended.", "title": "Three Nights at Hotel V - Amsterdam", "helpfulness": 1, "user": "shenry86", "date": "June 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 131652262}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The staff was mildly friendly, but unfortunately my group was treated like second class citizens. Accusations were made that we broke things and charges were left on our credit card with no proof. The hotel was extremely noisy and for these reasons I would highly reccomend staying in another location. The stair well to the third floor was extremely narrow and steep one must be very careful not to trip or fall. Disaster!!!", "title": "Do not stay in this place", "helpfulness": 1, "user": "Matt G", "date": "June 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 131407381}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Stayed here with friends at the end of May / early June 2012. We found the hotel to be clean and tidy it was a little noisy but this is mainly down to the doors and stairs in the buildings rather than its location.The rooms are small and I do mean small but do the job for a short stay. Some of the stairs are in the hotel very steep so you need to be carefull. Breakfast is light continental, and is fine to start the day. It's well located for attractions and there is a tram stop right outside if you dont want to walk . Overall we enjoyed our time at Hotel V and I would recommend it.", "title": "Hotel V", "user": "gtnsjn", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 131213914}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I loved our stay in Hotel V. The lobby is incredibly nice, the staff was knowledgable and really helped us with recommendations on what to see in our 3 days in Amsterdam. The room was incredibly small, but it was clean and I slept extremely well. With that being said, we kept our fan on during the night as it is easy to hear other people in the halls or stairway. With the fan on, I didn't hear anything though. The included breakfast was excellent, and the location was wonderful as it was quick to walk. We rented bikes from a place recommended by the hotel and could get to everything on our site seeing within 10 to 15 minutes. Great place to stay!", "title": "Excellent staff, great hotel", "user": "the1ndonly", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133757145}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "When you first arrive at the Hotel V it gives an impression of being a cool, young hotel. When you get to your room any hopes of a chic Amsterdam stay are quickly ruined.", "title": "Good staff and location, terrible room", "user": "Jo C", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 133514883}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Our room was in the separate building (room 3), in the basement and the only small window was directly under a walkway. The room itself was no more than 7ft x 7ft with a double bed and some form of fabric 'wardrobe'(?). The room also didn't have a security safe although the staff did let us lock some valuables in the main reception safe. Good job as the housekeeper kept opening the ground level window every time they came in!", "title": "Minimoon in Amsterdam", "user": "Lindsay S", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133177590}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The bathroom was small but functional and well decorated.", "title": "Disappointing with room for improvement", "user": "cloudsteph", "date": "June 30, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "location": 4.0, "service": 2.0}, "id": 133108874}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "One other main problem we had was that the weather in Amsterdam was very hot during our stay and the room only had a floor fan. Unfortunately directly underneath room 3 is heated pipes which always seemed to be turned up full!", "title": "Great Place!", "user": "EKLaura", "date": "June 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132814892}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "3 nights at the Hotel V in Amsterdam; Positives: Hotel is very centrally located 5 min from Rijksmuseum and 10 min to Centraal station; Easy walk to Leidsplein and Rembrandt square. Staff is great very friendly and helpful, even helped carry luggage. Rooms are small but very clean and bathrooms modern. It is located across from a tram stop and easy to get around AMS. Negatives: The rooms are small, and I mean small. Not that big of a deal for me since I wasnt in the room that much but probably would not stay more than 3-4 days as it would be claustrophobic at that point. Bathrooms are tiny tiny, can barely move around in them. I stayed in a new part of the hotel with a very steep staircase which, quite frankly, is probably a little dangerous. All in al though it was a good stay.", "title": "Overall a good buy...", "user": "sguntupalli", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134277924}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The pros:", "title": "Recommended if happy with a small room", "user": "CW88", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134277508}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "very friendly and helpful staff", "title": "Amesterdam", "user": "SilvaSetubal", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 134177976}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "good location - close enough to main tourist areas, 10 mins from station, some nice bars and restaurants nearby", "title": "I honestly don't understand why people love this place", "helpfulness": 1, "user": "Bcoper", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 5.0, "rooms": 1.0, "location": 5.0}, "id": 134067510}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "tram stop directly outside", "title": "There's something about Hotel V", "user": "sam-abroad", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 133779255}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at the hotel when it had just opened and advertised being a four star design hotel, so we expected a funcky design, cool new clean rooms and nice bed.", "title": "Cramped and Cold Rooms", "helpfulness": 2, "user": "NZChef", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 14485275, "likes": {"liked": "— Friendly staff at check n", "disliked": "— Cold, cramped rooms, no space, poorly designed"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The floors in the room were black looked well worn and so cold, my partner hardly feels the cold and could not walk on the floors in bare feet. The rooms were so tiny, there was no desk or table to put bags or anything ion in fact, you could not even walk around the sides of the bed. No draws or any space to hang or put clothes and jackets. No robes or Slippers or toiletries (except soap) on offer. In the bathroom we had to put the toilet seat down to have somewere to place our towels and toiletries while we showered, It fell below the ranks of a cramped and tiny room. Lift could only fit one person at a time and the hallways were all black, showing every mark and looking worn already. Staff were friendly.", "title": "So So...", "helpfulness": 2, "user": "LondonPerez", "date": "March 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 14288165, "likes": {"liked": "— The decor", "disliked": "— The location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Very trendy looking & modern but I was a little disappointed. The hotel is quite a way from the city centre, it took us about 20 mins to walk to Dam Square. I recommend taking the tram, number 25 goes from Centraal Station to right outside the hotel and runs about every 15 mins. The staff were relatively pleasant, however my requests for an iron went unanswered and the room was only cleaned once in our 3 night stay. The 'breakfast' consists of bread, ham, cheese, jam, cold eggs and some mini pastries. All in all I would say that there are other three star hotels in Amsterdam that would provide a much better base for exploring the city.", "title": "Stay at a very stylish freinds house", "helpfulness": 2, "user": "InspectorBaggaley", "date": "March 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14089998}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "The hotel is aimed at 20,30 somethings who either dont have the resources or dont see the point in paying the prices of the 5 star boutique design hotel brigade. The hotel is a short tram ride from the centre of Amsterdam in a nice area full of cafe's, restaurants and boutiques and a stroll around the area you will find lots of lovely little streats and canals. The lobby is really well laid out and designed in the one open space (with the smallest lift in the world, i used the stairs) the rooms are small and have the basics, but what is in the rooms is of a high quality (lovely bed and bedding, big flat screen TV, excellent shower) 1 thing i would ask the management to think about is a bit of info in the rooms about the hotel and services and maybe the local area. The one negative for the rooms would be sound proofing isn't excellent but to be honest i didnt really notice it too much at night as the bed was too dam comfortable and sent me straight off (or that could have been the fine produce of the local cafe's). The staff were a little unsure of themselves but this can be forgiven as this was opening weekend and they were still very attentive and warm. Breakfast was simple but a good use of high quality produce (see a theme running here). All in all a really well thought out hotel for those who want a high quality individual hotel without all the unessential extras.", "title": "Clean, cool, Dutch design at an affordable design, with a great location.", "helpfulness": 2, "user": "GlobalDavidG", "date": "March 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14088873, "likes": {"liked": "— Crisp, Dutch design.", "disliked": "— Can be kind of noisy, but tolerable."}}, {"rating": 3.0, "title": "Good location and breakfast, friendly staff", "text": "I would recommend this hotel. The staff were friendly and helpful except for the breakfast attendant on our last day when we arrived early for a pre-arranged snack prior to an early flight. Reception staff particularly were always ready to assist with bookings, information, directions and suggestions. Buy museum tickets through reception to jump the queue at popular sites. Breakfast was excellent, fresh and comprehensive. Our room was very small, and the bathroom tiny but functional. Our room was at the front and noisy due to the trams, but this was not a major worry as they seem to cease operating through the middle of the night. A good central location.", "user": "Michele N", "date": "June 23, 2012", "id": 132592873}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My boyfriend and I just spent 3 nights at the hotel and it was overall a decent experience. We loved loved loved the hotel's location as it is only 5 minutes by tram from central station and the tram-stop is right 5 meters away from the hotel's front door. The staff was fantastically helpful and friendly. The breakfast was generous, tasty and healthy (there was a remarkable number of organic products such as jam, cheese, butter, ham, etc.). The lounge was stylish and cosy. Tea and coffee were for free the whole day until 12 o'clock at night. There are several shortcomings, of course. My boyfriend was not so pleased with our bed as it was a bit too hard, as well as the sheets and the quilts didn't feel like cotton. The mirror in the bathroom were too high for me (but, magically, it was somehow lowered the next day without us knowing exactly when). We were absolutely unhappy with the shower as the water force was not strong enough and the shower door could not be closed causing water all over the place. The room, as many people have mentioned before, was quite tiny for a double room, but it has a very nice balcony. However, it was a good stay. If those shortcomings could be improved, hotel V would truly rock!", "title": "Good hotel, yet needs improvements.", "user": "NatalieHoang", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132470699}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Hotel has been declared \"green\" I am sure, hence low wattage bulbs in the few light fixtures,. We stayed for 4 nights, and it was good in all aspects with the exception of the small, small room. Two people could not fit in the bathroom, and I could not use the mirror at all, as it was too high to see into. The bed was incredibly comfy but there was no floor space. There was a closet, thankfully, so we were able to hang some clothes. There were two goose-neck lamps attached to the head of the bed, to read by. My husband banged his head on one, when rolling over. The only other lighting was a low wattage decorative light fixture in the middle of the room and one portable, small lamp that we moved to the desk area, and other areas we needed to SEE. When we were packing to leave the night before, we could hardly see to do so. The following morning was an early flight, so there still was not any light from our window to see to pack our things. Please, turn up the wattage on these few lights, even the bathroom! The ultra modern design is trendy, but impractical in so many ways. The location is ideal for access to everywhere via tram. Oh yeah! The elevator is 2 feet by 2 feet! When we arrived, I was able to get on with the carry-on luggage. My husband had to wait for the elevator to come back to collect him. He had to \"really suck it in\" to have room for himself and the suitcase to get up to our room.. Staff was great. We would probably find a place with a little more space and definitely better lighting. It would be fine for one night, I suppose, but by 4 the claustrophobia really settles in. WIFi was great, breakfast very good.", "title": "If you like DARK, this is the place!", "user": "Marl2012", "date": "June 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 132152518}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 3, "variance": {"poor": 48, "average": 109, "very good": 253, "terrible": 16, "excellent": 169}, "aka": "v Frederiksplein Hotel", "slim_ranking": 0.338235294118, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Hotel V Frederiksplein opened in 2008 and is located in the city centre. It has 48 rooms with lots of light and excellent beds. All designed with love and eye for detail. Each room is different and has a compact but comfortable bathroom with powerful rain shower, flat screen tv and free wifi. A complementary breakfast is served each morning in the impressive lobby."}