{"user_rating": 3.5, "review_count": 48, "name": "Hotel Olympic", "reviews": [{"rating": 1.0, "title": "Mediocre, vulgar and miserly.", "text": "After spending a wonderful week in a great hotel in the area of Agios Nikolaos (Iberostar Mirabello), we spent a terrible extra night in Crete in this place due to the delay of our flight.", "helpfulness": 4, "user": "Ulick", "date": "August 3, 2007", "id": 8283804}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The hotel is located in the very centre of Irakleio, which is not exactly Paris. Our room was small and dull, with the carpet full of stains. We found hair on the pillows (some others of our group found clothes in the closet). It was terribly hot inside, but you couldn’t open the window (looking a narrow patio with all the air conditioned machines) because it was even hotter. You couldn’t turn the air conditioned on, either, because was too noisy for sleeping.", "title": "Average hotel, good value", "helpfulness": 1, "user": "Fil0", "date": "June 13, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "rooms": 2.0, "location": 3.0}, "id": 7845677, "likes": {"liked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "On the morning, we kindly requested a document, in order to make a complaint before the company. It was impossible to obtain a single paper from the hotel, despite the fact that it was true that we spent one night there.", "title": "Unbelievable Value", "helpfulness": 4, "user": "travellove71", "date": "June 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5290107}, {"rating": 2.0, "title": "Mediocre", "text": "I did not pay anything for the room and seemed to me awful. What if I had to pay for it!", "helpfulness": 1, "user": "NadirAhmad", "date": "May 17, 2006", "id": 5147337}, {"rating": 4.0, "title": "Good hotel", "text": "The hotel was centrally located with modern bathrooms, but our toilet seat was broken. The service was mediocre and the hotel was average, but the price was very good for the area.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 18, 2004", "id": 2459255}, {"rating": 5.0, "title": "Highly recommended 3 star", "text": "This is by far the most luxurious 3 star hotel I've ever stayed in -- marble and brass everywhere and it seemed to have been recently remodeled. It really seemed more like a 4 star hotel. I think it is in an excellent location in the center of Heraklion, only 1 block from the outdoor market and it's easy walking to the pedestrian mall, shopping, the two main squares, and the archaelogical museum. Parking is the only downside. There's cheap parking available about 4 blocks away.", "helpfulness": 4, "user": "WoodlandsRob", "date": "March 18, 2004", "id": 1730100}, {"rating": 2.0, "title": "Noisy", "text": "We stayed at the Olympic hotel for 1 night last year. The hotel is fine, but the location makes it very noisy. There was traffic noise until past midnight, which started up again at about 4 am.", "helpfulness": 6, "user": "Jackie505", "date": "January 18, 2004", "id": 1555893}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 3, "variance": {"poor": 7, "average": 17, "very good": 12, "terrible": 4, "excellent": 8}, "aka": "Olympic Hotel Heraklion", "slim_ranking": 0.433333333333}