{"user_rating": 2.5, "review_count": 433, "name": "Hotel Talanquera", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2004", "text": "I went there with my boyfriend two years ago. We both are young students and only expected to have sun, a nice beach and clear water.... we really didn't care about the hotel comforts, the staff-service etc.", "title": "Not for comfort or luxury...", "helpfulness": 5, "user": "mone_j", "date": "February 8, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4446722}, {"rating": 1.0, "title": "One word - Terrible!", "text": "We had quite a small room, not perfectly clean, with almost no water coming out of the shower!! The staff was ok but not unbelievably nice... The food wasn't unforgettable either, but there was a lot of choice. The evening animations were awful but they made us laugh. The beach of the hotel is small and full of people, and there are thousands of gadget-sellers who are kind of annoying.... We would recommend to walk along the beach to find some quiet places. Don't miss the sunset which is amazing!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 6, 2006", "id": 4417057}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "Well, to conclude, if you just want to have a nice holiday with \"sea, s** and sun\" it is perfect. But if you are looking for a good hotel, very clean, good service, amazing food etc this is for sure NOT the place to go!! We had a nice offer to go there, so it was worth the price and we had a lot of fun. But there are probably some totally better places around there...", "title": "Ok if it's just the guys, we can rough it !", "helpfulness": 6, "user": "rickeggett", "date": "January 29, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4394880}, {"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "We arrived at the hotel (after a horrible bus ride there) to find we had to wait ages to check in.", "title": "Avoid Absolutly", "helpfulness": 4, "user": "fx2001", "date": "January 19, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4364858}, {"rating": 2.0, "title": "Beware The Weekend Invasion", "text": "Once we checked in the room was very damp - there was condensation dripping down the walls and even the bedding felt damp. The floor was covered in pools of water which caused me to slip - 1st accident of the holiday. The next one was when I turned the bedside lamp on - because the wire had been trailing in the water it sparked and I got an electric shock.", "helpfulness": 28, "user": "NiamaWalker", "date": "January 19, 2006", "id": 4362039}, {"rating": 3.0, "stay_parameters": "Stayed April 2002", "text": "its true when they say you get what you pay for. it was my first trip so i was just happy to be there. the ride from hotel, checking was great. i didn't like the fact the club opened at 11pm so not to many people went. the pool is small and with so many kids around, good luck relaxing. oh and the beach....dont expect to have peace and quiet...i was asked a million times if i wanted braids, they dont take no for an answer....finally i gave in and on the same day i took them off...forget it they were bugging me again. on the last night, it was pouring rain, so the next morning i packed in 2inches of water....and this was a suite on the second floor. the food was great and the service. if you're buying tee-shirts, buy them in town,2bucks. i payed 7 dollors for each from a store vendor...they saw me coming lol. my friend's silk pagamas were gone, guess someone liked them...we didnt report it. i wouldnt go back to this hotel but i am going to a more upscale one in a couple of weeks in punta cana so lets see if the saying is true .....you get what you pay for.", "title": "average", "helpfulness": 6, "user": "babyirissa", "date": "March 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4595299}, {"rating": 5.0, "title": "brilliant holiday!!!!", "text": "i loved this place i only stayed for 1 week with 2 friends and my fella we went as 2 couples, the staff were so friendly and the food was different but very nice, the entertainment staff were great and put on some really good shows at night and kept everyone busy throughout the day i would recommend this to anyone and definatly go again", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 2, 2006", "id": 4568591}, {"rating": 2.0, "stay_parameters": "Stayed April 2005", "text": "the gardens are beautifull with loads of exotic wildlife roaming about.", "title": "mmmhh ok", "helpfulness": 4, "user": "Welshtotty", "date": "February 28, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4564986}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "there is a local bar just down the road which plays english music with pool tables which one of the staff took us down to i really enjoyed it....we particularly liked one of the staff (i think his name was) ronaldo he was so nice and helped us out alot!", "title": "Pick Another Resort!", "helpfulness": 6, "user": "Mainechill", "date": "February 20, 2006", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 3.0}, "id": 4473162}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "deffinatly try this place out !!!!", "title": "Nice ground's", "helpfulness": 3, "user": "Cubbybear57", "date": "February 16, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4464562}, {"rating": 5.0, "title": "Amazing Vacation!!!", "text": "My three girlfriends and I stayed at Talanquera from Jan. 1 to Jan. 8,. 2006. We are all in our mid-twenties.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "January 15, 2006", "id": 4353975}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "I cannot even begin to describe the time we had at this resort. No...it was not the best hotel I've been to, but even with all the mishaps..It was great.", "title": "a few mishaps, but lots of fun and sun!!", "helpfulness": 16, "user": "ELMOKOGUT", "date": "January 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 2.0}, "id": 4325822}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "Room was a little small, a little smelly, and service was not that great. We asked to change room on the first day, and by the last we were still in our original room.", "title": "You get what you pay for", "helpfulness": 11, "user": "bschoenb", "date": "December 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 4310645}, {"rating": 2.0, "title": "room is bad, everything else is ok", "text": "Also, food was mediocre, but you have to know what to expect when going to these places. I have stayed in 5 star hotels and let me tell you that the food was not THAT much better there.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "November 30, 2005", "id": 4155504}, {"rating": 2.0, "title": "OK, but not Great!", "text": "The beach was also very small, many trees, a lot of shade. However, compared to other resorts on the strip it was quite nice.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 28, 2005", "id": 4147992}, {"rating": 1.0, "title": "The worst vacation ever", "text": "We were supposed to stay 2 weeks in this resort not knowing what it really was. The rooms were dirty, moldy and smelly. The bathroom was even worse, feces, gum stuck to everything: really gross. The “noise” of the disco every night until 2:00AM makes it impossible to sleep at night.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4131662}, {"rating": 4.0, "title": "loved it", "text": "The food was so bad that I got food poisoning and we had to flight back home. I am still very sick after one week and going for IVs everyday at the hospital and taking antibiotics.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 31, 2005", "id": 4076613}, {"rating": 3.0, "title": "Better than expected, yet still, you get what you pay for..", "text": "I would not recommend this resort to anyone.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "September 25, 2005", "id": 3937553}, {"rating": 4.0, "title": "Barcelo Talanquera is fantastic", "text": "Hi we just got back from the Barcelo Talanquero Beach Resort we had a beautiful trip we were there from Oct 21 to Oct 28 .The food was great there was not alot of flies it was very clean. our room was great the maid came every day the only thing is they do not have washcloths they use hand towels so when we go again we will take our own wash clothes the pools were clean and the staff were very nice it a great place to take your children lots of children programs It was like we were in paradise with all the beautiful flowers and trees the beach was very clean and nice to if you get a chance go to the coco beach trip and the horseback riding is great to transportation is very expensive try to get one driver and keep him all the time you are there if you go hope you will have a wonderful time like we did", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 12, 2005", "id": 3897361}, {"rating": 4.0, "title": "Great food, great people", "text": "My girlfriend and I went to the DR for a week-long getaway from New York/New Jersey. We are both in graduate school and didn't want to pay alot, and the Domincan Republic is the cheapest destination in the Caribbean right now. We also didn't need much more than a bed, some food, booze, and a beach. After reading tons of reviews and comparing many different resorts in the Dominican Republic, we settled on Telanqera. I should start by saying that we are well-traveled, used to 4-5 start hotels in the Carribean, but are by no means high-maintenance. We wanted a simple, inexpensive, no-frills vacation. And that's exactly what we got.", "helpfulness": 10, "user": "bamamama", "date": "August 29, 2005", "id": 3813068}], "location": {"country": "Caribbean"}, "variance": {"poor": 89, "average": 71, "very good": 112, "terrible": 114, "excellent": 47}, "aka": "Talanquera Hotel Juan Dolio", "slim_ranking": 0.6, "description": "The Talanquera Resort is ideally located just steps away from Juan Dolio Beach. Perfect for nature lovers, this 120 room hotel is nestled amongst gardens and native trees giving the hotel grounds the appearance of a tropical forest. This beachfront property is only 45 minutes from Las Americas International Airport (Santo Domingo), 90 minutes from La Romana International Airport and 10 minutes from the town of Juan Dolio. Some of the facilities are: 120 rooms - Air conditioned Garden view or Ocean view rooms, fully furnished with 1 king bed or 2 double beds, bathroom with shower/tub combination, hairdryer, satellite TV, mini fridge, coffee maker, safety deposit box ($), balcony or terrace (Max occupants. 4 persons) Guests enjoy 3 pools (including kid’s area), 1 buffet restaurant,3 bars (beach, pool and Disco bar), daily activities, Introductory scuba lessons ($), Snorkeling, Kayaking, Aerobics, beach volleyball, shows & entertainment. Internet access is available at the lobby ($), tours desk and gift shop available within the hotel grounds.In the Juan Dolio area within 10 miles you can also find: casino, golf courses, restaurants and shops."}