{"user_rating": 3.5, "review_count": 308, "name": "Hotel Indigo Scottsdale", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "This Hotel was simply awesome!! I went to Scottsdale to enjoy spring training baseball and had a great time and it all started with the Indigo Hotel. The staff was great and the rooms were unbelieveable. This Hotel is so close to Scottsdale Stadium that you can walk to the games with no problem. They are also located in a very trendy area with lots to see and do. This is the best hotel that I have ever stayed in!!", "title": "Awesome Hotel!!!", "helpfulness": 1, "user": "wacchampions", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26764719}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Located on a quiet street in downtown Scottsdale, this is one of those hip, modern remakes of a 70s era motor inn. It features clean, no-frills modern design and overall, I had a good if not memorable stay. Got a good price on Hotwire... it was virtually empty when I was there. Self-parking is free. Friendly staff, though there aren't that many of them. I'd really rate it 3.5 stars, but since I can't on this site, I'll give it 4 because I got a good night's sleep and they treated me well.", "title": "Older motor inn remodeled into a modern, hipster hotel", "helpfulness": 1, "user": "Andrew W", "date": "March 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 26090140}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My wife and I travel several weeks throughout the year both on business and leisure. The service at this hotel inspired us to finally sign up with TA and share our wonderful experience. That’s how great it was! This hotel is truly a hidden gem. Having been to Scottsdale several times in the recent past, I was surprised to not have heard of the Indigo sooner. Usually we stay at the Firesky or Hotel Valley Ho. Recently we even paid the heavy price to try out the new W, which wasn't really worth it. That review to follow soon. We are very fond of the other resorts and have always had pleasant experiences. However, they simply cannot compete with the value and personality of the Indigo. The location is impossible to beat. You are surrounded by numerous restaurants, bars and entertainment venues, all within walking distance. Being so close to Scottsdale Fashion Mall is a huge plus too; for the wife anyway. We did find that the area was buzzing during the weekend in the immediate area and can understand how this activity could be a distraction for some guests. We read some other reviews citing the neighborhood noise, and are glad to have tried it out anyway. The entrance is quirky and doesn't do the rest of the hotel justice. Beyond that, the place is gorgeous! I think this hotel is about being in the middle of the action while still being able to provide a relaxing and charming experience. New gym, fantastic patio/bar area and phenomenal service. There front line staff and especially bartenders are some of the best we have ever experienced in all of our travels. Indigo is our new home away from home in Scottsdale!", "title": "Impeccable Experience", "user": "jackmill", "date": "March 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25756916}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I stayed at the Hotel Indigo for five nights while on a mini vacation. The location made it easy to visit all points of interest. The room was amazingly clean, and the bed extremely comfortable. My only complaint was that there was no refrigerator in the room, and the breakfast menu was too gourmet for our tastes and pocketbook. This made it inconvenient to have a quick breakfast in the room before we headed out for the day. We are considered \"senior citizens,\" and certainly the staff looked like they were teenagers, but they couldn't have been more friendly and helpful.", "title": "Great for the price!", "user": "GalaGreenfield", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 24986163}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I live in Scottsdale but my boyfriend was visiting in town and I wanted to stay the night somewhere 'special' and near Fashion Square and Old Town's Nightlife. So we opted for the Hotel Indigo Scottsdale as the hotel's website made the place seem boutique and cute. (I have a pet peeve for ugly hotel rooms). When we arrived around 7pm that evening I was informed by the guy working the front desk that my card was 'declined because I had to have $200.00 deposit on my card' although I had enough on there to cover the initial room's expense ($130.00) and 4x that amount in cash that I was intending to pay with anyway. He had a 'tuff luck' and antipathetic attitude as he sent us away to the nearest bank to add funds to cover the $200.00 deposit, \"and if you don't soon we'll have to charge the account anyway because we have a 24 hour cancellation policy\"...uhmm..yeah..I'm not trying to cancel..", "title": "Average Hotel, You get what you pay for. Maybe Less.", "helpfulness": 2, "user": "CaliforniaLuv", "date": "February 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 24766529}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Me and my husband booked a stay at this hotel through Travelocity hoping to get away from the cold weather for a nice relaxing getaway in Scottsdale. What a mistake. The reviews seemed mixed (although I should have sorted them by worst first) so I thought we would give it a try. First the room decor is stark and mismatched. It is supposed to be modern but it is creepy and dorm- like. There are few lights in the room and the ones that are there shed a creepy light, almost a black light look to them. The shower stall is gross and the tiles didn't look very clean, we actually went out an bought our own cleaning product to spray on the tile because we were freaked out . Our first night music started from the pool outside and lasted until at least 1 or 2 am. We were unable to go back to sleep that night, so the next morning we called and moved rooms. This was a mistake because at around 2 am we were once again awakened by this loud booming bass coming from one of the many clubs in the area. I finally decided to just get up and go work out in their 24 hour gym at 3 in the morning, when I left my room there were drunk people in the hall making me feel very unsafe. The third night we were totally sleep deprived by this point we were again awake at 2 am by the loud bass plus roaming people in the hall laughing and carrying on. We finally just checked out very early that morning. We had called Travelocity to try to switch hotels but because it was part of a package we were unable to. We got home so tired and sick from lack of sleep it had to be one of the worst trips ever. It was like a nightmare literally we dreaded the night!", "title": "Never Again- A Nightmare That We Couln't Escape From!", "helpfulness": 1, "user": "MichiganRoo", "date": "February 10, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 24430278, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "i booked this hotel using a travelzoo promotion which included a 20/day food and beverage credit. i was amazed when i booked it that such a rate would be available over the christmas week for a resorty destination such as PHX/Scotts but now I know why. Its the old story...you get what you pay for. A number of people have commented on the location of the hotel and that is probably its greatest asset and greatest flaw all at the same time. It is tucked away on a side street off the main drag of Scottsdale Rd so it was a bit hard to find. But the real kicker is that it is in the heart of the clubbing district of downtown Scottsdale. So very centrally located to restaurants, shopping and clubs but NOISY. The NOISE is a threefold problem which is only amplified by non soundproofed windows. Firs there is the street noise from the clubs, second there is the hotels own soundtrack BLASTING all day and night and third is the paper thin walls between hotel rooms. I also agree with several comments regarding room design and layout. Its IKEA on crack. A very uncomfortable bed, a glass shower stall partition with a big circular hole in it for the water to leak out of, draws that are not deep enough to hold much of anything, poor lighting, windows that dont open to allow fresh air in, no carpeting. Parking that competes with all the nightly visitors to Scottsdale clubland. This was by far one of the most unrestful hotels stays I have had in a long time. Oh yeah and the food..well...glad I didnt pay for it either. If you want a central Scottsdale location at a cheap price, this hotel cant be beat. If you want NOISE all day and all night, this hotel cant be beat.", "title": "caveat emptor", "helpfulness": 2, "user": "freqtraveller1", "date": "December 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 23105921, "likes": {"liked": "— location", "disliked": "— noise"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008", "text": "This hotel is WEIRD!", "title": "Weird Hotel- Modern on Bad Steriods", "helpfulness": 1, "user": "madera99", "date": "December 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 2.0}, "id": 22981194, "likes": {"liked": "— Nice Bed, Big Flatscreen TV, Free Internet"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "I certainly understand modern and contemporary design, but this hotel just tried too hard and did not get it right. I think they caught an IKEA clearance sale when they furnished the place.", "title": "Excellent Hotel and Service A1All The Way!!!!!", "user": "MyKai", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22750659, "likes": {"liked": "— Everything!!!!", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "The location is weird- in downtown Scottsdale but not on a major road. It's tucked into a neighborhood.", "title": "Great Location", "user": "kv7", "date": "December 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22564764}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "We spent one night at the Indigo Hotel and were impressed with the innovative decor, very modern and yet elegant. The room was clean, beds were very comfortable. The lobby was very inviting and relaxing. We only had one meal at the Hotel (breakfast). The menu was very original, and the food delicious.", "title": "Original design, great stay!", "user": "kikeyluisa", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22331617}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We would definitely recommended it and would come back.", "title": "Once again....great", "user": "CRF2000", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22331436, "likes": {"liked": "— Staff, great room -- contemporary design", "disliked": "— No complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "This is not the first time that my husband and I have stayed at the hotel. Each time we have had the same experience...wonderful. We have stayed at the hotel with our kids and without...staff likes to make your children feel welcomed...entire staff is extremeley friendly, informative, and accommodating...great bartenders...they are engaging and fun. Asked us if they could recommend any restaurants, have someone make reservations for us etc ...nice..We live in town and love to stay at this hotel for a quick \"vacation\". I highly recommend staying at the Indigo...couldn't get a better location..you are surrounded by restaurants, bars, shopping!! Because of the location, when you want to cab it...you don't have to spend a fortune. For you locals...great place to grab a drink with friends (sit outside on the great balcony) and get some munchies...best popcorn in town! Enjoy!", "title": "Great Experience", "user": "#1METSFAN", "date": "November 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 21845146, "likes": {"liked": "— close proximity to old town scottsdale and the price I paid", "disliked": "— small pool"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Stayed at this hotel over the Veterans Day weekend with my 17 yr old son as we were in Phoenix for the Nascar race. I booked the hotel through Hotwire and was given an unbelievable rate of $50 per night. After reading previous reviews I was somewhat scared about the so-called noise and service. Nothing can be far from the truth. From the moment we arrived on friday 11/7/08, we were treated with nothing but first class service normally reserved for 5 star hotels. They checked us in early and called the room to make sure everything was ok. The fact that we booked through Hotwire had no bearing on the type of room we had or the service that was provided. I did not find the hotel noisy and the room was quiet. I was not bothered by the hardwood floors and did not hear the guests in the room above me.", "title": "Loved everything about Hotel Indigo", "user": "LaurenNScottsdale", "date": "November 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21790834, "likes": {"liked": "— Architecture", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The pool is small but adequate. The hotel and room is perfect for singles or a couple. If I came back to Arizona with my wife and kids I probably would not stay here as the hotel is not suited to handle 4 people in the room and is geared for couples anyway. I did not see young children during my visit.", "title": "Friendly, attentive, Staff at the Indigo, comfortable room", "user": "ladHelotes", "date": "October 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21345339, "likes": {"liked": "— The comfortable beds and the shower", "disliked": "— Hard to adjust the air conditioner/room temperature"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I travel to Scottdale frequently, about once every 2 months to visit Dad, so we vary the hotels to keep things interesting. Our last visit (for Dads 93 birthday) we chose the Indigo. What a fun hotel...decor put you in a great mood immediately.. We selected an executive suite and it was very, very nice. Plenty of room, nice view, comfy bed and linens with plenty of pillows. I also liked the Aveda products. Wood floors a definite plus and the room was very clean. Everyone at the hotel was exceptionally friendly, especially the bar tenders who seemed to be in a perpetual good moods. This hotel is a \"keeper\" and we will positively return on future visits.", "title": "Loved the Hotel Indigo - Great atmosphere", "user": "garyandsue515", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29466165}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Very nice hotel filled with great personalities. Everyone my husband and I came in contact with was delightful. The location is fantastic. We were able to walk just about everywhere. We also tried their complimentary car service. This was a great perk. Of all the dozens of hotels we've stayed in during our coast to coast trip so far, this was by far the best. We even extended our stay to an entire week after having so much fun here. Clean, wonderful service and convenient location to all the action. We'll be back!", "title": "Definitely Coming Back", "user": "onthemove48", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28799932}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This was our second time staying at Hotel Indigo.", "title": "Great location, great price", "user": "alwayz_on_vacation", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28218941}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The hotel is modern and clean and in a great location with easy access to many restaurants, bars, shopping, casinos, etc.", "title": "Made friends we will remember always - never felt so welcome!", "user": "kwtraveller22", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27183824}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "The rooms are very nice and the bed very comfortable with lots of extra pillows.", "title": "What an awesome hotel in an unbelievable location!!!", "helpfulness": 1, "user": "howbabe", "date": "March 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27066657}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 38, "average": 60, "very good": 88, "terrible": 28, "excellent": 94}, "aka": "Scottsdale Hotel Indigo", "slim_ranking": 0.746835443038, "description": "Boutique Hotel in Downtown Scottsdale, Arizona Boasts Affordable Luxury Hotel Indigo Scottsdale is a boutique hotel located in trendy Old Town Scottsdale, within walking distance of the area's outstanding dining, entertainment, sports, spas, shopping and galleries. We're just minutes from world-class golfing, casinos, area attractions and stunning desert scenery. It's the perfect home base for your stay in Arizona. Escape from the ordinary. A welcome alternative to mainstream hotels, our downtown Scottsdale boutique hotel evokes an air of serenity and comfort. It's unique design intrigues the senses and satisfies your need for relaxation and renewal. Hotel Indigo is just minutes from Phoenix s Sky Harbor Airport (PHX) and numerous popular destinations such as ASU, Scottsdale Stadium, Desert Botanical Garden, Scottsdale Fashion Square, WestWorld and Chase Field, where many events are held, including Barrett Jackson Classic Car Auction, FBR Open, Arabian Horse Show and San Francisco Giants Spring Training. We are conveniently located near companies like McKesson, Wachovia, General Dynamics, Motorola, Boeing, Merck and Scottsdale Healthcare. Suited for the business traveler, Hotel Indigo Scottsdale features complimentary Wi-Fi throughout the hotel, a business center and our state-of-the-art fitness center. We also offer a full-service restaurant and lounge, a pool and a complimentary shuttle service within a 3 miles radius."}