{"user_rating": 4.5, "review_count": 291, "name": "Hotel Parc St. Severin", "reviews": [{"rating": 4.0, "title": "Bang for Location", "text": "Elizabeth from Maryland", "helpfulness": 7, "user": "ElizabethMaryland", "date": "August 30, 2007", "id": 8588583}, {"rating": 4.0, "title": "Parisian home away from home", "text": "August 29, 2007", "helpfulness": 1, "user": "TripGen", "date": "August 21, 2007", "id": 8465510}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We have just come back from a 4 night/5 day stay at this small cozy hotel in the left bank of Paris. It took me months to research this trip, taking everything into consideration (cost, location, amenities). If your aim is to absorb as much of Paris in a few days, this is the location for you. The Louvre, Musee D'orsay, Notre Dame, a boat ride on the Seine, the Pantheon and of course the Saint Severin Church are pretty much in your doorstep. Not to mention Cafe's and restaurants on the side streets around the hotel. The staff spoke English and were very friendly and helpful. They had umbrellas for us when it rained one day and helped us find our way around. I just told them where we were going and they plotted out our walking plan and the occassional bus and metro ride. Our room had 2 balconies with cascading flowers, a clean and modern bathroom with a tub and shower, a safe, anda small refrigerator. Basically it was clean and simple and roomy enough for Paris standard. It was elegant without going over the top. I'd been to Paris a couple of times before and knew not to expect a huge elevator or ice machines around the corner or even a shower curtain in the bathroom (I guess Parisians like to take baths and not showers). We were very happy with this hotel particularly the fabulous location.", "title": "A lovely, well-situated hotel", "helpfulness": 3, "user": "MummyC", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8421891, "likes": {"liked": "— The location", "disliked": "— The window of my bathroom was overlooked, but there was a blind."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2003, traveled as a couple", "text": "I've stayed at this hotel twice this year so far, in April and in July, and I'm going back again next week (late August). I have stayed at quite a few hotels in Paris over the last 20 years, but have settled on this hotel as my \"Parisian home away from home\". I travel often with my young adult children (early 20s), and they really like the location. Very touristic area, to be sure, but lively and fun, and close to several Metro and RER stations .", "title": "A gem in a great location!", "helpfulness": 5, "user": "PokeyPaddler", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8263008, "likes": {"liked": "— The location", "disliked": "— Room just a bit small"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "As others have said, the rooms are not super-chic, but they are clean, mostly good-sized rooms with nice large bathrooms. Even the small single rooms, one of which my godson stayed in, are really nice with good-sized baths (especially for a French hotel.) Staff is very helpful and friendly.", "title": "OK hotel, some problems", "helpfulness": 3, "user": "TripGuys", "date": "July 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 8056612, "likes": {"liked": "— Location to center", "disliked": "— Look and feel of the hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We have just returned from a two week stay at the Parc St. Severin. It's \"our\" hotel in Paris. We've been many times, and we have tried others, but this is the one we always return to. While it's in the 5th arrondissement in the admittedly touristy area between the Blvds St. Michel and St. Germain near all the Greek and fondue restaurants, that also means that it's central, close to two metro stops, there are always plenty of people around to make it safe, it's fun and exciting--and after you retire for the night, the double glazing on the windows keeps the room quiet.", "title": "Parc St. Severin and Beatrice--both gems", "helpfulness": 2, "user": "FloridaTravelmum", "date": "April 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27291077}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Most of the rooms, at least those in the lower priced brackets, are typical of the standard mall sized left bank hotel rooms, but they are nicely furnished and impeccably clean. A recent remodel also means that the lobby, sitting room and breakfast room are all stylish and pleasant. They have a nice supply of travel guides to consult and even a take one-leave one library.", "title": "great location and good value for paris", "user": "jumpinhorsedad", "date": "March 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 25466435}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "But what's best about the Parc is the staff. They are uniformly pleasant, caring, friendly and helpful. Chief among them is Beatrice, the wonderful young woman who most often handles the front desk. She is cheerful, witty, can suggest great places to dine and describes the dishes in animated terms. A recent description she provided of a dessert at a nearby restaurant brought to mind the deli scene from \"When Harry Met Sally.\" By the time she'd finished, I just wanted to shout--\"Ill have what she's having.\"", "title": "My new favorite hotel in Paris!", "user": "Blake663", "date": "February 16, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 24623666, "likes": {"liked": "— It is in the heart of the latin quarter, but very quiet and calm.", "disliked": "— The breakfast isn't the best deal around. 13 euros for a cup of coffee and toast."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "The hotel has a couple of rooms on the top floors with terraces where you can have your breakfast overlooking the spires of the St. Severin Church. These tend to get all the special attention, but whatever room you stay in, you'll be well treated, experience great peace, comfort, cleanliness and excellent service. We return again and again and we shall continue to do so.", "title": "Warm and Friendly", "user": "newyorker02", "date": "September 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19840498}, {"rating": 5.0, "title": "A romantic hotel", "text": "rooms are small of course for north american standards but cozy and clean. and we also got a legitimate double bed (which is rare for a lot of europe) Comfy and small. Breakfast was a disaster so don't pay extra or count on it as a great start to your day. quiet part of paris and close to everything you want to see and do. great cafe's, bars and restaurants - the selection is fantastic and right around the corner from this hotel.", "user": "travelgalVancouver", "date": "August 29, 2008", "id": 19492036}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We just returned from our long trip throughout Northern Europe, with a week prior in Paris. I made the reservation with the hotel directly about 8 months out. This was a fantastic place to stay for the money. We stayed in room 43 with a great view. There were windows along the whole side of the bedroom and they continued into the bathroom. We did not hear anything from any room around us. This was a great location, near many many sites and transportation choices. One thing that was very nice about the hotel was the air conditioning. I like a cold room, and the a/c was awesome! The maid turned it off each day when she cleaned, but it really cooled right off again when we returned. The beds were nice and firm. A must for my husband. The elevator is big enough for 3 people... that's it! NO suitcases. My husband had to bring ours up one by one by himself. There was plenty of room for our 5 large suitcases and 2 carry-ons. We did not have the breakfast for the extra charge each morning. There are too many good places to eat. Everyone at the front desk was friendly and spoke perfect English. It is like the other hotels we have stayed in Paris... you leave your key with the desk when you leave and ask for it again when you return. We will definitely stay here again. Hopefully this helps someone.", "title": "A great stay at the Parc St. Severin!", "helpfulness": 1, "user": "Hylasgirl", "date": "August 14, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 18960702, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We have stayed at the Parc St. Severin at least twice a year over the last 10 years and were thrilled to see that they had done very nice upgrades in lobby and certain rooms. The lobby has been transformed from 70s orange to a very comforting dark blue/grey/green. In the sleeping rooms, the switch to flat-screen hotels saved a bit of floor space and, according to Corinne, the efficient and capable manager, carpeting and draperies were also replaced in some rooms. Of course, all of this came with a pretty steep increase in room rates---from 135 last year for our particular room to 165 this year. The truth is, the 165 euro rate---and more---seemed to be consistent with the rates for other 3-star hotels in the area so it's hard to complain.", "title": "Great Hotel, Nice Updates", "user": "Capitol Hill", "date": "July 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17626522, "likes": {"liked": "— Lovely rooms, great location, gracious staff", "disliked": "— No complaints"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The plumbing has always been a little uneven---tubs don't drain well and, in fact, some of the tubs are just plain hard to climb in and out of. All in all though, given the location, great staff and recent updates, this continues to be a wonderful Paris hotel choice.", "title": "Misleading è management needs improvement", "helpfulness": 1, "user": "hhp", "date": "July 4, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 17509599, "likes": {"liked": "— located in Latin Quarter", "disliked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I was having a trip through France and hoped to stay in traditional French hotels. This hotel showed a beautiful photo on website and brochures, which was alluring to book a room at a relatively high price. When I arrived, I found that the hotel does not look like a French hotel at all from either in or outside. And when I wanted to take a look at the beautiful balcony view as shown in their brochure, I was told that I was not allowed to go up to the balcony. What was insulting was that the hotel Asst Manager accused that I wanted to enter the guest room where the balcony is located. This is very unprofessional and unacceptable.", "title": "Gem in the Latin Quarter", "user": "Violetcrumbled", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16604206, "likes": {"liked": "— Location", "disliked": "— Absolutely nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "Positive thing about the hotel is the location in Latin Quarter which has a lot to offer.", "title": "Sure to Return in the Future!", "user": "CourtneyLove", "date": "April 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15001209}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Just stayed overnight at the Parc St Severin during a busy 2 1/2 week vacation. The Latin Quarter location is convenient. The LQ is all within walking distance and the Seine, IIe de la Cite -& St-Louis very close by. The Metro is just a few short blocks away for sightseeing.", "title": "fun LQ location", "helpfulness": 1, "user": "tricia27", "date": "February 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 13907364, "likes": {"liked": "— friendly staff", "disliked": "— no taxis"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Our room was ready at 11am, and everyone was very friendly from management to housekeeping. Room and bath were very clean, and no one could have been friendlier.", "title": "Location Location location!", "user": "Quest I", "date": "February 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13884655, "likes": {"liked": "— Location", "disliked": "— noise"}}, {"rating": 4.0, "title": "Location and sweet employees count for a lot...", "text": "Note-The hotel is undergoing refurbishment, and currently all the walls are bare and painted white (hopefully while they await redecorating). It does give a very stark appearance to the hotel, and offers no charm, but for the one night it was fine.", "helpfulness": 1, "user": "PalmaPerez", "date": "November 26, 2007", "id": 11061823}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "The only complaint we had was re taxis. The hotel is tucked away and removed from the main streets, and while a taxi rank is by the Seine, they are not always available. We needed a taxi the next morning since we had too much luggage for the Metro/RER. They were unable to prebook a taxi for the next AM, and said they could just call in the morning. Turns out during morning rush hour taxis were NOT available in the LQ by radio or Taxi rank. Desk called every 5 min, we searched the streets as did the manager once she showed up. Finally after 1 1/2 hours my DH flagged one down. Although they tried hard to get us a taxi, shame on them for not knowing how difficult it would be at that hour and for not suggesting car service, and shame on us for not thinking of it early enough. I may still consider staying there again, but only if I had pre-confirmed transportation or planned to use the trains.", "title": "irresistable,", "helpfulness": 7, "user": "JOHNNYDODGE", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10090733, "likes": {"liked": "— great rooms and staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "Just got back from a week stay. The location is perfect, however, there is a restaurant next door and is pretty noisy until closing time. Our room was practically next door, so it may be quite in the other rooms. The staff is great. The downside was the paint job in the lobby. They were painting in the morning making it impossible to try the hotel's restaurant. But, now the lobby and restaurant look great. It wasn't that big of a deal. I would definitely go back despite the noise.", "title": "Lovely small friendly hotel - great location", "helpfulness": 5, "user": "wurzelgirl", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8716163, "likes": {"liked": "— Staff and location", "disliked": "— Noise outside - passers through and nearly traffic"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 7, "average": 18, "very good": 107, "terrible": 0, "excellent": 159}, "aka": "Hotel Parc St Severin", "slim_ranking": 0.0909090909091, "description": "The latin Quarter: the heart of romantic Paris. Right on the corner of a pedestrian street, the Parc Saint-Severin Hotel lies just across from the cloister of Saint-Severin and the gardens of the National Museum of Middle Age. No more than a stone's throw from the Sorbonne, Notre-Dame and the banks of the river Seine with their picturesque bookstalls. A warm and spacious lobby greets you, and the well appointed bedrooms are full of light."}