{"user_rating": 4.5, "review_count": 364, "name": "Hotel del Mare", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We have just returned from 4 nights at the Hotel Del Mare. We went for a middle of the road priced hotel and weren't disappointed with the Del Mare. Everywhere in Sorrento seems to involve hills and steps so we were expecting a lot of walking. You either end up in a hotel where you are on the right level for the town and have to walk down steps to the sea or in a position like we were at the Marina Grande where you have to walk up hill to get to town. There was a bus which picked up 100 yards fro mthe hotel which only cost 1€. My advice for Sorrento is to expect lots of walking. The breakfast at the hotel was good with quite a selection - mainly continental but a little cooked food too). We requested a sea view room which we got for the last 3 nights of our stay. From what we could tell there were only 2 rooms where you would see the sea (rooms 401 and 402). These are both based at the top of the hotel and the door of your room leads right out onto the roof terracse which is handy for sun bathing and cosy to watch the stars and the sea at night! We were in 401, the only problem with this is that it is right next to the lift so you do hear wirring when it's being used. Didn't bother us too much though and we are light sleppers. We had read previous reviews about paying the bill at the end of the stay and them not taking cards. Well they do now as we paid by Mastercard (think they took VISA too).", "title": "Good value hotel", "helpfulness": 4, "user": "TBTA", "date": "July 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 5512023, "likes": {"liked": "— View from our particular room", "disliked": "— The hills"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Overall we were disappointed with this hotel.", "title": "Smallest rooms I have ever experienced", "user": "greensimba", "date": "July 21, 2006", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 3.0, "value": 2.0, "rooms": 1.0}, "id": 5494032}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Cons: The room basically was all bed we had no where to put our luggage without tripping on it. The shower, although had decent pressure, could barely fit one person. Our window looked right into another building's window. 10-15 minute walk to downtown Sorrento.", "title": "Good value for the cost", "helpfulness": 2, "user": "pemquid", "date": "June 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5380887}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "Pros: Marina which had several nice open air restruants was right around the corner. Breakfast was very good.", "title": "Warning for this hotel", "helpfulness": 2, "user": "jobeStockholm_Sweden", "date": "June 6, 2006", "detail_rating": {"service": 1.0}, "id": 5316395}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We stayed the Hotel del Mare in June for 5 days, and were pleased overall with our experience. On the plus side, we very much enjoyed the location. .Though it's 10-15 minute walk down from the \"main\" part of Sorrento, we enjoyed the walk, and it was very nice being in the little fishing community of Marina Grande, away from the hordes of tourists and the hustle-bustle of shops, etc. There were several good restaurants down there, where we ate 3 out of our 5 nights. Also on the plus side were the roof terrace, with great views, and the huge breakfast spread. Because the hotel seems to cater to the British, there was the typical hot breakfast (eggs, meat, etc.), plus cold meats and cheeses, every day, along with the more usual cereal, yoghurt, breads, pastries, etc. This was the only place we stayed in Italy (out of 4) that had fresh fruit--and lots of it. The public areas were very nice, and there was a bar. On the negative side, this was the smallest room we stayed in Italy, though having traveled in Great Britain and Europe before, the room size was not unexpected. There were no hangers in the ardrobe, and when we asked for more, they brought them right away--but only 4 hangers for 2 of us for a 5 day stay. The housekeeping was also a bit odd, or maybe we didn't know the appropriate conventions; for several days, we did not receive fresh towels or a bath mat, and the same wet towels greeted us at the end of the day. We've been in places where there was a sign indicating that if you want to help conserve resources and use the same towels, to hang up the towels, or if you want them changed, to leave them on the floor. that must have been the case here, but they didn't give any notice of it. Also on the negative side, we had booked the room through Italyby, and the confirmatory e-mail clearly stated we could pay via cash or credit card. This was our last stop in Italy, and we'd planned on paying by credit card. However, I was in the lobby using the internet (5 E for one hour--rather steep), and heard someone else checking out who knew he was supposed to pay in cash. I checked with the clerk, and he said we had to pay in cash too. Since we still had time to get to a Bancomat, we were able to get the cash (500 Euro for 5 nights), but I wonder what would have happened had it been too late to get the cash? I didn't bother to go get the e-mail to show the clerk, as it was easier to just get the money rather than argue over it.", "title": "Just needs better directions!", "helpfulness": 1, "user": "amiller16", "date": "May 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5235856}, {"rating": 4.0, "title": "Great hotel in Sorrento", "text": "This is a great little hotel in Sorrento. It's a bit of a hike to the town (a hilly but beautiful 15 minute walk), but we loved staying near the fishing village/marina. It seemed less touristy, and we loved seeing the locals fishing and the old women sweeping their front stoop!", "helpfulness": 2, "user": "ZKDDS", "date": "February 4, 2008", "id": 13271699}, {"rating": 4.0, "title": "Nice place, small rooms, the bus helps", "text": "We booked a room for 4 people for 135 Euros a night on Venere.com. and we stayed for 3 nights. The room was small, and I kept hearing my husband bang his arms on the shower door, but that was pretty common everywhere we went in Italy. The staff is very helpful though. One of the receptionist actually spoke 4 different languages, and put us Americans to shame. They have a nice entrance/lounge area where we would have a few beers after a long day of sightseeing. They also have Internet access downstairs which was handy.", "user": "AndrewHHH", "date": "October 21, 2007", "id": 10174066}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "There is a bus that stops right in front as well, and we used it only to get to/from the train station since we had luggage to carry. Otherwise, we pretty much walked everywhere. I would definitely stay here again!", "title": "The staff here are so thoughtful!!", "helpfulness": 2, "user": "NotEurotrash913", "date": "October 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10026273, "likes": {"liked": "— Location and service", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Using the bus to get to the hotel helps greatly, but you must know that the Marina Grande bus is no longer called \"Linea D\" - it's now simply called \"M. Grande\". The good news is, you can catch the \"M. Grande\" bus right at the train station now (even the lady who sold me the bus ticket at the station Tabacchi shop didn't know this!), and just take the bus to the end of the line (which is just a few hundred yards from the hotel - you pass the hotel going down the hill to the stop). And the bus seems to run only once an hour or so - check the schedule posted at the bus stop at the train station, directly to your right when you leave the station. The bus is only 1 Euro per ticket and well worth it instead of walking up the hill into town; I took the bus up but walked back down which is easy unless you have luggage.", "title": "Great Value", "user": "Seanieod", "date": "September 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 10012417, "likes": {"liked": "— Peaceful location just out of town.", "disliked": "— Size of the room."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "As the other reviews state, the Hotel Del Mare has very tiny but clean and modern rooms, and they can be a bit noisy (my room, 101, was at the end of the hall near the steps, and I could sometimes hear the \"clomp, clomp, clomp\" of people climbing the steps). Otherwise I thought it was a decent place for the price. Bathroom is small but good. Staff was friendly, helpful - definitely an attitude of \"customer service\" - and spoke excellent English. Breakfast was good.", "title": "Rooms very small", "user": "carc0yne", "date": "September 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 2.0}, "id": 8862016, "likes": {"liked": "— location", "disliked": "— room"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We have just returned from a two and half week trip of Italy - Milan, Venice, Florence, Rome and Sorrento. We are a family of four and I did all our hotel reservations via Venere which worked very well except for the Hotel Del Mare at the Marina Grande, Sorrento.", "title": "Dissapointed with the Hotel del Mare", "helpfulness": 1, "user": "JDRust", "date": "January 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 6557931, "likes": {"liked": "— The setting at the Marina Grande", "disliked": "— The room"}}, {"rating": 4.0, "title": "Good Value, Newly Renovated, Great Breakfast", "text": "Given all the positive reviews I had red about the hotel I was most upset with the two double rooms allocated to us -rooms 101 and 201. They were clearly single rooms converted into so-called standard \"double rooms\" very small and with two single beds (different ones) in each - the TV above the head of the second bed. The hotel's own website nor Venere's link indicate any of this. The hotel was also quite noisy at times as everything is tiled with no carpeting to dampen sound.", "helpfulness": 2, "user": "See-Ray", "date": "October 27, 2006", "id": 6018848}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Sorrento is a beautiful place and I hope to return in spite of my dissapointment at the Hotel Del Mare.", "title": "Would reccommend, dont bother with sea view", "helpfulness": 3, "user": "deldoors", "date": "September 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5823003, "likes": {"liked": "— Very Clean", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "I cannot believe how", "text": "Water view available only from roof-top terrace. Rooms with (small) balcony overlook street. Very pleasant place to stay but a hard uphill walk to the center of town. Good restaurants just below the hotel on the waterfront.", "helpfulness": 3, "user": "NJPT", "date": "August 10, 2006", "id": 5597250}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed at this hotel for 10 days and fornd it a good place to stay. Rooms were spotless, cleaned everyday and reception was really helpful.", "title": "Good Hotel", "helpfulness": 1, "user": "bobdibest", "date": "August 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5536371}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "My parents and I spent 3 nights at Hotel Del Mare this past week. The location is fine as long as you do not mind the 15 minute walk up to the town or a 13 euro taxi trip. The Marina area is very quaint, a nice neighborhood, not just tourists. The room, while small, was very nicely appointed with beautiful tiles in the bathroom. The breakfast was very nice with the exception of the machine generated hot beverages. A few thoughts: Staying on the 1st floor is not wise as you will hear everyone entering through the lobby, all night long, and at least while we were in residence this included many loud individuals. Rooms on one side of this floor face another building. My parents chose to upgrade to a sea view room on the 3rd floor which did not seem worth it, although the other side of the hotel overlooks a road and boat factory, so you have to choose between noise or paying a bit extra.", "title": "Too Loud!", "helpfulness": 1, "user": "bragghouse", "date": "September 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8826325, "likes": {"liked": "— Decor and cleanliness", "disliked": "— Noise level and distance from town"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "This is a great hotel which is good value for money. It is a bit further away from the centre, but this added the advantage of staying somehwere more peaceful. The rooms are small, but clean and a lovely view from the balcony of the city. The staff were warm and helpful and the breakfast was good. I would definitely recommend this hotel.", "title": "Great Hotel at Reasonable Price!", "helpfulness": 1, "user": "Kimkram", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7999222, "likes": {"liked": "— Good value for money, very clean, nice balcony", "disliked": "— A bit far from city centre"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Hotel Del Mare is a beautiful, quaint hotel by Marina Grande and a short walk from the center of town. My friend and I arrived via hydrofoil from Naples, picked up the bus (located by the hydrofoil station) to Piazza Aniello, took a 2 min walk to Piazza Tasso to then took the Linea D to Marina Grande then walked 5 minutes to the hotel. Note that Linea D does not come around very often about every 20-30 minutes so you could be waiting a while. If you arrive by train it's quite a walk as well so you'll want to take Linea D or a taxi. Don't waste the extra euro on a balcony at all, it's so small you can barely sit, I'd suggest just getting a basic room. The shower is extremely small (and we're both smaller girls) so that may also be a challenge for some. The front desk people were very nice and they have internet access available for a fee. Marina Grande has some beautiful restaurants. The 10 minute walk into the center of town requires walking up a lot of steps and a hill so those with disabilities may have a challenge getting into town. The Linea D bus does also run from the Marina to town so that's another option (again, it doesn't come very often). We enjoyed our walk into and out of town so I wouldn't deter anyone from staying here for that reason alone.", "title": "Beautiful hotel a short walk outside of town", "helpfulness": 2, "user": "dhart", "date": "June 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7753143}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We cannot thank Johnnie and his staff enough. We arrived in Sorrento without reservations anywhere Tonino was at the front desk and so nice and accomodating it seemed to good to be true. We decided to rent a car for a day and the staff offered to bring us to the car rental place. Furthermore when we went to return the car Maggiore was not open yet. We brought the car back to the hotel. I apologize i cannot remember the womens name but she contacted Maggiore once they opened and had them come and pick up the car from the hotel for us. I have worked at five star hotels in the U.S and never have i seen such a high level of customer service. breakfast was included every morning.The hotel was very clean and safe as well. Hotel Del Mare is just steps away from marina Grande and about a 15 minute walk to the center of town. The walk to town is through a medieval type walkway with breathtaking views of the gulf of naples. There is also a local bus that is about a 5 minute ride into town. If you are in town go to Teatro Tasso for a show and Tell Antonio Ferola David from Florida said Hello.", "title": "Best Service", "helpfulness": 1, "user": "dlist25", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7616740, "likes": {"liked": "— service, cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at Hotel Del Mare for 3 nights and we loved it. We walked to the hotel from the train station-- which I wouldn't do again. There is a Circumvesuvania bus that runs from the train station (right in town) to the Marina Grande, which is right by the hotel. And, if you buy the Campania Arte Card, which we bought at the Naples airport American Express office, you can ride the bus with the ticket for three days. That was very handy. Without bags to haul, the walk to town isn't bad. We preferred to take the bus most days, and we are both in good shape and in our late 20s. We really enjoyed the hotel though. It was all newly renovated, with beautiful Majolica tiles all over. The room was small, but not the smallest we have seen. We had an ocean view, which is over the roofs of other homes, but nice. The other type of room has a balcony, but it overlooks the street. The neighborhood is quiet and the owner is very accomodating. He arranged for us to get dinner at a local restaurant that was excellent! The pizza was delicious. There is a market/deli nearby at the marina that you can stock up on snacks at. There are a few nice restaurants nearby too, mostly specializing in seafood. Beware of the Fish of the Gulf... it was literally fish on a plate. eyes, tails and all. :) Oh, and the breakfast was the best we had in all of our trip. fruit, croissants, ham, cheese, cereal and hot drinks.", "title": "We enjoyed our stay...", "helpfulness": 1, "user": "all4art", "date": "April 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7365199, "likes": {"liked": "— The outstanding staff.", "disliked": "— The long walk from the train station."}}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 3, "variance": {"poor": 14, "average": 25, "very good": 135, "terrible": 7, "excellent": 183}, "aka": "Del Mare Hotel", "slim_ranking": 0.319587628866, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "In the heart of the old sea hamlet of Marina Grande of Sorrento, the Hotel del Mare is a cosy 3-star hotel which offers its hospitality to all those who wish to get involved in the magical atmosphere of a unique hidden jewel, situated in one of the most enchanting towns in the Gulf of Naples."}