{"user_rating": 4.5, "review_count": 1181, "name": "Hotel Alessandra", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Just returned from a 17 day trip with 7 women friends, traveling by train through Italy. We stayed at the Alessandra Hotel for 3 nights. It proved to be the perfect choice for us. They provided 2 quad rooms. The rooms were generous in size. We didn't feel crowded together. The hotel is located within walking distance to everything we wanted to see...the Ponte Vecchio, Uffizzi, the Accademia, etc.", "title": "Near All Major Sights", "helpfulness": 1, "user": "LifesG8T", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20376099, "likes": {"liked": "— price & location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Using suggestions from the front desk and Rick Steve's guide book, we had some delicious meals, close by and affordable. My first experience tasting wild boar. No, it didn't taste like chicken!", "title": "A great place to stay!", "user": "Blizzard1000", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20300786}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "An excellent choice in Florence. Strongly recommend it.", "title": "Great Experience", "user": "kmatt87", "date": "September 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20274490, "likes": {"liked": "— Location", "disliked": "— Stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Great location and outstanding front desk staff who were all very friendly, helpful and accommodating. Our large Jr. suite room was excellent.", "title": "Loved Hotel Alessandra", "user": "satisfiedtravler", "date": "September 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20269452, "likes": {"liked": "— the fine service and hospitality"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "To give balance:", "title": "Delightful 2* in the heart of Florence", "user": "AdamBAtl", "date": "September 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20181784, "likes": {"liked": "— Great location and service", "disliked": "— You have a choice of 3-4 flights of stairs or one flight plus a teeny-tiny elavator"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "if you're going to Florence to view art, Hotel Alessandra is your spot. It's steps away from all the major sites, while being located on a quiet side street that gives you a chance to get your bearings before diving into the throngs of tourists and college students. There's a fabulous wine bar just across the street that serves delicious lunches. The front desk staff was friendly and helpful, and the room was very spacious. You might want a room away from the giant clock tower, which can be a bit deafening when the windows are open.", "title": "In the heart of it all", "user": "Doc_Be", "date": "July 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69977503}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I stayed here with my teenage daughter. The room was large and a good value for the price. The hotel staff was very welcoming and helped us out with all of our questions, and plans. They booked us reservations at Uffizi and Accademia and helped guide us on restaurants.", "title": "Great location, and good value.", "user": "runTESrun", "date": "July 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 69755110}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We traveled to 5 different locations during our journey and this by far was one of the best hotels we stayed at. My only suggestion is to offer more of a selection for breakfast (fruit or some other protiens would be great). But don't let the breakfast be the reason you don't stay....as there are lots of great restaurants and shopping within walking distance.", "title": "Best staff, best location", "user": "momsadreamer", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69444383}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The hotel was very quiet and comfortable.", "title": "Warm welcome, friendly staff, clean room, safe area, free internet in a community room.", "user": "FrannyFran1", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68695368}, {"rating": 5.0, "title": "Monty is a great reason to stay here", "text": "My husband and I had the best stay at Hotel Alessandra. Due to airport delays, we arrived several hours later than expected and were very tired and grumpy. As soon as we walked into the hotel, we were greeted like old friends, immediately taken to our beautiful (and very quiet and cool) room and given recommendations for a little restaurant that was right around the corner. One glass of red wine and some antipasti later, our entire trip was back on track. Everyone at the Hotel Alessandra was friendly, helpful and all of their suggestions were right on the money, from dinner reservations, to museum passes and tips for train station tickets. The location can't be beat, either. Across the way is a great wine bar, there are several amazing shops off Apostoli (be sure to visit Solo a Firenze and La Bottega Dell'Olio) and, of course, you couldn't be closer to the Ponte Vecchio. I highly recommend this hotel.", "user": "TRAVELINTESS1956", "date": "June 24, 2010", "id": 68552385}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "The property was lovely and in a convenient location to all the sites we wished to see in Florence. The entrance, lobby and common areas are clean and tidy and charming and the rooms were also clean and well-kept and relatively spacious; a decnet value. The owners were wonderful and they had a pleasant staff to accompany them. Italy proprietors may wish to take the lead from the Spanish. Internet access in the common room is included in the room rates in Spain. A lovely stay at Hotel Alessandra. Recommended!", "title": "Lovely Hotel, Wonderful Staff", "user": "jjhenzel", "date": "July 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17488057}, {"rating": 5.0, "title": "Best Florence Experience", "text": "I loved my stay at the Hotel Alessandra. It was one of my favorite Florence experiences. It is on a lovely little street just a block or two from the Uffizi. I got in early after taking the night train from Paris and Andrea at the front desk kindly stored by bag and told me to go have breakfast until my room was ready. By 9:30 am I was in my room and had a great private bathroom all to myself! The staff were always remarkably warm and friendly. The breakfast buffet was better than anything else I found during my week long trip through Italy. I had a great view that included the Duomo.", "user": "SuttonRizRaz", "date": "July 2, 2008", "id": 17465578}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "The location was perfect, two blocks from the Uffizi and the room was wonderful. My room was recently refurbished, airconditioning, wireless access and a gorgeous bathroom. The breakfast buffet was better than those Ihave had in more expensive places and the staff were incredible. From the minute I made my reservation (a friend had sung their praises) they arranged museum tickets, recommended resteraunts and did all they could to make me feel welcome. My only complaint was that I couldn't stay in December as their staff has the holiday off. Talk about civilized. I will stay at Hotel Allesandra every time I return to Firenza.", "title": "Tuscan Hospitality", "user": "144artist", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17458129, "likes": {"liked": "— Location and Service", "disliked": "— Not open in December"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel's location is perfect -- a block from the Arno, three blocks from the Uffizi, 10 minute walk to the Duomo. Ponte Vecchio about three blocks away, delicious fruit stand down the street.", "title": "Great hotel, excellent staff", "user": "rbsz", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17452993, "likes": {"liked": "— location", "disliked": "— some noise, because it was in a very central location! You can have convenience or silence, but not both."}}, {"rating": 5.0, "title": "Location, Comfort & Service", "text": "Our room was beautiful, very clean and had a wonderful view of the river and the 1000-year old church next door. The front desk staff all speak excellent English and were very helpful. I would definitely recommend it to anyone going to Florence, and we'll try to stay there the next time we go.", "user": "My_AZ", "date": "July 2, 2008", "id": 17452003}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My wife and I stayed here for two days on our honeymoon. We felt like familiy as soon as we walked in. We had been on a long overnight train ride and came to the hotel at 9 am. Our room was not ready but Andrea got us towels and a place to freshen up and allowed us to sit for breakfast while our room was being cleaned. They helped us with dinner reservations and sent us to Giovanni's which was just a wonder meal and great dining experience. Monte the evening manager was so fun and friendly that we are still talking about him. Our room was a double and was very spacious with great high celings. It was very comfortable. To top it all off it is just steps away from the Ponte Vecchio and minutes aways from the museums and sites like the Duomo. Breakfast was included in our package and we found it very enjoyable. The freshly made cappuchino's were delicious. The building is an old 16th century palazzo and you have to go up a flight of stairs before you get to a small elevator but this was not an issue for us and we found it somewhat charming. We would stay here again in a heartbeat!", "title": "Wonderful People Wonderful Location", "user": "dslye3", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70295446}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I stayed two nights at the Hotel Alessandra on my trip to Florence. I was plesantly surprised by the hotel accommodations, which were spacious, comfortable, and exceptionally clean. The staff was wonderfull and very helpful helping me with my luggage, and accomondating my every question and warmly greeting me each time I entered or left the hotel The location was ideal and as a solo traveler I felt comfortable and safe at this location. The morning breakfast was a pleasant experience and the attention to detail was greatly appreciated. Thanks for making my stay so memorable.", "title": "Wonderful, Safe, Secure", "user": "solotraveler64", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70207933}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We stayed in the Suite Baccio for 5 nights. It was wonderful. Very large rooms with a great bathroom and an extra alcove. Beautiful view of the Arno river from our rooms. The staff was great and very helpful about everything. They made all of our reservations for museums for us. The breakfast food and atmosphere was very enjoyable.", "title": "Great experience and would highly recommend", "user": "TahlequahShirley", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70205048}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We asked for air conditioning and our rooms were kept extremely comfortable.", "title": "Perfect stay in Florence", "user": "ldstrong", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70131207}, {"rating": 5.0, "title": "Perfect location, great value", "text": "Our grandaughter became ill and Andrea was very helpful about finding us a doctor. We were very appreciative of their concern for her. The entire staff was very nice and helpful.", "user": "elisapros", "date": "July 7, 2010", "id": 70045035}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "A wonderful hotel near all the major sights in Florence. Great 16th century building. We booked late in the game and had to take a room with a shared bath but it was fine. The facilities were clean and our room was spacious and very comfortable. We'll probably stay there again if we return to Florence, which we hope to do.", "title": "Cheers for Hotel Alessandra", "helpfulness": 1, "user": "Grampy_Bob", "date": "October 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20779687, "likes": {"liked": "— Location, room size and view out window, comfort.", "disliked": "— Somewhat hard to find the lobby when first arriving."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Florence was our 3rd stop on our 2 week long trip in Italy. My husband and I stayed here for 2 nights at the end of September. It took us about 15-20 minutes to walk to the hotel. Once we arrived, my husband was able to get into the tiny elevator with our large luggage. I walked upstairs since it was only on the 2nd floor. We were greeted by Monty at the front desk. He was extremely funny and helpful, definitely made our stay so much more enjoyable. He had so many great restaurant suggestions and had our museum reservation # print outs ready for us. We reserved a regular room on the quiet side. Our room had a king bed (2 beds put together), comfy european standards. Bathroom had a small shower with an oversized pedestal sink. Because this is an older hotel, you will notice the few things that needed repair. Room was kept fairly clean. Extra blanket in the closet. We were able to see all of Florence in 2 days because the hotel was centrally located. Walked to the ponte Vecchio (5 minutes away), Pitti palace, Toured the Uffizi (reserve tix in advance, line was very long!), had dinner @ \"Nella\" - 1 block away from the hotel (go when it opens at 7pm or they will send you away and make you come back 45 minutes later) This restaurant was not only recommended by Monty, I think it is also in Rick Steve's guide book. Afterwards, we stopped by the famous \"cafe Rivoire\" to people watch/listen to music, and ordered dessert. We had the panna cotta, yuck! I think this place is over rated. Waitor was indifferent. Breakfast room was charming - bread, ham/salami, cheese, cereal, and coffee/tea/cappucino with a happy face one it. Started our day going to the Santa Maria Novella old perfumery/pharmacy near the train station (a must do!!!!), spent a good 3 hours at the Boboli Gardens, made reservations at the Accademia (waited in the normal line for 20 minutes so we didn't have to pay extra for the reservation), had dinner at the restaurant \"Il Boccale\" right next to the Hotel because we didn't want to walk anymore after our all day. Good food was prix-fix for 10 euros!! Overall, we would definitely stay here again for the price and wonderful service and of course, location! location! location!", "title": "Great Location and Service!!!!!", "user": "gnawh2", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 20694381, "likes": {"liked": "— Location and Staff!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Our first visit to Florence was made all the better by our choice of hotel.", "title": "The Alessandra...what a great choice.", "user": "jaydee-leicester", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 20667497, "likes": {"liked": "— thefriendliness of the staff", "disliked": "— the lift"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "From the minute we exited the lift (admittedly this was a bit of a squeeze!!) we felt like welcome friends. Check in was quick and painless. Our single rooms ,whilst not large, were spotless and the bathrooms modern. The staff and owners were wonderful. Nothing was too much trouble for them and they were very willing to offer advice on places to visit and to book trips for us. We were most impressed by the choice of breakfast...far more substantial than in many similar hotels.", "title": "Very nice hotel with a great location and warm friendly staff", "user": "Ryannika", "date": "October 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20667646, "likes": {"liked": "— Location", "disliked": "— steps"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The hotel is in the perfect location....5 minutes stroll from the Ponte Vecchio and Oltrarno, Piazza San Giovani and the Cathedral and of course, the shops.", "title": "the Hotel Alessandra will see us again", "user": "CalgaryAndrew", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20653297, "likes": {"liked": "— staff", "disliked": "— finding it"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My husband and I stayed in the hotel for 3 nights and found it to be lovely. It was in a perfect location, the hotel staff was very friendly and helpful and the room itself was clean and quite spacious. We loved our first trip to Florence and part of it was due to this great hotel.", "title": "Great Hotel", "user": "Lorissap", "date": "July 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17449048, "likes": {"liked": "— the location"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The Hotel Alessandra is located within a 5 minute walk of many of the important sights in Florence, including the Uffizi Gallery, the Ponte Vecchio, and the Piazza Repubblica. The family who owns the hotel provides very friendly service and makes you feel at home during your stay. They will assist you with reservations to the popular sights like the Uffizi and Accademia, which will help you avoid the lines. The rooms are spacious and feature high ceilings, and they are very well kept. A continental breakfast is served every morning, again with friendly service.", "title": "Excellent family hotel in the heart of Florence", "user": "Love2travelEU", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17372432, "likes": {"liked": "— Family provides very good service and makes you comfortable", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Friendly place in the heart of Florence", "text": "The staff is also very knowledgeable about Florence and can provide very good recommendations for meals.", "user": "aschiotz", "date": "June 29, 2008", "id": 17334418}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We will definitely plan to stay at Hotel Alessandra during our next stay in Florence.", "title": "A wonderful start to our honeymoon", "user": "honeymooner36", "date": "June 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17309698, "likes": {"liked": "— location", "disliked": "— parking was difficult, but manageable"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Hotel Alessandra couldn't be located more conveniently--3 minutes from the Palazzo Vecchio, 5 minutes from the Duomo. The hotel is located in a 15th century building on a small side street. It's quiet and well run (good breakfast, too). The very best thing about HA is the wonderful owners and staff. Andrea was great about getting museum reservations and for general information and help of all kinds. Hotel Alessandra is positively written up in Rick Steves's books, so the secret is out.", "title": "You cant go wrong at the Alessandra in Florence.", "user": "tbonechicago", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17281598, "likes": {"liked": "— location", "disliked": "— it was all good."}}, {"rating": 5.0, "title": "Great place, nice folks", "text": "Lovely hotel, very good central location, and very nice people running it, we had a great stay for 4 days in May 2008", "user": "traveler875", "date": "June 23, 2008", "id": 17143640}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Ditto to all the positive comments in other reviews. Just want to add that the quad room was a very generous size with a king size bed and two comfortable twin beds. The ceilings in our room must have been 14 feet giving an even greater sense of space. As parents traveling with 2 teenaged sons, we appreciated the comfort and room. Bathroom was large too.", "title": "Great Little Hotel - Huge Quad Room", "user": "Herring", "date": "June 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17133647}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel had a lovely situation, easy quick access to local attractions. Disappointmented with mildew on bathroom ceiling. Entrance very disappointing, concrete stone entrance, shabby ,up three flight of stairs. Lift which would not fit luggage as it was tiny. Often you could not get the lift as it only worked when people on other floors shut the doors properly.Bad stain in bath and long black hair. For the cost, I would not use this hotel again. I e-mailed three times to ask for a bottle of champagne in room as a surprise for my wifes birthday, but was not done. Comfortable bed but shabby bedcover.", "title": "Not too sure!", "user": "ScotlandMazda5", "date": "June 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 17128019, "likes": {"liked": "— Pleasant english speaking staff", "disliked": "— Shabby bathroom, tired room. Toilet seat all damaged."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "On the basis of the reviews here we booked a long weekend at the Alessandra.", "title": "Great location", "user": "WibblyWobblyMan", "date": "June 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 17044044, "likes": {"liked": "— Friendly staff, fantastic location", "disliked": "— Rooms are plain (but comfortable nonetheless) and the mosquitoes"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "On the assumption that the hotel will be somewhere to sleep and breakfast, and visit the local attractions, it's great - the Ponte Vecchio is at the end of the street. Their other selling point is the service, which is very friendly", "title": "Loved the Hotel Alessandra!", "user": "HMoney22", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17009954, "likes": {"liked": "— Location and Friendly staff", "disliked": "— No bathroom in the guestroom."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The location was perfect - the staff exceptionally helpful. Andrea and his beautiful mother run a terrific hotel. Breakfast was very good with an assortment of foods to please everyone. Our room was lovely, large, bright and clean. Our only disappointment - the mattress was rock hard and we would have liked something a bit more plush. Be prepared to carry your luggage up one flight of stairs and the elevator (typical to these kinds of buildings) is hilariously small. But once you're at the registration desk, you'll be more than pleased by the service and the beauty of this lovely hotel.", "title": "Beautiful hotel", "user": "Lovestotravel0401", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68534385}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We had a really good time! On arrival we had a very warm welcome and nothing was too much truoble thoughout our stay. The breakfast was superb: yougurt, bread, milk, oranje juice etc. Room was very nice... I would thoroughly reccomend with axcellent staff who make the stay aven more special!", "title": "LOVED THIS HOTEL", "user": "CAMME85", "date": "June 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 68438809}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Warm, friendly and consistently well run, the Alessandra is the perfect Italian hotel. It has charm and an excellent location, and wonderful owners and helpful staff.", "title": "Our Favorite hotel in four trips to Italy.", "user": "Robertatravel", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68201252}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "What a wonderful place. Top location within meters of Ponte Vecchio and the Uffizi. Helpful, cheerful, enthusiastic, loving staff. Internet. Homey lounge with relevant reading material. Third floor location may bother older, infirmed guests, but an elevator carries guests part way up. We loved it.", "title": "Wonderful in every way", "user": "Travelling-Alejandro", "date": "June 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67878014}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "This hotel has a great location and the staff are all exceptionally exceptional. They go out of their way to be helpful and I really appreciated it. The value is also very good.", "title": "Great Staff", "user": "squigglyski", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 67639641}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "A bit hard to find for our GPS, but we called the hotel and they sent a guy to drive our car to the nearby parking house. The tiny elevator does not go down to the ground floor, so we had to carry the samsonites up a lot of stairs.", "title": "Goodmorning America", "user": "travelviking", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73637014}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The receptionist was extremely friendly. Huge room with a view of the Arno River. Good AC, lots of closet space, minibar, free wi-fi. Our bathroom was in a separate private room down the hall, worked well enough (most rooms have normal bathrooms). The location is fantastic, you can walk to the most important sights within few minutes. The breakfast is quite good and every morning the breakfast room was filled with american guests. Good value at 150 euro for two adults and a 10-year oid", "title": "Fabulous. . .can't wait to return!", "user": "3busymom", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 72498810}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "Enjoyed our brief 2 night stay at Hotel Alessandra immensely. . .the staff was outstanding from the moment we were met by Monti and his energetic personality, to late nite Lorenzo, the breakfast ladies who arranged the buffet and brought us cappucino, to Andrea who gratiously booked our sightseeing tour and cooking class - great fun! Our quad room was very roomy and clean, bathroom adequate with plenty of soft clean towels., firm beds. Great location but a little hard to find when not familar with the city.", "title": "Perfect Combination of Location and Service", "user": "SophiagoestoItaly", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72386733}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Wonderful service by caring people - I spent a week at the Alessandra and they treated me like family. Everyone went the extra mile to make me feel comfortable. The hardest part is finding the hotel! Checking out Google Earth before arriving helped because I could see the hotel door, and the stores across the road. If you are arriving by cab, mention that the Alessandra is just down the street from Ferragamo. The second hardest part is getting up the stairs (use the elevator, or ask the staff for help), but it's worth it once you are there. Breakfast is great, there is a nice sitting room with computer and books to share, and all the desk staff are ready to help with every request. Wonderful location for exploring all of Florence on foot. I hope to return soon!", "title": "Fab location, excellent price and much better than most 4 stars!", "user": "MTLMidlands_Ireland", "date": "July 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71361424}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We stayed in this hotel because the price was within our budget at 80 euro per night B&B and on the map it was obvious that the location was ideal for touring the city on foot. We would normally stay in 3 or 4 star hotels but these were quite expensive so we decided to take a chance on Hotel Alessandra even though it was only 2 star. We neednt have worried.It was so quaint, so comfy , spotless and friendly. It was on a really peaceful side street where we could sleep with the window open! Old building with great character.The staff couldnt be more friendly and helpful. Breakfast was more like a good 3 star.Plenty of everything to eat,cereals juices,bread, pastries hams,cheeses,tea,coffee etc.The only tiny problem might be access . You need to be able to climb stairs as lift is limited.WE will be definitely be back !", "title": "A superb value for money character hotel right in the heart of Florence", "user": "Robin45", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70717373}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "I spent 3 days in Florence, staying at Hotel Alessandra. It was exactly what I was looking for: brilliant location, right amongst all the action without being noisy; lovely rooms, and very clean, especially the bathrooms; and the best staff ever who honestly could not have been more helpful or friendly. I had a fab weekend staying there. So overall, two thumbs up for brilliant value!", "title": "Loved the Hotel Alessandra!", "helpfulness": 1, "user": "Isabella77", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17281450}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "I have stayed at Hotel Alessandra on four occasions now. Every time it has been excellent. The location is perfect, quiet but central; the staff is incredibly courteous and helpful. The rooms are a reasonable size and spotless. I discovered the hotel by accident after the one I used to stay at was remodelled and became more attractive to visitors I prefer to avoid. Alessandra, on the other hand, has a very pleasant clientele from a variety of countries including Italy which makes it a very good experience. I enjoy reading in the lounge as well as in my room. The church next door rings its bells in the mornings which echoes the duomo and what better alarm clock could one ask?", "title": "Wonderful", "user": "katpat86", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17267365, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I will be in Italy again in January 2009 and for the time I spend in Florence I shall stay again at this hotel. One of the really good things about it is that they remember me which makes going there feel more inviting than in larger more anonymous hotels.", "title": "Awesome Hotel in Florence!!!", "user": "sde74", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17265325, "likes": {"liked": "— Prime location", "disliked": "— Unavoidable stairs"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This is a gorgeous old hotel in a prime location in Florence. The building itself used to be a palace or something in the 14th century. The front desk staff is energetic and super helpful. The rooms are spacious and they had probably the biggest bathroom and shower that we found in all of Italy. The breakfast is also pretty good.", "title": "Great location and comfortable, affordable accommodation", "user": "Beastia", "date": "June 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17257457}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "Location is prime. Very close to the Ponta Vecchio and a short walk to the Academia and the main square in Florence. Uffizi is a little farther, maybe a 15-20 minute walk. The front desk staff gives you a great map and instructions on how to get to the main attractions.", "title": "Excellent Location, Excellent Price", "user": "Flydog66", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 17253243, "likes": {"liked": "— Location, price, great staff", "disliked": "— Bed"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My husband and I stayed at Hotel Alessandra for two evenings at the end of September. We can only rave about the hotel staff and their ability to answer all of questions and make our stay in Florence memorable. The front desk staff spoke English very well, which helped since we do not speak Italian. Monte, one of the hotel staff, was so funny and made every encounter a pleasure.", "title": "Lovely Stay at Hotel Alessandra", "user": "Treely", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20623264, "likes": {"liked": "— Hotel Staff and Convenient Location", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "Our room was very spacious. We had a bathroom inside the room, which had both a shower and a bath. The bathroom was a good size. We had a TV available for catching up on news. Breakfast was offered every morning. There was a nice array of rolls, fruits, cereals, and coffee. The hotel has internet access available for a small fee. The hotel is in a very convenient location on a side street. We would have rated the hotel a 5; however, we did have some problems with the noise. Our room was located on the same floor as the front desk. So, in the morning (around 5 am) when the staff were beginning to prepare for breakfast, we heard a lot of noise. We also were at points disturbed by the noise outside by cars and people on the street outside the hotel. We would recommend bringing ear plugs (just in case). Despite the noise we were able to fall asleep, but it was noticeable. We did not bring this issue up to the hotel staff as we were able to fall asleep. It is just something we think people should be aware of.", "title": "A good solid hotel in a great location", "user": "jml66", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20621356}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Given the cleanliness of the room, the friendly hotel staff, and the convenient location, we definitely recommend this hotel. However, do bring ear plugs (just in case).", "title": "wonderfully, charming hotel", "user": "pocketful", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20591286, "likes": {"liked": "— the service at the front desk", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Hotel Allesandra; A Great hotel", "text": "I stayed here with my wife on our honeymoon in September 2008.", "user": "mozart28", "date": "October 2, 2008", "id": 20569968}, {"rating": 5.0, "title": "Absolutely love the Alessandra", "text": "The location is prime -- a 5 minute walk from the Uffizi, Piazza della SIgnoria, etc.", "user": "Italiandream1", "date": "October 2, 2008", "id": 20560706}, {"rating": 4.0, "title": "Excellent Stay", "text": "The staff, the breakfast and the hotel in general was great! I would strongly recommend anyone stay here. Our only critique was that the bathroom in our room was very small, but the friendly staff made up for it.", "user": "OSUBEAVERS", "date": "October 1, 2008", "id": 20530968}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I just stayed with my mom at the Hotel Alessandra for 4 nights this September, and our stay was excellent. The staff was great. I was in contact with Andrea before the trip and he always answered my questions promptly. Once there he helped my mom with our luggage, gave us great restaurant recommendations (definitely try Nella Trattoria and Giovanni's), and great tour recommendations (we loved the Siena and Chianti tour). The Hotel is in the heart of Florence and right near Ponte Vecchio, the Uffizi, Palazzo Vecchio and the Arno River. We could walk to most places in 10-20 minutes. All the staff would ask us how our day was, restaurant, trip, etc. The room and bathroom were clean and excellent. I will definitely try to stay here again if I visit Florence again and will recommend it to friends and family visiting Florence.", "title": "Hotel Alessandra was great!", "user": "Debsen1", "date": "September 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20473992, "likes": {"liked": "— The hospitable staff and location."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This is is very well located - close to all main sites and taxi rank for trip with bags back to station or airport. Was lovely to have a cool room to come back to after the warm tuscan sun. The room was spacious (with ensuite bathroom), and the breakfast room the best out of similar accomodation in Venice and Rome. The first impression of the steps and the lift - very difficult to be in the lift with your bags ! - may be a little off putting, but the rest of the accomodation quickly makes up for it. One street away from the Arno, and close to everything. Quiet at night, worth considering.", "title": "Alessandra by Oz", "user": "mmacPerth", "date": "September 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20465872, "likes": {"liked": "— Internet - no connection in 12 mins!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We just returned from our Italy trip where we stayed in the Hotel Alessandra while in Florence. The hotel is centrally located to all the major sites, train station, and on a quiet, safe street. For 150 euros/night (including Rick Steves discount) our quad room was spacious with an updated bath and internet was available. Andrea was extremely helpful with directions, information, and booking reservations. He was very nice and easy to work with. Continental breakfast was in a bright, cheery room with cheeses, cold cuts, pastries, spreads, fruit cocktail, juices, cappucino, and hot chocolate. We would love to stay at Hotel Alessandra again.", "title": "Hotel Alessandra was perfect", "user": "travel4angel", "date": "September 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20456430, "likes": {"liked": "— Central location & staff", "disliked": "— Stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Spent 4 nights here in the heart of Florence. Our double room was large and elegant (in a 2 star, not 5 star way!) We didn't have a river view, but looking out at 500 year old buildings was very cool, and the location was perfect for walking to all of the museums and churches and shopping. The staff was always helpful when we had questions or needed a recommendation, and you can even have your breakfast (included) delivered to your room!", "title": "Old Florence Gem", "user": "Picaza", "date": "September 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20430790, "likes": {"liked": "— Unique style", "disliked": "— nothing"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 2, "variance": {"poor": 9, "average": 34, "very good": 315, "terrible": 9, "excellent": 814}, "slim_ranking": 0.0369565217391, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Our family run hotel is right in the heart of Florence old town - near to the Uffizi Gallery and Ponte Vecchio. Without doubt, Hotel Alessandra is one of the most centrally located hotels in Florence. In this privileged position, Hotel Alessandra offers a home away from home, with our friendly team and extensive knowledge of the local area. The hotel entrance is situated on the second floor of the building. You can reach the reception floor using the lift, small but working fine (in the 1400s buildings hadn't been designed with this in mind!) but please note that there are around 30 steps from the entrance on the street level to the departure of the lift. We very much look forward to seeing you! Andrea and Anna"}