{"user_rating": 3.5, "review_count": 34, "name": "Hotel Mimosa Riverwalk", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "We were here the end of June for a taekwondo event which was a week long. The hotel was just so-so. The green walls have got to go! The breakfast was descent. The price was affordable. The seperate living area wasn't the most comfortable, the area is small, the couch/chairs were not comfy at all so we spent most of the time (when in the room) in the bed area. The area was not too bad except for the abandoned building right next door which was kind of scary when having to walk by it at night to get to and from the Riverwalk!!! Overall, I would only stay here IF there were no other rooms available in the city.", "title": "so-so hotel", "helpfulness": 4, "user": "gurltraveler", "date": "September 22, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3931660}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "The hotel is older but clean and well-kept. The pool is small, but unique shape and clean. One night there were children doing traditional Mexican dancing on a stage by the pool during the manager's weekly happy hour. The breakfast was great - especially the warm cinnamon rolls. There is a large plasma tv on the wall, usually on CNN, to watch while eating breakfast. We stayed in the only family suite. Our only problem with the room was that you had to be Hercules to flush the toilet, and the sofa bed that was in the room was a single sofa bed, not a double. If we had not requested a roll-away bed during the reservation making online, there would have been nowhere for our 7-year old to sleep (13 yr old slept on sofa bed). Large kitchen and dining table. Too much of the square footage allocated to the kitchen/dining however. The living areas could have used more square footage; probably just an older design concept. Only a 3 block walk to the La Villita end of the Riverwalk. Neighborhood seemed just fine to walk in any time of day. It was just fine for a hotel near the Riverwalk for a short stay.", "title": "Good hotel - better breakfast!", "helpfulness": 3, "user": "Susan2world", "date": "August 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3738603}, {"rating": 5.0, "title": "Great Quiet Hotel", "text": "My son and I just returned from a 4 day vacation in San Antonio. The room was quite large with a kitchenette and living room area (and 2 tv's!). No road noise. The pool area is walled off from the street so there is a secure feeling. We enjoyed the continental breakfast. Parking was $6 per day and on the same property as the building (not a block away). I may consider staying closer to the Alamo next time, but it will be a dificult decision since it's very close to La Villita, where we saw a nightly open air show on the river. Just a short walk back to the hotel. You can take the city trolley or airconditioned city bus to all the attractions for 80 cents from the corner right out front. My son and I walked comforably to the Alamo on the first day, but found the trolley for the return trip. I also found it nicer and cooler to go to La Villita and walk along the river instead of fighting traffic lights on the street level with my 5 year old. There is also a tour trolley but it's pricey so we skiped it.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 9, 2005", "id": 3651460}, {"rating": 5.0, "title": "Loved it!", "text": "We stayed for a little over a week, came for business and mixed in a little family time. Location was great, it was only a few blocks from the riverwalk, La Villita, and Hemisfair Park (which has a wonderful playground for little ones). We liked that it was quieter than staying directly on the river but was still very convenient to it. The location made for easy and quick access to the freeways and was about a 10 -15 minute drive to Sea World and Fiesta Texas. All of the staff were helpful, courteous and very friendly. The rooms were very spacious and well equipped. The breakfast always had a wide selection of items and was always more than just a muffin and fruit. In addition to all of the standard continental items on some mornings you could have bacon and eggs, other mornings sausage, biscuits and gravy, etc.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3640018}, {"rating": 4.0, "title": "A pleasant staff, great location, wonderful continental breakfast", "text": "I would definitely recommend this hotel and will stay here the next time we visit.", "helpfulness": 5, "user": "dickling", "date": "May 15, 2005", "id": 3473483}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "We arrived in San Antonio, Hotel was very easy to find from the freeway. We paid to park in hotel lot and was told our room would be ready in the afternoon. We decided since we had already paid to park we would walk to riverwalk from there. from the back side of the hotel and down a few very nice streets we were at the riverwalk within 3 minutes of walking. Just a nice stroll from the hotel to some of the old neighborhoods. We really enjoyed the walk. Real close to La Vallita. The hotel was very nice and clean, the hotel clerks were very friendly and helpful. The rooms were very clean and comfortable. Nice little area to lounge in with television and little kitchenette area where we prepared our light snacks and coffee and stored our cold drinks in the small refrigerators. The Pool was very nice and cozy atmosphere, with waterfalls, and hottub and lots of lounge area under shady areas, does not feel like you are baking in the sun! The free coffee and breakfast were very nice in the morning, and the breakfast attendants were very nice and helpful, giving lots of advice on things to see and do! I would definetely recommend this hotel, and would love to be able to return again!", "title": "Great Nights Stay!", "helpfulness": 9, "user": "sallyfreebird", "date": "May 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3469460}, {"rating": 5.0, "title": "late start, excellent staff", "text": "Me and my son's (7 & 4) arrived in San Antonio by train at about 1:30 am. are train was late and we were dragging! We went right to our room, very comfortable. The maids are excellent-kept our room very nice. Great breakfast buffet (kids eat free). Staff is very friendly and patient. My 7 yr old got sick and a lady that works in the resturant told me that there was a child's emergency room at a hospital 2 blocks away. This hotel is close to everything. I highly recommend. I was alone with my 2 kids for 6 nights, never been in this town before, and I felt very safe the whole time. I'm coming back to this beautiful city and excellent hotel. oh yeah, you can catch the trolley right out in front of the hotel.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 22, 2004", "id": 2772675}, {"rating": 4.0, "title": "Great Value!", "text": "Happened upon this hotel when I waited too late to make reservations.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "July 31, 2003", "id": 1155207}, {"rating": 2.0, "title": "Not like other Holiday Inns...", "text": "Right off the bat this hotel took a turn for the worst. When wanting to check in we stood at the counter while 1 agent was on the phone...for 15 minutes! Next we tell him we have a reservation and he tries to sell us a room. Once the communication barrier was broken we were able to settle in. We threw on our bathing suits, headed down to the pool and...holy cow!! the pool is empty and under construction. We have had these reservations for 3 months now, and not only did I not get a call it was under construction, but when we checked in they didn't mention a thing even though it's 30 feet to their left.", "helpfulness": 4, "user": "dannykessel", "date": "September 8, 2006", "id": 5782554}, {"rating": 1.0, "title": "Not worth the money", "text": "That was quite disappointing especially since we spent $200 a night being so close to the riverwalk...and it was 100 degrees outside.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 22, 2006", "id": 4724173}, {"rating": 1.0, "title": "Not worth the money!", "text": "The breakfast sucked as usual at Holiday Inns, so all in all a bad experience at a hotel I think so highly of.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 19, 2006", "id": 4691561}, {"rating": 5.0, "title": "Completely Wonderful", "text": "This hotel is not worth the money!!!! I am very dissapointed with this Holiday Inn Express. When I arrived, the lady at the front desk was very rude. When asked for directions, she made a sigh and rolled her eyes. The parking is horrible. You have to pay $6 a day for parking a block away in an unlit parking lot when there is closer parking for $3. It doesn't make any sense. The rooms are dirty. There were stains on everything from the sheets, the curtains, the carpet, and the faucets. The bathroom was not clean and the carpet was torn. When I told the on duty manager my concerns, all she said was sorry and that I could speak to the general manager. I insisted on speaking to him and he was always unavailable. I felt like I was being avoided. I was on vacation but felt very stressed out at this hotel. Not a place you want to stay for any type of getaway. There was a closer Holiday Inn off the Riverwalk for about the same amount of money that was 100% better. I suggest looking into that one before making reservations at this one.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4006081}, {"rating": 1.0, "title": "Dumpsville motel with \"valet\" parking scam", "text": "Where to begin? First, the receptionist was quite rude and more interested in her finger-nails than helping us, showing little enthusiasm in anything else. We are being charged $6 for parking one block away in a poorly lit lot that the night receptionist informed us that the hotel owned. A closer well lit parking lot is available for $3 , but we were warned that our car would be towed if we parked there, and to park there at our own risk. We will be checking out after one night and will not stay again. Beware! There is minimal parking close to the hotel and you get charged for every night. The \"suite\" that we got is not worth the price! Torn carpet, missing tile, broken light switch, stained curtains, getting a room with a jacuzzi means that the tub (which is in the bedroom of the suite) serves as a shower as well. Living area is cramped but ok. Disappointing service from a Holiday Inn chain hotel, usually problem free.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 29, 2005", "id": 3975814}], "location": {"country": "United States", "city": "San Antonio"}, "variance": {"poor": 3, "average": 5, "very good": 8, "terrible": 8, "excellent": 10}, "aka": "Motel Mimosa Riverwalk", "slim_ranking": 0.665706051873}