{"user_rating": 4.0, "review_count": 1457, "name": "Hotel Allegro Chicago - a Kimpton Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I stayed in a king room on the 5th floor for about 4 nights with a friend. Neither of us had been to Chicago, so we wanted a hotel that was centrally located. Transportation from O'Hare airport could not have been more simple - one of the metro lines close to the hotel ran 24 hrs/day and went directly to and from the airport.", "title": "Central, but a bit of a walk to restaurants", "helpfulness": 1, "user": "vanessm", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115149398}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The room was a good size and had everything we needed. The bathroom was rather small, but okay for 2 people since we were only there for a couple of days. Unfortunately, our room was facing Randolph St. and we could hear the train go by all night. Luckily, there was some sound proofing on the windows, but if you're a really light sleeper, I would request a room away from that part of the hotel.", "title": "What a great place to stay......", "user": "joycelia", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115138732}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We really enjoyed the complimentary wine reception in the lobby everyday. This was my first stay at a Kimpton hotel and that touch really stood out. In the morning they also provide complimentary tea and coffee in the lobby.", "title": "Friendly and helpful", "user": "xoxoxoxoxoxoxoxoxoxo", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115134888}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "All that being said, I was surprised to find that, though this hotel is located in the theatre area/downtown, there were not THAT many restaurant options in the direct vicinity to the hotel, only a handful. We found we had to walk north of the river to find more variety. The area was also very quiet at night which could be a positive or a negative depending on what you're looking for. It was negative for us, since nothing seemed to be open past 6pm. You couldn't even get a coffee anywhere (unless you went to McDonalds...). Perhaps our ages may have been a factor, as we are both in our mid to late 20s, so we would have preferred being closer to a bit of nightlife and having the option to walk somewhere closer to have a drink that was not in the hotel restaurant. It all depends what you are looking for.", "title": "Nice Hotel, Few Complaints", "user": "yagators", "date": "July 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115065897}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The hotel itself was lovely and very clean. The staff were always very friendly and helpful if you needed anything. I think this hotel is a great location for first time visitors, as we walked everywhere to see all the sights. However, next time I might be inclined to stay at a hotel north of the river in hopes of being a bit closer to restaurants and shopping.", "title": "Great hotel, but incredibly noisy!", "user": "sarahktsl", "date": "July 5, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 3.0, "service": 4.0}, "id": 115063785}, {"rating": 4.0, "title": "Conveniently located and decent", "text": "Was in Chicago for the weekend after a work trip - picked it by virtue of the fact that it had the best price/ quality ratio in a not-so-cheap city. It was conveniently located next to the loop trains, including the one to O'Hare. The check-in was painless and the coffee/ tea and wine hours were a nice touch being part of the hotel rates. The rooms were not big but did the job. The sink was incredibly small though - not quite practical for anything since you end up splashing everywhere but everything else was functional.", "user": "Kelvin T", "date": "July 18, 2013", "id": 168008764}, {"rating": 5.0, "title": "Excellent Stay", "text": "The walls are quite thin indeed and you are provided a 360-degree sound feedback of your neighbours' activities all day (and night) long - so be a sound sleeper for that. Ironically, the noise from the street was well-insulated. The neighbourhood is pretty quiet on the off-office hours but you are walking distance from the river and the magnificent mile so no big worries there - and yes, there's a Starbucks and Dunkin' Donuts just below the building if that rocks your boat. Also, the theatre district is just around the corner.", "user": "Margaret C", "date": "July 17, 2013", "id": 167980983}, {"rating": 5.0, "title": "Great service and experience!", "text": "This hotel knows the meaning of customer service! From the minute I walked in the door to the minute I walked out, the staff went above and beyond to make my stay sensational. When I arrived, I had missed the wine hour by about 10 minutes so they gave me a coupon for a free glass at the restaurant, not something I asked for...they offered. The room was great, a wonderful funky art deco vibe. Encore was a great place to meet up with friends for drinks and a bite to eat before we went to a concert. I felt completely safe traveling as a single woman in this hotel and in the neighborhood. Will stay here again without a doubt!", "user": "Elle B", "date": "July 17, 2013", "id": 167935211}, {"rating": 3.0, "title": "In great location but rest was average", "text": "This was a quick business trip, but it still felt like a getaway. The decor is funky and fresh, and the rooms are unique from your standard \"white walls, white bed\" that you find in other hotel chains. Rooms are kind of small, but no smaller than expected when you're in a big city. Service was great, they allowed a super early check-in happily, and helped me retrieve a dress I left in the closet. Even gave us a voucher for a free glass of wine since we missed the wine hour for work - it made a perfect night cap. Great all around.", "user": "Melinda H", "date": "July 17, 2013", "id": 167911942}, {"rating": 1.0, "title": "One of the worst stays I've had", "text": "I stay at a new hotel every week, or at least I'm at a hotel every week out of the year (almost). I will have to say, in all of my travelling, that this is one of the worst hotel experiences that I've had.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 26, 2005", "id": 3940163}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Let me start with the good first. The hotel staff is very friendly and very polite, the gym was decent and the rooms was decorated nicely", "title": "Hotel Allegro - great girls night! (or couples....)", "helpfulness": 3, "user": "xmas007girl", "date": "September 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3908706}, {"rating": 2.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "Ok, now that the good is out of the way, let me talk about the bad.", "title": "Service good,rooms not so", "helpfulness": 6, "user": "larkoolaw", "date": "September 11, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3894413}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "1. I stayed here for 3 weeks, all 3 different rooms I was in had a leak next to the wall unit ac/heat.", "title": "Cool hotel but service is lacking", "helpfulness": 3, "user": "LV2SLSA", "date": "August 26, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3809919}, {"rating": 5.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "2. The AC did not work very well. You cannot adjust the AC in your room and you have to call down to the front desk to get it changed. They then decide if they will help you or not. I called 3 times to get the AC turned down and only on the 3rd time did it get turned down and then the next morning it was back up again. I had to play this game every day.", "title": "arty, fun, free wine!", "helpfulness": 1, "user": "pumpkinpasty", "date": "August 24, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3804746}, {"rating": 4.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "I stayed at this hotel twice in October - first with my husband and again for a conference in the hotel. The Queen-bedded room my husband and I had was pleasant and average size. It is an older hotel but nicely updated, and the staff is very helpful. Located in the theatre district near the El and state building, it is convenient. The second stay was for a conference, and I had a very large king-bedded handicap accessible room. The meeting rooms are conveniently on one floor, vary in size and a re quite good. The main banquet room off the lobby was good for a general session and meals. Food was good, and the free wine hour and newpaper on weekdays are nice extras.", "title": "Good hotel in the south loop", "user": "M4", "date": "November 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4142355}, {"rating": 4.0, "title": "Helpful staff", "text": "The hotel is a good value for Chicago. I would stay here again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 20, 2005", "id": 4129131}, {"rating": 4.0, "title": "Fabulous for Pet Owners", "text": "I was very impressed with the staff of the Hotel Allegro. My six-year-old son became sick after going to sleep and made a big mess of the bed. I called the front desk and asked for clean sheets, planning to change the bed myself. Instead, 10 minutes later there were two members of the housekeeping staff at our door (this is 10 p.m.). They came in and not only cleaned our son's bed but cleaned the bathroom and sleeping area. They also left extra clean towels. They were very gracious and because of their quick help, we were able to get our kids back to bed before 10:30. They went out of their way to help and we were very grateful. By the way, our room was very nice and much larger than expected. The beds were comfortable. The bathroom was very tiny but that is the only downside we found.", "helpfulness": 2, "user": "ShutterPassion", "date": "November 10, 2005", "id": 4104321}, {"rating": 4.0, "title": "Would recommend", "text": "This is the perfect place to stay while in Chicago if you have a pet. It's smack in the middle of downtown, surrounded by great restaurants, shops and attractions...all within walking distance. The hotel's decor is very nice and the rooms are tastefully done in art deco; however they are somewhat small. The staff welcomes pets and goes out of their way to make you feel at home. An added bonus is the wine tasting hour that takes place every evening between 5 and 6 p.m.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 9, 2005", "id": 4102606}, {"rating": 3.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "My only complaint is there is no place designated for dogs to use the bathroom. We had to drive to Grant park every morning and evening so our dog could take care of her needs.", "title": "So so", "helpfulness": 1, "user": "f95kai", "date": "November 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4102084}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The rooms are very neat and clean; staff is extremely accommodating and very caring. I stay at the Allegro any time I'm in Chicago for business because it's right across the street from my office builing and I don't have to deal with cabs. In addition to convenience, it's also within walking distance of many of the attractions and restaurants Chicago is famous for. The only issue that may be a concern to some is the rooms and bathrooms are small, but for me it's not an issue. The positives by far outweigh the negatives for this facility.", "title": "For business traveler's it's incredibly convenient; within walking distance of many restaurants and other attractions.", "user": "KJS500", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114871845}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I am not a frequent traveler of hotels other than the more familiar, mid-priced chains. Hotel Allegro is certainly not of that type. My king bed room was clean but very small. The lobby is beautiful - lots of sitting areas, some separate from each other.", "title": "Fantastic lobby; room is small but very nice", "helpfulness": 1, "user": "jhigtiger", "date": "June 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 114775126}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "My stay was for business; a conference which took place in a large conference room near the lobby. The conference setup was very good.", "title": "Dissapointed", "helpfulness": 1, "user": "Suzkin2", "date": "June 25, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 114735626}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "All experiences with hotel staff were good. Quick check-in.", "title": "I love Chicago and I loved the Hotel Allegro", "helpfulness": 1, "user": "sansan22", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114678174}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I was in Chicago to visit my son who made reservations for me to stay at this hotel which I prepaid 3 weeks in advance. Due to flight delays I didn't check in until after 9PM and was placed in a room across from the elevators on the 12th floor. I typically don't care to stay in such centrally located rooms due to elevator noise but I figured I would try and ignore that and not make a fuss.", "title": "It's home away from home.", "helpfulness": 1, "user": "BerniceHalverson", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114652379}, {"rating": 5.0, "title": "Bad Situation that they handled excellently", "text": "When I arrived they were still under construction (however I never saw the construction everything looked perfect). They informed me that the rooms that they had left were being worked on and so they needed to send me to their sister hotel (Hotel Monoco). They paid for my hotel, my parking, and my taxi ride to the other hotel, and provided me a Suite for the following night at the Allegro. ALL the staff from both hotels were wonderful however the staff at the Allegro took great care of me and went out of their way across the board. I keep reading that the rooms were small. If you have ever traeveled to NYC and stayed in a hotel the rooms are the same size as those you will find in NYC. The size was fine and I was able to hang my clothes and move around in the bathroom with ease. When I come out here for business again you will be sure that I will be staying. I wish to thank Mike Potter especially for going out of his way for me throughout my stay. Once again, thank you sooo much for a great stay at both of your hotels!!!", "user": "onmytoes4", "date": "May 7, 2008", "id": 15783196}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Rooms are clean but tiny. Bathroom has an odd double door that allows others to see anyone using the toilet. The air conditioning turns off with a sound like someone breaking into your room. The TV has limited channels and no real program listings, just channel lists. Even a cheap motel does this better. Finally, when we called down for our car to leave (cost $40 to park overnight), it took them 45 minutes to bring it down.", "title": "Good but cut corners", "helpfulness": 1, "user": "LeonardPotts", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15599881}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Smack-dab in the theater district, the Allegro's also within easy walking distance of the Sears Tower & the Museum Campus (includes Adler Planetarium, Shedd Aquarium, Field Museum) & lots of other Loop attractions. The hotel is finishing up a major renovation -- the lobby & other public areas are really spiffy. Our room was cozy, but very comfortable. There were 2 adults & 2 children in 2 double beds. I worried about noise from the El, since it's so close by, but I never heard more than a faint rumble. The staff were, without exception, *very* helpful & friendly. The kids even got little \"Kimpton Kids\" mini backpacks with all kinds of goodies in them. We were completely delighted with our stay, & hope to have the pleasure of visiting again sometime!", "title": "Perfect location in the Loop!", "helpfulness": 1, "user": "sccalligrapher", "date": "April 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15247781, "likes": {"liked": "— location, location, location", "disliked": "— the bathroom's a little tight -- we had to be very efficient with our toiletries!"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The people is nice if you don't have any problem, but", "title": "Bad, noisy, tiny bathroom...", "user": "TaBueno", "date": "April 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 14888887, "likes": {"liked": "— Good for small pets and nice theaters with Broadway's shows", "disliked": "— Small bathroom,noisy,pricy and mediocre service"}}, {"rating": 5.0, "title": "Fantastic Stay - Amazing Hotel", "text": "if you have one they say very nice \"I'm sorry\"", "helpfulness": 1, "user": "imaswede", "date": "March 3, 2008", "id": 14003046}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "If you like boutique hotels, it's time to join the Kimpton loyalty program. This hotel line rarely disappoints. Hotel Allegro represents Kimpton's high standards.", "title": "Kimpton cool", "helpfulness": 1, "user": "CTHeather", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153126986}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Check in took all of two minutes. Hotel staff was friendly and accommodating, unlike other chains where staff simply pretend you are not standing two feet from their dismissive faces. Check out was similar - quick and easy.", "title": "Overall very good hotel", "user": "candit72", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 153112688}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The lobby was spacious, well-appointed with a beautiful, bold color scheme. The room was a reasonable size -- not big, but what you would expect in a major city. The king bed was comfortable and the desk was large enough to set up my laptop.", "title": "Fun weekend getaway", "user": "Wendy S", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153077659}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Perks of being in the loyalty program include: early check in (I arrived at 10:30 am!), $10 to \"raid the mini bar, free Wi-Fi and a free newspaper in the morning. All hotel guests can access the complimentary wine happy hour and coffee/tea in the morning.", "title": "Im new to Kimpton...and this property has made me like them more.", "helpfulness": 2, "user": "JamesE339", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152991240}, {"rating": 3.0, "title": "Quite disappointed", "text": "Hotel is centrally located to many attractions in Chicago. I would recommend this hotel for business or leisure travel.", "helpfulness": 1, "user": "congoroom", "date": "February 24, 2013", "id": 152945873}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We had an extended stay at this hotel as we were in between houses. Since we were temporarily homeless, we brought our dog with us. The stay was wonderful! We paid a little extra for the larger room, so ours was very comfortable. As a designer, I was in heaven with all of the beautiful finishing touches in our room and around the hotel.", "title": "Hip design with comfort and friendliness", "user": "Jessica S", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151913512}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The bed was extremely comfortable. The hotel offers many additional amenities upon request and we were able to have a humidifier brought to our room. That really helped make the room much better for us southerners used to the humidity!", "title": "regular weekend getaway", "helpfulness": 1, "user": "Felicia O", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151465018}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Since we had our dog, we were able to coordinate a time to be out of the room so that they could clean the room. We visited in the middle of winter, so we had to stay in the lobby with our dog. No one seemed to mind. Housekeeping was in and out as requested.", "title": "50th Birthday Celebration Getaway.", "helpfulness": 1, "user": "Sherrilyn K", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151186512}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The staff is very friendly and helpful with all requests.", "title": "Great location at a classic boutique hotel", "user": "Green24", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150977156}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My favorite part of the hotel is the free happy hour. It was a nice chance to get out of the room and socialize with some other guests. The extra large lobby was a great place for interaction. They also provide coffee and tea in the morning. A very nice set-up and convenient to grab a cup and head out the door.", "title": "Great hotel the Chicago's Loop area and very pet friendly!", "user": "Coachlong2xaa", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150431551}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I try to stay in Kimptons whenever I can, because they set the bar fairly high. I had a great experience at the Allegro when I was in downtown Chicago for business.", "title": "Meets the High Bar set by Kimpton (and Me!)", "user": "ChrisK6884", "date": "February 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152792474}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "My room was spacious (though there could have been a counter in the bathroom) and the lighting was adequate for working as well as ironing. If you join their InTouch loyalty program, you should receive an honor bar credit upon checkin.", "title": "Nice hotel without a lot of extras", "user": "Wayne_son_of_Murray", "date": "February 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 152788951}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The evening wine reception and all-day beverage service in the lobby were nice touches, as well.", "title": "Great hotel with all needed amenities!", "user": "Daysie76", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152753384}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I ordered room service and it was delivered quickly and the food was good.", "title": "Last minute stay, but not the last visit", "user": "Roy D", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152533600}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "All in all, I'd stay here again.", "title": "Great service and location", "user": "Cincytravelqueen", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 152345993}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Chicago has much to offer. There are hundreds of activities to do do. Maybe that is why this hotel has put very little emphasis in their regular rooms.", "title": "Just to sleep.", "user": "1wellfedman", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 150396333}, {"rating": 5.0, "title": "Will be one of my two \"go-to\" hotels in Chicago.", "text": "The Allegro was once an office building, dating back to the 20s or 30s. If you look close enough, there is evidence of it everywhere.", "user": "A TripAdvisor user", "date": "January 21, 2013", "id": 150237324}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "My room was very small, clean, but VERY small. 15' X 10' Just enough for a bed and a small night table. The bathroom was an old closet masterfully converted.", "title": "Little extras make it special", "user": "TracyLew", "date": "January 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 150210183}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Over all, the hotel is well furnished, has a great ambiance and it's clean.", "title": "Good business hotel but not for leisurely trips", "user": "UpandComing", "date": "January 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149914241}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I would recommend it for overnights, perhaps not for more than two days.", "title": "Great time in Chicago!", "user": "George M", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149887076}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I chose Hotel Allegro for our one-night anniversary getaway because of its reputation and location. It was everything we hoped for and more. In addition to the free wine hour that helped me choose Allegro over some of its Chicago competition, we enjoyed the friendly staff, comfortable bed, flat screen in-room TV and a luxurious (if small) bathroom appointed with Aveda amenities.", "title": "Allegro made our anniversary getaway special", "user": "almabalma", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115374886}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "But what really made our stay special was the surprise waiting for us when we returned from our dinner out: there was a gift of Champagne and chocolate truffles awaiting us! I travel for work every month and stay in luxury hotels. Never before has one made me feel like such a valued guest.", "title": "Amazing is the only way to describe it", "user": "Canadian9824", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115339164}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Well, what can I say? Everything was awesome about this place.", "title": "Walking distance to major attractions!", "user": "KCTraveler50Plus", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115293098}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "1) staff were so, so, so friendly and helpful.", "title": "The treated us like royalty!", "user": "LKL-DC", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 115250567}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "2) free booze every day! And during the \"cocktail hour\" the manager of the hotel actually mingled with guests and chatted! Really nice touch. We also had a free bottle of wine sent up to us and a $10 credit on the mini bar. And there was really good iced coffee (or hot) every morning.", "title": "I Love This Place", "user": "NNewJerseyTraveler", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115164102}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I really like the Allegro. I go to Chicago on business often and stay there each time. The wine hour is great - gives you a chance to unwind by yourself or with colleagues after a long day at the office. In the summer, they also offer sangria and local beer. It's from 5-6 and appetizers are also served. The room size is typically small, but that's pretty standard in downtown Chicago. It's convenient anywhere downtown - local restaurants, businesses and parks. The people are friendly and check is quick and easy. Anytime I've needed something, I call and they come right up. The bar downstairs is fabulous too!", "title": "I love the Allegro and stay often", "user": "tcolussi", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115049119}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed July 1 thru July 3 for a mini family vacation for 4 adults. Can't say enough great things about this hotel, but I'll try.", "title": "Great Weekend Getaway", "user": "Chris B", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115023266}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The Staff: Very friendly and completely accommodating. Everyone, from the guest services staff, to the concierge, to the bellman and housekeeping staff, to the happy hour hostess.....all were very professional, always smiling, and very helpful.", "title": "Great Customer Service!", "user": "Fabulous26", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115009798}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "The Room: We had 2 adjoining rooms- one with a king bed and one with two double beds. Both rooms very tastefully decorated in art deco style. Loved the contrast of patterns and colored ceiling. We kept the shared door open and felt like there was ample room for all of us. The double bed room was bigger than the other so we all (4 adults) spent most of our room time together in there. The bathroom for that room was bigger as well. We all agree that the beds were some of the most comfortable we have ever slept on in a hotel. Plenty of pillows too! They give you both foam and feather so that was a nice touch, too!", "title": "Another great Kimpton", "user": "atljs", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114998688}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Bathrooms: Very small, but clean and quite functional with everything you need, including plenty of towels.", "title": "Great perks for a business traveler", "helpfulness": 3, "user": "JetSetFiend", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114900184}, {"rating": 4.0, "title": "good bang for your buck", "text": "this was my second stay at the allegro, the first was in 2011. this hotel is in an awesome location (just a minutes’ walk from local attractions and the cta). the décor is fairly chic with a hint of old school style (see elevators).", "user": "missthea", "date": "July 24, 2013", "id": 168877079}, {"rating": 4.0, "title": "Typical Kimpton Service I Expect!", "text": "the hotel partners with restaurant 312chicacgo which is accessible directly from the hotel. the food and service there was delightful! the brioche French toast was a true treat and for dinner I highly recommend their gamberoni . the only issue was by the end of the weekend many of the popular items were “sold out” due to key ingredients not being available. so I had to change my drink order several times during dinner and received an EARLY call from room service asking for an alternate order because they were out of salmon. I wasn’t too happy about that but I would not deter anyone from dining there because of this, just caution you to go early.", "user": "Tricia L", "date": "July 22, 2013", "id": 168635689}, {"rating": 4.0, "title": "Great location!", "text": "also of note was the concierge service available at the allegro. there were two reps available during our stay of which Anthony was the absolute best!! he went above and beyond to be helpful during our stay. he even delivered garrett’s popcorn to us because our schedule wouldn’t allow us to make it there before closing", "user": "buenvino", "date": "July 22, 2013", "id": 168575374}, {"rating": 4.0, "title": "We keep coming back", "text": "the only true con of this hotel is the rooms/bathrooms are fairly small. However, they do offer standard larger accommodations for those requiring accessible rooms. overall, the allegro gives you what you need and most you desire while visiting Chicago. it will definitely continue to be on my short list of hotel options when I return to the city next summer.", "user": "sm J", "date": "July 22, 2013", "id": 168568036}, {"rating": 4.0, "title": "great weekend", "text": "My husband and I definitely prefer Kimpton hotels and this one is no exception when it comes to their high standard of service. We arrived early for check in (by 3 hours) hoping just to leave our bags and go have lunch somewhere until check in time, and instead they had our room ready immediately. Our room was spacious and clean, front desk staff was really welcoming and the doormen were quick to call cabs for us. The location is right in the middle of blue and brown line train stations. I love that they have complimentary cruiser bikes available to use and a really well equipped fitness center. Typical complimentary wine hour with management and coffee/tea in the morning. Upon check out, we casually mentioned that one of the flavored vodkas in the mini bar wasn't good and they immediately took it off the bill without hesitation.", "user": "CHRIS W", "date": "July 18, 2013", "id": 168116615}, {"rating": 3.0, "title": "When expecting the average", "text": "Allegro is an average place to stay, and the adjectif applies to every point of interest while travelling : location wise, the hotel is in the theatre district, which makes it quite comfortable to go back to after a show but not so close to the shopping or museum areas, which are many people's main attractions while staying in Chicago. The rooms are comfortable and quite agreable to inhabit, but lack that little touch that could make them real interesting. No view from our window, but we haven't visited the whole building. The restaurant experience was good at diner, but much too expensive and not so delicious at breakfast. Room prices were \"reasonable\" for a large city hotel, even though our Travel Agency made a large benefit that we'd have appreciated sharing...", "user": "A TripAdvisor user", "date": "November 2, 2005", "id": 4081308}, {"rating": 4.0, "title": "Great Stay!", "text": "We enjoyed a great long weekend stay at the Allegro. We were in Chicago for the marathon and we were pleased to find that we had a large, quiet room and very comfortable beds. Our only concern was with the small bathroom, not very easy for tall people to use. The hotel staff were friendly and polite and very willing to answer questions and offer suggestions. The hotel itself is in an ideal location and help make our stay in Chicago a very pleasant one.", "helpfulness": 2, "user": "Pavlov", "date": "October 10, 2005", "id": 4006578}, {"rating": 3.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "I didn't like that the windows were sealed shut and in the case of a fire or emergency, I wouldn't have clean air to breath (because it was pretty stuffy air inside the room and in the hallway). I loved the fitness center, it was stylish, clean and practical.", "title": "BRING Your own Extension Cord", "helpfulness": 1, "user": "Chuubie", "date": "October 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3998840}, {"rating": 1.0, "title": "Overrated tarted-up flophouse", "text": "I also loved their free wireless. However, I wouldn't have been able to use it had I not read another user's WARNING that there is only 1 plug in the room, so before I left for chicago, I packed my surge protector so I had a wealth of outlets to plug into... I would have been devastated otherwise.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 6, 2005", "id": 3998796}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "They have free wine hour if you like to mingle, and it's right next to the Lion King (at least that's what was showing when I was there). Overall, a good location.", "title": "Good points and bad points", "helpfulness": 2, "user": "Foodiehiker", "date": "September 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3979934}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The Allegro Hotel, like other Kimpton Hotels, has great service and immenities - free WiFi, free wine hour from 5-6, Aveda bath products. The rooms are fantastic. I stayed in the Lion King Suite; it was so wonderful that I had to stay another night! It was very over the top with an animal head on the wall, African masks and a water feature. It was my boyfriend's birthday and the staff sent up a bottle of single malt scotch for us, gratis! I am always blown away by the staff at the Kimpton.", "title": "Allegro Hotel - Another Great Kimpton Hotel", "user": "KatGirrl", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12907814, "likes": {"liked": "— Free WiFi, Free Coffee in room, Free Wine hour,", "disliked": "— Valet is expensive, though I believe that if you have hybrid you park for free at Kimpton Hotels."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The Allegro is going under renovations, so many of the old rooms that they had will no longer be available. See pictures of the Lion King Suite!", "title": "Great Hotel and Location!", "helpfulness": 3, "user": "PClovesOBX", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11996963, "likes": {"liked": "— Great decor, personable staff and wonderful location", "disliked": "— Our room cards kept resetting"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Two moms and 3 boys ages 9-11 loved this hotel. It was groovy enough for the boys to think it was cool- chic enough for the moms to feel like we were \"getting away\" Great location VERY close to the train for easy access everywhere.", "title": "good hotel, great price", "helpfulness": 3, "user": "ragaja", "date": "November 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10818010, "likes": {"liked": "— location, quality, price", "disliked": "— no pool or fitness area"}}, {"rating": 2.0, "title": "Needs Updating and Cleaning.", "text": "We were able to take a train from the airport and walk (or take the train) everywhere. Room was very quiet, had a complimentary wine and soft drinks every afternoon and were very considerate in storing our stuff so that we could run off to a Cubs game before check in time.", "helpfulness": 2, "user": "travelure27", "date": "November 5, 2007", "id": 10615462}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The concierge was great and \"called a friend\" at Harry Carey's to get us in. The boys who were all baseball buffs loved this restaraunt. Went to the Navy Pier, the Field Museum, and we were even close enough to walk to the Sears Tower.", "title": "Mediocre", "helpfulness": 1, "user": "glfrgrl", "date": "October 30, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 10455855, "likes": {"liked": "— location, bar", "disliked": "— room size, service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Chose the hotel for its location and convenience for a short tourist-y getaway to Chicago. Great experience, no complaints. A little cheaper than some of the surrounding comparable hotels. Complimentary coffee in the mornings, and free wine reception each evening. Beautiful and interesting decor in the lobby and in the rooms. Rooms are small-ish, but that is to be expected in the city. Free internet if you sign up for their (free) rewards program.", "title": "Great place.", "helpfulness": 1, "user": "Rachel W", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167792107}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We always try to find boutique hotels when we travel and this one is just great! Although the rooms are not very big, they're very efficient and well decorated. The staff is very engaging and helpful. We enjoyed a meal at the hotel's \"312 Chicago\" restaurant - great Italian menu and service. The complimentary coffee in the morning and daily happy hour (5-6) are very nice. The hotel is ideally located in The Loop's theatre district and within walking distance of great shopping, museums, art galleries and the infamous Millenium Park. Best way to see the city is the Hop On & Off Bus tour. Chicago is a beautiful city and it's architecture is awesome!! Will go back for sure!!", "title": "Great boutique hotel in heart of theatre disctrict & the Loop!", "helpfulness": 1, "user": "3clc3", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167647792}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This is a great hotel. The staff is efficient and engaging. Rooms are spacious and the area for the wine hour is spacious with a great atmosphere. I didn't actually dine in the restaurant, but got to sample some of their food during one of the wine hours and it was very good.", "title": "Marvelous Hotel", "user": "Christopher S", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167512826}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We typically enjoy boutique hotels. Unfortunately we found the Allegro to be average which was disappointing. We've always enjoyed Kimptons. The room was really, really small. It was literally impossible for my husband and I to be in the bathroom at the same time. In fact, the sink was similar to an airplane sink. It was not possible to wash your face and not drench the bathroom floor because the sink was so small. We were there for 4 nights - 1 night and 1 person would have been totally manageable. We asked 2 different times if there were any larger rooms. Twice we were told that we'd be called back when other rooms were available. We never got a call back. My husband ran out of dental floss and called to request some (there was a list of amenities they would supply if you forgot something). The floss never showed up. We finally went to the front desk to get it. Really just a surprising lack of attention to detail and at best a mediocre experience.", "title": "SMALL rooms", "user": "Barbara C", "date": "July 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 167235431}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I really liked this hotel, I stayed for 2 nights late June. Friendly staff- clean and spacious room. Great location!!!! Complementary coffee in the morning and complementary wine in the afternoon from 5-6. Lobby is very cozy and several seating areas. Loved the free wi-fi. I recommend this hotel to anyone.", "title": "Great short stay!", "user": "Raquel B", "date": "July 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167124122}, {"rating": 2.0, "title": "Hit or Miss? Just Ok if you hit, but bad if you miss.", "text": "After doing a ton of research about finding a place to stay in Chicago using Priceline or Hotwire, we determined that we could get the Hotel Allegro for about $85 a night. Although we had read the reviews here BEFORE we placed our bid, we took a shot that the Allegro would be OK.", "helpfulness": 5, "user": "rippowam22", "date": "August 24, 2005", "id": 3803729}, {"rating": 2.0, "title": "Spotty Service at Pricey Hotel", "text": "And it was. Sort of.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 20, 2005", "id": 3791957}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "We stayed for 4 nights in mid-August, it was a dead weekend in Chicago and we knew that we had our choice of available hotels in this price range (we use betterbidding to help us bid). Through this research we knew that we were winning the Allegro. Since we wanted a romantic getaway, we thought that the idea of a boutique hotel was appealing.", "title": "Good fit at the heart of the Theatre District", "helpfulness": 2, "user": "dexdgolden", "date": "August 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3755748}, {"rating": 4.0, "title": "A Wicked Good Time", "text": "Our first experience with the hotel was that as our taxi pulled up, the bellmen didn't help us out with our bags. They weren't especially busy, more like inattentive. Even after we hoisted our bags out the taxi's trunk, they didn't offer to help bring them inside.", "helpfulness": 9, "user": "lam44", "date": "July 20, 2005", "id": 3685917}, {"rating": 5.0, "title": "Arty and fun", "text": "When we got to the desk, we had to wait about 15 minutes to be helped (even though we were 3rd in line and it was a Saturday). We agree that they're understaffed. 1-3 desk clerks for a 400 room hotel isn't enough.", "helpfulness": 5, "user": "ark1", "date": "July 17, 2005", "id": 3676009}, {"rating": 4.0, "title": "A Very Good Experience", "text": "We chose this property based on its location and price, and we were not disappointed. Yes, the room was on the smallish side (especially the bathroom and the closet), but that was to be expected with this type of hotel. Hotel décor was kitchy and on the hipster side. Room was very clean, beds were comfortable and linens were soft. We had an issue with our neighbors who were very, very loud, but one call to the front desk solved the problem. Took advantage of the free wine and beer hour, and we also received two complimentary continental breakfast vouchers. I encourage you to join their rewards program which gives you free Wi-Fi and $10 to \"raid the mini-bar.\" If we had stayed longer, we may have even taking advantage of their free bikes that they loan to their guests. Overall, a pleasant experience; would highly recommend.", "user": "Karch72", "date": "July 29, 2013", "id": 169628466}, {"rating": 5.0, "title": "Lovely boutique hotel", "text": "We loved the decor and got several decorating ideas from our room! Even though the rooms are on the smaller side, we had a baby, stroller AND a pack n play (which they provided including sheet!!) and were totally comfortable. There are TWO closets to hang your clothes in. The service was perfect and location was super close to all public transportation. There is a freshii.com a block away for you healthy eaters. Become a Kimpton member and get free wifi and $10 out of the minibar!! Will definitely stay here again!!", "user": "grothman", "date": "July 28, 2013", "id": 169444315}, {"rating": 4.0, "title": "Very nice", "text": "Very clean, nice. Free wine and beer in afternoon, and coffees in the morning. The rooms were a bit tight snd the walls were thin (we heard the drunk people next door at 3:30 am) but the rooms were comfortable. Also nice workout room and good location in the theater district.", "user": "chilled79", "date": "July 28, 2013", "id": 169433368}, {"rating": 4.0, "title": "This trip a 3 1/2 experience - beautiful spaces.", "text": "I have stayed here before. The public spaces and rooms are beautifully designed. The rooms are small but very well planned. The decor and appointments are A+. The staff is very nice. Bedding is nice. Amenities include the usual and bath robes, socks in the closet.", "user": "OBD2142", "date": "July 25, 2013", "id": 168990909}, {"rating": 4.0, "title": "Solid, well restored hotel", "text": "There are no coffee makers in the room. You need to go downstairs in the morning for you complimentary cup.", "user": "rpwmass", "date": "July 25, 2013", "id": 168972968}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Spent 2 nights at the Allegro and was definitely impressed. Nice mix of historic art-deco architecture and modern, chic decor. Standard no-view room was small at 229sq ft which I knew at time of booking. Well appointed furnishings & comfy bed. Pleasant staff , not super friendly but helpful. Pricy valet parking of course, $40 to be expected for downtown location. Easy access to freeway. Great lounge adjacent to hotel called Encore. Only bummer was no coffee-maker in room.", "title": "Cool Vibe", "user": "tomalei", "date": "June 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16863502, "likes": {"liked": "— Hip Ambiance", "disliked": "— No coffeemaker"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I love this hotel. I just find it very charming. I love the decor, and the location is great. Front desk staff is always friendly and helpful. Valet's good too - there was this guy Chuck at the valet when I stayed here a few months ago and he was just the nicest guy. Haven't seen him the last 2 times I stayed here though. Also ordered room service for breakfast once and it was great.", "title": "Hits the soft spot", "user": "alfredck", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16767106, "likes": {"liked": "— Decor, staff, location, charm", "disliked": "— Thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "The rooms are definitely smaller, but they're enough for 2. I've also stayed at the King suite before - nice separate living room space, but you can only sleep 1 comfortably on the sofa bed. My friends opted to lay the pillows on the floor and slept on the floor instead.", "title": "Good experience", "user": "TAMember484", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16413587}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I get the feeling that the hotel doesn't have all its processes down yet. Sometimes I make requests (such as pillows or pet bowls) and they take a long time to be fulfilled. Sometimes it takes multiple reminders, and sometimes it takes me to be proactive by going downstairs to the front desk. They certainly seem to be improving everytime I stay here though. and if anything does go wrong, the staff does its best to remediate the issue, an effort which I am appreciative of.", "title": "Cute hotel", "user": "lucaska", "date": "May 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 16346550, "likes": {"liked": "— Free wine tasting every evening!", "disliked": "— Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "My biggest issue with the hotel is its thin walls. Of my stays here, I've heard neighbors' passionate nights to phone conversations, and I'm not even a light sleeper. My worst experience was when my neighbor decided to wake up to Josh Groban 45 minutes before I wanted to wake up. An unfortunate incident likely resulting from being in an older building, but somehow I still like this hotel a whole lot and keep going back. I now request for quiet rooms in my Kimpton profile, and it seems to have helped in my most recent stay.", "title": "Not too shabby.", "user": "amy77385", "date": "May 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16113928, "likes": {"liked": "— Modern facilities", "disliked": "— Trouble finding AC plug outlet"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This was our third stay at a Kimpton, and the hotel chain continues to deliver. Very mod, stylish lobby & hotel room. Great location near the Chicago el.", "title": "Another great Kimpton", "user": "texashappygal", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17373535, "likes": {"liked": "— Location & bed comfort", "disliked": "— bathroom lack of counter space, lack of mirror other than bath"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "VERY large room, extremely comfortable bed (we slept until 10 every day!). Our suite had a fold out couch as well as a king bed - not always easy to find a good sleeping arrangement for 3 people. 2 armoirs with TVs. Very comfortable bed & great down pillows. Staff was very courteous. Excellent closet space. Room was quiet & had good views.", "title": "Still Okay, not Great", "user": "KP&TP", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 17340537, "likes": {"liked": "— Huge Suite", "disliked": "— Bathroom, no counter space"}}, {"rating": 4.0, "title": "Overall Good Experience", "text": "Free wine happy hour 5-6 pm every day. The lobby can be quite a happening spot during this time.", "user": "kka", "date": "June 27, 2008", "id": 17287555}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Only cons - virtually no counter or shelf space in the bath room. No vent either. Also, desk should have a mirror so that you don't have to put on your makeup in a steamy bathroom. These hotels are obviously designed by men!", "title": "A little disappointed", "user": "travelerms", "date": "June 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 17137330, "likes": {"liked": "— Clean, comfortable room", "disliked": "— No vending or ice machines!"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Have stayed at this hotel many times over the past five years or so, this is my first trip back since they remodeled.", "title": "Not our favorite by any means", "user": "LyndaMN", "date": "June 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 17063705, "likes": {"liked": "— Location", "disliked": "— Only one chair, cold decor, tiny room, and the worst view EVER."}}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4, "variance": {"poor": 76, "average": 202, "very good": 553, "terrible": 28, "excellent": 598}, "aka": "Hotel Allegro Chicago", "slim_ranking": 0.349397590361, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Located in the downtown Chicago Loop and newly renovated, the exquisite Hotel Allegro Chicago has reopened to great acclaim. Centered in the lively theatre district, adjacent to Encore Lounge and restaurant 312 Chicago, this hotel is convenient to Chicago’s greatest attractions. The historic building, dating from 1924, features original Art Deco elements combined with modern luxuries to create a multi-sensory feast."}