{"user_rating": 4.0, "review_count": 527, "name": "Hotel Mathios Village", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My wife and I had a wonderful time staying in Santorini at Villa Mathios. Originally we booked this trip in May 2005, but had to cancel due to illness. Mathios villas did not charge me anything for this inconvience. As a matter of fact when I rebooked it was at at different season and rates were slightly higher, but by only a few dollars. The booking agency actually charged me more at first, but corrected their mistake which I would have never know about had they not told me(thank you for your honesty). As I have read some of the other reviews, I see some very unhappy customers. Why they are unhappy, I don't know. I would like to address some of their issues. The reason you cannot take your own beverages to the pool bar area and you have to buy them from the pool bar is not because Kostas is greedy, as some have stated, it is because of the tax laws. Drinks are taxed diffently at pool bars, than inside of resturants. If the tax auditor comes, and they can come at anytime, and ask for receipts of everyone drinking by the pool and this shows that some have brought outside drinks, then Kostas would be fined heavily. Addressing the issue of renting towels: We in America are very wasteful. Santorini has a water problem (there is not enough of it) Therefore renting a towel for a couple of dollars helps keep from wasting water on unneeded washing. As far as cleanliness, I have stayed in 5 star hotels that were not this clean. Everything was spotless and we stayed in a standard room that overlooked the caldera. My wife and I stayed at Villas Mathios for 5 days and enjoyed every minute of it. Not once did I see Kostas act mean as some have stated. The prices were more than reasonable and my wife and I intend to go back in a couple of years and stay at Mathios Villas again. The town of Akrotiri that it is located in is quite and near the Red Beach and the Light House which had wonderful sunsets. I would like to thank Kostas personally for hosting us, and the kindness that he showed us (he even does some greek dancing by the pool). If you are going to Santorini my wife and I highly recommend staying here. The food, atmosphere, kindness, everything was beyond our expectations. Hope to see you there.", "title": "Wonderful Honeymoon of Becky and Bobby", "helpfulness": 4, "user": "BeeandBob", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6031659, "likes": {"liked": "— Everything", "disliked": "— Could not stay longer"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Bobby and Becky", "title": "Watch out - they're trying to nickle and dime you.", "helpfulness": 12, "user": "mid-30s-parents", "date": "October 10, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 5934722}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The low rate makes this hotel a decent value, if you're careful. It seems that Costa's game is baiting you with the low room rate, then renting you a car, selling you overpriced drinks and snacks by the pool, forcing you to rent towels, etc. First, THE BUSES ARE FINE! He'll try to tell you they're always late, overcrowded, etc. The bus between Thira and Ia was crowded, but the others were not, and all were on time. Second, if you're going for a romantic getaway, get a room in Ia or Thira, because the rest of the island is a bit barren and depressing. The hotels in the towns are pricey because they offer breathtaking views - in my opinion, it's worth it. That said, Mathios Village does have a nice pool. Our room was clean, and the bathroom was big (although the glassed-in shower was the smallest of our budget-minded trip). That's it for the compliments. If you want a double bed, ASK FOR ONE. We assumed a \"special double\" room had a double bed - it had 3 twins. The sheets were thin and worn, and the towels were remarkably stiff and tattered (mind you, we're not 5 star travelers).", "title": "the best there is", "helpfulness": 2, "user": "renee11", "date": "October 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5922906, "likes": {"liked": "— everthing!!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We where in the wonderfull hotel of Villa Mathios, and had a perfect stay. The food was excellent, staff and personal where friendly and helpfull. The hotel has a beautiful pool with bar, and where we had very tasty lunches and nice conctails in de evenings. The hotel is suited at a nice and quiet part of the island, the bus (public transport) to the capitol stop near the hotel, and it took only about a 20 minute ride to Fira. But you can also rent a car wich is a good alternative.", "title": "A family-run hotel well worth visiting. One of the best on the island!!", "helpfulness": 5, "user": "BH_FD", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5912375}, {"rating": 5.0, "title": "Beautiful, perfect - simply a DREAM!", "text": "We would like to say thank you to Costas (the manager) and his staf for their hospetality and a great and peaceful stay in his hotel.", "helpfulness": 3, "user": "The_Red_Devil", "date": "October 5, 2006", "id": 5911225, "likes": {"liked": "— The food, the rooms, the staff, the beautiful pool area, KOSTAS!", "disliked": "— That we only stayed one week!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I spent nearly a week at Mathios village with my husband and grandmother and our comfortable accommodations, the relaxing ambiance of the pool/courtyard, and Kostas' (the owner's) help in planning trips (like our boat trip to the volcanic islands and Thirasia) that made my visit to Santorini the best vacation I've ever taken!", "title": "You are full of it! We had an amazing time!", "helpfulness": 1, "user": "camelot_7z", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7772222, "likes": {"liked": "— The cleanliness of the room, the beauty of the pools, nightlife drinks by the bar", "disliked": "— Other guests complaining about the location, it's rural, that is good, have you seen FIRA? It's insane!"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The staff was friendly, the room was always impeccably clean, and the loft with the full-sized bed made it feel that we had two rooms instead of one. The room rates are extremely reasonable and Kostas and his wonderful family and staff felt like a circle of friends by the time we left!", "title": "Don't stay here", "helpfulness": 6, "user": "hotelbuffEngland", "date": "May 31, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7723646, "likes": {"liked": "— cleaner", "disliked": "— room"}}, {"rating": 5.0, "title": "Beautiful and Fun Village Mathios", "text": "It is amazing how different the world is for those that want to enjoy it. I witnessed a disagreement between a patron and Kostas (the owner), He handled it very well. The patron had an extra person in their rooms and lied about, and tried to get things for free, after already being upgraded to a better room free of charge. These are the people who complain about this hotel, people who want special treatment and will lie and cheat and write bad reviews when they don't get it. I hope you can live with yourselves affecting someones business in such an unethical way.", "helpfulness": 7, "user": "korbyCanada", "date": "February 13, 2007", "id": 6785682}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Cheers,", "title": "Good Experience", "helpfulness": 8, "user": "ya426", "date": "January 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 3.0}, "id": 6570174}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We were really looking forward to it but were extremely disappointed. I really would not recommend staying at this hotel.", "title": "Villa Mathios, Great Hotel & Wonderful People!", "helpfulness": 6, "user": "BostonGreg", "date": "December 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6509427, "likes": {"liked": "— Very friendly people, great food, and nice clean rooms!", "disliked": "— room"}}, {"rating": 5.0, "title": "Great, relaxing place to stay", "text": "My husband, my son, and I had a great experience at Hotel Mathios. Santorini is a very costly island and we found Hotel Mathios to be the best value for the money. The hotel is located in a quiet location, with easy access (we found parking in front of the hotel every day).", "helpfulness": 1, "user": "GreekTraveler_7", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8090954, "likes": {"liked": "— Clean rooms and grounds great pools friendly staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The rooms are very clean, and the staff very friendly. The breakfast buffet was good with typical greek-style offerings (yogurt, cookies, bread, butter, jams, honey, cheese, ham, and hard boiled eggs). Fresh coffee was excellent. Cereals and milk were also available for guests.", "title": "An Oasis in Santorini", "helpfulness": 2, "user": "usakiwi", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8074139, "likes": {"liked": "— The pool area, Kostas and his family", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We loved the two pools and snack bar! The beaches in Santorini are not the greatest to swim in, so we spent at least 3 hours every day swimming in one of the two pools, sunbathing and drinking Margaritas and soft drinks from the hotel bar. The pools were sparkling clean and there were plenty of chairs to lounge in.", "title": "back to my roots", "helpfulness": 1, "user": "V&PBostonMA", "date": "July 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8040009}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Kostas, the owner, was extremely nice and helpful. He helped us get a rental car at a reduced rate--through his travel agency--that was delivered to us 10 minutes after we requested it.", "title": "WONDERFUL: quiet, clean, friendly -- PERFECT if that's what you're looking for", "helpfulness": 1, "user": "AryehG", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8023164, "likes": {"liked": "— Quiet, away from the tourist mobs and cruise ship throngs", "disliked": "— No view of the Caldera from most rooms - but beautiful views of the sea & vineyards so hardly a real issue for us"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We would highly recommend Hotel Mathios. We found our stay there to be relaxing and we found the family-owned hotel to be a clean, friendly, quiet, and pretty place.", "title": "quiet, relaxing and quaint", "helpfulness": 1, "user": "kiddydoc", "date": "June 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7976590, "likes": {"liked": "— pool, staff, quiet", "disliked": "— room seemed a little dusty"}}, {"rating": 5.0, "title": "Fabulous Find!!", "text": "What an absolutely fabulous experience for anyone thinking of traveling to Santorini!! The Mathios Village Hotel is a family-run establishment that coddles every guest and makes you feel like family the minute you arrive!", "helpfulness": 2, "user": "mentosdesign", "date": "June 23, 2007", "id": 7970215}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "It was an amazing travel coup to travel to a place never before visited and within 20 minutes of arrival Mr. Kostas had a car rented for us, a boat excursion reserved, and 3 days worth of travel plans all in place. Everything was perfection and we couldn't have had a more enjoyable time!!", "title": "Very Happy with our at Mathios Village", "helpfulness": 2, "user": "troyory", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7868514, "likes": {"liked": "— The cleanliness of the room and property as a whole", "disliked": "— nothing..other than it's distance from Fira and Oia..if you don't like to drive"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "What a lovely setting to come \"home\" to each day after hours and hours of exploring the island....2 sparkling pools, wonderful \"mama-made\" meals, evening cocktails by the pool and the generous hospitality of a VERY gracious host family.", "title": "Hotel Village Mathios", "helpfulness": 1, "user": "Five-Abroad", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7837843, "likes": {"liked": "— Pools, Peaceful location"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "When planning a visit to Santorini, do yourself a favor and stay at THIS hotel....you'll be soooo happy you did : )", "title": "You can do better!", "helpfulness": 5, "user": "891236503", "date": "June 12, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 7837545}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "My wife and I stayed at the Mathios Village for three days. We must say we went with reasonable expectations and were very satisfied with our overall experience.", "title": "A relaxed stay", "user": "frenchkissboy69", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7832258, "likes": {"liked": "— the familly run business", "disliked": "— nothing"}}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 30, "average": 34, "very good": 124, "terrible": 37, "excellent": 302}, "aka": "Mathios Village Hotel", "slim_ranking": 0.333333333333, "description": "Family run Hotel with a swimming pools in the historical akrotiri near the famous red white and caldera beach with , restaurant , pool bar , travel agency we offer rooms , suites , family rooms special offers and packages"}