{"user_rating": 4.5, "review_count": 311, "name": "Hotel du Chateau", "reviews": [{"rating": 5.0, "title": "wow", "text": "stayed here on our honeymoon, it was lush! clean, welcoming, and we will go back! what a view!", "helpfulness": 1, "user": "GrahamS3", "date": "April 9, 2011", "id": 103362447}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Just returned from 3 day stay. Can only endorse what other reviewers have said. Great location virtually opposite main gate, relaxed atmosphere, beautifully equipped room. Hard to fault. Would wholeheartedly recommend.", "title": "Excellent small hotel", "helpfulness": 1, "user": "Dillon2401", "date": "March 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 102314150}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The Hotel is facing the towers and the walls of the Cité. The hotel is totally unique. Rooms are spacious, with king beds, gorgeous bathroom. Modern and old mixed together.", "title": "Perfect Location Lovely Rooms", "user": "Patriciazu", "date": "March 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101880307}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "You can walk to the Cité as all you have to do is cross the road and walk through the drawbridge. A ,very relaxing atmosphere.", "title": "Delightful", "helpfulness": 1, "user": "EpicureanLawyer", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101536477}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I heartily second the good reviews for the Hotel du Chateau. We stayed one night in mid March 2011. This small hotel is a bit expensive, but worth it. It's easy to find and just steps from the medieval city gate. Parking is gated and safe. Our room. which was located in a small annex near the outdoor pool, was very quiet and private, and appeared to have been recently renovated with beautiful appointments - marble floors, wood paneling, excellent lighting, stereo, flat-screen, etc. The shower in the bath was large enough for two persons. The bed was probably the most comfortable I've ever slept in. Staff at the desk were extremely courteous, friendly and helpful. Unqualified recommendation.", "title": "WOW WOW WOW WOW WOW WOW", "user": "dgelbard", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100940869}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Very helpful staff, wonderful location 100 meters from the old city. Hotel has no restaurant or gym, but as plenty of restaurants and running tracks in vicinity this isn't an issue", "title": "Great staff and location", "user": "TiaEllis", "date": "June 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 131834368}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "One of the best hotel i had during my french trip. Nothing bad to say about it. Rooms are quite comfortable, enough space for both of us, nice furnitures. Clean and fresh sheets.", "title": "Excellent service, would recommend it", "user": "pierre g", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131471048}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "There is a nice pool (heated) and jacuzy. The restaurant has an awesome view on the casttle. I would recommend it over every other hotel in Carcassonne.", "title": "An unexpected retreat", "helpfulness": 1, "user": "HarBri", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130259666}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stopped at The Hotel du Chateau during an unexpected night in Carcassonne. First of all, the location cannot be beat. We did not want to stay inside the medevil city, so being located right at the gates was perfect for us. The garden greets you when you enter, along with two very friendly well fed dogs. The staff were welcoming and very helpful with helping us arrange dinner. We had a suite, Our room was well laid out, clean and comfortable. Be forewarned, the tub area is only separated by a glass wall (with blind). We did not mind this as the toilet and shower is more private, but it may upset some.", "title": "Don't be fooled by the photos", "user": "Michelle A", "date": "May 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129981708}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We would definitely return to both Carcassonne and The Hotel du Chateau", "title": "Great location - comfortable and highly recommended", "user": "RoyASt", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129492914}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Our family of five visited the historic city of Carcassonne and stayed at this conveniently located hotel just outside the walls of this amazing site. Hotel du Chateau's staff were friendly and helped us book a table at Le Parc restaurant on the evening of our visit.", "title": "Good location", "helpfulness": 1, "user": "Soteria", "date": "July 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133341555}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "lovely hotel with comfortable beds and excellent shower. In an excellent position just outside the walls of the medieval city. Swimming pool was a lovely temperature, nice to have somewhere to sunbathe after sight seeing.", "title": "perfect location", "user": "Angie058", "date": "July 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133296696}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Breakfast was a bit disappointing, only 2 cereals on offer, cornflakes or chocopix. No fruit.", "title": "Mixed feelings", "user": "Dogdoodle", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133124660}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Staff were friendly and helpful.", "title": "Elegant Hotel in a Beautiful Setting", "helpfulness": 6, "user": "rwaites", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132440130}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This hotel is in an excellent position with secure parking. Our room was comfortable and well-equipped. The staff were helpful and mostly multi-lingual. There is however no restaurant. Also the cleaning was not of sufficient standard for the cost of the room. The owners need to reconsider their maintenance and cleaning routines.", "title": "Hotel du Château/Hotel Montmorency", "helpfulness": 3, "user": "lpayne", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131957691}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Booked this hotel for two nights in June, to visit Carcassonne. Hotel is an a fantastic location just outside the Cite, with lovely views over it. Rooms were nice and clean. Staff were extremely friendly and helpful. Breakfast really nice in the morning. They also have a beautiful Bassett Hound who we doted over as we had to leave ours at home with my parents!!", "title": "Lovely hotel in a great location", "user": "girlpace", "date": "June 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114688105}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I have just returned from a five-night stay at Hotel du Chateau, Carcassonne. It is situated very close to the entrance to the wonderful medieval \"city\" of Carcassonne. We were treated with courtesy by the staff in the hotel, many of whom were able to speak quite good English,even though I did my best to converse with them in poor French! We were shown to our room which was classified as a \"classic double\" room on arrival. We were immediately disappointed because the room was small and poorly laid out. It was adequately decorated and the queen-sized bed was very comfortable. The room had a spotlessly clean very modern shower-room en suite. However, it had no proper wardrobe space to hang our clothes. There were two tiny drawers in the desk provided only. There is no tea/coffee-making facility in the room either which was a drawback, because the hotel does not have a separate restaurant or serve an evening meal. You can have a very good continental breakfast, which we availed of on two mornings. The hotel has a lovely terrace and gardens with a very well-maintained outdoor pool and jacuzzi. Overall, we had a lovely restful break there, but would suggest that proper wardrobe facilities and a kettle should have been provided to warrant the €160 per night room-rate we were charged. The hotel also has a spa which we did not use.", "title": "Wonderful Location - pity about poor facilities to hang up clothes!", "user": "Clare099", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 2.0, "service": 4.0}, "id": 114671874}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The hotel is ideally located just across from the medieval part of Carcassone, but also walkable to the \"new\" town. Well-appointed rooms, nice staff, excellent bathrooms, convenient parking, quiet, and a very nice outdoor area for reading, having a drink, etc. If I go back to Carcassonne, I'd definitely stay here again.", "title": "Well-run hotel in a great location", "helpfulness": 1, "user": "SFVacationer", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111345238}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "As most reviewers say. The location is perfect for touring Carcassonne..and the Hotel has parking.", "title": "Unbeatable Location -", "helpfulness": 1, "user": "MikeTheRiley", "date": "May 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108561685}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The hotel is near the entry to the Old Town, where there are many restaurants in easy walking distance.", "title": "Wonderful, wonderful stay at Hotel du Chateau!!", "user": "chrisully11", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108300424}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Located next to the castle in the medieval city. Nice and relaxed atmosphere, despite the close location to the main tourist attraction. The hotel was fully booked, so the pool-area was a bit crowded. The room we had was nice and fresh. Parking inside the hotel area.", "title": "Nice little hotel", "helpfulness": 2, "user": "les_dupont", "date": "June 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7940533, "likes": {"liked": "— The site!", "disliked": "— Small pool area, only a problem when the fully booked hotel is spening time by there."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I decided to have my 65th Birthday Party in Carcassonne partly because I am interested in Military History and partly because of the ease of travel ( and cheapness ) from Liverpool by RyanAir. We did a dry run first because it was difficult to find a satisfactory hotel from the Internet and because we were a large group.My wife and I went first to find a hotel that would suit us. This hotel is excellent. It is very stylish and there are very nice gardens with a swimming pool and it is no more than five minutes walk from the castle walls. We had a room right by the swimming pool and this is the one to stay in if you have children. The only meal served is breakfast which is pleasant and acceptable. The rooms are stylish and comfortable and much better than most French Hotels that I have experienced. We visited every hotel in Carcassonne to choose one and we believed this to be the best - if you have children with you. We stayed in the Hotel de Dongons which is also very nice but within the walls and with no gardens or pool. The Hotel de Citie is very nice indeed but very expensive and we had my celebration Dinner there. This was for 13 people and was excellent - the food, wine, staff, and the magnificent Dining Room were superb and in my opinion could not be bettered anywhere. Carcassonne is a wonderful city and the local history is fascinating. Buy or borrow a book on the Cathars - it will make your visit more interesting.", "title": "Stylish, modern and close to the Castle walls.", "helpfulness": 10, "user": "DavidBLancs", "date": "May 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7591292, "likes": {"liked": "— The ambience", "disliked": "— Rooms a little small."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Party of 4 stayed here in late January for 2 nights (Sat & Sun). Husband & Wife and Son & Grandmother (2 rooms).", "title": "Clean, Modern, Great Location but some things to consider....", "helpfulness": 4, "user": "TimK-M", "date": "February 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 13372565, "likes": {"liked": "— Location. Staff. Parking. Modern Feel.", "disliked": "— Glass Bathroom Walls. Tiny shower cubicle. Misled about twin beds."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The Hotel du Chateau is a very stylish and modern hotel with furnishings that still have a newish feel. Very good beds as well (which is important). On this European trip we encountered perhaps the friendliest staff that we met. All 3 ladies that worked the front desk all wore wide smiles and genuinely seemed to enjoy their jobs. Their hospitality was very welcome.", "title": "Fabulous Hotel", "helpfulness": 1, "user": "JennyMerseyside", "date": "February 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13230814, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Booked this hotel from the website and was prompted to do a re-check of the site upon return home. Sure enough there was one picture that featured the fact that a room (turned out to be most rooms) had a feature glass wall between the bed and the bathroom. Further, the bathrooms feature a combination of frosted glass and clear glass to the toilet cubicle. Didn't pick this up when we booked. Probably would have asked more questions and looked elsewhere if we had (or perhaps the hotel may have suggested a solution). As mentioned, our 16 year old son and 72 year old grandmother shared a room. I'm afraid a glass wall between bedroom and bathroom plus a semi frosted toilet door are really not going to work out! Had to have our son shower in our room and also be in our room when grandmother used the bathroom. To be fair, the Hotel did move them after the first night to a larger room where the bathroom could not be seen from much of the room. Parties travelling in a Twin format should really consider this.", "title": "Stylish, Comfortable and Perfect location!", "user": "danco28", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12409492, "likes": {"liked": "— the hotel room", "disliked": "— the hotel breakfast is relatively expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "One major issue arose. In all of the European hotels we booked on our 4 week trip we stipulated that we would need a Twin room (no fold out beds) and were accomodated thus. This Hotel confirmed in writing that they could accomodate this requirement. Upon arrival we discovered that the 2nd bed in all their rooms was a foldout couch. We found this unacceptable. Not sure of the situation in France, however, we are accustomed to this being midleading information.", "title": "bon voyage", "helpfulness": 2, "user": "dunstead", "date": "December 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11626877, "likes": {"liked": "— atmosphere/decor", "disliked": "— no tea making facilities in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "I didn't particularly like the glass bathroom wall. Turning the light on in the bathroom involves an unwelcome lighting of the entire bedroom. Shower cubicles are roughly 800mm x 750mm which makes for a very cramped shower and you have to step into the bath area proper inorder to dress (think Twin share).", "title": "Lovely hotel", "helpfulness": 4, "user": "hipposWiltshire_UK", "date": "August 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8591026, "likes": {"liked": "— It was a very high standard of accommodation", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This 3-4 star hotel enjoys an excellent location just two minutes stroll from the gates of the well preserved medieval city. The staff are universally pleasant and efficient and there is the added benefit of a nice pool to relax in after pounding the city streets.", "title": "Small rooms!", "helpfulness": 1, "user": "Rover10", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 140168154}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Unfortunately a drawback is the size of the rooms and the beds. We opted for a \"superior\" which seemed to be built into an old wine vault - atmospheric but definitely on the small side but at least it was quiet.", "title": "Great location, Great Stay", "user": "quackmar", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139956268}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The Hotel du Chateau should prove a good 1-2 night base whilst you explore the excellent old city but it would appear that its sister hotel the Montmorency (which shares the bar and reception with the du Chateau) offers rooms about half the price of the €280 we paid. It may well be the Montmorency offers you a better deal although I have no idea of room size!", "title": "A superb place to stay", "user": "SJH1958", "date": "September 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139701975}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Location is unbeatable, especially for the price. When I was shopping for a room in peak season, the hotels inside the walls were considerably more expensive. This one is across the street from the gate to the Cite, so you have easy access before and after peak hours. Its secure parking lot is right there, so no long bag drag. Staff was very friendly and welcoming. Our room was very clean, comfortable. It was in the back, so no view from the window, but it was very quiet. Fantastic views from the lovely lawn seating area and the pool are very nice extras.", "title": "Fabulous solution for tranquil hotel a stones throw from medieval city", "helpfulness": 1, "user": "sf8887", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139240417}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "A really enjoyable visit here to see the amazing Cite and the local area.", "title": "Pleasant ambiance", "helpfulness": 1, "user": "Squigleys", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138981240}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Beautiful hotel, excellent decoration, very friendly staff and excellent breakfast.", "title": "Fantastic hotel", "user": "ec_grs", "date": "January 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94715502}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Every minute of our stay was pleasant. Very much recommended!", "title": "excellent", "helpfulness": 2, "user": "mjbaudy", "date": "January 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91953924}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "From the moment when we arrived to the moment we left everything was prefect.The rooms was beautifully decorated .Our room looked out on to the chateau and at night with all the lights on it was fantasic.Comfortable beds , large and gave a wonderful nights sleep.The staff very very helpful.The breakfast was good and everything local , the only thing about the coffee was that it let the hotel down a bit as it was typical hotel coffee, weak and very thin.For the lovers of good strong coffee its a bit of a shame , but then not everyone drinks italian coffee at breakfast. Very much American style coffee .Other wise the apple juice and cheeses were very good as well as the breads .Parking was locked which helps for a good nights sleep.All in all i could do nothing but recommand this hotel", "title": "Location, Hospitality, and Comfort worth every penny", "helpfulness": 1, "user": "raulhopkins", "date": "November 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88310889}, {"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "We stayed here for 3 days as a part of our honeymoon. We took a shot in the dark after reading the trip advisor reviews. We were extremely happy with our choice!", "title": "Fabulous rooms, great location.", "user": "JenMcTBrussels", "date": "November 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 87682525}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Everything inside has a historic medieval feeling, down to the tasseled key, but the hotel is relatively new with all of the modern amenities that you could think of and more. The king sized bed was large, plush, and the sheets were very comfortable. There is a motorized privacy screen in the picture-window bathroom (which wouldn't leave too much to the imagination!). The floors and bathroom are smooth stone tiles. The doors are old fashioned. The vacuum effect does jar the doors in the downstairs hallway, but it's not too bad. It was too cold to swim, but the pool, which is detached from the hotel, is shrouded by plants. The premium rooms seemed to has their own VIP access to special hot tubs that we couldn't access! Parking was included and every room has a spot. After a somewhat stressful experience in Spain, Hotel du Chateau was a welcome place for relaxation.", "title": "Slick hotel, extremely well run", "helpfulness": 1, "user": "boundary", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84002281}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We [family of four with 15 year old and 11 year old daughters] are on 3 week whirlwind tour of France. This Hotel is one of the best so far on trip. First, I must point out that there seems to be two hotels in one.... Hotel du Chateau and Hotel Montmorency... and I am a bit confused but I think the Hotel du Chateau is the main building structure while the Hotel Montomorency is an annex structure... Conversely, they are one in the same property sharing the same breakfast, management, etc.", "title": "Clean, Modern, Excellent Location- We Loved It", "helpfulness": 1, "user": "gtpatton", "date": "July 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17451645, "likes": {"liked": "— Location, Clean, Modern"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "The best thing is that we could not have lucked out any better on location; we pulled into Carcassone for one night only, and checked in, went for swim in pool in mid afternoon [pool is basic rectangle, nothing special, but nice to have for kids] then when weather cooled down, only 50 yards away is back entrance to the walled city. Just walk 50 yards! Dont get back into your car and drive and park!", "title": "Great Hotel", "helpfulness": 2, "user": "IrelandLaura", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17183242, "likes": {"liked": "— Bedrooms, Pool, bar (everything really!)", "disliked": "— Nothing! (some people might not like the residents dogs and cat....)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The room is clean, modern, marbled floors/bathroom, air conditioned, flat screen TV, nice bed [we had some sort of mini-suite in main building and therefore a pull-out counch [bed for kids] was in same room, directly in front of master bed [not in separate sleeping area]. But this was fine, bathroom was clean and modern. Internet Access in room [wireless] and when I went upstairs for coffee at around 7:30 they were eager to please [early morning coffee sometimes difficult in Europe]. They gave me small pot, even though I was coming back later with family for breakfast.", "title": "Fabulous view", "helpfulness": 1, "user": "Renebet", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 16675673, "likes": {"liked": "— The views", "disliked": "— Bigger rooms would have been good"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Definately recommend.", "title": "Position could not be better", "helpfulness": 1, "user": "Biggles68", "date": "April 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14788768, "likes": {"liked": "— It's position", "disliked": "— The bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We had tried to book a hotel within the old city but couldn't get availability for our travel dates so upon reading reviews of this hotel decided to give it a shot. We were not disappointed!", "title": "Nice but dont try and check in before 3pm!!", "helpfulness": 3, "user": "paws2paws", "date": "April 1, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 14713792, "likes": {"liked": "— location", "disliked": "— the owner's attitude and arrogance"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We spent our second night in Carcassonne here. It is opposite the entrance to La Cite and so you can get into the town before the hordes of other tourists arrive. Our quiet room was at the back of the hotel, small but very comfortable. The wc was separate from the bathroom and both these rooms were very small. There is no restaurant but there are plenty nearby. The grounds are well kept, there is secure parking and a spa which we did not use. The breakfast was a continental one and good quality but did not have the range of foodstuffs we have experienced elsewhere. The receptiponist was efficient and helpful. We paid 146 euros.", "title": "Smart and comfortable.", "helpfulness": 1, "user": "ge0rgiana", "date": "August 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137179491}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We arrived in France at Carcassonne airport and spent 2 nights here before heading further south. It was practical for us since we wanted to simply walk out and see the old walls of the cite. It's a very decent overnight stay.", "title": "Good location for an overnighter!", "user": "SunPepper_82", "date": "August 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137144355}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Rooms are a little on the small side but very well furnished. I can't remember much of the breakfast I had at the hotel but we decided to fill our tanks on our second morning at the Hotel de la cite not far from here. Nothing like being in the midst of history itself!", "title": "Comfortable hotel, excellent location", "helpfulness": 1, "user": "IWG72", "date": "August 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136838193}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed one night in a delux room. The room was not very big, but nicely furnished. The bathroom was comparably larger, with separate jacuzzi and shower. It had glass walls towards the bed area, giving a roomier feel to the room. The room had three small windows, one facing the pool and two facing the city walls. It was located on the top floor, with no elevator (one floor up from the reception). Compared to most hotels we visited on our three week journey the room appeared at bit expensive, due to its size, but location always comes at a cost.", "title": "Good hotel at a great location", "user": "Torunn H", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136464281}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The hotel is perfectly placed for visiting the fortified city, with just a few min. walk to the entrance. The view of the city walls can be enjoyed from the bar/breakfast area. I appreciated both the good-sized pool and the secured parking, although the enclosed part of the parking became full before all guest had arrived. The service was friendly and helpful throughout.", "title": "Better than expected", "user": "Fiona S", "date": "July 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134391711}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Excellent location (right outside the city walls) Well appointed clean rooms that were decorated beautifully!", "title": "EXCELLENT LOCATION AND HOTEL", "helpfulness": 1, "user": "ntm4", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115458204}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "You only need about one to two days max in Carcassone. We stopped off after a few days in Biarritz, France on our way to Provence, It was about a 4 hour train ride to Carcassone from Biarritz. Hotel staff were lovely....this is a nice, charming hotel to stay in a charming midevil city!!! This was our one of our favorite hotels in France.", "title": "Classy and chic", "user": "strolling8", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115027969}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Location Is perfect. We had a standard room and it was everything you would have wanted. Comfortable, elegant and modern. Service very friendly and like others have commented", "title": "What a backdrop!", "helpfulness": 3, "user": "PaulineT", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114791519}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Enjoying a drink or breakfast out on the terrace is a wonderful experience. However, it is expensive so you should expect this standard at this cost. Treatments were pricey too.", "title": "Like a fairy tale", "helpfulness": 1, "user": "AmandaFoxy9", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114758486}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "There is no doubt that the location of this hotel is certainly the biggest asset. To have breakfast or to enjoy an evening drink on the patio with the City walls as a backdrop is just memorable. We stayed for 4 nights and were given a classic double room. Not the largest bedroom of our trip and the bathroom was a little 'style over substance' to some degree but of an ultra modern design. Worst bit was lack of storage - no drawers anywhere and a small wardrobe. However, this is a small complaint as we loved staying here. Breakfast was lovely with local producesuch as cheese and meats on offer - everything was of excellent quality. Nice to have a swimming pool and jacuzzi for residents - it was very hot when we were there! Clearly the owners of this hotel work hard to maintain excellent standards and presentation. A tip - food, unless you go really upmarket, tends to be pretty standard in the city walls - try the medieval part of town just outside the walls - some lovely and more typical small restaurants.", "title": "Boutique hotel in great location", "helpfulness": 1, "user": "ladyjaneWindsor", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114699940}], "location": {"country": "France", "region": "Languedoc-Roussillon", "continent": "Europe"}, "stars": 4, "variance": {"poor": 12, "average": 36, "very good": 97, "terrible": 6, "excellent": 160}, "aka": "Du Chateau Hotel", "slim_ranking": 0.15, "description": "The hotel is ideally situated, facing the towers and city walls of the medieval Cité it welcomes you at the entrance to the drawbridge. The marriage of ancient and modern offers an interesting journey between the medieval and the contemporary.The hotel is totally unique : a rare elegance and model of aestheticism, it is a constant reminder of timeless good taste and defines the art of entertaining guests.Wine tasting and enjoyment in the panoramic bar…A special space, relaxation in the sun or shade around the heated pool, opening from Pâques to Toussaint or the heated Jacuzzi opening all the year. Relaxation, pleasure and absolute refinement in our luxury SPA CARITA"}