{"user_rating": 4.0, "review_count": 2554, "name": "Hotel Marina El Cid Spa & Beach Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "ARRIVAL and CHECK-IN:", "title": "Honest Thoughts from an Experienced Traveller.", "helpfulness": 35, "user": "We-Love-The-Ocean", "date": "January 21, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12843998, "likes": {"liked": "— The Pool and the Beautiful Suite we had.", "disliked": "— Taxi costs to go to and from the resort."}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We arrived on January 7th for a 10 night stay. We chose to use private transportaion \"Cancun Vans\", they were prompt and courteous. We arrived at the resort around 1PM and we were told our room would be ready by 2:30PM. We originally booked a standard luxury room through orbirtz and then chose to upgrade through the resort to a 1 bedroom jacuzzi suite. While waiting for our room to be ready, we were directed to the people who book you for the timeshare presentation. I was prepared for this from reading others reviews and handled the situation accordingly. I told them that I have no interest in hearing about the resort, I want to experience it. I told them if we decide to listen to their presentaion I will contact them. We never did and they never bothered us.", "title": "Do yourself a favor... GO SOMEWHERE ELSE!", "helpfulness": 5, "user": "sccrawle", "date": "January 20, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 12814438, "likes": {"liked": "— The pool", "disliked": "— The food, the beach, and the customer service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We got to the room they gave us and were extremely disappointed. We were not in the 1 bedroom jacuzzi suite that was described to me by the assistant reservation manager when I made the upgrade in advance. It was a jr. suite with a kingsize bed in the middle, a murphy bed on the left and a weirdly placed jacuzzi to the right of the bed. It did have a very large balcony with a 2nd jacuzzi but this was not the room we had paid for. We returned to the lobby and had a very frustrating 10 minute conversation with the someone who did not grasp the fact that the room was not a 1 bedroom suite. She told us for more money we could have a 2 room suite or get a refund and have 2 beds as no kingsize were available. We politely asked to speak to a manager and that's when \"Richardo\" stepped in. Hats off to him. He asked if he could show us a different room and \"WOW\", we finally got the room I was expecting and more.", "title": "Excellent!!!", "helpfulness": 8, "user": "Zumbrota_Traveler", "date": "January 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12773540, "likes": {"liked": "— Everything!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "THE SUITE:", "title": "Telling it like it is", "helpfulness": 6, "user": "djrampage7", "date": "January 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 12625480, "likes": {"liked": "— The atmosphere of the hotel", "disliked": "— The restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "We were in Building 17, which is one of the new buildings and is closest to the Marina Restaurant and Saccramengo Beach Bar. We were put in a 1 bedroom prestige. I believe it's called prestige because it is ocean/beach front and can become ajoining with the suite next door. The Suite is beautifully done. Large floor to ceiling windows and sliding doors in the bedroom and living area. Marble counter tops and nice wood furniture with comfy cushions. The bed was the best I had ever stayed on at a resort or a hotel. The blackout curtains work great. I was also lucky enough to witness some amazing sunrises while enjoying the jacuzzi on the deck. The deck extended the entire suite and could be accessed from the bedroom and the living area. There were 2 sets of tables an chairs to enjoy. Although the metal frames could use cushions. Little things we noticed that may bother some were the little touches that were rushed over. Paint splatters on windows and bathroom fixtures. This to me is the difference between 4 ad 5 star resorts. We were very happy for the price we paid, to get what we got.", "title": "exceeds expectations", "helpfulness": 2, "user": "gerb0044", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12588591}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed at El Cid Nov 22 – 29. First, many thanks to the helpful folks on TA who answered our questions and provided trip reports. The resort was at 100% occupancy for a few days of our week and by the fourth day it was probably at at 30%. If you want a resort right on the beach, El Cid is the place. Not many AIs in the Mayan Riviera run parallel to the beach like this. This, along with the smaller size of the whole property, appealed to us a great deal.", "title": "Relax and have fun at El Cid!", "helpfulness": 25, "user": "derekmom", "date": "December 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11466038, "likes": {"liked": "— Layout of resort - ocean views from almost everywhere.", "disliked": "— Beach area next to resort property on either side. No where to walk."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We booked a Funjet AI package, Luxury room category. Upon arrival, we received a third floor room in Bldg 17 which overlooked the construction area by the marina. Not only was the view horrible, the construction vehicles were very noisy. Needless to say we asked to be moved and the front desk did accommodate us the next day with no fuss. Our new room was 1505….a few steps away from the adult pool area and beach…we loved it! The maid service was excellent. She always came back in the evening to see if we needed more towels, bed turn down, etc. Fridge was always stocked.", "title": "Relax at El Cid", "helpfulness": 25, "user": "SheClix", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11429565, "likes": {"liked": "— Secluded location, friendly staff", "disliked": "— While beach is beautiful, seaweed can sneak up on the beach, water at beach is rocky"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Never a problem finding a chair by the pools or on the beach….even on those 100% days…no towel games here. The pool was cool but refreshing…had fun jumping off the “cliff”. Did not try the slide…saw too many bruises and scrapes from other brave (or crazy) people. Kids really enjoyed this area. Music is always played at the pool during the day. The adult Jacuzzi area is quiet…no real shade there though. Please be aware there are large rocks in the ocean…Mgmt. should post a sign! The water was clear blue and calm some days, and other days there were waves to play in and seaweed. Not much beach to walk on, when you head north it’s just coral/rock, and washed-up garbage unfortunately. Again resort beach not ever crowded…the palapas are spread apart and an empty beach bed or hammock could always be found. Very relaxing and nice to be close to your room when you needed to get something.", "title": "Okay, but some problems", "user": "mattIllinois", "date": "December 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 11265555}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We never needed a reservation for the ala carte restaurants….most of the time we decided in the evening where to eat and just showed up….no problems. The (Mexican) restaurant by the pool was open on some days for breakfast and lunch (buffet) and for dinner al a carte. We ate there most of the time…the buffet in the lobby very noisy to us. We enjoyed the fusion restaurant a few evenings…entre’s were pretty good, salad bar , fresh bread, and soup were excellent. We had our “lobster” dinner at the marina…we were by ourselves for most of the dinner. Lobster was okay, it was nice to eat somewhere different….the mosquitos were bad though that evening. I’m not sure why, but the mosquitos did not affect us the first 4 days at all….then it rained hard one night and bugs were terrible. Make sure to bring bug spray.", "title": "Had a great time and plan to come back!", "helpfulness": 11, "user": "ValleyWanderer", "date": "December 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11213869, "likes": {"liked": "— Pool and beach activities", "disliked": "— Same old time share sales B.S."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "In the evening we usually started off in the Adult-pool Jacuzzi….it was actually heated (I heard it was not heated the week before we arrived). We had “happy hour drinks” there with some guests…then dressed for evening (you can be casual or dressy) went to lobby for a drink and then dinner. There was entertainment in the lobby some nights, like casino night.. We saw a professional-type show one night near the pool….dance troupe was very good showing “dances of Mexico”. The most fun was at the Scaramanga bar at the beach. Very romantic and/or fun place to hang out at night. I don’t think many people realized this place existed. There was mood lighting music playing, full bar is set up with beach waiters. Just plop down on some large cushions under a palapa or on a beach bed and party under the stars. It was an awesome experience….especially with the full moon!!", "title": "Perfect vacation for families -Paradise for scuba divers", "helpfulness": 12, "user": "conniline", "date": "December 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 11193476}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This hotel is not yet done. we were told only 1 out of 4 phases is cmplete. We thought it was completely done because we contacted the hotel and they told us it is. When we arrived, the check in and other staff were not very nice and accomodating. We booked and we had a deal that we were supposed to have champagne in the room but it did not happen. Also website says that we'd get oceanside or poolside views but we didnt get that either. they did upgrade us to jacuzzi suite though so that was nice. the food is average. one restaurant \"Alcazar\" is the best. You had to make reservations there but its amazing. The seafood lobster place is average and the other Mexican restaurant is below average. The buffet for breakfast/lunch in Mexican place is great. The buffet in the lobby is the worst - worst food and service. Beach is nice but the water is not really crystal color, there is seaweed. You could swim there but you need water shoes. Sport activities are nice - they have kayaks, boogie boards, etc all included in all inclusive rate. The pool is great and huge. The pool bar is great too. the drinks are good. pool has waterslide and you can also jump into the water. there are many places to lie down and they have a jacuzzi for adults only. they will have a nice steam room /sauna area but i dont know when. it is not done yet. they do have a spa thats done but it is very overpriced. there is a small gym there as well with ocean view. so overall it will be a nice hotel when everything will be done but i am not sure when that will happen. for now, dont go and find something thats already established.", "title": "Will be great hotel when it is completely done but it is not!", "helpfulness": 2, "user": "diankiny", "date": "January 27, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 2.0}, "id": 13038239, "likes": {"liked": "— upgrade to jacuzzi room", "disliked": "— service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My husband and I went to El Cid for Jan.5-19 using vacation club certificate we own.We purposely choose non all inclusive places so we can save money and also eat locally. Upon check in at El Cid we were steered to a \"hospitality desk\" where the lady tried to get us to buy all inclusive based on a chart she had of the El Cid meal and bar prices. The prices were higher than the El Cid real prices we discovered. She also said there was no local bus in Puerto Morales which is not really true..there is a little collectivo around town and also one large bus that heads northward from town toward H10 resort on a back road. You do need to get a taxi to the highway however and they will drop you at the ADO bus station there where you can buy your tickets and find out the schedules for buses going all over Yucatan and to Quintana Roo (Merida,etc.)", "title": "good resort for non all-inclusive guests", "helpfulness": 4, "user": "bogartVictoria_b_c_", "date": "January 25, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 12989740, "likes": {"liked": "— good location on beach with town very close", "disliked": "— non all inclusive guests cannot use all facilities and not given full information"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We found all the food we needed at the grocery in Puerto Morales and also used the good El Cid Marina restaurant a few times and had great drinks at the lobby of El Cid every night, which we charged to our room.", "title": "Great time at el Cid", "helpfulness": 13, "user": "christmasmom07", "date": "January 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12977608, "likes": {"liked": "— beautiful rooms and buildings. great atmosphere"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Every night there was either a small live band or sax player in the lobby plus a 9pm very professional show in the new Convention centre on site. Absolutely first class entertainment at El Cid now.", "title": "Go with a small group, or not at all.", "helpfulness": 3, "user": "aknud", "date": "January 23, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 12934628, "likes": {"liked": "— walk in shower", "disliked": "— service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We found local ADO buses easy to use to get to Cancun, Playa del Carmen and Tulum and the very best snorkeling at Yal Ha lagoon at Akumal. Very good if you are not a great swimmer.They rent snorkelling gear there also. Entrance to Lagoon is $7.50 or 75 pesos cash only. Lots of nice places to eat nearby in Akumal.", "title": "Just Our Point Of View From The Land Of Oz", "helpfulness": 13, "user": "121109b", "date": "January 23, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 12919002, "likes": {"liked": "— The Room", "disliked": "— The Check In"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Booked this trip through a travel agent for a NW Airlines package.", "title": "exceded my expections in many ways", "helpfulness": 9, "user": "scottinm", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12577522, "likes": {"liked": "— Great service", "disliked": "— Lack of nightlife"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I wanted to fly a non-stop, scheduled flight, so was willing to pay the few extra dollars to arrive in the early afternoon. As has been reported here earlier, the road into the resort leaves something to be desired, but I certainly wouldn't let that be the deciding factor in choosing where to spend your vacation. I've been on much worse closer to home. Stop whining!", "title": "LONG - Had a fantastic time.....don't understand those that didn't", "helpfulness": 17, "user": "gal4giants", "date": "January 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12441464, "likes": {"liked": "— Service staff & the beach", "disliked": "— El Alcazar & rude guests"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Check-in was very quickly accomplished. Front desk help was very pleasant, and they up-graded me to a junior suite with no prompting from me. Suite was nicely appointed with a great view of the pool and ocean beyond. After staying in this suite for the first night, I noticed that this room had previously broken into and would not lock properly. after a short time of language difficulties (my problem, not theirs) I was moved to another suite. All in all, I'd say that they handled this situation pretty well, no complaints from me! Every room has a well stocked, if small, refridgerator. If you ask they will change the stock to whatever you prefer, I.E. all beer, all coke, all water, whatever. This is all included in the all inclusive package, no extra charge.", "title": "Terrible and understaffed resort that is trying to be something it's not", "helpfulness": 7, "user": "simbenz", "date": "January 6, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 5.0}, "id": 12393919, "likes": {"liked": "— the rooms", "disliked": "— service of entire staff"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Bathroom is interesting-two sinks in the main room, seperate shower room and seperate toilet room. No bath tub-could be difficult for families with young children.", "title": "Absolute luxury but beware of the timeshare tactics", "helpfulness": 15, "user": "TerriandTim", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12248471}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Food was much better than other all inclusives I've been to. Breakfast was very good at both buffet restaurants, and reservations at the two ala carte spots were easy to obtain.", "title": "Honest Review", "helpfulness": 19, "user": "Jeanette97", "date": "December 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 11612408, "likes": {"liked": "— The regular staff", "disliked": "— The Platinum Club"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 154, "average": 305, "very good": 835, "terrible": 96, "excellent": 1164}, "aka": "Hotel Marina El Cid Spa & Beach Puerto Morelos", "slim_ranking": 0.347826086957, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 4.0}}