{"user_rating": 4.5, "review_count": 278, "name": "Hotel Villa Les Cygnes", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I cannot find a single thing to fault at Villa Les Cygnes. My husband and I stayed there on our honey moon and we were greeted at the gate (parking is free and on the street) by Gildas and assisted to our room which had a balcony and overlooked the street. Unfortunately it was raining otherwise we would have enjoyed a drink on the balcony. The room was spotless and elegantly furnished, and to our surprised we were shown two options for our shower head! Gildas offered us a welcome drink which was lovely and after recommending us somewhere to eat for dinner left us to our own devices. We elected to have the breakfast and my word were we glad we did! Gildas prepared a fantastic breakfast and remembered what we drank on the second day. The food was fresh and seasonal and beautifully presented. For 10 euros each it was a steal! Gildas was able to make a number of recomendations re sites and places to visit during our stay and all of which were worth the effort. I have no hesitation in recommending this hotel and should I visit Nice again I will make sure that I stay here again! I wish Lydiane & Gildas all the best for the future and thank them for a fabulous stay!", "title": "Perfect Place", "helpfulness": 2, "user": "T-A-UK", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53325429}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "If you like staying in a nice house with good friends ,this is the place for you.", "title": "Staying with good friends", "helpfulness": 3, "user": "Ceilings", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50365881}, {"rating": 5.0, "title": "Good Location & Great Hosts", "text": "I cannot compliment Gildas and Lydiane enough for making our stay so comfortable ,they are the perfect hosts ,there when you need them ,but give you enough space and time to explore and experience for yourself , the beauty of Nice and surrounding areas.", "helpfulness": 5, "user": "TXHillCountry10", "date": "November 9, 2009", "id": 48838345}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This is a very comfortable B&B that they have lovingly restored and live in themselves and share with guests.", "title": "just as said by all previous reviewers excellent", "helpfulness": 3, "user": "terance", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47792829}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The breakfast is more than you can ever eat ,with everything beng fresh and served either in the kitchen or terrace (Weather dependant).", "title": "Nice, reasonably priced accommodations - but NOISY!", "helpfulness": 3, "user": "Navyfan", "date": "October 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 46045473}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We have recently traveled through Europe and UK and USA and this hotel would be the single BEST that we stayed in. Its not so much the hotel which in itself is excellent, its the hospitality that the owners show to their guests. They both made us so welcome and went out of their way to help when we were in need of help. The hotel is in a lovely quiet street but still close to everything that Nice has to offer. A pleasant 5 min stroll gets you to the waterfront/beaches and 20 mins walk gets you into the old town. I have to say that there is nothing nicer than the stroll down the beach into town! We cannot recommend this hotel highly enough and if you are traveling to Nice we would say that this is the ONLY place to stay. (thats if you can get in)", "title": "AMAZING !!!!!!", "helpfulness": 1, "user": "MandRRuapehu", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 30777349}, {"rating": 5.0, "title": "A quiet, tasteful and tasty B&B", "text": "Villa Les Cygnes is such a delightful place - you will not be dissappointed. WE loved everything about it. The location was perfect, easy to find, 5 minute walk to the beach - it is tucked into a quiet street, absolutely no noise at night at all and best of all it is located a few steps from the Musee des Beaux Arts, Nice's gem of a museum. (not to be missed)The B&B has unbelievably kind and helpfull owners who made us feel welcome and at home immediately. They work tirelessly to keep the B&B in perfect condition. The B&B is probably the cleanest place I have ever stayed in - everything was spotless. We handed our rental car in and found it no problem at all to walk everywhere we needed. If necessary the bus service is close and very cheap and realiable. We opted for the breakfast which is worth its weight in gold. The breakfast was hands down the BEST value we have ever had in Europe. A large and over generous assortment of oven fresh breads, pastries, cheeses, meats, jams, fresh platters of fruit, fresh squeezed orange juice, and endless cups of tea or coffee. We ate in the charming garden setting where the owners waited on us as if we were royalty. Thank you for spoiling us with your fantastic house and great attentive service. Lesley and Rael", "helpfulness": 4, "user": "framinles", "date": "July 1, 2009", "id": 33691934}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "My sister booked this hotel for both of us as a birthday present for me! Stayed 4 nights.Beautiful very spacious bedroom with small balcony,lovely bathroom with 2 sinks,ideal when travelling with a sister! We had room no 5.Staff very friendly & helpful.Bus stop very handy,fare is 1 euro,we got train most days to various towns along the coast.Trains very efficient,& amazing views.Hotel a fair walk from old town,but near to promenade where there were restaurants/bars available.The breakfast as previously commented on was superb! The bread so fresh! Everything you could wish for,bread,brioche,croissants,yoghurts,charcuterie,cheese,fresh fruit,orange juice,coffee,various jams,beautifully presented in delightful garden.If you don't mind a walk to old town etc,would recommend.", "title": "Great room,superb breakfast!", "helpfulness": 4, "user": "egremont", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 32789910}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed for 2 nights in early June and every aspect was fantastic. We arrived after a rainstorm having had our first driving on the right side of the road experience, but as soon as we stepped inside our stress disappeared.", "title": "Fantastic, welcoming BnB", "helpfulness": 1, "user": "Gingermegs79", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32782902}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Fredrick welcomed us with a drink and told us we had been upgraded to room 3, which was such a pleasant light filled room which was more like a suite with the sunroom attached. We had the breakfast each day and it was amazing - we didn't need lunch either day, the variety was great and so fresh! We chose Les Cygnes based on the reviews and the fact that we needed parking and were so pleased that we did, we could recommend it to everyone.", "title": "The most superb breakfast spread ever seen!!", "helpfulness": 2, "user": "lousin", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31502463}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Thank you Gildas and Lydiane for having us stay in your lovely Guest House. We were travelling with friends from America and had stayed in truely wonderful B & Bs prior to arriving in Nice. I was worried that we would be disappointed but as soon as Gildas had taken us to our rooms and arrived with a tray with welcoming drinks for us all, I knew we would be quite happy and comfortable. Spotlessly clean rooms and bathrooms, quietly tucked away in a small road, 5 minute walk down to the main beach promenade, perfectly situated. Gildas is a wonderful man, was happy to give us maps, advice and the best breakfast I have ever had!! Served in the delightful garden tables were spread with the largest variety you could imagine. Fresh sliced fruit, yogurt, juices, baskets of different breads, pastries, cheese platters, cold meat platters, tea coffee, jams and anything else you could have wanted. The most outstanding breads ever!!", "title": "NICE's little sectret !!", "helpfulness": 1, "user": "ascotsparky", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31378227}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "PROS", "title": "HIDDEN GEM", "helpfulness": 3, "user": "natter1327", "date": "September 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 41979075}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Excellent service by friendly owners.", "title": "Lovely Quiet Location", "helpfulness": 4, "user": "Bisou4U", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39635400}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Very large room, especially by European standards. Large bathroom. Extremely clean.", "title": "Very charming small family run hotel", "helpfulness": 2, "user": "gmbklm", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36409135}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Great air conditioning!! Free Wifi!", "title": "gem of a place", "helpfulness": 1, "user": "jcbyork", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35755858}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Location was good--a 10 minute walk to the beach. The hotel will give you beach towels and mattresses, etc. You can easily catch a bus to the heart of Nice, although we chose to walk on the Promenade--about 20 minutes total.", "title": "Everything was absolutely perfect!", "helpfulness": 2, "user": "Tdriver2008", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34063536}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "variance": {"poor": 5, "average": 6, "very good": 47, "terrible": 5, "excellent": 215}, "aka": "Hotel Les Cygnes", "slim_ranking": 0.00469483568075}